{
	"add": {
		"doc": {
			"id": "09c758a03fc7e3767db55ed02ead373add1ec7ed7dde10d42186864aac1e008b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Weyden-JudiciFinal-closeddreta.jpg/180px-Weyden-JudiciFinal-closeddreta.jpg",
				"previous": "The exterior panels are drab, according to Blum, who writes that on Rolin's panel the most colourful figure is the red angel, which, with its gold helmet and keys, \"emerges like an apparition\".[19] Rolin and de Salins can be identified by the coats-of-arms held by the angels;[1] husband and wife kneel at cloth-covered prie-dieux (portable altars) displaying their emblems. Although De Salins was reputedly pious and charitable, and even perhaps the impetus for the building of the hospice, she is placed on the exterior right,[19] traditionally thought of as an inferior position corresponding to Hell, linking her to Eve, original sin and the Fall of man.[44]",
				"after": "Van Eyck had earlier portrayed Rolin in the c. 1435 Madonna of Chancellor Rolin, and the patron is recognizable from that work; both portraits show similar lips, a large chin and somewhat pointed ears. In van Eyck's portrait, Rolin is presented as perhaps pompous and arrogant; here – ten years later – he appears more thoughtful and concerned with humility.[50][51] Campbell notes wryly that van der Weyden may have been able to disguise the sitter's ugliness and age, and that the unusual shape of his mouth may have been downplayed. He writes that while \"van Eyck impassively recorded, van der Weyden imposed a stylised and highly personal vision of the subject\". Van Eyck's depiction was most likely the more accurate; van der Weyden embellished, mainly by lengthening the nose, enlarging the eyes and raising the eyebrows.[50]",
			"color": "black|0.5968 sienna|0.074185 tan|0.063756 burly|0.040604 wood|0.040604 wheat|0.024378 moccasin|0.021974 pale|0.021735 golden|0.021735 rod|0.021735 lemon|0.020013 chiffon|0.020013 navajo|0.018774 white|0.018774 light|0.016606 golden|0.016606 rod|0.016606 yellow|0.016606 blanched|0.012176 almond|0.012176 corn|0.011158 silk|0.011158 light|0.010943 yellow|0.010943 papaya|0.0098587 whip|0.0098587 bisque|0.0095712 peach|0.0083094 puff|0.0083094 beige|0.0082874 saddle|0.0059057 brown|0.0059057 antique|0.0056513 white|0.0056513  "
		}
	}
}
