{
	"add": {
		"doc": {
			"id": "09cf110f9cf60a0130968d2ef7264b2fb30b136ce78b8a5b31832d92764083bc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Urville-Viti-ship.jpg/205px-Urville-Viti-ship.jpg",
				"previous": "Carving was practiced by the men; carving would be used for items of practical use and simple shapes and design were used. A lot of effort was put into well adorned weapons and items for the home and ceremony, today carving is practiced for its use in tourism and no longer plays a major role in Fijian society and life except in the case of the Tanoa used from drinking Kava.",
				"after": "Canoe Building was another art practiced only by the men, canoes were not only the major form of communication, but were important in all aspects of Fijian society, from the gathering of food and transporting of crops to use in presentation ceremonies and they were instrumental in wars and politics which were rife in Fiji.[9] The art of Canoe building was varied across the group and had several different types but of a similar design, the Camakau was a small twin hulled canoe for fishing or small transportation purposes, the most impressive of Canoes in Fiji were that of the Drua. In Fiji's early history before European involvement, Control of the seaway was a major and decisive objective; disrupting or cutting off the enemies supply and reinforcements gave great advantage in battle and would ensure victory. Sea battles involving hundreds of canoes were frequent. The canoe, which inspired fear and awe and so often held the balance was the mighty Drua. One of the most elaborate and beautiful artifacts of Oceania, the Drua was a product of considerable group efforts and human sacrifice. Double hulled and of gigantic proportions, the Drua was a masterpiece of design and craftsmanship, requiring total community involvement in its construction and human sacrifice in its launching.[10] Its speed out at sea would be in excess of twenty knots and still remained highly manoeuvrable, it was capable of carrying upward of 150 warriors and took some 6 to 7 years to build and would vary in length from 100 feet to 118 feet and have a mast height of 60 to 70 feet, in the mid-19th century the following accounts were recorded:",
			"color": "silver|0.21329 dark|0.20077 gray|0.20077 dark|0.20077 grey|0.20077 light|0.16088 gray|0.16088 light|0.16088 grey|0.16088 gainsboro|0.11112 dim|0.057485 gray|0.057485 dim|0.057485 grey|0.057485 gray|0.050407 grey|0.050407 white|0.022016 smoke|0.022016 alice|0.020637 blue|0.020637 black|0.020629 slate|0.019373 gray|0.019373 light|0.01905 slate|0.01905 gray|0.01905 ghost|0.017678 white|0.017678 azure|0.013479 mint|0.012138 cream|0.012138 white|0.012066 snow|0.011903 lavender|0.0084263 light|0.0077044 cyan|0.0077044 dark|0.0064387 slate|0.0064387 gray|0.0064387 lavender|0.0060054 blush|0.0060054 sea|0.0042783 shell|0.0042783  "
		}
	}
}
