{
	"add": {
		"doc": {
			"id": "09cf959f14aea6ad47ffe1bc3bdeedffaf20f61caf8a29c38c9e0b5b11cc5f97",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Pingora_Peak_and_Lonesome_Lake.jpg/220px-Pingora_Peak_and_Lonesome_Lake.jpg",
				"previous": "For some visitors the greater solitude of the backcountry requires using hiking trails to backpacking or horseback riding into more remote destinations. There are dozens of trails which total over 1,600 mi (2,600 km) located throughout the forest.[37] Many of the trailheads can be accessed at campgrounds, with shorter day hikes available as well.[98] The Continental Divide Trail has a 20-mile (32 km) section which passes through the forest and crosses the Continental Divide at Sheridan Pass.[99] There is also the Nez Perce National Historic Trail and the Beartooth Loop National Recreation Trail, both of which are in the northern regions of the forest.[100][101] Some remote areas can also be accessed by horseback. Trailheads usually provide enough room for horse and pack animal trailers plus personal vehicles.[37] Along forest access roads, all-terrain vehicles (ATV) are allowed, but since wilderness areas do not permit access by way of motorized transport, those who wish to visit such areas usually do so either by hiking in or on horseback.[102][103]",
				"after": "Hunting and fishing are popular recreational activities permitted throughout the forest. Many of the streams and rivers are considered to be \"Blue Ribbon Trout Streams\".[104] Though many streams and lakes have excellent opportunities to catch various species of trout, the north and south forks of the Shoshone River, the Greybull River and the Clark's Fork of the Yellowstone, the only federally designated Wild and Scenic River in Wyoming, are a few of the better locations to reign in a trophy level Rainbow or Yellowstone cutthroat trout.[104] 1,000 miles (1,600 km) of streams and a hundred lakes that can be legally fished from provide plenty of elbow room during even the most crowded of fishing seasons. Hunting and fishing licenses are sponsored by the state of Wyoming and are available through the Wyoming Game and Fish Department.[105]",
			"color": "black|0.66996 dim|0.084825 gray|0.084825 dim|0.084825 grey|0.084825 dark|0.075336 gray|0.075336 dark|0.075336 grey|0.075336 gray|0.067417 grey|0.067417 slate|0.027408 gray|0.027408 silver|0.026397 light|0.024087 slate|0.024087 gray|0.024087 light|0.0099265 gray|0.0099265 light|0.0099265 grey|0.0099265 gainsboro|0.0054711  "
		}
	}
}
