{
	"add": {
		"doc": {
			"id": "09e0d1f71c26d524e43500588f85611b32a4110373571863c41411550184d625",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Buccaneers01.jpg/220px-Buccaneers01.jpg",
				"previous": "In the 2005 season, the Buccaneers celebrated their 30th season in the league, and returned to their winning ways. The Bucs selected Carnell \"Cadillac\" Williams in the first round of the 2005 draft, and the rookie would provide a running game the Buccaneers had not possessed since the days of James Wilder in the 1980s. Williams would later go on to receive the NFL Offensive Rookie of the Year Award. After starting 5–1, the team entered a midseason slump hampered by a season-ending injury to starting QB Brian Griese. Replacement starter Chris Simms struggled early, but came into his own, leading the team to a last-minute win over the Redskins. The Bucs won the NFC South Division finishing 11–5. The season ended abruptly, however, with a 17–10 loss in the Wild Card round, in a rematch with the Redskins.",
				"after": "After winning the division in 2005, the Bucs suffered through an abysmal 2006 season. The season was plagued by injuries, with starters such as guard Dan Buenning, wide receiver Michael Clayton, running back Cadillac Williams, defensive end Simeon Rice, cornerback Brian Kelly, and quarterback Chris Simms all being placed on injured reserve at some point in the season. The season also saw a lot of rookies starting for the Bucs, such as quarterback Bruce Gradkowski, tackle Jeremy Trueblood, and guard Davin Joseph.",
			"color": "gray|0.25792 grey|0.25792 dim|0.18183 gray|0.18183 dim|0.18183 grey|0.18183 rosy|0.14397 brown|0.14397 dark|0.13664 gray|0.13664 dark|0.13664 grey|0.13664 olive|0.072127 drab|0.072127 dark|0.055368 olive|0.055368 green|0.055368 silver|0.033124 dark|0.020608 sea|0.020608 green|0.020608 dark|0.016879 slate|0.016879 gray|0.016879 slate|0.016502 gray|0.016502 light|0.014043 slate|0.014043 gray|0.014043 black|0.011868  "
		}
	}
}
