{
	"add": {
		"doc": {
			"id": "09e1457735b0d8439c5a679da3d57fd5d0815c820b237cee7e557c93fb759054",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Daimonin_Stoneglow_beta4.png/220px-Daimonin_Stoneglow_beta4.png",
				"previous": "Though many of the original RPGs for the PLATO mainframe system in the late 1970s also supported multiple, simultaneous players,[152] the popularity of multiplayer modes in mainstream RPGs did not begin to rise sharply until the early to mid-1990s.[citation needed] For instance, Secret of Mana (1993), an early action role-playing game by Square, was one of the first commercial RPGs to feature cooperative multiplayer gameplay, offering two-player and three-player action once the main character had acquired his party members.[153][154] Later, Diablo (1996) would combine CRPG and action game elements with an Internet multiplayer mode that allowed up to four players to enter the same world and fight monsters, trade items, or fight against each other.",
				"after": "Also during this time period, the MUD genre that had been spawned by MUD1 in 1978 was undergoing a tremendous expansion phase due to the release and spread of LPMud (1989) and DikuMUD (1991). Soon, driven by the mainstream adoption of the Internet, these parallel trends merged in the popularization of graphical MUDs, which would soon become known as massively multiplayer online role-playing games or MMORPGs,[155][156] beginning with games like Meridian 59 (1995), Nexus: The Kingdom of the Winds (1996), Ultima Online (1997), Lineage (1998), and EverQuest (1999), and leading to modern phenomena such as RuneScape (2001), Final Fantasy XI (2003), Eve Online (2003) and World of Warcraft (2004).",
			"color": "black|0.57236 gray|0.17717 grey|0.17717 dim|0.073696 gray|0.073696 dim|0.073696 grey|0.073696 dark|0.048341 green|0.048341 dark|0.044097 gray|0.044097 dark|0.044097 grey|0.044097 silver|0.032546 dark|0.00956 olive|0.00956 green|0.00956 green|0.0079545 forest|0.0067961 green|0.0067961  "
		}
	}
}
