{
	"add": {
		"doc": {
			"id": "0a02cd5f50008b1616883480315a6a80f7ca04fa6ddec0fdb7341e5b6be57758",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Biogeographic_timetable_of_Madagascar_-_journal.pone.0062086.g003.png/170px-Biogeographic_timetable_of_Madagascar_-_journal.pone.0062086.g003.png",
				"previous": "Madagascar's highest peaks rise from three prominent highland massifs: Maromokotro 2,876 m (9,436 ft) in the Tsaratanana Massif is the island's highest point, followed by Boby Peak 2,658 m (8,720 ft) in the Andringitra Massif, and Tsiafajavona 2,643 m (8,671 ft) in the Ankaratra Massif. To the east, the Canal des Pangalanes is a chain of man-made and natural lakes connected by canals built by the French just inland from the east coast and running parallel to it for some 600 km (370 mi). The western and southern sides, which lie in the rain shadow of the central highlands, are home to dry deciduous forests, spiny forests, and deserts and xeric shrublands. Due to their lower population densities, Madagascar's dry deciduous forests have been better preserved than the eastern rain forests or the original woodlands of the central plateau. The western coast features many protected harbors, but silting is a major problem caused by sediment from the high levels of inland erosion carried by rivers crossing the broad western plains.[16]",
				"after": "The combination of southeastern trade winds and northwestern monsoons produces a hot rainy season (November–April) with frequently destructive cyclones, and a relatively cooler dry season (May–October). Rain clouds originating over the Indian Ocean discharge much of their moisture over the island's eastern coast; the heavy precipitation supports the area's rain forest ecosystem. The central highlands are both drier and cooler while the west is drier still, and a semi-arid climate prevails in the southwest and southern interior of the island.[15] Tropical cyclones annually cause damage to infrastructure and local economies as well as loss of life.[17] In 2004 Cyclone Gafilo became the strongest cyclone ever recorded to hit Madagascar. The storm killed 172 people, left 214,260 homeless[18] and caused more than US$250 million in damage.[19]",
			"color": "white|0.087247 smoke|0.087247 sea|0.078511 shell|0.078511 snow|0.078019 ghost|0.07791 white|0.07791 alice|0.077674 blue|0.077674 white|0.07654 floral|0.075148 white|0.075148 lavender|0.074796 blush|0.074796 mint|0.074495 cream|0.074495 azure|0.070882 silver|0.046438 light|0.043614 gray|0.043614 light|0.043614 grey|0.043614 dark|0.04276 gray|0.04276 dark|0.04276 grey|0.04276 gainsboro|0.038399 linen|0.011734 gray|0.010925 grey|0.010925 dim|0.0067824 gray|0.0067824 dim|0.0067824 grey|0.0067824 yellow|0.004301 green|0.004301 ivory|0.0034713  "
		}
	}
}
