{
	"add": {
		"doc": {
			"id": "0a061c9c096154f1a636096ea2c2397154937092cb51571f8cd17aa1f50fefb4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Common-Avian-Infection-Plagued-the-Tyrant-Dinosaurs-pone.0007288.g002.jpg/220px-Common-Avian-Infection-Plagued-the-Tyrant-Dinosaurs-pone.0007288.g002.jpg",
				"previous": "All known Daspletosaurus fossils have been found in formations dating to the middle to late Campanian stage of the Late Cretaceous Period, between 77 and 74 million years ago. Since the middle of the Cretaceous, North America had been divided in half by the Western Interior Seaway, with much of Montana and Alberta below the surface. However, the uplift of the Rocky Mountains in the Laramide Orogeny to the west, which began during the time of Daspletosaurus, forced the seaway to retreat eastwards and southwards. Rivers flowed down from the mountains and drained into the seaway, carrying sediment along with them that formed the Two Medicine Formation, the Judith River Group, and other sedimentary formations in the region. About 73 million years ago, the seaway began to advance westwards and northwards again, and the entire region was covered by the Bearpaw Sea, represented throughout the western United States and Canada by the massive Bearpaw Shale.[34][35][36]",
				"after": "Daspletosaurus lived in a vast floodplain along the western shore of the interior seaway. Large rivers watered the land, occasionally flooding and blanketing the region with new sediment. When water was plentiful, the region could support a great deal of plant and animal life, but periodic droughts also struck the region, resulting in mass mortality as preserved in the many bonebed deposits found in Two Medicine and Judith River sediments, including the Daspletosaurus bonebed.[37] Similar conditions exist today in East Africa.[38] Volcanic eruptions from the west periodically blanketed the region with ash, also resulting in large-scale mortality, while simultaneously enriching the soil for future plant growth. It is these ash beds that allow precise radiometric dating as well. Fluctuating sea levels also resulted in a variety of other environments at different times and places within the Judith River Group, including offshore and nearshore marine habitats, coastal wetlands, deltas and lagoons, in addition to the inland floodplains.[35] The Two Medicine Formation was deposited at higher elevations farther inland than the other two formations.[36]",
			"color": "gray|0.12773 grey|0.12773 dim|0.10549 gray|0.10549 dim|0.10549 grey|0.10549 dark|0.096974 gray|0.096974 dark|0.096974 grey|0.096974 rosy|0.096777 brown|0.096777 tan|0.064599 silver|0.059067 black|0.045347 light|0.043571 gray|0.043571 light|0.043571 grey|0.043571 gainsboro|0.035574 white|0.023653 smoke|0.023653 light|0.020817 coral|0.020817 sea|0.018438 shell|0.018438 snow|0.018085 peru|0.017143 white|0.016453 ghost|0.016204 white|0.016204 alice|0.016104 blue|0.016104 floral|0.015749 white|0.015749 mint|0.015198 cream|0.015198 burly|0.013788 wood|0.013788 linen|0.013275 sienna|0.012048 lavender|0.011938 blush|0.011938 azure|0.011904 salmon|0.0092827 sandy|0.0082556 brown|0.0082556  "
		}
	}
}
