{
	"add": {
		"doc": {
			"id": "0a1b72585a848e5c93bda4d855de4df9526e431fe92656a6699440259157e8db",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Bufobufotadpoles.jpg/800px-Bufobufotadpoles.jpg",
				"previous": "Frog larvae are known as tadpoles and typically have oval bodies and long, vertically flattened tails with fins. The free-living larvae are normally fully aquatic, but the tadpoles of some species such as (Nannophrys ceylonensis) are semi-terrestrial and live among wet rocks.[79] Tadpoles have cartilaginous skeletons, gills for respiration (external gills at first, internal gills later), lateral line systems and large tails that they use for swimming.[80] Newly hatched tadpoles soon develop gill pouches that cover the gills. The lungs develop early and are used as accessory breathing organs, the tadpoles rising to the water surface to gulp air. Some species complete their development inside the egg and hatch directly into small frogs. These larvae do not have gills but instead have specialised areas of skin through which respiration takes place. While tadpoles do not have true teeth, in most species, the jaws have long, parallel rows of small keratinized structures called keradonts surrounded by a horny beak.[81] Front legs are formed under the gill sac and hind legs become visible a few days later. Tadpoles are typically herbivorous, feeding mostly on algae, including diatoms filtered from the water through the gills. They are also detritivores, stirring up the sediment at the pond bottom and ingesting edible fragments. They have a relatively long, spiral-shaped gut to enable them to digest this diet.[82] Some species are carnivorous at the tadpole stage, eating insects, smaller tadpoles and fish. Young of the Cuban tree frog (Osteopilus septentrionalis) can occasionally be cannibalistic, the younger tadpoles attacking a larger, more developed tadpole when it is undergoing metamorphosis.[83]",
				"after": "At metamorphosis, rapid changes in the body take place as the lifestyle of the frog changes completely. The spiral‐shaped mouth with horny tooth ridges is reabsorbed together with the spiral gut. The animal develops a large jaw, and its gills disappear along with its gill sac. Eyes and legs grow quickly, and a tongue is formed. There are associated changes in the neural networks such as development of stereoscopic vision and loss of the lateral line system. All this can happen in about a day. A few days later, the tail is reabsorbed, due to the higher thyroxine concentration required for this to take place.[82]",
			"color": "black|0.44744 dark|0.082625 gray|0.082625 dark|0.082625 grey|0.082625 dim|0.071265 gray|0.071265 dim|0.071265 grey|0.071265 gray|0.069967 grey|0.069967 silver|0.05659 light|0.030396 gray|0.030396 light|0.030396 grey|0.030396 white|0.022533 smoke|0.022533 alice|0.021958 blue|0.021958 ghost|0.021944 white|0.021944 sea|0.02191 shell|0.02191 snow|0.021906 white|0.021805 lavender|0.021773 blush|0.021773 mint|0.021704 cream|0.021704 floral|0.021562 white|0.021562 azure|0.02141 gainsboro|0.01977  "
		}
	}
}
