{
	"add": {
		"doc": {
			"id": "0a20e4285965468360f0d8f7004db695640bab4430af8e884b3b4fcf89dfb602",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Adult_Cane_toad.jpg/220px-Adult_Cane_toad.jpg",
			"previous": [],
				"after": "Amphibians have soft bodies with thin skins, and lack claws, defensive armour, or spines. Nevertheless they have evolved various defence mechanisms to keep themselves alive. The first line of defence in salamanders and frogs is the mucous secretion that they produce. This keeps their skin moist and makes them slippery and difficult to grip. The secretion is often sticky and distasteful or toxic.[122] Snakes have been observed yawning and gaping when trying to swallow African clawed frogs (Xenopus laevis), which gives the frogs an opportunity to escape.[122][123] Caecilians have been little studied in this respect, but the Cayenne caecilian (Typhlonectes compressicauda) produces toxic mucus that has killed predatory fish in a feeding experiment in Brazil.[124] In some salamanders, the skin is poisonous. The rough-skinned newt (Taricha granulosa) from North America and other members of its genus contain the neurotoxin tetrodotoxin (TTX), the most toxic non-protein substance known and almost identical to that produced by pufferfish. Handling the newts does not cause harm, but ingestion of even the most minute amounts of the skin is deadly. In feeding trials, fish, frogs, reptiles, birds and mammals were all found to be susceptible.[125][126] The only predators with some tolerance to the poison are certain populations of common garter snake (Thamnophis sirtalis). In locations where both snake and salamander co-exist, the snakes have developed immunity through genetic changes and they feed on the amphibians with impunity.[127] Coevolution occurs with the newt increasing its toxic capabilities at the same rate as the snake further develops its immunity.[126] Some frogs and toads are toxic, the main poison glands being at the side of the neck and under the warts on the back. These regions are presented to the attacking animal and their secretions may be foul-tasting or cause various physical or neurological symptoms. Altogether, over 200 toxins have been isolated from the limited number of amphibian species that have been investigated.[128]",
			"color": "tan|0.40473 burly|0.12156 wood|0.12156 dark|0.076917 gray|0.076917 dark|0.076917 grey|0.076917 peach|0.07442 puff|0.07442 silver|0.040497 bisque|0.036408 wheat|0.029534 peru|0.022471 navajo|0.018762 white|0.018762 saddle|0.018126 brown|0.018126 blanched|0.018011 almond|0.018011 light|0.015539 gray|0.015539 light|0.015539 grey|0.015539 antique|0.014203 white|0.014203 gray|0.013882 grey|0.013882 moccasin|0.01294  "
		}
	}
}
