{
	"add": {
		"doc": {
			"id": "0a259f52e92e016b0d08f54bead209d94371da1aa6955d50ccb1024453fb6498",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/John_Paul_II_1980_cropped.JPG/150px-John_Paul_II_1980_cropped.JPG",
			"previous": [],
				"after": "As pope, John Paul II wrote 14 papal encyclicals and taught about sexuality in what is referred as the \"Theology of the Body\". Some key elements of his strategy to \"reposition the Catholic Church\" were encyclicals such as Ecclesia de Eucharistia, Reconciliatio et paenitentia and Redemptoris Mater. In his At the beginning of the new millennium (Novo Millennio Ineunte), he emphasised the importance of \"starting afresh from Christ\": \"No, we shall not be saved by a formula but by a Person.\" In The Splendour of the Truth (Veritatis Splendor), he emphasised the dependence of man on God and His Law (\"Without the Creator, the creature disappears\") and the \"dependence of freedom on the truth\". He warned that man \"giving himself over to relativism and scepticism, goes off in search of an illusory freedom apart from truth itself\". In Fides et Ratio (On the Relationship between Faith and Reason) John Paul promoted a renewed interest in philosophy and an autonomous pursuit of truth in theological matters. Drawing on many different sources (such as Thomism), he described the mutually supporting relationship between faith and reason, and emphasised that theologians should focus on that relationship. John Paul II wrote extensively about workers and the social doctrine of the Church, which he discussed in three encyclicals: Laborem exercens, Sollicitudo rei socialis, and Centesimus annus. Through his encyclicals and many Apostolic Letters and Exhortations, John Paul II talked about the dignity of women and the importance of the family for the future of humanity.[65] Other encyclicals include The Gospel of Life (Evangelium Vitae) and Ut Unum Sint (That They May Be One). Though critics accused him of inflexibility in explicitly re-asserting Catholic moral teachings against abortion and euthanasia that have been in place for well over a thousand years, he urged a more nuanced view of capital punishment.[65] In his second encyclical Dives in misericordia he stressed that divine mercy is the greatest feature of God, needed especially in modern times.",
			"color": "gainsboro|0.10013 white|0.081228 smoke|0.081228 linen|0.080276 sea|0.077668 shell|0.077668 light|0.072609 gray|0.072609 light|0.072609 grey|0.072609 snow|0.070828 white|0.062709 ghost|0.062017 white|0.062017 alice|0.059694 blue|0.059694 mint|0.057403 cream|0.057403 lavender|0.054887 blush|0.054887 floral|0.047875 white|0.047875 silver|0.032097 old|0.019715 lace|0.019715 tan|0.015542 azure|0.014616 antique|0.014531 white|0.014531 dark|0.01188 gray|0.01188 dark|0.01188 grey|0.01188 peach|0.011546 puff|0.011546 ivory|0.0080864 rosy|0.0054763 brown|0.0054763 gray|0.0049201 grey|0.0049201 misty|0.0048304 rose|0.0048304 beige|0.004675 burly|0.0036889 wood|0.0036889 dim|0.0035083 gray|0.0035083 dim|0.0035083 grey|0.0035083  "
		}
	}
}
