{
	"add": {
		"doc": {
			"id": "0a3451150cc678a079d3cc7d0e2fc8b52d1ed41f42029cb1cacbed4b20194ec0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/JohnKerry.jpg/220px-JohnKerry.jpg",
				"previous": "On April 18, 1985, a few months after taking his Senate seat, Kerry and Senator Tom Harkin of Iowa traveled to Nicaragua and met the country's president, Daniel Ortega. Though Ortega had won internationally certified elections, the trip was criticized because Ortega and his leftist Sandinista government had strong ties to Cuba and the USSR and were accused of human rights abuses. The Sandinista government was opposed by the right-wing CIA-backed rebels known as the Contras. While in Nicaragua, Kerry and Harkin talked to people on both sides of the conflict. Through the senators, Ortega offered a cease-fire agreement in exchange for the US dropping support of the Contras. The offer was denounced by the Reagan administration as a \"propaganda initiative\" designed to influence a House vote on a $14 million Contra aid package, but Kerry said \"I am willing..... to take the risk in the effort to put to test the good faith of the Sandinistas.\" The House voted down the Contra aid, but Ortega flew to Moscow to accept a $200 million loan the next day, which in part prompted the House to pass a larger $27 million aid package six weeks later.[76]",
				"after": "Meanwhile, Kerry's staff began their own investigations and, on October 14, issued a report that exposed illegal activities on the part of Lieutenant Colonel Oliver North, who had set up a private network involving the National Security Council and the CIA to deliver military equipment to right-wing Nicaraguan rebels (Contras). In effect, North and certain members of the President's administration were accused by Kerry's report of illegally funding and supplying armed militants without the authorization of Congress. Kerry's staff investigation, based on a year-long inquiry and interviews with fifty unnamed sources, is said to raise \"serious questions about whether the United States has abided by the law in its handling of the contras over the past three years.\"[77]",
			"color": "rosy|0.29848 brown|0.29848 dark|0.052953 gray|0.052953 dark|0.052953 grey|0.052953 light|0.051991 gray|0.051991 light|0.051991 grey|0.051991 gainsboro|0.051618 silver|0.043613 black|0.041405 lavender|0.037697 blush|0.037697 white|0.037495 smoke|0.037495 ghost|0.03169 white|0.03169 gray|0.031577 grey|0.031577 snow|0.030948 sea|0.030574 shell|0.030574 linen|0.027551 dim|0.027139 gray|0.027139 dim|0.027139 grey|0.027139 alice|0.023469 blue|0.023469 white|0.023163 crimson|0.023142 misty|0.020803 rose|0.020803 floral|0.020689 white|0.020689  "
		}
	}
}
