{
	"add": {
		"doc": {
			"id": "0a56316064b73c2b2705e4cd1e2fb67cd310c6e176037d10c8f89e64f6747dfe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Building_of_Public_television_of_Kosovo_%2C_Kohavision_and_Radio_Kosova.JPG/220px-Building_of_Public_television_of_Kosovo_%2C_Kohavision_and_Radio_Kosova.JPG",
				"previous": "Pristina had always a development in trading due to its position of the Balkan trade routes. Fairs in Pristina started since the medieval period, at the time when it was famous for its annual trade fairs and its goat hide and goat hair articles. Despite that fact Pristina, or Kosovo in general is not known for occurrence of fairs. With the development of culture and especially after the last war in 1999, Pristina had a progress on holding these kinds of events. Every year various types of trade fairs take place in the capital city. The essence of these fairs is usually temporary; some last only an afternoon while others may last around 3 days, a week or even longer. They have grown in size and importance over the years. These fairs are organized annually and are open to trade visitors and public. The number of exhibitors and visitors is usually very high.",
				"after": "The media in Pristina include some of the most important newspapers, largest publishing houses and most prolific television studio of Kosovo .Pristina is the largest communications center of media in Kosovo. Almost all of the major media organizations in Kosovo are based in Pristina.[99]",
			"color": "gray|0.28334 grey|0.28334 slate|0.085432 gray|0.085432 black|0.070365 dim|0.061063 gray|0.061063 dim|0.061063 grey|0.061063 dark|0.05649 gray|0.05649 dark|0.05649 grey|0.05649 light|0.047163 slate|0.047163 gray|0.047163 silver|0.046564 wheat|0.037625 light|0.036779 gray|0.036779 light|0.036779 grey|0.036779 light|0.027862 steel|0.027862 blue|0.027862 gainsboro|0.027665 tan|0.022023 antique|0.018749 white|0.018749 bisque|0.016718 beige|0.015729 blanched|0.01544 almond|0.01544 papaya|0.011754 whip|0.011754 moccasin|0.0092663 linen|0.0091074 peach|0.007419 puff|0.007419 old|0.0073377 lace|0.0073377 corn|0.0068608 silk|0.0068608 honeydew|0.0067921 steel|0.0052589 blue|0.0052589 light|0.0048515 blue|0.0048515  "
		}
	}
}
