{
	"add": {
		"doc": {
			"id": "0a5b473ffbc6a1c2a05f6429ec5b89d5b426e53136eaa4ddbad9f3bd37a2c9dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Passer_montanus_050526.jpg/220px-Passer_montanus_050526.jpg",
				"previous": "The male calls from near the nest site in spring to proclaim ownership and attract a mate. He may also carry nest material into the nest hole.[5] The display and nest building is repeated in autumn. The preferred locations for the autumn display are old Eurasian tree sparrow nests, particularly those where nestlings had hatched. Empty nest boxes, and sites used by house sparrows or other hole nesting birds, such as tits, pied flycatchers or common redstarts, are rarely used for the autumn display.[36]",
				"after": "The untidy nest is composed of hay, grass, wool or other material and lined with feathers,[30] which improve the thermal insulation.[37] A complete nest consists of three layers; base, lining and dome.[36] The typical clutch is five or six eggs (rarely more than four in Malaysia),[31] white to pale grey and heavily marked with spots, small blotches, or speckling;[38] they are 20 x 14 mm (0.8 x 0.6 in) in size and weigh 2.1 g (0.08 oz), of which 7% is shell.[3] The eggs are incubated by both parents for 12–13 days before the altricial, naked chicks hatch, and a further 15–18 days elapse before they fledge. Two or three broods may be raised each year;[3] birds breeding in colonies produce more eggs and fledglings from their first broods than solitary pairs, but the reverse is true for second and third clutches.[39] Females which copulate frequently tend to lay more eggs and have a shorter incubation time, so within-pair mating may be an indicator of the pairs' reproductive ability.[40] There is a significant level of promiscuity; in a Hungarian study, more than 9% of chicks were sired by extra-pair males, and 20% of the broods contained at least one extra-pair young.[41]",
			"color": "black|0.16584 light|0.14275 steel|0.14275 blue|0.14275 light|0.081154 gray|0.081154 light|0.081154 grey|0.081154 silver|0.075761 dark|0.070936 olive|0.070936 green|0.070936 gainsboro|0.06483 dark|0.061228 gray|0.061228 dark|0.061228 grey|0.061228 dim|0.06098 gray|0.06098 dim|0.06098 grey|0.06098 gray|0.04174 grey|0.04174 linen|0.033584 old|0.022644 lace|0.022644 sea|0.021511 shell|0.021511 antique|0.020662 white|0.020662 white|0.019561 smoke|0.019561 floral|0.018704 white|0.018704 light|0.012699 slate|0.012699 gray|0.012699 snow|0.012574 ivory|0.01148 mint|0.011094 cream|0.011094 slate|0.010317 gray|0.010317 dark|0.0075517 slate|0.0075517 gray|0.0075517 white|0.0074428  "
		}
	}
}
