{
	"add": {
		"doc": {
			"id": "0a5c9438e969eaf80fa0195fc69a06d4e3487ddb6ec545efe055d4701c65db5a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Austin_Metrorail.jpg/220px-Austin_Metrorail.jpg",
			"previous": [],
				"after": "Capital Metropolitan Transportation Authority Capital Metro provides public transportation to the city, primarily by bus. Capital Metro is planning to change some routes to \"Rapid Lines.\" The lines will feature 60 ft (18 m) long, train-like, high-tech buses. This addition is going to be implemented to help reduce congestion. Capital Metro opened a 32-mile (51 km) commuter rail system known as Capital MetroRail on March 22, 2010.[188] The system was built on existing freight rail lines and serves downtown Austin, East Austin, North Central Austin, Northwest Austin, and Leander in its first phase. Future expansion could include a line to Manor and another to Round Rock. Capital Metro is also looking into a light rail system to connect most of Downtown, the University of Texas at Austin, and the 700-acre (2.8 km2) Mueller Airport Redevelopment. The light rail system would help connect the MetroRail line to key destinations in Central Austin. On August 7, 2014, the Austin City Council unanimously voted to place a $600 million light rail bond proposal on the November 4, 2014 ballot.[189] Implementation of this package is contingent on matching funding from Federal transit grants. If Federal funding is available, then Austin would begin construction of a light rail line that would run from Riverside Drive to the Highland Austin Community College Campus. An Amtrak Texas Eagle station is located west of downtown. Segments of the Amtrak route between Austin and San Antonio are under evaluation for a future regional passenger rail corridor as an alternative to the traffic congestion of Interstate 35. This is a multi jurisdictional project called Lone Star Rail. Austin is also home to Car2Go, a carsharing program. Austin was chosen as the first city in the western hemisphere to host this company's business, which is based in Germany.",
			"color": "dim|0.25359 gray|0.25359 dim|0.25359 grey|0.25359 black|0.23946 gray|0.16792 grey|0.16792 dark|0.068881 gray|0.068881 dark|0.068881 grey|0.068881 slate|0.059892 gray|0.059892 light|0.043774 slate|0.043774 gray|0.043774 tan|0.035254 light|0.027029 steel|0.027029 blue|0.027029 silver|0.016945 rosy|0.0090054 brown|0.0090054 light|0.0078597 gray|0.0078597 light|0.0078597 grey|0.0078597  "
		}
	}
}
