{
	"add": {
		"doc": {
			"id": "0a5de8a4da05da15d56986a147df96ce5706fe8df95e3e8f0149f0d074017147",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Eight_founding_schools.png/400px-Eight_founding_schools.png",
			"previous": [],
				"after": "The history of thermodynamics as a scientific discipline generally begins with Otto von Guericke who, in 1650, built and designed the world's first vacuum pump and demonstrated a vacuum using his Magdeburg hemispheres. Guericke was driven to make a vacuum in order to disprove Aristotle's long-held supposition that 'nature abhors a vacuum'. Shortly after Guericke, the physicist and chemist Robert Boyle had learned of Guericke's designs and, in 1656, in coordination with the scientist Robert Hooke, built an air pump.[35] Using this pump, Boyle and Hooke noticed a correlation between pressure, temperature, and volume. In time, they formulated Boyle's Law, which states that for a gas at constant temperature, its pressure and volume are inversely proportional. In 1679, based on these concepts, an associate of Boyle's named Denis Papin built a steam digester, which was a closed vessel with a tightly fitting lid that confined steam until a high pressure was generated. Later designs implemented a steam release valve that kept the machine from exploding. By watching the valve rhythmically move up and down, Papin conceived of the idea of a piston and a cylinder engine. He did not, however, follow through with his design. Nevertheless, in 1697, based on Papin's designs, the engineer Thomas Savery built the first engine, followed by Thomas Newcomen in 1712. Although these early engines were crude and inefficient, they attracted the attention of the leading scientists of the time.",
			"color": "dark|0.16588 gray|0.16588 dark|0.16588 grey|0.16588 silver|0.11281 dim|0.10382 gray|0.10382 dim|0.10382 grey|0.10382 black|0.092425 gray|0.090615 grey|0.090615 light|0.067932 gray|0.067932 light|0.067932 grey|0.067932 gainsboro|0.054463 tan|0.048514 white|0.027616 smoke|0.027616 alice|0.023019 blue|0.023019 ghost|0.022833 white|0.022833 sea|0.022705 shell|0.022705 snow|0.022368 lavender|0.021911 blush|0.021911 white|0.020679 mint|0.018507 cream|0.018507 floral|0.015493 white|0.015493 azure|0.013792 linen|0.010877 bisque|0.010115 antique|0.0076366 white|0.0076366 blanched|0.006574 almond|0.006574 burly|0.0045363 wood|0.0045363  "
		}
	}
}
