{
	"add": {
		"doc": {
			"id": "0a66f08921415b03d6c3f805e97a26a0ef5ff96b2f9a90a1dcfb7a95e0661b77",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/BigReichenbach.JPG/220px-BigReichenbach.JPG",
				"previous": "In 1971, the collecting policy switched to the decorative arts, with the purchase of a large number of pieces from the Handley-Read Collection. The Cecil Higgins Art Gallery now holds over 200 pieces from the collection of Charles Handley-Read and his wife Lavinia. Charles applied, in 1950, for a post at the Tate, after being rejected he reacted by ‘making a small museum of my own’. They began to form a collection of Victorian work at a time when few scholars and collectors took the period seriously, sometimes tracing the descendants of the architects and designers and buying directly from them. After initially making modest additions to his collection, a number of inheritances in 1964-5 meant that he could accelerate his buying. The 1972 Royal Academy exhibition Victorian and Edwardian Decorative Art, The Handley-Read Collection displayed Charles and Lavinia's entire collection, and acted as their memorial following their suicides in October and December 1971.",
				"after": "From 1988, the focus returned to collecting prints, this time concentrating on the 20th century. The print collection now numbers over 400 pieces, including work by some of the finest British artists as well as internationally renowned figures such as Picasso, Lichtenstein and Dürer. The collection charts styles as well as print processes, from Whistler’s delicate etchings to Edward Bawden’s magnificent linocuts. The last major addition to the print collection was a generous donation in 2004 from the Scottish artist Alan Davie (1920–2014) of over 70 prints, as well as 5 works in gouache.",
			"color": "burly|0.39935 wood|0.39935 tan|0.30494 sienna|0.063069 navajo|0.044866 white|0.044866 wheat|0.031297 peach|0.027784 puff|0.027784 peru|0.026626 sandy|0.021913 brown|0.021913 moccasin|0.02116 dark|0.01453 salmon|0.01453 saddle|0.013588 brown|0.013588  "
		}
	}
}
