{
	"add": {
		"doc": {
			"id": "0a9e2bd1fcc7875948627b036eca9aa68b4a27833c8a666f296e165f57fb49e0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Gudauri_Georgia_Panorama_P.Liparteliani.jpg/220px-Gudauri_Georgia_Panorama_P.Liparteliani.jpg",
				"previous": "The 2006 ban on imports of Georgian wine to Russia, one of Georgia's biggest trading partners, and break of financial links was described by the IMF Mission as an \"external shock\".[145] In addition, Russia increased the price of gas for Georgia. This was followed by the spike in the Georgian lari's rate of inflation.[citation needed] The National Bank of Georgia stated that the inflation was mainly triggered by external reasons, including Russia’s economic embargo.[146] The Georgian authorities expected that the current account deficit due to the embargo in 2007 would be financed by \"higher foreign exchange proceeds generated by the large inflow of foreign direct investment\" and an increase in tourist revenues.[147] The country has also maintained a solid credit in international market securities.[148] Georgia is becoming more integrated into the global trading network: its 2006 imports and exports account for 10% and 18% of GDP respectively.[142] Georgia's main imports are natural gas, oil products, machinery and parts, and transport equipment.",
				"after": "Tourism is an increasingly significant part of the Georgian economy. About a million tourists brought US$313 million to the country in 2006.[149] According to the government, there are 103 resorts in different climatic zones in Georgia. Tourist attractions include more than 2000 mineral springs, over 12,000 historical and cultural monuments, four of which are recognised as UNESCO World Heritage Sites (Bagrati Cathedral in Kutaisi and Gelati Monastery, historical monuments of Mtskheta, and Upper Svaneti).[150]",
			"color": "dark|0.47414 gray|0.47414 dark|0.47414 grey|0.47414 light|0.15271 slate|0.15271 gray|0.15271 silver|0.12968 slate|0.096652 gray|0.096652 light|0.042317 steel|0.042317 blue|0.042317 gray|0.027878 grey|0.027878 steel|0.023836 blue|0.023836 dim|0.023775 gray|0.023775 dim|0.023775 grey|0.023775 light|0.015466 gray|0.015466 light|0.015466 grey|0.015466 gainsboro|0.0058416  "
		}
	}
}
