{
	"add": {
		"doc": {
			"id": "0aa3b485c36af1ff502d759930e7af08cab6ab181dc014d11789cf805e68aa01",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Maiden_castle_dorset.jpg/300px-Maiden_castle_dorset.jpg",
			"previous": [],
				"after": "Before the hill fort was built, a Neolithic causewayed enclosure was constructed on the site. Dating from around 4000 BC, it was an oval area enclosed by two ditches,[3] It is called a causewayed enclosure because the way the ditches were dug meant that there would originally have been gaps.[4] These gaps, and the bank being only 17 centimetres (6.7 in) high, indicate the site would not have been defensive. Instead the ditches may have been symbolic, separating the interior of the enclosure and its activities from the outside.[5] Archaeologist Niall Sharples, who was involved in excavating the hill fort in the 1980s, has identified the hilltop views of the surrounding landscape as a likely factor for the enclosure's position.[3] Situated on the side of the hill, it would have been visible from several miles away, and when first cut the ditches would have exposed the underlying white chalk and stood out against the green hillside. The interior of the enclosure has been disturbed by later habitation and farming. The site does not appear to have been inhabited, although a grave containing the remains of two children, aged 6–7, has been discovered.[6] The enclosure is the earliest evidence of human activity on the site.[6]",
			"color": "dark|0.22101 olive|0.22101 green|0.22101 light|0.19862 steel|0.19862 blue|0.19862 silver|0.10007 light|0.097792 gray|0.097792 light|0.097792 grey|0.097792 gainsboro|0.076349 gray|0.038094 grey|0.038094 dark|0.036614 gray|0.036614 dark|0.036614 grey|0.036614 dim|0.0358 gray|0.0358 dim|0.0358 grey|0.0358 lavender|0.030334 white|0.023981 smoke|0.023981 alice|0.019621 blue|0.019621 ghost|0.017298 white|0.017298 snow|0.013286 lavender|0.01233 blush|0.01233 sea|0.010973 shell|0.010973 white|0.010167 azure|0.009042 mint|0.0089607 cream|0.0089607 light|0.0081811 blue|0.0081811 floral|0.0076683 white|0.0076683 slate|0.0064647 gray|0.0064647 linen|0.0064018  "
		}
	}
}
