{
	"add": {
		"doc": {
			"id": "0ab7176161c844862fd22ce47183ee6e19f7234eba35616b6bd64a4e80d6803f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Human-eoraptor_size_comparison%28v2%29.png/220px-Human-eoraptor_size_comparison%28v2%29.png",
				"previous": "The tallest and heaviest dinosaur known from good skeletons is Giraffatitan brancai (previously classified as a species of Brachiosaurus). Its remains were discovered in Tanzania between 1907 and 1912. Bones from several similar-sized individuals were incorporated into the skeleton now mounted and on display at the Museum für Naturkunde Berlin;[62] this mount is 12 meters (39 ft) tall and 21.8–22.5 meters (72–74 ft) long,[63][64] and would have belonged to an animal that weighed between 30000 and 60000 kilograms (70000 and 130000 lb). The longest complete dinosaur is the 27-meter (89 ft) long Diplodocus, which was discovered in Wyoming in the United States and displayed in Pittsburgh's Carnegie Natural History Museum in 1907.[65]",
				"after": "There were larger dinosaurs, but knowledge of them is based entirely on a small number of fragmentary fossils. Most of the largest herbivorous specimens on record were all discovered in the 1970s or later, and include the massive Argentinosaurus, which may have weighed 80000 to 100000 kilograms (90 to 110 short tons); some of the longest were the 33.5 meters (110 ft) long Diplodocus hallorum[8] (formerly Seismosaurus) and the 33 meters (108 ft) long Supersaurus;[66] and the tallest, the 18 meters (59 ft) tall Sauroposeidon, which could have reached a sixth-floor window. The heaviest and longest of them all may have been Amphicoelias fragillimus, known only from a now lost partial vertebral neural arch described in 1878. Extrapolating from the illustration of this bone, the animal may have been 58 meters (190 ft) long and weighed over 120000 kg (260000 lb).[8] The largest known carnivorous dinosaur was Spinosaurus, reaching a length of 16 to 18 meters (52 to 60 ft), and weighing in at 8150 kg (18000 lb).[67] Other large carnivorous theropods included Giganotosaurus, Carcharodontosaurus and Tyrannosaurus.[68] Therizinosaurus and Deinocheirus were among the tallest of the theropods.",
			"color": "black|0.93899 dim|0.025662 gray|0.025662 dim|0.025662 grey|0.025662 gray|0.015744 grey|0.015744 dark|0.010013 gray|0.010013 dark|0.010013 grey|0.010013 slate|0.0033477 gray|0.0033477  "
		}
	}
}
