{
	"add": {
		"doc": {
			"id": "0ac8cfbfed58893692faf630fab6515371a5b89062cb492363f29afaf488ce8a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Army_of_Azerbaijan_in_1918.jpg/220px-Army_of_Azerbaijan_in_1918.jpg",
				"previous": "By the beginning of the 20th century almost half of world production was being extracted in Baku.[22] The oil boom contributed to the massive growth of Baku. Between 1856 and 1910 Baku's population grew at a faster rate than that of London, Paris or New York.",
				"after": "In 1917, after the October revolution and amidst the turmoil of World War I and the breakup of the Russian Empire, Baku came under the control of the Baku Commune, which was led by veteran Bolshevik Stepan Shahumyan. Seeking to capitalize on the existing inter-ethnic conflicts, by spring 1918, Bolsheviks inspired and condoned civil warfare in and around Baku. During the infamous March Days, Bolsheviks and Dashnaks seeking to establish control over the Baku streets, were faced with armed Azerbaijani groups. The Azerbaijanis suffered a crushing defeat by the united forces of the Baku Soviet and were massacred by Dashnak teams. An estimated 12.000 Azerbaijanis were killed in their own capital.[23][24] After the massacre, on 28 May 1918, the Azerbaijani faction of the Transcaucasian Sejm proclaimed the independence of the Azerbaijan Democratic Republic (ADR) in Ganja, thereby becoming the first Muslim-majority democratic and secular republic.[25] The newly independent Azerbaijani republic, being unable to defend the independence of the country on their own, asked the Ottoman Empire for military support in accordance with clause 4 of the treaty between the two countries. Shortly after, Azerbaijani forces, with support of the Ottoman Army of Islam led by Nuru Pasha, started their advance into Baku, eventually capturing the city from the loose coalition of Bolsheviks, Esers, Dashnaks, Mensheviks and British forces under the command of General Lionel Dunsterville on 15 September 1918.",
			"color": "black|0.31608 gray|0.092902 grey|0.092902 dark|0.092183 gray|0.092183 dark|0.092183 grey|0.092183 silver|0.078796 dim|0.078077 gray|0.078077 dim|0.078077 grey|0.078077 antique|0.068947 white|0.068947 light|0.050983 gray|0.050983 light|0.050983 grey|0.050983 linen|0.034925  "
		}
	}
}
