{
	"add": {
		"doc": {
			"id": "0ae9c3786eded31e0051e64f4ae1ed7e156ff91c8d60a18afacc3541f89ae441",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Charley_Cypress_Seminole_Everglades.jpg/220px-Charley_Cypress_Seminole_Everglades.jpg",
				"previous": "Following the demise of the Calusa and Tequesta, Native Americans in southern Florida were referred to as \"Spanish Indians\" in the 1740s, probably due to their friendlier relations with Spain. Between the Spanish defeat in the Seven Years' War in 1763 and the end of the American War of Independence in 1783, the United Kingdom ruled Florida. The first known use of the term \"Seminolie\" is from a British Indian agent in a document dated 1771.[40] The beginnings of the tribe are vague, but records show that Creeks invaded the Florida peninsula, conquering and assimilating what was left of pre-Columbian societies into the Creek Confederacy. The mixing of cultures is evident in the language influences present among the Seminoles: various Muskogean languages, notably Hitchiti, and Creek, as well as Timucuan. In the early 19th century, a US Indian agent explained the Seminoles this way: \"The word Seminole means runaway or broken off. Hence ... applicable to all the Indians in the Territory of Florida as all of them ran away ... from the Creek ... Nation\".[41] Linguistically, the term \"Seminole\" comes from the Creek words Sua (Sun God), ma (mother, although in this connotation it is pejorative), and ol (people) to mean \"people whom the Sun God does not love\", or \"accursed\".[42]",
				"after": "Creeks, who were centered in modern-day Alabama and Georgia, were known to incorporate conquered tribes into their own. Some Africans escaping slavery from South Carolina and Georgia fled to Florida, lured by Spanish promises of freedom should they convert to Catholicism, and found their way into the tribe.[43] Seminoles originally settled in the northern portion of the territory, but the 1823 Treaty of Moultrie Creek forced them to live on a 5-million-acre (20,000 km2) reservation north of Lake Okeechobee. They soon ranged farther south, where they numbered approximately 300 in the Everglades region,[44] including bands of Miccosukees—a similar tribe who spoke a different language—who lived in The Big Cypress.[45] Unlike the Calusa and Tequesta, the Seminole depended more on agriculture and raised domesticated animals. They hunted for what they ate, and traded with European-American settlers. They lived in structures called chickees, open-sided palm-thatched huts, probably adapted from the Calusa.[46]",
			"color": " "
		}
	}
}
