{
	"add": {
		"doc": {
			"id": "0b0adad3230202fd6bc0673124bab3612749cd0644af91bb673d70f70ec0a3aa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Stockton_Beach_2014.jpg/220px-Stockton_Beach_2014.jpg",
				"previous": "Newcastle High School student Jason Robertson's 16th birthday party was held on 3 November 1989 at the North Stockton Surf Club, a formerly abandoned building which the Stockton Lions Club had taken over four years prior, leasing it for various functions.[10] Police estimated that about 60 people had attended the party,[6] though figures as high as 100 were reported in the media.[11][12] Most of the attendees were Year Ten students from Newcastle High School,[13] though two 10-year-olds were seen at the party at one point.[14] Many were drinking alcohol and smoking marijuana,[15] and some were having sex.[14] Fourteen-year-old Leigh had a written invitation to attend the party and permission from her mother to stay there until 11 pm;[3] Leigh's mother had been assured that responsible adults would be present at the party.[16] Matthew Webster and Guy Wilson, who acted as bouncers, were the only people aged over 18 at the party.[17] Leigh was said to be very excited, as it was the first teenage party she had attended.[16] According to police witness reports, Leigh was one of several under-age girls who were invited to the party for the purpose of getting them intoxicated and having sex with them.[1] According to a police report, Webster approached another person at the party and said, \"Hey dude, we're going to get Leigh pissed and all go through her.\"[14][18] Leigh was also one of several under-age people for whom an adult purchased alcohol before the party; she and her friend were given a bottle of Jim Beam whiskey, which they then mixed with Coca-Cola.[18] She was reported to have gotten heavily intoxicated very quickly.[14] A 15-year-old boy, who for legal reasons could not be named and was referred to in official documentation as 'NC1', is quoted to have said, \"I'm going to go and fuck [Leigh].\" Shortly afterwards Leigh went to the beach with NC1; witnesses stated Leigh was so intoxicated that he \"had to almost carry her.\"[19]",
				"after": "When Leigh returned from the beach, she was bleeding between her legs, distressed, crying and seeking assistance.[1][20] Some people at the party reported trying to console Leigh and find out what had happened to her;[21] Leigh \"asserted she had been raped\",[22] replying \"[NC1] fucked me\"[19] and \"I hate him\".[11] After witnessing Leigh's complaints, Webster is quoted as saying to a group of boys \"she's a bit of a slut and why don't all of us have a go\".[23] Nineteen-year-old Guy Wilson then approached Leigh, placed his arm around her and asked her for sex.[24] Wilson pushed Leigh to the ground when she refused, and was joined by Webster and around ten other boys who surrounded Leigh. They yelled abuse, kicked her, poured beer on her and spat both beer and saliva on her.[1][14][25] Several people witnessed the assault, yet nobody came to help her[14] or attempted to contact the police, her parents or other adults.[21] The assaults continued for approximately five minutes; Leigh stood up when they stopped and staggered away before picking up an empty beer bottle and throwing it at the group of boys, missing them.[26] Guy Wilson threw a beer bottle back at her as she left, hitting her in the leg.[1][15] The group of boys followed her inside the crowded clubhouse where she sought refuge, and similar assaults continued.[27] Leigh was seen leaving the club and walking towards the beach at about 10:30 pm.[28] Leigh's stepfather arrived at the party to pick her up at 10:50 pm. He and several of the party-goers searched for Leigh, but she could not be found. After repeated search attempts, Leigh's mother and stepfather decided to wait for her to return home, assuming she had gone to a friend's house for the night.[29] Leigh's stepfather recommenced the search for Leigh the following morning, aided by several youths from the party. Her body was found in the sand dunes about 90 metres (300 ft) north of the surf club.[30] Leigh's invitation to attend the party was still in her pocket.[16]",
			"color": "slate|0.19799 gray|0.19799 light|0.16428 slate|0.16428 gray|0.16428 tan|0.10376 dark|0.10348 olive|0.10348 green|0.10348 dark|0.064698 gray|0.064698 dark|0.064698 grey|0.064698 gray|0.050083 grey|0.050083  "
		}
	}
}
