{
	"add": {
		"doc": {
			"id": "0b0e2018ba5425b7cdd1dc60dbbdf59133590695e7b1964fcbbe4b85e7c54752",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/SantaMariaDellaScalaSienaBack.JPG/220px-SantaMariaDellaScalaSienaBack.JPG",
				"previous": "In Europe, Charlemagne decreed that a hospital should be attached to each cathedral and monastery and the historian Geoffrey Blainey likened the activities of the Catholic Church in health care during the Middle Ages to an early version of a welfare state: \"It conducted hospitals for the old and orphanages for the young; hospices for the sick of all ages; places for the lepers; and hostels or inns where pilgrims could buy a cheap bed and meal\". It supplied food to the population during famine and distributed food to the poor. This welfare system the church funded through collecting taxes on a large scale and possessing large farmlands and estates. The Benedictine order was noted for setting up hospitals and infirmaries in their monasteries, growing medical herbs and becoming the chief medical care givers of their districts, as at the great Abbey of Cluny. The Church also established a network of cathedral schools and universities where medicine was studied. The Schola Medica Salernitana in Salerno, looking to the learning of Greek and Arab physicians, grew to be the finest medical school in Medieval Europe.[52]",
				"after": "However, the fourteenth and fifteenth century Black Death devastated both the Middle East and Europe, and it has even been argued that Western Europe was generally more effective in recovering from the pandemic than the Middle East.[53] In the early modern period, important early figures in medicine and anatomy emerged in Europe, including Gabriele Falloppio and William Harvey.",
			"color": "dark|0.16716 gray|0.16716 dark|0.16716 grey|0.16716 gray|0.14072 grey|0.14072 dim|0.12568 gray|0.12568 dim|0.12568 grey|0.12568 black|0.12509 silver|0.10103 tan|0.06458 light|0.0367 gray|0.0367 light|0.0367 grey|0.0367 wheat|0.032331 antique|0.028178 white|0.028178 gainsboro|0.018345 moccasin|0.017553 bisque|0.016581 blanched|0.015599 almond|0.015599 papaya|0.011584 whip|0.011584  "
		}
	}
}
