{
	"add": {
		"doc": {
			"id": "0b106392d8e995c33e8061745374d8a1ef3e64408db97699d9c1d77d245beb5d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Cougar_snow.jpg/220px-Cougar_snow.jpg",
				"previous": "The World Conservation Union (IUCN) currently lists the cougar as a \"least concern\" species. The cougar is regulated under Appendix I of the Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES),[121] rendering illegal international trade in specimens or parts.",
				"after": "In the United States east of the Mississippi River, the only unequivocally known cougar population is the Florida panther. Until 2011, the United States Fish and Wildlife Service (USFWS) recognized both an Eastern cougar (claimed to be a subspecies by some, denied by others)[122][123] and the Florida panther, affording protection under the Endangered Species Act.[124][125] Certain taxonomic authorities have collapsed both designations into the North American cougar, with Eastern or Florida subspecies not recognized,[1] while a subspecies designation remains recognized by some conservation scientists.[38] The most recent documented count for the Florida sub-population is 87 individuals, reported by recovery agencies in 2003.[126] In March 2011, the USFWS declared the Eastern cougar extinct. However, with the taxonomic uncertainty about its existence as a subspecies as well as the possibility of eastward migration of cougars from the western range, the subject remains open.[127]",
			"color": "dim|0.10047 gray|0.10047 dim|0.10047 grey|0.10047 light|0.082927 steel|0.082927 blue|0.082927 tan|0.069012 dark|0.066988 gray|0.066988 dark|0.066988 grey|0.066988 gray|0.061383 grey|0.061383 lavender|0.055882 light|0.044878 gray|0.044878 light|0.044878 grey|0.044878 silver|0.043246 gainsboro|0.040546 white|0.034011 smoke|0.034011 alice|0.033703 blue|0.033703 light|0.033536 slate|0.033536 gray|0.033536 ghost|0.03251 white|0.03251 slate|0.031993 gray|0.031993 snow|0.027614 white|0.024787 steel|0.024281 blue|0.024281 sea|0.023828 shell|0.023828 lavender|0.022258 blush|0.022258 azure|0.021932 mint|0.021494 cream|0.021494 floral|0.019373 white|0.019373 linen|0.013046 antique|0.010217 white|0.010217 old|0.007226 lace|0.007226 peach|0.0064627 puff|0.0064627 ivory|0.0064009 misty|0.0059996 rose|0.0059996  "
		}
	}
}
