{
	"add": {
		"doc": {
			"id": "0b1dee17d95cc78b744aaaec2c29d9ea0dce99579931941c691fc0db2b690a8a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Orion_with_ATV_SM.jpg/220px-Orion_with_ATV_SM.jpg",
				"previous": "For missions beyond low Earth orbit (BLEO), NASA has been directed to develop the Space Launch System (SLS), a Saturn-V class rocket, and the two to six person, beyond low Earth orbit spacecraft, Orion. In February 2010, President Barack Obama's administration proposed eliminating public funds for the Constellation program and shifting greater responsibility of servicing the ISS to private companies.[88] During a speech at the Kennedy Space Center on April 15, 2010, Obama proposed a new heavy-lift vehicle (HLV) to replace the formerly planned Ares V.[89] In his speech, Obama called for a manned mission to an asteroid as soon as 2025, and a manned mission to Mars orbit by the mid-2030s.[89] The NASA Authorization Act of 2010 was passed by Congress and signed into law on October 11, 2010.[90] The act officially canceled the Constellation program.[90]",
				"after": "The Authorization Act required a newly designed HLV be chosen within 90 days of its passing; the launch vehicle was given the name \"Space Launch System\". The new law also required the construction of a beyond low earth orbit spacecraft.[91] The Orion spacecraft, which was being developed as part of the Constellation program, was chosen to fulfill this role.[92] The Space Launch System is planned to launch both Orion and other necessary hardware for missions beyond low Earth orbit.[93] The SLS is to be upgraded over time with more powerful versions. The initial capability of SLS is required to be able to lift 70 mt into LEO. It is then planned to be upgraded to 105 mt and then eventually to 130 mt.[92][94]",
			"color": "light|0.41321 steel|0.41321 blue|0.41321 light|0.15205 slate|0.15205 gray|0.15205 slate|0.11911 gray|0.11911 lavender|0.095588 black|0.047678 dim|0.035288 gray|0.035288 dim|0.035288 grey|0.035288 dark|0.023874 gray|0.023874 dark|0.023874 grey|0.023874 silver|0.018401 gray|0.018125 grey|0.018125 light|0.015326 gray|0.015326 light|0.015326 grey|0.015326 gainsboro|0.012516 alice|0.0075507 blue|0.0075507  "
		}
	}
}
