{
	"add": {
		"doc": {
			"id": "0b3f4460225be5fd7a1b23776ee01678428ba5c48d19ed181a31187169cdf253",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Garuda_Indonesia_Screen_3.JPG/220px-Garuda_Indonesia_Screen_3.JPG",
				"previous": "A range of hot and cold beverages are available, along with snacks and/or meals, depending on the length of the flight. Wine and beers are also offered on international flights. In July 2011, Garuda Indonesia launched the Indonesian Rijsttafel service in Executive Class as part of its signature in-flight services.[90] This signature dining service introduces the passengers to a wide array of Indonesian cuisine in a single setting, as part of the Garuda Indonesia experience. This in-flight Indonesian Rijsttafel includes varieties of Indonesian signature dishes; choices of nasi kuning or regular steamed rice, accompanied with choices of dishes such as satay, rendang, gado-gado grilled chicken rica, red snapper in yellow acar sauce, fried shrimp in sambal, potato perkedel and tempeh, along with kerupuk or rempeyek crackers.[91]",
			"after": [
				"In-Flight Entertainment (IFE) is available on board selected Garuda Indonesia aircraft.",
				"Garuda's Boeing 777-300ER, Airbus A330s, and newer Boeing 737-800 aircraft are equipped with Audio video on demand In-Flight Entertainment System in all classes. The Economy Class on these aircraft features a 9-inch LCD touch-screen, while the Executive Class features a 9-inch, 11-inch and 15-inch touch-screen LCD in Garuda's Boeing 737-800, older Airbus A330-200, and all remaining Airbus A330 series aircraft respectively. In Executive Class on board the Airbus A330-300 and newer A330-200 aircraft, the screens are located on the seat backs or in the armrest of bulkhead rows, while in the older Airbus A330-200 aircraft and Boeing 737-800s, the screens are stowed in the armrest. In Economy Class, they are on the seat back.[92]"
			],
			"color": "dark|0.28188 gray|0.28188 dark|0.28188 grey|0.28188 silver|0.14255 gray|0.13908 grey|0.13908 light|0.078708 gray|0.078708 light|0.078708 grey|0.078708 dim|0.061457 gray|0.061457 dim|0.061457 grey|0.061457 gainsboro|0.054311 antique|0.032378 white|0.032378 light|0.025582 steel|0.025582 blue|0.025582 steel|0.022999 blue|0.022999 linen|0.020714 misty|0.014206 rose|0.014206 slate|0.013814 gray|0.013814 old|0.011002 lace|0.011002 sea|0.010886 shell|0.010886 light|0.0093067 slate|0.0093067 gray|0.0093067 black|0.0090463 papaya|0.0064802 whip|0.0064802 white|0.0055743 smoke|0.0055743 floral|0.0051785 white|0.0051785 lavender|0.0045573 blush|0.0045573 corn|0.0043357 flower|0.0043357 blue|0.0043357 beige|0.0042524  "
		}
	}
}
