{
	"add": {
		"doc": {
			"id": "0b4bb4e65b9ac8737ff7b98d7599219660bf6cdf1d5429ea2758fe179e2cc389",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/The_return_of_Christopher_Columbus%3Bhis_audience_before_King_Ferdinand_and_Queen_Isabella..jpg/250px-The_return_of_Christopher_Columbus%3Bhis_audience_before_King_Ferdinand_and_Queen_Isabella..jpg",
				"previous": "On 13 January 1493, Columbus made his last stop of this voyage in the New World. He landed on the Samaná Peninsula, where he met the hostile Ciguayos who presented him with his only violent resistance during his first voyage to the Americas. The Ciguayos had refused to trade the amount of bows and arrows that Columbus desired; in the ensuing violence two were stabbed to death.[46] Because of this and because of the Ciguayos' use of arrows, he called the inlet where he met them the Bay of Arrows (or Gulf of Arrows).[51] Today, the place is called the Bay of Rincón, in Samaná, the Dominican Republic.[52] Columbus kidnapped about 10 to 25 natives and took them back with him (only seven or eight of the native Indians arrived in Spain alive, but they made quite an impression on Seville).[53]",
				"after": "Columbus headed for Spain on the Niña, but after a stop in the Azores a storm forced him to separate from the Pinta and into the port at Lisbon.[25] He anchored next to the King's harbor patrol ship on 4 March 1493 in Portugal and was interviewed by Bartolomeu Dias, whose rounding of the Cape of Good Hope a few years earlier in 1488–1489 had complicated Columbus's attempts for funding from the Portuguese court.[25] After spending more than one week in Portugal, and paying his respects to Eleanor of Viseu, he set sail for Spain. Ferdinand Magellan was a young boy and a ward of Eleanor's court; it is likely he saw Columbus during this visit.[25] After departing, and after reportedly being saved from assassins by John II of Portugal, Columbus crossed the bar of Saltes and entered the harbor of Palos on 15 March 1493. Word of his finding new lands rapidly spread throughout Europe.",
			"color": "black|0.41362 dim|0.17516 gray|0.17516 dim|0.17516 grey|0.17516 gray|0.10737 grey|0.10737 dark|0.070648 gray|0.070648 dark|0.070648 grey|0.070648 dark|0.04207 slate|0.04207 gray|0.04207 tan|0.034405 silver|0.026734 burly|0.020648 wood|0.020648  "
		}
	}
}
