{
	"add": {
		"doc": {
			"id": "0b4d44e7b39d23182013aeb41185c00986d7f53ee016a92af11b9f9c9aca6d51",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Westonzoylandpumpingstation.jpg/220px-Westonzoylandpumpingstation.jpg",
				"previous": "Continuing land reclamation and control of the Parrett was a long-running cycle of neglect followed by improvement. Work was carried out on the upper River Parrett basin in the middle Ages by Glastonbury Abbey.[47] Abbot Michael's survey of 1234 showed 722 acres (292 ha) of meadow recovered around the \"island\" of Sowy; and, from the accounts in the Abbey's rent books, this had increased to 972 acres (393 ha) by 1240.[47] Flooding of adjacent moor land was partially addressed in the 13th century by building a number of embankment walls to contain the Parrett. These included Southlake Wall, Burrow Wall and Lake Wall.[47] The River Tone was also diverted by the Abbot of Athelney, and other land owners, into a new embanked channel, joining the Parrett upstream from its original confluence.[36][47] After the Dissolution of the Monasteries, in the 16th century, much of the former abbey lands came under the control of the Crown, particularly King's Sedgemoor which had been wholly owned by Glastonbury Abbey; with Henry VI's Courts of Sewers made responsible for maintaining existing drainage, and various Commissions responsible for land improvements.[48] Further reclamation work was carried out over the next 500 years. In 1597, 50 acres (20 ha) of land were recovered near the Parrett estuary; a few years later 140 acres (57 ha) near Pawlett were recovered by means of embankments; and three further reclamations, totalling 110 acres (45 ha), were undertaken downstream of Bridgwater by 1660.[48] Kings James I, Charles I and Charles II continued to improve King's Sedgemoor.[48]",
				"after": "Attempts were also made to improve navigation on the lower river. Between 1677 and 1678, Sir John Moulton cut a new channel at \"Vikings Creek\" on the Horsey Levels to remove a large meander; the old river bed soon silted up providing 120 acres (49 ha) of new land.[48][49] A further scheme was proposed in 1723 to improve navigation, shorten the journey time for boats and recover land, by obtaining an Act of Parliament to make an artificial cut across the Steart Peninsula.[48] Eventually after much debate, the cut was not made due to lack of land owner support and concerns over costs and risks.[48] The English Civil War put a stop to most reclamation work; however, in 1764 a clyse was built at Dunball to contain tidal influences on a run-off stream near King's Sedgemoor.[48] Extensive land recovery was undertaken in the Somerset Levels by land owners between 1770 and the end of the Napoleonic Wars in 1815, as part of a general scheme of agricultural improvements.[50] This included improvements to the Brue Valley and to King's Sedgemoor.[50] The latter involved the connection of various drainage schemes into a new hand-dug channel connected to the clyse at Dunball – the King's Sedgemoor Drain.[50] Further drainage improvements were needed in the 19th century which involved the use of mechanical pumping engines, originally steam powered, but later powered by electricity.[51] In January 1940, further improvements were funded by the Ministry of Supply, during the Second World War, as \"Priority War Work\" during the construction of Royal Ordnance Factory (ROF) Bridgwater. This involved doubling the width of the King's Sedgemoor Drain at its western end; and the excavation of the River Huntspill. In the longer-term this provided a drain for the Brue valley, but in war-time the scheme provided a guaranteed daily supply of 4,500,000 imperial gallons (20,000 m3) of water for the ROF.[52]",
			"color": "sienna|0.32305 powder|0.13913 blue|0.13913 black|0.13811 saddle|0.11898 brown|0.11898 light|0.11668 blue|0.11668 silver|0.04485 dark|0.026983 gray|0.026983 dark|0.026983 grey|0.026983 light|0.026744 gray|0.026744 light|0.026744 grey|0.026744 light|0.020778 steel|0.020778 blue|0.020778 gainsboro|0.019834  "
		}
	}
}
