{
	"add": {
		"doc": {
			"id": "0b4d95b2c76799686f212ad242569e4f7f832c133a791488afd5fc254683d9b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Boeing_YC-14A_at_Andrews_AFB_1976.JPEG/220px-Boeing_YC-14A_at_Andrews_AFB_1976.JPEG",
				"previous": "Another NASA project the engineers were interested in was the supercritical airfoil, designed by Richard Whitcomb. The supercritical design promised to greatly lower transonic drag, as much as a swept wing in some situations. This allowed an aircraft with such a wing to have low drag in cruise while also having a wing planform more suitable to lower-speed flight — swept wings have several undesirable characteristics at low speed. Additionally, the design has a larger leading edge radius that makes it particularly suitable for low-speed high-lift applications like a transport. Boeing incorporated the concept into their design, the first non-experimental aircraft to do so.",
				"after": "The request for proposal (RFP) was issued in January 1972, asking for operations into a 2,000 foot (610 m) semi-prepared field at 500 nautical miles (930 km) with a 27,000 lb (12,000 kg) payload in both directions with no refueling. For comparison, the C-130 of that era required about 4,000 ft (1,200 m) for this load. Five companies submitted designs at this stage of the competition, Boeing with their Model 953 in March 1972. On 10 November 1972 the downselect was carried out, and Boeing and McDonnell Douglas won development contracts for two prototypes each.",
			"color": "tan|0.42706 burly|0.15597 wood|0.15597 wheat|0.12359 black|0.063227 peach|0.036555 puff|0.036555 gray|0.03655 grey|0.03655 bisque|0.035121 dim|0.021653 gray|0.021653 dim|0.021653 grey|0.021653 antique|0.020999 white|0.020999 dark|0.011813 slate|0.011813 gray|0.011813 blanched|0.0098918 almond|0.0098918 dark|0.0092964 gray|0.0092964 dark|0.0092964 grey|0.0092964 moccasin|0.0084828 navajo|0.0084743 white|0.0084743 slate|0.0053441 gray|0.0053441  "
		}
	}
}
