{
	"add": {
		"doc": {
			"id": "0b5259c76edb5819bfe7b23ce56ff47c6655bb5478034c2338d9a67280acc88f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Daniel_Webster_1824_Signature.jpg/220px-Daniel_Webster_1824_Signature.jpg",
				"previous": "Webster argued Dartmouth College v. Woodward to the Supreme Court (with significant aid from Jeremiah Mason and Jeremiah Smith), invoking Article I, section 10 of the Constitution (the Contract Clause) against the State. The Marshall court, continuing with its history of limiting states' rights and reaffirming the supremacy of the Constitutional protection of contract, ruled in favor of Webster and Dartmouth 3–1. This decided that corporations did not, as many then held, have to justify their privileges by acting in the public interest, but were independent of the states.[16]",
				"after": "Other notable appearances by Webster before the Supreme Court include his representation of James McCulloch (as cashier at the Baltimore branch of the Second Bank of the United States) in McCulloch v. Maryland (1819), the Cohens in Cohens v. Virginia (1821), and Thomas Gibbons in Gibbons v. Ogden (1824), cases similar to Dartmouth in the court's application of a broad interpretation of the Constitution and strengthening of the federal courts' power to constrain the states, which have since been used to justify wide powers for the federal government. Webster's handling of these cases made him one of the era's leading constitutional lawyers, as well as one of the most highly paid.[17] Webster's growing prominence as a constitutional lawyer led to his election as a delegate to the 1820 Massachusetts Constitutional Convention. There he spoke in opposition to universal suffrage (for men), on the Federalist grounds that power naturally follows property, and the vote should be limited accordingly; but the constitution was amended against his advice.[18] He also supported the (existing) districting of the State Senate so that each seat represented an equal amount of property.[19]",
			"color": "antique|0.17255 white|0.17255 bisque|0.15498 blanched|0.14209 almond|0.14209 papaya|0.12217 whip|0.12217 tan|0.10302 beige|0.059502 corn|0.04761 silk|0.04761 old|0.037532 lace|0.037532 peach|0.037114 puff|0.037114 linen|0.028881 wheat|0.022081 light|0.012421 yellow|0.012421 rosy|0.012187 brown|0.012187 ivory|0.007799 floral|0.0071721 white|0.0071721 light|0.0068973 golden|0.0068973 rod|0.0068973 yellow|0.0068973 sea|0.0055746 shell|0.0055746 misty|0.0049927 rose|0.0049927  "
		}
	}
}
