{
	"add": {
		"doc": {
			"id": "0b618bfaaaa4601ab4f8b2e9fb66ee0820bedf678842af787b93189a2c510efd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Airbus_A340-311%2C_Lufthansa_AN0401630.jpg/220px-Airbus_A340-311%2C_Lufthansa_AN0401630.jpg",
				"previous": "With the introduction of higher gross weight Boeing 777s, such as the -200ER and specifically -300ER, sales of the A340 began to decline. The 777 frequently outsold the A340 by a wide margin. Although the larger GE90 engines on the 777-300ER burn considerably more fuel than the Trent 500s, using only two engines compared to four Trents gave a typical operating cost advantage of around 8–9%.[44] In 2008, jet fuel prices doubled compared to the year before; consequently, the A340's fuel consumption led airlines to reduce flight stages exceeding 15 hours. Thai Airways International cancelled its 17-hour, nonstop Bangkok–New York/JFK route on 1 July 2008, and placed its four A340-500s for sale. While short flights stress aircraft more than long flights and result in more frequent fuel-thirsty take-offs and landings, ultra-long flights require completely full fuel tanks. The higher weights in turn require a greater proportion of an aircraft's fuel fraction just to take off and once aloft to stay airborne. In 2008, Air France-KLM SA's chief executive Pierre-Henri Gourgeon disparagingly referred to the A340 as a \"flying tanker with a few people on board\".[79] While Thai Airways consistently filled 80% of the seats on its New York City–Bangkok flights, it estimated that, at 2008 fuel prices, it would need an impossible 120% of seats filled just to break even.[80] Other airlines also re-examined long-haul flights. In August 2008 Cathay Pacific stated that rising fuel costs were hurting its trans-Pacific long-haul routes disproportionately, and that it would cut the number of such flights and redeploy its aircraft to shorter routes such as between Hong Kong and Australia. \"We will ... reshap[e] our network where necessary to ensure we fly aircraft to where we can cover our costs and also make some money.\"[81] Aviation Week compared the fortunes of the A340 to the Boeing 747, noting that the rapid performance increases of twin-engine aircraft have been the detriment of four-engine types.[82][83][84][85]",
				"after": "By 2014, Singapore Airlines had phased out the type, while Emirates Airlines decided to accelerate the retirement of its A340 fleet. International Airlines Group, the parent of Iberia Airlines, is overhauling its A340-600s for continued service for the foreseeable future. The IAG overhaul featured improved conditions and furnishings in the business and economy classes; the business-class capacity was raised slightly while not changing the type's overall operating cost. Lufthansa, which operates both Airbus A340-300s and -600s, concluded that, while it is not possible to make the A340 more fuel efficient, it can respond to increased interest in business-class services by replacing first-class seats with more business-class seats to increase revenue.[85][86]",
			"color": "steel|0.065756 blue|0.065756 white|0.053118 smoke|0.053118 black|0.051029 ghost|0.049455 white|0.049455 alice|0.049204 blue|0.049204 light|0.047881 steel|0.047881 blue|0.047881 lavender|0.047138 snow|0.045136 white|0.04068 gray|0.039867 grey|0.039867 lavender|0.037932 blush|0.037932 sea|0.037454 shell|0.037454 gainsboro|0.035491 mint|0.034518 cream|0.034518 azure|0.032912 floral|0.029518 white|0.029518 dim|0.029233 gray|0.029233 dim|0.029233 grey|0.029233 light|0.028147 slate|0.028147 gray|0.028147 slate|0.027711 gray|0.027711 light|0.027146 gray|0.027146 light|0.027146 grey|0.027146 pale|0.021451 golden|0.021451 rod|0.021451 lemon|0.017624 chiffon|0.017624 linen|0.017496 dark|0.016482 gray|0.016482 dark|0.016482 grey|0.016482 silver|0.014966 light|0.012178 golden|0.012178 rod|0.012178 yellow|0.012178 dark|0.0093148 slate|0.0093148 blue|0.0093148 ivory|0.0091193 old|0.0077392 lace|0.0077392  "
		}
	}
}
