{
	"add": {
		"doc": {
			"id": "0b685c7d4a38117f4f9a77ea0d1f38e90e511d366926b23219e74e48fddc477b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Stravinskygrave.jpg/170px-Stravinskygrave.jpg",
				"previous": "Stravinsky had adapted to life in France, but moving to America at the age of 57 was a very different prospect. For a while, he maintained a circle of contacts and emigré friends from Russia, but he eventually found that this did not sustain his intellectual and professional life. He was drawn to the growing cultural life of Los Angeles, especially during World War II, when so many writers, musicians, composers and conductors settled in the area: these included Otto Klemperer, Thomas Mann, Franz Werfel, George Balanchine and Arthur Rubinstein. Bernard Holland claimed Stravinsky was especially fond of British writers, who visited him in Beverly Hills, \"like W. H. Auden, Christopher Isherwood, Dylan Thomas. They shared the composer's taste for hard spirits – especially Aldous Huxley, with whom Stravinsky spoke in French\".[64] Stravinsky and Huxley had a tradition of Saturday lunches for west coast avant-garde and luminaries.[65]",
				"after": "Stravinsky's unconventional dominant seventh chord in his arrangement of \"The Star-Spangled Banner\" led to an incident with the Boston police on 15 January 1944, and he was warned that the authorities could impose a $100 fine upon any \"rearrangement of the national anthem in whole or in part\".[66][67] The police, as it turned out, were wrong. The law in question merely forbade using the national anthem \"as dance music, as an exit march, or as a part of a medley of any kind\", but the incident soon established itself as a myth, in which Stravinsky was supposedly arrested, held in custody for several nights, and photographed for police records.[68] A widely known photograph of Stravinsky, supposedly his mug shot, has been shown to be for a passport application.[citation needed]",
			"color": "light|0.080335 gray|0.080335 light|0.080335 grey|0.080335 gainsboro|0.076398 dark|0.074156 gray|0.074156 dark|0.074156 grey|0.074156 silver|0.073391 white|0.055722 smoke|0.055722 alice|0.052475 blue|0.052475 ghost|0.051648 white|0.051648 black|0.045338 lavender|0.044284 snow|0.044046 white|0.040292 lavender|0.039731 blush|0.039731 sea|0.036662 shell|0.036662 gray|0.036221 grey|0.036221 mint|0.034682 cream|0.034682 azure|0.03425 dim|0.032076 gray|0.032076 dim|0.032076 grey|0.032076 floral|0.029595 white|0.029595 linen|0.014231 dark|0.011931 slate|0.011931 gray|0.011931 light|0.010937 steel|0.010937 blue|0.010937 thistle|0.0080458 light|0.0077704 slate|0.0077704 gray|0.0077704 ivory|0.0071925 dark|0.0068833 sea|0.0068833 green|0.0068833 slate|0.0055678 gray|0.0055678 old|0.0041643 lace|0.0041643  "
		}
	}
}
