{
	"add": {
		"doc": {
			"id": "0b7503e253ffd6281621c55b1accd950b2d1755c0a0d7573d0f041ab42ea9340",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/EastCampusPanorama.jpg/600px-EastCampusPanorama.jpg",
				"previous": "East Campus, the original location of Duke after it moved to Durham,[49] functions as a freshman campus as well as the home of several academic departments. Since the 1995–96 academic year, all freshmen—and only freshmen, except for upperclassmen serving as Resident Assistants—have lived on East Campus, to build class unity. The campus encompasses 97 acres (390,000 m2) and is 1.5 miles (2.4 km) from West Campus.[4] The Art History, History, Literature, Music, Philosophy, and Women's Studies Departments are housed on East.[49] Programs such as dance, drama, education, film, and the University Writing Program reside on East. The self-sufficient East Campus contains the freshman residence halls, a dining hall, coffee shop, post office, Lilly Library, Baldwin Auditorium, a theater, Brodie Gym, tennis courts, several disc golf baskets, and a walking track as well as several academic buildings.[49] The East Campus dorms are Alspaugh, Basset, Bell Tower, Blackwell, Brown, East House (formerly known as Aycock), Epworth, Gilbert-Addoms, Giles, Jarvis, Pegram, Randolph, Southgate, and Wilson.[50] Separated from downtown by a short walk, the area was the site of the Women's College from 1930 to 1972.[49]",
				"after": "Central Campus, consisting of 122 acres (0.49 km2) between East and West campuses, houses around 1,000 sophomores, juniors, and seniors, as well as around 200 professional students in double or quadruple apartments.[51] There are 26 specific houses, accommodating 22 selective living groups (sororities and fraternities), 3 independent houses and 1 administrative house.[51] Central Campus is home to the Nasher Museum of Art, the Freeman Center for Jewish Life, the Center for Muslim Life, the Duke Police Department, the Duke Office of Disability Management, a Ronald McDonald House, and administrative departments such as Duke Residence Life and Housing Services. Central Campus has several recreation and social facilities such as basketball courts, a sand volleyball court, a turf field, barbecue grills and picnic shelters, a general gathering building called \"Devil's Den\", a restaurant known as \"Devil's Bistro\", a convenience store called Uncle Harry's, and the Mill Village. The Mill Village consists of a gym and group study rooms.[51][52]",
			"color": "black|0.32648 dark|0.20913 olive|0.20913 green|0.20913 dark|0.049635 gray|0.049635 dark|0.049635 grey|0.049635 silver|0.039871 rosy|0.030384 brown|0.030384 light|0.029285 gray|0.029285 light|0.029285 grey|0.029285 gray|0.02788 grey|0.02788 antique|0.027402 white|0.027402 linen|0.024498 gainsboro|0.021966 old|0.019541 lace|0.019541 sea|0.018508 shell|0.018508 dim|0.017764 gray|0.017764 dim|0.017764 grey|0.017764 floral|0.016894 white|0.016894 misty|0.016201 rose|0.016201 ivory|0.013134 white|0.011478 smoke|0.011478 beige|0.011154 papaya|0.010953 whip|0.010953 snow|0.010878  "
		}
	}
}
