{
	"add": {
		"doc": {
			"id": "0b8130d3cc5338da75b646a83d28dabfcf10fd973dafc35ef51d3c76190efc67",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Nickel_Grass_M60_C-5.jpg/220px-Nickel_Grass_M60_C-5.jpg",
				"previous": "During the night of October 8–9, an alarmed Dayan told Meir that \"this is the end of the third temple.\"[277] He was warning of Israel's impending total defeat, but \"Temple\" was also the code word for nuclear weapons.[278] Dayan again raised the nuclear topic in a cabinet meeting, warning that the country was approaching a point of \"last resort\".[280] That night Meir authorized the assembly of thirteen 20-kiloton-of-TNT (84 TJ) tactical atomic weapons for Jericho missiles at Sdot Micha Airbase, and F-4 aircraft at Tel Nof Airbase, for use against Syrian and Egyptian targets.[278] They would be used if absolutely necessary to prevent total defeat, but the preparation was done in an easily detectable way, likely as a signal to the United States.[280] Kissinger learned of the nuclear alert on the morning of October 9. That day, President Nixon ordered the commencement of Operation Nickel Grass, an American airlift to replace all of Israel's material losses.[281] Anecdotal evidence suggests that Kissinger told Sadat that the reason for the U.S. airlift was that the Israelis were close to \"going nuclear\".[278] However, subsequent interviews with Kissinger, Schlesinger, and William Quandt suggested that the nuclear aspect was not a major factor in the decision to re-supply. These officials cited the ongoing Soviet re-supply effort and Sadat's early rejection of a ceasefire as the primary motivators.[282] European countries refused to allow U.S. airplanes carrying supplies for Israel to refuel at their bases, fearing an Arab oil embargo, with the exception of Portugal and the Netherlands. Portugal permitted the United States to use a leased base in Azores,[283] and the defence minister of the Netherlands, apparently acting without consulting his cabinet colleagues, secretly authorised the use of Dutch airfields.[284]",
				"after": "Israel began receiving supplies via U.S. Air Force cargo airplanes on October 14,[285] although some equipment had arrived on planes from Israel's national airline El Al before this date. By that time, the IDF had advanced deep into Syria and was mounting a largely successful invasion of the Egyptian mainland from the Sinai, but had taken severe material losses. According to Abraham Rabinovich, \"while the American airlift of supplies did not immediately replace Israel's losses in equipment, it did allow Israel to expend what it did have more freely\".[286] By the end of Nickel Grass, the United States had shipped 22,395 tons of matériel to Israel. 8,755 tons of it arrived before the end of the war.[287] American C-141 Starlifter and C-5 Galaxy aircraft flew 567 missions throughout the airlift.[288] El Al planes flew in an additional 5,500 tons of matériel in 170 flights.[289][290] The airlift continued after the war until November 14. The United States also delivered approximately 90,000 tons of matériel to Israel by sealift until the beginning of December, using 16 ships.[287] 33,210 tons of it arrived by October 30.[291]",
			"color": " "
		}
	}
}
