{
	"add": {
		"doc": {
			"id": "0b880a70642c2e3acb2d27bcd1e1c12fef8cb8954f99c7a883d6054ff91e07a2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Texas_capitol_goddess_1888.jpg/220px-Texas_capitol_goddess_1888.jpg",
				"previous": "Initially, the new capital thrived. But Lamar's political enemy, Sam Houston, used two Mexican army incursions to San Antonio as an excuse to move the government. Sam Houston fought bitterly against Lamar's decision to establish the capital in such a remote wilderness. The men and women who traveled mainly from Houston to conduct government business were intensely disappointed as well. By 1840, the population had risen to 856, of whom nearly half fled from Austin when Congress recessed.[32] The resident Black population listed in January of this same year was 176.[33] The fear of Austin's proximity to the Indians and Mexico, which still considered Texas a part of their land, created an immense motive for Sam Houston, the first and third President of the Republic of Texas, to relocate the capital once again in 1841. Upon threats of Mexican troops in Texas, Houston raided the Land Office to transfer all official documents to Houston for safe keeping in what was later known as the Archive War, but the people of Austin would not allow this unaccompanied decision to be executed. The documents stayed, but the capital would temporarily move from Austin to Houston to Washington-on-the-Brazos. Without the governmental body, Austin's population declined to a low of only a few hundred people throughout the early 1840s. The voting by the fourth President of the Republic, Anson Jones, and Congress, who reconvened in Austin in 1845, settled the issue to keep Austin the seat of government as well as annex the Republic of Texas into the United States.",
				"after": "In 1860, 38% of Travis County residents were slaves.[34] In 1861, with the outbreak of the American Civil War, voters in Austin and other Central Texas communities voted against secession.[23][26] However, as the war progressed and fears of attack by Union forces increased, Austin contributed hundreds of men to the Confederate forces. The African American population of Austin swelled dramatically after the enforcement of the Emancipation Proclamation in Texas by Union General Gordon Granger at Galveston in an event commemorated as Juneteenth. Black communities such as Wheatville, Pleasant Hill, and Clarksville were established with Clarksville being the oldest surviving freedomtown ‒ the original post-Civil War settlements founded by former African-American slaves ‒ west of the Mississippi River.[26] In 1870, blacks made up 36.5% of Austin's population.[35] The postwar period saw dramatic population and economic growth. The opening of the Houston and Texas Central Railway (H&TC) in 1871[36] turned Austin into the major trading center for the region with the ability to transport both cotton and cattle. The Missouri, Kansas, and Texas (MKT) line followed close behind.[37] Austin was also the terminus of the southernmost leg of the Chisholm Trail and \"drovers\" pushed cattle north to the railroad.[38] Cotton was one of the few crops produced locally for export and a cotton gin engine was located downtown near the trains for \"ginning\" cotton of its seeds and turning the product into bales for shipment.[39] However, as other new railroads were built through the region in the 1870s, Austin began to lose its primacy in trade to the surrounding communities.[26] In addition, the areas east of Austin took over cattle and cotton production from Austin, especially in towns like Hutto and Taylor that sit over the blackland prairie, with its deep, rich soils for producing cotton and hay.[40][41]",
			"color": "white|0.075646 smoke|0.075646 sea|0.072171 shell|0.072171 snow|0.070277 floral|0.067885 white|0.067885 white|0.067315 ghost|0.066731 white|0.066731 mint|0.066353 cream|0.066353 alice|0.060265 blue|0.060265 dark|0.056837 gray|0.056837 dark|0.056837 grey|0.056837 azure|0.056492 lavender|0.046666 blush|0.046666 gray|0.046309 grey|0.046309 light|0.045745 gray|0.045745 light|0.045745 grey|0.045745 silver|0.045481 gainsboro|0.042882 dim|0.041341 gray|0.041341 dim|0.041341 grey|0.041341 linen|0.03302 black|0.018453 ivory|0.011815 old|0.0077988 lace|0.0077988  "
		}
	}
}
