{
	"add": {
		"doc": {
			"id": "0b8b696e2c324baf4b241dceddda2245416f44ea7f432da52247aa88a39fe59d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Calhoun_by_Longacre.jpg/220px-Calhoun_by_Longacre.jpg",
				"previous": "Longacre's first important commission were plates for S.F. Bradford's Encyclopedia in 1820; an engraving of General Andrew Jackson by Longacre based on a portrait by Thomas Sully achieved wide sales.[5] Longacre then agreed to engrave illustrations for Joseph and John Sanderson's Biographies of the Signers of the Declaration of Independence, published in nine volumes between 1820 and 1827. Although the venture was marked by criticism of the writing, sales were good enough that the project was completed. Numismatic writer Richard Snow suggests that the books sold on the strength of the quality of Longacre's illustrations. Longacre also completed a series of studies of actors in their roles in 1826 for The American Theatre.[6]",
				"after": "With lessons learned from the Sanderson series, Longacre proposed to issue his own set of biographies illustrated with plates of the subjects. He was on the point of launching this project, having invested $1,000 of his own money (equal to $23,623 today) in preparation, when he learned that James Herring of New York City was planning a similar series. In October 1831, he wrote to Herring, and the two men agreed to work together on The American Portrait Gallery (later called the National Portrait Gallery of Distinguished Americans), published in four volumes between 1834 and 1839. Herring was an artist, but much of the work of illustrating fell to Longacre, who travelled widely in the United States to sketch subjects from life. He again sketched Jackson, who was by now president, as well as former president James Madison, both in July 1833. He met many of the political leaders of the day, who were impressed by his portraits. Among these advocates was the former vice president, South Carolina Senator John C. Calhoun.[7] In July 1832, Niles' Register described a Longacre engraving, \"one of the finest specimens of American advancement in the art\".[5]",
			"color": "black|0.26602 dark|0.20904 gray|0.20904 dark|0.20904 grey|0.20904 dim|0.20153 gray|0.20153 dim|0.20153 grey|0.20153 gray|0.19268 grey|0.19268 silver|0.083745 light|0.027813 gray|0.027813 light|0.027813 grey|0.027813 gainsboro|0.016022  "
		}
	}
}
