{
	"add": {
		"doc": {
			"id": "0b8efd4d24986da621212819c5c7bf930c7e48b513886c62afd2fa2d9c110407",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Bundesarchiv_Bild_183-37695-0035%2C_Altglienicke%2C_Wasserpumpe_im_Spionagetunnel.jpg/220px-Bundesarchiv_Bild_183-37695-0035%2C_Altglienicke%2C_Wasserpumpe_im_Spionagetunnel.jpg",
				"previous": "SIS operations against the USSR were extensively compromised by the fact that the post-war Counter-Espionage Section, R5, was headed for two years by an agent working for the Soviet Union, Harold Adrian Russell \"Kim\" Philby. Although Philby's damage was mitigated for several years by his transfer as Head of Station in Turkey, he later returned and was the SIS intelligence liaison officer at the Embassy in Washington D.C. In this capacity he compromised a programme of joint US-UK paramilitary operations (Albanian Subversion, Valuable Project) in Enver Hoxha's Albania (although it has been shown that these operations were further compromised \"on the ground\" by poor security discipline among the Albanian émigrés recruited to undertake the operations). Philby was eased out of office and quietly retired in 1953 after the defection of his friends and fellow members of the \"Cambridge spy ring\" Donald Duart Maclean and Guy Burgess.[22]",
				"after": "SIS suffered further embarrassment when it turned out that an officer involved in both the Vienna and Berlin tunnel operations had been turned as a Soviet agent during internment by the Chinese during the Korean War. This agent, George Blake, returned from his internment to be treated as something of a hero by his contemporaries in \"the office\". His security authorisation was restored, and in 1953 he was posted to the Vienna Station where the original Vienna tunnels had been running for years. After compromising these to his Soviet controllers, he was subsequently assigned to the British team involved on Operation Gold, the Berlin tunnel, and which was, consequently, blown from the outset. In 1956 MI6 Director John Alexander Sinclair had to resign after the botched affair of the death of Lionel Crabb.[23]",
			"color": " "
		}
	}
}
