{
	"add": {
		"doc": {
			"id": "0b91e6745482608f7565d0cd9cb784ccd5c943f232c03d4dffbe24ac3c902d92",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Rockefeller_Center_Rooftop_Gardens_2_by_David_Shankbone.JPG/220px-Rockefeller_Center_Rooftop_Gardens_2_by_David_Shankbone.JPG",
				"previous": "In 1985, Columbia University sold the land beneath Rockefeller Center to the Rockefeller Group for $400 million.[14] In 1989, Mitsubishi Estate, a real estate company of the Mitsubishi Group, purchased the entire Rockefeller Center complex, and its owner, Rockefeller Group. In 2000, the current owner Jerry Speyer (a close friend of David Rockefeller), of Tishman Speyer Properties, L.P., together with the Lester Crown family of Chicago, bought the older 14 buildings and land from the previous syndicated owners that included: Goldman Sachs (which had 50 percent ownership), Gianni Agnelli, Stavros Niarchos, and David Rockefeller, who organized the syndicate in 1996 and is historically associated with the other partners, for $1.85 billion.[15]",
				"after": "The current Center is a combination of two building complexes: the older and original 14 Art Deco office buildings from the 1930s, and a set of four International-style towers built along the west side of Avenue of the Americas during the 1960s and 1970s (plus the Lehman Brothers Building). The Time-Life Building, McGraw-Hill and News Corporation/Fox News Channel headquarters are part of the Rockefeller Center extension now owned/managed by the major private real estate firm, Rockefeller Group.",
			"color": "gray|0.44392 grey|0.44392 dim|0.11397 gray|0.11397 dim|0.11397 grey|0.11397 black|0.093357 dark|0.080476 gray|0.080476 dark|0.080476 grey|0.080476 dark|0.070155 olive|0.070155 green|0.070155 silver|0.022827 olive|0.019719 drab|0.019719 dark|0.01662 khaki|0.01662 light|0.013914 slate|0.013914 gray|0.013914 slate|0.013567 gray|0.013567 light|0.0081816 gray|0.0081816 light|0.0081816 grey|0.0081816  "
		}
	}
}
