{
	"add": {
		"doc": {
			"id": "0b9997c7b92ed7559d638cd5d8c04276bf83c206aac70b138d8dfa3b9246ee9d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Exciting_Elephant_Ride_in_Jaipur_at_Amer_Fort.webm/220px--Exciting_Elephant_Ride_in_Jaipur_at_Amer_Fort.webm.jpg",
				"previous": "Elephants have been working animals since at least the Indus Valley Civilization[152] and continue to be used in modern times. There were 13,000–16,500 working elephants employed in Asia as of 2000. These animals are typically captured from the wild when they are 10–20 years old, when they can be trained quickly and easily, and will have a longer working life.[153] They were traditionally captured with traps and lassos, but since 1950, tranquillisers have been used.[154] Individuals of the Asian species are more commonly trained to be working animals, although the practice has also been attempted in Africa. The taming of African elephants in the Belgian Congo began by decree of Leopold II of Belgium during the 19th century and continues to the present with the Api Elephant Domestication Centre.[155]",
				"after": "Asian elephants perform tasks such as hauling loads into remote areas, moving logs into trucks, transporting tourists around national parks, pulling wagons and leading religious processions.[153] In northern Thailand, the animals are used to digest coffee beans for Black Ivory coffee.[156] They are valued over mechanised tools because they can work in relatively deep water, require relatively little maintenance, need only vegetation and water as fuel and can be trained to memorise specific tasks. Elephants can be trained to respond to over 30 commands.[153] Musth bulls can be difficult and dangerous to work with and are chained until the condition passes.[157] In India, many working elephants are alleged to have been subject to abuse. They and other captive elephants are thus protected under the The Prevention of Cruelty to Animals Act of 1960.[158]",
			"color": "light|0.27433 steel|0.27433 blue|0.27433 dark|0.12505 gray|0.12505 dark|0.12505 grey|0.12505 dim|0.089014 gray|0.089014 dim|0.089014 grey|0.089014 gray|0.088349 grey|0.088349 rosy|0.067111 brown|0.067111 light|0.057455 slate|0.057455 gray|0.057455 tan|0.048828 silver|0.043173 wheat|0.022474 light|0.019695 gray|0.019695 light|0.019695 grey|0.019695 bisque|0.017937 peach|0.017645 puff|0.017645 slate|0.017641 gray|0.017641 blanched|0.012743 almond|0.012743 moccasin|0.011721 navajo|0.010368 white|0.010368 gainsboro|0.010338 antique|0.0096074 white|0.0096074 papaya|0.008522 whip|0.008522 burly|0.0077521 wood|0.0077521  "
		}
	}
}
