{
	"add": {
		"doc": {
			"id": "0b9a4252de5707a3ffcc06360c51458b32991382579bc2a21536ba1195842181",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Wtc_locator_map.png/250px-Wtc_locator_map.png",
			"previous": [],
				"after": "The States of New York and New Jersey also needed to approve the project, given their control and oversight role of the Port Authority. Objections to the plan came from New Jersey Governor Robert B. Meyner, who resented that New York would be getting this $335 million project.[5] Meanwhile, ridership on New Jersey's Hudson and Manhattan Railroad (H&M) had declined substantially from a high of 113 million riders in 1927 to 26 million in 1958, after new automobile tunnels and bridges opened across the Hudson River.[12] Toward the end of 1961, negotiations with outgoing New Jersey Governor Meyner regarding the World Trade Center project reached a stalemate. In December 1961, Tobin met with newly elected New Jersey Governor Richard J. Hughes, and made a proposal to shift the World Trade Center project to a west side site where the Hudson Terminal was located.[13] In acquiring the Hudson & Manhattan Railroad, the Port Authority would also acquire the Hudson Terminal and other buildings which were deemed obsolete.[13] On January 22, 1962, the two states reached an agreement to allow the Port Authority to take over the railroad and to build the World Trade Center on Manhattan's lower west side.[14] The shift in location for the World Trade Center to a site more convenient to New Jersey, together with Port Authority acquisition of the H&M Railroad, brought New Jersey to agreement in support of the World Trade Center project.",
			"color": "sky|0.38783 blue|0.38783 light|0.35635 blue|0.35635 rosy|0.04094 brown|0.04094 dark|0.019273 gray|0.019273 dark|0.019273 grey|0.019273 light|0.018786 steel|0.018786 blue|0.018786 light|0.018067 sky|0.018067 blue|0.018067 gray|0.017107 grey|0.017107 dim|0.016837 gray|0.016837 dim|0.016837 grey|0.016837 light|0.016525 gray|0.016525 light|0.016525 grey|0.016525 gainsboro|0.014827 silver|0.013475 firebrick|0.0094003 white|0.0068152 smoke|0.0068152 lavender|0.0067852 indian|0.0065725 red|0.0065725 brown|0.0064856 alice|0.0048082 blue|0.0048082 powder|0.0045819 blue|0.0045819 lavender|0.0042081 blush|0.0042081 ghost|0.003978 white|0.003978 linen|0.0038154  "
		}
	}
}
