{
	"add": {
		"doc": {
			"id": "0bab4358c274827ca59303c7e56a3dab7c1e769bc435e14a9624d37cd4abf347",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Sample_Name_Authority_Record.png/220px-Sample_Name_Authority_Record.png",
				"previous": "For example, the Irish writer Brian O'Nolan, who lived from 1911 to 1966, wrote under many pen names such as Flann O'Brien and Myles na Gopaleen. Catalogers at the United States Library of Congress chose one form—\"O'Brien, Flann, 1911–1966\"—as the official heading.[21] The example contains all three elements of a valid authority record: the first heading O'Brien, Flann, 1911–1966 is the form of the name that the Library of Congress chose as authoritative. In theory, every record in the catalog that represents a work by this author should have this form of the name as its author heading. What follows immediately below the heading beginning with Na Gopaleen, Myles, 1911–1966 are the see references. These forms of the author's name will appear in the catalog, but only as transcriptions and not as headings. If a user queries the catalog under one of these variant forms of the author's name, he or she would receive the response: \"See O'Brien, Flann, 1911–1966.\" There is an additional spelling variant of the Gopaleen name: \"Na gCopaleen, Myles, 1911–1966\" has an extra C inserted because the author also employed the non-anglicized Irish spelling of his pen-name, in which the capitalized C shows the correct root word while the preceding g indicates its pronunciation in context. So if a library user comes across this spelling variant, he or she will be led to the same author regardless. See also references, which point from one authorized heading to another authorized heading, are exceedingly rare for personal name authority records, although they often appear in name authority records for corporate bodies. The final four entries in this record beginning with His At Swim-Two-Birds ... 1939. constitute the justification for this particular form of the name: it appeared in this form on the 1939 edition of the author's novel At Swim-Two-Birds, whereas the author's other noms de plume appeared on later publications.",
				"after": "The act of choosing a single authorized heading to represent all forms of a name is quite often a difficult and complex task, considering that any given individual may have legally changed their name or used a variety of legal names in the course of their lifetime, as well as a variety of nicknames, pen names, stage names or other alternative names. It may be particularly difficult to choose a single authorized heading for individuals whose various names have controversial political or social connotations, when the choice of authorized heading may be seen as endorsement of the associated political or social ideology.",
			"color": "sea|0.9279 green|0.9279 purple|0.039252 thistle|0.018158  "
		}
	}
}
