{
	"add": {
		"doc": {
			"id": "0bb72440e3b3bae8ee55d2e50c58c75323f612884abbece965e45c836db8cc49",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/a/ab/Katy_Jurado_in_High_Noon.png/200px-Katy_Jurado_in_High_Noon.png",
			"previous": [
				"The plot's sequence of events occurs in approximate real time.",
				"In the end, Will faces Miller and his gang alone. Kane guns down Ben Miller and Colby, but is wounded in the process. Helen and Amy both board the train, but Amy gets off when she hears the sound of gunfire. Amy chooses her new husband's life over her religious beliefs, shooting Pierce from behind. Miller then takes her hostage to force Will into the open. However, Amy suddenly attacks Miller, giving Will a clear shot, and Will shoots Miller dead. As the townspeople emerge, Will stares at the crowd, contemptuously throws his marshal's star in the dirt, and leaves town with Amy."
			],
			"after": [
				"Uncredited Cast",
				"According to the 2002 documentary Darkness at High Noon: The Carl Foreman Documents, written, produced, and directed by Lionel Chetwynd, Carl Foreman's role in the creation and production of High Noon has been unfairly downplayed over the years in favor of Foreman's former partner and producer, Stanley Kramer.[5] The documentary was prompted by and based in part on a single-spaced 11-page letter that Foreman wrote to film critic Bosley Crowther in April 1952.[5] In the letter, Foreman asserts that the film began as a four-page plot outline about \"aggression in a western background\" and \"telling a motion picture story in the exact time required for the events of the story itself\" (a device used in High Noon).[5] An associate of Foreman pointed out similarities between Foreman's outline and the short story \"The Tin Star\" by John W. Cunningham, which led Foreman to purchase the rights to Cunningham's story and proceed with the original outline.[5] By the time the documentary aired, most of those immediately involved were dead, including Kramer, Foreman, Fred Zinnemann, and Cooper. Kramer's widow rebuts Foreman's contentions; Victor Navasky, author of Naming Names and familiar with some of the circumstances surrounding High Noon because of interviews with Kramer's widow, among others, said the documentary seemed \"one-sided, and the problem is it makes a villain out of Stanley Kramer, when it was more complicated than that\".[5]"
			],
			"color": "gray|0.56098 grey|0.56098 dim|0.4185 gray|0.4185 dim|0.4185 grey|0.4185 dark|0.019447 gray|0.019447 dark|0.019447 grey|0.019447  "
		}
	}
}
