{
	"add": {
		"doc": {
			"id": "0bbbafe803842e2f39189146edcc43bf7f771269e60d8313ba8a07ff62133185",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Les_Tr%C3%A8s_Riches_Heures_du_duc_de_Berry_f%C3%A9vrier.jpg/170px-Les_Tr%C3%A8s_Riches_Heures_du_duc_de_Berry_f%C3%A9vrier.jpg",
			"previous": [],
				"after": "The Late Middle Ages in Europe as a whole correspond to the Trecento and Early Renaissance cultural periods in Italy, although Northern Europe and Spain continued to use Gothic styles, increasingly elaborate in the 15th century, until almost the end of the period. International Gothic was a courtly style that reached much of Europe in the decades around 1400, producing masterpieces such as the Très Riches Heures du Duc de Berry.[315] All over Europe secular art continued to increase in quantity and quality, and in the 15th century the mercantile classes of Italy and Flanders became important patrons, commissioning small portraits of themselves in oils as well as a growing range of luxury items such as jewellery, ivory caskets, cassone chests, and maiolica pottery. These objects also included the Hispano-Moresque ware produced by mostly Mudéjar potters in Spain. Although royalty owned huge collections of plate, little survives except for the Royal Gold Cup.[316] Italian silk manufacture developed, so that western churches and elites no longer needed to rely on imports from Byzantium or the Islamic world. In France and Flanders tapestry weaving of sets like The Lady and the Unicorn became a major luxury industry.[317]",
			"color": "dark|0.15822 gray|0.15822 dark|0.15822 grey|0.15822 light|0.11802 gray|0.11802 light|0.11802 grey|0.11802 gainsboro|0.10899 silver|0.087729 gray|0.087392 grey|0.087392 dim|0.058829 gray|0.058829 dim|0.058829 grey|0.058829 linen|0.044176 white|0.037105 smoke|0.037105 sea|0.026567 shell|0.026567 tan|0.025946 slate|0.025846 gray|0.025846 light|0.02219 slate|0.02219 gray|0.02219 old|0.018326 lace|0.018326 floral|0.017633 white|0.017633 dark|0.017601 slate|0.017601 blue|0.017601 snow|0.015416 antique|0.014631 white|0.014631 mint|0.01016 cream|0.01016 midnight|0.0085351 blue|0.0085351 alice|0.0080409 blue|0.0080409 lavender|0.007937 blush|0.007937 ghost|0.0079222 white|0.0079222 white|0.0068416 ivory|0.0064507 beige|0.0051953 rosy|0.0050149 brown|0.0050149 royal|0.0049908 blue|0.0049908  "
		}
	}
}
