{
	"add": {
		"doc": {
			"id": "0bbcec1a12c6e9d64a9a7802abab6eff2c8d689c7445a44238080d523d76b06f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/KellsFol291vPortJohn.jpg/220px-KellsFol291vPortJohn.jpg",
				"previous": "The miniature of the Virgin and Child faces the first page of text and is an appropriate preface to the beginning of the Breves Causae of Matthew, which begins Nativitas Christi in Bethlem (the birth of Christ in Bethlehem). The beginning page (folio 8r) of the text of the Breves Causae is decorated and contained within an elaborate frame. The two-page spread of the miniature and the text makes a vivid introductory statement for the prefatory material. The opening line of each of the sections of the preliminary matter is enlarged and decorated (see above for the Breves causae of Luke), but no other section of the preliminaries is given the same level of treatment as the beginning of the Breves Causae of Matthew.[41]",
				"after": "The book was designed so that each of the Gospels would have an elaborate introductory decorative programme. Each Gospel was originally prefaced by a full page miniature containing the four evangelist symbols, followed by a blank page. Then came a portrait of the evangelist which faced the opening text of the Gospel which was given an elaborate decorative treatment.[42] The Gospel of Matthew retains both its Evangelist portrait (folio 28v) and its page of Evangelist symbols (folio 27r, see above). The Gospel of Mark is missing the Evangelist portrait but retains its Evangelist symbols page (folio 129v). The Gospel of Luke is missing both the portrait and the Evangelist symbols page. The Gospel of John, like the Gospel of Matthew, retains both its portrait (folio 291v, see at right) and its Evangelist symbols page (folio 290v). It can be assumed that the portraits for Mark and Luke and the symbols page for Luke at one time existed but have been lost.[43] The use of all four of the Evangelist symbols in front of each Gospel is striking and was intended to reinforce the message of the unity of the Gospels.",
			"color": "saddle|0.20871 brown|0.20871 dark|0.13947 golden|0.13947 rod|0.13947 peru|0.10393 chocolate|0.095153 golden|0.086899 rod|0.086899 sienna|0.053727 burly|0.040749 wood|0.040749 black|0.024498 tan|0.018619 dark|0.015876 khaki|0.015876  "
		}
	}
}
