{
	"add": {
		"doc": {
			"id": "0bec45502b3e1c23c472f67ae33fd397a6b0cd657d0ad60c9a39cc5b0a3a5b31",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Parasaurolophus_Cranial_Crest.svg/220px-Parasaurolophus_Cranial_Crest.svg.png",
			"previous": [],
				"after": "Parasaurolophus is often hypothesized to have used its crest as a resonating chamber to produce low frequency sounds to alert other members of a group or its species.[23] This function was originally suggested by Wiman in 1931 when he described P. tubicen. He noted that the crests internal structures are similar to those of a swan, and theorized that an animal could use its elongated nasal passages to create noise.[23][16] However, the nasal tubes of Hypacrosaurus, Corythosaurus, and Lambeosaurus are much more variable and complicated than the airway of Parasaurolophus. A large amount of material and data supports the hypothesis that the large, tubular crest of Parasaurolophus was a resonating chamber. Weishampel in 1981 suggested that Parasaurolophus made noises ranging between the frequencies 55 and 720 Hz, although there was some difference in the range of individual species because of the crest size, shape, and nasal passage length, most obvious in P. cyrtocristatus (interpreted as a possible female).[23] Hopson found that there is anatomical evidence that hadrosaurids had strong hearing. There is at least one example, in the related Corythosaurus, of a slender stapes (reptilian ear bone) in place, which combined with a large space for an eardrum implies a sensitive middle ear. Furthermore, the hadrosaurid lagena is elongate like a crocodilian's, indicating that the auditory portion of the inner ear was well-developed.[24] Based on similarity of hadrosaurid inner ears to those of crocodiles, he also proposed that adult hadrosaurids were sensitive to high frequencies, such as their offspring might produce. According to Weishampel, this is consistent with parents and offspring communicating.[23]",
			"color": "white|0.072656 smoke|0.072656 snow|0.067639 ghost|0.06757 white|0.06757 alice|0.067254 blue|0.067254 white|0.066794 sea|0.066516 shell|0.066516 mint|0.064963 cream|0.064963 floral|0.062707 white|0.062707 dark|0.062507 gray|0.062507 dark|0.062507 grey|0.062507 azure|0.061744 lavender|0.059266 blush|0.059266 gray|0.058031 grey|0.058031 dim|0.04339 gray|0.04339 dim|0.04339 grey|0.04339 silver|0.043201 black|0.036821 light|0.034443 gray|0.034443 light|0.034443 grey|0.034443 gainsboro|0.030133 rosy|0.0095127 brown|0.0095127 ivory|0.0077418 linen|0.0074364  "
		}
	}
}
