{
	"add": {
		"doc": {
			"id": "0c171f44a6c939d3df4fbe229c0abe0814d53cdc2359375b0d8ab4d22c418ce3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Molaire_de_mammouth_-_font_de_Champdamoy.jpg/220px-Molaire_de_mammouth_-_font_de_Champdamoy.jpg",
				"previous": "Woolly mammoths had very long tusks, which were more curved than those of modern elephants. The largest known male tusk is 4.2 m (14 ft) long and weighs 91 kg (201 lb), but 2.4–2.7 m (7.9–8.9 ft) and 45 kg (99 lb) was a more typical size. Female tusks were smaller and thinner, averaging at 1.5–1.8 m (4.9–5.9 ft) and weighing 9 kg (20 lb). The sheaths of the tusks were parallel and spaced closely. About a quarter of the length was inside the sockets. The tusks grew spirally in opposite directions from the base and continued in a curve until the tips pointed towards each other, sometimes crossing. In this way, most of the weight would have been close to the skull, and there would be less torque than with straight tusks. The tusks were usually asymmetrical and showed considerable variation, with some tusks curving down instead of outwards and some being shorter due to breakage. Calves developed small milk tusks a few centimetres long at six months old, which were replaced by permanent tusks a year later. Tusk growth continued throughout life but became slower as the animal reached adulthood. The tusks grew by 2.5–15 cm (0.98–5.91 in) each year. Some cave paintings show woolly mammoths with small or no tusks, but it is unknown whether this reflected reality or was artistic license. Female Asian elephants have no tusks, but there is no fossil evidence that any adult woolly mammoths lacked them.[41][42]",
				"after": "Woolly mammoths had four functional molar teeth at a time, two in the upper jaw and two in the lower. About 23 cm (9.1 in) of the crown was within the jaw, and 2.5 cm (1 in) was above. The crown was continually pushed forwards and up as it wore down, comparable to a conveyor belt. The teeth had up to 26 separated ridges of enamel, which were themselves covered in \"prisms\" that were directed towards the chewing surface. These were quite wear resistant and kept together by cementum and dentine. A mammoth had six sets of molars throughout a lifetime, which were replaced five times, though a few specimens with a seventh set are known. The latter condition could extend the lifespan of the individual, unless the tooth consisted of only a few plates. The first molars were about the size of those of a human, 1.3 cm (0.51 in), the third were 15 cm (6 in) 15 cm (5.9 in) long, and the sixth were about 30 cm (1 ft) long and weighed 1.8 kg (4 lb). The molars grew larger and contained more ridges with each replacement.[43] The woolly mammoth is considered to have had the most complex molars of any elephant.[42]",
			"color": "dark|0.20996 gray|0.20996 dark|0.20996 grey|0.20996 gray|0.18583 grey|0.18583 dim|0.13147 gray|0.13147 dim|0.13147 grey|0.13147 sandy|0.10667 brown|0.10667 silver|0.098882 black|0.063957 light|0.044569 gray|0.044569 light|0.044569 grey|0.044569 gainsboro|0.026297 tan|0.024205 antique|0.01738 white|0.01738 linen|0.010198  "
		}
	}
}
