{
	"add": {
		"doc": {
			"id": "0c1a3f11584fbcc9e4b8515bc665cdfe5feda9489958502a3d18c9161bbee975",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/TPA_Marriott.JPG/220px-TPA_Marriott.JPG",
				"previous": "At this time, new runway is being planned (17–35) to increase capacity in fair-weather conditions. In addition, a second Landside Airside Terminal will be built to the north of the current facility, allowing the airport to serve over 50-million passengers a year by 2025. Construction of this facility was originally slated to begin in 2010, with completion set to October 2015. However, the St. Petersburg Times reported on November 7, 2008 that the airport authority is no longer pursuing the original planned dates due to the current state of the US and global economies. The current struggle of the airline industry, including the recent merger by Delta and Northwest, has forced passenger enplanements to level off, and slowly decline at the airport. Additionally, with more possible airline mergers on the way, TPA Airport may not require drastic expansion for another five to six years. The revised start date of construction of the north terminal is now estimated at around 2015. According to the Tampa Tribune, passenger levels dropped by 14% in January 2009[31]",
				"after": "Phase I of the economy parking garage was completed in November 2005.[32] Phase II of the economy garage opened ahead of schedule in November 2005, bringing a total of 5,600 parking spaces.[33]",
			"color": "tan|0.12773 wheat|0.12404 lemon|0.10268 chiffon|0.10268 black|0.096794 pale|0.089081 golden|0.089081 rod|0.089081 moccasin|0.087364 light|0.072317 golden|0.072317 rod|0.072317 yellow|0.072317 navajo|0.05149 white|0.05149 blanched|0.032863 almond|0.032863 bisque|0.032495 light|0.027451 yellow|0.027451 corn|0.023087 silk|0.023087 dim|0.022961 gray|0.022961 dim|0.022961 grey|0.022961 burly|0.022016 wood|0.022016 papaya|0.017 whip|0.017 gray|0.014286 grey|0.014286 beige|0.012828 peach|0.0098685 puff|0.0098685 antique|0.0078028 white|0.0078028  "
		}
	}
}
