{
	"add": {
		"doc": {
			"id": "0c282e8d5efbff165aadb7a0ccf0e11d16c8845173fdca4cdef0f23dc4a27375",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Boston_college_town_map.png/220px-Boston_college_town_map.png",
			"previous": [],
				"after": "Some of the most famous universities in the United States are located in the Boston area. Four members of the Association of American Universities are in Greater Boston (more than any other metropolitan area): Harvard University, the Massachusetts Institute of Technology, Boston University, and Brandeis University.[195] Hospitals, universities, and research institutions in Greater Boston received more than $1.77 billion in National Institutes of Health grants in 2013, more money than any other American metropolitan area.[196] Greater Boston has more than 100 colleges and universities, with 250,000 students enrolled in Boston and Cambridge alone.[197] Its largest private universities include Boston University (the city's fourth-largest employer)[198] with its main campus along Commonwealth Avenue and a medical campus in the South End; Northeastern University in the Fenway area;[199] Suffolk University near Beacon Hill, which includes law school and business school;[200] and Boston College, which straddles the Boston (Brighton)–Newton border.[201] Boston's only public university is the University of Massachusetts Boston, on Columbia Point in Dorchester. Roxbury Community College and Bunker Hill Community College are the city's two public community colleges. Altogether, Boston's colleges and universities employ over 42,600 people, accounting for nearly 7 percent of the city's workforce.[202]",
			"color": "rosy|0.19289 brown|0.19289 misty|0.056207 rose|0.056207 light|0.054756 gray|0.054756 light|0.054756 grey|0.054756 silver|0.050641 gray|0.048223 grey|0.048223 dark|0.046048 gray|0.046048 dark|0.046048 grey|0.046048 chocolate|0.044235 dim|0.043872 gray|0.043872 dim|0.043872 grey|0.043872 gainsboro|0.035321 brown|0.034083 light|0.022843 steel|0.022843 blue|0.022843 dark|0.02103 salmon|0.02103 medium|0.02103 aqua|0.02103 marine|0.02103 light|0.020305 coral|0.020305 steel|0.020305 blue|0.020305 medium|0.017404 sea|0.017404 green|0.017404 linen|0.017188 tan|0.016099 burly|0.014914 wood|0.014914 thistle|0.014866 lavender|0.01451 blush|0.01451 sea|0.013966 shell|0.013966 white|0.013269 smoke|0.013269 snow|0.011514 ghost|0.01005 white|0.01005 dark|0.0090645 golden|0.0090645 rod|0.0090645 alice|0.0088579 blue|0.0088579 navajo|0.0087261 white|0.0087261 white|0.0086093 floral|0.008565 white|0.008565 light|0.0072516 slate|0.0072516 gray|0.0072516 indian|0.0068891 red|0.0068891  "
		}
	}
}
