{
	"add": {
		"doc": {
			"id": "0c3467f981751d8c6c5177958a0121bf610d0d65cec13007a0966afa11d8c033",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Elvis_Presley_Briefmarke_Deutsche_Bundespost_1988_postfrisch_Schuschke.png/220px-Elvis_Presley_Briefmarke_Deutsche_Bundespost_1988_postfrisch_Schuschke.png",
				"previous": "Presley's rise to national attention in 1956 transformed the field of popular music and had a huge effect on the broader scope of popular culture.[8] As the catalyst for the cultural revolution that was rock and roll, he was central not only to defining it as a musical genre but in making it a touchstone of youth culture and rebellious attitude.[379] With its racially mixed origins—repeatedly affirmed by Presley—rock and roll's occupation of a central position in mainstream American culture facilitated a new acceptance and appreciation of black culture.[380] In this regard, Little Richard said of Presley, \"He was an integrator. Elvis was a blessing. They wouldn't let black music through. He opened the door for black music.\"[381] Al Green agreed: \"He broke the ice for all of us.\"[382] President Jimmy Carter remarked on his legacy in 1977: \"His music and his personality, fusing the styles of white country and black rhythm and blues, permanently changed the face of American popular culture. His following was immense, and he was a symbol to people the world over of the vitality, rebelliousness, and good humor of his country.\"[278] Presley also heralded the vastly expanded reach of celebrity in the era of mass communication: at the age of 21, within a year of his first appearance on American network television, he was one of the most famous people in the world.[383]",
			"after": [],
			"color": "black|0.55413 peru|0.075621 tan|0.050373 burly|0.031688 wood|0.031688 silver|0.026727 dark|0.024199 salmon|0.024199 dim|0.023072 gray|0.023072 dim|0.023072 grey|0.023072 light|0.022967 gray|0.022967 light|0.022967 grey|0.022967 gainsboro|0.020015 dark|0.016222 gray|0.016222 dark|0.016222 grey|0.016222 gray|0.013356 grey|0.013356 sienna|0.013295 white|0.012429 smoke|0.012429 alice|0.011567 blue|0.011567 ghost|0.011233 white|0.011233 azure|0.010662 snow|0.010464 mint|0.010112 cream|0.010112 white|0.010088  "
		}
	}
}
