{
	"add": {
		"doc": {
			"id": "0c53441c13c1356f0b6f00b57b5081b13aa973ca0f7ffaf4de8ccf97654139da",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/WTI_price_96_09.PNG/220px-WTI_price_96_09.PNG",
			"previous": [],
				"after": "The amount of economically recoverable oil shale is unknown.[3] The various attempts to develop oil shale deposits have succeeded only when the cost of shale-oil production in a given region comes in below the price of crude oil or its other substitutes. According to a survey conducted by the RAND Corporation, the cost of producing a barrel of oil at a surface retorting complex in the United States (comprising a mine, retorting plant, upgrading plant, supporting utilities, and spent shale reclamation), would range between US$70–95 ($440–600/m3, adjusted to 2005 values). This estimate considers varying levels of kerogen quality and extraction efficiency. In order to run a profitable operation, the price of crude oil would need to remain above these levels. The analysis also discusses the expectation that processing costs would drop after the establishment of the complex. The hypothetical unit would see a cost reduction of 35–70% after producing its first 500 million barrels (79×10 ^6 m3). Assuming an increase in output of 25 thousand barrels per day (4.0×10 ^3 m3/d) during each year after the start of commercial production, RAND predicts the costs would decline to $35–48 per barrel ($220–300/m3) within 12 years. After achieving the milestone of 1 billion barrels (160×10 ^6 m3), its costs would decline further to $30–40 per barrel ($190–250/m3).[45][53] Some commentators compare the proposed American oil-shale industry to the Athabasca oil-sands industry (the latter enterprise generated over 1 million barrels (160,000 m3) of oil per day in late 2007), stating that \"the first-generation facility is the hardest, both technically and economically\".[66][67]",
			"color": "white|0.090202 smoke|0.090202 sea|0.079249 shell|0.079249 snow|0.078603 ghost|0.078483 white|0.078483 lavender|0.07808 blush|0.07808 alice|0.077814 blue|0.077814 white|0.075163 mint|0.071827 cream|0.071827 floral|0.07071 white|0.07071 azure|0.066703 light|0.045816 gray|0.045816 light|0.045816 grey|0.045816 gainsboro|0.044278 silver|0.032731 misty|0.018098 rose|0.018098 linen|0.016967 dark|0.016155 gray|0.016155 dark|0.016155 grey|0.016155 pink|0.015438 light|0.014184 coral|0.014184 light|0.013542 pink|0.013542 salmon|0.0062169 ivory|0.0040078  "
		}
	}
}
