{
	"add": {
		"doc": {
			"id": "0c64eac7a8d81e08ffdc803cb4953db4779fe0d0cbbfd59867a9af9b4e096ba4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Swedish_Empire_%281560-1815%29_en2.png/250px-Swedish_Empire_%281560-1815%29_en2.png",
			"previous": [],
				"after": "In the 1660s, Sweden was at its height as a European great power. It had defeated Denmark, one of its main competitors for hegemony in the Baltic, in both the Torstenson War (1643–45) and the Dano-Swedish War (1657–58). At the Treaties of Brömsebro (1645) and Roskilde (1658), Denmark had been forced to cede the islands of Gotland and Ösel, all of its eastern territories on the Scandinavian Peninsula, and parts of Norway. In a third war, from 1658 to 1660, King Charles X of Sweden attempted to finish off Denmark for good. The move was bold royal ambition in an already highly militarized society geared for warfare, a fiscal-military state.[2] Disbanding its armies would have required paying outstanding wages, so there was an underlying incentive to keep hostilities alive and let soldiers live off enemy lands and plunder. The renewed attack on Denmark threatened the interests of the leading shipping nations of England and the Dutch Republic, who were best served by keeping the Baltic region politically divided. The Dutch intervened in 1658 by sending a fleet to stop the attempt to crush Denmark.[3] England also sent a fleet in November the same year, to assist Sweden in keeping the Sound Toll out of Danish and Dutch control. The English expedition failed as a result of adverse winter weather and the political turmoil that ended the Protectorate, and in the end, Charles' plans were thwarted.[4]",
			"color": "khaki|0.24198 white|0.056769 smoke|0.056769 sea|0.054537 shell|0.054537 snow|0.054034 alice|0.054004 blue|0.054004 ghost|0.053952 white|0.053952 white|0.053519 mint|0.05205 cream|0.05205 floral|0.051791 white|0.051791 azure|0.051486 lavender|0.049753 blush|0.049753 dark|0.038726 gray|0.038726 dark|0.038726 grey|0.038726 gray|0.036382 grey|0.036382 dim|0.029287 gray|0.029287 dim|0.029287 grey|0.029287 silver|0.027151 light|0.022091 gray|0.022091 light|0.022091 grey|0.022091 gainsboro|0.018899 forest|0.018285 green|0.018285 green|0.0051572 ivory|0.0047703 beige|0.0045033 linen|0.0041444 dark|0.0031881 green|0.0031881  "
		}
	}
}
