{
	"add": {
		"doc": {
			"id": "0c68715069e656f17944fe54051dc17ba3f34792526bca2e6be643e5ae97a921",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Windsor_Castle_at_Sunset_-_Nov_2006.jpg/220px-Windsor_Castle_at_Sunset_-_Nov_2006.jpg",
				"previous": "In its simplest terms, the definition of a castle accepted amongst academics is \"a private fortified residence\".[3] This contrasts with earlier fortifications, such as Anglo Saxon burhs and walled cities such as Constantinople and Antioch in the Middle East; castles were not communal defences but were built and owned by the local feudal lords, either for themselves or for their monarch.[4] Feudalism was the link between a lord and his vassal where, in return for military service, the lord would grant the vassal land and expect loyalty.[5] In the late 20th century, there was a trend to refine the definition of a castle by including the criterion of feudal ownership, thus tying castles to the medieval period; however, this does not necessarily reflect the terminology used in the medieval period. During the First Crusade (1096–1099), the Frankish armies encountered walled settlements and forts that they indiscriminately referred to as castles, but which would not be considered as such under the modern definition.[3]",
				"after": "Castles served a range of purposes, the most important of which were military, administrative, and domestic. As well as defensive structures, castles were also offensive tools which could be used as a base of operations in enemy territory. Castles were established by Norman invaders of England for both defensive purposes and to pacify the country's inhabitants.[6] As William the Conqueror advanced through England, he fortified key positions to secure the land he had taken. Between 1066 and 1087, he established 36 castles such as Warwick Castle, which he used to guard against rebellion in the English Midlands.[7][8]",
			"color": "dark|0.23652 olive|0.23652 green|0.23652 rosy|0.19522 brown|0.19522 dim|0.096594 gray|0.096594 dim|0.096594 grey|0.096594 light|0.095641 slate|0.095641 gray|0.095641 slate|0.080675 gray|0.080675 gray|0.063737 grey|0.063737 sienna|0.058889 dark|0.05311 gray|0.05311 dark|0.05311 grey|0.05311 dark|0.037559 slate|0.037559 gray|0.037559 dark|0.028977 salmon|0.028977 saddle|0.012888 brown|0.012888  "
		}
	}
}
