{
	"add": {
		"doc": {
			"id": "0c6b5b083e1904720b6b1ada7eb0461e146bd661070f501c578f69f06bc15005",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/The_Princess_-_W._S._Gilbert.png/220px-The_Princess_-_W._S._Gilbert.png",
				"previous": "Carte finally assembled a syndicate in 1877 and formed the Comedy Opera Company to launch a series of original English comic operas, beginning with a third collaboration between Gilbert and Sullivan, The Sorcerer, in November 1877. This work was a modest success,[26] and H.M.S. Pinafore followed in May 1878. Despite a slow start, mainly due to a scorching summer, Pinafore became a red-hot favourite by autumn. After a dispute with Carte over the division of profits, the other Comedy Opera Company partners hired thugs to storm the theatre one night to steal the sets and costumes, intending to mount a rival production. The attempt was repelled by stagehands and others at the theatre loyal to Carte, and Carte continued as sole impresario of the newly renamed D'Oyly Carte Opera Company.[55] Indeed, Pinafore was so successful that over a hundred unauthorised productions sprang up in America alone. Gilbert, Sullivan and Carte tried for many years to control the American performance copyrights over their operas, without success.[56]",
				"after": "For the next decade, the Savoy Operas (as the series came to be known, after the theatre Carte later built to house them) were Gilbert's principal activity. The successful comic operas with Sullivan continued to appear every year or two, several of them being among the longest-running productions up to that point in the history of the musical stage.[57] After Pinafore came The Pirates of Penzance (1879), Patience (1881), Iolanthe (1882), Princess Ida (1884, based on Gilbert's earlier farce, The Princess), The Mikado (1885), Ruddigore (1887), The Yeomen of the Guard (1888), and The Gondoliers (1889). Gilbert not only directed and oversaw all aspects of production for these works, but he actually designed the costumes himself for Patience, Iolanthe, Princess Ida, and Ruddigore.[58] He insisted on precise and authentic sets and costumes, which provided a foundation to ground and focus his absurd characters and situations.[59]",
			"color": " "
		}
	}
}
