{
	"add": {
		"doc": {
			"id": "0c746d5c20eb1f120ded3b7159fd5027d2771d91b73e66d2ecbfaee011e1c549",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Historical_cannons_in_Rosetta.JPG/220px-Historical_cannons_in_Rosetta.JPG",
				"previous": "In July 2003, on the occasion of the British Museum's 250th anniversary, Egypt first requested the return of the Rosetta Stone. Zahi Hawass, the chief of Egypt's Supreme Council of Antiquities, asked that the stele be repatriated to Egypt, urging in comments to reporters: \"If the British want to be remembered, if they want to restore their reputation, they should volunteer to return the Rosetta Stone because it is the icon of our Egyptian identity\".[72] Two years later in Paris he repeated the proposal, listing the stone as one of several key items belonging to Egypt's cultural heritage, a list which also included the iconic bust of Nefertiti in the Egyptian Museum of Berlin; a statue of the Great Pyramid architect Hemiunu in the Roemer-und-Pelizaeus-Museum in Hildesheim, Germany; the Dendara Temple Zodiac in the Louvre in Paris; and the bust of Ankhhaf from the Museum of Fine Arts, Boston.[73] During 2005, the British Museum presented to Egypt a full-size replica of the stele. This was initially displayed in the renovated Rashid National Museum, close to the site where the stone was found.[74] By November 2005, Hawass was suggesting a three-month loan of the Rosetta Stone, while reiterating the eventual goal of a permanent return;[75] in December 2009, he proposed to drop his claim for the permanent return of the Rosetta Stone if the British Museum loaned the stone to Egypt for three months, for the opening of the Grand Egyptian Museum at Giza in 2013.[76]",
				"after": "As John Ray has observed, \"the day may come when the stone has spent longer in the British Museum than it ever did in Rosetta.\"[77] There is strong opposition among national museums to the repatriation of objects of international cultural significance such as the Rosetta Stone. In response to repeated Greek requests for return of the Elgin Marbles from the Parthenon and similar requests to other museums around the world, in 2002, over 30 of the world's leading museums — including the British Museum, the Louvre, the Pergamon Museum in Berlin and the Metropolitan Museum in New York City — issued a joint statement declaring that \"objects acquired in earlier times must be viewed in the light of different sensitivities and values reflective of that earlier era\" and that \"museums serve not just the citizens of one nation but the people of every nation\".[78]",
			"color": "gray|0.37139 grey|0.37139 dim|0.26738 gray|0.26738 dim|0.26738 grey|0.26738 dark|0.20096 gray|0.20096 dark|0.20096 grey|0.20096 light|0.040569 slate|0.040569 gray|0.040569 black|0.032764 slate|0.032568 gray|0.032568 silver|0.029374 dark|0.0092491 olive|0.0092491 green|0.0092491 light|0.0042493 gray|0.0042493 light|0.0042493 grey|0.0042493  "
		}
	}
}
