{
	"add": {
		"doc": {
			"id": "0c7b9c2b7ccae444b6bcdcf523503bdb5db1b361efe74aa5f8e4c1d22ac7f232",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Painted_Desert_badlands_Tawa_Point.jpg/220px-Painted_Desert_badlands_Tawa_Point.jpg",
				"previous": "Petrified Forest National Park is known for its fossils, especially of fallen trees that lived in the Late Triassic period of the Mesozoic era, about 225 million years ago. During this period, the region that is now the park was near the equator on the southwestern edge of the supercontinent Pangaea, and its climate was humid and sub-tropical.[11] What later became northeastern Arizona was a low plain flanked by mountains to the south and southeast and a sea to the west. Streams flowing across the plain from the highlands deposited inorganic sediment and organic matter, including trees as well as other plants and animals that had entered or fallen into the water. Although most organic matter decays rapidly or is eaten by other organisms, some is buried so quickly that it remains intact and may become fossilized.[12] Within the park, the sediments containing the fossil logs for which the park is named are part of the Chinle Formation.[11]",
				"after": "The colorful Chinle, which appears on the surface in many parts of the southwestern United States and from which the Painted Desert gets its name, is up to 800 feet (240 m) thick in the park.[12] It consists of a variety of sedimentary rocks including beds of soft, fine-grained mudstone, siltstone, and claystone—much of which is bentonite—as well as harder sandstone and conglomerate, and limestone.[11][12] Exposed to wind and water, the Chinle usually erodes differentially into badlands made up of cliffs, gullies, mesas, buttes, and rounded hills.[12] Its bentonite clay, which swells when wet and shrinks while drying, causes surface movement and cracking that discourages plant growth. Lack of plant cover makes the Chinle especially susceptible to weathering.[11]",
			"color": "black|0.2816 tan|0.13023 dim|0.1042 gray|0.1042 dim|0.1042 grey|0.1042 gray|0.080604 grey|0.080604 burly|0.07523 wood|0.07523 sienna|0.049163 peach|0.037204 puff|0.037204 navajo|0.029102 white|0.029102 rosy|0.028853 brown|0.028853 wheat|0.028564 moccasin|0.021427 bisque|0.016748 slate|0.01576 gray|0.01576 dark|0.012103 salmon|0.012103  "
		}
	}
}
