{
	"add": {
		"doc": {
			"id": "0c89b6b4138cb2673fd23da86f8bce2c0ca1bc85a28ecab6b45b99663df20beb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Zhang_Shengwen._L%27enseignement_de_Bouddha_Sakyamuni.jpg/240px-Zhang_Shengwen._L%27enseignement_de_Bouddha_Sakyamuni.jpg",
			"previous": [],
				"after": "Chinese society during the Song dynasty (960–1279) was marked by political and legal reforms, a philosophical revival of Confucianism, and the development of cities beyond administrative purposes into centers of trade, industry, and maritime commerce. The inhabitants of rural areas were mostly farmers, although some were also hunters, fishers, or government employees working in mines or the salt marshes. Conversely, shopkeepers, artisans, city guards, entertainers, laborers, and wealthy merchants lived in the county and provincial centers along with the Chinese gentry—a small, elite community of educated scholars and scholar-officials. As landholders and drafted government officials, the gentry considered themselves the leading members of society; gaining their cooperation and employment was essential for the county or provincial bureaucrat overburdened with official duties. In many ways, scholar-officials of the Song period differed from the more aristocratic scholar-officials of the Tang dynasty (618–907). Civil service examinations became the primary means of appointment to an official post as competitors vying for official degrees dramatically increased. Frequent disagreements amongst ministers of state on ideological and policy issues led to political strife and the rise of political factions. This undermined the marriage strategies of the professional elite, which broke apart as a social group and gave way to a multitude of families which provided sons for civil service.",
			"color": "dark|0.15733 gray|0.15733 dark|0.15733 grey|0.15733 silver|0.12149 gray|0.11559 grey|0.11559 dim|0.10129 gray|0.10129 dim|0.10129 grey|0.10129 black|0.085985 light|0.073451 gray|0.073451 light|0.073451 grey|0.073451 gainsboro|0.048218 tan|0.026138 dark|0.023741 slate|0.023741 gray|0.023741 maroon|0.017996 light|0.016003 slate|0.016003 gray|0.016003 slate|0.014346 gray|0.014346 dark|0.013437 red|0.013437 rosy|0.013377 brown|0.013377 linen|0.011271 white|0.010551 smoke|0.010551 dark|0.010304 khaki|0.010304 antique|0.0094333 white|0.0094333  "
		}
	}
}
