{
	"add": {
		"doc": {
			"id": "0ca00a10b526e3a55d3259d00a47ffaae11fe4a3a34f6ed4023cbac574dc41fa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Trio_on_crosses.jpg/240px-Trio_on_crosses.jpg",
			"previous": [],
				"after": "Most Filipinos today are Christians, with around eighty percent of the population professing Roman Catholicism. The latter was introduced by the Spanish beginning in 1521, and during their 333-year colonization of the islands, they managed to convert a vast majority of Filipinos, resulting in the Philippines becoming the largest Catholic country in Asia. There are also large groups of Protestant denominations, which either grew or were founded following the disestablishment of the Catholic Church during the American Colonial period. The Iglesia ni Cristo is currently the single largest indigenous church, followed by United Church of Christ in the Philippines. The Iglesia Filipina Independiente (also known as the Aglipayan Church) was an earlier development, and is a national church directly resulting from the 1898 Philippine Revolution. Other Christian groups such as the Jesus Miracle Crusade, Mormonism, Orthodoxy, and the Jehovah's Witnesses have a visible presence in the country. Other native inhabitants follow Islam, forming a large minority. Islam in the Philippines is mostly concentrated in southwestern Mindanao and the Sulu Archipelago that still belong to the Philippines, although it is very close to the neighbor country. The Muslims call themselves Moros, a Spanish word that refers to the Moors (albeit the two groups have little cultural connection other than Islam).",
			"color": "silver|0.44049 black|0.1625 light|0.07134 steel|0.07134 blue|0.07134 dark|0.061504 gray|0.061504 dark|0.061504 grey|0.061504 light|0.046081 gray|0.046081 light|0.046081 grey|0.046081 maroon|0.022927 firebrick|0.016014 gainsboro|0.015145 dark|0.013765 red|0.013765 dim|0.013647 gray|0.013647 dim|0.013647 grey|0.013647 thistle|0.013298 gray|0.011882 grey|0.011882 brown|0.010225 lavender|0.0092767 light|0.0066756 blue|0.0066756 rosy|0.0055401 brown|0.0055401 powder|0.0052121 blue|0.0052121 crimson|0.0047487  "
		}
	}
}
