{
	"add": {
		"doc": {
			"id": "0ca70cffb6cfba80cf4417974aaeed1985da574bfe4412d668880ab3b0239be8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/LLTV_crash.jpg/220px-LLTV_crash.jpg",
			"previous": [],
				"after": "There were two distinct modes of flight for the LLRV and LLTV. The basic mode was with the gimbaled engine fixed to the body so that it always pointed downward in relation to the body. But in the gimbaled \"Lunar Sim Mode\", the engine was allowed to swivel and was kept pointing downward to the earth. This allowed the vehicle to tilt at the far greater angles that would be typical of hovering and maneuvering above the lunar surface. Despite its ungainly appearance, the LLRV was equipped with an astonishingly sophisticated array of early sensor and computational hardware. The system had no specific name, but the effect it produced was called \"Lunar Sim Mode\".[6] This was the highest degree of hardware-based simulation, and was the purpose of the whole project. This was not a system to unburden the pilot, such as an autopilot does, nor was it meant to introduce any sort of safety or economy. The system's sole intention was to project the illusion of piloting the Lunar Module. So, Lunar Sim Mode can be thought of as a mixture of stability augmentation, recalculation of vertical acceleration according to the lunar gravity constant, all followed by accompanied instantaneous corrective action. The LLRV's Lunar Sim Mode even was able to counter-correct wind gusts within milliseconds, as they definitely would have disturbed the impression of a missing atmosphere. Sensor input for the Lunar Sim Mode was the Doppler radar. The visually significant sign of an engaged Lunar Sim Mode was the free-gimbaled turbofan, always strictly pointing downward toward the ground, regardless the LLRV's current attitude. This unique aircraft represents one of the few hardware simulators that ever became airborne.",
			"color": "gainsboro|0.092158 light|0.084184 gray|0.084184 light|0.084184 grey|0.084184 white|0.060358 smoke|0.060358 wheat|0.057884 linen|0.045387 dim|0.041084 gray|0.041084 dim|0.041084 grey|0.041084 alice|0.040296 blue|0.040296 mint|0.034605 cream|0.034605 sea|0.034218 shell|0.034218 snow|0.030875 pale|0.027327 golden|0.027327 rod|0.027327 peru|0.027147 ghost|0.026989 white|0.026989 azure|0.026776 floral|0.025649 white|0.025649 antique|0.023219 white|0.023219 beige|0.022707 silver|0.022382 khaki|0.020712 burly|0.019506 wood|0.019506 tan|0.019172 old|0.018919 lace|0.018919 honeydew|0.01695 white|0.015521 dark|0.013714 khaki|0.013714 gray|0.012935 grey|0.012935 blanched|0.01292 almond|0.01292 moccasin|0.01165 golden|0.011253 rod|0.011253 papaya|0.010397 whip|0.010397 ivory|0.010278 bisque|0.008059 lavender|0.0076703 blush|0.0076703 navajo|0.0076479 white|0.0076479 sandy|0.0060658 brown|0.0060658 dark|0.0058373 sea|0.0058373 green|0.0058373 dark|0.0056204 gray|0.0056204 dark|0.0056204 grey|0.0056204 corn|0.0055428 silk|0.0055428  "
		}
	}
}
