{
	"add": {
		"doc": {
			"id": "0caf0e022401e9e24a9cb322a978f62a767a75c205a1627a98a40c104d95c1f9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Kissimmee_River_S-65B_Destruction.jpg/220px-Kissimmee_River_S-65B_Destruction.jpg",
				"previous": "In the 1960s, the C&SF came under increased scrutiny from government overseers and conservation groups. Critics maintained its size was comparable to the Tennessee Valley Authority's dam-building projects during the Great Depression, and that the construction had run into the billions of dollars without any apparent resolution or plan.[19] The projects of the C&SF have been characterized as part of \"crisis and response\" cycles that \"ignored the consequence for the full system, assumed certainty of the future, and succeeded in solving the momentary crisis, but set in motion conditions that exaggerate future crises\".[20] The last project, to build a canal to straighten the winding floodplain of the Kissimmee River that had historically fed Lake Okeechobee which in turn fed the Everglades, began in 1962. Marjory Stoneman Douglas later wrote that the C&SF projects were \"interrelated stupidity\", crowned by the C-38 canal.[21] Designed to replace a meandering 90-mile (140 km) river with a 52-mile (84 km) channel, the canal was completed in 1971 and cost $29 million. It supplanted approximately 45,000 acres (180 km2) of marshland with retention ponds, dams, and vegetation.[22] Loss of habitat has caused the region to experience a drastic decrease of waterfowl, wading birds, and game fish.[23] The reclaimed floodplains were taken over by agriculture, bringing fertilizers and insecticides that washed into Lake Okeechobee. Even before the canal was finished, conservation organizations and sport fishing and hunting groups were calling for the restoration of the Kissimmee River.[22]",
				"after": "Arthur R. Marshall led the efforts to undo the damage. According to Douglas, Marshall was successful in portraying the Everglades from the Kissimmee Chain of Lakes to Florida Bay—including the atmosphere, climate, and limestone—as a single organism. Rather than remaining the preserve of conservation organizations, the cause of restoring the Everglades became a priority for politicians. Douglas observed, \"Marshall accomplished the extraordinary magic of taking the Everglades out of the bleeding-hearts category forever\".[24] At the insistent urging of Marshall, newly elected Governor Bob Graham announced the formation of the \"Save Our Everglades\" campaign in 1983, and in 1985 Graham lifted the first shovel of backfill for a portion of the C-38 canal.[25] Within a year the area was covered with water returning to its original state.[26] Graham declared that by the year 2000, the Everglades would resemble its predrainage state as much as possible.[25] The Kissimmee River Restoration Project was approved by Congress in the Water Resources Development Act of 1992. The project was estimated to cost $578 million to convert only 22 miles (35 km) of the canal; the cost was designed to be divided between the state of Florida and the U.S. government, with the state being responsible for purchasing land to be restored.[27] A project manager for the Army Corps of Engineers explained in 2002, \"What we're doing on this scale is going to be taken to a larger scale when we do the restoration of the Everglades\".[28] The entire project is estimated to be completed by 2011.[27]",
			"color": "dim|0.36216 gray|0.36216 dim|0.36216 grey|0.36216 gray|0.33882 grey|0.33882 slate|0.11164 gray|0.11164 light|0.10165 slate|0.10165 gray|0.10165 dark|0.06266 gray|0.06266 dark|0.06266 grey|0.06266 silver|0.0085571 dark|0.0084053 slate|0.0084053 gray|0.0084053 black|0.0044511  "
		}
	}
}
