{
	"add": {
		"doc": {
			"id": "0cd7f97e9fd8e2dfb9aca68b9ebd64d093d4748e29a1ac89f84200867d73b485",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/20070909_Chicago_Half_Marathon.JPG/250px-20070909_Chicago_Half_Marathon.JPG",
				"previous": "When Chicago was founded in 1833, most of the early building began around the mouth of the Chicago River, as can be seen on a map of the city's original 58 blocks.[86] The overall grade of the city's central, built-up areas, is relatively consistent with the natural flatness of its overall natural geography, generally exhibiting only slight differentiation otherwise. The average land elevation is 579 ft (176 m) above sea level. The lowest points are along the lake shore at 578 ft (176 m), while the highest point, at 672 ft (205 m), is the morainal ridge of Blue Island in the city's far south side.[87]",
				"after": "The Chicago Loop is the central business district, but Chicago is also a city of neighborhoods. Lake Shore Drive runs adjacent to a large portion of Chicago's lakefront. Some of the parks along the waterfront include Lincoln Park, Grant Park, Burnham Park and Jackson Park. Twenty-four public beaches are also found across 26 miles (42 km) of the waterfront.[88] Landfill extends into portions of the lake providing space for Navy Pier, Northerly Island, the Museum Campus, and large portions of the McCormick Place Convention Center. Most of the city's high-rise commercial and residential buildings can be found close to the waterfront.",
			"color": "dark|0.14246 gray|0.14246 dark|0.14246 grey|0.14246 dim|0.14041 gray|0.14041 dim|0.14041 grey|0.14041 slate|0.12249 gray|0.12249 gray|0.10935 grey|0.10935 light|0.081205 steel|0.081205 blue|0.081205 light|0.072462 slate|0.072462 gray|0.072462 light|0.065239 blue|0.065239 dark|0.050109 slate|0.050109 gray|0.050109 black|0.04929 silver|0.046568 dark|0.045586 olive|0.045586 green|0.045586 rosy|0.016418 brown|0.016418 light|0.016398 gray|0.016398 light|0.016398 grey|0.016398 gainsboro|0.0094939  "
		}
	}
}
