{
	"add": {
		"doc": {
			"id": "0cde57061b86c7729e71380b21372d897825c274e5ca0a7a4213f3ab62b5be19",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Edgar_Quinet-Marius_Bar.jpg/220px-Edgar_Quinet-Marius_Bar.jpg",
				"previous": "The armored cruisers built in the mid– to late–1890s were often as large and expensive as pre-dreadnought battleships. They combined long range, high speed and an armament approaching that of battleship with enough armor to protect them against quick-firing guns, considered the most important weapons afloat at the time. Their speed was made possible due to another development, Case-hardened steel armor—first Harvey armor and then crucially Krupp armor. The higher tensile strength of these armors compared to nickel steel and mild steel made it feasible to put a light yet useful armor belt on a large cruiser. They saved further weight by not requiring a heavy timber backing, as previous armor plating had, to soften and spread the force of the impact from oncoming shells; 2.5 inches (64 mm) of teak to give a fair surface upon which to attach them was all that was needed. Moreover, this belt could also be much wider than previously, covering the center of the hull, where the ammunition and engines were located, from the main deck to five feet below the waterline. Steel bulkheads added strength to the hull, while armor as thick as the belt covered the guns and heavier protection surrounded the conning tower. With these improvements, the ships became more fully protected than was possible previously. They were also expensive to maintain at fighting strength as they required a greater number of stokers to feed the boilers than a battleship when steaming at flank speed.[18]",
				"after": "The ideas presented by Mahan prompted French Admiral Ernest François Fournier to write his book La flotte necessaire in 1896. Fournier argued that a fleet of technologically advanced armored cruisers and torpedo craft would be powerful and flexible enough to engage in a wide range of activity and overwhelm potential enemies. French naval and government circles embraced this ideal mutually and even advocates of battleships over cruisers admitted the latter's potential usefulness in scouting and commercial warfare. The result was the building of increasingly large armored cruisers. The Jeanne d'Arc, laid down in 1896, displaced 11,000 tons, carried a mixed armament of 7.6-inch (193 mm) and 5.5-inch (140 mm) guns, and had a 6-inch (152 mm) belt of Harvey armour over her machinery spaces. The 12,300-ton Léon Gambetta class and 14,000-ton Edgar Quinet class followed. With a speed of 22.5 knots, the Léon Gambettas were armed with four 7.6-inch (193 mm) guns in twin turrets and 16 6.5-inch (165 mm) in four single and six twin turrets and were protected by up to six inches (150 mm) of Krupp belt armor and nearly eight inches (200 mm) on their conning towers and turrets. The Edgar Quinets, slightly faster at 23 knots, were armed with 14 7.74-inch (194 mm) guns and carried up to 6.7 inches (170 mm) of armor on their belts, almost four inches (99 mm) on their decks and six inches (150 mm) on their turrets.[19]",
			"color": " "
		}
	}
}
