{
	"add": {
		"doc": {
			"id": "0ceab0255f89322d2e81f5ae98fb593a3b35d2083bd4f198bb320c3b904d4bee",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Seguace_di_dirck_bouts%2C_dittico_con_mater_dolorosa_e_cristo_coronato_di_spine%2C_1450-1500_ca._01.JPG/300px-Seguace_di_dirck_bouts%2C_dittico_con_mater_dolorosa_e_cristo_coronato_di_spine%2C_1450-1500_ca._01.JPG",
				"previous": "Diptychs were widely popular in northern Europe from the mid-15th to the early 16th century. They consisted of two equally sized panels joined by hinges (or, less often, a fixed frame);[136] the panels were usually linked thematically. Hinged panels could be opened and closed like a book, allowing both an interior and exterior view, while the ability to close the wings allowed protection of the inner images.[137] Originating from conventions in Books of Hours, diptychs typically functioned as less expensive and more portable altarpieces.[138] Diptychs are distinct from pendants in that they are physically connected wings and not merely two paintings hung side by side.[139] They were usually near-miniature in scale, and some emulated medieval \"treasury art\" -small pieces made of gold or ivory. The tracery seen in works such as van der Weyden's Virgin and Child reflects ivory carving of the period.[140] The format was adapted by van Eyck and van der Weyden on commission from members of the House of Valois-Burgundy,[137] and refined by Hugo van der Goes, Hans Memling and later Jan van Scorel.[139]",
				"after": "Netherlandish diptychs tend to illustrate only a small range of religious scenes. There are numerous depictions of the Virgin and Child,[141] reflecting the Virgin's contemporary popularity as a subject of devotion.[142] The inner panels consisted mainly of donor portraits – often of husbands and their wives[139] – alongside saints or the Virgin and Child.[137] The donor was nearly always shown kneeling in full or half length, with hands clasped in prayer.[137] The Virgin and Child are always positioned on the right, reflecting the Christian reverence for the right hand side as the \"place of honour\" alongside the divine.[143]",
			"color": "peru|0.12643 tan|0.12462 black|0.11371 sienna|0.10194 brown|0.071107 dim|0.051747 gray|0.051747 dim|0.051747 grey|0.051747 burly|0.043487 wood|0.043487 rosy|0.037292 brown|0.037292 saddle|0.032783 brown|0.032783 gray|0.030045 grey|0.030045 peach|0.024639 puff|0.024639 antique|0.024356 white|0.024356 sandy|0.024224 brown|0.024224  "
		}
	}
}
