{
	"add": {
		"doc": {
			"id": "0cf1b157affb90d2ca556c15708faf6a411465fe0479d957808802ca114f8952",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/98/Terracotta_Warriors_-_Wimbledon_2008.jpg/220px-Terracotta_Warriors_-_Wimbledon_2008.jpg",
				"previous": "From 2009, a new No. 2 Court is being used at Wimbledon with a capacity for 4,000 people. To obtain planning permission, the playing surface is around 3.5m below ground level, ensuring that the single-storey structure is only about 3.5m above ground level, and thus not affecting local views.[22] Plans to build on the current site of Court 13 were dismissed due to the high capacity of games played at the 2012 Olympic Games. The old No.2 Court has been renamed as No.3 Court. The old No.2 Court was known as the \"Graveyard of Champions\" because many highly seeded players were eliminated there during early rounds over the years, including Ilie Năstase, John McEnroe, Boris Becker, Andre Agassi, Pete Sampras, Martina Hingis, Venus Williams, Serena Williams and Maria Sharapova.[23] The court has a capacity of 2,192 + 770 standing. In 2011 a new No.3 Court and a new Court 4 were unveiled on the sites of the old No.2 and 3 courts.[24]",
				"after": "At the northern end of the grounds is a giant television screen on which important matches are broadcast. Fans watch from an area of grass officially known as the Aorangi Terrace. When British players do well at Wimbledon, the hill attracts fans for them, and is often renamed by the press for them: Greg Rusedski's followers convened at \"Rusedski Ridge\", and Tim Henman has had the hill nicknamed Henman Hill. As both of them have now retired and Andy Murray is the number 1 British player, the hill is occasionally referred to as \"Murray Mound\" or \"Murrayfield\", as a reference to his Scottish heritage and the Scottish ground of the same name, but this has largely failed to catch on – the area is still usually referred to as Henman Hill. None of these nicknames are official.",
			"color": "dark|0.47562 gray|0.47562 dark|0.47562 grey|0.47562 gray|0.13963 grey|0.13963 silver|0.097415 dim|0.07505 gray|0.07505 dim|0.07505 grey|0.07505 slate|0.038244 gray|0.038244 light|0.038012 slate|0.038012 gray|0.038012 light|0.016601 gray|0.016601 light|0.016601 grey|0.016601 gainsboro|0.011113 linen|0.0090778 sea|0.0075287 shell|0.0075287 antique|0.0065664 white|0.0065664 old|0.0063482 lace|0.0063482 olive|0.0062899 drab|0.0062899 floral|0.0059933 white|0.0059933 white|0.0053369 smoke|0.0053369 black|0.0052659 dark|0.004626 olive|0.004626 green|0.004626 snow|0.0045022 white|0.0039562 ghost|0.0037945 white|0.0037945 light|0.0037879 steel|0.0037879 blue|0.0037879 misty|0.0037335 rose|0.0037335 papaya|0.003632 whip|0.003632  "
		}
	}
}
