{
	"add": {
		"doc": {
			"id": "0cf7145b02a18c294d1b943a97d0bb1975c0b5d9c9d48497019a2422f6635fcd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Forest_park_trillium_in_multiple_phases_P3903.jpeg/220px-Forest_park_trillium_in_multiple_phases_P3903.jpeg",
				"previous": "The city acquired land for Forest Park bit by bit over several decades. In 1897, Donald Macleay, a Portland merchant and real-estate developer, deeded a 108-acre (44 ha) tract of land along Balch Creek to the city to provide an outdoor space for patients from nearby hospitals.[12] In the 1890s, Frederick Van Voorhies Holman, a Portland lawyer and a president of the Oregon Historical Society, proposed a gift of 52 acres (21 ha) of nearby land that was added to the city's holdings in 1939 when his siblings, George F. and Mary Holman, completed the donation.[5] Clark and Wilson Timber Company donated 17 acres (6.9 ha) in 1927 to create a Western Oregon timber park near Northwest Germantown Road.[13] Nine years later, the estate of Aaron Meier, one of the founders of the Meier & Frank chain of department stores, donated land for Linnton Park near Portland's Linnton neighborhood along Highway 30.[14] These smaller parks became part of the larger park when it was finally created. Some of them, such as Macleay Park, are still referred to by their original names even though they are part of Forest Park.[15]",
				"after": "Other parcels were acquired through government action. In 1928, the City Council's Delinquent Tax Committee transferred land to the Parks Bureau for a wildflower garden along Balch Creek. Multnomah County in that year gave the bureau perpetual use of about 145 acres (59 ha) of land north of Washington Park.[16] Encouraged by the City Club of Portland, which conducted a park feasibility study in 1945, civic leaders supported the Forest Park project. In 1948, Multnomah County transferred to the city another 2,000 acres (810 ha) acquired through delinquent tax foreclosures.[17] On September 23, 1948, the city formally dedicated 4,200 acres (17 km2) of land as Forest Park, which as of 2009 covered more than 5,100 acres (21 km2).[5] It is one of the largest urban forest reserves in the U.S, though its exact ranking has been questioned. The city's Parks and Recreation Department claims it is the \"largest forested natural area within city limits in the United States\".[5] However, an article in the Portland Tribune said Forest Park ranked no higher than third among U.S. urban forests in 2006.[18]",
			"color": "dark|0.32501 sea|0.32501 green|0.32501 dark|0.111 gray|0.111 dark|0.111 grey|0.111 gray|0.11069 grey|0.11069 dim|0.092029 gray|0.092029 dim|0.092029 grey|0.092029 black|0.076551 dark|0.070978 olive|0.070978 green|0.070978 silver|0.060749 light|0.029416 gray|0.029416 light|0.029416 grey|0.029416 gainsboro|0.017802  "
		}
	}
}
