{
	"add": {
		"doc": {
			"id": "0cf874215f394e512646f55ad3f5211aa750952a7b1d216a21268dcdad0c728e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Corncrake.jpg/170px-Corncrake.jpg",
			"previous": [],
				"after": "The corn crake is a difficult bird to see in its breeding sites, usually being hidden by vegetation, but will sometimes emerge into the open. Occasionally, individuals may become very trusting; for five consecutive summers, an individual crake on the Scottish island of Tiree entered a kitchen to feed on scraps, and, in 1999, a wintering Barra bird would come for poultry feed once the chickens had finished.[13] In Africa, it is more secretive than the African crake, and, unlike its relative, it is rarely seen in the open, although it occasionally feeds on tracks or road sides. The corn crake is most active early and late in the day, after heavy rain and during light rain. Its typical flight is weak and fluttering, although less so than that of the African crake. For longer flights, such as migration, it has a steadier, stronger action with legs drawn up. It walks with a high-stepping action, and can run swiftly through grass with its body held horizontal and laterally flattened. It will swim if essential. When flushed by a dog, it will fly less than 50 m (150 ft), frequently landing behind a bush or thicket, and then crouch on landing. If disturbed in the open, this crake will often run in a crouch for a short distance, with its neck stretched forward, then stand upright to watch the intruder. When captured it may feign death, recovering at once if it sees a way out.[12]",
			"color": "olive|0.25542 drab|0.25542 dim|0.12324 gray|0.12324 dim|0.12324 grey|0.12324 black|0.10535 dark|0.088325 olive|0.088325 green|0.088325 dark|0.08661 gray|0.08661 dark|0.08661 grey|0.08661 gray|0.082098 grey|0.082098 silver|0.050288 yellow|0.038466 green|0.038466 light|0.026316 gray|0.026316 light|0.026316 grey|0.026316 dark|0.019968 khaki|0.019968 tan|0.019111 dark|0.016538 sea|0.016538 green|0.016538 gainsboro|0.016292 slate|0.013128 gray|0.013128 dark|0.0099228 slate|0.0099228 gray|0.0099228 light|0.0095145 slate|0.0095145 gray|0.0095145  "
		}
	}
}
