{
	"add": {
		"doc": {
			"id": "0cff3d54bc7543fe582c2b8e11b6cac11c55569373b151ca932a631b53c5ed5e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Noisy_Miners_bathing.jpg/220px-Noisy_Miners_bathing.jpg",
				"previous": "The noisy miner is a gregarious species, and the birds are rarely seen singly or in twos; they forage, move and roost in colonies that can consist of several hundred birds[39]",
				"after": "Within a colony, a male bird will occupy an 'activity space', which will overlap with the activity spaces of other males. Males with overlapping activity spaces form associations called 'coteries', usually consisting of 10 to 25 birds. Coteries are the most stable unit within the colony. The birds also form temporary flocks when engaged in the same activity. These flocks, called 'coalitions', usually comprise five to eight birds, although coalitions of up to 40 birds can occur when mobbing a potential predator. Membership of the coalition changes frequently as individuals leave the group as it passes beyond the boundary of their activity space, or the activity ends or changes, as when the breeding season begins.[40] Females use activity spaces that overlap with those of male birds, but not other females, so that females will join coalitions with males in their area, but only rarely will there be more than one female in the coalition. The exclusivity of female activity spaces leads to young females being driven out of the colony in which they were born, but it also makes it difficult for them to gain a place in a new colony. A study of banded nestlings that survived in one colony until the next breeding season, found that they were all male birds, suggesting that all female nestlings had died or left the colony.[40] Emigration of males does not seem to occur until the population density of the colony reaches a critical level.[39]",
			"color": "burly|0.22682 wood|0.22682 tan|0.1569 dim|0.091108 gray|0.091108 dim|0.091108 grey|0.091108 gray|0.077961 grey|0.077961 thistle|0.054258 dark|0.054222 gray|0.054222 dark|0.054222 grey|0.054222 peach|0.05313 puff|0.05313 black|0.050054 rosy|0.021272 brown|0.021272 silver|0.017325 dark|0.015498 olive|0.015498 green|0.015498 bisque|0.011962 misty|0.01159 rose|0.01159 lavender|0.011137 light|0.0089075 gray|0.0089075 light|0.0089075 grey|0.0089075 antique|0.0088836 white|0.0088836  "
		}
	}
}
