{
	"add": {
		"doc": {
			"id": "0d29a7ff7f75569b32eb303dccfa2d5220b6b76562ce88b58cc7301b5b1e97ac",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Prisoners_and_gendarms_on_the_road_to_Siberia_%28Geoffroy%2C_1845%29.JPG/220px-Prisoners_and_gendarms_on_the_road_to_Siberia_%28Geoffroy%2C_1845%29.JPG",
				"previous": "Siberia was inhabited by different groups of nomads such as the Yenets, the Nenets, the Huns, the Scythians and the Uyghurs. The Khan of Sibir[citation needed] in the vicinity of modern Tobolsk was known as a prominent figure who endorsed Kubrat as Khagan in Avaria in 630. The Mongols conquered a large part of this area early in the 13th century. With the breakup of the Golden Horde, the autonomous Siberia Khanate was established in the late 15th century. Turkic-speaking Yakuts migrated north from the Lake Baikal region under pressure from the Mongol tribes during the 13th to 15th century.[9] Siberia remained a sparsely populated area. Historian John F. Richards wrote: \"... it is doubtful that the total early modern Siberian population exceeded 300,000 persons.\"[10]",
				"after": "The growing power of Russia in the West began to undermine the Siberian Khanate in the 16th century. First, groups of traders and Cossacks began to enter the area, and then the Russian army began to set up forts further and further East. Towns such as Mangazeya, Tara, Yeniseysk and Tobolsk were developed, the last being declared the capital of Siberia. At this time, Sibir was the name of a fortress at Qashlik, near Tobolsk. Gerardus Mercator in a map published in 1595 marks Sibier both as the name of a settlement and of the surrounding territory along a left tributary of the Ob.[11] Other sources contend that the Xibe, an indigenous Tungusic people, offered fierce resistance to Russian expansion beyond the Urals, and that Siberia is a Russification of their ethnonym.",
			"color": "dim|0.26333 gray|0.26333 dim|0.26333 grey|0.26333 gray|0.18682 grey|0.18682 dark|0.14523 gray|0.14523 dark|0.14523 grey|0.14523 black|0.087545 silver|0.076131 light|0.049064 gray|0.049064 light|0.049064 grey|0.049064 gainsboro|0.035972 white|0.014318 smoke|0.014318 light|0.013995 slate|0.013995 gray|0.013995 slate|0.013254 gray|0.013254 sea|0.012086 shell|0.012086 linen|0.010811 floral|0.010765 white|0.010765 snow|0.010663 mint|0.0097821 cream|0.0097821 white|0.0094498 ghost|0.0083046 white|0.0083046 alice|0.0070719 blue|0.0070719 azure|0.0069959 ivory|0.0051235 lavender|0.0048356 blush|0.0048356  "
		}
	}
}
