{
	"add": {
		"doc": {
			"id": "0d3c3538168807f559efed302c0d0f91446a4077771a16bb4e957fb0fd21fc27",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Prado_-_Los_Desastres_de_la_Guerra_-_No._37_-_Esto_es_peor.jpg/220px-Prado_-_Los_Desastres_de_la_Guerra_-_No._37_-_Esto_es_peor.jpg",
				"previous": "Detailing and protesting the ugliness of life is a common theme throughout the history of Spanish art, from the dwarves of Diego Velázquez to Pablo Picasso's Guernica (1937). Reflecting on The Disasters of War, biographer Margherita Abbruzzese notes that Goya asks that the truth \"be seen and ... shown to others; including those who have no wish to see it .... And the blind in spirit stay their eyes on the outward aspect of things, then these outward aspects must be twisted and deformed until they cry out what they are trying to say.\"[6] The series follows a wider European tradition of war art and the examination of the effect of military conflict on civilian life—probably mostly known to Goya via prints. This tradition is reflected especially in Dutch depictions of the Eighty Years' War with Spain, and in the work of 16th-century German artists like Hans Baldung. It is believed Goya owned a copy of a famous set of 18 etchings by Jacques Callot known as Les Grandes Misères de la guerre (1633), which record the devastating impact on Lorraine of Louis XIII's troops during the Thirty Years' War.[53]",
				"after": "The dead man in plate 37, Esto es peor (This is worse), forms a mutilated body of a Spanish fighter spiked on a tree, surrounded by the corpses of French soldiers. It is based in part on the Hellenistic fragment of a male nude, the Belvedere Torso by the Athenian \"Apollonios son of Nestor\". Goya had earlier made a black wash drawing study of the statue during a visit to Rome. In Esto es peor he subverts the classical motifs used in war art through his addition of a degree of black theatre – the branch piercing the body through the anus, twisted neck and close framing.[54] The man is naked; a daring factor for Spanish art in the 19th century, during the time of the Spanish Inquisition.[55] Art critic Robert Hughes remarked that the figures in this image \"remind us that, if only they had been marble and the work of their destruction had been done by time rather than sabres, neo-classicists like Menges would have been in aesthetic raptures over them.\"[56]",
			"color": "silver|0.50735 dark|0.17453 gray|0.17453 dark|0.17453 grey|0.17453 black|0.072732 light|0.070254 gray|0.070254 light|0.070254 grey|0.070254 antique|0.068532 white|0.068532  "
		}
	}
}
