{
	"add": {
		"doc": {
			"id": "0d4cfb52c3c0f125de0f000959ddf89035b9cf038b25d7bf3f744f2594aa056c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Thermal_ionization_mass_spectrometer.jpg/300px-Thermal_ionization_mass_spectrometer.jpg",
			"previous": [],
				"after": "The basic equation of radiometric dating requires that neither the parent nuclide nor the daughter product can enter or leave the material after its formation. The possible confounding effects of contamination of parent and daughter isotopes have to be considered, as do the effects of any loss or gain of such isotopes since the sample was created. It is therefore essential to have as much information as possible about the material being dated and to check for possible signs of alteration.[7] Precision is enhanced if measurements are taken on multiple samples from different locations of the rock body. Alternatively, if several different minerals can be dated from the same sample and are assumed to be formed by the same event and were in equilibrium with the reservoir when they formed, they should form an isochron. This can reduce the problem of contamination. In uranium-lead dating, the concordia diagram is used which also decreases the problem of nuclide loss. Finally, correlation between different isotopic dating methods may be required to confirm the age of a sample. For example, a study of the Amitsoq gneisses from western Greenland used five different radiometric dating methods to examine twelve samples and achieved agreement to within 30 Ma (million years) on an age of 3,640 Ma.[8]",
			"color": "dim|0.30296 gray|0.30296 dim|0.30296 grey|0.30296 gray|0.27373 grey|0.27373 dark|0.12698 gray|0.12698 dark|0.12698 grey|0.12698 black|0.089126 silver|0.055755 light|0.039671 gray|0.039671 light|0.039671 grey|0.039671 gainsboro|0.030894 linen|0.010538 slate|0.008516 gray|0.008516 white|0.0080055 smoke|0.0080055 sea|0.0073943 shell|0.0073943 light|0.0052435 slate|0.0052435 gray|0.0052435 snow|0.0052152 floral|0.0050677 white|0.0050677 lavender|0.0049763 blush|0.0049763  "
		}
	}
}
