{
	"add": {
		"doc": {
			"id": "0d7ba853c0b0684d151641c2a099f838083953c22c929e8bca59c6e6dd2f8e73",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/DESA2007.JPG/170px-DESA2007.JPG",
			"previous": [],
				"after": "Eagle Scout hat pins were produced from 1921 through 1958 with several variations.[33] Eagle Scouts who earned additional merit badges were recognized using Eagle Palms, introduced in 1927. Adults who had earned Eagle Scout began to be recognized in 1934 with a red, white and blue ribbon bar. In 1940, a small eagle pin was added to the bar. Ribbon bars were replaced by embroidered square knot patches in 1947.[34] Over the years, the knot was produced with various background colors to match the different uniforms. Although the Venturing and Sea Scout programs use different uniform shirts, the current knot is available only with a tan background that matches the Boy Scout uniform.[35] When the Distinguished Eagle Scout Award (DESA) was created in 1969,[36] a gold-colored eagle device was introduced for wear on the Eagle Scout square knot. The Law Enforcement Exploring program introduced a ribbon bar to recognize Eagle Scout and the Gold Award of the Girl Scouts of the USA in 1995.[37] The Eagle Scout Mentor pin was introduced in early 2004 in a gold-colored version. In early 2006 it was changed to a silver-colored antique finish to match the mother and father pins but in 2007 was changed back to gold-colored. In 2008, the National Eagle Scout Association (NESA) introduced a knot recognizing those Eagle Scouts who are life members of NESA; it uses the standard knot emblem with a silver border.",
			"color": "dark|0.21189 slate|0.21189 blue|0.21189 silver|0.07017 dark|0.069251 khaki|0.069251 light|0.067939 gray|0.067939 light|0.067939 grey|0.067939 pale|0.061396 golden|0.061396 rod|0.061396 gainsboro|0.058577 tan|0.055518 dark|0.052832 gray|0.052832 dark|0.052832 grey|0.052832 burly|0.03938 wood|0.03938 wheat|0.025993 white|0.022895 smoke|0.022895 linen|0.016165 khaki|0.015015 moccasin|0.01464 brown|0.014402 dim|0.014172 gray|0.014172 dim|0.014172 grey|0.014172 lemon|0.013254 chiffon|0.013254 sea|0.013117 shell|0.013117 navajo|0.012889 white|0.012889 snow|0.012481 ghost|0.01238 white|0.01238 lavender|0.012064 blush|0.012064 alice|0.012036 blue|0.012036 lavender|0.011608 gray|0.0094479 grey|0.0094479 light|0.0084872 golden|0.0084872 rod|0.0084872 yellow|0.0084872 white|0.0075643 floral|0.0063048 white|0.0063048 mint|0.0060156 cream|0.0060156  "
		}
	}
}
