{
	"add": {
		"doc": {
			"id": "0d814eb1ee4f93faeca6b03b45d1e4b400f22c55b9c14b23b627d404174d1bba",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Bazille%2C_Fr%C3%A9d%C3%A9ric_~_Summer_Scene%2C_1869%2C_Oil_on_canvas_Fogg_Art_Museum%2C_Cambridge%2C_Massachusetts.jpg/220px-Bazille%2C_Fr%C3%A9d%C3%A9ric_~_Summer_Scene%2C_1869%2C_Oil_on_canvas_Fogg_Art_Museum%2C_Cambridge%2C_Massachusetts.jpg",
				"previous": "The painting shows Eakins and five friends or students bathing at Dove Lake, an artificial lake in Mill Creek outside Philadelphia.[2] Each of the men is looking at the water, in the words of Martin A. Berger, \"apparently lost in a contemplative moment\".[14] Eakins' precise rendering of the figures has enabled scholars to identify all those depicted in the work. They are (from left to right): Talcott Williams (1849–1928), Benjamin Fox (c. 1865 – c. 1900), John Laurie Wallace (1864–1953), Jesse Godley (1862–1889), Harry the dog (Eakins' Irish Setter, c. 1880–90), George Reynolds (c. 1839–89), and Eakins himself.[14] The rocky promontory on which several of the men rest is the foundation of the Mill Creek mill, which was razed in 1873. It is the only sign of civilization in the work—no shoes, clothes, or bath houses are visible.[4] The foliage in the background provides a dark background against which the swimmers' skin tones contrast.",
				"after": "The composition is pyramidal. The figure reclining at left leads the viewer's eye to the seated figure, whose gesture in turn points to Godley at the apex of the compositional pyramid. The diving figure at right leads to the swimming form of Eakins, who painted himself into the scene and whose leftward movement directs attention back into the painting.[3][16] Eakins enforces this pyramidal structure by manipulating the focus of the painting: the center area containing the swimmers is extremely precise, while the outer areas are diffuse, with \"virtually no moderating zones in between\".[17] The lighting within the picture is unnatural—too bright in some places, and too dark in others—although the effect, which tends to accentuate the body lines of the swimmers, is generally subtle.[17]",
			"color": "dark|0.31148 olive|0.31148 green|0.31148 tan|0.19376 black|0.16727 dark|0.052954 sea|0.052954 green|0.052954 cadet|0.04659 blue|0.04659 dark|0.038545 khaki|0.038545 rosy|0.038305 brown|0.038305 burly|0.036976 wood|0.036976  "
		}
	}
}
