{
	"add": {
		"doc": {
			"id": "0d82c5f4d4e2ffbb65930b52301753bfc94f48a0e359ac10d51662c707f06aa8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Lusitania_Prop.jpg/220px-Lusitania_Prop.jpg",
				"previous": "Included in Lusitania‍ '​s cargo were 4,200,000 rounds of Remington .303 rifle cartridges, 1,250 cases of empty 3-inch (76 mm) fragmentation shell casings and eighteen cases of non-explosive fuses,[54] all of which were listed on the ship's two-page manifest, filed with US Customs after she departed New York on 1 May.[98][99] However, these munitions were classed as small arms ammunition, were non-explosive in bulk, and were clearly marked as such. It was perfectly legal under American shipping regulations for the liner to carry these; experts agreed they were not to blame for the second explosion.[citation needed] Allegations the ship was carrying more controversial cargo, such as fine aluminium powder, concealed as cheese on her cargo manifests, or guncotton (pyroxylene) disguised as casks of beef, have never been proven.[citation needed] Recent expeditions to the wreck have shown that her cargo holds remain intact and show no evidence of internal explosion.[citation needed]",
				"after": "In 1993, Dr. Robert Ballard, the famous explorer who discovered Titanic and Bismarck, conducted an in-depth exploration of the wreck of Lusitania. Ballard found John Light (who dove on the wreck in the 1960s) had been mistaken in his identification of a gaping hole in the ship's side. To explain the second explosion, Ballard advanced the theory of a coal-dust explosion. He believed dust in the bunkers would have been thrown into the air by the vibration from the explosion; the resulting cloud would have been ignited by a spark, causing the second explosion. In the years since he first advanced this theory, it has been argued that this is nearly impossible. Critics of the theory say coal dust would have been too damp to have been stirred into the air by the torpedo impact in explosive concentrations; additionally, the coal bunker where the torpedo struck would have been flooded almost immediately by seawater flowing through the damaged hull plates.[99][100]",
			"color": "dim|0.50918 gray|0.50918 dim|0.50918 grey|0.50918 gray|0.1489 grey|0.1489 black|0.092962 slate|0.088487 gray|0.088487 dark|0.05056 gray|0.05056 dark|0.05056 grey|0.05056 dark|0.046767 slate|0.046767 gray|0.046767 light|0.038028 slate|0.038028 gray|0.038028 silver|0.0089496  "
		}
	}
}
