{
	"add": {
		"doc": {
			"id": "0d83d5afe8b622d5ae6e559d98566b7e44f978a34cd38a855476810f097158c2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Andrianampoinimerina.jpg/170px-Andrianampoinimerina.jpg",
				"previous": "The earliest settlement at the height of Ambohimanga was most likely established in the 15th century, coinciding with the arrival of the Merina in the highlands.[10] Rice paddies took the place of the original valley forests by the 16th century,[1] and the growing population near the valleys around Ambohimanga became known by the clan name Tantsaha (\"people of the cultivated land\").[11] According to oral history, however, the first to settle the site of the Ambohimanga rova was Andriamborona,[3] the dethroned prince of the highland territory of Imamo, who relocated to the then-unpopulated hilltop in around 1700 accompanied by his nephew, his wife, and his mother, Ratompobe. Merina king Andriamasinavalona (1675–1710), who reigned over Imerina from his royal compound in Antananarivo, noticed a bonfire lit by the family on the southern face of the hill 24 kilometers away. The visibility of the site from his capital led Andriamasinavalona to desire Ambohimanga as a residence for his son, Andriantsimitoviaminiandriana. Andriamborona and his family agreed to shift three times to different parts of the hill, including the future site of the royal compound of Bevato, in response to consecutive requests from the king. For a short time he and the prince lived in neighboring houses at Bevato before Andriamborona and his family finally left the hill for the distant highland village of Ambatolampy, where he lived the rest of his life; the king retrieved their bodies for burial at Ambohimanga.[12]",
				"after": "In 1710, Andriamasinavalona divided the Kingdom of Imerina into four quadrants, which were given to his four favorite sons to rule. Andriantsimitoviaminiandriana received the eastern quadrant, Avaradrano, and transformed his rova at Ambohimanga into its capital.[13] As the first king of Avaradrano (1710–1730),[3][14] Andriantsimitoviaminiandriana also built the site's defensive walls and its first set of seven gates.[1] Rather than rule their respective territories peacefully as Andriamasinavalona had intended, his four sons began a series of wars to seize control of neighboring territory, causing famine and suffering among the peasant population of Imerina. Andriantsimitoviaminiandriana spent much of his reign strengthening the authority of his governance at Ambohimanga and attracting residents to settle in the surrounding villages while battling his brothers to increase the land under his control.[12] He was succeeded by his adopted son, Andriambelomasina (1730–1770), who continued to rule Avaradrano from Ambohimanga in the Mahandrihono compound he built beside the original compound of Besakana. Andriambelomasina significantly expanded Ambohimanga and strengthened its defenses, enabling him to successfully repel an attack against the rova by a band of Sakalava warriors employed by his chief rival, the ruler of Antananarivo.[12] He named as his successor his eldest son, Andrianjafy (1770–1787), and designated his grandson Andrianampoinimerina to follow Andrianjafy in the order of succession.[12] Andrianjafy, a weak and unjust ruler, maintained his capital at Ambohimanga where he built a new private compound called Nanjakana,[15] but often resided in the nearby village of Ilafy.[12]",
			"color": "black|0.46445 tan|0.13141 sienna|0.053694 dark|0.037591 salmon|0.037591 wheat|0.023143 rosy|0.020241 brown|0.020241 brown|0.019834 antique|0.014738 white|0.014738 bisque|0.014339 indian|0.013561 red|0.013561 dark|0.013411 gray|0.013411 dark|0.013411 grey|0.013411 blanched|0.012379 almond|0.012379 silver|0.011882  "
		}
	}
}
