{
	"add": {
		"doc": {
			"id": "0d857b1b3f73d8e33090ae84ea5becea53a9a5c974599a162159f1b4c41b7993",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/HMS_Queen_Elizabeth_in_Rosyth_Dockyard_MOD_45158229.jpg/220px-HMS_Queen_Elizabeth_in_Rosyth_Dockyard_MOD_45158229.jpg",
				"previous": "One of the most important operations conducted predominantly by the Royal Navy after the Second World War was the 1982 defeat of Argentina in the Falkland Islands War. Despite losing four naval ships and other civilian and RFA ships, the Royal Navy fought and won a war over 8,000 miles (12,000 km) from Great Britain. HMS Conqueror is the only nuclear-powered submarine to have engaged an enemy ship with torpedoes, sinking the cruiser ARA General Belgrano. The war also underlined the importance of aircraft carriers and submarines and exposed the weaknesses of the service's late 20th century dependence on chartered merchant vessels.",
				"after": "Before the Falklands War, Defence Secretary John Nott had advocated and initiated a series of cutbacks to the Navy.[64] The Falklands War though, provided a reprieve in Nott-proposed cutbacks, and proved a need for the Royal Navy to regain an expeditionary and littoral capability which, with its resources and structure at the time, would prove difficult. At the beginning of the 1980s, the Royal Navy was a force focused on blue water anti-submarine warfare. Its purpose was to search for and destroy Soviet submarines in the North Atlantic, and to operate the nuclear deterrent submarine force. For a time Hermes was retained, along with all three of the Invincible-class light aircraft carriers. More Sea Harriers were ordered; not just to replace losses, but to also increase the size of the Fleet Air Arm. New and more capable ships were built; notably the Sheffield-class destroyers, the Type 21, Type 22, and Type 23 frigates, and new LPDs of the Albion class, and HMS Ocean, but never in the numbers of the ships that they replaced. As a result, the RN surface fleet continues to reduce in size. A 2013 report found that the current RN was already too small, and that Britain would have to depend on her allies if her territories were attacked.[65]",
			"color": "slate|0.2892 gray|0.2892 light|0.26025 slate|0.26025 gray|0.26025 dim|0.11965 gray|0.11965 dim|0.11965 grey|0.11965 gray|0.065179 grey|0.065179 dark|0.049791 gray|0.049791 dark|0.049791 grey|0.049791 dark|0.038705 slate|0.038705 gray|0.038705 black|0.035162 silver|0.027181 light|0.022233 gray|0.022233 light|0.022233 grey|0.022233 rosy|0.021009 brown|0.021009 gainsboro|0.018043  "
		}
	}
}
