{
	"add": {
		"doc": {
			"id": "0d8baa22dbaed5ba50672363cb267bcffcaa2b242dbac69b94af5b63f433a662",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Giant_Otter_Anjo.JPG/220px-Giant_Otter_Anjo.JPG",
				"previous": "The giant otter is large, gregarious, and diurnal. Early travellers' reports describe noisy groups surrounding explorers' boats, but little scientific information was available on the species until Duplaix's groundbreaking work in the late 1970s.[19] Concern over this endangered species has since generated a body of research.",
				"after": "The giant otter is clearly distinguished from other otters by morphological and behavioral characteristics. It has the greatest body length of any species in the mustelid family, although the sea otter may be heavier. Males are between 1.5 and 1.7 m (4.9 and 5.6 ft) in length from head to tail and females between 1 and 1.5 m (3.3 and 4.9 ft). The animal's well-muscled tail can add a further 70 cm (28 in) to the total body length.[20][21] Early reports of skins and living animals suggested exceptionally large males of up to 2.4 m (7.9 ft); intensive hunting likely reduced the occurrence of such massive specimens. Weights are between 26 and 32 kg (57 and 71 lb) for males and 22 and 26 kg (49 and 57 lb) for females.[22] The giant otter has the shortest fur of all otter species; it is typically chocolate brown, but may be reddish or fawn, and appears nearly black when wet.[23] The fur is extremely dense, so much so that water cannot penetrate to the skin.[24] Guard hairs trap water and keep the inner fur dry; the guard hairs are approximately 8 millimeters (one-third of an inch) in length, about twice as long as the fur of the inner coat.[25] Its velvety feel makes the animal highly sought after by fur traders and has contributed to its decline.[26] Unique markings of white or cream fur color the throat and under the chin, allow individuals to be identified from birth.[23] Giant otters use these marks to recognize one another, and upon meeting other otters, they engage in a behavior known as \"periscoping\", displaying their throats and upper chests to each other.",
			"color": "sea|0.061212 shell|0.061212 floral|0.058893 white|0.058893 linen|0.055349 dark|0.053255 gray|0.053255 dark|0.053255 grey|0.053255 light|0.052118 gray|0.052118 light|0.052118 grey|0.052118 silver|0.051419 dim|0.05116 gray|0.05116 dim|0.05116 grey|0.05116 gray|0.050198 grey|0.050198 white|0.049269 smoke|0.049269 snow|0.04524 old|0.043752 lace|0.043752 mint|0.04241 cream|0.04241 gainsboro|0.042105 antique|0.04155 white|0.04155 white|0.039533 ivory|0.039446 ghost|0.025235 white|0.025235 azure|0.021625 beige|0.02135 tan|0.020516 lavender|0.019763 blush|0.019763 alice|0.019116 blue|0.019116 honeydew|0.016109 papaya|0.014738 whip|0.014738 burly|0.014645 wood|0.014645 corn|0.012143 silk|0.012143  "
		}
	}
}
