{
	"add": {
		"doc": {
			"id": "0d9d7cd6c1bc78d1d50e67666a47a30480a225cbefe35870a26ed5aa06de704e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Seal_of_Missouri.svg/100px-Seal_of_Missouri.svg.png",
				"previous": "Missouri (i/mɨˈzʊəri/ or /mɨˈzʊərə/) is a U.S. state located in the Midwestern United States, bordered by Iowa, Illinois, Kentucky, Tennessee, Arkansas, Oklahoma, Kansas and Nebraska. With a 2009 estimated population of 5,987,580, Missouri is the 18th most populous state in the nation and the fifth most populous in the Midwest. It comprises 114 counties and one independent city. Missouri's capital is Jefferson City. The four largest urban areas are St. Louis, Kansas City, Springfield, and Columbia. Missouri was originally acquired from France as part of the Louisiana Purchase and became defined as the Missouri Territory. Part of the Missouri Territory was admitted into the union as the 24th state on August 10, 1821.",
				"after": "Missouri mirrors the demographic, economic and political makeup of the nation with a mix of urban and rural culture. It has long been considered a political bellwether state. With the exceptions of 1956 and 2008, Missouri's results in U.S. presidential elections have accurately predicted the next President of the United States in every election since 1904. It has both Midwestern and Southern cultural influences, reflecting its history as a border state. It is also a transition between the Eastern and Western United States, as St. Louis is often called the \"western-most Eastern city\" and Kansas City the \"eastern-most Western city.\" Missouri's geography is highly varied. The northern part of the state lies in dissected till plains while the southern part lies in the Ozark Mountains (a dissected plateau), with the Missouri River dividing the two. The confluence of the Mississippi and Missouri rivers is located near St. Louis.",
			"color": "saddle|0.19149 brown|0.19149 sienna|0.18548 golden|0.13453 rod|0.13453 dark|0.067721 golden|0.067721 rod|0.067721 gold|0.043523 steel|0.038479 blue|0.038479 gray|0.035872 grey|0.035872 dim|0.03335 gray|0.03335 dim|0.03335 grey|0.03335 dark|0.022319 gray|0.022319 dark|0.022319 grey|0.022319 silver|0.01396 light|0.013583 gray|0.013583 light|0.013583 grey|0.013583 white|0.012835 smoke|0.012835 gainsboro|0.011965 alice|0.011375 blue|0.011375 snow|0.011295 ghost|0.011036 white|0.011036 sea|0.010734 shell|0.010734 white|0.010564 mint|0.010106 cream|0.010106 lavender|0.0099178 blush|0.0099178 light|0.0098889 steel|0.0098889 blue|0.0098889 floral|0.009707 white|0.009707 azure|0.0092822 firebrick|0.0085477 light|0.007523 blue|0.007523 sea|0.0073104 green|0.0073104 dark|0.0070838 khaki|0.0070838 sky|0.0059315 blue|0.0059315 tan|0.005667  "
		}
	}
}
