{
	"add": {
		"doc": {
			"id": "0da487ea34770995abb49fdb8aefb7326ac8bce3a40f7506d0ceabfc3b8f863a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/WC07b.JPG/220px-WC07b.JPG",
			"previous": [],
				"after": "Despite their ancient history, all living Andalusians trace to a small number of horses bred by religious orders in the 18th and 19th centuries. An influx of heavy horse blood beginning in the 16th century, resulted in the dilution of many of the bloodlines; only those protected by selective breeding remained intact to become the modern Andalusian.[37] During the 19th century, the Andalusian breed was threatened because many horses were stolen or requisitioned in wartime, including the War of the Oranges, the Peninsular War and the three Carlist Wars. Napoleon's invading army also stole many horses. One herd of Andalusians was hidden from the invaders however, and subsequently used to renew the breed.[6][38] In 1822, breeders began to add Norman blood into Spanish bloodlines, as well as further infusions of Arabian blood. This was partially because increasing mechanization and changing needs within the military called for horses with more speed in cavalry charges as well as horses with more bulk for pulling gun carriages.[38] In 1832, an epidemic seriously affected Spain's horse population, from which only one small herd survived in a stud at the monastery in Cartuja.[6] During the 19th and early 20th centuries, European breeders, especially the Germans, changed from an emphasis on Andalusian and Neapolitan horses (an emphasis that had been in place since the decline of chivalry), to an emphasis on the breeding of Thoroughbreds and warmbloods, further depleting the stock of Andalusians.[39] Despite this change in focus, Andalusian breeding slowly recovered, and in 1869, the Seville Horse Fair (originally begun by the Romans), played host to between ten and twelve thousand Spanish horses.[40] In the early 20th century, Spanish horse breeding began to focus on other breeds, particularly draft breeds, Arabians, Thoroughbreds and crosses between these breeds, as well as crosses between these breeds and the Andalusian. The purebred Andalusian was not viewed favorably by breeders or the military, and their numbers decreased significantly.[38]",
			"color": "dim|0.23199 gray|0.23199 dim|0.23199 grey|0.23199 gray|0.17938 grey|0.17938 dark|0.14056 gray|0.14056 dark|0.14056 grey|0.14056 light|0.072467 steel|0.072467 blue|0.072467 light|0.071031 slate|0.071031 gray|0.071031 light|0.05555 blue|0.05555 slate|0.047824 gray|0.047824 silver|0.046124 black|0.029044 dark|0.022712 slate|0.022712 gray|0.022712 powder|0.022202 blue|0.022202 light|0.020447 gray|0.020447 light|0.020447 grey|0.020447 gainsboro|0.015198 alice|0.0074372 blue|0.0074372 light|0.0072076 cyan|0.0072076  "
		}
	}
}
