{
	"add": {
		"doc": {
			"id": "0da6f7733e7d812591dc3f507168f7f15c53439ef3b44decf2817b957fb7b2f0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Takalik_Abaj_Altar_48.jpg/220px-Takalik_Abaj_Altar_48.jpg",
				"previous": "Altar 12 is carved in the early Maya style and archaeologists consider it to be an especially early example dating to the first part of the Late Preclassic.[37] Because of the carvings on the upper face of the altar, it is supposed that the monument was originally erected as a vertical stela in the Late Preclassic, and was reused as a horizontal altar in the Classic. At this time 16 hieroglyphs were carved around the outer rim of the altar. The carving on the upper face of the altar represents a standing human figure portrayed in profile, facing left. The figure is flanked by two vertical series of four glyphs. A smaller profile figure is depicted facing the first figure, separated from it by one of the series of glyphs. The central figure is depicted standing upon a horizontal band representing the earth, the band is flanked by two earth monsters. Above the figure is a celestial band with part of the head of a sacred bird visible in the centre. The 16 glyphs on the rim of the monument are formed by anthropomorphic figures mixed with other elements.[124]",
				"after": "Altar 13 is another early Maya monument dating to the Late Preclassic. Like Altar 12 it was probably originally erected as a vertical stela. At some point it was deliberately broken, with severe damage inflicted upon the main portion of the sculpture, obliterating the central and lower portions. At a later date it was reused as a horizontal altar. The remains of two figures can be seen flanking the damage lower portion of the monument and the large head of the sacred bird survives above the area of damage. The right hand figure is wearing an interwoven skirt and is probably female.[125]",
			"color": "dark|0.82043 khaki|0.82043 pale|0.08951 golden|0.08951 rod|0.08951 wheat|0.048874  "
		}
	}
}
