{
	"add": {
		"doc": {
			"id": "0da754ba23e3c220725c97edda738f102bd3f12fadcae78d56db93d201515ee3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Scholle_mit_Speck.jpg/220px-Scholle_mit_Speck.jpg",
				"previous": "Hamburg is noted for several festivals and regular events. Some of them are street festivals, such as the gay pride Christopher Street Day festival[57] or the Alster fair,[58] held at the Binnenalster. The Hamburger DOM is northern Germany's biggest fun fair, held three times a year.[59] Hafengeburtstag is a funfair to honour the birthday of the port of Hamburg with a party and a ship parade.[60] The biker's service in Saint Michael's Church attracts tens of thousands of bikers.[61] Christmas markets in December are held at the Hamburg Rathaus square, among other places.[62] The long night of museums offers one entrance fee for about 40 museums until midnight.[63] The sixth Festival of Cultures was held in September 2008, celebrating multi-cultural life.[64] The Filmfest Hamburg — a film festival originating from the 1950s Film Days (German: Film Tage) — presents a wide range of films.[65] The Hamburg Messe and Congress offers a venue for trade shows, such hanseboot, an international boat show, or Du und deine Welt, a large consumer products show.[66] Regular sports events—some open to pro and amateur participants—are the cycling competition Vattenfall Cyclassics, the Hamburg Marathon, the biggest marathon in Germany after Berlin,[67] the tennis tournament Hamburg Masters and equestrian events like the Deutsches Derby. Since 2007, Hamburg has the Dockville music and art festival. It takes place every year in summer in Wilhelmsburg.[68]",
				"after": "Original Hamburg dishes are Birnen, Bohnen und Speck (green beans cooked with pears and bacon),[69] Aalsuppe (Hamburgisch Oolsupp) is often mistaken to be German for “eel soup“ (Aal/Ool translated ‘eel’), but the name probably comes from the Low Saxon allns [aˑlns], meaning “all”, “everything and the kitchen sink”, not necessarily eel. Today eel is often included to meet the expectations of unsuspecting diners.[70] There is Bratkartoffeln (pan-fried potato slices), Finkenwerder Scholle (Low Saxon Finkwarder Scholl, pan-fried plaice), Pannfisch (pan-fried fish with mustard sauce),[71] Rote Grütze (Low Saxon Rode Grütt, related to Danish rødgrød, a type of summer pudding made mostly from berries and usually served with cream, like Danish rødgrød med fløde)[72] and Labskaus (a mixture of corned beef, mashed potatoes and beetroot, a cousin of the Norwegian lapskaus and Liverpool's lobscouse, all offshoots off an old-time one-pot meal that used to be the main component of the common sailor's humdrum diet on the high seas).[73]",
			"color": "silver|0.27518 dark|0.26688 gray|0.26688 dark|0.26688 grey|0.26688 light|0.13353 gray|0.13353 light|0.13353 grey|0.13353 peru|0.057928 burly|0.04597 wood|0.04597 gainsboro|0.042011 chocolate|0.031536 sienna|0.027616 tan|0.020447 gray|0.017416 grey|0.017416 saddle|0.013303 brown|0.013303 brown|0.0071222 dark|0.0048708 salmon|0.0048708 rosy|0.0045027 brown|0.0045027 indian|0.0039349 red|0.0039349  "
		}
	}
}
