{
	"add": {
		"doc": {
			"id": "0da908b98a3ea36aa646128ad03f6831b64c70b050c7bbfa9500d83a9b72d561",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Korea-Gyeongju-Rice_paddy_field-01.jpg/220px-Korea-Gyeongju-Rice_paddy_field-01.jpg",
				"previous": "Fishing takes place in coastal towns, especially in Gampo-eup in the city's northeast, with 436 registered fishing craft in the city.[58] Fishing industry in Gyeongju is generally in a declined status due to relatively inconvenient transport conditions and lacks of subordinate facilities.[16] Much of the catch from these boats goes direct from the harbor to Gyeongju's many seafood restaurants. Mainly, sauries, anchovies, rays are harvested and a small number of abalone and wakame farming takes place. Local specialties include myeolchijeot (fermented anchovy), abalone, wakame, and squid.[145]",
				"after": "Agriculture is still important, particularly in the outlying regions of Gyeongju. According to the 2006 statistical yearbook of Gyeongju, rice fields occupy an area of 169.57 km2 (65.47 sq mi), which is 70% of the total cultivated acreage of 24,359 km2 (9,405 sq mi). The remaining 74.02 km2 (28.58 sq mi) consists of fields under other crops and farmsteads. Crop production is centered in the fertile river basins near the Hyeongsan River. The main crops are rice, barley, beans and corn. Vegetables such as daikon and napa cabbage and fruits are also important crops. Apples are mainly produced in the districts of Geoncheon-eup, Gangdong-myeon and Cheonbuk-myeon and Korean pear are cultivated in Geoncheon-eup and Angang-eup. The city plays a leading role in the domestic production of beef and mushrooms. Button mushrooms harvested in Geoncheon-eup are canned and exported.[15] The cultivated acreage and the number of households engaging in agriculture is however declining.[16]",
			"color": "dark|0.27717 slate|0.27717 gray|0.27717 dim|0.23907 gray|0.23907 dim|0.23907 grey|0.23907 olive|0.16006 dark|0.066503 olive|0.066503 green|0.066503 black|0.050137 gray|0.047544 grey|0.047544 dark|0.041844 gray|0.041844 dark|0.041844 grey|0.041844 light|0.026874 slate|0.026874 gray|0.026874 dark|0.024596 khaki|0.024596  "
		}
	}
}
