{
	"add": {
		"doc": {
			"id": "0dac223ca3e90613fe287ebc841ef1e80675f72046d92b5e8e778c7fd19d1cc7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Lamgods_open.jpg/400px-Lamgods_open.jpg",
				"previous": "The term \"Early Netherlandish art\" applies broadly to painters active during the 15th and 16th centuries[3] in the northern European areas controlled by the Dukes of Burgundy and later the Habsburg dynasty. These artists became an early driving force behind the Northern Renaissance and the move away from the Gothic style. In this political and art-historical context, the north follows the Burgundian lands which straddled areas that encompass parts of modern France, Germany, Belgium and the Netherlands.[4]",
				"after": "The Netherlandish artists have been known by a variety of terms. \"Late Gothic\" is an early designation which emphasises continuity with the art of the Middle Ages.[5] In the early 1900s the artists were variously referred to in English as the \"Ghent-Bruges school\" or the \"Old Netherlandish school\". \"Flemish Primitives\" is a traditional art-historical term borrowed from the French[6] that became popular after 1902[7][A] and remains in use today, especially in Dutch and German.[5] In this context, \"primitive\" does not refer to a perceived lack of sophistication, but rather identifies the artists as originators of a new tradition in painting. Erwin Panofsky preferred the term ars nova (\"new art\"), which linked the movement with innovative composers of music such as Guillaume Dufay and Gilles Binchois, who were favoured by the Burgundian court over artists attached to the lavish French court.[8] When the Burgundian dukes established centres of power in the Netherlands, they brought with them a more cosmopolitan outlook.[9] According to Otto Pächt a simultaneous shift in art began sometime between 1406 and 1420 when a \"revolution took place in painting\"; a \"new beauty\" in art emerged, one that depicted the visible rather than the metaphysical world.[9]",
			"color": "black|0.086891 sienna|0.073023 brown|0.070831 tan|0.056187 burly|0.049628 wood|0.049628 peru|0.043558 dim|0.042531 gray|0.042531 dim|0.042531 grey|0.042531 firebrick|0.036355 light|0.034601 slate|0.034601 gray|0.034601 dark|0.033975 gray|0.033975 dark|0.033975 grey|0.033975 silver|0.030047 gray|0.028312 grey|0.028312 slate|0.025569 gray|0.025569 light|0.024506 gray|0.024506 light|0.024506 grey|0.024506 dark|0.023151 salmon|0.023151 saddle|0.022437 brown|0.022437 rosy|0.019994 brown|0.019994 indian|0.01829 red|0.01829  "
		}
	}
}
