{
	"add": {
		"doc": {
			"id": "0dd25ac1238e1f1346dc943c16d8586ef6e29524ce60b9a4d8617f9751a3ce16",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/1/11/Florida_Platform.jpg/250px-Florida_Platform.jpg",
			"previous": [],
				"after": "Lying within a coastal plain, the St. Johns River passes through an area that was at one time barrier islands, coastal dunes, and estuary marshes. The Florida Peninsula was created primarily by forces and minerals from the ocean. It lies so low that minor fluctuations in sea levels can have a dramatic effect on its geomorphology. Florida was once part of the supercontinent Gondwana. Lying underneath the visible rock formations is a basement of igneous granite and volcanic composition under a sedimentary layer formed during the Paleozoic era 542 to 251 million years ago. During the Cretaceous period (145 to 66 million years ago), the basement and its sedimentary overlay were further covered by calcium carbonate and formations left by the evaporation of water called evaporites.[61] What covers the peninsula is the result of simultaneous processes of deposits of sands, shells, and coral, and erosion from water and weather.[62] As ocean water has retreated and progressed, the peninsula has been covered with sea water at least seven times. Waves compressed sands, calcium carbonate, and shells into limestone; at the ocean's edge, beach ridges were created by this depositional forming. North-south axis rivers, such as the St. Johns, were created by past beach ridges which were often divided by swales. As ocean water retreated, lagoons formed in the swales, which were further eroded by acidic water.[63] Barrier islands, furthermore, formed along the Atlantic Coast, surrounding the lagoon with land and forming a freshwater river.[10]",
			"color": "dark|0.13585 gray|0.13585 dark|0.13585 grey|0.13585 pale|0.12889 turquoise|0.12889 light|0.12545 cyan|0.12545 silver|0.11824 powder|0.10294 blue|0.10294 light|0.052236 gray|0.052236 light|0.052236 grey|0.052236 azure|0.04845 honeydew|0.047217 gainsboro|0.04674 mint|0.039341 cream|0.039341 white|0.027037 smoke|0.027037 alice|0.026066 blue|0.026066 gray|0.020126 grey|0.020126 white|0.018055 ghost|0.014314 white|0.014314 snow|0.013294 dim|0.011289 gray|0.011289 dim|0.011289 grey|0.011289 floral|0.0088222 white|0.0088222 dark|0.0058262 slate|0.0058262 gray|0.0058262 ivory|0.0039924  "
		}
	}
}
