{
	"add": {
		"doc": {
			"id": "0ddd10e5834ce1792c561b090366c2f56b1616f67788cf558860cd1a5bf8d7ed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Wikimania_2007_puzzle_ball.jpg/220px-Wikimania_2007_puzzle_ball.jpg",
				"previous": "In 2007, a modified 3D model was developed by Wikimedia Taiwan for Wikimania, when they distributed a 3-inch diameter spherical puzzle based on the logo, that attendees could piece together. It did not add other letters on the parts that cannot be seen on the 2D logo, but used that space to include small logos of the sister projects and information about Wikimania. A variant of that model was used to build a person-sized Wikiball that spun on a stand, featured during the event.[7] This led to a renewed interest in getting a proper 3D model for the logo.",
				"after": "By 2007, users on listservs discovered that the logo had some minor errors. The errors were not immediately fixed, because, according to Friedland, he could not locate the original project file. Friedland added that \"I have tried to reconstruct it, but it never looks right\" and that the logo \"should be redrawn by a professional illustrator.\"[5] Kizu Naoko (木津 尚子?), a Wikipedian, said that most Japanese users supported correcting the errors. In an e-mail to Noam Cohen of The New York Times, Kizu said that \"It could be an option to leave them as they are. Most people don't take it serious [sic] and think the graphical logo is a sort of pot-au-feu of various letters without meaning.\"[5]",
			"color": "light|0.117 gray|0.117 light|0.117 grey|0.117 silver|0.1094 gainsboro|0.10348 dark|0.078951 gray|0.078951 dark|0.078951 grey|0.078951 white|0.064124 smoke|0.064124 snow|0.0503 sea|0.049751 shell|0.049751 ghost|0.047505 white|0.047505 alice|0.046247 blue|0.046247 white|0.043762 mint|0.039634 cream|0.039634 floral|0.037921 white|0.037921 lavender|0.037453 blush|0.037453 gray|0.035115 grey|0.035115 linen|0.03343 azure|0.032283 dim|0.01674 gray|0.01674 dim|0.01674 grey|0.01674 ivory|0.0095594 lavender|0.0075388 black|0.007466 old|0.0071718 lace|0.0071718 misty|0.0058972 rose|0.0058972 honeydew|0.0038689  "
		}
	}
}
