{
	"add": {
		"doc": {
			"id": "0ddef7d39859210e7b9cf3d3a771d2bc77b27178e564cb35549e76a308338730",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Marojejy_NP_2009.ogv/350px-seek%3D76-Marojejy_NP_2009.ogv.jpg",
				"previous": "Temperatures in the region are fairly constant, with both the daily temperature range and the seasonal range varying only slightly. February is the hottest month, averaging 25 °C (77 °F), while August is the coolest, averaging 19 °C (66 °F).[16] Climbing the peaks, temperature decreases by 1 °C per 200 m of increased altitude (1 °F per 360 ft), and temperatures on the summit decline to 1.5 °C (34.7 °F) in July.[20] The relative humidity for the region hovers around 87% throughout most of the year, although it rises to 97% between March and April.[16] Rain falls every month on the southern side of the mountain, with the region receiving at least 2,300 mm (91 in) of rain annually,[13] making it one of the wettest areas in Madagascar.[16][18] The northern side of the mountain is more tropical, with a 6-month dry season, and receives about 1,500 mm (59 in) of rain per year.[13] The general region receives the most rainfall during the warm season, from November through April, when heavy rain and occasional cyclones are delivered from the northwest by monsoons. During the cooler season, between May and October, lighter rains are delivered by winds from the southeast.",
				"after": "Both temperature and rainfall vary significantly by location within the park. Lower temperatures are found at higher elevations,[16] and the eastern slopes of the massif receive the most of the rainfall, since the western slopes lie in the rain shadow of the mountain and consequently experience a prolonged dry period.[16][17] The tops of the ridges experience strong winds and offer poor soil conditions. The effect can be seen in the plant life and their growth rates. The wide range in elevations and the rugged topography also play a crucial role in creation of the varied habitats distributed across the mountain slopes by affecting air temperature, fluctuations in temperature, and humidity levels. The interplay between these factors impacts the growth and development of plants, which form the foundation of the ecosystem. The result is an extremely varied and unevenly distributed forest that covers 90% of the park.[17]",
			"color": "dark|0.78262 olive|0.78262 green|0.78262 dim|0.078942 gray|0.078942 dim|0.078942 grey|0.078942 gray|0.069144 grey|0.069144 dark|0.042221 gray|0.042221 dark|0.042221 grey|0.042221  "
		}
	}
}
