{
	"add": {
		"doc": {
			"id": "0df7a6c801920bd994dd8e04514c10c4f834605de2d0b52b55bb3d99eebd20e8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Target_Field-20100730.jpg/220px-Target_Field-20100730.jpg",
				"previous": "Professional sports are well-established in Minneapolis. First playing in 1884, the Minneapolis Millers baseball team produced the best won-lost record in their league at the time and contributed fifteen players to the Baseball Hall of Fame. During the 1920s, Minneapolis was home to the NFL team the Minneapolis Marines, later known as the Minneapolis Red Jackets.[142] During the 1940s and 1950s the Minneapolis Lakers basketball team, the city's first in the major leagues in any sport, won six basketball championships in three leagues to become the NBA's first dynasty before moving to Los Angeles.[143] The American Wrestling Association, formerly the NWA Minneapolis Boxing & Wrestling Club, operated in Minneapolis from 1960 until the 1990s.[144]",
				"after": "The Minnesota Vikings and the Minnesota Twins arrived in the state in 1961. The Vikings were an NFL expansion team and the Twins were formed when the Washington Senators relocated to Minnesota. Both teams played outdoors in the open air Metropolitan Stadium in the suburb of Bloomington for twenty one years before moving to the Hubert H. Humphrey Metrodome in 1982, where the Twins won 8 division title (1987,1991, 2002–04, 2006, 2009, and 2010), 2 American League Pennants (1987 and 1991) and the World Series in 1987 and 1991. The Twins moved to Target Field in 2010. The Minnesota Timberwolves brought NBA basketball back to Minneapolis in 1989. They were followed by the Minnesota Lynx WNBA team in 1999. Both basketball teams play in the Target Center. In recent years, the Lynx have been the most successful sports team in Minneapolis and a dominant force in the WNBA, reaching the WNBA Finals in 2011, 2012 and 2013 and winning in 2011 and 2013.[146][147] The Minnesota Wild of the NHL play in St. Paul at the Xcel Energy Center,[148] along with the Minnesota Swarm of the NLL. The soccer team Minnesota United FC of the NASL play in Blaine at the National Sports Center.[149] The Minneapolis Bandolier is a successful bandy team, having been crowned United States champions ten times as of 2014.[150][151]",
			"color": "olive|0.33193 drab|0.33193 black|0.25836 dim|0.090188 gray|0.090188 dim|0.090188 grey|0.090188 gray|0.040287 grey|0.040287 dark|0.02911 slate|0.02911 gray|0.02911 peru|0.015109 dark|0.013425 gray|0.013425 dark|0.013425 grey|0.013425 lavender|0.011751 pale|0.0078244 turquoise|0.0078244  "
		}
	}
}
