{
	"add": {
		"doc": {
			"id": "0dfe1f7bb0696000d4e5f3bb64bc6cdbefff8c9d2cbe8d1d80f58934657e3c8d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Codeshare_flight_information_at_FUK.jpg/300px-Codeshare_flight_information_at_FUK.jpg",
			"previous": [],
				"after": "A codeshare agreement, sometimes simply codeshare, is an aviation business arrangement where two or more airlines share the same flight. Sharing, in this sense, means that each airline publishes and markets the flight under its own airline designator and flight number as part of its published timetable or schedule. A seat can be purchased on each airline's designator and flight number, but is operated by only one of these cooperating airlines, commonly called the operating carrier or more precisely (and in line with definitions in IATA Standard Schedules Information Manual): \"Administrating carrier\". The term \"code\" refers to the identifier used in flight schedule, generally the two-character IATA airline designator code and flight number. Thus, XX123 (flight number 123 operated by the airline XX), might also be sold by airline YY as YY456 and by ZZ as ZZ9876. Airlines YY and ZZ are in this case called \"Marketing airlines\" (sometimes abbreviated MKT CXR for \"marketing carrier\"). Most of the major airlines today have code sharing partnerships with other airlines, and code sharing is a key feature of the major airline alliances. Typically, code-sharing agreements are also a part of the commercial agreements between airlines in the same airline alliances.",
			"color": "black|0.29457 light|0.19543 steel|0.19543 blue|0.19543 light|0.096802 slate|0.096802 gray|0.096802 slate|0.086235 gray|0.086235 lavender|0.076424 dim|0.040174 gray|0.040174 dim|0.040174 grey|0.040174 dark|0.025921 gray|0.025921 dark|0.025921 grey|0.025921 alice|0.023894 blue|0.023894 silver|0.019294 light|0.017586 gray|0.017586 light|0.017586 grey|0.017586 gray|0.015928 grey|0.015928 gainsboro|0.015555 light|0.014342 blue|0.014342 ghost|0.013699 white|0.013699  "
		}
	}
}
