{
	"add": {
		"doc": {
			"id": "0e02d7897807827a8ae2acafd00bef700b94577b82f62b0708fa5c33799ea1fd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/XN_Hylobius_abietis_02.jpg/220px-XN_Hylobius_abietis_02.jpg",
				"previous": "Seventy-seven species of land snail[152] and an estimated 14,000 species of insect live in Scotland, none of them \"truly\" endemic.[153] These include Pardosa lugubris, a species of wolf spider first found in the UK in 2000 at Abernethy Forest nature reserve, and the Scottish wood ant. These ants, which are the most numerous residents of the Caledonian pine forest, build mounds from the pine cones and needles they find on the forest floor and may inhabit the mounds for decades. A single colony may collect 100,000 insects a day to feed its half million citizens and produce up to 250 kilograms (550 lb) of honeydew per season.[154]",
				"after": "In addition to the Scottish wood ant, several Scottish species of invertebrate exist that are otherwise rare in the UK and important enough to have a specific \"Action Plan\" to provide protection. These are five species of ant and bee, six moths and butterfly, five flies and a single beetle (the reed beetle) and snail (the round-mouthed whorl snail, Vertigo genesii).[155] Northern colletes is a rare species of bee, the most significant British habitat for which is in the Outer Hebrides, where there are more than ten colonies.[156] Scotland is also the UK stronghold of the Blaeberry bumblebee, and the Bumblebee Conservation Trust recently created the world's first sanctuary for this genus of insects at RSPB Vane Farm Nature Reserve near Loch Leven.[157][158] The bumblebee Bombus jonellus var. hebridensis is endemic to the Hebrides.[159] In 2010, a colony of the beetle Meloe brevicollis was found on the island of Coll. The species is otherwise extinct in Scotland and is also flightless, raising the question of how the colony arrived on the island.[160] The northern February red stonefly (Brachyptera putata) has recently lost its range elsewhere in Britain and is now it considered to be a Scottish endemic.[161][162]",
			"color": "dim|0.092079 gray|0.092079 dim|0.092079 grey|0.092079 yellow|0.080787 green|0.080787 green|0.055605 yellow|0.055605 dark|0.049981 slate|0.049981 gray|0.049981 gray|0.039552 grey|0.039552 thistle|0.036719 white|0.031594 smoke|0.031594 snow|0.030008 lavender|0.02995 blush|0.02995 sea|0.029075 shell|0.029075 white|0.028355 ghost|0.02827 white|0.02827 floral|0.027504 white|0.027504 mint|0.025942 cream|0.025942 alice|0.02451 blue|0.02451 dark|0.02416 olive|0.02416 green|0.02416 azure|0.022032 slate|0.021337 gray|0.021337 lavender|0.021298 rosy|0.020453 brown|0.020453 dark|0.020261 sea|0.020261 green|0.020261 dark|0.019217 gray|0.019217 dark|0.019217 grey|0.019217 light|0.018239 gray|0.018239 light|0.018239 grey|0.018239 silver|0.017843 gainsboro|0.017097 ivory|0.014912 misty|0.0146 rose|0.0146 light|0.014584 golden|0.014584 rod|0.014584 yellow|0.014584 pale|0.014226 golden|0.014226 rod|0.014226 light|0.014104 slate|0.014104 gray|0.014104 linen|0.011898 honeydew|0.01116 light|0.010511 yellow|0.010511  "
		}
	}
}
