{
	"add": {
		"doc": {
			"id": "0e021b878020b3a014c6216fa6ed98eb61017f4633ba473960558f4720244d66",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Jodel.d140c.mousquetaire.g-rees.arp.jpg/220px-Jodel.d140c.mousquetaire.g-rees.arp.jpg",
				"previous": "The undercarriage is a relatively heavy part of the vehicle; it can be as much as 7% of the takeoff weight, but more typically is 4–5%.[1]",
				"after": "Wheeled undercarriages normally come in two types: conventional or \"taildragger\" undercarriage, where there are two main wheels towards the front of the aircraft and a single, much smaller, wheel or skid at the rear; or tricycle undercarriage where there are two main wheels (or wheel assemblies) under the wings and a third smaller wheel in the nose. The taildragger arrangement was common during the early propeller era, as it allows more room for propeller clearance. Most modern aircraft have tricycle undercarriages. Taildraggers are considered harder to land and take off (because the arrangement is usually unstable, that is, a small deviation from straight-line travel will tend to increase rather than correct itself), and usually require special pilot training. Sometimes a small tail wheel or skid is added to aircraft with tricycle undercarriage, in case of tail strikes during take-off. The Concorde, for instance, had a retractable tail \"bumper\" wheel, as delta winged aircraft need a high angle when taking off. The Boeing 727 also has a retractable tail bumper. Some aircraft with retractable conventional landing gear have a fixed tailwheel, which generates minimal drag (since most of the airflow past the tailwheel has been blanketed by the fuselage) and even improves yaw stability in some cases.[citation needed]",
			"color": "light|0.57778 steel|0.57778 blue|0.57778 black|0.038979 dim|0.033109 gray|0.033109 dim|0.033109 grey|0.033109 gray|0.031997 grey|0.031997 dark|0.028988 gray|0.028988 dark|0.028988 grey|0.028988 light|0.027428 gray|0.027428 light|0.027428 grey|0.027428 silver|0.026268 gainsboro|0.024129 white|0.017449 smoke|0.017449 alice|0.013763 blue|0.013763 snow|0.013483 mint|0.013331 cream|0.013331 ghost|0.012704 white|0.012704 sea|0.012517 shell|0.012517 white|0.01245 azure|0.01212 floral|0.011536 white|0.011536 dark|0.0086578 slate|0.0086578 gray|0.0086578 crimson|0.0082526 lavender|0.0077122 blush|0.0077122 firebrick|0.0070245 linen|0.0068095 light|0.0057136 blue|0.0057136 slate|0.0052131 gray|0.0052131 light|0.0045991 slate|0.0045991 gray|0.0045991 brown|0.0045193  "
		}
	}
}
