{
	"add": {
		"doc": {
			"id": "0e09b8a9470df03aa12a1ac7141be1a921c63ffcc52df0ca2e388c0f78ac94e0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Indricotherium11.jpg/220px-Indricotherium11.jpg",
				"previous": "Paraceratherium is considered the largest known land mammal that has ever existed, but its exact size is unclear because of the lack of complete specimens. Early estimates of 30 tonnes (66,000 lb) are now considered exaggerated; it may have been in the range of 15 to 20 tonnes (33,000 to 44,000 lb) at maximum, and as low as 11 tonnes (24,000 lb) on average. Calculations have mainly been based on fossils of P. transouralicum because this species is known from the most complete remains.[4] Estimates have been based on skull, teeth, and limb bone measurements, but the known bone elements are represented by individuals of different sizes, so all skeletal reconstructions are composite extrapolations, resulting in several weight ranges.[28][29] Its total body length was estimated as 8.70 m (28.5 ft) from front to back by Granger and Gregory in 1936, and 7.40 m (24.3 ft) by Vera Gromova in 1959, but the former estimate is now considered exaggerated. The weight of Paraceratherium was approached by some extinct proboscideans, with the largest complete skeleton known belonging to the steppe mammoth (Mammuthus trogontherii).[28] In spite of the roughly equivalent mass, Paraceratherium was still taller than any proboscidean.[4] Its shoulder height was estimated as 5.25 m (17.2 ft) at the shoulders by Granger and Gregory, but 4.8 m (16 ft) by Gregory S. Paul in 1997.[30] The neck was estimated at 2 to 2.5 m (6.6 to 8.2 ft) long by Michael P. Taylor and Mathew J. Wedel in 2013.[31] The teeth of P. orgosensis (which that species is mainly known from) are 25 percent bigger than those of P. transouralicum, making it the largest known indricothere.[3]",
				"after": "No complete set of vertebrae and ribs of Paraceratherium have yet been found and the tail is completely unknown. The atlas and axis vertebrae of the neck are wider than in most modern rhinoceroses, with space for strong ligaments and muscles that would be needed to hold up the large head. The rest of the vertebrae were also very wide, and had large zygapophyses with much room for muscles, tendons, ligaments, and nerves, to support the head, neck, and spine. The neural spines were long and formed a long \"hump\" along the back, where neck muscles and nuchal ligaments for holding up the skull were attached. The ribs were similar to those of modern rhinoceroses, but the ribcage would have looked smaller in proportion to the long legs and large bodies, because modern rhinoceroses are comparatively short-limbed. The last vertebra of the lower back was fused to the sacrum, a feature found in advanced rhinoceroses.[4] Like sauropod dinosaurs, Paraceratherium had pleurocoel-like openings (hollow parts of the bone) in their pre-sacral vertebrae, which may have helped to lighten the skeleton.[32]",
			"color": "silver|0.26014 dark|0.21933 gray|0.21933 dark|0.21933 grey|0.21933 light|0.19244 gray|0.19244 light|0.19244 grey|0.19244 gainsboro|0.13881 gray|0.058118 grey|0.058118 dim|0.034973 gray|0.034973 dim|0.034973 grey|0.034973 black|0.016595 lavender|0.012461 slate|0.012033 gray|0.012033 light|0.011778 slate|0.011778 gray|0.011778 white|0.0087933 smoke|0.0087933 lavender|0.0055074 blush|0.0055074 ghost|0.0053329 white|0.0053329 alice|0.0053206 blue|0.0053206 snow|0.0036022 sea|0.0028352 shell|0.0028352 white|0.0027608  "
		}
	}
}
