{
	"add": {
		"doc": {
			"id": "0e09caa9f81baec3a756280d7d69baeb6f0abcf7a9b21a57a38226410a1da016",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Artist_Concept_of_F-111_1980.JPEG/220px-Artist_Concept_of_F-111_1980.JPEG",
				"previous": "The FB-111A had new electronics, known as the SAC Mark IIB avionics suite. For the FB-111A the system used an attack radar improved from the F-111A's system, along with components that would be used on the F-111D, including the inertial navigation system, digital computers, and multi-function displays.[118] Armament for the strategic bombing role was the Boeing AGM-69 SRAM (short-range attack missile); two could be carried in the internal weapons bay and four more on the inner underwing pylons. Nuclear gravity bombs were also typical FB armament. Fuel tanks were often carried on the third non-swivelling pylon of each wing. The FB-111A had a total weapon load of 35,500 lb (16,100 kg).[117]",
				"after": "Multiple advanced FB-111 strategic bomber designs were proposed by General Dynamics in the 1970s. The first design, referred to as \"FB-111G\" within the company,[119] was a larger aircraft with more powerful engines with more payload and range. The next was a lengthened \"FB-111H\" that featured more powerful General Electric F101 turbofan engines, a 12 ft 8.5 in longer fuselage and redesigned, fixed intakes. The rear landing gear were moved outward so armament could be carried on the fuselage there. The FB-111H was offered as an alternative to the B-1A in 1975.[119][120] The similar FB-111B/C was offered in 1979 without success.[121]",
			"color": "dark|0.21788 gray|0.21788 dark|0.21788 grey|0.21788 silver|0.15541 light|0.13107 slate|0.13107 gray|0.13107 slate|0.10918 gray|0.10918 light|0.078452 gray|0.078452 light|0.078452 grey|0.078452 gainsboro|0.039376 antique|0.039255 white|0.039255 gray|0.03451 grey|0.03451 black|0.024034 linen|0.02033 dark|0.018954 slate|0.018954 gray|0.018954 old|0.014122 lace|0.014122 dim|0.013691 gray|0.013691 dim|0.013691 grey|0.013691 papaya|0.011855 whip|0.011855 sea|0.011584 shell|0.011584 floral|0.010229 white|0.010229 beige|0.0094538 white|0.0068624 smoke|0.0068624 ivory|0.0065985 blanched|0.0055946 almond|0.0055946 snow|0.0052778 corn|0.0048569 silk|0.0048569 misty|0.0043424 rose|0.0043424 white|0.0036821 mint|0.0033514 cream|0.0033514  "
		}
	}
}
