{
	"add": {
		"doc": {
			"id": "0e0aebe287984c4481ec3addf5b231c97dcb23de9335f3c2ddff6f46e93cbcbc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/EagleSinkingA_011302.jpg/220px-EagleSinkingA_011302.jpg",
				"previous": "Upon Eagle's arrival in Gibraltar, 824 Squadron transferred to RAF North Front and the ship loaded 15 Supermarine Spitfire fighters brought to Gibraltar by the carrier Argus.[60][61] These aircraft were partly assembled dockside and hoisted aboard for final assembly. They were too big to fit below deck and remained on the flight deck, where they impeded the operations of Eagle‍ '​s aircraft, except for those few also carried on the flight deck, until the ferried aircraft were flown off.[62] On 27 February 1942, she sailed to deliver the Spitfires to Malta, escorted by the battleship Malaya, Argus, the cruiser Hermione, and nine destroyers, but the operation had to be cancelled when the long-range fuel tanks of the Spitfires proved defective. The problems were not rectified until 7 March, when the 15 Spitfires were successfully flown off to Malta. Upon her return, the ship's engines required repairs that lasted until 13 March.[63] Nine more Spitfires were delivered to Malta on 21 March and an additional seven on 29 March.[64] After her return, her steering gear required extensive repairs that lasted until the end of April.[65]",
				"after": "As part of Operation Bowery, Eagle rendezvoused on the night of 7/8 May with the American carrier USS Wasp, carrying 47 Spitfires, while Eagle had landed her entire aircraft complement to make room for 17 Spitfires of her own. Sixty of them arrived safely at Malta. For the next operation on 17 May, the Swordfish and Sea Hurricanes of 813 Squadron flew back on board to join the 17 Spitfires and six Fairey Albacore torpedo bombers destined for Malta. The fighters flew off without incident, but engine problems forced all of the Albacores to return.[66] After they had landed, the ship was attacked by a half-dozen SM.79 torpedo bombers which failed to score any hits. The radar-guided guns of the escorting light cruiser, HMS Charybdis, were instrumental in driving off the determined Italian aircraft.[67]",
			"color": " "
		}
	}
}
