{
	"add": {
		"doc": {
			"id": "0e11f5b22032cab7b635c560a1054fc9dfe5ae12af8c8d42ba711592c3367188",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Asian_Elephant_at_Corbett_National_Park_15.jpg/220px-Asian_Elephant_at_Corbett_National_Park_15.jpg",
				"previous": "Some elephant populations in India and Sri Lanka have similar basic social organisations. There appear to be cohesive family units and loose aggregations. They have been observed to have \"nursing units\" and \"juvenile-care units\". In southern India, elephant populations may contain family groups, bond groups and possibly clans. Family groups tend to be small, consisting of one or two adult females and their offspring. A group containing more than two adult females plus offspring is known as a \"joint family\". Malay elephant populations have even smaller family units, and do not have any social organisation higher than a family or bond group. Groups of African forest elephants typically consist of one adult female with one to three offspring. These groups appear to interact with each other, especially at forest clearings.[101]",
				"after": "The social life of the adult male is very different. As he matures, a male spends more time at the edge of his group and associates with outside males or even other families. At Amboseli, young males spend over 80% of their time away from their families when they are 14–15. The adult females of the group start to show aggression towards the male, which encourages him to permanently leave. When males do leave, they either live alone or with other males. The former is typical of bulls in dense forests. Asian males are usually solitary, but occasionally form groups of two or more individuals; the largest consisted of seven bulls. Larger bull groups consisting of over 10 members occur only among African bush elephants, the largest of which numbered up to 144 individuals.[105] A dominance hierarchy exists among males, whether they range socially or solitarily. Dominance depends on the age, size and sexual condition.[105] Old bulls appear to control the aggression of younger ones and prevent them from forming \"gangs\".[106] Adult males and females come together for reproduction. Bulls appear to associate with family groups if an oestrous cow is present.[105]",
			"color": "dark|0.82763 olive|0.82763 green|0.82763  "
		}
	}
}
