{
	"add": {
		"doc": {
			"id": "0e129337c845910b69fbe84e5f5e6459ee82f23fdd8c36d9df56ca3106135454",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/De_Havilland_Comet_CMk.2.jpg/220px-De_Havilland_Comet_CMk.2.jpg",
			"previous": [],
				"after": "The Comet 2 had a slightly larger wing, higher fuel capacity and more powerful Rolls-Royce Avon engines, which all improved the aircraft's range and performance;[149] its fuselage was 3 ft 1 in (0.94 m) longer than the Comet 1's.[150] Design changes had been made to make the aircraft more suitable for transatlantic operations.[149] Following the Comet 1 disasters, these models were rebuilt with heavier gauge skin and rounded windows, and the Avon engines featuring larger air intakes and outward-curving jet tailpipes.[N 22][151] A total of 12 of the 44-seat Comet 2s were ordered by BOAC for the South Atlantic route.[152] The first production aircraft (G-AMXA) flew on 27 August 1953.[153] Although these aircraft performed well on test flights on the South Atlantic, their range was still not suitable for the North Atlantic. All but four Comet 2s were allocated to the RAF with deliveries beginning in 1955. Modifications to the interiors allowed the Comet 2s to be used in a number of different roles. For VIP transport, the seating and accommodations were altered while provisions for carrying medical equipment including iron lungs were incorporated. Specialised ELINT and electronic surveillance capability was later added to some airframes.[154]",
			"color": "dim|0.20623 gray|0.20623 dim|0.20623 grey|0.20623 lavender|0.12586 light|0.10014 gray|0.10014 light|0.10014 grey|0.10014 gray|0.092323 grey|0.092323 gainsboro|0.088018 dark|0.051341 gray|0.051341 dark|0.051341 grey|0.051341 thistle|0.048635 black|0.043032 slate|0.042343 gray|0.042343 light|0.03845 slate|0.03845 gray|0.03845 lavender|0.029105 blush|0.029105 ghost|0.027457 white|0.027457 light|0.025152 steel|0.025152 blue|0.025152 alice|0.025146 blue|0.025146 silver|0.022475 white|0.022343 smoke|0.022343  "
		}
	}
}
