{
	"add": {
		"doc": {
			"id": "0e19f80f7c896dd5c54e8304c32bb14b2d70c7a265cfbb9347672568f23e79e9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Neil_Harvey.jpg/220px-Neil_Harvey.jpg",
				"previous": "In March 1955, Johnson led Australia's first Test tour of the West Indies. The Australian Board of Control was concerned about the team's relations with the West Indian public.[13] Against a background of rising anti-colonial feeling and resentment, England's tour of the West Indies the year before had been marred by riots and violent disturbances. With the White Australia policy in place at the time, the Australians feared an unpleasant reception from the Caribbean public.[47] However, the Australian team proved very popular throughout the West Indies; Wisden reported that \"much credit belonged to the tact displayed by Ian Johnson, who proved a most able captain\".[58] Johnson cultivated a relaxed manner with the locals; in one instance at Sabina Park in Jamaica, he stopped to pick up a toddler who had run onto the playing field during the change of innings. Smiling and chatting to the boy, he then carried him safely off the ground.[1] Team mate Alan Davidson claimed, \"Ian did the best PR job of any captain I've ever seen\".[21]",
				"after": "As well as being popular, the Australian team was successful on the field, winning the series three Tests to nil.[58] The series was dominated by batsmen; in the five Test matches played the Australians scored 12 centuries while for the West Indies, Clyde Walcott alone scored five centuries—including centuries in both innings in the Tests at Sabina Park and Queens Park Oval. Johnson injured his foot while batting during the Sabina Park Test and was unable to bowl or field for the remainder of the match. In his place, Miller led the Australians to a nine-wicket victory.[59] The Second Test at Queens Park Oval was a high scoring draw; Johnson scored 66 runs and took a single wicket.[60] Johnson met with success in the Third Test at Bourda in Georgetown, Guyana. He took 7/44 in the West Indian second innings—still the best-ever innings analysis by an Australian captain[61]—and Australia won the Test by eight wickets.[62]",
			"color": " "
		}
	}
}
