{
	"add": {
		"doc": {
			"id": "0e1bb916a773a9673d9b5c3acccf017048fc15986eb4dabf8a8d94dce32c62d4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Clarence_W._Hobbs_%28ca._1919%29.jpg/170px-Clarence_W._Hobbs_%28ca._1919%29.jpg",
				"previous": "On January 7, 1913, Fraser's approved design was used to strike experimental pieces; the sculptor later wrote that he remembered several of the workmen commenting that the new piece struck more easily than the old. Afterwards, Roberts asked Fraser if the Hobbs Company was content with the design. The sculptor told the Mint director that the firm wanted changes made, and Fraser agreed to meet with them further. Over the following two weeks, Fraser worked with George Reith, the Hobbs Company's mechanic who had invented the anti-slug device, in an attempt to satisfy the firm's concerns. On January 20, Fraser wired the Mint from his studio in New York, announcing that he was submitting a modified design, and explained that the delay was \"caused by working with inventor until he was satisfied\".[16] The next day, Philadelphia Mint Superintendent John Landis sent Roberts a sample striking of the revised design, stating, \"the only change is in the border, which has been made round and true\".[17]",
				"after": "Despite the apparent agreement, the Hobbs Company continued to interpose objections. Engraver Barber was asked for his view; he stated that Reith, who had attended the trial striking, had been given all the time and facilities he had asked for in testing the new pieces, and the mechanic had pronounced himself satisfied.[18] Hobbs Company agent C. U. Carpenter suggested that Reith had been intimidated by the preparations that had already gone into the issue of the modified nickel, \"and, instead of pointing out clearly just what the situation demanded, agreed to adapt our device to the coin more readily that [sic] he was warranted in doing\".[19] On February 3, Hobbs sent Roberts a lengthy list of changes that he wanted in the coin, and the sculptor was required to attend a conference with Hobbs and Reith.[20] On the fifth, following the conference, which ended with no agreement, Fraser sent MacVeagh a ten-page letter, complaining that his time was being wasted by the Hobbs Company, and appealing to the Secretary to bring the situation to a close.[21] MacVeagh agreed to hold a meeting at his office in Washington on February 14. When the Hobbs Company requested permission to bring a lawyer, Fraser announced he would be doing the same. The Hobbs Company sought letters of support from the business community, with little success; Fraser's efforts to secure support from artists for his position were more fruitful.[22] Barber prepared patterns showing what the nickel would look like if the changes demanded by Hobbs were made. MacVeagh conducted the meeting much like a legal hearing, and issued a letter the following day.[23]",
			"color": " "
		}
	}
}
