{
	"add": {
		"doc": {
			"id": "0e202e19260c4aba6a2e0cf9361e962f8eda4ea08d1c97241df85a542908b78e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Independence_Hall2.jpg/220px-Independence_Hall2.jpg",
				"previous": "In 1995, the Park Service began preliminary work on a redesign of Independence Mall. Architects Venturi, Scott Brown & Associates developed a master plan with two design alternatives. The first proposed a block-long visitors center on the south side of Market Street, that would also house the Liberty Bell. This would have interrupted the mall's three-block vista of Independence Hall, and made the bell visible only from the south, i.e. Chestnut Street. The second alternative placed a similar visitors center on the north side of Market Street, also interrupting the mall's vista, with the bell in a small pavilion on the south side.[77] City planner Edmund Bacon, who had overseen the mall's design in the 1950s, saw preservation of the vista of Independence Hall as essential. He created his own plan, which included a domed bell pavilion built north of Market Street.[78] Public reaction to the possibility of moving the Liberty Bell so far from Independence Hall was strongly negative. NPS announced that the bell would remain on the block between Chestnut and Market Streets.[79] Other plans were proposed, each had strengths and weaknesses, but the goal of all was to encourage visitors to see more of the historical park than just the Liberty Bell.[80]",
				"after": "The Olin Partnership was hired to create a new master plan for Independence Mall; its team included architect Bernard Cywinski, who ultimately won a limited design competition to design what was called the Liberty Bell Center (LBC).[81] Cywinski's design was unveiled in early 1999. Significantly larger than the existing pavilion, allowing for exhibit space and an interpretive center, the proposed LBC building also would cover about 15% of the footprint of the long-demolished President's House, the \"White House\" of George Washington and John Adams.[82] Archaeologists excavating the LBC's intended site uncovered remnants of the 1790–1800 executive mansion, which were reburied.[83] The project became highly controversial when it was revealed that Washington's slaves had been housed only feet from the planned LBC's main entrance.[84] The Park Service refused to redesign the LBC building, or delay its construction.[85] Initially, NPS resisted interpreting the slaves and the slave quarters,[86] but after years of protest by Black activists, agreed.[87] The new facility, which opened hours after the bell was installed on October 9, 2003, is adjacent to an outline of Washington's slave quarters marked in the pavement, with interpretive panels explaining the significance of what was found.[88]",
			"color": "dark|0.32044 olive|0.32044 green|0.32044 dim|0.23441 gray|0.23441 dim|0.23441 grey|0.23441 gray|0.12777 grey|0.12777 black|0.10824 dark|0.047765 gray|0.047765 dark|0.047765 grey|0.047765 dark|0.042806 slate|0.042806 gray|0.042806 slate|0.041535 gray|0.041535 light|0.028925 slate|0.028925 gray|0.028925 silver|0.01498 light|0.0071711 gray|0.0071711 light|0.0071711 grey|0.0071711  "
		}
	}
}
