{
	"add": {
		"doc": {
			"id": "0e2b46c1a26f3ec8fd762d21b8b99192a277c53c8193d7c8e20ead5e86981ff0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/T-6_G_Musee_du_Bourget_P1020147.JPG/220px-T-6_G_Musee_du_Bourget_P1020147.JPG",
			"previous": [],
				"after": "Flaps may be fully extended for landing to give the aircraft a lower stall speed so the approach to landing can be flown more slowly, which also allows the aircraft to land in a shorter distance. The higher lift and drag associated with fully extended flaps allows a steeper and slower approach to the landing site, but imposes handling difficulties in aircraft with very low wing loading (the ratio between the wing area and the weight of the aircraft). Winds across the line of flight, known as crosswinds, cause the windward side of the aircraft to generate more lift and drag, causing the aircraft to roll, yaw and pitch off its intended flight path, and as a result many light aircraft land with reduced flap settings in crosswinds. Furthermore, once the aircraft is on the ground, the flaps may decrease the effectiveness of the brakes since the wing is still generating lift and preventing the entire weight of the aircraft from resting on the tires, thus increasing stopping distance, particularly in wet or icy conditions. Usually, the pilot will raise the flaps as soon as possible to prevent this from occurring.[2]",
			"color": "dark|0.16608 gray|0.16608 dark|0.16608 grey|0.16608 gray|0.11584 grey|0.11584 light|0.11155 gray|0.11155 light|0.11155 grey|0.11155 silver|0.11136 dim|0.098196 gray|0.098196 dim|0.098196 grey|0.098196 gainsboro|0.093523 lavender|0.037869 alice|0.027504 blue|0.027504 white|0.022328 smoke|0.022328 ghost|0.019567 white|0.019567 light|0.019184 steel|0.019184 blue|0.019184 black|0.015575 dark|0.014079 golden|0.014079 rod|0.014079 light|0.012702 slate|0.012702 gray|0.012702 slate|0.012603 gray|0.012603 azure|0.010325 light|0.010194 blue|0.010194 brown|0.0095929 snow|0.0083645 white|0.0070275 lavender|0.006784 blush|0.006784 mint|0.0064242 cream|0.0064242 saddle|0.0063934 brown|0.0063934 golden|0.0059683 rod|0.0059683 steel|0.0053221 blue|0.0053221 tan|0.0051904 light|0.0044783 cyan|0.0044783  "
		}
	}
}
