{
	"add": {
		"doc": {
			"id": "0e32afa8ba509b244e2535cb036f478252c560a840e39262edaff6bbba0ec096",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Artist%E2%80%99s_impression_of_the_huge_outflow_ejected_from_the_quasar_SDSS_J1106%2B1939.jpg/220px-Artist%E2%80%99s_impression_of_the_huge_outflow_ejected_from_the_quasar_SDSS_J1106%2B1939.jpg",
				"previous": "The origin of supermassive black holes remains an open field of research. Astrophysicists agree that once a black hole is in place in the center of a galaxy, it can grow by accretion of matter and by merging with other black holes. There are, however, several hypotheses for the formation mechanisms and initial masses of the progenitors, or \"seeds\", of supermassive black holes. The most obvious hypothesis is that the seeds are black holes of tens or perhaps hundreds of solar masses that are left behind by the explosions of massive stars and grow by accretion of matter. Another model involves a large gas cloud in the period before the first stars formed collapsing into a “quasi-star” and then a black hole of initially only around ~20 M☉, and then rapidly accreting to become relatively quickly an intermediate-mass black hole, and possibly a SMBH if the accretion-rate is not quenched at higher masses.[6] The initial “quasi-star” would become unstable to radial perturbations because of electron-positron pair production in its core, and may collapse directly into a black hole without a supernova explosion, which would eject most of its mass and prevent it from leaving a black hole as a remnant. Yet another model[7] involves a dense stellar cluster undergoing core-collapse as the negative heat capacity of the system drives the velocity dispersion in the core to relativistic speeds. Finally, primordial black holes may have been produced directly from external pressure in the first moments after the Big Bang. Formation of black holes from the deaths of the first stars has been extensively studied and corroborated by observations. The other models for black hole formation listed above are theoretical.",
				"after": "The difficulty in forming a supermassive black hole resides in the need for enough matter to be in a small enough volume. This matter needs to have very little angular momentum in order for this to happen. Normally, the process of accretion involves transporting a large initial endowment of angular momentum outwards, and this appears to be the limiting factor in black hole growth. This is a major component of the theory of accretion disks. Gas accretion is the most efficient and also the most conspicuous way in which black holes grow. The majority of the mass growth of supermassive black holes is thought to occur through episodes of rapid gas accretion, which are observable as active galactic nuclei or quasars. Observations reveal that quasars were much more frequent when the Universe was younger, indicating that supermassive black holes formed and grew early. A major constraining factor for theories of supermassive black hole formation is the observation of distant luminous quasars, which indicate that supermassive black holes of billions of solar masses had already formed when the Universe was less than one billion years old. This suggests that supermassive black holes arose very early in the Universe, inside the first massive galaxies.",
			"color": "light|0.30394 steel|0.30394 blue|0.30394 black|0.1512 steel|0.1509 blue|0.1509 dark|0.14571 slate|0.14571 blue|0.14571 lavender|0.075362 alice|0.019049 blue|0.019049  "
		}
	}
}
