{
	"add": {
		"doc": {
			"id": "0e36cf556dd318a1a3f69345ecc7740d34d16b3495987c13b57f5f858679a863",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Centrosaurus_dinosaur.png/220px-Centrosaurus_dinosaur.png",
				"previous": "The first potential evidence for herding or flocking as a widespread behavior common to many dinosaur groups in addition to birds was the 1878 discovery of 31 Iguanodon bernissartensis, ornithischians which were then thought to have perished together in Bernissart, Belgium, after they fell into a deep, flooded sinkhole and drowned.[73] Other mass-death sites have been subsequently discovered. Those, along with multiple trackways, suggest that gregarious behavior was common in many early dinosaur species. Trackways of hundreds or even thousands of herbivores indicate that duck-bills (hadrosaurids) may have moved in great herds, like the American bison or the African springbok. Sauropod tracks document that these animals traveled in groups composed of several different species, at least in Oxfordshire, England,[74] although there is not evidence for specific herd structures.[75] Congregating into herds may have evolved for defense, for migratory purposes, or to provide protection for young. There is evidence that many types of slow-growing dinosaurs, including various theropods, sauropods, ankylosaurians, ornithopods, and ceratopsians, formed aggregations of immature individuals. One example is a site in Inner Mongolia that has yielded the remains of over 20 Sinornithomimus, from one to seven years old. This assemblage is interpreted as a social group that was trapped in mud.[76] The interpretation of dinosaurs as gregarious has also extended to depicting carnivorous theropods as pack hunters working together to bring down large prey.[77][78] However, this lifestyle is uncommon among modern birds, crocodiles, and other reptiles, and the taphonomic evidence suggesting mammal-like pack hunting in such theropods as Deinonychus and Allosaurus can also be interpreted as the results of fatal disputes between feeding animals, as is seen in many modern diapsid predators.[79]",
				"after": "The crests and frills of some dinosaurs, like the marginocephalians, theropods and lambeosaurines, may have been too fragile to be used for active defense, and so they were likely used for sexual or aggressive displays, though little is known about dinosaur mating and territorialism. Head wounds from bites suggest that theropods, at least, engaged in active aggressive confrontations.[80]",
			"color": "tan|0.37328 burly|0.27211 wood|0.27211 black|0.15859 gray|0.041227 grey|0.041227 dim|0.04081 gray|0.04081 dim|0.04081 grey|0.04081 indian|0.017864 red|0.017864 wheat|0.01762 dark|0.013823 gray|0.013823 dark|0.013823 grey|0.013823 light|0.013257 gray|0.013257 light|0.013257 grey|0.013257 gainsboro|0.009867  "
		}
	}
}
