{
	"add": {
		"doc": {
			"id": "0e3fcb74c00e100d171b42298551a1859fad79a6290e7dea1f7ae6062163335f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Summer_on_Queen_Street_-_Cardiff_-_geograph.org.uk_-_1363923.jpg/220px-Summer_on_Queen_Street_-_Cardiff_-_geograph.org.uk_-_1363923.jpg",
				"previous": "The majority of Cardiff's shopping portfolio is in the city centre around Queen Street and St. Mary Street, with large suburban retail parks located in Cardiff Bay, Culverhouse Cross, Leckwith, Newport Road and Pontprennau, together with markets in the city centre and Splott. A major £675 million regeneration programme for Cardiff's St. David's Centre was completed in 2009, which has provided a total of 1,400,000 square feet (130,000 m2) of shopping space, making it one of the largest shopping centres in the United Kingdom.[130] The centre was named the international shopping centre of the year in 2010 by Retail Leisure International (RLI).[131]",
				"after": "The Castle Quarter is a commercial area in the north of the city centre which includes some of Cardiff's Victorian and Edwardian arcades: Castle Arcade, High Street Arcade and Duke Street Arcade, and principal shopping streets: St Mary Street, High Street, Castle Street and Duke Street. Development of the area began in February 2010 and is expected to be completed by July 2011. Cardiff Council says that work to create the Castle Quarter as a pedestrian friendly environment for High Street and St Mary Street is designed to enhance the city centre.[132]",
			"color": "dim|0.15629 gray|0.15629 dim|0.15629 grey|0.15629 gray|0.15031 grey|0.15031 dark|0.14171 gray|0.14171 dark|0.14171 grey|0.14171 black|0.1251 silver|0.077615 light|0.075648 gray|0.075648 light|0.075648 grey|0.075648 gainsboro|0.064832 slate|0.034947 gray|0.034947 light|0.022414 slate|0.022414 gray|0.022414 white|0.02002 smoke|0.02002 lavender|0.014342 blush|0.014342 ghost|0.010915 white|0.010915 alice|0.010263 blue|0.010263 linen|0.0093689 snow|0.0093214 sea|0.0091873 shell|0.0091873 white|0.0063529 lavender|0.0058602 antique|0.0056109 white|0.0056109 misty|0.0047969 rose|0.0047969  "
		}
	}
}
