{
	"add": {
		"doc": {
			"id": "0e5932a112026b6160a1155b11180aaafb794648017080ec4fb4be12d8d3b7ba",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Erstausgabe_von_Mein_Kampf.jpg/220px-Erstausgabe_von_Mein_Kampf.jpg",
				"previous": "Hitler was formally elected party chairman on 28 July 1921, with only one opposing vote. The committee was dissolved, and Hitler was granted nearly absolute powers as the party's sole leader.[61] This was a post he would hold for the remainder of his life. Hitler soon acquired the title Führer (\"leader\") and, after a series of sharp internal conflicts, it was accepted that the party would be governed by the Führerprinzip (\"leader principle\"). Under this principle, the party was a highly centralized entity that functioned strictly from the top down, with Hitler at the apex as the party's absolute leader. Hitler at this time saw the party as a revolutionary organization, whose aim was the overthrow of the Weimar Republic, which he saw as controlled by the socialists, Jews and the \"November criminals\" who had betrayed the German soldiers in 1918. The SA (\"storm troopers\", also known as \"Brownshirts\") were founded as a party militia in 1921, and began violent attacks on other parties.",
				"after": "For Hitler, the twin goals of the party were always German nationalist expansionism and antisemitism. These two goals were fused in his mind by his belief that Germany's external enemies – Britain, France and the Soviet Union – were controlled by the Jews, and that Germany's future wars of national expansion would necessarily entail a war against the Jews.[62] For Hitler and his principal lieutenants, national and racial issues were always dominant. This was symbolised by the adoption as the party emblem of the swastika or Hakenkreuz, at the time widely used in the western world. In German nationalist circles, the swastika was considered a symbol of an \"Aryan race\"; it symbolized the replacement of the Christian Cross with allegiance to a National Socialist State.",
			"color": "dark|0.48102 red|0.48102 maroon|0.30369 sienna|0.060083 saddle|0.055698 brown|0.055698 tan|0.035621  "
		}
	}
}
