{
	"add": {
		"doc": {
			"id": "0e5a29b57b3320550054138e3ac4f460b6e8ed4cff0aebfd25aeeb0f6a5ad490",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Pyramide_Djedkare_Isesi_3.jpg/300px-Pyramide_Djedkare_Isesi_3.jpg",
				"previous": "In the Early Dynastic Period (c. 3100–2686 BC), the first pharaohs built funerary complexes in the religious center of Abydos following a single general pattern, with a rectangular mud-brick enclosure.[39] In the Old Kingdom (c. 2686–2181 BC) that followed the Early Dynastic Period, royal funerary monuments greatly expanded, while most divine temples remained comparatively small, suggesting that official religion in this period emphasized the cult of the divine king more than the direct worship of deities.[40] Deities closely connected with the king, such as the sun god Ra and the goddess Hathor, received more royal contributions than other deities.[41] Ra's temple at Heliopolis was one of the great religious centers of the age, and several Old Kingdom pharaohs built large sun temples in his honor near their pyramids.[42] Meanwhile, the small provincial temples retained a variety of local styles from Predynastic times, unaffected by the royal cult sites.[43]",
				"after": "The expansion of funerary monuments began in the reign of Djoser, who built his complex entirely of stone and placed in the enclosure a step pyramid under which he was buried: the Pyramid of Djoser. For the rest of the Old Kingdom, tomb and temple were joined in elaborate stone pyramid complexes.[44] Near each pyramid complex was a town that supplied its needs as towns would support temples throughout Egyptian history. Other changes came in the reign of Sneferu, who, beginning with his first pyramid at Meidum, built pyramid complexes symmetrically along an east–west axis, with a valley temple on the banks of the Nile linked to a pyramid temple at the foot of the pyramid. Sneferu's immediate successors followed this pattern, but beginning in the late Old Kingdom, pyramid complexes combined different elements from the axial plan and from the rectangular plan of Djoser.[45] To supply the massive pyramid complexes, kings founded new towns and farming estates on undeveloped lands across Egypt. The flow of goods from these lands to the central government and its temples helped unify the kingdom.[46]",
			"color": "dark|0.11403 gray|0.11403 dark|0.11403 grey|0.11403 silver|0.10658 light|0.067032 gray|0.067032 light|0.067032 grey|0.067032 sea|0.054063 shell|0.054063 white|0.052986 smoke|0.052986 floral|0.052854 white|0.052854 mint|0.048701 cream|0.048701 snow|0.048598 white|0.046922 ghost|0.040503 white|0.040503 azure|0.038628 gainsboro|0.038525 alice|0.036888 blue|0.036888 ivory|0.032042 linen|0.029569 gray|0.02509 grey|0.02509 lavender|0.021089 blush|0.021089 dim|0.020422 gray|0.020422 dim|0.020422 grey|0.020422 old|0.019097 lace|0.019097 beige|0.015266 antique|0.014358 white|0.014358 honeydew|0.010431 corn|0.010124 silk|0.010124 light|0.0076527 yellow|0.0076527 papaya|0.0076259 whip|0.0076259 wheat|0.0072205 moccasin|0.0053774 light|0.0053139 golden|0.0053139 rod|0.0053139 yellow|0.0053139 lemon|0.0046716 chiffon|0.0046716 blanched|0.0038789 almond|0.0038789 navajo|0.0038551 white|0.0038551  "
		}
	}
}
