{
	"add": {
		"doc": {
			"id": "0e5d327d8072122156042293f3b7c9fc312ae7ccc8623b8f91533b2e44e321dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Hippo_mouth_opening.jpg/220px-Hippo_mouth_opening.jpg",
				"previous": "Different from all other large land mammals, hippos are of semiaquatic habits, spending the day in lakes and rivers.[12]:3 The eyes, ears, and nostrils of hippos are placed high on the roof of their skulls. This allows these organs to remain above the surface while the rest of the body submerges.[9]:259 Their barrel-shaped bodies have graviportal skeletal structures,[12]:8 adapted to carrying their enormous weight, and their specific gravity allows them to sink and move along the bottom of a river.[32] Hippopotamuses have small legs (relative to other megafauna) because the water in which they live reduces the weight burden.[33] Though they are bulky animals, hippopotamuses can gallop at 30 km/h (19 mph) on land but normally trot. They are incapable of jumping but do climb up steep banks.[34] Despite being semiaquatic and having webbed feet, an adult hippo is not a particularly good swimmer nor can it float. It is rarely found in deep water; when it is, the animal moves by porpoise-like leaps from the bottom.[12]:3 The testes of the males descend only partially and a scrotum is not present. In addition, the penis retracts into the body when not erect. The genitals of the female are unusual in that the vagina is ridged and two large diverticula protrude from the vulval vestibule. The function of these is unknown.[12]:28–29",
			"after": [],
			"color": "dim|0.24702 gray|0.24702 dim|0.24702 grey|0.24702 thistle|0.13725 slate|0.097444 gray|0.097444 light|0.074165 slate|0.074165 gray|0.074165 black|0.070103 gray|0.066929 grey|0.066929 dark|0.059674 gray|0.059674 dark|0.059674 grey|0.059674 silver|0.054516 lavender|0.038824 light|0.037353 gray|0.037353 light|0.037353 grey|0.037353 gainsboro|0.026436 lavender|0.017747 blush|0.017747 rosy|0.013306 brown|0.013306 misty|0.0094396 rose|0.0094396 light|0.0088073 steel|0.0088073 blue|0.0088073 ghost|0.0079324 white|0.0079324  "
		}
	}
}
