{
	"add": {
		"doc": {
			"id": "0e5e66e1ac94f266d09a8be7fc8d1717f599399aa5098d0b9ba1d91bb238c1e2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Australian_Magpie_feeding.jpg/220px-Australian_Magpie_feeding.jpg",
				"previous": "The Australian magpie produces a clutch of two to five light blue or greenish eggs, which are oval in shape and about 30 by 40 mm (1.2 by 1.6 in).[79] The chicks hatch synchronously around 20 days after incubation begins; like all passerines, the chicks are altricial—they are born pink, naked, and blind with large feet, a short broad beak and a bright red throat. Their eyes are fully open at around 10 days. Chicks develop fine downy feathers on their head, back and wings in the first week, and pinfeathers in the second week. The black and white colouration is noticeable from an early stage.[80] Nestlings are fed exclusively by the female, though the male magpie will feed his partner.[81] The Australian magpie is known to engage in cooperative breeding, and helper birds will assist in feeding and raising young.[33] This does vary from region to region, and with the size of the group—the behaviour is rare or nonexistent in pairs or small groups.[33]",
				"after": "Juvenile magpies begin foraging on their own three weeks after leaving the nest, and mostly feeding themselves by six months old. Some birds continue begging for food until eight or nine months of age, but are usually ignored. Birds reach adult size by their first year.[82] The age at which young birds disperse varies across the country, and depends on the aggressiveness of the dominant adult of the corresponding sex; males are usually evicted at a younger age. Many leave at around a year old, but the age of departure may range from eight months to four years.[83]",
			"color": "black|0.41145 tan|0.27487 wheat|0.044065 dim|0.041973 gray|0.041973 dim|0.041973 grey|0.041973 dark|0.027312 gray|0.027312 dark|0.027312 grey|0.027312 gray|0.023605 grey|0.023605 silver|0.020679 light|0.016882 gray|0.016882 light|0.016882 grey|0.016882 gainsboro|0.014792 bisque|0.010018  "
		}
	}
}
