{
	"add": {
		"doc": {
			"id": "0e8cf2fd0186f9c993ac1d27358f2d28ff7d67889ddfb417d44faec2002d9f4d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Pachylemur_insignis_skull_001.jpg/220px-Pachylemur_insignis_skull_001.jpg",
				"previous": "Although these traits are shared among both living and extinct lemurs, they are uncommon among primates in general. Two prevailing hypotheses to explain these unique adaptations are the energy frugality hypothesis by Patricia Wright (1999) and the evolutionary disequilibrium hypothesis by Carel van Schaik and Peter M. Kappeler (1996). The energy frugality hypothesis expanded on Alison Jolly's energy conservation hypotheses by claiming that most lemur traits not only help conserve energy, but also maximize the use of highly limited resources, enabling them to live in severely seasonal environments with low productivity. The evolutionary disequilibrium hypothesis postulated that living lemurs are in the process of evolving to fill open ecological niches left by the recently extinct subfossil lemurs. For example, small nocturnal prosimians are typically nocturnal and monogamous, while the larger living lemurs are generally active both day and night (cathemeral) and live in small groups (gregarious). Cathemerality and increased gregariousness might indicate that the larger living lemurs are evolving to fill the role of the giant lemurs, which were thought to be diurnal (day-living) and more monkey-like in behavior. Since most giant subfossil lemurs have been shown to share many of the unique traits of their living counterparts, and not those of monkeys, Godfrey et al. (2003) argued that the energy frugality hypothesis seems to best explain both living and extinct lemur adaptations.[9]",
				"after": "Despite the similarities, subfossil lemurs had several distinct differences from their lemur relatives. In addition to being larger, the subfossil lemurs were more dependent on leaves and seeds in their diet, rather than fruit. They utilized slow climbing, hanging, and terrestrial quadrupedalism for locomotion, rather than vertical clinging and leaping and arboreal quadrupedalism. Also, all but one of them—the giant aye-aye—are assumed to have been diurnal (due to their body size and small orbits), whereas many small lemurs are nocturnal and medium-sized are cathemeral.[6][9]",
			"color": " "
		}
	}
}
