{
	"add": {
		"doc": {
			"id": "0e8ed78a7eefe2a5281432137309a6dcf8b6bf94d4b7067962be6418d3783cd1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/JDAM_B-1B_Lancer.jpg/220px-JDAM_B-1B_Lancer.jpg",
				"previous": "Of the 100 B-1Bs built, 93 remained in 2000 after losses in accidents. In June 2001, the Pentagon sought to place one-third of its then fleet into storage; this proposal resulted in several U.S. Air National Guard officers and members of Congress lobbying against the proposal, including the drafting of an amendment to prevent such cuts.[67] The 2001 proposal was intended to allow money to be diverted to further upgrades to the remaining B-1Bs, such as computer modernization.[67] In 2003, accompanied by the removal of B-1Bs from the two bomb wings in the Air National Guard, the USAF decided to retire 33 aircraft to concentrate its budget on maintaining availability of remaining B-1Bs.[123] In 2004, a new appropriation bill called for some of the retired aircraft to return to service,[124] and the USAF returned seven mothballed bombers to service to increase the fleet to 67 aircraft.[125]",
				"after": "On 14 July 2007, the Associated Press reported on the growing USAF presence in Iraq as a result of \"surge\" in forces. Also mentioned is the reintroduction of B-1Bs to be a close-at-hand \"platform\" to support Coalition ground forces.[126] B-1s have been used in Iraq and Afghanistan. Since 2008 B-1s have been used there in an \"armed overwatch\" role. They loiter over the region maintaining surveillance, ready to deliver guided bombs in support of ground troops if contacted.[127][128]",
			"color": "black|0.20864 tan|0.1955 light|0.085253 gray|0.085253 light|0.085253 grey|0.085253 silver|0.083078 gainsboro|0.062671 antique|0.031968 white|0.031968 dark|0.03072 gray|0.03072 dark|0.03072 grey|0.03072 dim|0.029023 gray|0.029023 dim|0.029023 grey|0.029023 peach|0.022806 puff|0.022806 linen|0.021994 bisque|0.019916 gray|0.019414 grey|0.019414 burly|0.017946 wood|0.017946 old|0.017368 lace|0.017368 wheat|0.014877 sea|0.014418 shell|0.014418 papaya|0.013995 whip|0.013995 blanched|0.013585 almond|0.013585 floral|0.012657 white|0.012657 beige|0.011126 white|0.0095769 smoke|0.0095769 ivory|0.0081796  "
		}
	}
}
