{
	"add": {
		"doc": {
			"id": "0ec590c0ff5badfce0df780d90e463ec8f389e32177faf97254fa4a530b2f5af",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Lake_Minnewanka_11092005.jpg/220px-Lake_Minnewanka_11092005.jpg",
				"previous": "Banff National Park is managed by Parks Canada, under the National Parks Act which was passed in 1930. Over time, park management policies have increasingly emphasized environmental protection over development. In 1964, a policy statement was issued that reiterated ideals of conservation laid out in the 1930 act. With the controversial bid for the 1972 Winter Olympics, environmental groups became more influential, leading Parks Canada to withdraw its support for the bid. The 1979 Beaver Book was a major new policy, which emphasized conservation. In 1988, the National Parks Act was amended, making the maintenance of ecological integrity the top priority. The amendment also paved the way for non-governmental organizations to challenge Parks Canada in court, for breaches in adhering to the act. In 1994, Parks Canada established revised \"Guiding Principles and Operating Policies\", which included a mandate for the Banff-Bow Valley Study to draft management recommendations.[6] As with other national parks, Banff is required to have a Park Management Plan. On a provincial level, the park area and the included communities (other than the Town of Banff which is an incorporated municipality) are administered by Alberta Municipal Affairs as Improvement District No. 9 (Banff).[40]",
				"after": "Since the 19th century, humans have impacted Banff's environment through introduction of non-native species, controls on other species, and development in the Bow Valley, among other human activities. Bison once lived in the valleys of Banff, but were hunted by indigenous people and the last bison was killed off in 1858.[41] Elk are not indigenous to Banff, and were introduced in 1917 with 57 elk brought in from Yellowstone National Park.[42] The introduction of elk to Banff, combined with controls on coyote and wolves by Parks Canada beginning in the 1930s, has caused imbalance of the ecosystem.[42] Other species that have been displaced from the Bow Valley include grizzly bears, cougars, lynx, wolverines, otter, and moose. Beginning in 1985, gray wolves were recolonizing areas in the Bow Valley.[43] However, the wolf population has struggled, with 32 wolf deaths along the Trans-Canada Highway between 1987 and 2000, leaving only 31 wolves in the area.[44]",
			"color": "dim|0.27657 gray|0.27657 dim|0.27657 grey|0.27657 slate|0.21132 gray|0.21132 black|0.19104 light|0.13003 slate|0.13003 gray|0.13003 gray|0.10736 grey|0.10736 dark|0.031265 gray|0.031265 dark|0.031265 grey|0.031265 dark|0.019787 slate|0.019787 gray|0.019787 steel|0.0091807 blue|0.0091807 silver|0.0075622  "
		}
	}
}
