{
	"add": {
		"doc": {
			"id": "0ed75df6dd9f1992bcf9c9922df3cb609cfbd58a75db50581a904822a2dab386",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/National_Airlines_Boeing_757_passenger_plane_Willow_Run_Airport.JPG/220px-National_Airlines_Boeing_757_passenger_plane_Willow_Run_Airport.JPG",
				"previous": "On the week of January 29, 2013 the airline National Airlines completed its move from the Ypsilanti area to Orlando. The airline said that it planned to offer 105 jobs at Orlando, with 26 more than were available in Michigan. 44 of the 79 existing employees were having relocation plans. The airline wanted to move its staff into Class A office space as opposed to the previous hangar space. According to Garrett Matyas, the company's human resources director, the company originally considered Ann Arbor, Michigan and was in talks with the Michigan Economic Development Corp.[6] Instead, Matyas said that the airline moved to Florida due to an environment friendly towards business interests.[6] The state offered tax incentives for the Orlando location.[6] According to Declan Reiley, the Metro Orlando Economic Development Commission vice president of business development, the airline also moved to Florida because two of the owners of the company were Florida residents.[6] The freighter and passenger divisions are involved with contract military airlift operations. The New Zealand Defence Force (NZDF) indefinitely postponed using National Airlines for its airlift requirements.[9]",
				"after": "As of October 2013, the National Airlines fleet included:[2][10]",
			"color": "silver|0.34343 dark|0.31013 gray|0.31013 dark|0.31013 grey|0.31013 dim|0.072796 gray|0.072796 dim|0.072796 grey|0.072796 gray|0.07243 grey|0.07243 light|0.051086 gray|0.051086 light|0.051086 grey|0.051086 light|0.04422 steel|0.04422 blue|0.04422 black|0.040687 gainsboro|0.02844 slate|0.011581 gray|0.011581 light|0.011319 slate|0.011319 gray|0.011319 dark|0.0037536 slate|0.0037536 gray|0.0037536  "
		}
	}
}
