{
	"add": {
		"doc": {
			"id": "0ee844a82b3ac9a11f8716f337bcaef0eddc1bee851cd1f19734e2e226893d04",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/San_giorgio_ragusa_ibla_italy.jpg/200px-San_giorgio_ragusa_ibla_italy.jpg",
				"previous": "Ragusa Ibla, the lower city, boasts an impressive array of Baroque architecture, which includes the Church of San Giorgio by Rosario Gagliardi, designed in 1738 (Illustration 12). In the design of this church Gagliardi exploited the difficult terrain of the hillside site. The church towers impressively over a massive marble staircase of some 250 steps,[38] a Baroque feature, especially exploited in Sicily due to the island's topography. The tower seems to explode from the façade, accentuated by the columns and pilasters canted against the curved walls. Above the doorways and window apertures, pediments scroll and curve with a sense of freedom and movement which would have been unthinkable to those earlier architects inspired by Bernini and Borromini. The neoclassical dome was not added until 1820.",
				"after": "In an alley connecting Ragusa Ibla with Ragusa Superiore is the church of Santa Maria delle Scale. This church is interesting, though badly damaged in the earthquake. Only half the church was rebuilt in Baroque style, while the surviving half was kept in the original Norman (with Gothic features), thus demonstrating in one piece the evolution of Sicilian Baroque.",
			"color": "gray|0.1811 grey|0.1811 dark|0.15307 gray|0.15307 dark|0.15307 grey|0.15307 dim|0.14738 gray|0.14738 dim|0.14738 grey|0.14738 black|0.087849 silver|0.056778 light|0.024284 gray|0.024284 light|0.024284 grey|0.024284 white|0.023438 smoke|0.023438 mint|0.021239 cream|0.021239 snow|0.020893 white|0.019982 floral|0.019947 white|0.019947 sea|0.019841 shell|0.019841 light|0.019479 slate|0.019479 gray|0.019479 azure|0.017168 gainsboro|0.016996 slate|0.016057 gray|0.016057 ghost|0.016035 white|0.016035 linen|0.015458 dark|0.015285 slate|0.015285 gray|0.015285 alice|0.014458 blue|0.014458 light|0.012161 cyan|0.012161 ivory|0.011484 powder|0.011187 blue|0.011187 light|0.010351 blue|0.010351 old|0.0096933 lace|0.0096933 lavender|0.0076773 blush|0.0076773  "
		}
	}
}
