{
	"add": {
		"doc": {
			"id": "0ef3f275aa30191340ee22ba4268914d03bbb39891afc4594158c6ea2d47862b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Arthur_Shrewsbury.jpg/100px-Arthur_Shrewsbury.jpg",
			"previous": [],
				"after": "The early years of Test cricket saw a number of tours to Australia. Most of these tours were professional in nature, and as the sea voyage was around 42 days and the tours lasted many months, the sides were selected as much on availability as on cricketing aptitude. As a result of this, coupled with there only being a small number of Tests being played, there are many early cricketers with Test records of only a few matches. The key players who had their Test debut during this period include the great professional all-rounders George Ulyett (11), who played 25 Tests, and Billy Barnes (21), who played 21. England's Champion cricketer WG Grace (24) first played Test cricket in 1880. Although Test match cricket had not been invented in his heyday of the late 1860s and 1870s, he continued playing into his fifties, finally retiring from Test cricket at the turn of the century. Shrewsbury (35) and Stoddart (16) go down amongst the great captains of the period, as well as two of the many cricketing suicides. Johnny Briggs (47), who, bedevilled by mental illness, died young, notched up the most Test caps of the earliest era of Test match cricket.",
			"color": "dim|0.31642 gray|0.31642 dim|0.31642 grey|0.31642 gray|0.21561 grey|0.21561 dark|0.16587 gray|0.16587 dark|0.16587 grey|0.16587 slate|0.077189 gray|0.077189 silver|0.067779 light|0.04331 slate|0.04331 gray|0.04331 light|0.032199 gray|0.032199 light|0.032199 grey|0.032199 gainsboro|0.022407 white|0.0083608 smoke|0.0083608 alice|0.0060888 blue|0.0060888 ghost|0.0060699 white|0.0060699 snow|0.0057974 sea|0.0056716 shell|0.0056716 white|0.0051418 lavender|0.0050938 blush|0.0050938 mint|0.004454 cream|0.004454 floral|0.0038719 white|0.0038719 azure|0.0037444 linen|0.0029525  "
		}
	}
}
