{
	"add": {
		"doc": {
			"id": "0f0267b9c3e2fd79ea6cb8f3f2e1d06dfc5f045be9f33a506effa03c29c4b09c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Pbguildhall.jpg/220px-Pbguildhall.jpg",
				"previous": "According to the 2011 Census, 82.5% of Peterborough's residents categorised themselves as white, 2.8% of mixed ethnic groups, 11.7% Asian, 2.3 per cent black and 0.8% other. Amongst the white population, the largest categories were English/Welsh/Scottish/Northern Irish/British (70.9%) and other white (10.6%). Those of Pakistani ethnicity accounted for 6.6% of the population and those of Indian ethnicity 2.5.%. The largest black group were those of African ethnicity (1.4%).[94]",
				"after": "Peterborough is home to one of the largest concentrations of Italian immigrants in the UK. This is mainly as a result of labour recruitment in the 1950s by the London Brick Company in the southern Italian regions of Apulia and Campania. By 1960, approximately 3,000 Italian men were employed by London Brick, mostly at the Fletton works.[95] In 1962, the Scalabrini Fathers, who first arrived in 1956, purchased an old school and converted it into a mission church named after the patron saint of workers Saint Joseph (San Giuseppe). By 1991, over 3,000 christenings of second-generation Italians had been carried out there.[96] In 1996, it was estimated that the Italian community of Peterborough numbered 7,000, making it the third largest in the UK after London and Bedford.[97]",
			"color": "black|0.29592 tan|0.10857 dim|0.098825 gray|0.098825 dim|0.098825 grey|0.098825 gray|0.06205 grey|0.06205 bisque|0.054554 antique|0.048772 white|0.048772 peach|0.04761 puff|0.04761 dark|0.043883 gray|0.043883 dark|0.043883 grey|0.043883 blanched|0.032449 almond|0.032449 silver|0.032441 papaya|0.028265 whip|0.028265 light|0.019973 gray|0.019973 light|0.019973 grey|0.019973 linen|0.017401 old|0.01498 lace|0.01498 gainsboro|0.0121 wheat|0.011119 beige|0.010911 corn|0.0092225 silk|0.0092225 sea|0.0090122 shell|0.0090122  "
		}
	}
}
