{
	"add": {
		"doc": {
			"id": "0f0d5c93c6d3921a4898caeff7b3beba453133a28fbfb120b097e1bf21edbb76",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/KnutVideo2.ogg/220px--KnutVideo2.ogg.jpg",
				"previous": "On 23 March 2007, Knut was presented to the public for the first time.[14] Around 400 journalists visited the Berlin Zoo on what was dubbed \"Knut Day\" to report on the cub's first public appearance to a worldwide audience.[15] Because Knut became the focus of worldwide media at a very young age, many stories and false alarms regarding the cub's health and well-being were circulated during his first year. For example, on 16 April 2007, Knut was removed from display due to teething pains resulting from the growth of his right upper canine tooth, but initial reports vaguely stated that he was suffering from an unknown illness and subsequently put on antibiotics.[16] Much ado was also made about a death threat that was sent shortly before 15:00 local time on Wednesday 18 April 2007. The zoo had received an anonymous letter by fax which said \"Knut ist tot! Donnerstag Mittag.\" (\"Knut is dead! Thursday noon.\")[17] In response, the police increased their security measures around the bear. The time frame for the threat passed without incident or harm to Knut.[18][19]",
				"after": "Despite Der Spiegel reporting on 30 April 2007 that Knut was \"steadily getting less cute\" as he increased in age,[20] Knut continued to bring in record crowds to the zoo that summer. After reaching seven months old and 50 kg (110 lb) in July 2007, Knut's scheduled twice daily public appearances were canceled due to the zoo's concern for the safety of his keeper. Zoo spokeswoman Regine Damm also said it was time for the bear to \"associate with other bears and not with other people.\"[21] After living in the same enclosure as Ernst, a Malaysian black bear cub who was born a month before Knut, and its mother,[22] Knut was then moved to his own private living space. While visitor numbers dwindled from extreme highs in March and April, Knut remained a major attraction at the zoo for the rest of 2007. 400,000 guests were recorded in August 2007, which was an all time high.[23]",
			"color": "gray|0.2665 grey|0.2665 dim|0.24422 gray|0.24422 dim|0.24422 grey|0.24422 dark|0.1614 gray|0.1614 dark|0.1614 grey|0.1614 silver|0.066112 black|0.044841 light|0.038568 gray|0.038568 light|0.038568 grey|0.038568 gainsboro|0.03027 light|0.014291 slate|0.014291 gray|0.014291 light|0.014013 steel|0.014013 blue|0.014013 white|0.013991 smoke|0.013991 sea|0.010486 shell|0.010486 slate|0.010299 gray|0.010299 snow|0.009851 ghost|0.0094464 white|0.0094464 alice|0.0093242 blue|0.0093242 lavender|0.0084663 blush|0.0084663 white|0.0083604 floral|0.0076203 white|0.0076203 mint|0.0076158 cream|0.0076158 linen|0.0075385 azure|0.0058144  "
		}
	}
}
