{
	"add": {
		"doc": {
			"id": "0f19271cf888c5ccdd945d1f94fe3cc06b84a1fb71cc0a0ecca33ce6b5ced5c7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Liberty_Bell_at_Bunker_Hill_1903.jpg/220px-Liberty_Bell_at_Bunker_Hill_1903.jpg",
				"previous": "Between 1885 and 1915, the Liberty Bell made seven trips to various expositions and celebrations. Each time, the bell traveled by rail, making a large number of stops along the way so that local people could view it.[46] By 1885, the Liberty Bell was internationally recognized as a symbol of freedom, and as a treasured relic of Independence, and was growing still more famous as versions of Lippard's legend were reprinted in history and school books.[47] In early 1885, the city agreed to let it travel to New Orleans for the World Cotton Centennial exposition. Large crowds mobbed the bell at each stop. In Biloxi, Mississippi, the former President of the Confederate States of America, Jefferson Davis came to the bell. Davis delivered a speech paying homage to it, and urging national unity.[48] In 1893, it was sent to Chicago's World Columbian Exposition to be the centerpiece of the state's exhibit in the Pennsylvania Building.[49] On July 4, 1893, in Chicago, the bell was serenaded with the first performance of The Liberty Bell March, conducted by \"America's Bandleader\", John Philip Sousa.[50] Philadelphians began to cool to the idea of sending it to other cities when it returned from Chicago bearing a new crack, and each new proposed journey met with increasing opposition.[51] It was also found that the bell's private watchman had been cutting off small pieces for souvenirs. The city placed the bell in a glass-fronted oak case.[52] In 1898, it was taken out of the glass case and hung from its yoke again in the tower hall of Independence Hall, a room which would remain its home until the end of 1975. A guard was posted to discourage souvenir hunters who might otherwise chip at it.[53]",
				"after": "By 1909, the bell had made six trips, and not only had the cracking become worse, but souvenir hunters had deprived it of over one percent of its weight. When, in 1912, the organizers of the Panama-Pacific International Exposition requested the bell for the 1915 fair in San Francisco, the city was reluctant to let it travel again. The city finally decided to let it go as the bell had never been west of St. Louis, and it was a chance to bring it to millions who might never see it otherwise.[54] However, in 1914, fearing that the cracks might lengthen during the long train ride, the city installed a metal support structure inside the bell, generally called the \"spider.\"[55] In February 1915, the bell was tapped gently with wooden mallets to produce sounds which were transmitted to the fair as the signal to open it, a transmission which also inaugurated transcontinental telephone service.[56] Some five million Americans saw the bell on its train journey west.[57] It is estimated that nearly two million kissed it at the fair, with an uncounted number viewing it. The bell was taken on a different route on its way home; again, five million saw it on the return journey.[58] Since the bell returned to Philadelphia, it has been moved out of doors only five times: three times for patriotic observances during and after World War I, and twice as the bell occupied new homes in 1976 and 2003.[51][59] Chicago and San Francisco had obtained its presence after presenting petitions signed by hundreds of thousands of children. Chicago tried again, with a petition signed by 3.4 million schoolchildren, for the 1933 Century of Progress Exhibition and New York presented a petition to secure a visit from the bell for the 1939 New York World's Fair. Both efforts failed.[60]",
			"color": " "
		}
	}
}
