{
	"add": {
		"doc": {
			"id": "0f271a5eabb7278b5165acf391dd830950350fe88e62cd5f07edbcb0b5ec8400",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Imperial_Palace_in_Kyoto_-_looking_into_south_gate_of_main_building_3.JPG/220px-Imperial_Palace_in_Kyoto_-_looking_into_south_gate_of_main_building_3.JPG",
				"previous": "The largest building of the Dairi was the Throne Hall or Shishinden (紫宸殿?), a building reserved for official functions. It was a rectangular hall measuring approximately 30 m (98 ft) east to west and 25 m (82 ft) north to south,[14] and situated along the median north-south axis of the Dairi, overseeing a rectangular courtyard and facing the Shōmeimon gate. A tachibana orange tree and a sakura cherry tree stood symmetrically on both sides of the front staircase of the building. The courtyard was flanked on both sides by smaller halls connected to the Shishinden, creating the same configuration of buildings (influenced by Chinese examples) that was found in the aristocratic shinden style villas of the period.",
				"after": "The Shishinden was used for official functions and ceremonies that were not held at the Daigokuden of the Chōdō-in complex. It took over much of the intended use of the larger and more formal building from an early date, as the daily business of government ceased to be conducted in the presence of the emperor in the Daigokuden already at the beginning of the ninth century.[11] Connected to this diminishing reliance on the official government procedures described in the Ritsuryō code was the establishment of a personal secretariat to the emperor, the Chamberlain's Office or Kurōdodokoro (蔵人所?). This office, which increasingly took over the role of coordinating the work of government organs, was set up in the Kyōshōden (校書殿?), the hall to the south-west of the Shishinden.[15]",
			"color": "black|0.23197 maroon|0.22249 light|0.090983 gray|0.090983 light|0.090983 grey|0.090983 gainsboro|0.079351 dark|0.072187 red|0.072187 silver|0.059615 dim|0.037908 gray|0.037908 dim|0.037908 grey|0.037908 dark|0.035023 gray|0.035023 dark|0.035023 grey|0.035023 gray|0.024253 grey|0.024253 linen|0.017487 white|0.011773 smoke|0.011773 misty|0.011244 rose|0.011244 ghost|0.0099782 white|0.0099782 alice|0.0094933 blue|0.0094933 snow|0.0094216 lavender|0.0088249 blush|0.0088249 white|0.0083874 sea|0.0079305 shell|0.0079305 azure|0.0069652 antique|0.0063355 white|0.0063355 lavender|0.0061044 mint|0.0057883 cream|0.0057883 floral|0.0051025 white|0.0051025  "
		}
	}
}
