{
	"add": {
		"doc": {
			"id": "0f37a03473403809e55b53e35da6fcf51b0fe235b7931d759da8008a1e67cb35",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Psittacula_exsul_Jossigny.jpg/220px-Psittacula_exsul_Jossigny.jpg",
				"previous": "Newton's parakeet was about 40 cm (16 in) long - roughly the size of the rose-ringed parakeet.[11] The wing of the male specimen was 198 mm (7.7 in), the tail 206 mm (8.11 in), the culmen 25 mm (0.9 in), and the tarsus was 22 mm (0.8 in). The wing of the female specimen was 191 mm (7.5 in), the tail 210 mm (8.2 in), the culmen 24 mm (0.9 in), and the tarsus was 22 mm (0.8 in). The male specimen was greyish blue (also described as \"slatey blue\") tinged with green, and darker above. The head was bluer, with a dark line running from the eye to the cere. It had a broad black collar running from the chin to the nape, where it became gradually narrower. The underside of the tail was greyish, the upper beak was dark reddish brown, and the mandible was black. The legs were grey and the iris yellow. The female was similar, but had a greyer head and a black beak. The black collar was not so prominent as that of the male, and did not extend to the back of the neck.[13] The general appearance of Newton's parakeet was similar to the extant Psittacula species, including the black collar, but the bluish grey colouration set it apart from other members of its genus, which are mostly green.[13]",
				"after": "Philibert Commerson received a live specimen on Mauritius in the 1770s and described it as \"greyish blue\". Paul Jossigny made two illustrations of this specimen, the only known depictions of Newton's parakeet in life, unpublished until 2007.[3] Though both existing specimens are blue, some early accounts from Rodrigues have caused confusion over the colouration of the plumage.[13] One of these is Leguat's following statement:",
			"color": "gray|0.43876 grey|0.43876 dim|0.27634 gray|0.27634 dim|0.27634 grey|0.27634 dark|0.20589 gray|0.20589 dark|0.20589 grey|0.20589 silver|0.038098 black|0.014445 slate|0.012332 gray|0.012332 light|0.0073226 gray|0.0073226 light|0.0073226 grey|0.0073226 light|0.0036367 slate|0.0036367 gray|0.0036367  "
		}
	}
}
