{
	"add": {
		"doc": {
			"id": "0f3aeaa741ff5e5dd9da759124dd5bcd971cb472757da62d03aa5d7990697c65",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Pigeon%27s_Rock_Beirut_Lebanon.jpg/220px-Pigeon%27s_Rock_Beirut_Lebanon.jpg",
				"previous": "In May 2008, after the government decided to disband Hezbollah's communications network (a decision it later rescinded), violent clashes broke out briefly between government allies and opposition forces, before control of the city was handed over to the Lebanese Army. After this a national dialogue conference was held in Doha at the invitation of the Prince of Qatar. The conference agreed to appoint a new president of Lebanon and to establish a new national government involving all the political adversaries. As a result of the Doha Agreement, the opposition's camp in the capital was removed.[clarification needed][citation needed]. On 19 October 2012, a car bomb killed eight people in the Beirut's neighbourhood of Achrafiyeh, including Brigadier General Wissam al-Hassan, chief of the Intelligence Bureau of the Internal Security Forces. In addition, 78 others were wounded in the bombing.[59] It was the largest attack in the capital since 2008.[60] On 27 December 2013, a car bomb exploded in the Central District killing at least five people, including the former Lebanese ambassador to the U.S. Mohamad Chatah, and wounding 71 others.[61]",
				"after": "Beirut sits on a peninsula extending westward into the Mediterranean Sea[62] about 94 km (58 mi) north of the Lebanon-Israel border.[63] It is flanked by the Lebanon Mountains and has taken on a triangular shape, largely influenced by its situation between and atop two hills: Al-Ashrafieh and Al-Musaytibah. The Beirut Governorate occupies 18 square kilometres (6.9 sq mi), and the city's metropolitan area 67 square kilometres (26 sq mi).[62] The coast is rather diverse, with rocky beaches, sandy shores and cliffs situated beside one another.",
			"color": "black|0.55567 dark|0.23064 gray|0.23064 dark|0.23064 grey|0.23064 gray|0.089015 grey|0.089015 dim|0.083357 gray|0.083357 dim|0.083357 grey|0.083357 slate|0.015782 gray|0.015782 silver|0.013178 light|0.010512 slate|0.010512 gray|0.010512  "
		}
	}
}
