{
	"add": {
		"doc": {
			"id": "0f596a6bf84c009f14ee578dbeeb325213afac8867b7c74048526c8c35284ece",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Chowringhee_Square%2C_Calcutta_in_1945.jpg/220px-Chowringhee_Square%2C_Calcutta_in_1945.jpg",
				"previous": "The discovery and archaeological study of Chandraketugarh, 35 kilometres (22 mi) north of Kolkata, provide evidence that the region in which the city stands has been inhabited for over two millennia.[18][19] Kolkata's recorded history began in 1690 with the arrival of the English East India Company, which was consolidating its trade business in Bengal. Job Charnock, an administrator who worked for the Company, is traditionally credited as the founder of the city;[20] in response to a public petition, the Calcutta High Court ruled in 2003 that the city does not have a founder.[21] The area occupied by the present-day city encompassed three villages: Kalikata, Gobindapur, and Sutanuti. Kalikata was a fishing village; Sutanuti was a riverside weavers' village. They were part of an estate belonging to the Mughal emperor; the jagirdari (a land grant bestowed by a king on his noblemen) taxation rights to the villages were held by the Sabarna Roy Choudhury family of landowners, or zamindars. These rights were transferred to the East India Company in 1698.[22]:1",
				"after": "In 1712, the British completed the construction of Fort William, located on the east bank of the Hooghly River to protect their trading factory.[23] Facing frequent skirmishes with French forces, the British began to upgrade their fortifications in 1756. The Nawab of Bengal, Siraj ud-Daulah, condemned the militarization and tax evasion by the company. His warning went unheeded, and the Nawab attacked; he captured Fort William which led to the killings of several East India company officials in the Black Hole of Calcutta.[24] A force of Company soldiers (sepoys) and British troops led by Robert Clive recaptured the city the following year.[24] Per the 1765 Treaty of Allahabad following the battle of Buxar, East India company was appointed imperial tax collector of the Mughal emperor in the province of Bengal, Bihar and Orissa, while Mughal-appointed Nawabs continued to rule the province.[25] Declared a presidency city, Calcutta became the headquarters of the East India Company by 1772.[26] In 1793, ruling power of the Nawabs were abolished and East India company took complete control of the city and the province. Beginning in 1864, the hill station of Shimla served as administrative capital during summers.[27] In the early 19th century, the marshes surrounding the city were drained; the government area was laid out along the banks of the Hooghly River. Richard Wellesley, Governor-General of East India company held territories between 1797 and 1805, was largely responsible for the development of the city and its public architecture.[28] Throughout the late 18th and 19th century, the city was a centre of the East India Company's opium trade.[29]",
			"color": "tan|0.25788 black|0.19946 wheat|0.12041 bisque|0.067341 peach|0.048488 puff|0.048488 blanched|0.040535 almond|0.040535 burly|0.030435 wood|0.030435 moccasin|0.030201 antique|0.030114 white|0.030114 papaya|0.025322 whip|0.025322 navajo|0.024091 white|0.024091 dim|0.022552 gray|0.022552 dim|0.022552 grey|0.022552 gray|0.014267 grey|0.014267 corn|0.012695 silk|0.012695 beige|0.011352 dark|0.0081627 gray|0.0081627 dark|0.0081627 grey|0.0081627 old|0.0078239 lace|0.0078239 light|0.0067456 golden|0.0067456 rod|0.0067456 yellow|0.0067456 light|0.0065302 yellow|0.0065302 lemon|0.0061662 chiffon|0.0061662  "
		}
	}
}
