{
	"add": {
		"doc": {
			"id": "0f5e294a51a05051537d0fbbc05d1fd17936351a0762b2c2a5bc985a9b4adf31",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/HBC-Upper_Savage_Islands-Hudson_Strait.jpg/220px-HBC-Upper_Savage_Islands-Hudson_Strait.jpg",
				"previous": "The semi-nomadic eco-centred Inuit were fishers and hunters harvesting lakes, seas, ice platforms and tundra. While there are some allegations that Inuit were hostile to early French and English explorers, fishers and whalers, more recent research suggests that the early relations with whaling stations along the Labrador coast and later James Bay were based on a mutual interest in trade.[35] In the final years of the 18th century, the Moravian Church began missionary activities in Labrador, supported by the British who were tired of the raids on their whaling stations. The Moravian missionaries could easily provide the Inuit with the iron and basic materials they had been stealing from whaling outposts, materials whose real cost to Europeans was almost nothing, but whose value to the Inuit was enormous and from then on contacts in Labrador were far more peaceful.",
				"after": "The European arrival tremendously damaged the Inuit way of life, causing mass death through new diseases introduced by whalers and explorers, and enormous social disruptions caused by the distorting effect of Europeans' material wealth. Nonetheless, Inuit society in the higher latitudes had largely remained in isolation during the 19th century. The Hudson's Bay Company opened trading posts such as Great Whale River (1820), today the site of the twin villages of Whapmagoostui and Kuujjuarapik, where whale products of the commercial whale hunt were processed and furs traded. The British Naval Expedition of 1821–3 led by Admiral William Edward Parry, which twice over-wintered in Foxe Basin, provided the first informed, sympathetic and well-documented account of the economic, social and religious life of the Inuit. Parry stayed in what is now Igloolik over the second winter. Parry's writings, with pen and ink illustrations of Inuit everyday life, and those of George Francis Lyon, both published in 1824 were widely read.[36] Captain George Comer's Inuit wife Shoofly, known for her sewing skills and elegant attire,[37] was influential in convincing him to acquire more sewing accessories and beads for trade with Inuit.",
			"color": "beige|0.15408 light|0.12952 golden|0.12952 rod|0.12952 yellow|0.12952 dark|0.11262 gray|0.11262 dark|0.11262 grey|0.11262 corn|0.1112 silk|0.1112 light|0.10931 yellow|0.10931 lemon|0.09549 chiffon|0.09549 gray|0.083179 grey|0.083179 papaya|0.037033 whip|0.037033 blanched|0.035224 almond|0.035224 dim|0.033329 gray|0.033329 dim|0.033329 grey|0.033329 wheat|0.021174 honeydew|0.017299 silver|0.017038 antique|0.016417 white|0.016417 light|0.005213 gray|0.005213 light|0.005213 grey|0.005213 tan|0.0039029  "
		}
	}
}
