{
	"add": {
		"doc": {
			"id": "0f6171c5dd61745c0344c1c2413b91b3e6d2f8c59dcc411b8ca6adaed02cd969",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/1878_three-dollar_piece_obverse.jpg/220px-1878_three-dollar_piece_obverse.jpg",
				"previous": "As early as 1851, New York Congressman William Duer alleged that that Patterson had made the gold dollar too small in diameter on purpose to provoke criticism. Patterson retired that year after 16 years in his position, and under his successor, George N. Eckert, annular gold dollar and half dollar patterns were struck. Public Ledger reported that although gold dollars would not be struck in annular form, gold half dollars would be, to help fill the need for change. With the new Pierce administration, Thomas M. Pettit took office as Mint Director on March 31, 1853. In April, Treasury Secretary James Guthrie wrote to Pettit that there were complaints that the gold dollar was too small, often lost or mistaken for a small silver coin, and enquiring about reports the Mint had experimented with annular dollars. Pettit replied, stating that none had been preserved, but enclosed a silver piece of equivalent size. He noted that while there would be technical difficulties in the production of the annular dollar, these could be overcome. In a letter dated May 10, Pettit proposed an oval-shaped holed piece, or an angular-shaped coin, which would lessen the production problems. Pettit died suddenly on May 31; Guthrie did not let the issue fall, but queried Pettit's replacement, James Ross Snowden, concerning the issue on June 7. As U.S. coins were required to bear some device emblematic of liberty, the secretary hoped that artists could be found who could find some such design for an annular coin.[29]",
				"after": "The Act of February 21, 1853, that had lightened the silver coins also authorized a gold three-dollar piece, which began to be produced in 1854. To ensure that the three-dollar piece was not mistaken for other gold coins, it had been made thinner and wider than it would normally be, and Longacre put a distinctive design with an Indian princess on it. Longacre adapted both the technique and the design for the gold dollar, which was made thinner, and thus wider. An adaptation of Longacre's princess for the larger gold coin was placed on the dollar, and a similar agricultural wreath on the reverse. The idea of making the gold dollar larger in this way had been suggested in Congress as early as 1852, and had been advocated by Pettit, but Guthrie's desire for an annular coin stalled the matter.[19][30] In May 1854, Snowden sent Guthrie a letter stating that the difficulties with an annular coin, especially in getting the coins to eject properly from the press, were more than trivial.[31]",
			"color": "dark|0.32244 khaki|0.32244 burly|0.20331 wood|0.20331 tan|0.15232 pale|0.073907 golden|0.073907 rod|0.073907 wheat|0.070566 khaki|0.055873 navajo|0.046285 white|0.046285 moccasin|0.040972  "
		}
	}
}
