{
	"add": {
		"doc": {
			"id": "0f64fe9d4906cb437f3aac1fd57dee571ab4ca41261c68108612ab7e7e1cfa7d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Blueprint_for_Everglades_canals1921.jpg/170px-Blueprint_for_Everglades_canals1921.jpg",
				"previous": "Broward asked James O. Wright—an engineer on loan to the State of Florida from the USDA's Bureau of Drainage Investigations—to draw up plans for drainage in 1906. Two dredges were built by 1908, but had cut only 6 miles (9.7 km) of canals. The project quickly ran out of money, so Broward sold real estate developer Richard J. Bolles a million dollars worth of land in the Everglades, 500,000 acres (2,000 km2), before the engineer's report had been submitted.[30] Abstracts from Wright's report were given to the IIF stating that eight canals would be enough to drain 1,850,000 acres (7,500 km2) at a cost of a dollar an acre.[31] The abstracts were released to real estate developers who used them in their advertisements, and Wright and the USDA were pressed by the real estate industry to publicize the report as quickly as possible.[31] Wright's supervisor noted errors in the report, as well as undue enthusiasm for draining, and delayed its release in 1910. Different unofficial versions of the report circulated—some that had been altered by real estate interests—and a version hastily put together by Senator Duncan U. Fletcher called U.S. Senate Document 89 included early unrevised statements, causing a frenzy of speculation.[1]",
				"after": "Wright's initial report concluded that drainage would not be difficult. Building canals would be more cost effective than constructing a dike around Lake Okeechobee. The soil would be fertile after drainage, the climate would not be adversely affected, and the enormous lake would be able to irrigate farmland in the dry season.[1] Wright based his conclusions on 15 years of weather data since the recording of precipitation began in the 1890s. His calculations concentrated on the towns of Jupiter and Kissimmee. Since weather data had not been recorded for any area within the Everglades, none was included in the report. Furthermore, the heaviest year of rain on record, Wright assumed, was atypical, and he urged that canals should not be constructed to bear that amount of water due to the expense. Wright's calculations for what canals should be able to hold were off by 55 percent.[32] His most fundamental mistake, however, was designing the canals for a maximum rainfall of 4 inches (10 cm) of water a day, based on flawed data for July and August rainfall, despite available data that indicated torrential downpours of 10 inches (25 cm) and 12 inches (30 cm) had occurred in 24-hour periods.[1]",
			"color": "steel|0.97864 blue|0.97864  "
		}
	}
}
