{
	"add": {
		"doc": {
			"id": "0f64df08e7b29768b1a60e7b91d7a32416f5c6a725aab215db68b4cca56f1861",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Stork_picking_at_rabbit.jpg/220px-Stork_picking_at_rabbit.jpg",
				"previous": "White storks consume a wide variety of animal prey. They prefer to forage in meadows that are within roughly 5 km (3 mi) of their nest and sites where the vegetation is shorter so that their prey is more accessible.[41] Their diet varies according to season, locality and prey availability. Common food items include insects (primarily beetles, grasshoppers, locusts and crickets), earthworms, reptiles, amphibians, particularly frog species such as the edible frog (Pelophylax kl. esculentus) and common frog (Rana temporaria) and small mammals such as voles, moles and shrews. Less commonly, they also eat bird eggs and young birds, fish, molluscs, crustaceans and scorpions. They hunt mainly during the day, swallowing small prey whole, but killing and breaking apart larger prey before swallowing.[65] Rubber bands are mistaken for earthworms and consumed, occasionally resulting in fatal blockage of the digestive tract.[74]",
				"after": "Birds returning to Latvia during spring have been shown to locate their prey, moor frogs (Rana arvalis), by homing in on the mating calls produced by aggregations of male frogs.[75]",
			"color": "black|0.14866 dark|0.08679 olive|0.08679 green|0.08679 light|0.070183 gray|0.070183 light|0.070183 grey|0.070183 gainsboro|0.060521 silver|0.059937 dark|0.056492 sea|0.056492 green|0.056492 white|0.046129 smoke|0.046129 sea|0.042968 shell|0.042968 floral|0.040459 white|0.040459 snow|0.03722 mint|0.037082 cream|0.037082 linen|0.035183 white|0.032286 azure|0.023196 ghost|0.022966 white|0.022966 alice|0.022488 blue|0.022488 old|0.021937 lace|0.021937 dark|0.021851 gray|0.021851 dark|0.021851 grey|0.021851 tan|0.019284 lavender|0.015335 blush|0.015335 ivory|0.015042 dim|0.01312 gray|0.01312 dim|0.01312 grey|0.01312 dark|0.010548 salmon|0.010548 antique|0.0098719 white|0.0098719 burly|0.0086649 wood|0.0086649  "
		}
	}
}
