{
	"add": {
		"doc": {
			"id": "0f6b05299bb76a44bb5d37fffc162b944e3a62dfaa03d5421bda79d81bf67eed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Weeks_Edwin_Departure_For_The_Hunt.jpg/220px-Weeks_Edwin_Departure_For_The_Hunt.jpg",
			"previous": [],
				"after": "Hindu scriptures describe hunting as an acceptable occupation, as well as a sport of the kingly. Even figures considered godly are described to have engaged in hunting. One of the names of the god Shiva is Mrigavyadha, which translates as \"the deer hunter\" (mriga means deer; vyadha means hunter). The word Mriga, in many Indian languages including Malayalam, not only stands for deer, but for all animals and animal instincts (Mriga Thrishna). Shiva, as Mrigavyadha, is the one who destroys the animal instincts in human beings. In the epic Ramayana, Dasharatha, the father of Rama, is said to have the ability to hunt in the dark. During one of his hunting expeditions, he accidentally killed Shravana, mistaking him for game. During Rama's exile in the forest, Ravana kidnapped his wife, Sita, from their hut, while Rama was asked by Sita to capture a golden deer, and his brother Lakshman went after him. According to the Mahabharat, Pandu, the father of the Pandavas, accidentally killed the sage Kindama and his wife with an arrow, mistaking them for a deer. Krishna is said to have died after being accidentally wounded by an arrow of a hunter.",
			"color": "black|0.24971 tan|0.12632 silver|0.094917 light|0.069218 gray|0.069218 light|0.069218 grey|0.069218 dark|0.057027 gray|0.057027 dark|0.057027 grey|0.057027 gainsboro|0.039179 burly|0.036119 wood|0.036119 dim|0.035001 gray|0.035001 dim|0.035001 grey|0.035001 gray|0.029542 grey|0.029542 corn|0.027856 flower|0.027856 blue|0.027856 antique|0.020027 white|0.020027 rosy|0.01724 brown|0.01724 wheat|0.015554 linen|0.012029 peach|0.01136 puff|0.01136 bisque|0.010931 misty|0.0088016 rose|0.0088016 blanched|0.0087328 almond|0.0087328 papaya|0.0084232 whip|0.0084232 sea|0.0082823 shell|0.0082823 old|0.0080995 lace|0.0080995  "
		}
	}
}
