{
	"add": {
		"doc": {
			"id": "0f6ebac8e7f8163e347075c230f7e39ea60df9f5b46fdc7e5a7eb7ee6dcb45e9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Baltimore_City_College_%28print_ca._1869%29.jpg/250px-Baltimore_City_College_%28print_ca._1869%29.jpg",
			"previous": [],
				"after": "The history of The Baltimore City College began in March 1839, when the City Council of Baltimore, Maryland, United States, passed a resolution mandating the creation of a male high school with a focus on the study of English and classical literature. The Baltimore City College was opened later in the same year on October 20th, with 46 pupils under the direction of Professor Nathan C. Brooks,(1809-1898), a local noted classical educator and poet, who became the first principal.[1] It is now considered to be the third oldest public high school in the nation. In 1850, the Baltimore City Council granted the school the authority to present its graduates with certificates of completion.[2] An effort to expand that academic power and allow the then named \"Central High School of Baltimore\" to confer Bachelor of Arts degrees began in 1865, and continued the following year with the renaming of the institution as \"The Baltimore City College\", which it still holds to this day, with also the retitling of its chief academic officer from \"principal\" to \"president\", along with an increase in the number of years of its course of study and the expansion of its courses. However, despite this early elevation effort, it ended at that time unsuccessfully in 1869, although the B.C.C. continued for a number of years as a hybrid public high school and early form of junior college (later known as community college) which did not fully appear in America until the beginning of the 20th Century. Very often the graduation diploma in the late 19th and early 20th Centuries was accepted by many other colleges and universities entitling City graduates to enter upper-division schools at the sophomore year, (which was also coincidentally a privilege also accorded to its later local academic and athletic rival, the Baltimore Polytechnic Institute, founded 1883).[3]",
			"color": " "
		}
	}
}
