{
	"add": {
		"doc": {
			"id": "0f817c522caebb3405d8289536708f6bddb967e12d0a9ece39527e2b35878282",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Cooke_and_Wheatstone_electric_telegraph.jpg/220px-Cooke_and_Wheatstone_electric_telegraph.jpg",
				"previous": "The first commercial electrical telegraph was co-developed by Sir William Fothergill Cooke and Charles Wheatstone. In May 1837 they patented the Cooke and Wheatstone system, which used a number of needles on a board that could be moved to point to letters of the alphabet. The patent recommended a five-needle system, but any number of needles could be used depending on the number of characters it was required to code. A four-needle system was installed between Euston and Camden Town in London on a rail line being constructed by Robert Stephenson between London and Birmingham. It was successfully demonstrated on 25 July 1837.[15] Euston needed to signal to an engine house at Camden Town to start hauling the locomotive up the incline. As at Liverpool, the electric telegraph was in the end rejected in favour of a pneumatic system with whistles.[16]",
				"after": "Cooke and Wheatstone had their first commercial success with a system installed on the Great Western Railway over the 13 miles (21 km) from Paddington station to West Drayton in 1838, the first commercial telegraph in the world.[17] This was a five-needle, six-wire[16] system. The cables were originally installed underground in a steel conduit. However, the cables soon began to fail as a result of deteriorating insulation and were replaced with uninsulated wires on poles.[18] As an interim measure, a two-needle system was used with three of the remaining working underground wires, which despite using only two needles had a greater number of codes.[19] But when the line was extended to Slough in 1843, a one-needle, two-wire system was installed.[20]",
			"color": "gray|0.073947 grey|0.073947 dark|0.067155 golden|0.067155 rod|0.067155 peru|0.065514 dark|0.055517 gray|0.055517 dark|0.055517 grey|0.055517 floral|0.046786 white|0.046786 sea|0.040609 shell|0.040609 mint|0.037648 cream|0.037648 white|0.034548 smoke|0.034548 white|0.03452 snow|0.034358 silver|0.030182 ivory|0.028183 azure|0.027283 old|0.02556 lace|0.02556 burly|0.025424 wood|0.025424 ghost|0.025403 white|0.025403 linen|0.023237 alice|0.02315 blue|0.02315 beige|0.022662 lemon|0.02209 chiffon|0.02209 corn|0.02201 silk|0.02201 light|0.021253 golden|0.021253 rod|0.021253 yellow|0.021253 light|0.021046 yellow|0.021046 lavender|0.02037 blush|0.02037 tan|0.020134 pale|0.019874 golden|0.019874 rod|0.019874 honeydew|0.01622 antique|0.016096 white|0.016096 dim|0.016026 gray|0.016026 dim|0.016026 grey|0.016026 papaya|0.015437 whip|0.015437 wheat|0.01108 light|0.010477 gray|0.010477 light|0.010477 grey|0.010477 blanched|0.01004 almond|0.01004  "
		}
	}
}
