{
	"add": {
		"doc": {
			"id": "0f81e1720f39b4c73f9a8d42b0fcb57d3fbf8d9b9003ff4487118ea3339bf646",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Warkworth_Castle%27s_keep%2C_2007.jpg/300px-Warkworth_Castle%27s_keep%2C_2007.jpg",
				"previous": "Around this time, the Percy family was becoming Northumberland's most powerful dynasty.[18] Henry de Percy, 2nd Baron Percy, was in the service of Edward III and was paid 500 marks a year in perpetuity in return for leading a company of men-at-arms. In exchange for the annual fee, in 1328 Percy was promised the rights to the Clavering estates. Parliament declared such contracts illegal in 1331, but after initially relinquishing his claim Percy was granted special permission to inherit. John de Clavering died in 1332 and his widow in 1345, at which point the family's estates became the property of the Percys.[13] While the Percys owned Alnwick Castle, which was considered more prestigious, Warkworth was the family's preferred home. Under the Percys a park was created nearby for hunting, and within the castle two residential blocks were created, described by historian John Goodall as \"of unparalleled quality and sophistication in Northumberland\".[18] The second baron died at Warkworth in 1352.[13]",
				"after": "In 1377 the fourth Baron Percy, also named Henry, was made the first Earl of Northumberland (becoming the first family from northern England to be granted an earldom)[14] in recognition of his extensive power in the march areas along the Anglo-Scottish border.[19] With a network of contacts and dependencies, the Percys were the pre-eminent family in northern England in the 14th century \"for they have the hertes of the people by north and ever had\", in the words of contemporaneous chronicler John Hardyng.[20] Henry Percy commissioned the building of the distinctive keep shortly after he was made Earl of Northumberland. Percy may have enhanced his main castle to compete with John of Gaunt, who rebuilt the nearby Dunstanburgh Castle, or with the House of Neville, a family becoming increasingly powerful in northern England and who undertook a programme of building at the castles of Brancepeth, Raby, Bamburgh, Middleham, and Sheriff Hutton.[19][21] Architectural similarities between Warkworth's keep, Bolton Castle, and the domestic buildings at Bamburgh Castle suggest that John Lewyn was the master mason responsible for building Warkworth's keep.[19] Earl Henry helped dethrone Richard II and replace him with Henry IV. The earl and his eldest son Henry \"Hotspur\" Percy fell out with the new king, and eventually rebelled. After Hotspur was killed at the Battle of Shrewsbury in 1403, his father fled to Warkworth.[22] The earl eventually went to York to submit to the king. He was arrested and the king attempted to install his own men at the castles of Alnwick, Langley Castle, Prudhoe, and Warkworth.[23] The earl's 14-year-old son claimed that he was loyal to the king but was not empowered to formally surrender the castle, and it remained under control of the Percys.[22] Henry was pardoned in 1404.[23]",
			"color": "black|0.34025 tan|0.31224 dark|0.17548 olive|0.17548 green|0.17548 burly|0.14016 wood|0.14016  "
		}
	}
}
