{
	"add": {
		"doc": {
			"id": "0f874e334fe25b9ae16090d3b212456a94e0870766f5e291a7b4f8eb6aa14162",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Vickers_759_Visc_TF-ISU_Iceland_LHR_07.09.62_edited-2.jpg/220px-Vickers_759_Visc_TF-ISU_Iceland_LHR_07.09.62_edited-2.jpg",
				"previous": "In the same year, comfort and performance of domestic flights in Iceland could be improved with the introduction of the Douglas DC-3 Dakota. A total of six airliners of that type had been purchased, which remained in service with the airline until 1972, the oldest one being still flightworthy as of 2011.[10] Until the late 1960s, Flugfélag concentrated mostly on domestic flights, where it initially faced fierce competition from Loftleiðir, another airline which had been founded in 1944. When a merger proposal of the Icelandic government was rejected by the two airlines, the domestic routes were split among them as a measure to ease competition. When Loftleiðir pulled out of the domestic market in 1952 to fully concentrate on international flights, Flugfélag became the main domestic carrier of the country.",
				"after": "International services stayed part of the business model of Flugfélag, though to a far lesser extent compared to Loftleiðir. In 1948, the Douglas C-54 Skymaster was introduced on those routes, and in 1957 two new Vickers 759 Viscounts were acquired, the first turboprop airliners to be operated by an Icelandic airline. In the 1950s, Flugfélag began to use the Icelandair branding for its international flights.[7]",
			"color": "dark|0.27388 gray|0.27388 dark|0.27388 grey|0.27388 gray|0.2674 grey|0.2674 dim|0.083989 gray|0.083989 dim|0.083989 grey|0.083989 black|0.041581 silver|0.041201 slate|0.021788 gray|0.021788 light|0.020747 slate|0.020747 gray|0.020747 light|0.018128 gray|0.018128 light|0.018128 grey|0.018128 white|0.017448 smoke|0.017448 snow|0.015566 gainsboro|0.015562 sea|0.015549 shell|0.015549 white|0.01432 floral|0.013774 white|0.013774 ghost|0.013654 white|0.013654 mint|0.01352 cream|0.01352 alice|0.013037 blue|0.013037 azure|0.010521 lavender|0.010448 blush|0.010448 linen|0.0098387 dark|0.0089191 slate|0.0089191 gray|0.0089191 tan|0.0074611  "
		}
	}
}
