{
	"add": {
		"doc": {
			"id": "0f876683d48341b898309ad540979e56040462babab5f3bef9af085262c0f83c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Archaeopteryx_bavarica_Detail.jpg/220px-Archaeopteryx_bavarica_Detail.jpg",
				"previous": "The feathers of Archaeopteryx were asymmetrical. This has been interpreted as evidence that it was a flyer, because flightless birds tend to have symmetrical feathers, however some scientists, including Thomson and Speakman, have questioned this. They studied more than 70 families of living birds, and found that some flightless types do have a range of asymmetry in their feathers, and that the feathers of Archaeopteryx fall into this range.[33] However, the degree of asymmetry with Archaeopteryx is more typical for slow flyers than for flightless birds.[34]",
				"after": "In 2010, Robert L. Nudds and Gareth J. Dyke in the journal Science published a paper in which they analysed the rachises of the primary feathers of Confuciusornis and Archaeopteryx. The analysis suggested that the rachises on these two genera were thinner and weaker than those compared to modern birds relative to body weight. The authors determined that Archaeopteryx, along with Confuciusornis, were unable to use flapping flight.[35] This study was criticized by Philip J. Currie and Luis Chiappe, however. Chiappe suggested that it is difficult to measure the rachises of fossilized feathers, and Currie speculated that Archaeopteryx and Confuciusornis must have been able to fly to some degree, as their fossils are preserved in what is believed to have been in marine or lake sediments, suggesting that they must have been able to fly over deep water.[36] Gregory Paul also disagreed with the study, arguing in a 2010 response that Nudds and Dyke had overestimated the weights of these early birds, and that more accurate weight estimates allowed powered flight even with relatively narrow rachises. Nudds and Dyke had assumed a weight of 250 grams for the Munich specimen Archaeopteryx, a young juvenile, based on published weight estimates of larger specimens. Paul argued that a more reasonable body weight estimate for the Munich specimen is about 140 grams. Paul also criticized the measurements of the rachises themselves, noting that the feathers in the Munich specimen are poorly preserved. Nudds and Dyke reported a diameter of 0.75 millimetre (0.030 in) for the longest primary feather, which Paul could not confirm using photographs. Paul measured some of the inner primary feathers, finding rachises 1.25–1.4 mm across.[37] Despite these criticisms, Nudds and Dyke stood by their original conclusions. They claimed that Paul's statement, that an adult Archaeopteryx would have been a better flyer than the juvenile Munich specimen, was dubious. This, they reasoned, would require even thicker rachis, evidence for which has not yet been presented.[38] Another possibility is that they hadn't achieved true flight, but instead used their wings as aids for extra lift while running over water after the fashion of the basilisk lizard, which could explain their presence in lake and marine deposits (see Evolution of bird flight).[39][40]",
			"color": "burly|0.57175 wood|0.57175 tan|0.41831  "
		}
	}
}
