{
	"add": {
		"doc": {
			"id": "0f8eaf09b792420417dac05d8cd7bf5db5952334e2a82e16210e884c4605bac8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Eudocimus_albus_-Port_Orange%2C_Florida%2C_Florida%2C_USA-8.jpg/170px-Eudocimus_albus_-Port_Orange%2C_Florida%2C_Florida%2C_USA-8.jpg",
				"previous": "The American white ibis is a tactile, nonvisual forager, which limits its ability to choose from a wide variety of prey.[54] For the most part, the American white ibis forages for food by tactile probing. It wades slowly through shallow water and sticks its long, downcurved bill into the substrate of the water body with its bill held at around 1 to 2 cm (0.39 to 0.79 in) agape at the tip, and sweeps its long bill back and forth across the bottom to pick out suitable food items.[2] Birds may also probe when standing still. Groping with a wide open bill is a technique used by ibis in deeper water when alone, as is head swinging, in which the ibis swings its wide open bill widely in open water. Others copy this type of foraging if they see one ibis doing it. On land, the American white ibis locates prey by sight and pecks, and does not have to insert its bill into the substrate.[54] The American white ibis seeks small prey when other birds are around, as it needs time to break up larger food items into smaller pieces to eat, and other predators such as herons and egrets often take the opportunity to rob the ibis of its catch.[29][55] Along with the scarlet ibis, the species coexists with another five species of ibis in the Llanos in Venezuela. American white ibis males are aggressive to and take prey items from smaller ibises, but the smaller females are more often the victims of this behavior.[56]",
				"after": "Juveniles have lower foraging efficiency compared to adults and in most feeding flocks, the juveniles are usually outnumbered by the adults. They usually tend to stay close to one another and forage for food together at the peripheral region of the group.[57] During the breeding season, adult male ibises have been recorded raiding other parent ibises who are feeding their young in the colony. The raiders force their bill down the throat of the victim—either the parent about to disgorge their food or recently fed young—and extract the ball of food.[58] This behavior allows the otherwise starving adult males to obtain food without having to spend long periods of time away from the nest, and prevent its female mate copulating with another male ibis, which would reduce its own reproductive success. Females and juveniles almost never try to drive off the larger and more aggressive pirating males, but instead try to avoid or move away from them.[58] This pirating behavior is less common between two male ibises as the males will actively fight off the pirate.[58] The explanation of the species' sexual dimorphism of body size is unclear, because no differences between the sexes in feeding success rates or the foraging behavior have been observed and, as males are larger, they need more food than females.[59]",
			"color": "dark|0.19091 gray|0.19091 dark|0.19091 grey|0.19091 gray|0.17043 grey|0.17043 dark|0.16063 olive|0.16063 green|0.16063 silver|0.094779 light|0.076844 gray|0.076844 light|0.076844 grey|0.076844 gainsboro|0.061937 olive|0.025604 dim|0.025126 gray|0.025126 dim|0.025126 grey|0.025126 olive|0.019093 drab|0.019093 white|0.018685 smoke|0.018685 lavender|0.014632 lavender|0.014584 blush|0.014584 black|0.01363 ghost|0.012427 white|0.012427 alice|0.010991 blue|0.010991 snow|0.010655 sea|0.0095164 shell|0.0095164  "
		}
	}
}
