{
	"add": {
		"doc": {
			"id": "0f961f3b34b7ef028cb8bd61b27004d8f57c9efe50d7ade790da8c142bd2933c",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/2e/Museo_de_arte_puerto_rico.jpg/200px-Museo_de_arte_puerto_rico.jpg",
				"previous": "Places and monuments emphasized in tourism campaigns include: Old San Juan, promoting the historic nature of its colonial buildings and narrow streets covered by adoquine, a blue stone cast from furnace slag; they were brought over as ballast on Spanish ships.[55] This includes the city's ancient defensive wall and forts, most notably El Morro and the Castle of San Cristóbal.[55] On January 23, 1984 both of these edifices were catalogued as being part of humanity's cultural patrimony.[55] The restaurants and art galleries in the zone are visited by tourists.[55] The local universities are promoted as historic places, most notably the campus of University of Puerto Rico located in Río Piedras, which is the oldest university on the island being founded in 1903.",
				"after": "San Juan is the birthplace of artists and musicians, locally known as Sanjuaneros, who have significantly influenced Puerto Rican culture. During the 20th century, the musical aspect of the city was influenced by performers including Afro-Caribbean dancer and choreographer Sylvia del Villard and José Enrique Pedreira who became a composer of Puerto Rican Danzas. International musicians such as opera singer Justino Díaz and Grammy Award winners Ramón Ayala (Daddy Yankee) and Ricky Martin were born in the city. Other notable residents include writers Giannina Braschi and Tomas Blanco, award-winning actors Raúl Juliá and Benicio del Toro, and comedian José Miguel Agrelot. Rafael Cordero (1790–1868), was influential in the development of Puerto Rican education and has been once renowned[by whom?] as \" The Father of Public Education in Puerto Rico.\" The city is also the home of contemporary and classic art museums. The Puerto Rico Arts Museum owns the largest collection of contemporary art in Puerto Rico, housing over 1,100 permanent art pieces and displaying temporary exhibitions containing artwork from various locations through Latin America.[58]",
			"color": "steel|0.69127 blue|0.69127 tan|0.086191 burly|0.071582 wood|0.071582 navajo|0.028252 white|0.028252 wheat|0.025161 pale|0.024443 golden|0.024443 rod|0.024443 moccasin|0.020963 khaki|0.015467 dark|0.010463 khaki|0.010463 gray|0.0049283 grey|0.0049283  "
		}
	}
}
