{
	"add": {
		"doc": {
			"id": "0fb2c5cc6eee98e229fba5f4b720f2827eaf0f7b2ed4cb07d6acd0c9aa7ffa40",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Pakistan_International_Airlines_Boeing_777-300ER_%28AP-BHW%29_arrives_London_Heathrow_11Apr2015_arp.jpg/220px-Pakistan_International_Airlines_Boeing_777-300ER_%28AP-BHW%29_arrives_London_Heathrow_11Apr2015_arp.jpg",
				"previous": "In the 1990s, the airline launched the three green stripe livery to represent its support for sports. The airline supports the Pakistan International Airlines first-class cricket team that plays in the Quaid-i-Azam Trophy and Patron's Trophy. PIA sponsors the PIA football club, and the A1 Team Pakistan in the A1 Grand Prix open-wheel auto racing series when it was initially launched. The airline also promotes the Shandur Polo Gala, that takes place every year in the Chitral and Gilgit regions of northern Pakistan during the summer period.[45] PIA also has its own Sports Division since 1958 promoting sports within Pakistan such as cricket, hockey, football, squash, polo, tennis, bridge, chess, table tennis, cycling, and body building. PIA has its own Boy Scouts Association (PIA-BSA) working in partnership with Pakistan Boy Scouts Association. After the earthquake, PIA-BSA worked in partnership with other charity organisations to provide relief help.",
				"after": "PIA was one of the official sponsors of the \"Destination Pakistan 2007\" festivals. The official logo was added to a select number of aircraft during the year[46] In 2008, PIA teamed up with mobile phone provider, Ufone to provide air miles to passengers who used the mobile network. Standard Chartered Bank and PIA launched Credit Cards allowing passengers to earn air miles for use of their credit cards.[47] In 2009, PIA was the gold sponsor for Logistics Pakistan, an Exhibition and Conference poised to highlight the emerging opportunities for the Logistics sector in Pakistan. In 2009, PIA and Pakistan Remittance Initiative (PRI) formed a strategic alliance to promote world money transfers.[48]",
			"color": "light|0.52702 slate|0.52702 gray|0.52702 dark|0.088862 gray|0.088862 dark|0.088862 grey|0.088862 slate|0.058025 gray|0.058025 black|0.057784 silver|0.053785 dim|0.044974 gray|0.044974 dim|0.044974 grey|0.044974 light|0.035323 steel|0.035323 blue|0.035323 light|0.030646 gray|0.030646 light|0.030646 grey|0.030646 gray|0.028526 grey|0.028526 gainsboro|0.022848 dark|0.01149 slate|0.01149 gray|0.01149 white|0.0054868 smoke|0.0054868 lavender|0.0049516  "
		}
	}
}
