{
	"add": {
		"doc": {
			"id": "0fbca2ef6860db9cc1be5233b52b8a745711dd454ebd8db2479361f28a571858",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Bandera_03.jpg/300px-Bandera_03.jpg",
				"previous": "Despite American administration after the defeat of Spain in the Spanish–American War in 1898, the usage of Spanish continued in Philippine literature and press during the early years of American rule. Gradually, however, the American government began increasingly promoting the use of English, and it characterized Spanish as a negative influence of the past. Eventually, by the 1920s, English became the primary language of administration and education.[61] But despite a significant decrease in influence and speakers, Spanish remained an official language of the Philippines when it became independent in 1946, alongside English and Filipino, a standardized version of Tagalog.",
				"after": "Spanish was removed from official status in 1973 under the administration of Ferdinand Marcos, but regained its status as an official language two months later under Presidential Decree No. 155, dated 15 March 1973.[62] It remained an official language until 1987, with the ratification of the present constitution, in which it was re-designated as a voluntary and optional auxiliary language.[63] In 2010, President Gloria Macapagal-Arroyo encouraged the reintroduction of Spanish-language teaching in the Philippine education system.[64] But by 2012, the number of secondary schools at which the language was either a compulsory subject or an elective had become very limited.[65] Today, despite government promotions of Spanish, less than 0.5% of the population report being able to speak the language proficiently.[66] Estimates indicate that while around 3 million people can speak Spanish with varying degrees of competency, only around 439 thousand people can speak the language at a native level.[67] Aside from standard Spanish, a Spanish-based creole language—Chavacano—developed in the southern Philippines. The number of Chavacano-speakers was estimated at 1.2 million in 1996. However, it is not mutually intelligible with Spanish.[68] Speakers of the Zamboangueño variety of Chavacano were numbered about 360,000 in the 2000 census.[69] The local languages of the Philippines also retain some Spanish influence, with many words being derived from Mexican Spanish, owing to the control of the islands by Spain through Mexico City until 1821, and then directly from Madrid until 1898.[70][71]",
			"color": "firebrick|0.13244 thistle|0.067687 tomato|0.058108 navajo|0.047079 white|0.047079 lavender|0.046883 peru|0.042238 moccasin|0.037691 burly|0.036465 wood|0.036465 wheat|0.036404 pale|0.034343 golden|0.034343 rod|0.034343 dark|0.033013 red|0.033013 brown|0.031387 sandy|0.030927 brown|0.030927 saddle|0.029549 brown|0.029549 maroon|0.0281 sienna|0.026792  "
		}
	}
}
