{
	"add": {
		"doc": {
			"id": "0fcc4928ded83449ca9f6d419422bd836a2f60f0b6e423350eb20a437e0d18a1",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/a/aa/Petrus_Christus_Nativity_%28c._1460s%29_detail.jpg/360px-Petrus_Christus_Nativity_%28c._1460s%29_detail.jpg",
				"previous": "In the shed Mary and Joseph share an intensely private moment before the Annunciation to the shepherds of the Christ child's birth to the shepherds.[1] They are rendered in bright colors. Mary wears a long flowing blue robe, Joseph a green-lined red cape over a brown robe. He holds his hat in hand, and his pattens are respectfully removed, left lying on the ground.[7] They gaze reverently at the newborn figure of Jesus who lies on Mary's robe.[10] Mary's features have a softness and sweetness more characteristic of Christus's later paintings and remarkably similar to his Madonna of the Dry Tree, according to Maryan Ainsworth.[11] Kneeling in adoration to either side are four small angels.[7]",
				"after": "Animals are visible in stalls. Behind them is a crumbling wall with three low Romanesque windows.[12] Four shepherds in contemporary 15th-century clothing are chatting amiably, leaning against the wall, looking into the shed.[11] Two are positioned to the left and two to the right; in each pair one is dressed in red and an other in blue.[13] Behind the shed is a small hill where two shepherds herd sheep along a pathway,[14] and beyond is a Netherlandish town with two domed structures in its center, symbolizing Jerusalem and Christ's Passion.[2] The large domed building is based on the Holy Sepulcher in Jerusalem,[11] a replica of which the Adornes family built in Bruges in 1427, called the Jerusalem chapel.[15] A flock of geese is visible high in the sky through the roof's trusses.[16]",
			"color": "dim|0.38079 gray|0.38079 dim|0.38079 grey|0.38079 gray|0.19327 grey|0.19327 black|0.17669 dark|0.16075 olive|0.16075 green|0.16075 dark|0.034624 gray|0.034624 dark|0.034624 grey|0.034624 rosy|0.027846 brown|0.027846  "
		}
	}
}
