{
	"add": {
		"doc": {
			"id": "0fd66dc7d70c5b275e4c7a29ff82b39a78186391be336c2d675d483f0961687a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Ferdinand_Toennies_Bueste_Husum-Ausschnitt.jpg/170px-Ferdinand_Toennies_Bueste_Husum-Ausschnitt.jpg",
			"previous": [],
				"after": "The first college course entitled \"Sociology\" was taught in the United States at Yale in 1875 by William Graham Sumner.[53] In 1883 Lester F. Ward, the first president of the American Sociological Association, published Dynamic Sociology—Or Applied social science as based upon statical sociology and the less complex sciences and attacked the laissez-faire sociology of Herbert Spencer and Sumner.[29] Ward's 1200 page book was used as core material in many early American sociology courses. In 1890, the oldest continuing American course in the modern tradition began at the University of Kansas, lectured by Frank W. Blackmar.[54] The Department of Sociology at the University of Chicago was established in 1892 by Albion Small, who also published the first sociology textbook: An introduction to the study of society 1894.[55] George Herbert Mead and Charles Cooley, who had met at the University of Michigan in 1891 (along with John Dewey), would move to Chicago in 1894.[56] Their influence gave rise to social psychology and the symbolic interactionism of the modern Chicago School.[57] The American Journal of Sociology was founded in 1895, followed by the American Sociological Association (ASA) in 1905.[55] The sociological \"canon of classics\" with Durkheim and Max Weber at the top owes in part to Talcott Parsons, who is largely credited with introducing both to American audiences.[58] Parsons consolidated the sociological tradition and set the agenda for American sociology at the point of its fastest disciplinary growth. Sociology in the United States was less historically influenced by Marxism than its European counterpart, and to this day broadly remains more statistical in its approach.[59]",
			"color": "gray|0.27221 grey|0.27221 dark|0.21975 gray|0.21975 dark|0.21975 grey|0.21975 dim|0.15349 gray|0.15349 dim|0.15349 grey|0.15349 silver|0.14279 light|0.073835 gray|0.073835 light|0.073835 grey|0.073835 gainsboro|0.04524 black|0.025762 white|0.0075346 smoke|0.0075346 linen|0.0071864 sea|0.0054555 shell|0.0054555 dark|0.0047105 slate|0.0047105 gray|0.0047105 floral|0.0047024 white|0.0047024 snow|0.0046857  "
		}
	}
}
