{
	"add": {
		"doc": {
			"id": "0fd66223c2fa0a66239a2f33840f0a0e7f72e8c84772b53f98bc788b466362ed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/ILA_2008_PD_185.JPG/220px-ILA_2008_PD_185.JPG",
				"previous": "The unpressurized rotodome is 30 feet (9.1 m) in diameter, six feet (1.8 m) thick at the center, and is held 11 feet (3.4 m) above the fuselage by two struts.[2] It is tilted down at the front to reduce its air drag during take-offs, and while flying endurance speed (which is corrected electronically by both the radar and SSR antenna phase shifters). The dome uses both bleed air and cooling doors to remove the heat generated by electronic and mechanical equipment. The hydraulically rotated antenna system permits the Westinghouse Corporation's AN/APY-1 and AN/APY-2 passive electronically scanned array radar system[18] to provide surveillance from the Earth's surface up into the stratosphere, over land or water.",
				"after": "Other major subsystems in the E-3 Sentry are navigation, communications, and computers. Consoles display computer-processed data in graphic and tabular format on video screens. Console operators perform surveillance, identification, weapons control, battle management and communications functions.[2] The radar and computer subsystems on the E-3 can gather and present broad and detailed battlefield information. This includes position and tracking information on enemy aircraft and ships, and location and status of friendly aircraft and naval vessels. The information can be sent to major command and control centers in rear areas or aboard ships. In times of crisis, data can be forwarded to the National Command Authority in the U.S. via RC-135 or naval aircraft carrier task forces.[2]",
			"color": "silver|0.14496 light|0.13605 gray|0.13605 light|0.13605 grey|0.13605 gainsboro|0.10132 dark|0.073573 gray|0.073573 dark|0.073573 grey|0.073573 light|0.056941 steel|0.056941 blue|0.056941 linen|0.038218 sea|0.037104 shell|0.037104 floral|0.0364 white|0.0364 gray|0.035427 grey|0.035427 old|0.035256 lace|0.035256 white|0.034963 smoke|0.034963 snow|0.031668 black|0.030851 ivory|0.030542 mint|0.02903 cream|0.02903 white|0.024564 dim|0.023734 gray|0.023734 dim|0.023734 grey|0.023734 antique|0.016556 white|0.016556 lavender|0.013462 ghost|0.011395 white|0.011395 beige|0.010725 lavender|0.010316 blush|0.010316 honeydew|0.0087247 corn|0.0043946 silk|0.0043946  "
		}
	}
}
