{
	"add": {
		"doc": {
			"id": "0fec9ae994403ed4dba5373a4a93ed723b2a51f3432154efbe224a37ba8b27c6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Henry_Frederick_Prince_of_Wales_on_Horseback.jpg/220px-Henry_Frederick_Prince_of_Wales_on_Horseback.jpg",
				"previous": "James I's daughter Elizabeth was also a valuable marriage pawn. She too was offered to Savoy, as a bride for the Prince of Piedmont, the heir of Charles Emanuel. The exchange of portraits as part of royal marriage proposals was the practice of the day and provided regular work for the royal painters and their workshops. Prince Henry commissioned portraits from Peake to send them to the various foreign courts with which marriage negotiations were underway. The prince’s accounts show, for example, that the two portraits Peake painted of him in arms in 1611–12 were \"sent beyond the seas\".[45]",
				"after": "A surviving portrait from this time shows the prince in armour, mounted on a white horse and pulling the winged figure of Father Time by the forelock.[46] Art historian John Sheeran suggests this is a classical allusion that signifies opportunity.[38] The old man carries Henry's lance and plumed helmet; and scholar Chris Caple points out that his pose is similar to that of Albrecht Dürer's figure of death in Knight, Death and the Devil (1513).[47] He also observes that the old man was painted later than other components of the painting, since the bricks of the wall show through his wings. When the painting was restored in 1985, the wall and the figure of time were revealed to modern eyes for the first time, having been painted over at some point in the seventeenth century by other hands than Peake's. The painting has also been cut down, the only original canvas edge being that on the left.[48]",
			"color": "dark|0.21668 gray|0.21668 dark|0.21668 grey|0.21668 gray|0.18418 grey|0.18418 dim|0.16437 gray|0.16437 dim|0.16437 grey|0.16437 black|0.10851 silver|0.073256 misty|0.06159 rose|0.06159 thistle|0.033667 rosy|0.033318 brown|0.033318 light|0.031085 gray|0.031085 light|0.031085 grey|0.031085 gainsboro|0.015227 light|0.01489 slate|0.01489 gray|0.01489  "
		}
	}
}
