{
	"add": {
		"doc": {
			"id": "1002f0c54a129c0ca5b1a74ba5cc0f6a6027d83e453478f823389d006340516c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/MP-panthera_leo_krugeri_8.jpg/220px-MP-panthera_leo_krugeri_8.jpg",
				"previous": "Lions are part of a group of exotic animals that are the core of zoo exhibits since the late eighteenth century; members of this group are invariably large vertebrates and include elephants, rhinoceroses, hippopotamuses, large primates, and other big cats; zoos sought to gather as many of these species as possible.[163] Although many modern zoos are more selective about their exhibits,[164] there are more than 1,000 African and 100 Asiatic lions in zoos and wildlife parks around the world. They are considered an ambassador species and are kept for tourism, education and conservation purposes.[165] Lions can reach an age of over 20 years in captivity; Apollo, a resident lion of Honolulu Zoo in Honolulu, Hawaii, died at age 22 in August 2007. His two sisters, born in 1986, were still alive in August 2007.[166] Breeding programs need to note origins to avoid breeding different subspecies and thus reducing conservation value.[167] However, several Asiatic-African lion crosses have been bred.[168]",
				"after": "At the ancient Egyptian cities of Taremu and Per-Bast were temples to the lioness goddesses of Egypt, Sekhmet and Bast and at Taremu there was a temple to the son of the deity, Maahes the lion prince, where live lions were kept and allowed to roam within his temple. The Greeks called the city Leontopolis, the \"City of Lions\" and documented that practice. Lions were kept and bred by Assyrian kings as early as 850 BC,[147] and Alexander the Great was said to have been presented with tame lions by the Malhi of northern India.[169] Later in Roman times, lions were kept by emperors to take part in the gladiator arenas or for executions (see bestiarii, damnatio ad bestias, and venatio). Roman notables, including Sulla, Pompey, and Julius Caesar, often ordered the mass slaughter of hundreds of lions at a time.[170] In the East, lions were tamed by Indian princes, and Marco Polo reported that Kublai Khan kept lions inside.[171] The first European \"zoos\" spread among noble and royal families in the thirteenth century, and until the seventeenth century were called seraglios; at that time, they came to be called menageries, an extension of the cabinet of curiosities. They spread from France and Italy during the Renaissance to the rest of Europe.[172] In England, although the seraglio tradition was less developed, Lions were kept at the Tower of London in a seraglio established by King John in the thirteenth century,[173][174] probably stocked with animals from an earlier menagerie started in 1125 by Henry I at his hunting lodge in Woodstock, near Oxford; where lions had reportedly been stocked by William of Malmesbury.[175]",
			"color": "dark|0.15203 khaki|0.15203 gray|0.15112 grey|0.15112 dim|0.149 gray|0.149 dim|0.149 grey|0.149 dark|0.12104 gray|0.12104 dark|0.12104 grey|0.12104  "
		}
	}
}
