{
	"add": {
		"doc": {
			"id": "1014cab5630fb4a1810b6de648afe37b2c84ebbd8fa77f5dd85f89a8c9c5472a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/DetourPoster1.jpg/250px-DetourPoster1.jpg",
				"previous": "As noted above, however, most of the Hollywood films now considered classic noirs fall into the broad category of the \"B movie\".[63] Some were Bs in the most precise sense, produced to run on the bottom of double bills by a low-budget unit of one of the major studios or by one of the smaller, so-called Poverty Row outfits, from the relatively well-off Monogram to shakier ventures such as Producers Releasing Corporation (PRC). Jacques Tourneur had made over thirty Hollywood Bs (a few now highly regarded, most completely forgotten) before directing the A-level Out of the Past, described by scholar Robert Ottoson as \"the ne plus ultra of forties film noir\".[64] Movies with budgets a step up the ladder, known as \"intermediates\" within the industry, might be treated as A or B pictures depending on the circumstance—Monogram created a new unit, Allied Artists, in the late 1940s to focus on this sort of production. Such films have long colloquially been referred to as B movies. Robert Wise (Born to Kill [1947], The Set-Up [1949]) and Anthony Mann (T-Men [1947], Raw Deal [1948]) each made a series of impressive intermediates, many of them noirs, before graduating to steady work on big-budget productions. Mann did some of his most celebrated work with cinematographer John Alton, a specialist in what critic James Naremore describes as \"hypnotic moments of light-in-darkness\".[65] He Walked by Night (1948), shot by Alton and, though credited solely to Alfred Werker, directed in large part by Mann, demonstrates their technical mastery and exemplifies the late 1940s trend of \"police procedural\" crime dramas. Put out, like other Mann–Alton noirs, by the small Eagle-Lion company, it was the direct inspiration for the Dragnet series, which debuted on radio in 1949 and television in 1951.[66]",
				"after": "Several directors associated with noir built now well-respected oeuvres largely at the B-movie/intermediate level. Samuel Fuller's brutal, visually energetic films such as Pickup on South Street (1953) and Underworld U.S.A. (1961) earned him a unique reputation; his advocates praise him as \"primitive\"[68] and \"barbarous\".[69] Joseph H. Lewis directed noirs as diverse as Gun Crazy (1950) and The Big Combo (1955). The former—whose screenplay was written by the blacklisted Dalton Trumbo, disguised by a front—features a bank holdup sequence shown in an unbroken take over three minutes long that proved widely influential.[70] The latter, shot by John Alton, takes the shadow-rich noir style to its outer limits.[71] The most distinctive films of Phil Karlson (The Phenix City Story [1955], The Brothers Rico [1957]) tell stories of vice organized on a monstrous scale.[72] The work of other directors who worked largely at this tier of the industry, such as Felix E. Feist (The Devil Thumbs a Ride [1947], Tomorrow Is Another Day [1951]), is now relatively obscure. Edgar G. Ulmer spent almost his entire Hollywood career working at B studios—once in a while on projects that achieved intermediate status; for the most part, on unmistakable Bs. In 1945, while at PRC, he directed one of the all-time noir cult classics, Detour.[73] Ulmer's other noirs include Strange Illusion (1945), also for PRC; Ruthless (1948), for Eagle-Lion, which had acquired PRC the previous year; and Murder Is My Beat (1955), for Allied Artists.",
			"color": "black|0.20759 khaki|0.15657 dark|0.064946 salmon|0.064946 sandy|0.04742 brown|0.04742 dim|0.041047 gray|0.041047 dim|0.041047 grey|0.041047 dark|0.036287 khaki|0.036287 pale|0.032795 golden|0.032795 rod|0.032795 sienna|0.027069 gray|0.024364 grey|0.024364 burly|0.022764 wood|0.022764 peach|0.021024 puff|0.021024 rosy|0.019669 brown|0.019669 tan|0.017256 light|0.015644 salmon|0.015644 dark|0.014162 gray|0.014162 dark|0.014162 grey|0.014162  "
		}
	}
}
