{
	"add": {
		"doc": {
			"id": "101539fe78541ce0abf3f62c05e49271a9c25ae50b2a5e788c005edae64b2711",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/%E0%AE%95%E0%AF%8A%E0%AE%B3%E0%AE%95%E0%AF%8D%E0%AE%95%E0%AE%B0%E0%AE%B5%E0%AE%BE%E0%AE%9F%E0%AE%BF_%E0%AE%A8%E0%AE%9F%E0%AF%81%E0%AE%95%E0%AE%B2%E0%AF%8D.JPG/200px-%E0%AE%95%E0%AF%8A%E0%AE%B3%E0%AE%95%E0%AF%8D%E0%AE%95%E0%AE%B0%E0%AE%B5%E0%AE%BE%E0%AE%9F%E0%AE%BF_%E0%AE%A8%E0%AE%9F%E0%AF%81%E0%AE%95%E0%AE%B2%E0%AF%8D.JPG",
			"previous": [],
				"after": "Various martial arts including Kuttu Varisai, Varma Kalai, Silambam, Adithada, Malyutham and Kalarippayattu, are practised in Tamil Nadu and Kerala.[142] The warm-up phase includes yoga, meditation and breathing exercises. Silambam originated in ancient Tamilakam and was patronized by the Pandyans, Cholas and Cheras, who ruled over this region. Silapathiharam a Tamil literature from 2nd century AD, refers to the sale of Silamabam instructions, weapons and equipment to foreign traders.[143] Since the early Sangam age, there was a warlike culture in South India. War was regarded as an honorable sacrifice and fallen heroes and kings were worshiped in the form of a Hero stone. Each warrior was trained in martial arts, horse riding and specialized in two of the weapons of that period Vel (spear) Val (sword) and Vil (bow).[144] Heroic martyrdom was glorified in ancient Tamil literature. The Tamil kings and warriors followed an honour code similar to that of Japanese Samurais and committed suicide to save the honor. The forms of martial suicide were known as Avipalli, Thannai, Verttal, Marakkanchi, Vatakkiruttal and Punkilithu Mudiyum Maram. Avipalli was mentioned in all the works except Veera Soliyam. It was a self-sacrifice of a warrior to the goddess of war for the victory of his commander.[145] The Tamil rebels in Sri Lanka reflected some elements of Tamil martial traditions which included worship of fallen heroes (Maaveerar Naal) and practice of martial suicide. They carried a Suicide pill around their neck to escape the captivity and torture.[146] A remarkable feature besides to their willingness to sacrifice is, that they were well organized and disciplined. It was forbidden for the rebels to consume tobaccos, alcohols, drugs and to have sexual relationship.[147]",
			"color": "dim|0.24101 gray|0.24101 dim|0.24101 grey|0.24101 dark|0.23384 gray|0.23384 dark|0.23384 grey|0.23384 gray|0.2013 grey|0.2013 silver|0.080478 black|0.069749 slate|0.062291 gray|0.062291 light|0.05605 slate|0.05605 gray|0.05605 light|0.022776 gray|0.022776 light|0.022776 grey|0.022776 gainsboro|0.0084009 tan|0.0063389 light|0.0054742 steel|0.0054742 blue|0.0054742  "
		}
	}
}
