{
	"add": {
		"doc": {
			"id": "1016fd599c92f22c10516aff78cc7a3cadf47ed2ac216ee3ceb37a8bec5582b1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Timbaland1292010.png/180px-Timbaland1292010.png",
			"previous": [],
				"after": "The 20/20 Experience was produced in a span of 20 days.[8] Recording sessions for The 20/20 Experience began in the \"late part of May, first week in June\" and concluded in July 2012.[9] The album was recorded at EastWest Studios in Los Angeles, Jungle City Studios in New York City and Larrabee Studios in North Hollywood.[10] Of Timbaland's participation, Wright said: \"(Their) relationship is like a brotherhood; they're just so comfortable with each other – not only as musical friends but as personal friends... that you can get things done in a short period of time. Had (the Affleck movie) not happened, we might have actually set up and put the album out sooner.\"[9] After recording was finished, Timberlake and Wright, with M2M Construction, begin \"formulating plans for how to release the music\".[9] Justin Timberlake, and most of the band used JH Audio in-ear monitoring systems. [11] With regards to the album's lead single \"Suit & Tie\", Timberlake shared with 97.1 AMP Radio/Los Angeles how the classic, \"Get out your seat, Hov\" lyric was born inside the studio with JAY-Z: \"I had finished the verses and I was going in to record them and he was sitting in the room working, freestyling to himself. And then he came up with a line he really liked and he jumped out of his seat and he said, 'Uh oh! Get out of that seat, Hov.' And I just thought it was so funny. It made me laugh. I was standing right beside him when he did it and so I just put it on the record, more or less as a joke to him.\" Timberlake added that the song harkens back to the glory years of the Rat Pack. \"Not to compare ourselves to those guys, but just the fun that they had,\" he said. \"I was picturing like, being at the Sands in Vegas and saying, 'Oh, JAY-Z's in the house tonight. Uh, let's have him come up and do a number. Why don't you go ahead and get out of your seat, Hov?' That's more or less where it came from.\"[12][13][14]",
			"color": "black|0.48306 dim|0.13661 gray|0.13661 dim|0.13661 grey|0.13661 sienna|0.11428 slate|0.072222 gray|0.072222 dark|0.043503 salmon|0.043503 gray|0.036127 grey|0.036127 dark|0.027225 gray|0.027225 dark|0.027225 grey|0.027225 light|0.02172 slate|0.02172 gray|0.02172 silver|0.014265  "
		}
	}
}
