{
	"add": {
		"doc": {
			"id": "1018591379e6d45e749e7e925a9f13acc840bd37af78af0f137dfbcc44b7fcdc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Domical_bay_ceiling_in_Kaitabhesvara_temple_at_Kubatur.JPG/220px-Domical_bay_ceiling_in_Kaitabhesvara_temple_at_Kubatur.JPG",
				"previous": "The other type is the square plan with simple projections and recesses but with a possibility of both sekhari and bhumija superstructures. The plan does not have any additional elements save those that derive from the ground plan. The recesses are simple and have just one large wall image. The important characteristic of these nagara temples in the Kalyani region is that they not only differ from the dravida temples in the north Karnataka region but from the nagara temples north of the Kalyani region as well. These differences are manifest in the articulation and in the shapes and ornamentation of individual architectural components, giving them a unique place in Chalukyan architecture. Temples that fall in this category are the Mahadeva Temple at Jalsingi and the Suryanarayana Temple at Kalgi in the modern-day Gulbarga district.[48] The plan and the nagara articulation of these temples are the same as found to the north of the Kalyani region, but the details are different, producing a different look.[12]",
				"after": "The Western Chalukya decorative inventiveness focused on the pillars, door panels, lintels (torana), domical roofs in bays,[49] outer wall decorations such as Kirtimukha (gargoyle faces common in Western Chalukya decoration),[50][51] and miniature towers on pilasters.[30] Although the art form of these artisans does not have any distinguishing features from a distance, a closer examination reveals their taste for decoration. An exuberance of carvings, bands of scroll work, figural bas-reliefs and panel sculptures are all closely packed.[52] The doorways are highly ornamented but have an architectural framework consisting of pilasters, a moulded lintel and a cornice top. The sanctum receives diffused light through pierced window screens flanking the doorway; these features were inherited and modified by the Hoysala builders.[29] The outer wall decorations are well rendered. The Chalukyan artisans extended the surface of the wall by means of pilasters and half pilasters. Miniature decorative towers of multiple types are supported by these pilasters. These towers are of the dravida tiered type, and in the nagara style they were made in the latina (mono aedicule) and its variants; the bhumija and sekhari.[53]",
			"color": "dim|0.45476 gray|0.45476 dim|0.45476 grey|0.45476 gray|0.26686 grey|0.26686 black|0.1788 dark|0.054986 gray|0.054986 dark|0.054986 grey|0.054986 silver|0.015374  "
		}
	}
}
