{
	"add": {
		"doc": {
			"id": "104683dbc5c93c21dbeb5bd008d490047360d6ec43285425273ba2d04b593055",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/King_County_Water_Taxi_Downtown_Seattle.jpg/220px-King_County_Water_Taxi_Downtown_Seattle.jpg",
				"previous": "The first streetcars appeared in 1889 and were instrumental in the creation of a relatively well-defined downtown and strong neighborhoods at the end of their lines. The advent of the automobile sounded the death knell for rail in Seattle. Tacoma–Seattle railway service ended in 1929 and the Everett–Seattle service came to an end in 1939, replaced by inexpensive automobiles running on the recently developed highway system. Rails on city streets were paved over or removed, and the opening of the Seattle trolleybus system brought the end of streetcars in Seattle in 1941. This left an extensive network of privately owned buses (later public) as the only mass transit within the city and throughout the region.[226]",
				"after": "King County Metro provides frequent stop bus service within the city and surrounding county, as well as a South Lake Union Streetcar line between the South Lake Union neighborhood and Westlake Center in downtown.[227] Seattle is one of the few cities in North America whose bus fleet includes electric trolleybuses. Sound Transit currently provides an express bus service within the metropolitan area; two Sounder commuter rail lines between the suburbs and downtown; its Central Link light rail line, which opened in 2009, between downtown and Sea-Tac Airport gives the city its first rapid transit line that has intermediate stops within the city limits. Washington State Ferries, which manages the largest network of ferries in the United States and third largest in the world, connects Seattle to Bainbridge and Vashon Islands in Puget Sound and to Bremerton and Southworth on the Kitsap Peninsula.[228]",
			"color": "steel|0.2217 blue|0.2217 light|0.15814 steel|0.15814 blue|0.15814 dark|0.094851 gray|0.094851 dark|0.094851 grey|0.094851 black|0.079945 gray|0.074047 grey|0.074047 dim|0.069287 gray|0.069287 dim|0.069287 grey|0.069287 silver|0.055306 light|0.035304 gray|0.035304 light|0.035304 grey|0.035304 gainsboro|0.025234 light|0.023797 slate|0.023797 gray|0.023797 slate|0.02322 gray|0.02322 dark|0.019458 slate|0.019458 gray|0.019458 white|0.011229 smoke|0.011229 lavender|0.010155 sea|0.0089474 shell|0.0089474 snow|0.008825 ghost|0.0085113 white|0.0085113 alice|0.0082554 blue|0.0082554 white|0.0078612 floral|0.0077702 white|0.0077702 mint|0.0074856 cream|0.0074856 azure|0.0065115 linen|0.0061548 lavender|0.0058105 blush|0.0058105  "
		}
	}
}
