{
	"add": {
		"doc": {
			"id": "104f13064cc3f0a44c7c31b43285c7796a7da02d50e36828f56841fa5723ba08",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Vasaskultpurrepliker.jpg/220px-Vasaskultpurrepliker.jpg",
				"previous": "Residues of paint have been found on many sculptures and on other parts of the ship. The entire ornamentation was once painted in vivid colors. The sides of the beakhead (the protruding structure below the bowsprit), the bulwarks (the protective railing around the weather deck), the roofs of the quarter galleries, and the background of the transom (the flat surface at the stern of the ship) were all painted red, while the sculptures were decorated in bright colors, and the dazzling effect of these was in some places emphasized with gold leaf. Previously, it was believed that the background color had been blue and that all sculptures had been almost entirely gilded, and this is reflected in many paintings of Vasa from the 1970s to the early '90s, such as the lively and dramatic drawings of Björn Landström or the painting by Francis Smitheman.[20] In the late 1990s, this view was revised and the colors are properly reflected in more recent reproductions of the ship's decoration by maritime painter Tim Thompson and the 1:10 scale model in the museum. Vasa is an example not so much of the heavily gilded sculptures of early Baroque art but rather \"the last gasps of the medieval sculpture tradition\" with its fondness for gaudy colors, in a style that today would be considered extravagant or even vulgar.[5]",
				"after": "The sculptures are carved out of oak, pine or linden, and many of the larger pieces, like the huge 3-meter (10 ft) long figurehead lion, consist of several parts carved individually and fitted together with bolts. Close to 500 sculptures, most of which are concentrated on the high stern and its galleries and on the beakhead, are found on the ship.[21] The figure of Hercules appears as a pair of pendants, one younger and one older, on each side of the lower stern galleries; the pendants depict opposite aspects of the ancient hero, who was extremely popular during antiquity as well as in 17th-century European art. On the transom are biblical and nationalistic symbols and images. A particularly popular motif is the lion, which can be found as the mascarons originally fitted on the insides of the gunport doors, grasping the royal coat of arms on either side, the figurehead, and even clinging to the top of the rudder. Each side of the beakhead originally had 20 figures (though only 19 have actually been found) that depicted Roman emperors from Tiberius to Septimius Severus. Overall, almost all heroic and positive imagery is directly or indirectly identified with the king and was originally intended to glorify him as a wise and powerful ruler. The only actual portrait of the king, however, is located at the very top of the transom in the stern. Here he is depicted as a young boy with long, flowing hair, being crowned by two griffins representing the king's father, Charles IX.[22]",
			"color": "black|0.52751 dim|0.18073 gray|0.18073 dim|0.18073 grey|0.18073 gray|0.098123 grey|0.098123 dark|0.041089 gray|0.041089 dark|0.041089 grey|0.041089 rosy|0.020217 brown|0.020217 tan|0.014295 silver|0.011314 dark|0.010472 khaki|0.010472 khaki|0.0092307  "
		}
	}
}
