{
	"add": {
		"doc": {
			"id": "10509f1791f8429e1e90823261c0b2f612ef65d9b2ba8b1a765fc4b3ac18a8f2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Giotto_-_Sankt_Franciskus_stigmatisering.jpg/320px-Giotto_-_Sankt_Franciskus_stigmatisering.jpg",
				"previous": "The Franciscan Order had a strong following by the 15th century; its Third Order of Saint Francis attracted women and men to local lay confraternities, such as the Confraternity of the Dry Tree in Bruges to which Anselme Adornes belonged.[36] St Francis was closely associated with pilgrimages, then popular and most often taken to holy sites in Spain and Jerusalem. He was revered for his own pilgrimage to the Holy Land in 1219; by the 15th century the Franciscans were responsible for maintaining the holy sites in Jerusalem, particularly the Church of the Holy Sepulchre.[37]",
				"after": "St Francis lived austerely, in imitation of Christ. He embraced the natural world, and took vows of poverty, charity and chastity. In 1224 at La Verna, he experienced the mystical vision which van Eyck portrays.[36] Thomas of Celano, author of Francis's hagiography, describes the vision and stigmatization: \"Francis had a vision in which he saw a man like a seraph: he had six wings and was standing above him with his hands outstretched and his feet bound together, and was fixed to a cross. Two wings were lifted above his head, and two were spread ready for flight, and two covered his whole body. When Francis saw this he was utterly amazed. He could not fathom what this vision might mean.\"[38] As he meditated, \"marks of nails began to appear on his hands and feet ... His hands and feet seemed to be pierced by nails appearing on the inside of his hands and the upper side of his feet ….His right side was scarred as if it had been pierced by a spear, and it often seeped blood.\"[39] To the medieval observer, the appearance of the stigmata signifies Francis's complete absorption in the vision of the seraph.[40]",
			"color": "tan|0.55149 burly|0.13518 wood|0.13518 gray|0.076616 grey|0.076616 peach|0.048916 puff|0.048916 dim|0.040686 gray|0.040686 dim|0.040686 grey|0.040686 wheat|0.030842 bisque|0.02417 black|0.015371 dark|0.014699 gray|0.014699 dark|0.014699 grey|0.014699 rosy|0.013738 brown|0.013738  "
		}
	}
}
