{
	"add": {
		"doc": {
			"id": "10553dad991e2d2002f645ec973bc9003f756afe271871202f56bb92f09c34b1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Little_Moreton_Hall_parlour.jpg/220px-Little_Moreton_Hall_parlour.jpg",
				"previous": "The Great Hall at the centre of the north range is entered through a porch and screens passage, a feature common in houses of the period, designed to protect the occupants from draughts. As the screens are now missing, they may have been free-standing like those at Rufford Old Hall.[45] The porch is decorated with elaborate carvings.[16] The Great Hall's roof is supported by arch-braced trusses,[15] which are decorated with carved motifs including dragons.[46] The floor, now flagged, would probably originally have been rush-covered earth, with a central hearth. The gabled bay window overlooking the courtyard was added in 1559. The original service wing to the west of the Great Hall, behind the screens passage, was rebuilt in 1546,[15] and housed a kitchen, buttery and pantry.[41] A hidden shaft was discovered during a 19th-century investigation of two secret rooms above the kitchen, connecting them to a tunnel leading to the moat, the entrance to which has since been filled in.[47] The west range now houses the gift shop and restaurant.",
				"after": "A doorway behind where the family would have sat at the far end of the hall leads to the Parlour, known as the Little Parlour in surviving 17th-century documents. Together with the adjoining Withdrawing Room and the Great Hall, the Parlour is structurally part of the original building.[48] The wooden panelling is a Georgian addition, behind which the original painted panelling was discovered in 1976.[49] The decoration consists of painted imitations of marble and inlay,[16] and Biblical scenes, some of which were painted directly onto the plaster and others on paper that was then pasted to the wall. \"Crudely drawn\" but nevertheless \"elaborate\", the paintings tell the story of Susanna and the Elders from the Apocrypha,[49] a \"favourite Protestant theme\".[4] The Moreton family's wolf head crest and the initials \"J.M.\" suggest a date before John Moreton's death in 1598. Similar painted decoration is found in other Cheshire houses of the late 16th and early 17th centuries.[16]",
			"color": "black|0.16248 dark|0.11538 gray|0.11538 dark|0.11538 grey|0.11538 dim|0.11073 gray|0.11073 dim|0.11073 grey|0.11073 gray|0.10339 grey|0.10339 silver|0.08496 tan|0.050647 light|0.040631 slate|0.040631 gray|0.040631 slate|0.039752 gray|0.039752 dark|0.036576 khaki|0.036576 light|0.033257 gray|0.033257 light|0.033257 grey|0.033257 dark|0.02487 golden|0.02487 rod|0.02487 golden|0.023429 rod|0.023429 burly|0.020332 wood|0.020332 light|0.018564 steel|0.018564 blue|0.018564 gainsboro|0.016259  "
		}
	}
}
