{
	"add": {
		"doc": {
			"id": "105c12c2d7c4032e44557a06020462699ad79dc72fb741bdaddf3a36dd34e8ec",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Buckingham_Palace_-_Wappen_am_Gittertor.jpg/220px-Buckingham_Palace_-_Wappen_am_Gittertor.jpg",
				"previous": "The palace, like Windsor Castle, is owned by the British state. It is not the monarch's personal property, unlike Sandringham House and Balmoral Castle.[86] Many of the contents from Buckingham Palace, Windsor Castle, Kensington Palace and St. James's Palace are known collectively as the Royal Collection; owned by the Sovereign, they can, on occasions, be viewed by the public at the Queen's Gallery, near the Royal Mews. Unlike the palace and the castle, the gallery is open continually and displays a changing selection of items from the collection. The rooms containing the Queen's Gallery are on the site of the former chapel, which was damaged by one of the seven bombs to fall on the palace during World War II. The palace's state rooms have been open to the public during August and September since 1993. The money raised in entry fees was originally put towards the rebuilding of Windsor Castle following the 1992 fire which destroyed many of its state rooms.",
				"after": "In May 2009, in response to a request from the Queen to the government for money to carry out a backlog of repairs to the palace, a group of MPs on the Public Accounts Committee proposed that in return for the extra £4 million in annual funds requested, the palace be open to the public more than the 60 days it is now, as well as when members of the royal family are in residence.[87] The British Government currently provides £15 million yearly for the palace's upkeep.",
			"color": "black|0.35748 dim|0.13441 gray|0.13441 dim|0.13441 grey|0.13441 gray|0.10709 grey|0.10709 dark|0.061228 slate|0.061228 gray|0.061228 dark|0.06013 gray|0.06013 dark|0.06013 grey|0.06013 tan|0.04572 slate|0.032479 gray|0.032479 light|0.02313 slate|0.02313 gray|0.02313 burly|0.02303 wood|0.02303 silver|0.020087 saddle|0.016575 brown|0.016575 light|0.0099961 gray|0.0099961 light|0.0099961 grey|0.0099961 gainsboro|0.0068403 sienna|0.0067503  "
		}
	}
}
