{
	"add": {
		"doc": {
			"id": "107db8b1337b848c6be70f4499b16ec58a29808a51d9546a8d010f9a62ae1141",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Copenhagen_dodo.jpg/220px-Copenhagen_dodo.jpg",
				"previous": "The only known soft tissue remains, the Oxford head (specimen OUM 11605) and foot, belonged to the last known stuffed dodo, which was first mentioned as part of the Tradescant collection in 1656 and was moved to the Ashmolean Museum in 1659. It has been suggested that this might be the remains of the bird that Hamon L'Estrange saw in London.[2] Many sources state that the museum burned the stuffed dodo around 1755 because of severe decay, saving only the head and leg. Statute 8 of the museum states \"That as any particular grows old and perishing the keeper may remove it into one of the closets or other repository; and some other to be substituted.\"[100] The deliberate destruction of the specimen is now believed to be a myth; it was removed from exhibition to preserve what remained of it. This remaining soft tissue has since degraded further; the head was dissected by Strickland and Melville, separating the skin from the skull in two halves. The foot is in a skeletal state, with only scraps of skin and tendons. Very few feathers remain on the head. It is probably a female, as the foot is 11% smaller and more gracile than that of the London specimen, yet appears to be fully grown.[101]",
				"after": "The dried London foot, first mentioned in 1665, and transferred to the British Museum in the 18th century, was displayed next to Savery's Edwards's Dodo painting until the 1840s, and it too was dissected by Strickland and Melville. It was not posed in a standing posture, which suggests that it was severed from a fresh specimen, not a mounted one. By 1896 it was mentioned as being without its integuments, and only the bones are believed to remain today, though its present whereabouts are unknown.[2]",
			"color": "antique|0.091979 white|0.091979 blanched|0.079592 almond|0.079592 papaya|0.076475 whip|0.076475 wheat|0.074002 beige|0.067047 corn|0.061038 silk|0.061038 bisque|0.053839 tan|0.048204 light|0.044408 yellow|0.044408 light|0.042832 golden|0.042832 rod|0.042832 yellow|0.042832 old|0.040916 lace|0.040916 lemon|0.029758 chiffon|0.029758 ivory|0.025949 linen|0.024342 black|0.02186 moccasin|0.01963 pink|0.019472 floral|0.018233 white|0.018233 light|0.015889 pink|0.015889 dim|0.014507 gray|0.014507 dim|0.014507 grey|0.014507 gray|0.013542 grey|0.013542 dark|0.011684 gray|0.011684 dark|0.011684 grey|0.011684 navajo|0.011133 white|0.011133 pale|0.010641 golden|0.010641 rod|0.010641 honeydew|0.010274 silver|0.01017 peach|0.0093284 puff|0.0093284 light|0.0087026 gray|0.0087026 light|0.0087026 grey|0.0087026 sea|0.0085494 shell|0.0085494  "
		}
	}
}
