{
	"add": {
		"doc": {
			"id": "10955c213ab45686de4fef8156d0c03a8dbaf4e085236a5dc82da0d4ad6c9c21",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/US_Navy_030617-N-4374S-016_A_German_fighter_jet_Panavia_Tornado_GR.Mk_1%2C_flies_over_the_Aegis_class%2C_guided_missile_cruiser_USS_Vella_Gulf_%28CG_72%29_during_the_annual_maritime_exercise_Baltic_Operations_2003_%28BALTOPS%29.jpg/220px-thumbnail.jpg",
				"previous": "The Panavia Tornado is a multirole, twin-engined aircraft designed to excel at low-level penetration of enemy defences. The mission envisaged during the Cold War was the delivery of conventional and nuclear ordnance on the invading forces of the Warsaw Pact countries of Eastern Europe; this dictated several significant features of the design. Variable wing geometry, allowing for minimal drag during the critical low-level dash towards a well-prepared enemy, had been desired from the project's start. Advanced navigation and flight computers, including the then-innovative fly-by-wire system, greatly reduced the workload of the pilot during low-level flight and eased control of the aircraft.[44][45] For long range bombing missions, the Tornado has a retractable refuelling probe.[46]",
				"after": "As a multirole aircraft, the Tornado is capable of undertaking more mission profiles than the anticipated strike mission; various operators replaced multiple aircraft types with the Tornado as a common type – the use of dedicated single role aircraft for specialist purposes such as battlefield reconnaissance, maritime patrol duties, or dedicated electronic countermeasures (ECM) were phased out – either by standard Tornados or modified variants, such as the Tornado ECR. The most extensive modification from the base Tornado design was the Tornado ADV, which was stretched and armed with long range anti-aircraft missiles to serve in the interceptor role.[47]",
			"color": "black|0.1226 white|0.079384 smoke|0.079384 snow|0.078629 ghost|0.078626 white|0.078626 white|0.078478 sea|0.07844 shell|0.07844 alice|0.078356 blue|0.078356 mint|0.07831 cream|0.07831 floral|0.078019 white|0.078019 azure|0.077966 lavender|0.059499 blush|0.059499 dim|0.028823 gray|0.028823 dim|0.028823 grey|0.028823 gray|0.01812 grey|0.01812 dark|0.016536 gray|0.016536 dark|0.016536 grey|0.016536 silver|0.010443 ivory|0.0093177 linen|0.0086837 light|0.0073563 gray|0.0073563 light|0.0073563 grey|0.0073563 gainsboro|0.0061038  "
		}
	}
}
