{
	"add": {
		"doc": {
			"id": "10a9bad3e7b2c2c19c7dbaf691b797d23b2d8677d81ca1e571aeee3eb3f4e7b1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Public_Security_Police_officers_China.jpg/220px-Public_Security_Police_officers_China.jpg",
				"previous": "Another explanation often advanced is the idea that police officers will undergo some traumatic experience in their police work that they never recover from, leading to suicide, divorce, etc. However, since the effects of such traumatic stresses is readily recognized, there are usually proactive programs in place to help individual police officers deal with the psychological effects of a traumatic event. Unfortunately, there is some evidence that such programs are actually ineffective, especially group therapies, may re-traumatize the participant, weaken coping mechanisms, and contribute to the development of post traumatic stress disorder (PTSD).[20][21][22]",
				"after": "Observations where police officers and other emergency workers, such as firemen, experience the same traumatic event, it is more likely that the police officer will have difficulty dealing with the long term emotional effects of the traumatic event. On this observation, some of the academic literature suggests that along these lines the causes of occupational stress is more complex for police officers. Stress in police work is often present in other occupations, but not in an ongoing capacity. One line of thinking is that the individual stresses of police work produce a condition of chronic stress. Police officers encounter stressors in call after call which sap their emotional strength. Debilitation from this daily stress accumulates making officers more vulnerable to traumatic incidents and normal pressures of life. The weakening process is often too slow to see; neither a person nor his friends are aware of the damage being done. The effects of chronic stresses is two-fold:",
			"color": "black|0.20714 indian|0.098157 red|0.098157 light|0.075622 coral|0.075622 tan|0.050469 gray|0.049651 grey|0.049651 burly|0.047833 wood|0.047833 dark|0.041675 salmon|0.041675 dim|0.038048 gray|0.038048 dim|0.038048 grey|0.038048 dark|0.034523 gray|0.034523 dark|0.034523 grey|0.034523 brown|0.028074 peach|0.026981 puff|0.026981 silver|0.017945 firebrick|0.017388 salmon|0.016326 crimson|0.01582 rosy|0.012861 brown|0.012861 light|0.012333 gray|0.012333 light|0.012333 grey|0.012333 white|0.011013 smoke|0.011013 navajo|0.010526 white|0.010526 gainsboro|0.010161 snow|0.0099247 misty|0.0095383 rose|0.0095383 sea|0.0092693 shell|0.0092693 white|0.0088089 ghost|0.0086702 white|0.0086702 alice|0.0082944 blue|0.0082944 bisque|0.0082049 lavender|0.0081154 blush|0.0081154 floral|0.0080161 white|0.0080161 wheat|0.0077034 mint|0.007322 cream|0.007322 linen|0.0065359 lavender|0.0064518 peru|0.0062787 azure|0.0062271  "
		}
	}
}
