{
	"add": {
		"doc": {
			"id": "10b4a69e530ca0a0cdfcf0702ab02cd5552e865ea611bb2fc163bd2ba9140088",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Southern_Flying_Squirrel-27527-3.jpg/220px-Southern_Flying_Squirrel-27527-3.jpg",
				"previous": "Animals that characterize the Appalachian forests include five species of tree squirrels. The most commonly seen is the low to moderate elevation eastern gray squirrel (Sciurus carolinensis). Occupying similar habitat is the slightly larger fox squirrel (Sciurus niger) and the much smaller southern flying squirrel (Glaucomys volans). More characteristic of cooler northern and high elevation habitat is the red squirrel (Tamiasciurus hudsonicus), whereas the Appalachian northern flying squirrel (Glaucomys sabrinus fuscus), which closely resembles the southern flying squirrel, is confined to northern hardwood and spruce-fir forests.",
				"after": "As familiar as squirrels are the eastern cottontail rabbit (Silvilagus floridanus) and the white-tailed deer (Odocoileus virginianus). The latter in particular has greatly increased in abundance as a result of the extirpation of the eastern wolf (Canis lupus lycaon) and the North American cougar. This has led to the overgrazing and browsing of many plants of the Appalachian forests, as well as destruction of agricultural crops. Other deer include the moose (Alces alces ), found only in the north, and the elk (Cervus canadensis), which, although once extirpated, is now making a comeback, through transplantation, in the southern and central Appalachians. In Quebec, the Chic-Chocs host the only population of caribou (Rangifer tarandus) south of the St. Lawrence River. An additional species that is common in the north but extends its range southward at high elevations to Virginia and West Virginia is the varying or snowshoe hare (Lepus americanus). However, these central Appalachian populations are scattered and very small.",
			"color": "misty|0.21702 rose|0.21702 rosy|0.20711 brown|0.20711 pink|0.076805 peach|0.066037 puff|0.066037 sienna|0.061346 lavender|0.051149 blush|0.051149 dark|0.035532 salmon|0.035532 light|0.033581 pink|0.033581 black|0.029116 linen|0.024381 sea|0.021286 shell|0.021286 antique|0.020533 white|0.020533 bisque|0.019349  "
		}
	}
}
