{
	"add": {
		"doc": {
			"id": "10bb9c4dc66ad2dbda41d4837b06cd213a316c8bef7c23dc06dd894c20baf3c2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Kerry_Wood_2008.jpg/100px-Kerry_Wood_2008.jpg",
			"previous": [],
				"after": "The Chicago Cubs are a Major League Baseball (MLB) franchise based in Chicago, Illinois. They play in the National League Central division. Since the institution of MLB's Rule 4 Draft, the Cubs have selected 56 players in the first round. Officially known as the \"First-Year Player Draft\", the Rule 4 Draft is MLB's primary mechanism for assigning amateur baseball players from high schools, colleges, and other amateur baseball clubs to its teams. The draft order is determined based on the previous season's standings, with the team possessing the worst record receiving the first pick. In addition, teams which lost free agents in the previous off-season may be awarded compensatory or supplementary picks. Of the 56 players picked in the first round by the Cubs, 28 have been pitchers, the most of any position; 22 of these were right-handed, while 6 were left-handed. Fifteen players picked in the initial round were outfielders, while seven shortstops, two catchers, and one player each at first base, second base, and third base were also taken. The Cubs drafted 24 players out of high school, and 32 out of college. Chicago has drafted eleven players from high schools or colleges in the state of California, with six more coming from Texas and five from Indiana. The Cubs have also taken three players from their home state of Illinois. The Cubs have not won a World Series championship since 1908, and no pick has been elected to the Hall of Fame. The Cubs' first-round selection in 1995—Kerry Wood—won the MLB Rookie of the Year award with the franchise in 1998, his first season in the Major Leagues. One pick—1985 selection Rafael Palmeiro—is a member of both the 3,000 hit club and the 500 home run club. The Cubs have held the first overall pick in the draft only once, in 1982, when they selected Shawon Dunston. (Read more...)",
			"color": "black|0.20678 peru|0.13504 dim|0.083509 gray|0.083509 dim|0.083509 grey|0.083509 dark|0.048369 olive|0.048369 green|0.048369 burly|0.043307 wood|0.043307 dark|0.039279 gray|0.039279 dark|0.039279 grey|0.039279 silver|0.036195 light|0.035865 gray|0.035865 light|0.035865 grey|0.035865 gray|0.031029 grey|0.031029 gainsboro|0.030216  "
		}
	}
}
