{
	"add": {
		"doc": {
			"id": "10bdaa4a922d577f663b08ea8e66378652042bf96e5178c184742be457d4e6a3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/NappesNosyKomba.JPG/220px-NappesNosyKomba.JPG",
			"previous": [],
				"after": "During Madagascar's First Republic, France heavily influenced Madagascar's economic planning and policy and served as its key trading partner. Key products were cultivated and distributed nationally through producers' and consumers' cooperatives. Government initiatives such as a rural development program and state farms were established to boost production of commodities such as rice, coffee, cattle, silk and palm oil. Popular dissatisfaction over these policies was a key factor in launching the socialist-Marxist Second Republic, in which the formerly private bank and insurance industries were nationalized; state monopolies were established for such industries as textiles, cotton and power; and import–export trade and shipping were brought under state control. Madagascar's economy quickly deteriorated as exports fell, industrial production dropped by 75 percent, inflation spiked and government debt increased; the rural population was soon reduced to living at subsistence levels. Over 50 percent of the nation's export revenue was spent on debt servicing.[16]",
			"color": "black|0.35745 light|0.23207 steel|0.23207 blue|0.23207 light|0.14774 slate|0.14774 gray|0.14774 slate|0.089885 gray|0.089885 light|0.018777 blue|0.018777 alice|0.01247 blue|0.01247 lavender|0.011956 dark|0.0114 gray|0.0114 dark|0.0114 grey|0.0114 azure|0.0097285 silver|0.0096463 white|0.0096107 smoke|0.0096107 light|0.0094754 gray|0.0094754 light|0.0094754 grey|0.0094754 gainsboro|0.0092635 ghost|0.0090849 white|0.0090849 mint|0.0083183 cream|0.0083183 white|0.0078142 snow|0.0074239 floral|0.0055426 white|0.0055426 sea|0.005243 shell|0.005243 dim|0.0050405 gray|0.0050405 dim|0.0050405 grey|0.0050405 light|0.0048571 cyan|0.0048571 gray|0.0041652 grey|0.0041652  "
		}
	}
}
