{
	"add": {
		"doc": {
			"id": "10c6e2ea35caab5eb56596a5ff294ecf6b11020aaf8efa711472708fe9bc8cd2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Anarchy-symbol.svg/120px-Anarchy-symbol.svg.png",
				"previous": "Portal:Society/Featured article/35",
				"after": "Anarchism is generally defined as a political philosophy which holds the state to be undesirable, unnecessary, or harmful, or, alternatively, as opposing authority or hierarchical organization in the conduct of human relations. Proponents of anarchism, known as \"anarchists\", advocate stateless societies based on non-hierarchical voluntary associations. There are many types and traditions of anarchism, not all of which are mutually exclusive. Anarchist schools of thought can differ fundamentally, supporting anything from extreme individualism to complete collectivism. Strains of anarchism have been divided into the categories of social and individualist anarchism or similar dual classifications. Anarchism is often considered a radical left-wing ideology, and much of anarchist economics and anarchist legal philosophy reflect anti-statist interpretations of communism, collectivism, syndicalism, or participatory economics. However, anarchism has always included an individualist strain, egoist strain, and free market strain. Some individualist anarchists are also socialists or communists, while some anarcho-communists are also individualists. Anarchism as a mass social movement has regularly endured fluctuations in popularity. The central tendency of anarchism as a social movement has been represented by anarcho-communism and anarcho-syndicalism, with individualist anarchism being primarily a literary phenomenon which nevertheless did have an impact on the bigger currents and individualists have also participated in large anarchist organizations. Most anarchists oppose all forms of aggression, supporting self-defense or non-violence (anarcho-pacifism), while others have supported the use of some coercive measures, including violent revolution and propaganda of the deed, on the path to an anarchist society.",
			"color": "black|0.96989 dim|0.017676 gray|0.017676 dim|0.017676 grey|0.017676 gray|0.010995 grey|0.010995  "
		}
	}
}
