{
	"add": {
		"doc": {
			"id": "10f1d6ea1690d0106b875cff6be5a2a0a86a6505cfc3b8a9ae1b664cd5738005",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/STS-1_The_Shuttle%27s_Solid_Rocket_Boosters_break_away_from_Columbia%27s_External_Tank.jpg/220px-STS-1_The_Shuttle%27s_Solid_Rocket_Boosters_break_away_from_Columbia%27s_External_Tank.jpg",
				"previous": "Around 30 seconds into ascent, the SSMEs were throttled down—usually to 72%, though this varied—to reduce the maximum aerodynamic forces acting on the Shuttle at a point called Max Q. Additionally, the propellant grain design of the SRBs caused their thrust to drop by about 30% by 50 seconds into ascent. Once the Orbiter's guidance verified that Max Q would be within Shuttle structural limits, the main engines were throttled back up to 104.5%; this throttling down and back up was called the \"thrust bucket\". To maximize performance, the throttle level and timing of the thrust bucket was shaped to bring the Shuttle as close to aerodynamic limits as possible.[74]",
				"after": "At around T+126 seconds, pyrotechnic fasteners released the SRBs and small separation rockets pushed them laterally away from the vehicle. The SRBs parachuted back to the ocean to be reused. The Shuttle then began accelerating to orbit on the main engines. Acceleration at this point would typically fall to .9 g, and the vehicle would take on a somewhat nose-up angle to the horizon – it used the main engines to gain and then maintain altitude while it accelerated horizontally towards orbit. At about five and three-quarter minutes into ascent, the orbiter's direct communication links with the ground began to fade, at which point it rolled heads up to reroute its communication links to the Tracking and Data Relay Satellite system.",
			"color": "dim|0.24874 gray|0.24874 dim|0.24874 grey|0.24874 dark|0.13234 gray|0.13234 dark|0.13234 grey|0.13234 burly|0.10683 wood|0.10683 gray|0.10304 grey|0.10304 tan|0.036389 silver|0.035847 slate|0.033995 gray|0.033995 light|0.030093 slate|0.030093 gray|0.030093 wheat|0.022857 navajo|0.021151 white|0.021151 pale|0.021022 golden|0.021022 rod|0.021022 moccasin|0.019814 light|0.016299 gray|0.016299 light|0.016299 grey|0.016299 blanched|0.0095517 almond|0.0095517  "
		}
	}
}
