{
	"add": {
		"doc": {
			"id": "10f1f5d0831c02476fc3c75189c941579f61ff045d199c108fbc46e6e6d25ee7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Trafford_park_railway.jpg/220px-Trafford_park_railway.jpg",
				"previous": "At the end of the 19th century there were no public transport routes in, and few running close to, Trafford Park. Its size meant that the Estates Company was obliged to provide some means of travelling around the park, and therefore a gas-powered tramway was commissioned, intended to carry both people and freight. The first tram ran on 23 July 1897, but after a few days of operation there was an accident in which a tramcar was derailed, and the service was suspended until the following year.[83] The tram's maximum speed was 12 miles per hour (19 km/h), and their distinctive exhaust smell quickly earned them the nickname \"Lamp Oil Express\". The service was operated by the British Gas Traction Company, which paid a share of its takings to the Estates Company, but by 1899 the company was in serious financial difficulty, and entered voluntary liquidation. Salford Corporation then refused to provide any more gas for the trams, and the service was once again suspended until the Estates Company bought the entire operation for £2,000 in 1900.[84] A separate electric tramway was installed in 1903, and was taken over and operated by Manchester and Salford Corporations in 1905.[85] The takeover did not affect the gas trams however, which continued to run until 1908, when they were replaced by steam locomotives.[83] Between 1904 and 1907 the Estates Company also operated a horse-drawn bus for the use of gentlemen staying at Trafford Hall, then a hotel. The service, available 24-hours a day, was replaced by a motor car in 1907.[86]",
				"after": "Under an 1898 agreement between the Estates Company and the Ship Canal Company, the latter committed to carry freight on their dock railway between the docks and the park and to the construction of a permanent connection between the two railway networks. The West Manchester Light Railway Company was set up the following year to take over the operations of the tramway and to lay additional track.[87] In 1904 responsibility for all of the parks roads and railways passed to the Trafford Park Company, as a result of the Trafford Park Act of that year. The railway network could subsequently be extended as required, without the need to seek additional permissions from Parliament.[83] The network was also connected to the Manchester, South Junction and Altrincham Railway near Cornbrook.[23] At its peak, the estate's railway network covered 26 route miles (42 km), handling about 2.5 million tons of cargo in 1940. Like the rest of the park, it fell into decline during the 1960s, exacerbated by the increasing use of road transport, and it was closed in 1998.[88]",
			"color": "gray|0.21959 grey|0.21959 light|0.21245 steel|0.21245 blue|0.21245 dark|0.16293 gray|0.16293 dark|0.16293 grey|0.16293 dim|0.11415 gray|0.11415 dim|0.11415 grey|0.11415 silver|0.10929 black|0.061826 light|0.050745 gray|0.050745 light|0.050745 grey|0.050745 gainsboro|0.026278 lavender|0.004643 dark|0.004243 olive|0.004243 green|0.004243  "
		}
	}
}
