{
	"add": {
		"doc": {
			"id": "10f76df281e436eadc6ef7c657e31e7081a4e2a6bafe0322d79e0814f0e5e8ec",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Jan_van_Eyck_076.jpg/220px-Jan_van_Eyck_076.jpg",
				"previous": "The Dresden Triptych was probably in the possession of the Giustiniani family in the mid- to late-15th century.[1] It is mentioned in a May 10, 1597 record of a purchase by Vincenzo Gonzaga, Duke of Mantua, and was then sold with the Gonzaga Collection to Charles I of England in 1627.[2] After Charles's fall and execution, the painting went to Paris and was owned by Eberhard Jabach, the Cologne-based banker and art dealer for Louis XIV and Cardinal Mazarin. A year after Jabach's death in 1695, it passed to the Elector of Saxony, and next appears in a 1754 inventory of the Dresden Collection, attributed to Albrecht Dürer,[1] until the German historian Aloys Hirt in 1830 established it as a van Eyck.[2] In the mid-19th century the Dresden catalogues first attribute it to Hubert van Eyck (d. 1426) and a few years later to Jan.[1]",
				"after": "Van Eyck signed, dated and added his motto to the central panel, a fact only discovered when the frame was removed in the course of a mid-20th century restoration,[3] and confirmed with the 1959 discovery of the signature which is placed along with the words IOHANNIS DE EYCK ME FECIT ET C[OM]PLEVIT ANNO D[OMINI MCCCCXXXVII.ALC IXH XAN (\"Jan Van Eyck Made And Completed Me In The Year 1437. As I Can\"). The word \"completed\" (complevit) may suggest the completion date, but as master painters of the era typically had workshops to assist on major works, the wording can be seen as aggressively socially ambitious; perhaps an arrogant master painter indicating his workshop assistants had little material involvement in the panels, and that he was primarily responsible for its design and execution. This view is reinforced by the fact that it is the only non-portrait to contain van Eyck's motto, ALC IXH XAN.[4] Until the discovery of the signature the piece was variously dated to an early piece from the 1420s to his later period in the late 1430s.[5] Because the panels are so definitely attributed they are often used as a touchstone to date van Eyck's other works; there are a number of evident stylistic developments, including the type of stained glass windows and mouldings around the arcades, and his ability at handling perspective, which can be used to determine if other works at least pre-date the triptych.[6]",
			"color": "firebrick|0.44217 brown|0.2912 maroon|0.1031 dark|0.0731 red|0.0731 black|0.031084 rosy|0.013787 brown|0.013787  "
		}
	}
}
