{
	"add": {
		"doc": {
			"id": "1115609228cdc3660726ab9a67c6853b5e9e5cd8dff7a20eb2b0c5d6052e51fa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Minas_Geraes_MdB_II.jpg/220px-Minas_Geraes_MdB_II.jpg",
				"previous": "Three years after the mutiny, Minas Geraes was used to transport Brazilian Minister of Foreign Affairs Lauro Müller to the United States.[79][80][81] The ship returned on 16 July and arrived in Rio de Janeiro on 16 August. In September both Minas Geraes and São Paulo participated in a major exercise with most of the Brazilian Navy. The need for more modern fire control system was identified as early as late 1913, but no action was taken.[81][82] When Brazil entered the First World War in 1917, they were offered to the United Kingdom for service in the Grand Fleet, but the British declined due to the condition the ships were in. They had not been modernized since entering service, and maintenance had been neglected; to illustrate the problem, when Brazil sent São Paulo to the United States for a modernization in June 1918, fourteen of the eighteen boilers that powered the ship failed. The ship only finished the voyage to New York with the assistance of the American battleship Nebraska and cruiser Raleigh.[83] Minas Geraes followed after its sister's return, and the modernization was done between 1 September 1920 and 1 October 1921.[81][84]",
				"after": "São Paulo made two trips to Europe in 1920. The first conveyed King Albert I and Queen Elisabeth to Brazil for the centennial celebrations. After São Paulo brought them home, the ship traveled to Portugal to take the bodies of the formerly-exiled Emperor Pedro II and his wife, Teresa Cristina, back to Brazil.[82][85][J] In July 1922, both battleships helped to quash the first of the Tenente revolts (Revolução Tenentista), in which the garrison of Rio de Janeiro's Fort Copacabana rebelled and began bombarding the city. São Paulo shelled the fort, and the rebels surrendered shortly thereafter; Minas Geraes did not fire its guns.[24][25][70][86][K] In 1924, three lieutenants, including Hercolino Cascardo, took over São Paulo with other crewmen. They were unsuccessful in swaying any other ships to their cause, except for an old torpedo boat, and soon sailed out of the harbor after firing a six-pounder gun at Minas Geraes. Short of food and with condensers in poor condition, the rebels sailed to Montevideo, where they received asylum. Minas Geraes followed São Paulo, arriving on 11 November and taking back possession of the ship.[88]",
			"color": " "
		}
	}
}
