{
	"add": {
		"doc": {
			"id": "1128fe7377d63146a9e2a5fe8321b3d40890e340c44e1556924ec7852d5ec13f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Execution_of_thomas_armstrong_1683.jpg/250px-Execution_of_thomas_armstrong_1683.jpg",
				"previous": "Those still conscious at that point might have seen their entrails burned, before their heart was removed and the body decapitated and quartered (chopped into four pieces). The regicide Major-General Thomas Harrison, after being hanged for several minutes and then cut open in October 1660, was reported to have leaned across and hit his executioner—resulting in the swift removal of his head. His entrails were thrown onto a nearby fire.[45][46][nb 6] John Houghton was reported to have prayed while being disembowelled in 1535, and in his final moments to have cried \"Good Jesu, what will you do with my heart?\"[49][50] Executioners were often inexperienced and proceedings did not always run smoothly. In 1584 Richard White's executioner removed his bowels piece by piece, through a small hole in his belly, \"the which device taking no good success, he mangled his breast with a butcher's axe to the very chine most pitifully\".[51][nb 7] At his execution in January 1606 for his involvement in the Gunpowder Plot, Guy Fawkes managed to break his neck by jumping from the gallows, cheating the executioner.[55][56]",
				"after": "No records exist to demonstrate exactly how the corpse was quartered, although an engraving of the quartering of Sir Thomas Armstrong in 1684 shows the executioner making vertical cuts through the spine and removing the legs at the hip.[57] The distribution of Dafydd ap Gruffydd's remains was described by Herbert Maxwell: \"the right arm with a ring on the finger in York; the left arm in Bristol; the right leg and hip at Northampton; the left [leg] at Hereford. But the villain's head was bound with iron, lest it should fall to pieces from putrefaction, and set conspicuously upon a long spear-shaft for the mockery of London.\"[58] After the execution in 1660 of several of the regicides involved in the death of King Charles I eleven years earlier, the diarist John Evelyn remarked: \"I saw not their execution, but met their quarters, mangled, and cut, and reeking, as they were brought from the gallows in baskets on the hurdle.\"[59] Such remains were typically parboiled and displayed as a gruesome reminder of the penalty for high treason, usually wherever the traitor had conspired or found support.[46][60] The head was often displayed on London Bridge, for centuries the route by which many travellers from the south entered the city. Several eminent commentators remarked on the displays. In 1566 Joseph Justus Scaliger wrote that \"in London there were many heads on the bridge ... I have seen there, as if they were masts of ships, and at the top of them, quarters of men's corpses\". In 1602 the Duke of Pommerania-Stettin emphasised the ominous nature of their presence when he wrote \"near the end of the bridge, on the suburb side, were stuck up the heads of thirty gentlemen of high standing who had been beheaded on account of treason and secret practices against the Queen\".[61][nb 8] The practice of using London Bridge in this manner ended following the hanging, drawing and quartering in 1678 of William Staley, a victim of the fictitious Popish Plot. His quarters were given to his relatives, who promptly arranged a \"grand\" funeral; this incensed the coroner so much that he ordered the body to be dug up and set upon the city gates. Staley's was the last head to be placed on London Bridge.[63][64]",
			"color": " "
		}
	}
}
