{
	"add": {
		"doc": {
			"id": "11356e038c1ffd43b06ed568bf4fdc0ff40c1baffb7ac7d28142953710ce046d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Diesel_engine_valve_train.JPG/220px-Diesel_engine_valve_train.JPG",
				"previous": "The pistons are short cylindrical parts which seal one end of the cylinder from the high pressure of the compressed air and combustion products and slide continuously within it while the engine is in operation. The top wall of the piston is termed its crown and is typically flat or concave. Some two-stroke engines use pistons with a deflector head. Pistons are open at the bottom and hollow except for an integral reinforcement structure (the piston web). When an engine is working the gas pressure in the combustion chamber exerts a force on the piston crown which is transferred through its web to a gudgeon pin. Each piston has rings fitted around its circumference that mostly prevent the gases from leaking into the crankcase or the oil into the combustion chamber. A ventilation system drives the small amount of gas that escape past the pistons during normal operation (the blow-by gases) out of the crankcase so that it does not accumulate contaminating the oil and creating corrosion. In two-stroke gasoline engines the crankcase is part of the air–fuel path and due to the continuous flow of it they do not need a separate crankcase ventilation system.",
				"after": "The cylinder head is attached to the engine block by numerous bolts or studs. It has several functions. The cylinder head seals the cylinders on the side opposite to the pistons; it contains short ducts (the ports) for intake and exhaust and the associated intake valves that open to let the cylinder be filled with fresh air and exhaust valves that open to allow the combustion gases to escape. However, 2-stroke crankcase scavenged engines connect the gas ports directly to the cylinder wall without poppet valves; the piston controls their opening and occlusion instead. The cylinder head also holds the spark plug in the case of spark ignition engines and the injector for engines that use direct injection. All CI engines use fuel injection, usually direct injection but some engines instead use indirect injection. SI engines can use a carburetor or fuel injection as port injection or direct injection. Most SI engines have a single spark plug per cylinder but some have 2. A head gasket prevents the gas from leaking between the cylinder head and the engine block. The opening and closing of the valves is controlled by one or several camshafts and springs—or in some engines—a desmodromic mechanism that uses no springs. The camshaft may press directly the stem of the valve or may act upon a rocker arm, again, either directly or through a pushrod.",
			"color": "dim|0.20423 gray|0.20423 dim|0.20423 grey|0.20423 gray|0.1987 grey|0.1987 dark|0.15511 gray|0.15511 dark|0.15511 grey|0.15511 powder|0.068115 blue|0.068115 silver|0.067167 light|0.056247 gray|0.056247 light|0.056247 grey|0.056247 gainsboro|0.040099 cadet|0.033674 blue|0.033674 dark|0.02425 slate|0.02425 gray|0.02425 black|0.018791 slate|0.011426 gray|0.011426 pale|0.011273 turquoise|0.011273 light|0.0093572 slate|0.0093572 gray|0.0093572 light|0.0082353 cyan|0.0082353 white|0.0067483 smoke|0.0067483 linen|0.0053573 antique|0.0053232 white|0.0053232 sea|0.0053165 shell|0.0053165 mint|0.0051944 cream|0.0051944 floral|0.0050206 white|0.0050206 snow|0.0048723 azure|0.0048595 white|0.0042789  "
		}
	}
}
