{
	"add": {
		"doc": {
			"id": "113ddc382b042878a7e5d81cbfaaab902a192c6a4110151e24dfee536c69c4dd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Money_Matters_at_TMA.jpg/220px-Money_Matters_at_TMA.jpg",
				"previous": "As of 2012[update], 92.89% of Georgetown University undergraduates are involved in at least one of the 179 registered student organizations which cover a variety of interests: student government, club sports, media and publications, performing arts, religion, and volunteer and service.[138] Students also operate campus stores, banks, and medical services. Students often find their interests at the Student Activities Commission Club Fair, where both official and unofficial organizations set up tables.[139] The Georgetown University Student Association is the student government organization for undergraduates. There are also student representatives within the schools, to the Board of Directors, and, since 1996, to the Georgetown Advisory Neighborhood Commission.[140]",
				"after": "Georgetown's student organizations include one of the nation's oldest debating clubs, the Philodemic Society, founded in 1830,[141] and the oldest university theater group, the Mask and Bauble Dramatic Society.[142] Nomadic Theatre, founded in 1982 as an alternative troupe without an on-campus home, produces \"plays which educate and challenge all members of the university community through thought-provoking theatre.\"[143] The Georgetown Improv Association, founded in 1995, performs monthly long-form improvisational shows on-campus at Bulldog Alley in addition to hosting \"Improvfest\", one of the oldest improv festivals in the country.[144] The Model United Nations team, run by the Georgetown International Relations Club, has attained the status of best in the world on several occasions.[145]",
			"color": "black|0.26684 tan|0.23653 burly|0.069276 wood|0.069276 peach|0.067836 puff|0.067836 wheat|0.058514 bisque|0.050557 blanched|0.029435 almond|0.029435 sienna|0.024284 moccasin|0.0219 saddle|0.020836 brown|0.020836 papaya|0.019469 whip|0.019469 antique|0.017848 white|0.017848 navajo|0.01653 white|0.01653 corn|0.012109 silk|0.012109 dark|0.010955 slate|0.010955 gray|0.010955 beige|0.0098644 peru|0.0095623 old|0.0069568 lace|0.0069568  "
		}
	}
}
