{
	"add": {
		"doc": {
			"id": "11463ab5ff3101b31db71b47a650488d769eabe55f5734519360084d5d5ae79b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/A_U.S._Air_Force_pilot_navigates_an_F-35A_Lightning_II_aircraft_assigned_to_the_58th_Fighter_Squadron%2C_33rd_Fighter_Wing_into_position_to_refuel_with_a_KC-135_Stratotanker_assigned_to_the_336th_Air_Refueling_130516-F-XL333-404.jpg/220px-thumbnail.jpg",
				"previous": "The Fighter Teen Series (F-15, F-16, F/A-18) carried large external fuel tanks, but to avoid negating its stealth characteristics the F-35 must fly most missions without them. Unlike the F-16 and F/A-18, the F-35 lacks leading edge extensions and instead uses stealth-friendly chines for vortex lift in the same fashion as the SR-71 Blackbird.[264] The small bumps just forward of the engine air intakes form part of the diverterless supersonic inlet (DSI) which is a simpler, lighter means to ensure high-quality airflow to the engine over a wide range of conditions. These inlets also crucially improve the aircraft's very-low-observable characteristics (by eliminating radar reflections between the diverter and the aircraft's skin).[289] Additionally, the \"bump\" surface reduces the engine's exposure to radar, significantly reducing a strong source of radar reflection[290] because they provide an additional shielding of engine fans against radar waves. The Y-duct type air intake ramps also help in reducing RCS, because the intakes run parallel and not directly into the engine fans.",
				"after": "The F-35's radar-absorbent materials are designed to be more durable and less maintenance-intensive than those of its predecessors. At optimal frequencies, the F-35 compares favorably to the F-22 in stealth, according to General Mike Hostage, Commander of the Air Combat Command.[291][292] Like other stealth fighters, however, the F-35 is more susceptible to detection by low frequency radars due to the Rayleigh scattering resulting from the aircraft's physical size. However, such radars are also conspicuous, susceptible to clutter, and have low precision.[293][294] Because the aircraft's shape is important to the radar cross-section (RCS), special care must be taken to match the \"boilerplate\" during production.[295] Ground crews require Repair Verification Radar (RVR) test sets to verify the RCS after performing repairs, which is not a concern for non-stealth aircraft.[296][297]",
			"color": "light|0.27441 slate|0.27441 gray|0.27441 slate|0.16933 gray|0.16933 dark|0.12881 gray|0.12881 dark|0.12881 grey|0.12881 silver|0.11252 steel|0.08827 blue|0.08827 black|0.067738 light|0.054613 gray|0.054613 light|0.054613 grey|0.054613 gainsboro|0.029514 gray|0.021786 grey|0.021786 light|0.010613 steel|0.010613 blue|0.010613 dark|0.010361 slate|0.010361 gray|0.010361 dim|0.0081065 gray|0.0081065 dim|0.0081065 grey|0.0081065 cadet|0.0071552 blue|0.0071552  "
		}
	}
}
