{
	"add": {
		"doc": {
			"id": "11637f798e62838f6a3b03fc1e2b8307f693e2c71a0984af681f482030df7347",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Remise_du_Prix_Sakharov_%C3%A0_Aung_San_Suu_Kyi_Strasbourg_22_octobre_2013-18.jpg/170px-Remise_du_Prix_Sakharov_%C3%A0_Aung_San_Suu_Kyi_Strasbourg_22_octobre_2013-18.jpg",
				"previous": "Over 100 Oxford alumni were elected to the House of Commons in 2010.[107] This includes current Leader of the Opposition, Ed Miliband, and numerous members of the cabinet and shadow cabinet. Additionally, over 140 Oxonians sit in the House of Lords.[14]",
				"after": "At least 30 other international leaders have been educated at Oxford[14] This number includes Harald V of Norway,[108] Abdullah II of Jordan,[14] four Prime Ministers of Australia (John Gorton, Malcolm Fraser, Bob Hawke, and Tony Abbott)[109][110][111] two Prime Ministers of Canada (Lester B. Pearson and John Turner),[14][112] two Prime Ministers of India (Manmohan Singh and Indira Gandhi (although she did not finish her degree)),[14][113] five Prime Ministers of Pakistan (Liaquat Ali Khan, Huseyn Shaheed Suhrawardy, Sir Feroz Khan Noon, Zulfiqar Ali Bhutto, and Benazir Bhutto),[14] S. W. R. D. Bandaranaike (former Prime Minister of Ceylon), Norman Washington Manley of Jamaica,[114] Eric Williams (Prime Minister of Trinidad and Tobago), Álvaro Uribe (Colombia's former President), Abhisit Vejjajiva (former Prime Minister of Thailand) and Bill Clinton (the first President of the United States to have attended Oxford; he attended as a Rhodes Scholar).[14][115] Arthur Mutambara (Deputy Prime Minister of Zimbabwe), was a Rhodes Scholar in 1991. Festus Mogae (former president of Botswana) was a student at University College. The Burmese democracy activist and Nobel laureate, Aung San Suu Kyi, was a student of St. Hugh's College.[116]",
			"color": "black|0.28761 golden|0.28341 rod|0.28341 gray|0.11144 grey|0.11144 dark|0.1072 golden|0.1072 rod|0.1072 dark|0.084025 gray|0.084025 dark|0.084025 grey|0.084025 dim|0.049005 gray|0.049005 dim|0.049005 grey|0.049005 tan|0.015708 silver|0.010446 light|0.010332 slate|0.010332 gray|0.010332  "
		}
	}
}
