{
	"add": {
		"doc": {
			"id": "11792caded635a322a493fec08958f37d116d016b9c8d69ea760c1d6a8afcfc9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Enchoen27n3200.jpg/120px-Enchoen27n3200.jpg",
				"previous": "Portal:Society/Featured biography/37",
				"after": "Sun Tzu was an ancient Chinese military general, strategist and philosopher who is traditionally believed to be the author of The Art of War, an influential ancient Chinese book on military strategy. Sun Tzu has had a significant impact on Chinese and Asian history and culture, both as an author of The Art of War and through legend. Sun Tzu, also known as Sun Tze or Sun Wu in other translations, was a historical figure whose authenticity is questioned by historians. This is a Chinese name which would usually mean the family name comes first however \"Zi\" (子; \"Tzu\" in Wade-Giles transliteration) was used as a suffix for the family name of a respectable man in ancient Chinese culture. In this case, 子 \"Tzu\" is not the personal or family name. It is a rough equivalent to \"Sir\" and is commonly translated into English as \"Master\". Traditional accounts place him in the Spring and Autumn Period of China (722–481 BC) as a military general serving under King Helü of Wu, who lived c. 544–496 BC. Modern scholars accepting his historicity place the completion of The Art of War in the Warring States period (476–221 BC), based on the descriptions of warfare in the text, and on the similarity of text's prose to other works completed in the early Warring States period. Traditional accounts state that his descendant, Sun Bin, also wrote a treatise on military tactics, titled Sun Bin's Art of War. Both Sun Wu and Sun Bin were referred to as Sun Tzu in classical Chinese writings, and some historians believed that Sun Wu was in fact Sun Bin until Sun Bin's own treatise was discovered in 1972. During the 19th and 20th centuries, Sun Tzu's The Art of War grew in popularity and saw practical use in Western society. His work continues to influence both Asian and Western culture and politics.",
			"color": "dark|0.30383 slate|0.30383 gray|0.30383 dim|0.30307 gray|0.30307 dim|0.30307 grey|0.30307 black|0.18117 gray|0.11794 grey|0.11794 dark|0.033951 gray|0.033951 dark|0.033951 grey|0.033951 slate|0.017578 gray|0.017578 light|0.014881 slate|0.014881 gray|0.014881 silver|0.0077221 dark|0.0073818 olive|0.0073818 green|0.0073818 light|0.0062039 steel|0.0062039 blue|0.0062039  "
		}
	}
}
