{
	"add": {
		"doc": {
			"id": "1179059cf6157f0b213dfb9812459f1044d58378b38a77cf3e0f6ad341d2f222",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Cavy_eating_grass.jpg/220px-Cavy_eating_grass.jpg",
				"previous": "Toxemia of pregnancy is common and kills many pregnant females. Signs of toxemia include anorexia, lack of energy, excessive salivation, a sweet or fruity breath odor due to ketones, and seizures in advanced cases.[79] Pregnancy toxemia appears to be most common in hot climates.[80] Other serious complications of pregnancy can include a prolapsed uterus, hypocalcaemia, and mastitis.[81]",
				"after": "Grass is the guinea pig's natural diet. Their molars are particularly suited for grinding plant matter, and grow continuously throughout the animal's life.[82] Most grass-eating mammals are quite large and have a long digestive tract; while guinea pigs have much longer colons than most rodents, they must also supplement their diet by coprophagy, the eating of their own feces.[83] However, they do not consume all their feces indiscriminately, but produce special soft pellets, called cecotropes, which recycle B vitamins, fiber, and bacteria required for proper digestion.[84][85] The cecotropes (or caecal pellets) are eaten directly from the anus, unless the guinea pig is pregnant or obese.[54] They share this behaviour with rabbits. In geriatric boars or sows (the condition is rarer in young ones), the muscles which allow the softer pellets to be expelled from the anus for consumption can become weak. This creates a condition known as anal impaction, which prevents the boar from redigesting cecotropes, though harder pellets may pass through the impacted mass.[86] The condition may be temporarily alleviated by carefully expelling the impacted feces.",
			"color": "black|0.38196 tan|0.16749 dim|0.066189 gray|0.066189 dim|0.066189 grey|0.066189 wheat|0.044202 dark|0.03457 khaki|0.03457 burly|0.026267 wood|0.026267 pale|0.025193 golden|0.025193 rod|0.025193 dark|0.020116 olive|0.020116 green|0.020116 moccasin|0.014864  "
		}
	}
}
