{
	"add": {
		"doc": {
			"id": "117e2f546744ccba673021f8203106b10d42aa777fac6375b53519d901b8faea",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Frans_Hogenberg_Bildersturm_1566.jpg/330px-Frans_Hogenberg_Bildersturm_1566.jpg",
			"previous": [],
				"after": "Religious images came under close scrutiny as actually or potentially idolatrous from the start of the Protestant Reformation in the 1520s. Martin Luther accepted some imagery, but few Early Netherlandish paintings met his criteria. Andreas Karlstadt, Huldrych Zwingli and John Calvin were wholly opposed to public religious images, above all in churches, and Calvinism soon became the dominant force in Netherlandish Protestantism. From 1520, outbursts of reformist iconoclasm broke out across much of Northern Europe.[186] These might be official and peaceable, as in England under the Tudors and the English Commonwealth, or unofficial and often violent, as in the Beeldenstorm or \"Iconoclastic Fury\" in 1566 in the Netherlands. On 19 August 1566, this wave of mob destruction reached Ghent, where Marcus van Vaernewijck (1518–69) chronicled the events. He wrote of the Ghent Altarpiece being \"taken to pieces and lifted, panel by panel, into the tower to preserve it from the rioters\".[187] Antwerp saw very thorough destruction in its churches in 1566,[188] followed by more losses in the Spanish Sack of Antwerp in 1576, and a further period of official iconoclasm in 1581, which now included city and guild buildings, when Calvinists controlled the city council.[189]",
			"color": "pale|0.20187 golden|0.20187 rod|0.20187 wheat|0.12221 lemon|0.10669 chiffon|0.10669 light|0.094356 golden|0.094356 rod|0.094356 yellow|0.094356 tan|0.06021 moccasin|0.051276 blanched|0.049031 almond|0.049031 corn|0.041676 silk|0.041676 burly|0.039798 wood|0.039798 light|0.038642 yellow|0.038642 beige|0.035701 papaya|0.035144 whip|0.035144 dark|0.02476 khaki|0.02476 antique|0.020394 white|0.020394 navajo|0.016446 white|0.016446 bisque|0.013219 dark|0.008163 salmon|0.008163 old|0.0079378 lace|0.0079378 light|0.0062147 salmon|0.0062147 sienna|0.0057215  "
		}
	}
}
