{
	"add": {
		"doc": {
			"id": "11804c76af99f66b5f28ceef36d8ffe2432a47e1debc74903dbbb14bc8ac0d80",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Seal_of_Chicago%2C_Illinois.png/28px-Seal_of_Chicago%2C_Illinois.png",
				"previous": "However, as the start of the 20th century came, industry's pervasive reach, increased railroad soot, and an encroaching vice district, caused the area to become less desirable, and the social elite vacated the region for quieter neighborhoods such as Kenwood, the Gold Coast and more commonly the suburban North Shore.[13] The Chicago Tribune highlighted 1898 Prairie Avenue as a place that was undesirable to those for whom it was affordable, and unaffordable to those for whom it was desirable.[16] Light industry and vacant lots overtook Prairie Avenue during the second half of the 20th century. The elegant mansions were mostly torn down or fell into extreme disrepair.[12] By the 1970s, most of the residential buildings had been replaced by factories and parking lots.[6] Starting in the late 1990s, the downtown housing market flourished in Chicago and the resulting boom that has transformed many neighborhoods revived Prairie Avenue, causing most of the factories to be demolished or converted to loft condominiums. The factories have been replaced by condominium projects and most of the remaining mansions have been renovated.[6]",
			"after": [],
			"color": "light|0.15432 sky|0.15432 blue|0.15432 light|0.14585 steel|0.14585 blue|0.14585 light|0.10235 blue|0.10235 gray|0.075389 grey|0.075389 dim|0.071505 gray|0.071505 dim|0.071505 grey|0.071505 dark|0.071301 sea|0.071301 green|0.071301 dark|0.061139 gray|0.061139 dark|0.061139 grey|0.061139 light|0.049095 slate|0.049095 gray|0.049095 sky|0.036886 blue|0.036886 slate|0.035888 gray|0.035888 cadet|0.025091 blue|0.025091 rosy|0.02337 brown|0.02337 dark|0.02188 green|0.02188 dark|0.017544 slate|0.017544 gray|0.017544 silver|0.017268 dark|0.016485 olive|0.016485 green|0.016485 powder|0.014465 blue|0.014465  "
		}
	}
}
