{
	"add": {
		"doc": {
			"id": "1180bed1b97494a4f0d3f5feaba5801a04ff7a6474575b76ed6bc332c0a4f97a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/LA_Basin.jpg/350px-LA_Basin.jpg",
			"previous": [],
				"after": "Accumulations of oil and gas occur almost wholly within strata of the younger sequence and in areas that are within or adjacent to the coastal belt.[1] The Puente formation has proved to be the most notable reservoir for petroleum in the basin.[18] The primary reason for the high abundance of oil is because the oil sands are well saturated within the basin. The thickness of these oil sands range from hundreds to thousands of feet.[1] Anticlines and faulted anticlines are the structural features that are also responsible for trapping oil. The first reported oil-producing well was discovered in 1892 on the land that is presently beneath Dodgers Stadium.[1] This basin was responsible for half of the states oil production until the (90's?). This is remarkable due to the relatively small size and youth of the basin.[4] The basin currently has about 40 active oil fields that collectively have 4,000 operating wells.[4] In 1904, there were over 1,150 wells in the city of Los Angeles alone. Tight spacing and continued pumping of the wells resulted in most of the wells to dry up. Most recent data indicates that 255 million barrels of oil were produced in 2013. This is a large decline from the almost 1 billion barrels per year produced in the late 1970s.[19]",
			"color": "light|0.45615 steel|0.45615 blue|0.45615 light|0.38749 blue|0.38749 dark|0.027321 sea|0.027321 green|0.027321 silver|0.018255 dim|0.018201 gray|0.018201 dim|0.018201 grey|0.018201 dark|0.017181 gray|0.017181 dark|0.017181 grey|0.017181 lavender|0.010407 gray|0.0099298 grey|0.0099298 light|0.0096895 gray|0.0096895 light|0.0096895 grey|0.0096895 slate|0.0072239 gray|0.0072239 light|0.0069069 slate|0.0069069 gray|0.0069069 powder|0.0063684 blue|0.0063684 gainsboro|0.0060307  "
		}
	}
}
