{
	"add": {
		"doc": {
			"id": "1181232ca87c427dac189834135fd23dc81a61d01b678e73bf0a7fe800f69c30",
			"url": "https://upload.wikimedia.org/wikipedia/en/a/a7/Alamo1846.jpg",
				"previous": "After Houston received word that Santa Anna was leading a large force to San Antonio, Bowie offered to lead volunteers to defend the Alamo from the expected attack. He arrived with 30 men on January 19,[83] where they found a force of 104 men with a few weapons and a few cannons, but not many supplies and little gunpowder.[84] Houston knew that there were not enough men to hold the fort in an attack and had given Bowie authority to remove the artillery and blow up the fortification. Bowie and the Alamo commander, James C. Neill, decided they did not have enough oxen to move the artillery, and they did not want to destroy the fortress. On January 26, one of Bowie's men, James Bonham, organized a rally which passed a resolution in favor of holding the Alamo. Bonham signed the resolution first, with Bowie's signature second.[85]",
				"after": "Through Bowie's connections because of his marriage and his fluency in Spanish, the predominantly Mexican population of San Antonio often furnished him with information about the movements of the Mexican army. After learning that Santa Anna had 4,500 troops and was heading for the city,[85] Bowie wrote several letters to the provisional government asking for help in defending the Alamo, especially \"men, money, rifles, and cannon powder\".[86] In another letter, to Governor Smith, he reiterated his view that \"the salvation of Texas depends in great measure on keeping Béxar out of the hands of the enemy. It serves as the frontier picquet guard, and if it were in the possession of Santa Anna, there is no stronghold from which to repel him in his march toward the Sabine.\"[86] The letter to Smith ended, \"Colonel Neill and myself have come to the solemn resolution that we will rather die in these ditches than give it up to the enemy.\"[86]",
			"color": "light|0.14142 gray|0.14142 light|0.14142 grey|0.14142 gray|0.13588 grey|0.13588 dark|0.13377 gray|0.13377 dark|0.13377 grey|0.13377 gainsboro|0.11088 silver|0.11047 dim|0.10935 gray|0.10935 dim|0.10935 grey|0.10935 antique|0.076199 white|0.076199 linen|0.053532 old|0.032127 lace|0.032127 sea|0.020572 shell|0.020572 misty|0.015154 rose|0.015154 black|0.010899 floral|0.010405 white|0.010405 beige|0.010355 papaya|0.0088719 whip|0.0088719 white|0.0052912 smoke|0.0052912 ivory|0.0046042  "
		}
	}
}
