{
	"add": {
		"doc": {
			"id": "118c6a76668116bd88fb83b9415cc20e3c873d2cabade54409bbe97e7fb9d5d8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/F-18%27s_are_refueled_in_Afghanistan.jpg/220px-F-18%27s_are_refueled_in_Afghanistan.jpg",
				"previous": "In 2007, Boeing proposed additional F/A-18E/Fs to the U.S. Navy in a multi-year contract.[77] As of October 2008, Boeing had delivered 367 Super Hornets to the U.S. Navy.[78] On 6 April 2009, Defense Secretary Gates announced that the Department of Defense intended to acquire 31 F/A-18s in FY2010.[79] Congress requested the DoD study a further multi-year contract so that a projected fighter shortfall could be averted;[80] in 2006, the Navy was 60 fighters below its validated aircraft requirement.[81] The FY2010 budget bill authorized a multiyear purchase agreement for additional Super Hornets.[82][83] A multi-year contract was finalized on 28 September 2010, reported as saving $600 million over individual yearly contracts, for 66 Super Hornets and 58 Growlers to mitigate a four-year delay in the F-35 program.[84]",
				"after": "On 7 August 2014, U.S. defense officials announced they had authorized to launch bombing missions upon Islamic State forces in northern Iraq. The decision to take direct action was made to protect U.S. personnel in the city of Irbil and to ensure the safety of transport aircraft making airdrops to Yazidi civilians. Early on 8 August 2014, two Super Hornets took off from the USS George H.W. Bush and dropped 500 lb laser-guided bombs on a \"mobile artillery piece\" the militants had been using to shell Kurdish forces defending the city.[85][86] Later that day, four more aircraft struck a seven-vehicle convoy and a mortar position.[87]",
			"color": "black|0.42154 dim|0.25763 gray|0.25763 dim|0.25763 grey|0.25763 dark|0.12025 slate|0.12025 gray|0.12025 light|0.034149 golden|0.034149 rod|0.034149 yellow|0.034149 beige|0.026803 dark|0.022905 sea|0.022905 green|0.022905 light|0.019997 yellow|0.019997 gray|0.016518 grey|0.016518  "
		}
	}
}
