{
	"add": {
		"doc": {
			"id": "11a1773e37f3d7edd0f1eb1fe6eb9633212410dd407793e55a6a9f0f994c630f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Heat_transfer_steel_diag2.png/220px-Heat_transfer_steel_diag2.png",
				"previous": "Approximately 2.5–3.0% carbon content.[1] Steels that can be tempered to great hardness. Used for special purposes like (non-industrial-purpose) knives, axles or punches. Most steels with more than 2.5% carbon content are made using powder metallurgy. Note that steel with a carbon content above 2.14% is considered cast iron.",
				"after": "The purpose of heat treating carbon steel is to change the mechanical properties of steel, usually ductility, hardness, yield strength, or impact resistance. Note that the electrical and thermal conductivity are only slightly altered. As with most strengthening techniques for steel, Young's modulus (elasticity) is unaffected. All treatments of steel trade ductility for increased strength and vice versa. Iron has a higher solubility for carbon in the austenite phase; therefore all heat treatments, except spheroidizing and process annealing, start by heating the steel to a temperature at which the austenitic phase can exist. The steel is then quenched (heat drawn out) at a high rate causing cementite to precipitate and finally the remaining pure iron to solidify. The rate at which the steel is cooled through the eutectoid temperature affects the rate at which carbon diffuses out of austenite and forms cementite. Generally speaking, cooling swiftly will leave iron carbide finely dispersed and produce a fine grained pearlite (until the martensite critical temperature is reached) and cooling slowly will give a coarser pearlite. Cooling a hypoeutectoid steel (less than 0.77 wt% C) results in a lamellar-pearlitic structure of iron carbide layers with α-ferrite (pure iron) between. If it is hypereutectoid steel (more than 0.77 wt% C) then the structure is full pearlite with small grains (larger than the pearlite lamella) of cementite scattered throughout. The relative amounts of constituents are found using the lever rule. The following is a list of the types of heat treatments possible:",
			"color": "dark|0.2227 gray|0.2227 dark|0.2227 grey|0.2227 dim|0.18466 gray|0.18466 dim|0.18466 grey|0.18466 lavender|0.15181 silver|0.13116 gray|0.058712 grey|0.058712 light|0.032343 gray|0.032343 light|0.032343 grey|0.032343 gainsboro|0.023378 white|0.019464 smoke|0.019464 snow|0.018359 alice|0.018224 blue|0.018224 ghost|0.018224 white|0.018224 sea|0.017938 shell|0.017938 lavender|0.017002 blush|0.017002 white|0.016772 floral|0.015625 white|0.015625 mint|0.015246 cream|0.015246 azure|0.014489 light|0.0094697 steel|0.0094697 blue|0.0094697  "
		}
	}
}
