{
	"add": {
		"doc": {
			"id": "11a9388c610bc1c59330d4ec0a32b1fc45d84e8dd665db89b39af3fe60e15330",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Petrus_Christus_-_Portrait_of_a_Young_Woman_-_Google_Art_Project.jpg/220px-Petrus_Christus_-_Portrait_of_a_Young_Woman_-_Google_Art_Project.jpg",
				"previous": "Van der Weyden developed the conventions of northern portraiture and was hugely influential on the following generations of painters. Rather than merely follow van Eyck's meticulous attention to detail, van der Weyden created more abstract and sensual representations. He was highly sought after as a portraitist, yet there are noticeable similarities in his portraits, likely because he used and reused the same underdrawings, which met common ideals of rank and piety. These were then adapted to show the facial characteristics and expressions of the particular sitter.[152]",
				"after": "Petrus Christus placed his sitter in a naturalistic setting rather than a flat and featureless background. This approach was in part a reaction against van der Weyden, who, in his emphasis on sculptural figures, utilised very shallow pictorial spaces.[154] In his 1462 Portrait of a Man, Dieric Bouts went further by situating the man in a room complete with a window that looks out at a landscape,[155] while in the 1500s, the full-length portrait became popular in the north. The latter format was practically unseen in earlier northern art, although it had a tradition in Italy going back centuries, most usually in fresco and illuminated manuscripts.[156] Full-length portraits were reserved for depictions of the highest echelon of society, and were associated with princely displays of power.[157] Of the second generation of northern painters, Hans Memling became the leading portraitist, taking commissions from as far as Italy. He was highly influential on later painters and is credited with inspiring Leonardo's positioning of the Mona Lisa in front of a landscape view.[158] Van Eyck and van der Weyden similarly influenced the French artist Jean Fouquet and the Germans Hans Pleydenwurff[159] and Martin Schongauer among others.[160]",
			"color": "black|0.70282 tan|0.14313 burly|0.065778 wood|0.065778 peach|0.021892 puff|0.021892 wheat|0.012494 bisque|0.0093686 antique|0.0080376 white|0.0080376 dim|0.0059547 gray|0.0059547 dim|0.0059547 grey|0.0059547 blanched|0.0047593 almond|0.0047593  "
		}
	}
}
