{
	"add": {
		"doc": {
			"id": "11b18c19b21fcb17dfe47872531a52ed5af2c770e4eafd0da6511b29b83f700a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Vans.rv-7.g-kels.arp.jpg/250px-Vans.rv-7.g-kels.arp.jpg",
			"previous": [],
				"after": "In this method, the exterior surface of the fuselage is also the primary structure. A typical early form of this (see the Lockheed Vega) was built using molded plywood, where the layers of plywood are formed over a \"plug\" or within a mold. A later form of this structure uses fiberglass cloth impregnated with polyester or epoxy resin, instead of plywood, as the skin. A simple form of this used in some amateur-built aircraft uses rigid expanded foam plastic as the core, with a fiberglass covering, eliminating the necessity of fabricating molds, but requiring more effort in finishing (see the Rutan VariEze). An example of a larger molded plywood aircraft is the de Havilland Mosquito fighter/light bomber of World War II. No plywood-skin fuselage is truly monocoque, since stiffening elements are incorporated into the structure to carry concentrated loads that would otherwise buckle the thin skin. The use of molded fiberglass using negative (\"female\") molds (which give a nearly finished product) is prevalent in the series production of many modern sailplanes. The use of molded composites for fuselage structures is being extended to large passenger aircraft such as the Boeing 787 Dreamliner (using pressure-molding on female molds).",
			"color": "light|0.68067 steel|0.68067 blue|0.68067 light|0.078756 slate|0.078756 gray|0.078756 dark|0.025953 gray|0.025953 dark|0.025953 grey|0.025953 lavender|0.023511 black|0.021746 silver|0.020638 dim|0.020055 gray|0.020055 dim|0.020055 grey|0.020055 light|0.012558 gray|0.012558 light|0.012558 grey|0.012558 gray|0.011086 grey|0.011086 slate|0.010918 gray|0.010918 gainsboro|0.00873 dark|0.0084793 olive|0.0084793 green|0.0084793 gold|0.0081358 khaki|0.0054632 alice|0.0051311 blue|0.0051311 golden|0.0049481 rod|0.0049481  "
		}
	}
}
