{
	"add": {
		"doc": {
			"id": "11b2a58f831a056258279636e140234053d20391ceb115ef80433de4672bb44b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Production_P-80s_af.jpg/220px-Production_P-80s_af.jpg",
				"previous": "The first jets were developed during World War II and saw combat in the last two years of the war. Messerschmitt developed the first operational jet fighter, the Me 262. It was considerably faster than contemporary piston-driven aircraft, and in the hands of a competent pilot, was quite difficult for Allied pilots to defeat. The design was never deployed in numbers sufficient to stop the Allied air campaign, and a combination of fuel shortages, pilot losses, and technical difficulties with the engines kept the number of sorties low. Nevertheless, the Me 262 indicated the obsolescence of piston-driven aircraft. Spurred by reports of the German jets, Britain's Gloster Meteor entered production soon after and the two entered service around the same time in 1944. Meteors were commonly used to intercept the V-1 \"buzz bomb\", as they were faster than available piston-engined fighters at the low altitudes the flying bombs were flying. By the end of the war almost all work on piston-powered fighters had ended. A few designs combining piston and jet engines for propulsion – such as the Ryan FR Fireball – saw brief use, but by the end of the 1940s virtually all new fighters were jet-powered.",
				"after": "Despite their advantages, the early jet fighters were far from perfect. The operational lifespan of turbines were very short and engines were temperamental, while power could be adjusted only slowly and acceleration was poor (even if top speed was higher) compared to the final generation of piston fighters. Many squadrons of piston-engined fighters were retained until the early to mid-1950s, even in the air forces of the major powers (though the types retained were the best of the World War II designs). Innovations including ejection seats, air brakes and all-moving tailplanes became widespread in this period.",
			"color": " "
		}
	}
}
