{
	"add": {
		"doc": {
			"id": "11cad841a2f3ad561207ef1462bebeb2720f0eeaece0b81b6133d23f07d785b7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Allosaurus_size_comparison.svg/220px-Allosaurus_size_comparison.svg.png",
			"previous": [],
				"after": "Allosaurus was a typical large theropod, having a massive skull on a short neck, a long tail and reduced forelimbs. Allosaurus fragilis, the best-known species, had an average length of 8.5 m (28 ft),[2] with the largest definitive Allosaurus specimen (AMNH 680) estimated at 9.7 meters long (32 ft),[3] and an estimated weight of 2.3 metric tons (2.5 short tons).[3] In his 1976 monograph on Allosaurus, James Madsen mentioned a range of bone sizes which he interpreted to show a maximum length of 12 to 13 m (39 to 43 ft).[4] As with dinosaurs in general, weight estimates are debatable, and since 1980 have ranged between 1,500 kilograms (3,300 pounds), 1,000 to 4,000 kg (2,200 to 8,800 lb), and 1,010 kilograms (2,230 pounds) for modal adult weight (not maximum).[5] John Foster, a specialist on the Morrison Formation, suggests that 1,000 kg (2,200 lb) is reasonable for large adults of A. fragilis, but that 700 kg (1,500 lb) is a closer estimate for individuals represented by the average-sized thigh bones he has measured.[6] Using the subadult specimen nicknamed \"Big Al\", researchers using computer modelling arrived at a best estimate of 1,500 kilograms (3,300 lb) for the individual, but by varying parameters they found a range from approximately 1,400 kilograms (3,100 lb) to approximately 2,000 kilograms (4,400 lb).[7]",
			"color": "dark|0.23839 golden|0.23839 rod|0.23839 brown|0.21502 dark|0.15701 gray|0.15701 dark|0.15701 grey|0.15701 dim|0.071804 gray|0.071804 dim|0.071804 grey|0.071804 silver|0.069828 gray|0.06056 grey|0.06056 black|0.04736 rosy|0.040699 brown|0.040699 light|0.023129 gray|0.023129 light|0.023129 grey|0.023129 sienna|0.021358 tan|0.016989 gainsboro|0.014263 burly|0.010378 wood|0.010378  "
		}
	}
}
