{
	"add": {
		"doc": {
			"id": "11df46991e5ebde08fdf5568cd4a7a0b4b3d5ba589b542d347ab5c2d4786368b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/BEA_Viscount_airliner_at_Nutts_Corner_Airport_-_geograph.org.uk_-_506949.jpg/220px-BEA_Viscount_airliner_at_Nutts_Corner_Airport_-_geograph.org.uk_-_506949.jpg",
			"previous": [
				"On 27 September 1960, BEA welcomed its 25-millionth passenger.[42]",
				"On 1 April 1960, BEA began commercial jet operations with its new Comet 4Bs. On that day, the airline commenced jet operations from Heathrow to Athens, Istanbul, Moscow, Munich, Rome and Warsaw with an initial, five-strong Comet fleet. By June, this fleet grew to seven (out of an eventual 18) aircraft, enabling the launch of additional jet services to Copenhagen, Oslo, Stockholm, Düsseldorf, Malta, Zürich and Frankfurt.[41]"
			],
			"after": [
				"Also in 1960, BEA took delivery of its final two Viscount 701s[nb 5] bringing its total fleet strength of this sub-type to 50.[7]",
				"1960 was furthermore the year the UK Parliament enacted the Civil Aviation (Licensing) Act (1960), which abolished the statutory monopoly BEA and BOAC had enjoyed on principal domestic and international scheduled routes since the beginning of the post-war era. In theory, this gave independent airlines equal opportunities to develop scheduled routes in their own right;[43] however, in reality, the corporations would object to applications by independent airlines seeking to be licensed as competitors to the state airlines. Each application by an independent airline for a scheduled route licence was heard by the newly established Air Transport Licensing Board (ATLB),[44] the new UK government body in charge of air transport economic regulation that succeeded ATAC. At these hearings, the independents needed to convince the ATLB that there were sufficient passengers to justify the proposed scheduled services, that these stood a reasonable chance of becoming profitable and that they opened up new markets rather than divert traffic from the corporations to overcome the latter's objections.[45] Although the ATLB granted British Eagle and British United Airways (BUA), BEA's and BOAC's two biggest independent competitors during the 1960s, licences to operate rival international scheduled services on several trunk routes from London Heathrow and Gatwick respectively, these airlines were unable to use them without actual traffic rights. For example, lack of traffic rights prevented BUA from running direct London (Gatwick) – Paris (Le Bourget) scheduled flights although it held a licence for that route, which the ATLB had awarded it in late-1961. In that case, BUA's failure to obtain traffic rights was mainly the result of the French authorities' refusal to grant these without a corresponding reduction in BEA's share of London–Paris flights.[46][47][48]"
			],
			"color": "dim|0.13832 gray|0.13832 dim|0.13832 grey|0.13832 gray|0.095914 grey|0.095914 tan|0.083346 black|0.083191  "
		}
	}
}
