{
	"add": {
		"doc": {
			"id": "11e1769d7261eb6f62553a726c3d95850fea510b98f80e4dcdf1947b8af07dd6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Maerz1848_berlin.jpg/230px-Maerz1848_berlin.jpg",
				"previous": "In addition to evolutionary development of mental and physical traits, Darwin and other evolutionary theorists emphasize the influence of the types of environment upon behaviour.[28] First of all there are ancestral environments that are typically long-term and stable forms of situations that influence mental development of individuals or groups gained either biologically through birth or learned from family or relatives, which cause the emphasis of certain mental behaviours that are developed due to the requirements of the ancestral environment.[28] In national group settings, these ancestral environments can result in psychological triggers in the minds of individuals within a group, such as responding positively to patriotic cues.[28] There are immediate environments that are those situations that confront an individual or group at a given point and activate certain mental responses.[28] In the case of a national group, the example of seeing the mobilization of a foreign military force on the nation's borders may provoke members of a national group to unify and mobilize themselves in response.[28] There are proximate environments where individuals identify nonimmediate real or imagined situations in combination with immediate situations that make individuals confront a common situation of both subjective and objective components that affect their decisions.[29] As such proximate environments cause people to make decisions based on existing situations and anticipated situations.[29] In the context of the politics of nations and nationalism, a political leader may adopt an international treaty not out of a benevolent stance but in the belief that such a treaty will either benefit their nation or will increase the prestige of their nation.[29] The proximate environment plays a role in the politics of nations that are angry with their circumstances (in much the same way that an individual or group's anger in response to feelings that they are being exploited usually results in efforts to accommodate them, while being passive results in them being ignored).[29] Nations that are angry with circumstances imposed on them by others are affected by the proximate environment that shapes the nationalism of such nations.[29]",
				"after": ". This is evident in many cases such as the French and American Revolutions. The fear of loss of identity, traditions and economic disparity lead to the banning together of citizens to achieve what was once theirs. Whatever the nation-state may have done that it shouldn’t have, the citizens of the state still knew that it was theirs, or at least that they were its. They knew what the state could require of them, and they accepted their duties as a condition of the rights that came with them. They recognized. therefore, the principal grounds of rights and duties them-selves. In short, there prevailed a sense of collective interest and purpose that gave substance to individual aspirations as well as to those of the group. The loss of this sense is a serious loss in a society such as ours that has found nothing to replace it.[30]",
			"color": "black|0.77708 dark|0.033727 olive|0.033727 green|0.033727 brown|0.032572 pale|0.031672 golden|0.031672 rod|0.031672 firebrick|0.021747 dark|0.018397 khaki|0.018397  "
		}
	}
}
