{
	"add": {
		"doc": {
			"id": "1211627780add4bd49468cd239a778a97744af0085b45a175a8f9c5aebf7cfdc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Dc3.takeoff.thales.arp.jpg/220px-Dc3.takeoff.thales.arp.jpg",
				"previous": "The DC-3 resulted from a marathon telephone call from American Airlines CEO C. R. Smith to Donald Douglas, when Smith persuaded a reluctant Douglas to design a sleeper aircraft based on the DC-2 to replace American's Curtiss Condor II biplanes. (The DC-2's cabin was 66 inches wide, too narrow for side-by-side berths.) Douglas agreed to go ahead with development only after Smith informed him of American's intention to purchase twenty aircraft. The new aircraft was engineered by a team led by chief engineer Arthur E. Raymond over the next two years, and the prototype DST (for Douglas Sleeper Transport) first flew on December 17, 1935 (the 32nd anniversary of the Wright Brothers' flight at Kitty Hawk). Its cabin was 92 inches wide, and a version with 21 seats instead of the 14-16 sleeping berths[6] of the DST was given the designation DC-3. There was no prototype DC-3; the first DC-3 built followed seven DSTs off the production line and was delivered to American Airlines.[7]",
				"after": "The DC-3 and DST popularized air travel in the United States. Eastbound transcontinental flights could cross the U.S. in about 15 hours with three refueling stops; westbound trips against the wind took 171⁄2 hours. A few years earlier such a trip entailed short hops in slower and shorter-range aircraft during the day, coupled with train travel overnight.[8]",
			"color": "black|0.13266 dark|0.11939 olive|0.11939 green|0.11939 dim|0.11241 gray|0.11241 dim|0.11241 grey|0.11241 gray|0.079128 grey|0.079128 dark|0.047371 gray|0.047371 dark|0.047371 grey|0.047371 white|0.037714 smoke|0.037714 snow|0.032695 ghost|0.032109 white|0.032109 sea|0.031993 shell|0.031993 alice|0.031366 blue|0.031366 white|0.031166 mint|0.029543 cream|0.029543 silver|0.029255 light|0.028329 gray|0.028329 light|0.028329 grey|0.028329 gainsboro|0.027719 floral|0.027444 white|0.027444 azure|0.027352 dark|0.024751 slate|0.024751 gray|0.024751 lavender|0.024285 blush|0.024285 slate|0.013576 gray|0.013576 light|0.011728 slate|0.011728 gray|0.011728 linen|0.010862  "
		}
	}
}
