{
	"add": {
		"doc": {
			"id": "1219a557c5502cb31b521814b5a3475754ae36ec5c8d2db707fb602b3de75ea5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Mistle_trush_male_left_pass_earthworms_to_female.jpg/220px-Mistle_trush_male_left_pass_earthworms_to_female.jpg",
				"previous": "The mistle thrush is quite terrestrial, hopping with its head held up and body erect; when excited, it will flick its wings and tail. The flight consists of undulating bounds interspersed with glides.[9]",
				"after": "Mistle thrushes breed in the year subsequent to their hatching;[12] they are monogamous and stay as a pair throughout the year in areas where they are not migratory.[20] Their territories are much larger than those of blackbirds or song thrushes;[9] although the nest territory is only about 0.6 ha (1.5 acres), around 15–17 ha (37–42 acres) is used for feeding. Territories are normally reoccupied in subsequent years.[3] Territories are larger in woods than in farmland.[19] The male will attack intruders into its breeding area, including birds of prey and corvids,[9] and sometimes cats or humans.[15] Courtship feeding of the female by her partner has sometimes been observed.[21] Breeding typically commences in mid-March in the south and west of Europe (late February in Britain), but not till early May in Finland.[14] The nest is usually built in a tree in the fork of a branch or against the trunk, although hedges, ledges on buildings and cliff faces may also be used. The nest site may be up to 20 m (66 ft) above the ground, although 2–9 m (6.5–30 ft) is more typical. The common chaffinch often nests close to a mistle thrush, the vigilance of the finch and the aggressive behaviour of the thrush benefiting both species. The thrush's nest is a large cup of sticks, dry grass, roots and moss, coated on the inside with a layer of mud and lined with fine grass and leaves. The nest is built by the female, although the male may help.[3][9][14] Nests built early in the breeding season may be destroyed by bad weather.[15]",
			"color": "dim|0.21091 gray|0.21091 dim|0.21091 grey|0.21091 black|0.15607 gray|0.098781 grey|0.098781 dark|0.068635 gray|0.068635 dark|0.068635 grey|0.068635 silver|0.054358 light|0.044375 gray|0.044375 light|0.044375 grey|0.044375 gainsboro|0.03693 dark|0.030806 khaki|0.030806 dark|0.02167 olive|0.02167 green|0.02167 white|0.019097 smoke|0.019097 alice|0.013972 blue|0.013972 mint|0.013612 cream|0.013612 snow|0.013352 pale|0.012917 golden|0.012917 rod|0.012917 floral|0.012823 white|0.012823 sea|0.012606 shell|0.012606 dark|0.012534 slate|0.012534 gray|0.012534 ghost|0.012509 white|0.012509 white|0.012169 azure|0.011851 linen|0.0099013 tan|0.0093627 antique|0.0090367 white|0.0090367 wheat|0.0080873 beige|0.0080686 ivory|0.0075619 old|0.0075468 lace|0.0075468  "
		}
	}
}
