{
	"add": {
		"doc": {
			"id": "121f5ca28946bfeb63445f2f78879b2cbef17caed9914157fbd6d9e9a1707fb9",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8f/Belton_Arch_Giano.jpg/300px-Belton_Arch_Giano.jpg",
			"previous": [],
				"after": "The late 17th century in England was a time of great progress in design. Following the austere years of Commonwealth rule, a great flourishing and development in both architecture and the arts began after the restoration of the monarchy in 1660. Royalist exiles and wealthy young men who made the Grand Tour, returned home with new ideas—often extravagant variations on classical themes. This was, for England, the dawn of the Baroque era. The new wave of architects such as Roger Pratt, John Webb, and Sir Christopher Wren were not just building vast edifices in Renaissance-inspired styles, but also transforming existing older houses. Representative of the utilisation of older houses is Coleshill House in Berkshire, where Pratt transformed the medieval, but now redundant, great hall into a classically inspired entrance hall complete with an imperial staircase. Great Halls were considered redundant now that employers wished to live separately from their servants, and no longer ate with them in a Great Hall. All evidence and odours of cooking and staff were banished from the principal parts of the house. Employers began to live in fine airy rooms, above the ground floor, with privacy from their servants, who were now confined, unless required, to specifically delegated areas—often the ground and uppermost attic floors. This was a period of great social change in British history, and the educated prided themselves on enlightenment and elegance.[17] While Belton is not in the Baroque style,[18] it displays all the traits typical of the new tendencies.",
			"color": "black|0.20485 dim|0.16026 gray|0.16026 dim|0.16026 grey|0.16026 gray|0.1365 grey|0.1365 dark|0.11488 gray|0.11488 dark|0.11488 grey|0.11488 tan|0.083594 burly|0.078146 wood|0.078146 dark|0.057167 olive|0.057167 green|0.057167 silver|0.038646 navajo|0.021438 white|0.021438 wheat|0.018046 light|0.015199 gray|0.015199 light|0.015199 grey|0.015199 moccasin|0.011535 gainsboro|0.0090315 peach|0.0087716 puff|0.0087716  "
		}
	}
}
