{
	"add": {
		"doc": {
			"id": "1225e458933c9651f42f52ab35c11397ac6e2afd4c0de377a5669bc9a1b4cea4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/MSU_Old_Botany_sepia.jpg/220px-MSU_Old_Botany_sepia.jpg",
				"previous": "Although the school's then-isolated location limited student housing and enrollment during the 19th century, the College had a strong reputation and produced many distinguished alumni. While the institution emphasized scientific agriculture, its graduates went into a wide variety of professions. In the 1878 report of the State Board of Agriculture, President Abbot wrote that \"Our graduates show that a love of knowledge has been infused into them by frequently returning to study or by resorting to other institutions of learning to continue their studies. They have gone from us to the University [of Michigan], to Cornell, Yale, Harvard, England, France and Germany to continue their studies.\" Abbot also identified alumni who were teaching at land grant schools such as Cornell and the University of Wisconsin–Madison, and at reputable liberal arts colleges such as Oberlin.[20]",
				"after": "Notable 19th-century graduates include the aforementioned Bailey; Charles E. St. John, a prominent early 20th century astrophysicist who was an associate of Albert Einstein; Ray Stannard Baker, a famed turn of the 20th century \"muckraker\" journalist and Pulitzer Prize winning biographer of Woodrow Wilson; and William Chandler Bagley, a pioneering education reformer. In the 1870s, foreign students began traveling to the United States to attend the Michigan State Agricultural College such that, by the 1880s, they were a significant presence on campus. In 1887, two percent (six out of 312) of the College's student population were Japanese. Among the 1880s students were Michitaro Tsuda, (B.S.1884), who went on to become a member of the Japanese emperor's Privy Council, and Minakata Kumagusu, (1888), a prominent Japanese environmental scientist.[21]",
			"color": "black|0.3168 dark|0.15235 gray|0.15235 dark|0.15235 grey|0.15235 gray|0.12158 grey|0.12158 silver|0.12069 dim|0.078305 gray|0.078305 dim|0.078305 grey|0.078305 light|0.058603 gray|0.058603 light|0.058603 grey|0.058603 gainsboro|0.036192  "
		}
	}
}
