{
	"add": {
		"doc": {
			"id": "1227e710446a54c244417df77133a6c7d21fa2ff89b734f1c9174f89d91e5cdc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Arth_tapestry2.jpg/220px-Arth_tapestry2.jpg",
			"previous": [],
				"after": "Britain came under increasing pressure from barbarian attack on all sides towards the end of the 4th century, and troops were too few to mount an effective defence. The army rebelled and, after elevating two disappointing usurpers, chose a soldier, Constantine III, to become emperor in 407. He soon crossed to Gaul with an army and was defeated by Honorius; it is unclear how many troops remained or ever returned, or whether a commander-in-chief in Britain was ever reappointed. A Saxon incursion in 408 was apparently repelled by the Britons, and in 409 Zosimus records that the natives expelled the Roman civilian administration (although Zosimus may be referring to the Bacaudic rebellion of the Breton inhabitants of Armorica since he describes how, in the aftermath of the revolt, all of Armorica and the rest of Gaul followed the example of the Brettaniai). A letter from the Emperor Honorius of 410 has traditionally been seen as a rejection of an appeal for help by the cities of Britain, but it was probably addressed to Bruttium or Bologna.[62] With the higher levels of the military and civil government gone, administration and justice fell to municipal authorities, and small warlords gradually emerged all over Britain, still aspiring to Roman ideals and conventions. Laycock has investigated this process of fragmentation and emphasised elements of continuity from the British tribes in the pre-Roman and Roman periods to the kingdoms that formed in the post-Roman period.[63]",
			"color": "tan|0.28445 dark|0.20413 slate|0.20413 gray|0.20413 burly|0.12016 wood|0.12016 dark|0.096738 khaki|0.096738 dim|0.08864 gray|0.08864 dim|0.08864 grey|0.08864 gray|0.04408 grey|0.04408 brown|0.02559 rosy|0.024406 brown|0.024406 peru|0.01886 slate|0.018786 gray|0.018786  "
		}
	}
}
