{
	"add": {
		"doc": {
			"id": "1236bdbded9ffbe86b3e7d4e7cc5078b5ba29756c6525d01f11afff23993d465",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Two_World_Trade_Center_Observation_Deck.jpg/225px-Two_World_Trade_Center_Observation_Deck.jpg",
			"previous": [],
				"after": "Although most of the space in the World Trade Center complex was off-limits to the public, the South Tower featured an indoor and outdoor public observation area called Top of the World Trade Center Observatories on its 107th and 110th floors. Visitors would pass through security checks added after the 1993 World Trade Center bombing,[117] then were whisked to the 107th floor indoor observatory at a height of 1,310 feet (400 m). The columns on each face of the building were narrowed on this level to allow 28 inches of glass between them. The Port Authority renovated the observatory in 1995, then leased it to Ogden Entertainment to operate. Attractions added to the observation deck included a simulated helicopter ride around the city. The 107th floor food court was designed with a subway car theme and featured Sbarro and Nathan's Famous Hot Dogs.[118][119] Weather permitting, visitors could take two short escalator rides up from the 107th floor viewing area to an outdoor viewing platform on the 110th floor at a height of 1,377 ft (420 m).[120] On a clear day, visitors could see up to 50 miles (80 km).[118] An anti-suicide fence was placed on the roof itself, with the viewing platform set back and elevated above it, requiring only an ordinary railing and leaving the view unobstructed, unlike the observation deck of the Empire State Building.[119]",
			"color": "light|0.17731 steel|0.17731 blue|0.17731 dark|0.12421 gray|0.12421 dark|0.12421 grey|0.12421 gray|0.11904 grey|0.11904 dim|0.10297 gray|0.10297 dim|0.10297 grey|0.10297 silver|0.098578 light|0.051053 blue|0.051053 light|0.050981 gray|0.050981 light|0.050981 grey|0.050981 light|0.037017 sky|0.037017 blue|0.037017 light|0.030554 slate|0.030554 gray|0.030554 slate|0.02798 gray|0.02798 gainsboro|0.027836 white|0.013101 smoke|0.013101 alice|0.010576 blue|0.010576 ghost|0.0098295 white|0.0098295 black|0.0098246 snow|0.0096544 sea|0.0090125 shell|0.0090125 mint|0.0089788 cream|0.0089788 white|0.0088534 azure|0.0085133 floral|0.0082088 white|0.0082088 lavender|0.0071666 lavender|0.0056836 blush|0.0056836 linen|0.00567 cadet|0.0056053 blue|0.0056053  "
		}
	}
}
