{
	"add": {
		"doc": {
			"id": "124da5bcb0d81f79115d5cbb4f7e4d30eb015c95ac046a936a01d1f7a4e76461",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Manta_alfredi_at_a_%E2%80%98cleaning_station%E2%80%99_-_journal.pone.0046170.g002B.png/220px-Manta_alfredi_at_a_%E2%80%98cleaning_station%E2%80%99_-_journal.pone.0046170.g002B.png",
				"previous": "Swimming behavior in mantas differs across habitats: when travelling over deep water, they swim at a constant rate in a straight line, while further inshore they usually bask or swim idly around. Mantas may travel alone or in groups of up to 50. They may associate with other fish species as well as sea birds and marine mammals.[19] Mantas sometimes breach, leaping partially or entirely out of the water. Individuals in a group may make aerial jumps one after the other.[11] These leaps come in three forms: forward leaps where the fish lands head first, similar jumps with a tail first re-entry or somersaults.[11] The reason for breaching is not known; possible explanations include mating rituals, birthing, communication, or the removal of parasites and commensal remoras (suckerfish).[21]:15",
				"after": "As filter feeders, manta rays consume large quantities of zooplankton in the form of shrimp, krill and planktonic crabs. An individual manta eats about 13% of its body weight each week. When foraging, it slowly swims around its prey, herding it into a tight \"ball\" and then speeds through the bunched organisms with a wide-open mouth.[19] If a ball is particularly dense, a manta may somersault through it.[21]:13 While feeding, mantas flatten their cephalic fins to channel food into their mouths and the small particles are collected by the tissue between the gill arches.[11] As many as fifty individual fish may gather at a single, plankton-rich feeding site.[11] Mantas are themselves preyed upon by large sharks and by killer whales. They may also be bitten by cookiecutter sharks,[21]:17 and harbor parasitic copepods.[21]:14",
			"color": "cadet|0.26018 blue|0.26018 dark|0.19129 gray|0.19129 dark|0.19129 grey|0.19129 silver|0.089312 sky|0.080039 blue|0.080039 steel|0.06684 blue|0.06684 light|0.060252 gray|0.060252 light|0.060252 grey|0.060252 gainsboro|0.045758 gray|0.044894 grey|0.044894 light|0.03551 blue|0.03551 dark|0.020867 slate|0.020867 gray|0.020867 slate|0.019153 gray|0.019153 dim|0.019003 gray|0.019003 dim|0.019003 grey|0.019003 light|0.01696 slate|0.01696 gray|0.01696 powder|0.013344 blue|0.013344  "
		}
	}
}
