{
	"add": {
		"doc": {
			"id": "126012da24d07366f7b3a6062d7f39fa06fea847e4fbe6ce8bf22edab5a2d53b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/B-52D%28061127-F-1234S-017%29.jpg/220px-B-52D%28061127-F-1234S-017%29.jpg",
				"previous": "During the 1950s, the United States experienced prolonged prosperity and solidified its place as a world leader. Public Administration experienced a kind of heyday due to the successful war effort and successful post war reconstruction in Western Europe and Japan. Government was popular as was President Eisenhower. In the 1960s and 1970s, government itself came under fire as ineffective, inefficient, and largely a wasted effort. The costly American intervention in Vietnam along with domestic scandals including the bugging of Democratic party headquarters (the 1974 Watergate scandal) are two examples of self-destructive government behavior that alienated citizens.",
				"after": "There was a call by citizens for efficient administration to replace ineffective, wasteful bureaucracy. Public administration would have to distance itself from politics to answer this call and remain effective. Elected officials supported these reforms. The Hoover Commission, chaired by University of Chicago professor Louis Brownlow, to examine reorganization of government. Brownlow subsequently founded the Public Administration Service (PAS) at the university, an organization which has provided consulting services to all levels of government until the 1970s.[citation needed]",
			"color": "light|0.18717 slate|0.18717 gray|0.18717 silver|0.15861 black|0.13986 slate|0.13613 gray|0.13613 dark|0.11254 gray|0.11254 dark|0.11254 grey|0.11254 light|0.094941 gray|0.094941 light|0.094941 grey|0.094941 gainsboro|0.055025 light|0.02932 steel|0.02932 blue|0.02932 gray|0.025162 grey|0.025162 light|0.015581 blue|0.015581 dim|0.010236 gray|0.010236 dim|0.010236 grey|0.010236 white|0.0046468 smoke|0.0046468 alice|0.0043759 blue|0.0043759 dark|0.0043013 slate|0.0043013 gray|0.0043013  "
		}
	}
}
