{
	"add": {
		"doc": {
			"id": "1264028268c66715b58792c9a1cec2ffdea6423a5b9c81a52a1b0cd70338e52d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Pink-house-charleston-sc1.jpg/220px-Pink-house-charleston-sc1.jpg",
				"previous": "The early settlement was often subject to attack from sea and land, including periodic assaults from Spain and France (both of whom contested England's claims to the region), and pirates. These were combined with raids by Native Americans, who violently resisted further expansion of the settlement. The heart of the city was fortified according to a 1704 plan by Governor Johnson. Except those fronting Cooper River, the walls were largely removed during the 1720s.",
				"after": "The first settlers primarily came from England, its Caribbean colony of Barbados, and its Atlantic colony of Bermuda. Among these were free people of color, born in the West Indies of alliances and marriages between Africans and English, when color lines were looser among the working class in the early colonial years, and some wealthy whites took black consorts or concubines.[11] Charles Town attracted a mixture of ethnic and religious groups. French, Scottish, Irish, and Germans migrated to the developing seacoast town, representing numerous Protestant denominations. Because of the battles between English royalty and the Roman Catholic Church, practicing Catholics were not allowed to settle in South Carolina until after the American Revolution. Jews were allowed, and Sephardic Jews migrated to the city in such numbers that by the beginning of the 19th century, the city was home to the largest and wealthiest Jewish community in North America—a status it held until about 1830.[12]",
			"color": "black|0.2177 rosy|0.19702 brown|0.19702 dim|0.18825 gray|0.18825 dim|0.18825 grey|0.18825 gray|0.10157 grey|0.10157 dark|0.057227 gray|0.057227 dark|0.057227 grey|0.057227 silver|0.027318 misty|0.021241 rose|0.021241 light|0.019616 gray|0.019616 light|0.019616 grey|0.019616 gainsboro|0.018269 slate|0.012223 gray|0.012223 lavender|0.011966 blush|0.011966 light|0.010171 coral|0.010171 white|0.009699 smoke|0.009699 sea|0.0090303 shell|0.0090303 linen|0.0084788 dark|0.0073128 olive|0.0073128 green|0.0073128 snow|0.0072742 dark|0.0067664 salmon|0.0067664  "
		}
	}
}
