{
	"add": {
		"doc": {
			"id": "126b20cdb5faec0af176c102df99e68710f7b6dc62b968cc024c6b67caad8d96",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/AmericanBlackVultureFlock.jpg/220px-AmericanBlackVultureFlock.jpg",
			"previous": [],
				"after": "It soars high while searching for food, holding its wings horizontally when gliding. It flaps in short bursts which are followed by short periods of gliding.[38] Its flight is less efficient than that of other vultures, as the wings are not as long, forming a smaller wing area.[39] In comparison with the turkey vulture, the black vulture flaps its wings more frequently during flight. It is known to regurgitate when approached or disturbed, which assists in predator deterrence and taking flight by decreasing its takeoff weight. Like all New World vultures, the black vulture often defecates on its own legs, using the evaporation of the water in the feces and/or urine to cool itself, a process known as urohidrosis.[3] It cools the blood vessels in the unfeathered tarsi and feet, and causes white uric acid to streak the legs. Because it lacks a syrinx, the black vulture, like other New World vultures, has very few vocalization capabilities.[3] It is generally silent, but can make hisses and grunts when agitated or while feeding. The black vulture is gregarious, and roosts in large groups.[40] In areas where their ranges overlap, the black vulture will roost on the bare branches of dead trees alongside groups of turkey vultures.[39] The black vulture generally forages in groups; a flock of black vultures can easily drive a rival turkey vulture, which is generally solitary while foraging, from a carcass.[40]",
			"color": "black|0.62567 dim|0.043709 gray|0.043709 dim|0.043709 grey|0.043709 rosy|0.033132 brown|0.033132 dark|0.028025 gray|0.028025 dark|0.028025 grey|0.028025 gray|0.027361 grey|0.027361 silver|0.018443 misty|0.016562 rose|0.016562 light|0.015489 gray|0.015489 light|0.015489 grey|0.015489 sea|0.015162 shell|0.015162 snow|0.014445 white|0.013805 smoke|0.013805 floral|0.013696 white|0.013696 linen|0.013178 white|0.012933 lavender|0.011729 blush|0.011729 gainsboro|0.011708 mint|0.010178 cream|0.010178 ghost|0.009456 white|0.009456 old|0.0086223 lace|0.0086223 ivory|0.0082883 tan|0.0068178  "
		}
	}
}
