{
	"add": {
		"doc": {
			"id": "129083627b1189e52fe030b97886f2fd9aac6904de16d34e943fc25b324d318c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Cs-137-decay.svg/250px-Cs-137-decay.svg.png",
				"previous": "Caesium has a total of 39 known isotopes that range in their mass number (i.e. number of nucleons in its nucleus) from 112 to 151. Several of these are synthesized from lighter elements by the slow neutron capture process (S-process) inside old stars,[42] as well as inside supernova explosions (R-process).[43] However, the only stable caesium isotope is 133Cs, which has 78 neutrons. Although it has a large nuclear spin (7⁄2+), nuclear magnetic resonance studies can be done with this isotope at a resonating frequency of 11.7 MHz.[44]",
				"after": "The radioactive 135Cs has a very long half-life of about 2.3 million years, longest of all radioactive isotopes of caesium. 137Cs and 134Cs have half-lives of 30 and two years, respectively. 137Cs decomposes to a short-lived 137mBa by beta decay, and then to nonradioactive barium, while 134Cs transforms into 134Ba directly. The isotopes with mass numbers of 129, 131, 132 and 136, have half-lives between a day and two weeks, while most of the other isotopes have half-lives from a few seconds to fractions of a second. There are at least 21 metastable nuclear isomers. Other than 134mCs (with a half-life of just under 3 hours), all are very unstable and decay with half-lives of a few minutes or less.[45][46]",
			"color": "white|0.095529 smoke|0.095529 white|0.095397 ghost|0.095025 white|0.095025 snow|0.095021 alice|0.094649 blue|0.094649 mint|0.09456 cream|0.09456 azure|0.094026 sea|0.093596 shell|0.093596 floral|0.09317 white|0.09317 lavender|0.090813 blush|0.090813 lavender|0.0066334 dark|0.005795 gray|0.005795 dark|0.005795 grey|0.005795 gray|0.0050132 grey|0.0050132 dim|0.0047552 gray|0.0047552 dim|0.0047552 grey|0.0047552 silver|0.0044498 light|0.0038442 gray|0.0038442 light|0.0038442 grey|0.0038442 corn|0.0037743 flower|0.0037743 blue|0.0037743 gainsboro|0.0034481 dodger|0.0033874 blue|0.0033874 ivory|0.0033862 misty|0.0028789 rose|0.0028789  "
		}
	}
}
