{
	"add": {
		"doc": {
			"id": "129ec241c99938c47027101e76c1ac5f9ce586be09540b5e4e17fae3ab9e1691",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Aeroflot_Tupolev_Tu-144_Paris_Air_Show_1975_Gilliand.jpg/220px-Aeroflot_Tupolev_Tu-144_Paris_Air_Show_1975_Gilliand.jpg",
				"previous": "Andrei N. Tupolev[1] continued to improve the Tu-144 with upgrades and changes on the Tu-144 prototype. While both Concorde and the Tu-144 prototype had ogival delta wings, the Tu-144's wing lacked Concorde's conical camber. Production Tu-144s replaced this wing with a double delta wing including such conical camber,[citation needed] and they added a simple but practical device: two small retractable canard surfaces, one on either side of the forward section on the aircraft, to increase lift at low speeds.",
				"after": "Moving the elevons downward in a delta-wing aircraft increases the lift (force), but also pitches its nose downward. The canards cancel out this nose-downwards moment, thus reducing the landing speed of the production Tu-144s to 315–333 km/h (196–207 mph; 170–180 kn), still faster than that of Concorde.[2] The NASA study lists final approach speeds during Tu-144LL test flights as 315–335 km/h (196–208 mph; 170–181 kn), however these were approach speeds exercised during test flights specifically intended to study landing effects at maximum possible range of speeds, regardless of how hard and stable the landing can be. As to regular landings, FAA circular lists Tu-144S approach speed as 329 km/h (204 mph; 178 kn), as opposed to Concorde's approach speed of 300 km/h (190 mph; 160 kn), based on the characteristics declared by the manufacturers to Western regulatory bodies.[3] It is open to argument how stable the Tu-144S was at the listed airspeed. In any event, when NASA subcontracted Tupolev bureau in the 1990s to convert one of the remaining Tu-144D to a Tu-144LL standard, the procedure set by Tupolev for landing defined the Tu-144LL \"final approach speed... on the order of 360 km/hr depending on fuel weight.\"[4] Brian Calvert, Concorde's technical flight manager and its first commercial pilot in command for several inaugural flights, cites final approach speed of a typical Concorde landing to be 287–296 km/h (178–184 mph; 155–160 kn).[5] The lower landing speed compared to Tu-144 is due to Concorde's more refined design of the wing profile that provides higher lift at low speeds without degrading supersonic cruise (aeronautics) performance – a feature often mentioned in Western publications on Concorde and acknowledged by Tupolev designers as well.[6]",
			"color": "dark|0.10629 gray|0.10629 dark|0.10629 grey|0.10629 black|0.10542 dim|0.094098 gray|0.094098 dim|0.094098 grey|0.094098 gray|0.082104 grey|0.082104 silver|0.080961 light|0.066168 gray|0.066168 light|0.066168 grey|0.066168 gainsboro|0.057764 lavender|0.03548 white|0.035177 smoke|0.035177 alice|0.034888 blue|0.034888 ghost|0.033417 white|0.033417 light|0.030256 steel|0.030256 blue|0.030256 snow|0.027266 light|0.026845 slate|0.026845 gray|0.026845 white|0.024634 lavender|0.022035 blush|0.022035 azure|0.021873 mint|0.020658 cream|0.020658 slate|0.019595 gray|0.019595 sea|0.018612 shell|0.018612 floral|0.015388 white|0.015388  "
		}
	}
}
