{
	"add": {
		"doc": {
			"id": "12a7a4cf96198ead8f7c633e6978f588a9ca46d224f360f01dcccf0940d8b4e1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/David_Fincher_%282012%29_3.jpg/170px-David_Fincher_%282012%29_3.jpg",
			"previous": [],
				"after": "The music video was directed by David Fincher and filmed in April 1989, at Culver Studios in Culver City, California.[56] It was produced by Gregg Fienberg, under Propaganda Films, with editing by Scott Chestnut, principal photography by Mark Plummer, and Vance Lorenzini as the production designer.[56] \"Express Yourself\" music video was inspired by the Fritz Lang classic film Metropolis (1927), and featured an epigraph at the end of the video from the film: \"Without the Heart, there can be no understanding between the hand and the mind\".[56] The video marked the first appearance of the Shep Pettibone remix of the song. It had a total budget of $5 million ($9.51 million in 2015 dollars[2]), which made it the most expensive music video in history at the time it was made, and currently the third most expensive of all time.[57][58] \"Express Yourself\" had its world-premiere on May 17, 1989, on MTV and was an MTV exclusive for three weeks, being aired every hour on the music channel.[58] The concept of the video was to portray Madonna as a glamorous lady and chained masochist, with muscular men acting as her workers. In the end, she picks one of them—played by model Cameron Alborzian—as her date.[58][59] When Fincher explained this concept to Madonna, she was intrigued and decided to portray a masculine persona.[60] She was dating actor Warren Beatty at that time, and asked him to play the part of a slave working at a factory; Beatty politely refused, saying later that \"Madonna wanted the video as a show case of her sexual prowess, I never wanted to be a part of it.\"[60] She then thought about Metropolis and of its scenes displaying factory workers and a city with tall skyscrapers. Fincher liked the concept and it became the main backdrop for the video. In Madonna 'Talking': Madonna in Her Own Words, she commented about the development of the video.",
			"color": "black|0.56494 sienna|0.058447 dark|0.055395 salmon|0.055395 light|0.031678 gray|0.031678 light|0.031678 grey|0.031678 gainsboro|0.029245 silver|0.024816 dark|0.018776 gray|0.018776 dark|0.018776 grey|0.018776 white|0.018371 smoke|0.018371 snow|0.015244 sea|0.015092 shell|0.015092 ghost|0.015064 white|0.015064 dim|0.014845 gray|0.014845 dim|0.014845 grey|0.014845 alice|0.013458 blue|0.013458 white|0.013325 lavender|0.013146 blush|0.013146 floral|0.012556 white|0.012556 lavender|0.011349 mint|0.011241 cream|0.011241 gray|0.01086 grey|0.01086 linen|0.0092776 azure|0.0087848 tan|0.0067476  "
		}
	}
}
