{
	"add": {
		"doc": {
			"id": "12ab7a7bcacdfe0d13f140bd7c0bfbd850ba7c5b837516eca411555e36778184",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Chewpumpingstation.JPG/220px-Chewpumpingstation.JPG",
			"previous": [],
				"after": "Plans for the building of the reservoir were under discussion before the Second World War, and an Act of Parliament submitted by the Bristol Waterworks Company was passed in 1939. Following this, farms were bought by the company and farmed by the previous owners as tenancies. Farms and buildings still remaining in private hands were acquired by compulsory purchase. The sanction for construction was given in 1949 and the contract awarded to A.E. Farr & Co., who employed approximately 300 people on the site. The main dam was initially stabilised by injecting concrete into the cracks in the bedrock. The core of the dam was made of puddled clay mixed with sand. This was the first time the gain in strength brought about by the use of sand drains had been quantified.[11] The lake was inaugurated by Queen Elizabeth II, accompanied by Prince Philip, with the unveiling of a commemorative stone and plaque, which can be seen from the dam, on 17 April 1956, although it was not full until 25 February 1958.[8] Flowers were presented to the Queen at the opening of Chew Valley Lake by Judith Blair Brown, daughter of Kennedy Brown, who worked at Bristol Water Works at the time of construction of the lake.",
			"color": "dark|0.16044 gray|0.16044 dark|0.16044 grey|0.16044 dim|0.13239 gray|0.13239 dim|0.13239 grey|0.13239 lavender|0.12175 gray|0.11651 grey|0.11651 silver|0.076579 light|0.046758 gray|0.046758 light|0.046758 grey|0.046758 dark|0.044173 olive|0.044173 green|0.044173 black|0.038739 lavender|0.03782 blush|0.03782 gainsboro|0.034919 ghost|0.032765 white|0.032765 alice|0.024298 blue|0.024298 white|0.020191 smoke|0.020191 thistle|0.019859 slate|0.018139 gray|0.018139 snow|0.017129 white|0.01285 light|0.011124 slate|0.011124 gray|0.011124 sea|0.008978 shell|0.008978  "
		}
	}
}
