{
	"add": {
		"doc": {
			"id": "12bbeeae03edf01ae7637a3682a3cf4ddf1ef7c1f9fb3da0a36218c5d4d337b4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Gros_-_Napoleon_on_the_Battlefield_of_Eylau_cropped.png/170px-Gros_-_Napoleon_on_the_Battlefield_of_Eylau_cropped.png",
				"previous": "In its insistence on portraying an unpleasant truth, The Raft of the Medusa was a landmark in the emerging Romantic movement in French painting, and \"laid the foundations of an aesthetic revolution\"[61] against the prevailing Neoclassical style. Géricault's compositional structure and depiction of the figures are classical, but the contrasting turbulence of the subject represents a significant change in artistic direction and creates an important bridge between Neoclassical and Romantic styles. By 1815, Jacques-Louis David, then in exile in Brussels, was both the leading proponent of the popular history painting genre, which he had perfected, and a master of the Neoclassical style.[62] In France, both history painting and the Neoclassical style continued through the work of Antoine-Jean Gros, Jean Auguste Dominique Ingres, François Gérard, Anne-Louis Girodet de Roussy-Trioson, Pierre-Narcisse Guérin—teacher of both Géricault and Delacroix—and other artists who remained committed to the artistic traditions of David and Nicolas Poussin.",
				"after": "In his introduction to The Journal of Eugène Delacroix, Hubert Wellington wrote about Delacroix's opinion of the state of French painting just prior to the Salon of 1819. According to Wellington, \"The curious blend of classic with realistic outlook which had been imposed by the discipline of David was now losing both animation and interest. The master himself was nearing his end, and exiled in Belgium. His most docile pupil, Girodet, a refined and cultivated classicist, was producing pictures of astonishing frigidity. Gérard, immensely successful painter of portraits under the Empire—some of them admirable—fell in with the new vogue for large pictures of history, but without enthusiasm.\"[33]",
			"color": " "
		}
	}
}
