{
	"add": {
		"doc": {
			"id": "12c21a5fc5881d7468db1f2a851b83c170dcaad1dc4fb4599c32cc3e94017caa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Vikramjit-Kakati-Rumtek.jpg/220px-Vikramjit-Kakati-Rumtek.jpg",
				"previous": "Apart from the major religious festivals of Dashain, Tihar, Christmas, Holi etc., the diverse ethnic populace of the town celebrates several local festivals. The Lepchas and Bhutias celebrate new year in January, while Tibetans celebrate the new year (Losar) with \"Devil Dance\" in January–February. The Maghe sankranti, Ram Navami are some of the important Nepalese festivals. Chotrul Duchen, Buddha Jayanti, the birthday of the Dalai Lama, Loosong, Bhumchu, Saga Dawa, Lhabab Duechen and Drupka Teshi are some other festivals, some distinct to local culture and others shared with the rest of India, Nepal, Bhutan and Tibet.[18][45]",
				"after": "A popular food in Gangtok is the momo,[46] a steamed dumpling containing pork, beef and vegetables cooked in a doughy wrapping and served with watery soup. Wai-Wai is a packaged snack consisting of noodles which are eaten either dry or in soup form. A form of noodle called thukpa,[46] served in soup form is also popular in Gangtok. Other noodle-based foods such as the chowmein, thenthuk, fakthu, gyathuk and wonton are available. Other traditional Sikkimese cuisine include shah-phaley (Sikkimese patties with spiced minced meat in a crisp samosa-like case) and Gack-ko soup.[47] Restaurants offer a wide variety of traditional Indian, continental and Chinese cuisines to cater to the tourists. Churpee, a kind of hard cheese made from cow's or yak's milk is sometimes chewed. Chhang is a local frothy millet beer traditionally served in bamboo tankards and drunk through bamboo or cane straws.[47] Alcohol is cheap due to low excise duty in Sikkim. Beer, whiskey, rum and brandy are frequently consumed by both locals and non-locals.",
			"color": "burly|0.074475 wood|0.074475 light|0.061129 gray|0.061129 light|0.061129 grey|0.061129 gainsboro|0.055207 black|0.053585 silver|0.050017 dim|0.049869 gray|0.049869 dim|0.049869 grey|0.049869 dark|0.048876 gray|0.048876 dark|0.048876 grey|0.048876 tan|0.044763 gray|0.037532 grey|0.037532 dark|0.033875 salmon|0.033875 dark|0.032336 golden|0.032336 rod|0.032336 dark|0.025609 slate|0.025609 gray|0.025609 linen|0.025589 white|0.02544 smoke|0.02544 navajo|0.019122 white|0.019122 sea|0.018429 shell|0.018429 peach|0.018163 puff|0.018163 sienna|0.017855 floral|0.014096 white|0.014096 snow|0.013852 mint|0.012482 cream|0.012482 golden|0.011778 rod|0.011778 dark|0.011285 khaki|0.011285  "
		}
	}
}
