{
	"add": {
		"doc": {
			"id": "12c2ffc06f463daefbfa138ebc37ca40aaa563a0135085501435585516432d69",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Surfing_Star_Dune.JPG/250px-Surfing_Star_Dune.JPG",
				"previous": "Sightseeing is available by personal automobile, four-wheel drive, bicycle, mountain bike (on established roadways only), and hiking. Riding through the park on motorcycle is also a popular pastime.[42] State Route 190, the Badwater Road, the Scotty's Castle Road, and paved roads to Dante's View and Wildrose provide access to the major scenic viewpoints and historic points of interest. More than 350 miles (560 km) of unpaved and four-wheel-drive roads provide access to wilderness hiking, camping, and historical sites.[43] All vehicles must be licensed and street legal. There are hiking trails of varying lengths and difficulties, but most backcountry areas are accessible only by cross-country hiking. There are literally thousands of hiking possibilities. The normal season for visiting the park is from October 15 to May 15, because of summer extremes in temperature. Costumed living history tours of the historic Death Valley Scotty's Castle are conducted for a fee.",
				"after": "There are nine designated campgrounds within the park, and overnight backcountry camping permits are available at the Visitor Center.[44] Xanterra Parks & Resorts owns and operates a private resort, the Furnace Creek Inn and Ranch Resort,[27] which comprises two separate and distinct hotels: the Furnace Creek Inn is a four-star historic hotel, and the Furnace Creek Ranch is a three-star ranch-style property reminiscent of the mining and prospecting days. Death Valley Lodging Company operates the Stovepipe Wells Village motel. Stovepipe Wells Village is the only authorized concession operations located in Death Valley National Park. There are a few motels near various entrances to the park, in Shoshone, Death Valley Junction, Beatty, Nevada, and Panamint Springs.",
			"color": "gray|0.77079 grey|0.77079  "
		}
	}
}
