{
	"add": {
		"doc": {
			"id": "12cb1d34c20533a29cd018dab9610d42c7f3f3407b7aac7cf0a871da8ea41274",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/BMI_737-500_G-BVZH.jpg/220px-BMI_737-500_G-BVZH.jpg",
				"previous": "In 1999, SAS sold half of its 40% stake in British Midland to Lufthansa, which was seeking a stronger position at London Heathrow, following which British Midland joined Star Alliance. At the time, British Midland chairman Sir Michael Bishop owned a 50% share of the company. Between 1999 and 2004, Lufthansa sought to sell some or all of its share in the airline. Virgin Atlantic hoped to buy the shares to then merge both airlines, as BMI was already Virgin's preferred feeder airline into Heathrow. Virgin argued that the merger would have brought together two airlines with combined ticket sales of more than £2 billion, forming a powerful force in the aviation industry. BMI was believed to have initiated the talks after it began losing money following the 11 September 2001 attacks. A merger would have strengthened Virgin Atlantic's base at Heathrow, where BMI had hundreds of highly valued take-off and landing slots, to increase the competition with British Airways.[48]",
				"after": "The two airlines combined would have had 17% of Heathrow slots against British Airways' 43%. Worried about the increased competition it would face if such a merger went ahead, British Airways considered the takeover of either BMI or Virgin Atlantic to stop the merger. British Airways concluded it would be easier to take over the financially weaker and less high-profile BMI. However, in 2004 talks of any merger of the three airlines ended. In late 2006, the airline again dismissed renewed speculation that Virgin Atlantic was preparing to make a bid to acquire full control of BMI, despite Sir Richard Branson repeating in a radio interview that such a merger would be a logical business move.[49]",
			"color": "light|0.21734 slate|0.21734 gray|0.21734 dark|0.20875 gray|0.20875 dark|0.20875 grey|0.20875 gray|0.16827 grey|0.16827 slate|0.15495 gray|0.15495 dim|0.094724 gray|0.094724 dim|0.094724 grey|0.094724 silver|0.027291 light|0.024356 gray|0.024356 light|0.024356 grey|0.024356 gainsboro|0.019591 misty|0.0099197 rose|0.0099197 linen|0.0086281 antique|0.0072895 white|0.0072895 sea|0.0054146 shell|0.0054146 black|0.0048357 steel|0.0047113 blue|0.0047113 light|0.0045636 steel|0.0045636 blue|0.0045636 dark|0.0041982 slate|0.0041982 gray|0.0041982 old|0.0041625 lace|0.0041625 white|0.0038185 smoke|0.0038185 lavender|0.0037215 blush|0.0037215  "
		}
	}
}
