{
	"add": {
		"doc": {
			"id": "12dbd94fec388452d16e79d76a1c270a33d11cfca7a05d4178d32e79df1931f4",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f4/Utopia_Limited_Poster.jpg/300px-Utopia_Limited_Poster.jpg",
				"previous": "Gilbert brought suit, and after The Gondoliers closed in 1891, he withdrew the performance rights to his libretti, vowing to write no more operas for the Savoy.[71] Gilbert next wrote The Mountebanks with Alfred Cellier and the flop Haste to the Wedding with George Grossmith,[29] and Sullivan wrote Haddon Hall with Sydney Grundy. Gilbert eventually won the lawsuit and felt vindicated, but his actions and statements had been hurtful to his partners. Nevertheless, the partnership had been so profitable that, after the financial failure of the Royal English Opera House, Carte and his wife sought to reunite the author and composer.[71]",
				"after": "In 1891, after many failed attempts at reconciliation by the pair, Tom Chappell, the music publisher responsible for printing the Gilbert and Sullivan operas, stepped in to mediate between two of his most profitable artists, and within two weeks had succeeded.[72] Two more operas resulted: Utopia, Limited (1893) and The Grand Duke (1896). Gilbert also offered a third libretto to Sullivan (His Excellency, 1894), but Gilbert's insistence on casting Nancy McIntosh, his protegée from Utopia, led to Sullivan's refusal.[73] Utopia, concerning an attempt to \"anglicise\" a south Pacific island kingdom, was only a modest success, and The Grand Duke, in which a theatrical troupe, by means of a \"statutory duel\" and a conspiracy, takes political control of a grand duchy, was an outright failure. After that, the partnership ended for good.[74] Sullivan continued to compose comic opera with other librettists but died four years later. In 1904, Gilbert would write, \"...Savoy opera was snuffed out by the deplorable death of my distinguished collaborator, Sir Arthur Sullivan. When that event occurred, I saw no one with whom I felt that I could work with satisfaction and success, and so I discontinued to write libretti.\"[75]",
			"color": "black|0.28258 dim|0.097015 gray|0.097015 dim|0.097015 grey|0.097015 gray|0.078532 grey|0.078532 dark|0.063037 gray|0.063037 dark|0.063037 grey|0.063037 silver|0.040026 tan|0.036615 light|0.028255 gray|0.028255 light|0.028255 grey|0.028255 gainsboro|0.021074 antique|0.019703 white|0.019703 slate|0.016505 gray|0.016505 linen|0.015769 burly|0.015436 wood|0.015436 wheat|0.014426 light|0.014353 slate|0.014353 gray|0.014353 old|0.012376 lace|0.012376 sea|0.01187 shell|0.01187 sienna|0.0112 floral|0.011093 white|0.011093 papaya|0.010273 whip|0.010273 rosy|0.0096168 brown|0.0096168 white|0.0095251 smoke|0.0095251 blanched|0.0089972 almond|0.0089972 light|0.0089607 blue|0.0089607 beige|0.0089348 bisque|0.0082906 moccasin|0.0082065 navajo|0.0079969 white|0.0079969 ivory|0.0079137 saddle|0.0077138 brown|0.0077138 snow|0.007475 pale|0.0073174 golden|0.0073174 rod|0.0073174 corn|0.0070234 silk|0.0070234  "
		}
	}
}
