{
	"add": {
		"doc": {
			"id": "12e37ca7cdf371772092a3c8d3f58e39019daf5c3c8aa860f7d737b12d5f78fc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Arm%C3%A9e_de_l%27Air_Rafale_C.jpg/170px-Arm%C3%A9e_de_l%27Air_Rafale_C.jpg",
				"previous": "The primary characteristics of this sub-generation are the application of advanced digital avionics and aerospace materials, modest signature reduction (primarily RF \"stealth\"), and highly integrated systems and weapons. These fighters have been designed to operate in a \"network-centric\" battlefield environment and are principally multirole aircraft. Key weapons technologies introduced include beyond-visual-range (BVR) AAMs; Global Positioning System (GPS)-guided weapons, solid-state phased-array radars; helmet-mounted sights; and improved secure, jamming-resistant datalinks. Thrust vectoring to further improve transient maneuvering capabilities has also been adopted by many 4.5th generation fighters, and uprated powerplants have enabled some designs to achieve a degree of \"supercruise\" ability. Stealth characteristics are focused primarily on frontal-aspect radar cross section (RCS) signature-reduction techniques including radar-absorbent materials (RAM), L-O coatings and limited shaping techniques.",
				"after": "\"Half-generation\" designs are either based on existing airframes or are based on new airframes following similar design theory as previous iterations; however, these modifications have introduced the structural use of composite materials to reduce weight, greater fuel fractions to increase range, and signature reduction treatments to achieve lower RCS compared to their predecessors. Prime examples of such aircraft, which are based on new airframe designs making extensive use of carbon-fibre composites, include the Eurofighter Typhoon, Dassault Rafale, and Saab JAS 39 Gripen.",
			"color": "dim|0.38675 gray|0.38675 dim|0.38675 grey|0.38675 gray|0.22911 grey|0.22911 slate|0.13117 gray|0.13117 light|0.087931 slate|0.087931 gray|0.087931 light|0.042214 steel|0.042214 blue|0.042214 black|0.035026 dark|0.028678 slate|0.028678 gray|0.028678 dark|0.025887 gray|0.025887 dark|0.025887 grey|0.025887 silver|0.0087748  "
		}
	}
}
