{
	"add": {
		"doc": {
			"id": "12e6f98239228d190d0f2413ccbe7a2eea7d69ef7ea7e8ed647fe31c88f576b6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/MichaelNovak.jpg/220px-MichaelNovak.jpg",
				"previous": "Cuninggim also charged that Stanford's religious policies were inadequate compared to other prominent U.S. universities. Harvey speculated that if Stanford had established a seminary like other prestigious universities, its religious studies department and the \"ethos\" of the entire institution would be different.[5] In 1966, however, the Board of Trustees got a court order that allowed them to change the non-sectarian clause in Stanford's charter so that they could expand the university's religious program, which included permitting sectarian worship services at Stanford Memorial Church.[31]",
				"after": "Stanford did not employ a full-time professor in religion until 1951 and did not establish a religious studies department until 1973, later than most other universities in the U.S. Earlier courses in religion were largely offered by the chaplains of Stanford Memorial Church. David Charles Gardner offered a course in Biblical history and literature beginning in 1907, and by 1910, he was teaching New Testament Greek and Bible classes. Gardner's successor, D. Elton Trueblood, taught classes about the philosophy of religion. In 1941 Trueblood's efforts to expand the study of religion resulted in the creation of a minor in religion, as well as twenty-one courses offered by him and four faculty members. By 1960, the chaplains of Stanford Memorial Church no longer had to run the program, which had expanded to allow students the option of majoring in the study of religion.[32] By the mid-1960s, the religious studies program at Stanford was enjoying \"enormous success\".[33]",
			"color": "saddle|0.38306 brown|0.38306 sienna|0.077259 peru|0.046468 light|0.041943 salmon|0.041943 dark|0.032326 orange|0.032326 light|0.030036 coral|0.030036 sandy|0.028608 brown|0.028608 orange|0.0278 tan|0.026456 dark|0.026022 salmon|0.026022 misty|0.025048 rose|0.025048 chocolate|0.021658 burly|0.017634 wood|0.017634  "
		}
	}
}
