{
	"add": {
		"doc": {
			"id": "12e73d0eaf904a3a610bea9c0040d36e23dee148d7d0eeeb69f2721bd2db6597",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/NationalIndoorArena.jpg/220px-NationalIndoorArena.jpg",
				"previous": "Seven times County Championship winners Warwickshire County Cricket Club play at Edgbaston Cricket Ground, which also hosts test cricket and one day internationals and is the largest cricket ground in the United Kingdom after Lord's.[277] Edgbaston was the scene of the highest ever score by a batsman in first-class cricket, when Brian Lara scored 501 not out for Warwickshire in 1994.[278] Birmingham has a professional Rugby Union club, Moseley R.F.C., who play at Billesley Common; with a second professional club, Birmingham & Solihull R.F.C., playing at Damson Park in the neighbouring borough of Solihull. The city also has a rugby league club, the Birmingham Bulldogs, who compete in the Co-operative RLC Midlands Premier League (RLC). The city is also home to one of the oldest American Football teams in the BAFA National Leagues, the Birmingham Bulls.",
				"after": "Two major championship golf courses lie on the city's outskirts. The Belfry near Sutton Coldfield is the headquarters of the Professional Golfers' Association[279] and has hosted the Ryder Cup more times than any other venue.[280] The Forest of Arden Hotel and Country Club near Birmingham Airport is also a regular host of tournaments on the PGA European Tour, including the British Masters and the English Open.[281]",
			"color": "dark|0.27316 salmon|0.27316 dark|0.094556 slate|0.094556 gray|0.094556 powder|0.07991 blue|0.07991 cadet|0.07643 blue|0.07643 light|0.065646 salmon|0.065646 dim|0.040995 gray|0.040995 dim|0.040995 grey|0.040995 dark|0.03886 gray|0.03886 dark|0.03886 grey|0.03886 silver|0.031917 gray|0.029827 grey|0.029827 light|0.024576 blue|0.024576 tan|0.024401 pale|0.019828 turquoise|0.019828 light|0.018481 gray|0.018481 light|0.018481 grey|0.018481 rosy|0.016917 brown|0.016917 dark|0.013655 khaki|0.013655 gainsboro|0.011647 slate|0.011238 gray|0.011238 light|0.010986 slate|0.010986 gray|0.010986 burly|0.01064 wood|0.01064 khaki|0.010241 light|0.010003 cyan|0.010003 sandy|0.0099692 brown|0.0099692 peru|0.0072805  "
		}
	}
}
