{
	"add": {
		"doc": {
			"id": "12fe5f4265faeccd6d94481f858ea1ae53415e12715aeb41b4ecf2f99f78559b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Moreno_Sociogram_2nd_Grade.png/220px-Moreno_Sociogram_2nd_Grade.png",
				"previous": "In the late 1890s, both Émile Durkheim and Ferdinand Tönnies foreshadowed the idea of social networks in their theories and research of social groups. Tönnies argued that social groups can exist as personal and direct social ties that either link individuals who share values and belief (Gemeinschaft, German, commonly translated as \"community\") or impersonal, formal, and instrumental social links (Gesellschaft, German, commonly translated as \"society\").[7] Durkheim gave a non-individualistic explanation of social facts, arguing that social phenomena arise when interacting individuals constitute a reality that can no longer be accounted for in terms of the properties of individual actors.[8] Georg Simmel, writing at the turn of the twentieth century, pointed to the nature of networks and the effect of network size on interaction and examined the likelihood of interaction in loosely knit networks rather than groups.[9]",
				"after": "Major developments in the field can be seen in the 1930s by several groups in psychology, anthropology, and mathematics working independently.[6][10][11] In psychology, in the 1930s, Jacob L. Moreno began systematic recording and analysis of social interaction in small groups, especially classrooms and work groups (see sociometry). In anthropology, the foundation for social network theory is the theoretical and ethnographic work of Bronislaw Malinowski,[12] Alfred Radcliffe-Brown,[13][14] and Claude Lévi-Strauss.[15] A group of social anthropologists associated with Max Gluckman and the Manchester School, including John A. Barnes,[16] J. Clyde Mitchell and Elizabeth Bott Spillius,[17][18] often are credited with performing some of the first fieldwork from which network analyses were performed, investigating community networks in southern Africa, India and the United Kingdom.[6] Concomitantly, British anthropologist S.F. Nadel codified a theory of social structure that was influential in later network analysis.[19] In sociology, the early (1930s) work of Talcott Parsons set the stage for taking a relational approach to understanding social structure.[20][21] Later, drawing upon Parsons' theory, the work of sociologist Peter Blau provides a strong impetus for analyzing the relational ties of social units with his work on social exchange theory.[22][23][24] By the 1970s, a growing number of scholars worked to combine the different tracks and traditions. One group consisted of sociologist Harrison White and his students at the Harvard University Department of Social Relations. Also independently active in the Harvard Social Relations department at the time were Charles Tilly, who focused on networks in political and community sociology and social movements, and Stanley Milgram, who developed the \"six degrees of separation\" thesis.[25]Mark Granovetter[26] and Barry Wellman[27] are among the former students of White who elaborated and championed the analysis of social networks.[28][29][30][31]",
			"color": "light|0.47829 sky|0.47829 blue|0.47829 light|0.11077 slate|0.11077 gray|0.11077 slate|0.10198 gray|0.10198 royal|0.088063 blue|0.088063 dark|0.052851 gray|0.052851 dark|0.052851 grey|0.052851 gray|0.049838 grey|0.049838 dim|0.032603 gray|0.032603 dim|0.032603 grey|0.032603 steel|0.031105 blue|0.031105 sky|0.030903 blue|0.030903 silver|0.013499 black|0.0068673  "
		}
	}
}
