{
	"add": {
		"doc": {
			"id": "1309bc10e7b26eae83de8b56f5b5cf550a3aa2f86399ed4d5fccb7ae86b03f60",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Supersonic.arp.750pix.jpg/220px-Supersonic.arp.750pix.jpg",
				"previous": "Throughout the 1950s an SST looked possible from a technical standpoint, but it was not clear if it could be made economically viable. Lift is generated using different means at supersonic speeds, and these methods are considerably less efficient than subsonic methods, with approximately one-half the lift-to-drag ratio. This implies that for any given required amount of lift, the aircraft will have to supply about twice the thrust, leading to considerably greater fuel use. This effect is pronounced at speeds close to the speed of sound, as the aircraft is using twice the thrust to travel at about the same speed. The relative effect is reduced as the aircraft accelerates to higher speeds. Offsetting this increase in fuel use was the potential to greatly increase sortie rates of the aircraft, at least on medium and long-range flights where the aircraft spends a considerable amount of time in cruise. SST designs flying at least three times as fast as existing subsonic transports were possible, and would thus be able to replace as many as three planes in service, and thereby lower costs in terms of manpower and maintenance.",
				"after": "Serious work on SST designs started in the mid-1950s, when the first generation of supersonic fighter aircraft were entering service. In Britain and France, government-subsidized SST programs quickly settled on the delta wing in most studies, including the Sud Aviation Super-Caravelle and Bristol 223, although Armstrong-Whitworth proposed a more radical design, the Mach 1.2 M-Wing. Avro Canada proposed several designs to TWA that included Mach 1.6 double-ogee wing and Mach 1.2 delta-wing with separate tail and four under-wing engine configurations. Avro's team moved to the UK where its design formed the basis of Hawker Siddeley's designs.[2] By the early 1960s, the designs had progressed to the point where the go-ahead for production was given, but costs were so high that the Bristol Aeroplane Company and Sud Aviation eventually merged their efforts in 1962 to produce Concorde.",
			"color": "black|0.26611 dim|0.096044 gray|0.096044 dim|0.096044 grey|0.096044 dark|0.051143 gray|0.051143 dark|0.051143 grey|0.051143 silver|0.047617 gray|0.042194 grey|0.042194 white|0.040607 smoke|0.040607 light|0.040505 gray|0.040505 light|0.040505 grey|0.040505 sea|0.037093 shell|0.037093 gainsboro|0.03654 snow|0.036024 white|0.033863 floral|0.033567 white|0.033567 mint|0.033096 cream|0.033096 linen|0.030913 ghost|0.02735 white|0.02735 azure|0.025413 alice|0.021767 blue|0.021767 indian|0.016174 red|0.016174 lavender|0.015196 blush|0.015196 old|0.014452 lace|0.014452 ivory|0.01333 light|0.0088716 coral|0.0088716 slate|0.0049334 gray|0.0049334 misty|0.0046165 rose|0.0046165  "
		}
	}
}
