{
	"add": {
		"doc": {
			"id": "1310eb768d0e4735e4ef7a06fc102b96349aaa1ce89c3f81d3ce2ed44bf13696",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Bundesarchiv_Bild_146-1980-036-05%2C_Amin_al_Husseini_bei_bosnischen_SS-Freiwilligen.jpg/220px-Bundesarchiv_Bild_146-1980-036-05%2C_Amin_al_Husseini_bei_bosnischen_SS-Freiwilligen.jpg",
			"previous": [],
				"after": "On 7 April 1939, five months prior to the outbreak of World War II, the Kingdom of Italy invaded the Albanian Kingdom. The country was overrun in five days, and the Italian King, Victor Emmanuel III, subsequently accepted the crown offered by the Albanian parliament. The Royal Albanian Army was incorporated into the Royal Italian Army and a viceroy was appointed to administer the country as a protectorate.[3] After the Axis invasion of Yugoslavia on 6 April 1941, Italian Albania was expanded to include adjacent parts of the Kingdom of Yugoslavia incorporated mainly from the Yugoslav banovinas (regional subdivisions) of Vardar and Morava.[4] Kosovo was annexed to Albania, and in the beginning, Albanians living there enthusiastically welcomed the Italian occupation.[5] Some Albanians from Kosovo even suggested that the Albanian people were \"Aryans of Illyrian heritage.\"[6] Although officially under Italian rule, the Albanians in Kosovo controlled the region and were encouraged to open Albanian-language schools,[7] which had been banned by the Yugoslav government.[8] The Italians also gave the inhabitants Albanian citizenship and allowed them to fly the Albanian flag.[7] Kosovo Albanians then sought retribution against Serbs and Montenegrins settlers in the region[5] for the oppression that Albanians had experienced at the hands of the Serbs during the Balkan Wars, the First World War, and under Yugoslav rule.[9] The Italians subsequently cleared the area of most Serbs and Montenegrins who had settled in Kosovo during the interwar period.[10] The local Albanians took advantage of their changed circumstances by taking revenge against their Serbian neighbours and burning the homes of as many as 30,000 Serb and Montenegrin settlers.[7]",
			"color": " "
		}
	}
}
