{
	"add": {
		"doc": {
			"id": "1337372a778582119a3ffe7d85d479d7b492dc14058eb288c8f1db6ef3a6a813",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Long_Beach_Pier_1905.png/220px-Long_Beach_Pier_1905.png",
				"previous": "In 1843 Jonathan Temple bought Rancho Los Cerritos, after arriving in California in 1827 from New England. He built what is now known as the \"Los Cerritos Ranch House\", an adobe which still stands and is a National Historic Landmark. Temple created a thriving cattle ranch and prospered, becoming the wealthiest man in Los Angeles County. Both Temple and his ranch house played important local roles in the Mexican-American War. On an island in the San Pedro Bay, Mormon pioneers made an abortive attempt to establish a colony (as part of Brigham Young's plan to establish a continuous chain of settlements from the Pacific to Salt Lake).",
				"after": "In 1866 Temple sold Rancho Los Cerritos for $20,000 to the Northern California sheep-raising firm of Flint, Bixby & Co, which consisted of brothers Thomas and Benjamin Flint and their cousin Lewellyn Bixby. Two years previous Flint, Bixby & Co had also purchased along with Northern California associate James Irvine, three ranchos which would later become the city that bears Irvine's name. To manage Rancho Los Cerritos, the company selected Lewellyn's brother Jotham Bixby, the \"Father of Long Beach\". Three years later Bixby bought into the property and would later form the Bixby Land Company. In the 1870s as many as 30,000 sheep were kept at the ranch and sheared twice yearly to provide wool for trade. In 1880, Bixby sold 4,000 acres (16 km2) of the Rancho Los Cerritos to William E. Willmore, who subdivided it in hopes of creating a farm community, Willmore City. He failed and was bought out by a Los Angeles syndicate that called itself the \"Long Beach Land and Water Company.\" They changed the name of the community to Long Beach, at that time. The City of Long Beach was officially incorporated in 1897.",
			"color": " "
		}
	}
}
