{
	"add": {
		"doc": {
			"id": "133998307b17834a7b1359f15294f9705102185e1b9cf74fc66d922811a27981",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Weal.png/320px-Weal.png",
				"previous": "The inheritance of DNA is a complex process that varies between male and female individuals; consequently this allows the study of separate female and male lineages using mitochondrial DNA and Y-chromosome DNA respectively [89] Mitochondrial DNA (mtDNA for short) and Y-chromosome DNA differ from the DNA of diploid nuclear chromosomes in that they are not formed from the combination of both parent's genes. Rather, males inherit the Y-chromosome directly from their fathers, and both sexes inherit mtDNA directly from their mothers. Consequently they preserve a genetic record from individual to individual that is altered only through mutation.",
				"after": "An examination of Y chromosome variation, sampled in an east-west transect across England and Wales. These were compared with similar samples taken in Friesland and Norway. Friesland was selected for the study due to it being regarded as a source location for Anglo-Saxon migrants, and because of the similarities between Old English and Frisian. Samples from Norway were also compared, as this is a source of the later Viking migrations. It found that in England 50% to 100% of paternal genetic inheritance was derived from incomers originating in the Germanic coastlands of the North Sea.[90]",
			"color": "powder|0.092581 blue|0.092581 light|0.089033 blue|0.089033 yellow|0.059721 green|0.059721 light|0.050632 steel|0.050632 blue|0.050632 white|0.044974 smoke|0.044974 ghost|0.043868 white|0.043868 alice|0.043778 blue|0.043778 snow|0.041447 sea|0.040464 shell|0.040464 white|0.04039 mint|0.038703 cream|0.038703 silver|0.038547 floral|0.037444 white|0.037444 dark|0.037084 gray|0.037084 dark|0.037084 grey|0.037084 azure|0.036941 lavender|0.036845 blush|0.036845 light|0.027051 gray|0.027051 light|0.027051 grey|0.027051 light|0.02654 slate|0.02654 gray|0.02654 dark|0.025264 slate|0.025264 blue|0.025264 gainsboro|0.020573 pale|0.018833 turquoise|0.018833 dark|0.017819 cyan|0.017819 gray|0.016775 grey|0.016775 slate|0.012453 gray|0.012453 lavender|0.011322 dim|0.0093971 gray|0.0093971 dim|0.0093971 grey|0.0093971 teal|0.0081391 light|0.007907 cyan|0.007907 linen|0.0067768  "
		}
	}
}
