{
	"add": {
		"doc": {
			"id": "1348349cafeb59e820b1e73dfb9b44252469dad88919e11a838af98387721fff",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Charles_Darwin_by_Maull_and_Polyblank%2C_1855-crop.png/170px-Charles_Darwin_by_Maull_and_Polyblank%2C_1855-crop.png",
			"previous": [],
				"after": "By the start of 1856, Darwin was investigating whether eggs and seeds could survive travel across seawater to spread species across oceans. Hooker increasingly doubted the traditional view that species were fixed, but their young friend Thomas Henry Huxley was firmly against transmutation of species. Lyell was intrigued by Darwin's speculations without realising their extent. When he read a paper by Alfred Russel Wallace, \"On the Law which has Regulated the Introduction of New Species\", he saw similarities with Darwin's thoughts and urged him to publish to establish precedence. Though Darwin saw no threat, he began work on a short paper. Finding answers to difficult questions held him up repeatedly, and he expanded his plans to a \"big book on species\" titled Natural Selection. He continued his researches, obtaining information and specimens from naturalists worldwide including Wallace who was working in Borneo. The American botanist Asa Gray showed similar interests, and on 5 September 1857 Darwin sent Gray a detailed outline of his ideas including an abstract of Natural Selection. In December, Darwin received a letter from Wallace asking if the book would examine human origins. He responded that he would avoid that subject, \"so surrounded with prejudices\", while encouraging Wallace's theorising and adding that \"I go much further than you.\"[112]",
			"color": "dark|0.24615 gray|0.24615 dark|0.24615 grey|0.24615 silver|0.15482 dim|0.13143 gray|0.13143 dim|0.13143 grey|0.13143 light|0.12364 gray|0.12364 light|0.12364 grey|0.12364 gainsboro|0.11006 gray|0.082798 grey|0.082798 white|0.034818 smoke|0.034818 linen|0.030692 sea|0.016734 shell|0.016734 lavender|0.016319 blush|0.016319 black|0.013358 snow|0.011134 ghost|0.010588 white|0.010588 alice|0.0099086 blue|0.0099086 floral|0.0042591 white|0.0042591 white|0.0032521  "
		}
	}
}
