{
	"add": {
		"doc": {
			"id": "13586cf7948ea9a2f696037ca4610a4976e5c3be027f84188e3fe54a9037c2fe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/HooverDamFrontWater.jpg/170px-HooverDamFrontWater.jpg",
				"previous": "In 1922, six U.S. states in the Colorado River basin signed the Colorado River Compact, which divided half of the river's flow to both the Upper Basin (the drainage area above Lee's Ferry, comprising parts of Colorado, New Mexico, Utah, and Wyoming and a small portion of Arizona) and the Lower Basin (Arizona, California, Nevada, and parts of New Mexico and Utah). Each was given rights to 7.5 million acre feet (9.3 km3) of water per year, a figure believed to represent half of the river's minimum flow at Lee's Ferry.[193] This was followed by a U.S.–Mexico treaty in 1944, allocating 1.5 million acre feet (1.9 km3) of Colorado River water to the latter country per annum.[194] Arizona refused to ratify the Colorado River Compact in 1922 because it feared that California would take too much of the lower basin allotment; in 1944 a compromise was reached in which Arizona would get a firm allocation of 2.8 million acre feet (3.5 km3), but only if California's 4.4-million-acre-foot (5.4 km3) allocation was prioritized during drought years.[195] These and nine other decisions, compacts, federal acts and agreements made between 1922 and 1973 form what is now known as the Law of the River.[195][196]",
				"after": "On September 30, 1935, the United States Bureau of Reclamation (USBR) completed Hoover Dam in the Black Canyon of the Colorado River.[197] Behind the dam rose Lake Mead, the largest artificial lake in the U.S., capable of holding more than two years of the Colorado's flow.[27] The construction of Hoover was a major step towards stabilizing the lower channel of the Colorado River, storing water for irrigation in times of drought, and providing much-needed flood control. Hoover was the tallest dam in the world at the time of construction and also had the world's largest hydroelectric power plant.[198] Flow regulation from Hoover Dam opened the doors for rapid development on the lower Colorado River; Imperial and Parker dams followed in 1938, and Davis Dam was completed in 1950.[199][200]",
			"color": "light|0.21971 steel|0.21971 blue|0.21971 light|0.10566 gray|0.10566 light|0.10566 grey|0.10566 gainsboro|0.088961 lavender|0.064715 light|0.055487 slate|0.055487 gray|0.055487 misty|0.053088 rose|0.053088 silver|0.046666 rosy|0.044078 brown|0.044078 slate|0.035474 gray|0.035474 black|0.035211 alice|0.029076 blue|0.029076 ghost|0.024059 white|0.024059 white|0.022258 smoke|0.022258 lavender|0.018372 blush|0.018372 dark|0.018297 gray|0.018297 dark|0.018297 grey|0.018297 antique|0.018206 white|0.018206 sea|0.015684 shell|0.015684 snow|0.015522 linen|0.014026 white|0.013453 gray|0.01324 grey|0.01324 azure|0.012806 mint|0.010449 cream|0.010449 floral|0.0078114 white|0.0078114 dim|0.0058865 gray|0.0058865 dim|0.0058865 grey|0.0058865  "
		}
	}
}
