{
	"add": {
		"doc": {
			"id": "1367f4683d64cd299b21afb548028e2a8498a9b3aba6990cae88e9821554ea87",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Light-wave.svg/340px-Light-wave.svg.png",
				"previous": "In most theories up to the eighteenth century, light was pictured as being made up of particles. Since particle models cannot easily account for the refraction, diffraction and birefringence of light, wave theories of light were proposed by René Descartes (1637),[30] Robert Hooke (1665),[31] and Christiaan Huygens (1678);[32] however, particle models remained dominant, chiefly due to the influence of Isaac Newton.[33] In the early nineteenth century, Thomas Young and August Fresnel clearly demonstrated the interference and diffraction of light and by 1850 wave models were generally accepted.[34] In 1865, James Clerk Maxwell's prediction[35] that light was an electromagnetic wave—which was confirmed experimentally in 1888 by Heinrich Hertz's detection of radio waves[36]—seemed to be the final blow to particle models of light.",
				"after": "The Maxwell wave theory, however, does not account for all properties of light. The Maxwell theory predicts that the energy of a light wave depends only on its intensity, not on its frequency; nevertheless, several independent types of experiments show that the energy imparted by light to atoms depends only on the light's frequency, not on its intensity. For example, some chemical reactions are provoked only by light of frequency higher than a certain threshold; light of frequency lower than the threshold, no matter how intense, does not initiate the reaction. Similarly, electrons can be ejected from a metal plate by shining light of sufficiently high frequency on it (the photoelectric effect); the energy of the ejected electron is related only to the light's frequency, not to its intensity.[37][Note 4]",
			"color": "white|0.091452 smoke|0.091452 snow|0.090305 ghost|0.090016 white|0.090016 white|0.089892 sea|0.089803 shell|0.089803 alice|0.08972 blue|0.08972 mint|0.089292 cream|0.089292 floral|0.089024 white|0.089024 azure|0.08851 lavender|0.086231 blush|0.086231 dark|0.023185 gray|0.023185 dark|0.023185 grey|0.023185 silver|0.016468 gray|0.013441 grey|0.013441 light|0.01089 gray|0.01089 light|0.01089 grey|0.01089 gainsboro|0.0080514 dim|0.0065166 gray|0.0065166 dim|0.0065166 grey|0.0065166 light|0.0046068 coral|0.0046068 ivory|0.0043685 pink|0.0036847 misty|0.0035237 rose|0.0035237 light|0.0034879 pink|0.0034879 linen|0.0027953  "
		}
	}
}
