{
	"add": {
		"doc": {
			"id": "136a24a35912bdac7842f810da6003e7e81cfc5c4989cc6cd3343e8d6d148413",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/British_Aerospace_EAP_at_the_Farnborough_Air_Show%2C_1986.jpg/220px-British_Aerospace_EAP_at_the_Farnborough_Air_Show%2C_1986.jpg",
				"previous": "In 1979, Messerschmitt-Bölkow-Blohm (MBB) and British Aerospace (BAe) presented a formal proposal to their respective governments for the ECF, the European Collaborative Fighter[12] or European Combat Fighter.[10] In October 1979 Dassault joined the ECF team for a tri-national study, which became known as the European Combat Aircraft.[12] It was at this stage of development that the Eurofighter name was first attached to the aircraft.[13] The development of different national prototypes continued. France produced the ACX. The UK produced two designs; the P.106[N 1] was a single-engined \"lightweight\" fighter, superficially resembling the JAS 39 Gripen, the P.110 was a twin-engined fighter. The P.106 concept was rejected by the RAF, on the grounds that it had \"half the effectiveness of the two-engined aircraft at two-thirds of the cost\".[8] West Germany continued to refine the TKF-90 concept.[10] The ECA project collapsed in 1981 for several reasons including differing requirements, Dassault's insistence on \"design leadership\" and the British preference for a new version of the RB199 to power the aircraft versus the French preference for the new Snecma M88.[13]",
				"after": "Consequently the Panavia partners (MBB, BAe and Aeritalia) launched the Agile Combat Aircraft (ACA) programme in April 1982.[15] The ACA was very similar to the BAe P.110, having a cranked delta wing, canards and a twin tail. One major external difference was the replacement of the side-mounted engine intakes with a chin intake. The ACA was to be powered by a modified version of the RB199. The German and Italian governments withdrew funding, and the UK Ministry of Defence agreed to fund 50% of the cost with the remaining 50% to be provided by industry. MBB and Aeritalia signed up with the aim of producing two aircraft, one at Warton and one by MBB. In May 1983, BAe announced a contract with the MoD for the development and production of an ACA demonstrator, the Experimental Aircraft Programme.[15][16]",
			"color": "black|0.28947 linen|0.063269 white|0.06061 smoke|0.06061 sea|0.059974 shell|0.059974 gainsboro|0.058702 floral|0.055707 white|0.055707 old|0.052464 lace|0.052464 snow|0.051354 mint|0.043283 cream|0.043283 light|0.041923 gray|0.041923 light|0.041923 grey|0.041923 white|0.037472 ghost|0.027205 white|0.027205 lavender|0.020579 blush|0.020579 silver|0.019441 antique|0.018042 white|0.018042 ivory|0.016891 dim|0.01308 gray|0.01308 dim|0.01308 grey|0.01308 gray|0.0128 grey|0.0128 dark|0.012744 gray|0.012744 dark|0.012744 grey|0.012744 alice|0.010754 blue|0.010754 azure|0.0090526 beige|0.0057756 honeydew|0.0041059 tan|0.0036697  "
		}
	}
}
