{
	"add": {
		"doc": {
			"id": "1384bad058682adc15e6d5aa14dd8ba627c4c74dfc39656fa536762af186b211",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/JFK_Terminal_5_Ticketing_and_Check-In.jpg/220px-JFK_Terminal_5_Ticketing_and_Check-In.jpg",
			"previous": [],
				"after": "Terminal 5 opened in 2008 for JetBlue Airways, the manager and primary (then only) tenant of the building, and serves as the base of their large JFK hub. This particular terminal handles (except for Aer Lingus flights to Ireland) exclusively North American regional flights- American domestic flights, Caribbean flights and Hawaiian Airlines flights to Honolulu, Hawaii. The terminal was re-designed by Gensler and constructed by Turner Construction, and it is known for its many gift shops and gourmet restaurants, including a steak house and a sushi restaurant. It sits behind the preserved Eero Saarinen-designed terminal originally known as the TWA Flight Center, which is now connected to the new structure and is considered part of T5. The Saarinen building is currently closed for refurbishment; it is unclear when the building will reopen or what purpose it will have. Saarinen also designed the terminal at Washington Dulles International Airport. The active T5 building (including the international arrivals section named T5i) has 29 gates (26 until November 2014): 1–12 and 14–30 (with gates 25-30 handling international flights that are not precleared; gates 28-30 opened in November 2014).[65] The terminal is also used by Hawaiian Airlines, which partnered with JetBlue and began service in Terminal 5 in June 2012,[66] and Irish flag carrier Aer Lingus, whose flights arriving into JFK have already been pre-cleared in Ireland. Aer Lingus previously used Terminal 4 prior to the introduction of preclearance in Ireland, moving to T5 on April 3, 2013.[67] On November 12, 2014, JetBlue opened the International Arrivals Concourse (T5i) at the terminal.[68] Airspace Lounge opened an airport lounge near Gate 24 in July 2013 [69] and Aer Lingus is scheduled to open an airport lounge in 2015.[70]",
			"color": "dark|0.2017 gray|0.2017 dark|0.2017 grey|0.2017 gray|0.19307 grey|0.19307 dim|0.1825 gray|0.1825 dim|0.1825 grey|0.1825 silver|0.12605 black|0.11093 light|0.07159 gray|0.07159 light|0.07159 grey|0.07159 gainsboro|0.049488 white|0.0090123 smoke|0.0090123 linen|0.0046974 sea|0.004695 shell|0.004695 dark|0.0045299 slate|0.0045299 gray|0.0045299 lavender|0.0043907 blush|0.0043907 ghost|0.0042105 white|0.0042105 alice|0.0041604 blue|0.0041604 snow|0.0041002 slate|0.0039452 gray|0.0039452  "
		}
	}
}
