{
	"add": {
		"doc": {
			"id": "1391493a6a8f4773b18e6ec5a4d93074e93c001380beed56ead928a2522586c9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Juvenile_American_White_Ibis.jpg/220px-Juvenile_American_White_Ibis.jpg",
				"previous": "Although the American white ibis is predominantly monogamous and both sexes provide parental care to their young, the male often flies off to engage in extra pair copulation with other nesting females after mating with its primary female partner. These extra-pair copulations are usually done after the within-pair copulations,[35] and make up about 45% of all total matings, although only about 15% of all extra-pair copulations are successful.[35] By not restricting the number of females it copulates with, the male is able to increase its reproductive success considerably. Although females are receptive towards extra-pair copulations, male mate-guarding greatly reduces the rate of successful female involvement in attempted extra-pair copulations by other males.[33]",
				"after": "The breeding success of the American white ibis is sensitive to the hydrological conditions of the ecosystem such as rainfall and water levels. Low and decreasing water levels predict good prey accessibility. Water level reversals, where levels rise in the breeding season, disperse prey and impact on foraging success. Nest numbers and average clutch sizes are smaller in periods of reduced prey availability.[36] The success rate of parents raising one or more young to 20 days of age ranges widely from 5 to 70% of nests, and varies greatly between nearby colonies.[27] American white ibis parents have been known to supplement their chicks' diet with items such as cockroaches and rotting food from human garbage in poorer years, when fish and crayfish are more scarce.[37] Studies have also shown that years with higher nesting numbers had significantly faster spring drying rates of water bodies than years with low nesting numbers. This is because faster drying rates means that there are fewer fish and increased available area where crayfish can be hunted.[38] This highlights the fact that American white ibises do not use probability of nesting failure as a key factor in determining nesting sites but instead, rely on other criteria such as prey availability and nest-site predation rates.[39] The draining of wetlands in south Florida has also impacted on species that forage in shallow water such as the American white ibis, and its increase in numbers is a key indicator of restoration of habitat within the Everglades.[40]",
			"color": "black|0.21123 dark|0.15031 gray|0.15031 dark|0.15031 grey|0.15031 gray|0.12418 grey|0.12418 dim|0.10581 gray|0.10581 dim|0.10581 grey|0.10581 silver|0.10082 light|0.061844 gray|0.061844 light|0.061844 grey|0.061844 gainsboro|0.042399 dark|0.017795 olive|0.017795 green|0.017795 linen|0.014554 white|0.014251 smoke|0.014251 tan|0.01367 sea|0.012684 shell|0.012684 snow|0.010637 floral|0.0098967 white|0.0098967 antique|0.0095531 white|0.0095531 rosy|0.0094414 brown|0.0094414  "
		}
	}
}
