{
	"add": {
		"doc": {
			"id": "1395aaeda60f8b7060b88d5536db1f513810afffe87bcccc71ae6939e266b46d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Marywollstonecraft.jpg/250px-Marywollstonecraft.jpg",
			"previous": [],
				"after": "Fanny Imlay was the daughter of the British feminist writer Mary Wollstonecraft and the American entrepreneur Gilbert Imlay. Both had moved to France during the French Revolution, Wollstonecraft to practise the principles laid out in her seminal work A Vindication of the Rights of Woman (1792) and Imlay to engage in speculative business ventures. The two met and fell in love. At one point during Wollstonecraft and Imlay's relationship, the couple could meet only at a tollbooth between Paris and Neuilly, and it was there that their daughter was conceived; Fanny was therefore, in Godwin's words, a \"barrier child\".[3] Frances \"Fanny\" Imlay, Wollstonecraft's first child, was born in Le Havre on 14 May 1794, or, as the birth certificate stated, on the 25th day of Floreal in the Second Year of the Republic,[4] and named after Fanny Blood, her mother's closest friend.[5] Although Imlay never married Wollstonecraft, he registered her as his wife at the American consulate to protect her once Britain and France went to war in February 1793. Most people, including Wollstonecraft's sisters, assumed they were married—and thus, by extension, that Fanny was legitimate—and she was registered as such in France.[6]",
			"color": "antique|0.15769 white|0.15769 papaya|0.092069 whip|0.092069 beige|0.075764 blanched|0.072409 almond|0.072409 old|0.070148 lace|0.070148 linen|0.066104 tan|0.065382 corn|0.063922 silk|0.063922 bisque|0.044969 ivory|0.041528 floral|0.037607 white|0.037607 peach|0.034285 puff|0.034285 light|0.032893 yellow|0.032893 sea|0.026858 shell|0.026858 honeydew|0.016952 wheat|0.016658 light|0.013312 golden|0.013312 rod|0.013312 yellow|0.013312 light|0.011344 gray|0.011344 light|0.011344 grey|0.011344 silver|0.010135  "
		}
	}
}
