{
	"add": {
		"doc": {
			"id": "139937171e9fa6de0509c3ccdaf3482ea03805cf8c5dad00b34f200a197c64cf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Rolls_Royce_Derwent_Jet_Engine.jpg/220px-Rolls_Royce_Derwent_Jet_Engine.jpg",
				"previous": "In 1947, Fred Smye, president of Avro, advised Herbert James Symington of TCA that they could not meet the fixed price contract. Symington's response was to pull out of the project, perhaps due to having successfully taken delivery of their new Canadair North Stars. C. D. Howe stepped in and offered $1.5 million to continue the project, at a slower pace.[5] At about the same time, Rolls-Royce told Avro that the civil certification of the Avon could not be guaranteed in time for the Jetliner's rollout. This, in turn, would lead to higher operational and maintenance costs. Nevertheless, Avro continued with its plan to build the jet, selecting four Rolls-Royce Derwents to replace the two Avons.[4]",
				"after": "Chief Designer James C. Floyd was upset by these developments, but in the end found a number of advantages of the four-engine layout. The main advantage was that an engine-out situation, the aircraft would lose only ¼ of its thrust, rather than ½, which made power tolerances easier to meet. In particular, the asymmetry in thrust originally called for a powered rudder to correct for yaw in the case of an engine-out, but with four engines it was found the yaw was so small it could be corrected easily with just the manual trim controls.[6]",
			"color": "black|0.31887 dim|0.17495 gray|0.17495 dim|0.17495 grey|0.17495 gray|0.12562 grey|0.12562 dark|0.083573 gray|0.083573 dark|0.083573 grey|0.083573 light|0.035254 blue|0.035254 silver|0.034121 light|0.026849 slate|0.026849 gray|0.026849 slate|0.026181 gray|0.026181 light|0.024331 steel|0.024331 blue|0.024331 light|0.017224 gray|0.017224 light|0.017224 grey|0.017224 steel|0.015942 blue|0.015942 light|0.013536 sky|0.013536 blue|0.013536 gainsboro|0.011884 powder|0.006298 blue|0.006298  "
		}
	}
}
