{
	"add": {
		"doc": {
			"id": "13b3ffc7cbd89b274ee957dd83d51e22b2b7968d8a8fab53f0d58ab9426ae94a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/PLL_LOT_Boeing_767-300ER_Poznan_2.jpg/220px-PLL_LOT_Boeing_767-300ER_Poznan_2.jpg",
				"previous": "The acquisition of Boeing 767 series aircraft made LOT the second airline in the former communist states of Central Europe to operate American equipment (the first was Malév Hungarian Airlines, which acquired a Boeing 737-200 as early as on 18 November 1988;[19] Interflug acquired the Western European Airbus A310 in June 1989). These new aircraft were, at one point, used to operate LOT's longest-ever connection to Singapore. By the end of 1989 LOT had achieved much, it had hosted that year's IATA congress and achieved a milestone annual load-factor of 2.3 million passengers carried over the course of the year.",
				"after": "In 1990 LOT's third Boeing 767-300 landed at Warsaw Chopin Airport and not long after Boeing 737 and ATR 72 aircraft were acquired for use on LOT's expanded route network, which began to include new international destinations such as Kiev, Lviv, Minsk and Vilnius. Soon thereafter, in 1993, LOT began to expand its Western-European operations, inaugurating, in quick succession, flights to Oslo, Frankfurt and Düsseldorf, operations at Poland's other regional airports outside Warsaw were also duly expanded around this time.",
			"color": "dim|0.37107 gray|0.37107 dim|0.37107 grey|0.37107 gray|0.2346 grey|0.2346 black|0.067057 dark|0.042285 gray|0.042285 dark|0.042285 grey|0.042285 silver|0.03658 light|0.034447 gray|0.034447 light|0.034447 grey|0.034447 gainsboro|0.031229 white|0.019044 smoke|0.019044 sea|0.015582 shell|0.015582 snow|0.015364 ghost|0.014568 white|0.014568 alice|0.013557 blue|0.013557 white|0.013499 floral|0.013036 white|0.013036 lavender|0.011647 blush|0.011647 linen|0.011556 mint|0.010656 cream|0.010656 slate|0.0087388 gray|0.0087388 azure|0.0081959 light|0.0074148 slate|0.0074148 gray|0.0074148 lavender|0.0051303  "
		}
	}
}
