{
	"add": {
		"doc": {
			"id": "13c76734075e7c7520fabf0920e1b1b3d4540c4b896dd40fc606479d81e7ab20",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Kent_Free_Library_1.jpg/220px-Kent_Free_Library_1.jpg",
				"previous": "Preschool, elementary, and secondary education is mainly provided by the Kent City School District with the small portion of the city south of State Route 261 a part of the neighboring Field Local School District.[152] The Kent district was created around 1860 and later merged with the Franklin Township and Brady Lake school districts in 1959.[153][154] It serves most of Kent and Franklin Township, the villages of Brady Lake and Sugar Bush Knolls and a small part of southern Streetsboro.[152] Kent has four neighborhood elementary schools that serve students in grades K–5, Stanton Middle School for grades 6–8, and Theodore Roosevelt High School for grades 9–12. The district also operates a preschool program housed at Davey Elementary School, and is a member of the Six District Educational Compact with five surrounding districts to facilitate vocational education with many of these programs housed at Theodore Roosevelt High School.[155][156] In 1985, Theodore Roosevelt High School was given the United States Department of Education Excellence in Education award and the school has consistently been rated \"Excellent\" by the Ohio Department of Education since 2004.[157][158] In December 2009, it was named in US News & World Report as one of the best high schools in the United States, earning the publication's Bronze Medal designation.[159] The Kent City School District has been consistently rated as \"Excellent\" or \"Effective\" by the Ohio Department of Education and in 2007 Walls Elementary School was named a \"School of Promise\" by the Ohio Department of Education, while Longcoy Elementary earned the U.S. Department of Education's prestigious Blue Ribbon School award.[158][160] Kent also has one private school, St. Patrick School, which serves around 300 students in grades K–8 from Kent and several surrounding communities. It is part of Kent's St. Patrick parish and is affiliated with the Roman Catholic Diocese of Youngstown.[161][162]",
				"after": "The Kent Free Library is the main public library. It was established in 1892 after Kent became the first village in Ohio to use an 1892 state law which allowed municipalities under a population of 5,000 to tax residents for the upkeep of a library. Andrew Carnegie donated $10,000 in 1901 for construction of a permanent home for the library, which opened in 1903.[163] The 2006 expansion to the library brought available space to 55,000 square feet (5,100 m2) with a book collection of 147,390 items as of 2010.[164][165] It is a school district library associated with the Kent City School District and is also part of the Portage Library Consortium, connecting it with Reed Memorial Library in Ravenna and the Portage County District Library, which maintains six branch libraries across the county and a bookmobile.[166][167]",
			"color": "dim|0.2771 gray|0.2771 dim|0.2771 grey|0.2771 gray|0.14315 grey|0.14315 dark|0.13484 gray|0.13484 dark|0.13484 grey|0.13484 dark|0.045247 slate|0.045247 gray|0.045247 slate|0.044021 gray|0.044021 silver|0.034821 light|0.032488 slate|0.032488 gray|0.032488 black|0.030769 dark|0.026685 olive|0.026685 green|0.026685 antique|0.017211 white|0.017211 linen|0.015719 light|0.014493 gray|0.014493 light|0.014493 grey|0.014493 old|0.014348 lace|0.014348 sea|0.013153 shell|0.013153 floral|0.012632 white|0.012632 papaya|0.011543 whip|0.011543 beige|0.011401 light|0.011339 steel|0.011339 blue|0.011339 gainsboro|0.010414 ivory|0.0088963 corn|0.0087321 silk|0.0087321 blanched|0.0082815 almond|0.0082815 white|0.0079234 smoke|0.0079234 dark|0.0073423 khaki|0.0073423 snow|0.0063835  "
		}
	}
}
