{
	"add": {
		"doc": {
			"id": "13d35e7ad06d1bd691a2abf0482a3d0b7d10b5fcf2abd1bf780319917453bc34",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Sterna_hirundo_in_Finland.jpg/220px-Sterna_hirundo_in_Finland.jpg",
			"previous": [],
				"after": "The nominate subspecies of the common tern is 31–35 cm (12–14 in) long, including a 6–9 cm (2.4–3.5 in) fork in the tail, with a 77–98 cm (30–39 in) wingspan. It weighs 110–141 g (3.9–5.0 oz).[16] Breeding adults have pale grey upperparts, very pale grey underparts, a black cap, orange-red legs, and a narrow pointed bill that can be mostly red with a black tip, or all black, depending on the subspecies.[18] The common tern's upperwings are pale grey, but as the summer wears on, the dark feather shafts of the outer flight feathers become exposed, and a grey wedge appears on the wings. The rump and tail are white, and on a standing bird the long tail extends no further than the folded wingtips, unlike the Arctic and roseate terns in which the tail protrudes beyond the wings. There are no significant differences between the sexes.[19] In non-breeding adults the forehead and underparts become white, the bill is all black or black with a red base, and the legs are dark red or black.[19] The upperwings have an obvious dark area at the front edge of the wing, the carpal bar. Terns that have not bred successfully may start moulting into non-breeding adult plumage from June, but late July is more typical, with the moult suspended during migration. There is also some geographical variation, Californian birds often being in non-breeding plumage during migration.[16]",
			"color": "dark|0.35237 gray|0.35237 dark|0.35237 grey|0.35237 silver|0.26145 dim|0.067444 gray|0.067444 dim|0.067444 grey|0.067444 black|0.06446 light|0.061158 gray|0.061158 light|0.061158 grey|0.061158 gray|0.053071 grey|0.053071 gainsboro|0.02712 slate|0.016997 gray|0.016997 light|0.011829 slate|0.011829 gray|0.011829 white|0.0075408 smoke|0.0075408 sea|0.0074681 shell|0.0074681 linen|0.0069438 snow|0.0065428 floral|0.0064118 white|0.0064118 misty|0.0062605 rose|0.0062605 ghost|0.005273 white|0.005273 lavender|0.0052396 blush|0.0052396 white|0.0052282 mint|0.0044919 cream|0.0044919  "
		}
	}
}
