{
	"add": {
		"doc": {
			"id": "13d3c6e41b278a6d102e08bae009d687cc54e4c40445b4b0dc0e33989fe46473",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Kakapo-population-size.svg/400px-Kakapo-population-size.svg.png",
				"previous": "In 1989, a Kakapo Recovery programme was developed and a Kakapo Recovery Group established to implement it.[61] The New Zealand Department of Conservation replaced the Wildlife Service for this task. The first action of the plan was to relocate all the remaining kakapo to suitable islands for them to breed. None of the New Zealand islands were ideal to establish kakapo without rehabilitation by extensive re-vegetation and the eradication of introduced mammalian predators and competitors. Four islands were finally chosen: Maud, Hauturu/Little Barrier, Codfish and Mana.[60] Sixty-five kakapo (43 males, 22 females) were successfully transferred onto the four islands in five translocations.[60] Some islands had to be rehabilitated several times when feral cats, stoats and weka kept appearing. Little Barrier Island was eventually viewed as unsuitable due to the rugged landscape, the thick forest and the continued presence of rats, and its birds were evacuated in 1998.[62] Along with Mana Island, it was replaced with two new kakapo sanctuaries, Chalky Island (Te Kakahu) and Anchor Island.[3] The entire kakapo population of Codfish Island was temporarily relocated in 1999 to Pearl Island in Port Pegasus while rats were being eliminated from Codfish.[63] All kakapo on Pearl and Chalky Islands were moved to Anchor Island in 2005.[64]",
				"after": "A key part of the Recovery Plan is the supplementary feeding of females. The kakapo breeds only once every two to five years, when a certain type of plant species, primarily Dacrydium cupressinum (rimu), produces protein-rich fruit and seeds. Observations of the relationship between intermittent breeding and the plant's mast year help biologists choose which suitable supplementary foods to increase kakapo breeding frequency.[65] In 1989, six preferred foods (apples, sweet potatoes, almonds, Brazil nuts, sunflower seeds and walnuts) were supplied ad libitum each night to 12 feeding stations. Males and females ate the supplied foods, and females nested on Little Barrier Island in the summers of 1989–91 for the first time since 1982, although nesting success was low.[66]",
			"color": "white|0.097605 smoke|0.097605 ghost|0.097446 white|0.097446 alice|0.097305 blue|0.097305 sea|0.097192 shell|0.097192 snow|0.097086 white|0.097067 mint|0.096973 cream|0.096973 floral|0.096872 white|0.096872 azure|0.096638 lavender|0.095535 blush|0.095535 sea|0.0041741 green|0.0041741 firebrick|0.0036188 misty|0.0029333 rose|0.0029333 indian|0.0028664 red|0.0028664  "
		}
	}
}
