{
	"add": {
		"doc": {
			"id": "13f3d545866a4638d8fd0a9197bad1d3d762867db23dc013141f294cc0c85f95",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Me_262_flight_show_at_ILA_2006_%28cropped%29.jpg/220px-Me_262_flight_show_at_ILA_2006_%28cropped%29.jpg",
				"previous": "The British experimental Gloster E.28/39 first took to the air on May 15, 1941, powered by Sir Frank Whittle's turbojet.[6] The United States produced the Bell XP-59A with a version of the Whittle engine built by General Electric, which flew on October 1, 1942. The Meteor was the first production jet as it entered production a few months before the Me 262.",
				"after": "The first operational jet fighter was the Messerschmitt Me 262,[7] made by Germany during late World War II. It was the fastest conventional aircraft of World War II – although the rocket-powered Messerschmitt Me 163 Komet was faster. It had first flown in 1941 but mass production started in 1944 with the first squadrons operational that year, too late for a decisive effect on the outcome of the war. About the same time, mid 1944, the United Kingdom's Gloster Meteor was being committed to defence of the UK against the V1 flying bomb – itself a jet-powered aircraft – and then ground-attack operations over Europe in the last months of the war. In 1944 Germany introduced into service the Arado Ar 234 jet reconnaissance and bomber, though chiefly used in the former role. USSR tested its own Bereznyak-Isayev BI-1 in 1942, but the project was scrapped by Joseph Stalin in 1945. The Imperial Japanese Navy also developed jet aircraft in 1945, including the Nakajima J9Y Kikka, a modified, and slightly smaller version of the Me 262 that had folding wings. By the end of 1945, the US had introduced their next jet fighter, the Lockheed P-80 Shooting Star into service and the UK its second fighter design, the de Havilland Vampire.",
			"color": "black|0.32833 gray|0.20171 grey|0.20171 dim|0.17666 gray|0.17666 dim|0.17666 grey|0.17666 dark|0.14908 gray|0.14908 dark|0.14908 grey|0.14908 silver|0.057624 light|0.020675 gray|0.020675 light|0.020675 grey|0.020675  "
		}
	}
}
