{
	"add": {
		"doc": {
			"id": "13fb1cbfec3d686a35b21bace71ab9744b9aeee59e59b7452087f1884cc36970",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Alca_Impennis_by_John_Gould.jpg/220px-Alca_Impennis_by_John_Gould.jpg",
			"previous": [],
				"after": "This alcid typically fed in shoaling waters which were shallower than those frequented by other alcids,[45] although after the breeding season they had been sighted up to 500 kilometres (310 mi) from land.[45] They are believed to have fed cooperatively in flocks.[45] Their main food was fish, usually 12 to 20 centimetres (4.7 to 7.9 in) in length and weighing 40 to 50 grams (1.4 to 1.8 oz), but occasionally their prey was up to half the bird's own length. The bird could on average dive up to 75 metres (246 ft) for its prey with the maximum dive depth being estimated at 130 metres (430 ft); however, to conserve energy, most dives were shallower.[45] Its ability to dive this deeply reduced competition with other alcid species. Based on remains associated with great auk bones found on Funk Island and on ecological and morphological considerations, it seems that Atlantic menhaden and capelin were their favored prey.[46] Other fish suggested as potential prey include lumpsuckers, shorthorn sculpins, cod, crustaceans, and sand lance.[44][45] The young of the great auk are believed to have eaten plankton and, possibly, fish and crustaceans regurgitated by adult auks.[36][42]",
			"color": "dim|0.11658 gray|0.11658 dim|0.11658 grey|0.11658 gray|0.11094 grey|0.11094 light|0.10241 gray|0.10241 light|0.10241 grey|0.10241 dark|0.10157 gray|0.10157 dark|0.10157 grey|0.10157 silver|0.090499 gainsboro|0.084706 antique|0.063026 white|0.063026 black|0.059878 linen|0.046221 old|0.035541 lace|0.035541 beige|0.028741 sea|0.020632 shell|0.020632 dark|0.020218 slate|0.020218 gray|0.020218 floral|0.018646 white|0.018646 papaya|0.015062 whip|0.015062 white|0.014144 smoke|0.014144 blanched|0.012391 almond|0.012391 ivory|0.011994 corn|0.0095966 silk|0.0095966 bisque|0.0068445 honeydew|0.0062633 mint|0.0048754 cream|0.0048754  "
		}
	}
}
