{
	"add": {
		"doc": {
			"id": "13ff0e39c54ba92ad8e274d072d00e542b395d4c9b54096ec5ce194071f7f2ea",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Acres_of_Harvested_Wheat_in_Illinois_in_2012.pdf/page1-220px-Acres_of_Harvested_Wheat_in_Illinois_in_2012.pdf.jpg",
			"previous": [],
				"after": "Illinois' major agricultural outputs are corn, soybeans, hogs, cattle, dairy products, and wheat. In most years, Illinois is either the first or second state for the highest production of soybeans, with a harvest of 427.7 million bushels (11.64 million metric tons) in 2008, after Iowa's production of 444.82 million bushels (12.11 million metric tons).[85] Illinois ranks second in U.S. corn production with more than 1.5 billion bushels produced annually.[86] With a production capacity of 1.5 billion gallons per year, Illinois is a top producer of ethanol; ranking third in the United States in 2011.[87] Illinois is a leader in food manufacturing and meat processing.[88] Although Chicago may no longer be \"Hog Butcher for the World,\" the Chicago area remains a global center for food manufacture and meat processing,[88] with many plants, processing houses, and distribution facilities concentrated in the area of the former Union Stock Yards.[89] Illinois also produces wine, and the state is home to two American viticultural areas. In the area of The Meeting of the Great Rivers Scenic Byway, peach and apple are grown. The German immigrants from agricultural backgrounds who settled in Illinois in mid- to late 19th century are the in part responsible for the profusion of fruit orchards in that area of Illinois.[90] Illinois' universities are actively researching alternative agricultural products as alternative crops.",
			"color": "white|0.088419 smoke|0.088419 alice|0.085024 blue|0.085024 ghost|0.084883 white|0.084883 sea|0.084334 shell|0.084334 snow|0.084293 white|0.083591 mint|0.082795 cream|0.082795 floral|0.081792 white|0.081792 lavender|0.081372 blush|0.081372 azure|0.081298 dark|0.050281 gray|0.050281 dark|0.050281 grey|0.050281 silver|0.031704 light|0.023658 gray|0.023658 light|0.023658 grey|0.023658 gainsboro|0.018076 gray|0.017174 grey|0.017174 dim|0.01057 gray|0.01057 dim|0.01057 grey|0.01057 linen|0.0049513 ivory|0.0038227  "
		}
	}
}
