{
	"add": {
		"doc": {
			"id": "13ff18fe1219b296e7b05edfe25fbb654b934dddf7cc9ae8de3526cf1fc4b43d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Male_Lion_and_Cub_Chitwa_South_Africa_Luca_Galuzzi_2004.JPG/220px-Male_Lion_and_Cub_Chitwa_South_Africa_Luca_Galuzzi_2004.JPG",
				"previous": "When first introduced to the rest of the pride, the cubs initially lack confidence when confronted with adult lions other than their mother. They soon begin to immerse themselves in the pride life, however, playing among themselves or attempting to initiate play with the adults. Lionesses with cubs of their own are more likely to be tolerant of another lioness's cubs than lionesses without cubs. The tolerance of the male lions toward the cubs varies – sometimes, a male will patiently let the cubs play with his tail or his mane, whereas another may snarl and bat the cubs away.[122]",
				"after": "Weaning occurs after six to seven months. Male lions reach maturity at about 3 years of age and, at 4–5 years of age, are capable of challenging and displacing the adult male(s) associated with another pride. They begin to age and weaken between 10 and 15 years of age at the latest,[123] if they have not already been critically injured while defending the pride (once ousted from a pride by rival males, male lions rarely manage a second take-over). This leaves a short window for their own offspring to be born and mature. If they are able to procreate as soon as they take over a pride, potentially, they may have more offspring reaching maturity before they also are displaced. A lioness often will attempt to defend her cubs fiercely from a usurping male, but such actions are rarely successful. He usually kills all of the existing cubs who are less than two years old. A lioness is weaker and much lighter than a male; success is more likely when a group of three or four mothers within a pride join forces against one male.[120]",
			"color": "black|0.2988 tan|0.15573 rosy|0.11504 brown|0.11504 burly|0.071434 wood|0.071434 dim|0.051363 gray|0.051363 dim|0.051363 grey|0.051363 sandy|0.042937 brown|0.042937 peru|0.040299  "
		}
	}
}
