{
	"add": {
		"doc": {
			"id": "1406f66c5a3d5032e9c79a0ce634136699bf9885fc660b5968f017983fdc9f96",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/F-111B_NAN7-65.jpg/220px-F-111B_NAN7-65.jpg",
				"previous": "Beginning in the late 1950s, the U.S. Navy sought a long-range, high-endurance interceptor to defend its carrier battle groups against long-range anti-ship missiles launched from the jet bombers and submarines of the Soviet Union. The U.S. Navy needed a Fleet Air Defense (FAD) aircraft with a more powerful radar, and longer range missiles than the F-4 Phantom II to intercept both enemy bombers and missiles.[3] The Navy was directed to participate in the Tactical Fighter Experimental (TFX) program with the U.S. Air Force by Secretary of Defense Robert McNamara. McNamara wanted \"joint\" solutions to service aircraft needs to reduce development costs, and had already directed the Air Force to buy the F-4 Phantom II, which was developed for the Navy and Marine Corps.[4] The Navy strenuously opposed the TFX as it feared compromises necessary for the Air Force's need for a low-level attack aircraft would adversely impact the aircraft's performance as a fighter .",
				"after": "Weight and performance issues plagued the U.S. Navy F-111B variant for TFX and would not be resolved to the Navy's satisfaction. The F-111 manufacturer General Dynamics partnered with Grumman on the Navy F-111B. With the F-111B program in distress, Grumman began studying improvements and alternatives. In 1966, the Navy awarded Grumman a contract to begin studying advanced fighter designs. Grumman narrowed down these designs to its 303 design.[5] Vice Admiral Thomas F. Connolly, Deputy Chief of Naval Operations for Air Warfare, took the developmental F-111A variant for a flight and discovered that it had difficulty going supersonic and had poor carrier landing characteristics. He later testified to Congress about his concerns against the official Department of the Navy position and, in May 1968, Congress stopped funding for the F-111B, allowing the Navy to pursue an answer tailored to its requirements. The name \"Tomcat\" was partially chosen to pay tribute to Admiral Connolly, as the nickname \"Tom's Cat\" had already been widely used by the manufacturer, although the name also followed the Grumman tradition of naming its fighter aircraft after felines.[6]",
			"color": " "
		}
	}
}
