{
	"add": {
		"doc": {
			"id": "140b90ea2f2a0a06efab295e46edcea44dac731256875b8f3c1d86bb86d3fa06",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/American_Beaver_with_dam.JPG/220px-American_Beaver_with_dam.JPG",
				"previous": "One of the most widespread groups of mammals, rodents can be found on every continent except Antarctica. They are the only terrestrial placental mammals that have colonized Australia and New Guinea without human intervention. Humans have also allowed the animals to spread to many remote oceanic islands (e.g., the Polynesian rat).[3] Rodents have adapted to almost every terrestrial habitat, from cold tundra (where they can live under snow) to hot deserts. Some species such as tree squirrels and New World porcupines are arboreal, while some, such as gophers and mole rats, live almost completely underground, where they build complex burrow systems. Others dwell on the surface of the ground but may have a burrow into which they can retreat. Beavers and muskrats are known for being semi-aquatic,[1] but the rodent best-adapted for aquatic life is probably the earless water rat from New Guinea.[20] Rodents have also thrived in human-created environments such as agricultural and urban areas.[21]",
				"after": "Though some species are common pests for humans, rodents also play important ecological roles.[1] Some rodents are considered keystone species and ecosystem engineers in their respective habitats. In the Great Plains of North America, the burrowing activities of prairie dogs play important roles in soil aeration and nutrient redistribution, raising the organic content of the soil and increasing the absorption of water. They maintain these grassland habitats,[22] and some large herbivores like bison and pronghorn prefer to graze near prairie dog colonies due to the increased nutritional quality of forage.[23] Prairie dogs can, however, also contribute to regional and local biodiversity loss, increased seed depredation and the establishment and spread of invasive shrubs.[22] Burrowing rodents may eat the fruiting bodies of fungi and spread spores through their feces, thereby allowing the fungi to disperse and form symbiotic relationships with the roots of plants (which usually cannot thrive without them). As such, these rodents may play a role in maintaining healthy forests.[24]",
			"color": "black|0.25515 tan|0.13981 dark|0.062635 olive|0.062635 green|0.062635 dim|0.046697 gray|0.046697 dim|0.046697 grey|0.046697 antique|0.043618 white|0.043618 wheat|0.034905 bisque|0.03267 blanched|0.031645 almond|0.031645 papaya|0.029217 whip|0.029217 gray|0.027639 grey|0.027639 old|0.020311 lace|0.020311 linen|0.019659 beige|0.018386 corn|0.018243 silk|0.018243 peach|0.017759 puff|0.017759 dark|0.017126 gray|0.017126 dark|0.017126 grey|0.017126 silver|0.016544  "
		}
	}
}
