{
	"add": {
		"doc": {
			"id": "141c64ea2286843893ca6f259c3f40547718e7ad3d333d4ee8aab35e0b1f1f7d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Crown_of_Thorns-jonhanson.jpg/220px-Crown_of_Thorns-jonhanson.jpg",
				"previous": "Starfish may be preyed on by conspecifics, other starfish species, tritons, crabs, fish, gulls and sea otters.[40][68][70][71] Their first lines of defence are the saponins present in their body walls, which have unpleasant flavours.[72] Some starfish such as Astropecten polyacanthus also include powerful toxins such as tetrodotoxin among their chemical armoury, and the slime star can ooze out large quantities of repellent mucus. They also have body armour in the form of hard plates and spines.[73] The crown-of-thorns starfish is particularly unattractive to potential predators, being heavily defended by sharp spines, laced with toxins and sometimes with bright warning colours.[74] Other species protect their vulnerable tube feet and arm tips by lining their ambulacral grooves with spines and heavily plating their extremities.[73]",
				"after": "Several species sometimes suffer from a wasting condition caused by bacteria in the genus Vibrio;[70] however, a more widespread wasting disease, causing mass mortalities among starfish, appears sporadically. A paper published in November 2014 revealed the most likely cause of this disease to be a densovirus the authors named sea star-associated densovirus (SSaDV).[75] The protozoan Orchitophrya stellarum is known to infect the gonads of starfish and damage tissue.[70] Starfish are vulnerable to high temperatures. Experiments have shown that the feeding and growth rates of P. ochraceus reduce greatly when their body temperatures rise above 23 °C (73 °F) and that they die when their temperature rises to 30 °C (86 °F).[76][77] This species has a unique ability to absorb seawater to keep itself cool when it is exposed to sunlight by a receding tide.[78] It also appears to rely on its arms to absorb heat, so as to protect the central disc and vital organs like the stomach.[79]",
			"color": "tan|0.14976 rosy|0.095469 brown|0.095469 burly|0.073918 wood|0.073918 dim|0.039172 gray|0.039172 dim|0.039172 grey|0.039172 dark|0.036124 khaki|0.036124 medium|0.033961 slate|0.033961 blue|0.033961 dark|0.032063 gray|0.032063 dark|0.032063 grey|0.032063 gray|0.031368 grey|0.031368 wheat|0.027226 silver|0.026473 thistle|0.025524 medium|0.024512 purple|0.024512 light|0.022787 gray|0.022787 light|0.022787 grey|0.022787 peach|0.019671 puff|0.019671  "
		}
	}
}
