{
	"add": {
		"doc": {
			"id": "1424947bb20ee94f17a42ec10308a2c1672c2d240aae2e7186078206578b111a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Kennedy_line_1.jpg/220px-Kennedy_line_1.jpg",
				"previous": "The coin continued to be struck through the remainder of the twentieth century, and mintage numbers remained relatively steady in both the Philadelphia and Denver mints[36] until 1987, a year in which no half dollars were struck for circulation; the Treasury had accumulated a two-year supply of the pieces, making further production unncessary.[37] Demand for half dollars dropped, and casinos (where they were commonly used) increasingly began producing fifty cent tokens to use in place of the coins.[38] With mintage numbers remaining low,[36] beginning in 2002, the Kennedy half dollar ceased to be struck for general circulation. Rolls and bags of the current year's pieces may be purchased from the Mint, at a premium above face value.[35]",
				"after": "In January 2014, a private firm, on behalf of the Mint, began surveying customers on possible options for a special issue of the half dollar in commemoration of its 50th anniversary. [39] In June, the Mint announced plans to issue seven special 2014 Kennedy half dollars in commemoration of the series' fiftieth anniversary: two in clad, from Philadelphia and Denver, four in silver from Philadelphia, Denver, San Francisco, and the West Point Mint, and one in .9999 gold, from West Point. The clad and silver versions bear the normal date; the gold coin has the double date 1964–2014. All have higher relief than the usual issues.[40] The gold coins were released in conjunction with the American Numismatic Association convention in Rosemont, Illinois on August 5, 2014.[41]",
			"color": "dark|0.48604 gray|0.48604 dark|0.48604 grey|0.48604 gray|0.20819 grey|0.20819 dim|0.19388 gray|0.19388 dim|0.19388 grey|0.19388 silver|0.02748 black|0.0098698 tan|0.0065183 slate|0.0059909 gray|0.0059909 dark|0.0055602 slate|0.0055602 gray|0.0055602 light|0.0053254 slate|0.0053254 gray|0.0053254 light|0.0035338 gray|0.0035338 light|0.0035338 grey|0.0035338  "
		}
	}
}
