{
	"add": {
		"doc": {
			"id": "142a96bfdb489a578bf7d43724957092e5bf4660423f87d0f520f6841d57cffb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Hitler%27s_DAP_membership_card.png/220px-Hitler%27s_DAP_membership_card.png",
				"previous": "The DAP was a comparatively small group with fewer than 60 members.[35] Nevertheless, it attracted the attention of the German authorities, who were suspicious of any organisation that appeared to have subversive tendencies. In July 1919 while stationed in Munich, army Gefreiter Adolf Hitler was appointed a Verbindungsmann (intelligence agent) of the Reichswehr (army) by the head of press and propaganda in the Bavarian section, Captain Mayr.[37] Hitler's assignment was to influence other soldiers and to infiltrate the DAP.[27] While attending a party meeting on 12 September 1919, Hitler became involved in a heated argument with a visitor, Professor Baumann, who questioned the soundness of Gottfried Feder's arguments against capitalism and proposed that Bavaria should break away from Prussia and found a new South German nation with Austria. In vehemently attacking the man's arguments, he made an impression on the other party members with his oratory skills and, according to Hitler, the \"professor\" left the hall acknowledging unequivocal defeat.[38] According to August Kubizek, Drexler was so impressed that he whispered to a neighbour, \"My he's got a gift of the gab. We could use him.\"[35] Drexler invited him to join, and Hitler accepted.[39] In less than a week, Hitler received a postcard from Drexler stating he had officially been accepted as a DAP member.[40] Among the party's earlier members were Ernst Röhm of the Army's District Command VII; well-to-do journalist Dietrich Eckart; then University of Munich student Rudolf Hess;[41] Freikorps soldier Hans Frank; and Alfred Rosenberg, often credited as the philosopher of the movement. All were later prominent in the Nazi regime.[37]",
				"after": "Hitler became the DAP's 55th member and received the number 555, as the DAP added '500' to every member's number to exaggerate the party's strength.[42] He later claimed to be the seventh party member (he was in fact the seventh executive member of the party's central committee;[43] he would later wear the Golden Party Badge number one). Hitler's first speech was held in the Hofbräukeller, where he spoke in front of 111 people as the second speaker of the evening. Hitler later declared that this was when he realised he could really \"make a good speech\".[35] At first Hitler only spoke to relatively small groups, but his considerable oratory and propaganda skills were appreciated by the party leadership. With the support of Anton Drexler, Hitler became chief of propaganda for the party in early 1920.[44] Hitler began to make the party more public, and he organised their biggest meeting yet of 2,000 people, on 24 February 1920 in the Staatliches Hofbräuhaus in München. Such was the significance of this particular move in publicity that Harrer resigned from the party in disagreement.[45] It was in this speech that Hitler, for the first time, enunciated the twenty-five points of the German Worker's Party's manifesto that had been drawn up by Drexler, Feder, and Hitler.[46] Through these points he gave the organisation a much bolder stratagem[44] with a clear foreign policy (abrogation of The Treaty of Versailles, a Greater Germany, Eastern expansion, exclusion of Jews from citizenship), and among his specific points were: confiscation of war profits, abolition of unearned incomes, the State to share profits of land, and land for national needs to be taken away without compensation.[47] In general, the manifesto was antisemitic, anti-capitalist, anti-democratic, anti-Marxist, and anti-liberal.[48] To increase its appeal to larger segments of the population, on 24 February 1920, the same day as Hitler's Hofbräuhaus speech, the DAP changed its name to the Nationalsozialistische Deutsche Arbeiterpartei (National Socialist German Workers Party).[49] That year, the Nazi Party officially announced that only persons of \"pure Aryan descent [rein arischer abkunft]\" could become party members; if the person had a spouse, they also had to be a \"racially pure\" Aryan. Party members could not be related either directly or indirectly to a so-called \"non-Aryan\".[50] Even before it became legally forbidden at the Nuremberg Laws in 1935, the Nazis banned sexual relations and marriages between party members and Jews.[51] Party members found guilty of Rassenschande (racial defilement) were persecuted heavily, some members were even sentenced to death.[52]",
			"color": "black|0.092943 white|0.076765 smoke|0.076765 alice|0.073933 blue|0.073933 ghost|0.073847 white|0.073847 sea|0.073706 shell|0.073706 snow|0.07361 white|0.07279 mint|0.071875 cream|0.071875 floral|0.070733 white|0.070733 azure|0.069892 lavender|0.066636 blush|0.066636 dark|0.036955 gray|0.036955 dark|0.036955 grey|0.036955 dim|0.03465 gray|0.03465 dim|0.03465 grey|0.03465 gray|0.032633 grey|0.032633 silver|0.02596 light|0.021809 gray|0.021809 light|0.021809 grey|0.021809 gainsboro|0.019267 linen|0.006901 ivory|0.0050926  "
		}
	}
}
