{
	"add": {
		"doc": {
			"id": "144c247a3bb9299666046089b69d6954700518d8f348f9abac99f2d7e2972ec2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Minneapolis_Public_Library-20080118.jpg/130px-Minneapolis_Public_Library-20080118.jpg",
			"previous": [],
				"after": "Minneapolis Public Schools enroll 36,370 students in public primary and secondary schools. The district administers about 100 public schools including 45 elementary schools, seven middle schools, seven high schools, eight special education schools, eight alternative schools, 19 contract alternative schools, and five charter schools. With authority granted by the state legislature, the school board makes policy, selects the superintendent, and oversees the district's budget, curriculum, personnel, and facilities. Students speak 90 different languages at home and most school communications are printed in English, Hmong, Spanish, and Somali.[204] About 44% of students in the Minneapolis Public School system graduate, which ranks the city the 6th worst out of the nation's 50 largest cities.[205] Some students attend public schools in other school districts chosen by their families under Minnesota's open enrollment statute.[206] Besides public schools, the city is home to more than 20 private schools and academies and about 20 additional charter schools.[207]",
			"color": "gray|0.25851 grey|0.25851 dim|0.18676 gray|0.18676 dim|0.18676 grey|0.18676 dark|0.12941 gray|0.12941 dark|0.12941 grey|0.12941 black|0.09467 silver|0.054086 lavender|0.035056 light|0.031597 gray|0.031597 light|0.031597 grey|0.031597 gainsboro|0.023244 lavender|0.019429 blush|0.019429 light|0.019171 slate|0.019171 gray|0.019171 ghost|0.018685 white|0.018685 slate|0.017105 gray|0.017105 alice|0.016921 blue|0.016921 white|0.015714 smoke|0.015714 snow|0.013681 white|0.011817 sea|0.0089135 shell|0.0089135 thistle|0.0084832 dark|0.0081279 slate|0.0081279 gray|0.0081279 azure|0.006934 light|0.0066067 steel|0.0066067 blue|0.0066067 mint|0.0063809 cream|0.0063809  "
		}
	}
}
