{
	"add": {
		"doc": {
			"id": "145c69a3895cfc4ad1f57176339aaa115bcb101ef5fef8bf927b86ec02aa25ff",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Nasir_Gebelli.jpg/220px-Nasir_Gebelli.jpg",
				"previous": "The trio flies to the Mana Fortress and confronts Thanatos, who is preparing to transfer his mind into Dyluck. With the last of his strength, Dyluck warns that Thanatos has sold his soul to the underworld and must not be allowed to have the Fortress.[19] Dyluck kills himself, forcing Thanatos to revert to a skeletal lich form, which the party defeats. The Mana Beast finally flies in and attacks the Fortress. The hero expresses reluctance to kill the Beast, fearing that with the dispersal of Mana from the world, the sprite will vanish.[20] With the sprite's encouragement, he uses the fully energized Mana Sword to slay the Beast, causing it to explode and transform into snow.[21] At the conclusion of the game, the hero is seen returning the Mana Sword to its place beneath the Potos waterfall.",
				"after": "Secret of Mana was directed and designed by Koichi Ishii, the creator of the game's Game Boy predecessor, Final Fantasy Adventure. He has stated that he feels Secret of Mana is more \"his game\" than other projects he has worked on, such as the Final Fantasy series.[22] The game was programmed primarily by Nasir Gebelli and produced by veteran Square designer Hiromichi Tanaka. The team hoped to build on the foundation of Final Fantasy Adventure, and they included several modified elements from that game and from other popular Square titles in Secret of Mana. In addition to having better graphics and sound quality than its predecessor, the attack power gauge was changed to be more engaging, and the weapon leveling system replaced Final Fantasy Adventure‍ '​s system of leveling up the speed of the attack gauge.[23] The party system also received an upgrade from the first Mana game: instead of temporary companions who could not be upgraded, party members became permanent protagonists and could be controlled by other players.[23] The multiplayer component was not a part of the original design, but was added when the developers realized that they could easily make all three characters human-controlled.[22]",
			"color": "black|0.50209 dim|0.17616 gray|0.17616 dim|0.17616 grey|0.17616 sienna|0.12515 dark|0.079062 salmon|0.079062  "
		}
	}
}
