{
	"add": {
		"doc": {
			"id": "147c1022cac13ce91cbd42825d6d01293ba53a3be92cc4ab4f636aaf6fd2b79a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Soyuz-TMA_descent_module.jpg/220px-Soyuz-TMA_descent_module.jpg",
			"previous": [],
				"after": "The reentry capsule (Russian: спускаемый аппарат (СА); Spuskaemyi apparat (SA)), also known as descent module, is used for launch and the journey back to Earth. Half of the reentry capsule is covered by a heat-resistant covering to protect it during reentry; this half faces the Earth during re-entry. It is slowed initially by the atmosphere, then by a braking parachute, followed by the main parachute which slows the craft for landing. At one meter above the ground, solid-fuel braking engines mounted behind the heat shield are fired to give a soft landing. One of the design requirements for the reentry capsule was for it to have the highest possible volumetric efficiency (internal volume divided by hull area). The best shape for this is a sphere, but such a shape can provide no lift, which results in a purely ballistic reentry. Ballistic reentries are hard on the occupants due to high deceleration and cannot be steered beyond their initial deorbit burn. That is why it was decided to go with the \"headlight\" shape that the Soyuz uses—a hemispherical forward area joined by a barely angled conical section (seven degrees) to a classic spherical section heat shield. This shape allows a small amount of lift to be generated due to the unequal weight distribution. The nickname was thought up at a time when nearly every headlight was circular. Small dimensions of the reentry capsule led to it having only two-man crews after the death of the Soyuz 11 crew. The later Soyuz T spacecraft solved this issue. Internal volume of Soyuz SA is 4 m³; 2.5 m³ is usable for crew (living space).",
			"color": "dark|0.29451 slate|0.29451 blue|0.29451 steel|0.15826 blue|0.15826 light|0.085882 steel|0.085882 blue|0.085882 light|0.073265 slate|0.073265 gray|0.073265 black|0.040693 slate|0.040317 gray|0.040317 midnight|0.036994 blue|0.036994 dark|0.034091 gray|0.034091 dark|0.034091 grey|0.034091 dim|0.033505 gray|0.033505 dim|0.033505 grey|0.033505 gray|0.026422 grey|0.026422 silver|0.024076 lavender|0.019272 light|0.012758 gray|0.012758 light|0.012758 grey|0.012758  "
		}
	}
}
