{
	"add": {
		"doc": {
			"id": "1490c00bdac3295b1105a9ca0200d00aea5fb80fe47f7efffc878f683555669a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Kent_Heritage_Festival.jpg/220px-Kent_Heritage_Festival.jpg",
			"previous": [],
				"after": "Cultural elements in Kent include various arts, environmental, and entertainment events during the year, as well as the Kent State University Museum. The Kent Heritage Festival is held every July in the downtown area, coinciding with the U.S. Independence Day. The festival includes crafts, booths, entertainment, train rides, 5K and 10K races, and fireworks, drawing approximately 25,000 people each year.[82] In October, Kent hosts the homecoming festivities for Kent State University, including a parade down East Main Street as well as other events and activities both on campus and around the city.[83] Also in October, the downtown area hosts an annual, yet unofficial, Halloween celebration, which usually takes place the last Saturday of October. The event typically draws thousands, largely Kent State students, and includes many who dress in costume.[84] In 2007 Main Street Kent, a local organization that promotes downtown Kent, created a family-oriented Halloween event downtown that precedes the unofficial celebration.[85] Since 2007, Kent has hosted an annual environmental festival known as \"Who's Your Mama?\" which takes place in conjunction with Earth Day. The festival has events at various locations in the city, such as a vegan chef competition, concerts, a film festival, guest speakers, and booths on environment-based topics.[86] Through Main Street Kent, additional events downtown include an ice cream social event in August, an outdoor concert series and \"sidewalk cinema\" between May and September, an art and wine festival in June, a cider festival in November, and the Festival of Lights Christmas celebration in early December.[85]",
			"color": "dark|0.11908 gray|0.11908 dark|0.11908 grey|0.11908 dim|0.1163 gray|0.1163 dim|0.1163 grey|0.1163 silver|0.11189 gray|0.094157 grey|0.094157 light|0.089074 sky|0.089074 blue|0.089074 black|0.073283 light|0.066081 gray|0.066081 light|0.066081 grey|0.066081 light|0.037894 steel|0.037894 blue|0.037894 gainsboro|0.034861 light|0.027779 blue|0.027779 slate|0.024544 gray|0.024544 light|0.020854 slate|0.020854 gray|0.020854 sky|0.016198 blue|0.016198 dark|0.012966 slate|0.012966 gray|0.012966 white|0.012915 smoke|0.012915 snow|0.010705 alice|0.010346 blue|0.010346 white|0.010077 ghost|0.0099745 white|0.0099745 sea|0.0098666 shell|0.0098666 mint|0.0096426 cream|0.0096426 floral|0.0089979 white|0.0089979 azure|0.0087355 lavender|0.0073728 blush|0.0073728 steel|0.0061257 blue|0.0061257 linen|0.0061141 powder|0.0058408 blue|0.0058408  "
		}
	}
}
