{
	"add": {
		"doc": {
			"id": "149fc977f2568b61a47702119e720635561d5134a7747bf45f7db47feb79940c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Wm_H_Taft_smiling_1908.jpg/260px-Wm_H_Taft_smiling_1908.jpg",
				"previous": "While serving as the War Secretary Taft generally concentrated on major developments, including the Philippines and the Panama Canal, to the detriment of departmental housekeeping problems, including factionalism within the Department, of which Roosevelt was aware.[28] In 1907 the Hay–Bunau-Varilla Treaty granted the U.S. construction rights for the Panama Canal, which Roosevelt delegated to the War Department, and Taft thereby supervised the beginning of construction on the Canal.[29] Taft promoted a reduction in the tariffs on sugar and tobacco in the Philippines, a position with which Roosevelt disagreed; Taft offered to resign but this was refused by Roosevelt.[30] Taft also had a disagreement with Roosevelt over the latter's conclusion of an executive agreement with the Dominican Republic, in lieu of what Taft thought should have been a treaty, requiring ratification by the Senate. Roosevelt dismissed the complaint as \"trifling\", and Taft, in his usual style, let it go.[31]",
				"after": "Theodore Roosevelt became president after William McKinley was assassinated in 1901. After getting elected president in his own right in 1904, on election night on the lawn of the White House, Roosevelt publicly declared he would not run for reelection in 1908, a decision that he immediately regretted. But he felt bound by his word. Taft was the logical successor, but he was initially reluctant to run, as he had been earlier. As a member of Roosevelt's cabinet, he had declared that his future ambition was to serve on the Supreme Court, not the White House. Taft's efforts in stumping for the party in the 1906 mid-term elections made him aware of his deficiencies as an effective campaigner. Mrs. Taft even commented during this time, \"never did he cease to regard a Supreme Court appointment as more desirable than the presidency.\"[32] But,Taft conceded, with his extensive involvement as the most prominent member of the cabinet, that he was the most \"available\" man;[33] thus he agreed that were he to be nominated for president, he would put his personal convictions aside and run a vigorous campaign.[34]",
			"color": " "
		}
	}
}
