{
	"add": {
		"doc": {
			"id": "14ad1a86a9cd40060e1e398e70bdb8756179206aa59182f31df14ed57abd5d1e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Altrincham_Town_Hall_-_geograph.org.uk_-_1313270.jpg/170px-Altrincham_Town_Hall_-_geograph.org.uk_-_1313270.jpg",
				"previous": "In 1754, a stretch of road south of Altrincham, along the Manchester to Chester route, was turnpiked. Turnpikes were toll roads which taxed passengers for the maintenance of the road. Further sections were turnpiked in 1765 from Timperley to Sale, and 1821 from Altrincham to Stockport. The maintenance of roads passed to local authorities in 1888, although by then most turnpike trusts had already declined.[13] The connection of the Bridgewater Canal to Altrincham in 1765 stimulated the development of market gardening, and for many years Altrincham was noted for its vegetables.[14] By 1767, warehouses had been built alongside the canal at Broadheath, the first step in the development of Broadheath as an industrial area and the beginning of Altrincham's industrialisation. The canal was connected in 1776 to the River Mersey, providing the town not only with a water route to Manchester, but also to the Irish Sea.[15]",
				"after": "Moves to connect the town to the UK's railway network gained pace in 1845, when the Act of Parliament for the construction of the Manchester South Junction and Altrincham Railway (MSJAR) was passed. The first train left Altrincham early on 20 July 1849, carrying 65 passengers. The MSJAR had two stations in the town: Altrincham, on Stockport Road, and Bowdon – though not actually in Bowdon – on Lloyd Street/Railway Street. Both were replaced in 1881 by Altrincham & Bowdon station on Stamford New Road.[16] The London and North Western Railway's station at Broadheath, on the town's northern edge, was opened in 1854, while a further connection was created on 12 May 1862 by the Cheshire Midland Railway (later the Cheshire Lines Committee), who opened their line from Altrincham to Knutsford.[17]",
			"color": "dim|0.59307 gray|0.59307 dim|0.59307 grey|0.59307 gray|0.19294 grey|0.19294 black|0.16097 dark|0.029739 gray|0.029739 dark|0.029739 grey|0.029739  "
		}
	}
}
