{
	"add": {
		"doc": {
			"id": "14bdb3c90771a4928a0940f6dce364e65be495894071cfd94b4856029004cb0c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Bundesarchiv_Bild_183-R43302%2C_Kaiser_Wilhelm_II._und_Zar_Nikolaus_II..jpg/220px-Bundesarchiv_Bild_183-R43302%2C_Kaiser_Wilhelm_II._und_Zar_Nikolaus_II..jpg",
				"previous": "On 28 June 1914, Archduke Franz Ferdinand was assassinated by Gavrilo Princip in Sarajevo. Nicholas vacillated as to Russia's course of action. The outbreak of war was not inevitable, but leaders, diplomats and nineteenth-century alliances created a climate for large-scale conflict. The concept of Pan-Slavism and ethnicity allied Russia and Serbia in a treaty of protection, and Germany and Austria were similarly allied. Territorial conflict created rivalries between Germany and France and between Austria and Serbia, and as a consequence alliance networks developed across Europe. The Triple Entente and Triple Alliance networks were set before the war. The assassination of Ferdinand tripped these alliance networks bringing each country into conflict with one another as each independently declared war. Nicholas wanted neither to abandon Serbia to the ultimatum of Austria-Hungary, nor to provoke a general war. In a series of letters exchanged with Kaiser Wilhelm of Germany (the so-called \"Willy and Nicky correspondence\") the two proclaimed their desire for peace, and each attempted to get the other to back down. Nicholas desired that Russia's mobilisation be only against the Austrian border, in the hopes of preventing war with the German Empire.",
				"after": "However, his army had no contingency plans for a partial mobilisation, and on 31 July 1914 Nicholas took the fateful step of confirming the order for general mobilisation, despite being strongly counselled against it. On 25 July 1914, the council of ministers was held in Krasnoye Selo at which Tsar Nicholas II decided to intervene in the Austro-Serbian conflict, a step toward general war. He put the Russian army on \"alert\"[62] on 25 July. Although this was not mobilisation, it threatened the German and Austrian borders and looked like a military declaration of war.[62]",
			"color": " "
		}
	}
}
