{
	"add": {
		"doc": {
			"id": "14d071ee6c9f7325cdaf54c56eba8fc8d06592cd2859e4b761aa46a0e1e3f6fb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Space_Shuttle_Columbia_lands_following_STS-28_in_1989.jpg/220px-Space_Shuttle_Columbia_lands_following_STS-28_in_1989.jpg",
				"previous": "Externally, Columbia was the first orbiter in the fleet whose surface was mostly covered with High & Low Temperature Reusable Surface Insulation (HRSI/LRSI) tiles as its main thermal protection system (TPS), with white silicone rubber-painted Nomex — known as Felt Reusable Surface Insulation (FRSI) blankets – in some areas on the wings, fuselage and payload bay doors. FRSI once covered almost 25% of the orbiter; the first upgrade resulted in its removal from many areas, and in later flights it was only used on the upper section of the payload bay doors and inboard sections of the upper wing surfaces.[9] The upgrade also involved replacing many of the white LRSI tiles on the upper surfaces with Advanced Flexible Reusable Surface Insulation (AFRSI) blankets (also known as Fibrous Insulation Blankets, or FIBs) that had been used on Discovery and Atlantis. Originally, Columbia had 32,000 tiles – the upgrade reduced this to 24,300. The AFRSI blankets consisted of layers of pure silica felt sandwiched between a layer of silica fabric on the outside and S-Glass fabric on the inside, stitched together using pure silica thread in a 1-inch grid, then coated with a high-purity silica coating. The blankets were semi-rigid and could be made as large as 30\" by 30\". Each blanket replaced as many as 25 tiles and was bonded directly to the orbiter.[9] The direct application of the blankets to the orbiter resulted in weight reduction, improved durability, reduced fabrication and installation cost, and reduced installation schedule time.[10] All of this work was performed during Columbia's first retrofitting and the post-Challenger stand-down.",
				"after": "Despite refinements to the orbiter's thermal protection system and other enhancements, Columbia would never weigh as little unloaded as the other orbiters in the fleet. The next-oldest shuttle, Challenger, was also relatively heavy, although 2,200 lb (1,000 kg) lighter than Columbia.",
			"color": "light|0.24446 slate|0.24446 gray|0.24446 slate|0.22868 gray|0.22868 black|0.19325 antique|0.024708 white|0.024708 blanched|0.024289 almond|0.024289 papaya|0.023992 whip|0.023992 bisque|0.021669 dim|0.020081 gray|0.020081 dim|0.020081 grey|0.020081 corn|0.019592 silk|0.019592 beige|0.017968 wheat|0.017118 dark|0.015281 slate|0.015281 gray|0.015281 light|0.013048 yellow|0.013048 light|0.012951 golden|0.012951 rod|0.012951 yellow|0.012951 old|0.012075 lace|0.012075 gray|0.011466 grey|0.011466 dark|0.011078 gray|0.011078 dark|0.011078 grey|0.011078  "
		}
	}
}
