{
	"add": {
		"doc": {
			"id": "14d3c16c1e5f1dd46323c85c59018d04e5d493d8c4576a567cc9eb45b36efd9e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Confucius_-_Project_Gutenberg_eText_15250.jpg/170px-Confucius_-_Project_Gutenberg_eText_15250.jpg",
				"previous": "The origins of Babylonian philosophy can be traced back to the wisdom of early Mesopotamia, which embodied certain philosophies of life, particularly ethics, in the forms of dialectic, dialogues, epic poetry, folklore, hymns, lyrics, prose, and proverbs. The reasoning and rationality of the Babylonians developed beyond empirical observation.[26] The Babylonian text Dialog of Pessimism contains similarities to the agnostic thought of the sophists, the Heraclitean doctrine of contrasts, and the dialogues of Plato, as well as a precursor to the maieutic Socratic method of Socrates and Plato.[27] The Milesian philosopher Thales is also traditionally said to have studied philosophy in Mesopotamia.",
				"after": "Philosophy has had a tremendous effect on Chinese civilization, and throughout East Asia. The majority of Chinese philosophy originates in the Spring and Autumn and Warring States era, during a period known as the \"Hundred Schools of Thought\",[28] which was characterized by significant intellectual and cultural developments.[28] It was during this era that the major philosophies of China, Confucianism, Mohism, Legalism, and Taoism, arose, along with philosophies that later fell into obscurity, like Agriculturalism, Chinese Naturalism, and the Logicians. Of the many philosophical schools of China, only Confucianism and Taoism existed after the Qin Dynasty suppressed any Chinese philosophy that was opposed to Legalism.",
			"color": "dim|0.079066 gray|0.079066 dim|0.079066 grey|0.079066 sea|0.060818 shell|0.060818 floral|0.059655 white|0.059655 white|0.058532 smoke|0.058532 snow|0.055689 mint|0.054767 cream|0.054767 white|0.053766 ghost|0.045152 white|0.045152 azure|0.044896 dark|0.040211 gray|0.040211 dark|0.040211 grey|0.040211 alice|0.039691 blue|0.039691 gray|0.039479 grey|0.039479 silver|0.034906 lavender|0.031078 blush|0.031078 linen|0.029745 light|0.029277 gray|0.029277 light|0.029277 grey|0.029277 ivory|0.028649 gainsboro|0.023519 peach|0.022733 puff|0.022733 old|0.020306 lace|0.020306 light|0.020118 slate|0.020118 gray|0.020118 slate|0.018042 gray|0.018042 antique|0.014429 white|0.014429 bisque|0.010503 honeydew|0.0089372 beige|0.0084755 papaya|0.0078247 whip|0.0078247 blanched|0.0068491 almond|0.0068491 tan|0.0064056 misty|0.006216 rose|0.006216 corn|0.0059597 silk|0.0059597 light|0.0059483 steel|0.0059483 blue|0.0059483  "
		}
	}
}
