{
	"add": {
		"doc": {
			"id": "14dd2696cfddc2a1735fa2e56081d54ea2b95e1e082b23c53f077cf51fd57d55",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Turdus_philomelos_-Apenheul_Primate_Park%2C_Netherlands_-eggs-8.jpg/170px-Turdus_philomelos_-Apenheul_Primate_Park%2C_Netherlands_-eggs-8.jpg",
				"previous": "During migration, the song thrush travels mainly at night with a strong and direct flight action. It flies in loose flocks which cross the sea on a broad front rather than concentrating at short crossings (as occurs in the migration of large soaring birds), and calls frequently to maintain contact.[9] Migration may start as early as late August in the most easterly and northerly parts of the range, but the majority of birds, with shorter distances to cover, head south from September to mid-December. However, hard weather may force further movement. Return migration varies between mid-February around the Mediterranean to May in northern Sweden and central Siberia.[9] Vagrants have been recorded in Greenland, various Atlantic islands, and West Africa.[9]",
				"after": "The female song thrush builds a neat cup-shaped nest lined with mud and dry grass in a bush, tree or creeper, or, in the case of the Hebridean subspecies, on the ground. She lays four or five bright glossy blue eggs which are lightly spotted with black or purple;[9] they are typically 2.7 x 2.0 centimetres (0.79 x 1.06 in) in size and weigh 6.0 grammes (0.21 oz), of which 6% is shell.[3] The female incubates the eggs alone for 10–17 days, and after hatching a similar time elapses until the young fledge. Two or three broods in a year is normal, although only one may be raised in the north of the range.[9] On average, 54.6% of British juveniles survive the first year of life, and the adult annual survival rate is 62.2%. The typical lifespan is three years, but the maximum recorded age is 10 years 8 months.[3] The song thrush is occasionally a host of parasitic cuckoos, such as the common cuckoo, but this is very rare because the thrush recognizes the cuckoo's non-mimetic eggs.[21] However, the song thrush does not demonstrate the same aggression toward the adult cuckoo that is shown by the blackbird.[22] The introduced birds in New Zealand, where the cuckoo does not occur, have, over the past 130 years, retained the ability to recognise and reject non-mimetic eggs.[23]",
			"color": "cadet|0.43824 blue|0.43824 dim|0.095141 gray|0.095141 dim|0.095141 grey|0.095141 light|0.090686 blue|0.090686 black|0.086445 sky|0.076151 blue|0.076151 dark|0.061381 slate|0.061381 gray|0.061381 gray|0.06136 grey|0.06136 teal|0.021867 light|0.020844 steel|0.020844 blue|0.020844  "
		}
	}
}
