{
	"add": {
		"doc": {
			"id": "14f2005fa87f228934a80b6e239b124901fa9c02a9dd8016888e91da823a9faa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Revolutionary_Joyce.jpg/170px-Revolutionary_Joyce.jpg",
				"previous": "In the 20th century, Ireland produced four winners of the Nobel Prize for Literature: George Bernard Shaw, William Butler Yeats, Samuel Beckett and Seamus Heaney. Although not a Nobel Prize winner, James Joyce is widely considered to be one of the most significant writers of the 20th century. Joyce's 1922 novel Ulysses is considered one of the most important works of Modernist literature and his life is celebrated annually on 16 June in Dublin as \"Bloomsday\".[154] Modern Irish literature is often connected with its rural heritage[155] through writers such as John McGahern and poets such as Seamus Heaney.",
				"after": "Music has been in evidence in Ireland since prehistoric times.[156] Although in the early Middle Ages the church was \"quite unlike its counterpart in continental Europe\",[157] there was considerable interchange between monastic settlements in Ireland and the rest of Europe that contributed to what is known as Gregorian chant. Outside religious establishments, musical genres in early Gaelic Ireland are referred to as a triad of weeping music (goltraige), laughing music (geantraige) and sleeping music (suantraige).[158] Vocal and instrumental music (e.g. for the harp, pipes, and various string instruments) was transmitted orally, but the Irish harp, in particular, was of such significance that it became Ireland's national symbol. Classical music following European models first developed in urban areas, in establishments of Anglo-Irish rule such as Dublin Castle, St Patrick's Cathedral and Christ Church as well as the country houses of the Anglo-Irish ascendancy, with the first performance of Handel's Messiah (1742) being among the highlights of the baroque era. In the 19th century, public concerts provided access to classical music to all classes of society. Yet, for political and financial reasons Ireland has been too small to provide a living to many musicians, so the names of the better-known Irish composers of this time belong to emigrants.",
			"color": "tan|0.3509 dim|0.1614 gray|0.1614 dim|0.1614 grey|0.1614 wheat|0.15324  "
		}
	}
}
