{
	"add": {
		"doc": {
			"id": "150e09884947f36b5d27b9fe54b5aa53250b7cdfc6730c50da8e450b4ece10c7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Northwest_Airlines-KLM_DC-10_hybrid_livery_Spijkers.jpg/220px-Northwest_Airlines-KLM_DC-10_hybrid_livery_Spijkers.jpg",
				"previous": "Northwest was purchased in a 1989 leveraged buyout by an investment group headed by Al Checchi, Fred Malek and Gary Wilson, with KLM, and many others. To pay off the debt incurred in their takeover, the new management sold many of the airline's aircraft to leasing companies, and sold property around the world, including land in central Tokyo. The expense of the buyout was so great that in 1993, following several years of losses due to industry overcapacity and a traffic downturn following the Gulf War, Northwest threatened bankruptcy unless its employee groups agreed to three years of wage cuts. After signing the concessionary agreements, Northwest made its first profit since 1989.",
				"after": "Also in 1993, Northwest began its strategic alliance with KLM, which was the largest airline partnership ever conceived at the time. This partnership eventually became the Wings Alliance. However, the alliance never grew beyond the two airlines. Northwest gradually pulled out of its minor European destinations and once more focused its attention on the domestic and Asian markets. On May 1, 1996 Northwest began its first nonstop service from the U.S. to China, on the Detroit–Beijing route. Nonstop Detroit-Shanghai service followed in April 2000. Later, these nonstop services were suspended in 2002 due to the outbreak of severe acute respiratory syndrome (SARS).[citation needed] Northwest then served these routes via Tokyo. The airline sought government approval to restore nonstop Detroit-Shanghai service in March 2007 but lost its bid to United's Washington Dulles-Beijing route; however, before their merger with Delta Air Lines, Northwest received tentative authority to restart nonstop Detroit-Shanghai service starting March 25, 2009.",
			"color": "black|0.21193 dim|0.17124 gray|0.17124 dim|0.17124 grey|0.17124 gray|0.075672 grey|0.075672 deep|0.075004 sky|0.075004 blue|0.075004 dark|0.062214 gray|0.062214 dark|0.062214 grey|0.062214 dark|0.049146 slate|0.049146 gray|0.049146 silver|0.046708 light|0.037071 gray|0.037071 light|0.037071 grey|0.037071 gainsboro|0.028123 sky|0.017646 blue|0.017646 slate|0.014043 gray|0.014043 light|0.01314 slate|0.01314 gray|0.01314 linen|0.0096937 white|0.0095967 smoke|0.0095967 pale|0.0095301 turquoise|0.0095301 sea|0.0078827 shell|0.0078827 floral|0.0076073 white|0.0076073 light|0.0075698 sky|0.0075698 blue|0.0075698 cadet|0.0071313 blue|0.0071313 mint|0.0067962 cream|0.0067962 old|0.0061811 lace|0.0061811 powder|0.0057818 blue|0.0057818  "
		}
	}
}
