{
	"add": {
		"doc": {
			"id": "151471048dc83ce0d63f8bc29a5fab5fbc13f208fe41f8adc08df1f243e5a6f2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Faroe_stamp_401_fin_whale_%28Balaenoptera_physalus%29.jpg/150px-Faroe_stamp_401_fin_whale_%28Balaenoptera_physalus%29.jpg",
			"previous": [],
				"after": "North Atlantic fin whales are defined by the International Whaling Commission to exist in one of seven discrete population zones: Nova Scotia-New England, Newfoundland-Labrador, western Greenland, eastern Greenland-Iceland, North Norway, West Norway-Faroe Islands, and Ireland-Spain-United Kingdom-Portugal. Results of mark-and-recapture surveys have indicated that some movement occurs across the boundaries of these zones, suggesting that they are not entirely discrete and that some immigration and emigration does occur.[61] Sigurjónsson estimated in 1995 that total pre-exploitation population size in the entireNorth Atlantic ranged between 50,000 and 100,000 animals,[68] but his research is criticized for lack of supporting data and an explanation of his reasoning.[17] In 1977, D.E. Sergeant suggested a \"primeval\" aggregate total of 30,000 to 50,000 throughout the North Atlantic.[69] Of that number, 8,000 to 9,000 would have resided in the Newfoundland and Nova Scotia areas, with whales summering in U.S. waters south of Nova Scotia presumably omitted.[17][70] J.M. Breiwick estimated that the \"exploitable\" (above the legal size limit of ft50) component of the Nova Scotia population was 1,500 to 1,600 animals in 1964, reduced to only about 325 in 1973.[71] Two aerial surveys in Canadian waters since the early 1970s gave numbers of 79 to 926 whales on the eastern Newfoundland-Labrador shelf in August 1980,[72] and a few hundred in the northern and central Gulf of Saint Lawrence in August 1995 – 1996.[73] Summer estimates in the waters off western Greenland range between 500 and 2,000,[74] and in 1974, Jonsgard considered the fin whales off Western Norway and the Faroe Islands to \"have been considerably depleted in postwar years, probably by overexploitation\".[75] The population around Iceland appears to have fared much better, and in 1981, the population appeared to have undergone only a minor decline since the early 1960s.[76] Surveys during the summers of 1987 and 1989 estimated of 10,000 to 11,000 between eastern Greenland and Norway.[77] This shows a substantial recovery when compared to a survey in 1976 showing an estimate of 6,900, which was considered to be a \"slight\" decline since 1948.[78] A Spanish NASS survey in 1989 of the France-Portugal-Spain sub-area estimated a summer population range at 17,355.[79] The aggregate population level is estimated to be between 40,000[80] and 56,000[32] individuals.",
			"color": "light|0.30422 slate|0.30422 gray|0.30422 slate|0.22501 gray|0.22501 light|0.20747 steel|0.20747 blue|0.20747 steel|0.097714 blue|0.097714 light|0.05101 blue|0.05101 dark|0.016677 gray|0.016677 dark|0.016677 grey|0.016677  "
		}
	}
}
