{
	"add": {
		"doc": {
			"id": "1521a6bc634049feaf004fc6902266aac2b9107930dcbcfdc1a2259d612bd4bf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Carboxysome_3_images.png/450px-Carboxysome_3_images.png",
				"previous": "Many important biochemical reactions, such as energy generation, use concentration gradients across membranes. The general lack of internal membranes in bacteria means reactions such as electron transport occur across the cell membrane between the cytoplasm and the periplasmic space.[51] However, in many photosynthetic bacteria the plasma membrane is highly folded and fills most of the cell with layers of light-gathering membrane.[52] These light-gathering complexes may even form lipid-enclosed structures called chlorosomes in green sulfur bacteria.[53] Other proteins import nutrients across the cell membrane, or expel undesired molecules from the cytoplasm.",
				"after": "Bacteria do not have a membrane-bound nucleus, and their genetic material is typically a single circular DNA chromosome located in the cytoplasm in an irregularly shaped body called the nucleoid.[55] The nucleoid contains the chromosome with its associated proteins and RNA. The phylum Planctomycetes[56] and candidate phylum Poribacteria[57] may be exceptions to the general absence of internal membranes in bacteria, because they appear to have a double membrane around their nucleoids and contain other membrane-bound cellular structures. Like all living organisms, bacteria contain ribosomes, often grouped in chains called polyribosomes, for the production of proteins, but the structure of the bacterial ribosome is different from that of eukaryotes and Archaea.[58] Bacterial ribosomes have a sedimentation rate of 70S (measured in Svedberg units): their subunits have rates of 30S and 50S. Some antibiotics bind specifically to 70S ribosomes and inhibit bacterial protein synthesis. Those antibiotics kill bacteria without affecting the larger 80S ribosomes of eukaryotic cells and without harming the host.",
			"color": "lime|0.19507 green|0.19507 dark|0.16782 green|0.16782 forest|0.11586 green|0.11586 green|0.10578 olive|0.045868 black|0.038892 gray|0.032938 grey|0.032938 firebrick|0.03273 dark|0.031067 red|0.031067 maroon|0.028978 lime|0.028714 dark|0.024883 gray|0.024883 dark|0.024883 grey|0.024883 dark|0.017997 khaki|0.017997  "
		}
	}
}
