{
	"add": {
		"doc": {
			"id": "1524a6e4cfecba82b2bf90b5e51cb935d4e9732149e983079d540514bd91dc21",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Seiko_35A.jpg/220px-Seiko_35A.jpg",
				"previous": "The first prototypes of an electronic quartz wristwatch (not just portable quartz watches as the Seiko timekeeping devices at the Tokyo Olympics in 1964) were made by the CEH research laboratory in Neuchâtel, Switzerland. From 1965 through 1967 pioneering development work was done on a miniaturized 8192 Hz quartz oscillator, a thermo-compensation module and an inhouse-made, dedicated integrated circuit (unlike the hybrid circuits used in the later Seiko Astron wristwatch). As a result, the BETA 1 prototype set new timekeeping performance records at the International Chronometric Competition held at the Observatory of Neuchâtel in 1967.[24] In 1970, 18 manufacturers exhibited production versions of the beta 21 wristwatch, including the Omega Electroquartz as well as Patek Philippe, Rolex Oysterquartz and Piaget",
				"after": "The first quartz watch to enter production was the Seiko 35 SQ Astron, which hit the shelves on 25 December 1969, swiftly followed by the Swiss Beta 21, and then a year later the prototype of one of the world's most accurate wristwatches to date: the Omega Marine Chronometer. Thanks to the technology having been developed by the Swiss, Seiko could not patent the whole movement of the quartz wristwatch, thus allowing other manufacturers to participate in the rapid growth and development of the quartz watch market, This ended — in less than a decade — almost 100 years of dominance by the mechanical wristwatch legacy. Modern quartz movements are produced in very large quantities, and even the cheapest wristwatches typically have quartz movements. Whereas mechanical movements can typically be off by several seconds a day, an inexpensive quartz movement in a child's wristwatch may still be accurate to within half a second per day — ten times better than a mechanical movement.[25]",
			"color": "silver|0.42871 gray|0.21241 grey|0.21241 dark|0.13212 gray|0.13212 dark|0.13212 grey|0.13212 dim|0.099269 gray|0.099269 dim|0.099269 grey|0.099269 light|0.030106 gray|0.030106 light|0.030106 grey|0.030106 gainsboro|0.011542 sandy|0.011183 brown|0.011183 sienna|0.010926 tan|0.0086028 chocolate|0.0071756  "
		}
	}
}
