{
	"add": {
		"doc": {
			"id": "15263a835d43b412e6ba96d352318a7330d7885a2bf4ddce7279e14b675065f0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Edgbaston_-_view_of_new_stand_from_the_north.jpg/220px-Edgbaston_-_view_of_new_stand_from_the_north.jpg",
				"previous": "Birmingham has played an important part in the history of sport. The Football League – the world's first league football competition – was founded by Birmingham resident and Aston Villa director William McGregor, who wrote to fellow club directors in 1888 proposing \"that ten or twelve of the most prominent clubs in England combine to arrange home-and-away fixtures each season\".[268] The modern game of tennis was developed between 1859 and 1865 by Harry Gem and his friend Augurio Perera at Perera's house in Edgbaston,[269] with the Edgbaston Archery and Lawn Tennis Society remaining the oldest tennis club in the world.[270] The Birmingham and District Cricket League is the oldest cricket league in the world,[271] and Birmingham was the host for the first ever Cricket World Cup, a Women's Cricket World Cup in 1973.[272] Birmingham was the first city to be named National City of Sport by the Sports Council.[273] Birmingham was selected ahead of London and Manchester to bid for the 1992 Summer Olympics,[274] but was unsuccessful in the final selection process, which was won by Barcelona.[275]",
				"after": "Today the city is home of two of the country's oldest professional football teams: Aston Villa F.C., which was founded in 1874 and plays at Villa Park; and Birmingham City F.C., which was founded in 1875 and plays at St Andrew's. Rivalry between the clubs is fierce and the fixture between the two is called the Second City derby.[276] Aston Villa currently play in the Premier League and have been League champions on seven occasions and European Champions in 1982. Birmingham City currently play in the Championship, the second tier of English football. Another Premier League club, West Bromwich Albion F.C., play just outside the city boundaries at The Hawthorns.",
			"color": "olive|0.65807 drab|0.65807 black|0.068394 gray|0.061674 grey|0.061674 dim|0.060031 gray|0.060031 dim|0.060031 grey|0.060031 dark|0.03429 gray|0.03429 dark|0.03429 grey|0.03429 slate|0.018599 gray|0.018599 light|0.016018 slate|0.016018 gray|0.016018 silver|0.011803 dark|0.010895 slate|0.010895 gray|0.010895  "
		}
	}
}
