{
	"add": {
		"doc": {
			"id": "152771964e892f6c9d4e6ae67c03cd3ec71cac393872a8b41b3013fd19e2816e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/US_78.svg/20px-US_78.svg.png",
				"previous": "Interstate 26 enters the city from the northwest and connects the city to North Charleston, the Charleston International Airport, Interstate 95, and Columbia, South Carolina. It ends in downtown Charleston with exits to the Septima Clark Expressway, the Arthur Ravenel, Jr. Bridge and Meeting Street. The Arthur Ravenel, Jr. Bridge and Septima Clark Expressway are part of U.S. Highway 17, which travels east-west through the cities of Charleston and Mount Pleasant. The Mark Clark Expressway, or Interstate 526, is the bypass around the city and begins at U.S. Highway 17 North/South. U.S. Highway 52 is Meeting Street and its spur is East Bay Street, which becomes Morrison Drive after leaving the Eastside. This highway merges with King Street in the city's Neck area (Industrial District). U.S. Highway 78 is King Street in the downtown area, eventually merging with Meeting Street.",
				"after": "The Arthur Ravenel Jr. Bridge across the Cooper River opened on July 16, 2005, and was the second longest cable-stayed bridge in the Americas at the time of its construction.[citation needed] The bridge links Mount Pleasant with downtown Charleston, and has eight lanes plus a 12-foot lane shared by pedestrians and bicycles. It replaced the Grace Memorial Bridge (built in 1929) and the Silas N. Pearman Bridge (built in 1966). They were considered two of the more dangerous bridges in America and were demolished after the Ravenel Bridge opened.",
			"color": "dark|0.082787 gray|0.082787 dark|0.082787 grey|0.082787 white|0.07494 smoke|0.07494 snow|0.069678 white|0.068991 ghost|0.068962 white|0.068962 alice|0.067424 blue|0.067424 sea|0.065863 shell|0.065863 mint|0.065586 cream|0.065586 silver|0.06418 floral|0.060558 white|0.060558 azure|0.060047 light|0.054555 gray|0.054555 light|0.054555 grey|0.054555 gray|0.051373 grey|0.051373 lavender|0.047679 blush|0.047679 gainsboro|0.047226 dim|0.019669 gray|0.019669 dim|0.019669 grey|0.019669 ivory|0.018964 linen|0.011518  "
		}
	}
}
