{
	"add": {
		"doc": {
			"id": "15399d3c0a5214d695208563140ac315b9e999a7e6ae10b97ef2901533a1dab0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Birds_in_Al-Areen_Wildlife_Park.jpg/220px-Birds_in_Al-Areen_Wildlife_Park.jpg",
			"previous": [],
				"after": "More than 330 species of birds were recorded in the Bahrain archipelago, 26 species of which breed in the country. Millions of migratory birds pass through the Persian Gulf region in the winter and autumn months.[132] One globally endangered species, Chlamydotis undulata, is a regular migrant in the autumn.[132] The many islands and shallow seas of Bahrain are globally important for the breeding of the Phalacrocorax nigrogularis species of bird, up to 100,000 pairs of these birds were recorded over the Hawar islands.[132] Only 18 species of mammals are found in Bahrain, animals such as Gazelles, desert rabbits and hedgehogs are common in the wild but the Arabian Oryx was hunted to extinction on the island.[132] 25 species of amphibians and reptiles were recorded as well as 21 species of butterflies and 307 species of flora.[132] The marine biotopes are diverse and include extensive sea grass beds and mudflats, patchy coral reefs as well as offshore islands. Sea grass beds are important foraging grounds for some threatened species such as dugongs and the green turtle.[133] In 2003, Bahrain banned the capture of sea cows, marine turtles and dolphins within its territorial waters.[132]",
			"color": "dark|0.26382 gray|0.26382 dark|0.26382 grey|0.26382 gray|0.17262 grey|0.17262 dark|0.12868 slate|0.12868 gray|0.12868 silver|0.10198 dim|0.091722 gray|0.091722 dim|0.091722 grey|0.091722 light|0.037337 blue|0.037337 light|0.033303 steel|0.033303 blue|0.033303 light|0.032241 gray|0.032241 light|0.032241 grey|0.032241 gainsboro|0.022076 dark|0.0096813 olive|0.0096813 green|0.0096813 lavender|0.0088514 alice|0.0079912 blue|0.0079912 powder|0.0075215 blue|0.0075215 black|0.0074564 light|0.0060032 slate|0.0060032 gray|0.0060032 white|0.0049933 smoke|0.0049933 slate|0.0049108 gray|0.0049108  "
		}
	}
}
