{
	"add": {
		"doc": {
			"id": "15475947e94bf721d4fee9e16473f303bcf1536e29badcd41db15769fc692a57",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Melbourne_recruiting_WWI.jpg/220px-Melbourne_recruiting_WWI.jpg",
				"previous": "In the east, the Russians invaded with two armies. In response, Germany rapidly moved the 8th Field Army from its previous role as reserve for the invasion of France, to East Prussia by rail across the German Empire. This army, led by general Paul von Hindenburg defeated Russia in a series of battles collectively known as the First Battle of Tannenberg (17 August – 2 September). While the Russian invasion failed, it caused the diversion of German troops to the east, allowing the tactical Allied victory at the First Battle of the Marne. This meant that Germany failed to achieve its objective of avoiding a long two-front war. However, the German army had fought its way into a good defensive position inside France and effectively halved France's supply of coal. It had also killed or permanently crippled 230,000 more French and British troops than it itself had lost. Despite this, communications problems and questionable command decisions cost Germany the chance of a more decisive outcome.[46]",
				"after": "New Zealand occupied German Samoa (later Western Samoa) on 30 August 1914. On 11 September, the Australian Naval and Military Expeditionary Force landed on the island of Neu Pommern (later New Britain), which formed part of German New Guinea. On 28 October, the German cruiser SMS Emden sank the Russian cruiser Zhemchug in the Battle of Penang. Japan seized Germany's Micronesian colonies and, after the Siege of Tsingtao, the German coaling port of Qingdao on the Chinese Shandong peninsula. As Vienna refused to withdraw the Austro-Hungarian cruiser SMS Kaiserin Elisabeth from Tsingtao, Japan declared war not only on Germany, but also on Austria-Hungary; the ship participated in the defense of Tsingtao where it was sunk in November 1914.[47] Within a few months, the Allied forces had seized all the German territories in the Pacific; only isolated commerce raiders and a few holdouts in New Guinea remained.[48][49]",
			"color": " "
		}
	}
}
