{
	"add": {
		"doc": {
			"id": "15621a02a531ae7a8cf13cd39ee7e4039c601e9d09329d85aaa30d48ea515ca1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/JoshuaReynoldsParty.jpg/300px-JoshuaReynoldsParty.jpg",
				"previous": "On 16 March 1756, Johnson was arrested for an outstanding debt of £5 18s. Unable to contact anyone else, he wrote to the writer and publisher Samuel Richardson. Richardson, who had previously lent Johnson money, sent him six guineas to show his good will, and the two became friends.[103] Soon after, Johnson met and befriended the painter Joshua Reynolds, who so impressed Johnson that he declared him \"almost the only man whom I call a friend\".[104] Reynolds' younger sister Frances observed during their time together \"that men, women and children gathered around him [Johnson]\", laughing at his gestures and gesticulations.[105] In addition to Reynolds, Johnson was close to Bennet Langton and Arthur Murphy. Langton was a scholar and an admirer of Johnson who persuaded his way into a meeting with Johnson which led to a long friendship. Johnson met Murphy during the summer of 1754 after Murphy came to Johnson about the accidental republishing of the Rambler No. 190, and the two became friends.[106] Around this time, Anna Williams began boarding with Johnson. She was a minor poet who was poor and becoming blind, two conditions that Johnson attempted to change by providing room for her and paying for a failed cataract surgery. Williams, in turn, became Johnson's housekeeper.[107]",
				"after": "To occupy himself, Johnson began to work on The Literary Magazine, or Universal Review, the first issue of which was printed on 19 March 1756. Philosophical disagreements erupted over the purpose of the publication when the Seven Years' War began and Johnson started to write polemical essays attacking the war. After the war began, the Magazine included many reviews, at least 34 of which were written by Johnson.[108] When not working on the Magazine, Johnson wrote a series of prefaces for other writers, such as Giuseppe Baretti, William Payne and Charlotte Lennox.[109] Johnson's relationship with Lennox and her works was particularly close during these years, and she in turn relied so heavily upon Johnson that he was \"the most important single fact in Mrs Lennox's literary life\".[110] He later attempted to produce a new edition of her works, but even with his support they were unable to find enough interest to follow through with its publication.[111] To help with domestic duties while Johnson was busy with his various projects, Richard Bathurst, a physician and a member of Johnson's Club, pressured him to take on a freed slave, Francis Barber, as his servant.[112]",
			"color": "dim|0.23534 gray|0.23534 dim|0.23534 grey|0.23534 black|0.22417 gray|0.12964 grey|0.12964 dark|0.095117 gray|0.095117 dark|0.095117 grey|0.095117  "
		}
	}
}
