{
	"add": {
		"doc": {
			"id": "156a6334586b18091eefbfec01485c330b5411b3a7ce6061accc5efcef71ef23",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Park_Geun-Hye_meeting_with_Barack_Obama.jpg/170px-Park_Geun-Hye_meeting_with_Barack_Obama.jpg",
			"previous": [],
				"after": "The United States engaged in the decolonization of Korea (mainly in the South, with the Soviet Union engaged in North Korea) from Japan after World War II. After three years of military administration by the United States, the South Korean government was established. Upon the onset of the Korean War, U.S. forces were sent to defend against an invasion from North Korea of the South. Following the Armistice, South Korea and the U.S. agreed to a \"Mutual Defense Treaty\", under which an attack on either party in the Pacific area would summon a response from both.[129] In 1967, South Korea obliged the mutual defense treaty, by sending a large combat troop contingent to support the United States in the Vietnam War. The U.S. Eighth Army, Seventh Air Force, and U.S. Naval Forces Korea are stationed in South Korea. The two nations have strong economic, diplomatic, and military ties, although they have at times disagreed with regard to policies towards North Korea, and with regard to some of South Korea's industrial activities that involve usage of rocket or nuclear technology. There had also been strong anti-American sentiment during certain periods, which has largely moderated in the modern day.[130] In 2007, a free trade agreement known as the Republic of Korea-United States Free Trade Agreement (KORUS FTA) was signed between South Korea and the United States, but its formal implementation was repeatedly delayed, pending approval by the legislative bodies of the two countries. On October 12, 2011, the U.S. Congress passed the long-stalled trade agreement with South Korea.[131] It went into effect on March 15, 2012.[132]",
			"color": "black|0.5894 light|0.051369 gray|0.051369 light|0.051369 grey|0.051369 dark|0.048257 olive|0.048257 green|0.048257 gainsboro|0.045556 antique|0.031167 white|0.031167 dim|0.022582 gray|0.022582 dim|0.022582 grey|0.022582 linen|0.021899 corn|0.021654 flower|0.021654 blue|0.021654 silver|0.021431 tan|0.019574 dark|0.01313 gray|0.01313 dark|0.01313 grey|0.01313 gray|0.011618 grey|0.011618 steel|0.0093834 blue|0.0093834 old|0.0090262 lace|0.0090262 papaya|0.0083359 whip|0.0083359  "
		}
	}
}
