{
	"add": {
		"doc": {
			"id": "159bb372f9f313c66e746b30382dfaa60ca9e4ac679ee14472b55cdb13ccc395",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Ciconia_ciconia_-Vogelpark_Avifauna%2C_The_Netherlands_-juvenile-8a.jpg/170px-Ciconia_ciconia_-Vogelpark_Avifauna%2C_The_Netherlands_-juvenile-8a.jpg",
				"previous": "As with other storks, the wings are long and broad enabling the bird to soar.[21] In flapping flight its wingbeats are slow and regular. It flies with its neck stretched forward and with its long legs extended well beyond the end of its short tail. It walks at a slow and steady pace with its neck upstretched. In contrast, it often hunches its head between its shoulders when resting.[22] Moulting has not been extensively studied, but appears to take place throughout the year, with the primary flight feathers replaced over the breeding season.[19]",
				"after": "Upon hatching, the young white stork is partly covered with short, sparse, whitish down feathers. This early down is replaced about a week later with a denser coat of woolly white down. By three weeks, the young bird acquires black scapulars and flight feathers. On hatching the chick has pinkish legs, which turn to greyish-black as it ages. Its beak is black with a brownish tip.[19] By the time it fledges, the juvenile bird's plumage is similar to that of the adult, though its black feathers are often tinged with brown, and its beak and legs are a duller brownish-red or orange. The beak is typically orange or red with a darker tip.[22] The bills gain the adults' red colour the following summer, although the black tips persist in some individuals. Young storks adopt adult plumage by their second summer.[23]",
			"color": "dim|0.25347 gray|0.25347 dim|0.25347 grey|0.25347 gray|0.2463 grey|0.2463 dark|0.19805 gray|0.19805 dark|0.19805 grey|0.19805 silver|0.11955 light|0.067742 gray|0.067742 light|0.067742 grey|0.067742 black|0.055968 gainsboro|0.045856 slate|0.0039527 gray|0.0039527  "
		}
	}
}
