{
	"add": {
		"doc": {
			"id": "15a1b1e3c1df59f7d027d1e7734259c49d8a032533b194a8bc917806030d663b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Solis_Occasus_in_Sino_Bothnico.jpg/220px-Solis_Occasus_in_Sino_Bothnico.jpg",
				"previous": "Holm (1992) considers Egil's saga to equate the Kylfings with the Finnic ethnicities, i.e. Kvens and Karelians.[16] In the 14th century, when the Swedish kings began to direct their attention northwards and encourage Swedish colonization in Norrbotten, there were regulations that the Finnish Birkarls and the Saami peoples were not to be interrupted in their traditional activities. In addition, there are many medieval sources that present Lapland as being dominated by Finns.[17] A large part of the Karelians were under Novgorod which was included in what Icelandic sources called Kylfingaland, and thus the Kylfings could have been Baltic Finnish tribes under Novgorod.[11]",
				"after": "Both East Slavs and Byzantines consistently made a clear distinction between Varangians and Kylfings, and Byzantines distinguished between them in the same manner as they separated Franks from Saracens. According to Holm such separations are indicative of clear ethnic differences between the two groups. Additionally, both East Slavic and Byzantine sources explicitly associate the Varangians with Baltic region, which they called Varangia, and in Arabic, the Baltic Sea was called Bahr Varank, i.e. the \"Varangian Sea\". There are no comparable connections when they mention the Kylfings. Another difference is the fact that the Byzantine sources connect the word varangoi with rhōs in order to make it clear that the rhōs-varangoi and the varangoi originate in Baltic just like the rhōs, but do not establish the same associations for the koulpingoi.[18]",
			"color": "black|0.45581 dim|0.2038 gray|0.2038 dim|0.2038 grey|0.2038 gray|0.13437 grey|0.13437 dark|0.076812 gray|0.076812 dark|0.076812 grey|0.076812 peru|0.037438 tan|0.037333 rosy|0.014075 brown|0.014075  "
		}
	}
}
