{
	"add": {
		"doc": {
			"id": "15b6d9c6312031d442303120f0e60b316c93e1ebadac45f841175fc19dc5ff42",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Continental_747.%2C_Los_Angeles%2C_1987.jpg/220px-Continental_747.%2C_Los_Angeles%2C_1987.jpg",
				"previous": "During the 1960s and 1970s, Continental's reputation resulted from Bob Six's personal penchant for excellence in every service category, and from his efforts to show up the larger trunk airlines whose size Continental didn't match.[5][9][11] From 1961 to 1982, Continental was headquartered at the west end of the Los Angeles International Airport on World Way West. The facility included the general offices, system operations control, the central maintenance facility, flight kitchen, and Los Angeles crew bases.[5][9][page needed][12]",
				"after": "In 1974, after years of delays and legal proceedings, Continental started flight between Houston and Miami, and on May 21, 1976, Continental was authorized to operate long-sought routes between San Diego and Denver. President Jimmy Carter and Civil Aeronautics Board chairman Alfred Kahn had been promoting deregulation of the airline industry, which would dissolve the CAB and for the first time in industry history allow U.S. carriers to determine without government supervision where they would fly, and how much they could charge. Continental began flights from Denver to Miami/Ft. Lauderdale and Tampa/St. Petersburg in Florida. That year, President Carter authorized Continental to begin daily round trips between Air Micronesia destination Saipan and Japan, and approved a route for Continental from Los Angeles to Australia via Honolulu, American Samoa, Fiji, New Zealand and Australia. The South Pacific service began May 1, 1979.[6][9][page needed] After the 1978 passage of the Airline Deregulation Act Continental embarked on a route expansion. October 1978 saw Continental begin flights from the New York area airports to Houston and Denver, and from Denver to Phoenix.[9] That month Continental startted DC-10 flights between Los Angeles and Taipei, via Honolulu and Guam. Service between Houston and Washington, D.C., began in January 1979. In June 1979 Continental linked Denver with Washington, D.C., Las Vegas, San Francisco and San Jose and also began Houston-Tampa service.[9] The airline suffered in 1979 when the DC-10 was grounded nationwide. Continental Airlines only operated the DC-10 and the 727 at the time, so flights to Hawaii were cancelled during the grounding. By the time of the Texas Air Corp. acquisition in 1981, Continental's post-deregulation growth had allowed it to penetrate every major U.S. airline market (and all of the regional markets) from the hubs in Denver and Houston, and the rapid expansion in the air was answered with large-scale facilities expansions at each of these airports. In Denver, Continental's rapid growth provided the final impetus for the construction of the new Denver International Airport, which would be completed almost fifteen years later.[6][9][page needed]",
			"color": "black|0.4358 dim|0.094126 gray|0.094126 dim|0.094126 grey|0.094126 slate|0.041358 gray|0.041358 light|0.025925 slate|0.025925 gray|0.025925 white|0.022412 smoke|0.022412 snow|0.019881 gray|0.018923 grey|0.018923 ghost|0.018443 white|0.018443 sea|0.018345 shell|0.018345 white|0.017958 alice|0.017079 blue|0.017079 lavender|0.0158 blush|0.0158 mint|0.015748 cream|0.015748 floral|0.015407 white|0.015407 gainsboro|0.014923 burly|0.013613 wood|0.013613 linen|0.013598 azure|0.012492 tan|0.012195 dark|0.012144 gray|0.012144 dark|0.012144 grey|0.012144 light|0.011377 gray|0.011377 light|0.011377 grey|0.011377 silver|0.010129  "
		}
	}
}
