{
	"add": {
		"doc": {
			"id": "15d58a83f16a25329b5d47400fe59513af239ed1b1c91b2bb8eac1be811eafa1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Cocolobo_Cay_Club_Harding_1.jpg/220px-Cocolobo_Cay_Club_Harding_1.jpg",
				"previous": "The first permanent European settlers in the Miami area did not come until the early 19th century. The first settlements around Biscayne Bay were small farms on Elliott Key growing crops like key limes and pineapples. John James Audubon visited Elliott Key in 1832.[26] Colonel Robert E. Lee surveyed the area around Biscayne Bay for potential fortification sites in 1849.[25] At the end of the American Civil War in 1865, a number of Confederates passed through the area as they were attempting to escape to Cuba. Elliott Key was a brief stopping point for John C. Breckinridge during his flight to Cuba. The former United States vice president, Confederate general and Confederate secretary of war spent two nights in Biscayne Bay on his journey.[27] Few people lived in the park area until 1897, when Israel Lafayette Jones, an African-American property manager, bought Porgy Key for $300 US. The next year Jones bought the adjoining Old Rhodes Key and moved his family there, clearing land to grow limes and pineapples. In 1911 Jones bought 212-acre (86 ha) Totten Key, which had been used as a pineapple plantation, for a dollar an acre, selling in 1925 for $250,000.[28] Before Israel Jones' death in 1932[29] the Jones plantations were for a while among the largest lime producers on the Florida east coast.[30]",
				"after": "Carl G. Fisher, who was responsible for much of the development of Miami Beach, bought Adams Key, once known as Cocolobo Key, in 1916 and built the Cocolobo Cay Club in 1922. The two-story club building had ten guest rooms, a dining room, and a separate recreation lodge. Patrons included Warren G. Harding, Albert Fall, T. Coleman du Pont, Harvey Firestone, Jack Dempsey, Charles F. Kettering, Will Rogers and Frank Seiberling.[31][32] Israel Jones' sons Lancelot and Arthur dropped out of the lime-growing business after competition from Mexican limes made their business less profitable, and after a series of devastating hurricanes in 1938 they became full-time fishing guides at the Cocolobo Club. The club had declined with the crash of 1929 which cost Fisher his fortune, but was revived by Garfield Wood in 1934.[33] Among the Joneses' clients was avid fisherman Herbert Hoover and his family. The Joneses also provided the club with fish, lobster and crabs. Arthur and Lancelot Jones were the second largest landowners and the only permanent residents of the lower Biscayne Bay keys during the 1960s.[34] Wood sold the Cocolobo Cay Club to a group of investors led by Miami banker Bebe Rebozo in 1954, who renamed it the Coco Lobo Fishing Club. Clients guided by the Joneses included then-senators John F. Kennedy, Lyndon Johnson, Richard Nixon, Herman Talmadge and George Smathers through the 1940s and 1950s.[35]",
			"color": " "
		}
	}
}
