{
	"add": {
		"doc": {
			"id": "15e27d88449505edbd5ea60bda399eacb669f05bf0c970e180c87e2b07e044be",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/7/7e/Franklin_stamp_2013.jpg/265px-Franklin_stamp_2013.jpg",
				"previous": "Well known as a printer and publisher, Franklin was appointed postmaster of Philadelphia in 1737, holding the office until 1753, when he and publisher William Hunter were named deputy postmasters–general of British North America, the first to hold the office. Franklin was responsible for the British colonies as far as the island of Newfoundland, opening Canada's first post office at Halifax, Nova Scotia, while Hunter became postal administrator in Williamsburg, Virginia and oversaw areas south of Annapolis, Maryland. Franklin reorganized the service's accounting system, then improved speed of delivery between Philadelphia, New York and Boston. By 1761, efficiencies lead to the first profits for the colonial post office.[98]",
				"after": "When the lands of New France were ceded to the British under the Treaty of Paris in 1763, the new British province of Quebec was created among them, and Franklin saw mail service expanded between Montreal, Trois-Rivières, Quebec City, and New York. For the greater part of his appointment, Franklin lived in England (from 1757 to 1762, and again from 1764 to 1774) — about three-quarters of his term.[99] Eventually, his sympathies for the rebel cause in the American Revolution lead to his dismissal on January 31, 1774.",
			"color": "dark|0.09995 gray|0.09995 dark|0.09995 grey|0.09995 silver|0.077228 light|0.056658 gray|0.056658 light|0.056658 grey|0.056658 white|0.056117 smoke|0.056117 dim|0.054703 gray|0.054703 dim|0.054703 grey|0.054703 gray|0.051807 grey|0.051807 alice|0.049906 blue|0.049906 ghost|0.049686 white|0.049686 snow|0.049541 sea|0.048711 shell|0.048711 white|0.047903 mint|0.046369 cream|0.046369 gainsboro|0.045963 lavender|0.044691 blush|0.044691 floral|0.043487 white|0.043487 azure|0.04235 light|0.026026 slate|0.026026 gray|0.026026 slate|0.017892 gray|0.017892 sky|0.014575 blue|0.014575 light|0.012666 blue|0.012666 linen|0.011511 light|0.010232 steel|0.010232 blue|0.010232 black|0.0088062 light|0.0051289 sky|0.0051289 blue|0.0051289 powder|0.0048261 blue|0.0048261 ivory|0.003957  "
		}
	}
}
