{
	"add": {
		"doc": {
			"id": "15e5b6e7fcc647e1ee6c7fbdb3d5cb62924f26b267f46743c96aca878cd206e6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Darwin_Tree_1837.png/220px-Darwin_Tree_1837.png",
				"previous": "Gould met Darwin and told him that the Galápagos mockingbirds from different islands were separate species, not just varieties, and what Darwin had thought was a \"wren\" was also in the finch group. Darwin had not labelled the finches by island, but from the notes of others on the Beagle, including FitzRoy, he allocated species to islands.[67] The two rheas were also distinct species, and on 14 March Darwin announced how their distribution changed going southwards.[68]",
				"after": "By mid-March, Darwin was speculating in his Red Notebook on the possibility that \"one species does change into another\" to explain the geographical distribution of living species such as the rheas, and extinct ones such as the strange Macrauchenia which resembled a giant guanaco. His thoughts on lifespan, asexual reproduction and sexual reproduction developed in his \"B\" notebook around mid-July on to variation in offspring \"to adapt & alter the race to changing world\" explaining the Galápagos tortoises, mockingbirds and rheas. He sketched branching descent, then a genealogical branching of a single evolutionary tree, in which \"It is absurd to talk of one animal being higher than another\", discarding Lamarck's independent lineages progressing to higher forms.[69]",
			"color": "gainsboro|0.11364 light|0.10106 gray|0.10106 light|0.10106 grey|0.10106 linen|0.098394 antique|0.0937 white|0.0937 old|0.080231 lace|0.080231 sea|0.074221 shell|0.074221 floral|0.064843 white|0.064843 white|0.059652 smoke|0.059652 silver|0.045678 ivory|0.045453 snow|0.040528 dark|0.035547 gray|0.035547 dark|0.035547 grey|0.035547 beige|0.035206 mint|0.025345 cream|0.025345 gray|0.025109 grey|0.025109 dim|0.016991 gray|0.016991 dim|0.016991 grey|0.016991 papaya|0.015012 whip|0.015012 white|0.012505 misty|0.0082432 rose|0.0082432 lavender|0.004043 blush|0.004043  "
		}
	}
}
