{
	"add": {
		"doc": {
			"id": "160371e09212b046a8f0e184ea0c122c7a577a615ef008e8c460b1d68ef38722",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Yasunori_Mitsuda.jpg/189px-Yasunori_Mitsuda.jpg",
				"previous": "Chrono Trigger was scored primarily by Yasunori Mitsuda, with contributions from veteran Final Fantasy composer Nobuo Uematsu, and one track composed by Noriko Matsueda. A sound programmer at the time, Mitsuda was unhappy with his pay and threatened to leave Square if he could not compose music.[8] Hironobu Sakaguchi suggested he score Chrono Trigger, remarking, \"maybe your salary will go up.\"[75] Mitsuda composed new music and drew on a personal collection of pieces composed over the previous two years.[3] He reflected, \"I wanted to create music that wouldn't fit into any established genre...music of an imaginary world. The game's director, Masato Kato, was my close friend, and so I'd always talk with him about the setting and the scene before going into writing.\"[8] Mitsuda slept in his studio several nights, and attributed certain pieces—such as the game's ending theme, To Far Away Times—to inspiring dreams.[75] He later attributed this song to an idea he was developing before Chrono Trigger, reflecting that the tune was made in dedication to \"a certain person with whom I wanted to share a generation.\"[76] He also tried to use leitmotifs of the Chrono Trigger main theme to create a sense of consistency in the soundtrack.[77] Mitsuda wrote each tune to be around two minutes long before repeating, unusual for Square's games at the time.[41] Mitsuda suffered a hard drive crash that lost around forty in-progress tracks.[60] After Mitsuda contracted stomach ulcers, Uematsu joined the project to compose ten pieces and finish the score.[8] Mitsuda returned to watch the ending with the staff before the game's release, crying upon seeing the finished scene.[60]",
				"after": "At the time of the game's release, the number of tracks and sound effects was unprecedented—the soundtrack spanned three discs in its 1995 commercial pressing.[10] Square also released a one-disc acid jazz arrangement called \"The Brink of Time\" by Guido that year. The Brink of Time came about because Mitsuda wanted to do something that no one else was doing, and he noted that acid jazz and its related genres were uncommon in the Japanese market.[77] Mitsuda considers Chrono Trigger a landmark title which helped mature his talent.[78] While Mitsuda later held that the title piece was \"rough around the edges,\" he maintains that it had \"significant influence on my life as a composer.\"[76] In 1999, Square produced another one-disc soundtrack to complement the PlayStation release of Trigger, featuring orchestral tracks used in cut scenes. Tsuyoshi Sekito composed four new pieces for the game's bonus features which weren't included on the soundtrack.[77] Some fans were displeased by Mitsuda's absence in creating the port, whose instruments sometimes aurally differed from the original game's.[77] Mitsuda arranged versions of music from the Chrono series for Play! video game music concerts, presenting the main theme, Frog's Theme, and To Far Away Times.[79] He worked with Square Enix to ensure that the Nintendo DS Chrono Trigger port's music would sound close to the Super Nintendo's version.[60] Mitsuda encouraged feedback about the game's soundtrack from contemporary children (who he thought would expect \"full symphonic scores blaring out of the speakers\").[3] Fans who preordered Chrono Trigger DS received a special music disc containing two orchestral arrangements of Chrono Trigger music directed by Natsumi Kameoka; Square Enix also held a random prize drawing for two signed copies of Chrono Trigger sheet music.[77][80] Mitsuda expressed difficulty in selecting the tune for the orchestral medley, eventually picking a tune from each era and certain character themes.[76] Mitsuda later wrote:",
			"color": "tan|0.24181 gray|0.18362 grey|0.18362 dark|0.17373 gray|0.17373 dark|0.17373 grey|0.17373 dim|0.087687 gray|0.087687 dim|0.087687 grey|0.087687 peach|0.057291 puff|0.057291 burly|0.029878 wood|0.029878 light|0.029138 slate|0.029138 gray|0.029138 slate|0.022127 gray|0.022127 bisque|0.017452 rosy|0.015426 brown|0.015426 silver|0.013763 wheat|0.010624 antique|0.0093657 white|0.0093657 light|0.0080108 gray|0.0080108 light|0.0080108 grey|0.0080108 misty|0.0067637 rose|0.0067637 white|0.0058341 smoke|0.0058341 gainsboro|0.0056058 mint|0.0054095 cream|0.0054095 alice|0.0051612 blue|0.0051612 azure|0.0051284 snow|0.0047655 white|0.0047131 floral|0.0046384 white|0.0046384 sea|0.0045004 shell|0.0045004 ghost|0.0044214 white|0.0044214 blanched|0.0043259 almond|0.0043259 black|0.0043192  "
		}
	}
}
