{
	"add": {
		"doc": {
			"id": "160ee2f8e79632746ce9353e32b938f5aa9d2cca7ded0e8795a7f94cd24099f2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Kew_Gardens_0502.JPG/220px-Kew_Gardens_0502.JPG",
				"previous": "where L is the sundial's geographical latitude (and the angle the style makes with horizontal), is the angle between a given hour-line and the noon hour-line (which always points towards true North) on the plane, and t is the number of hours before or after noon. For example, the angle of the 3pm hour-line would equal the arctangent of sin L, since tan 45° = 1. When L equals 90° (at the North Pole), the horizontal sundial becomes an equatorial sundial; the style points straight up (vertically), and the horizontal plane is aligned with the equatorial plane; the hour-line formula becomes = 15° × t, as for an equatorial dial. A horizontal sundial at the Earth's equator, where L equals 0°, would require a (raised) horizontal style and would be an example of a polar sundial (see below).",
				"after": "The chief advantages of the horizontal sundial are that it is easy to read, and the sun lights the face throughout the year. All the hour-lines intersect at the point where the gnomon's style crosses the horizontal plane. Since the style is aligned with the Earth's rotational axis, the style points true North and its angle with the horizontal equals the sundial's geographical latitude L. A sundial designed for one latitude can be adjusted for use at another latitude by tilting its base upwards or downwards by an angle equal to the difference in latitude. For example, a sundial designed for a latitude of 40° can be used at a latitude of 45°, if the sundial plane is tilted upwards by 5°, thus aligning the style with the Earth's rotational axis.[citation needed] Many ornamental sundials are designed to be used at 45 degrees north. Some mass-produced garden sundials fail to correctly calculate the hourlines and so can never be corrected. A local standard time zone is nominally 15 degrees wide, but may be modified to follow geographic or political boundaries. A sundial can be rotated around its style (which must remain pointed at the celestial pole) to adjust to the local time zone. In most cases, a rotation in the range of 7.5 degrees east to 23 degrees west suffices. This will introduce error in sundials that do not have equal hour angles. To correct for daylight saving time, a face needs two sets of numerals or a correction table. An informal standard is to have numerals in hot colors for summer, and in cool colors for winter.[citation needed] Since the hour angles are not evenly spaced, the equation of time corrections cannot be made via rotating the dial plate about the gnomon axis. These types of dials usually have an equation of time correction tabulation engraved on their pedestals or close by. Horizontal dials are commonly seen in gardens, churchyards and in public areas.",
			"color": "dark|0.46077 gray|0.46077 dark|0.46077 grey|0.46077 silver|0.18708 gray|0.15133 grey|0.15133 dark|0.13686 olive|0.13686 green|0.13686 light|0.025133 gray|0.025133 light|0.025133 grey|0.025133 light|0.014967 slate|0.014967 gray|0.014967 olive|0.006257 drab|0.006257 dim|0.0059537 gray|0.0059537 dim|0.0059537 grey|0.0059537  "
		}
	}
}
