{
	"add": {
		"doc": {
			"id": "16290286604531ad8fcd55179b86d421dbd9e522130f0a5304ee2f0725516a64",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/US_Navy_090114-N-9704L-004_Hull_Technician_Fireman_John_Hansen_lays_beads_for_welding_qualifications.jpg/220px-US_Navy_090114-N-9704L-004_Hull_Technician_Fireman_John_Hansen_lays_beads_for_welding_qualifications.jpg",
				"previous": "One of the most common types of arc welding is shielded metal arc welding (SMAW);[28] it is also known as manual metal arc welding (MMA) or stick welding. Electric current is used to strike an arc between the base material and consumable electrode rod, which is made of filler material (typically steel) and is covered with a flux that protects the weld area from oxidation and contamination by producing carbon dioxide (CO2) gas during the welding process. The electrode core itself acts as filler material, making a separate filler unnecessary.[28]",
				"after": "The process is versatile and can be performed with relatively inexpensive equipment, making it well suited to shop jobs and field work.[28][29] An operator can become reasonably proficient with a modest amount of training and can achieve mastery with experience. Weld times are rather slow, since the consumable electrodes must be frequently replaced and because slag, the residue from the flux, must be chipped away after welding.[28] Furthermore, the process is generally limited to welding ferrous materials, though special electrodes have made possible the welding of cast iron, nickel, aluminum, copper, and other metals.[29]",
			"color": "black|0.19931 rosy|0.08669 brown|0.08669 dim|0.068508 gray|0.068508 dim|0.068508 grey|0.068508 gray|0.042539 grey|0.042539 sea|0.041529 shell|0.041529 white|0.038959 smoke|0.038959 floral|0.038927 white|0.038927 snow|0.038223 white|0.03583 mint|0.033514 cream|0.033514 ghost|0.033203 white|0.033203 dark|0.031377 gray|0.031377 dark|0.031377 grey|0.031377 lavender|0.030112 blush|0.030112 alice|0.029908 blue|0.029908 misty|0.029702 rose|0.029702 azure|0.028604 linen|0.018389 silver|0.01822 dark|0.015573 salmon|0.015573 light|0.015375 gray|0.015375 light|0.015375 grey|0.015375 ivory|0.013185 gainsboro|0.012672  "
		}
	}
}
