{
	"add": {
		"doc": {
			"id": "16327f0e233d539310c3be68e4a3079bc7a1a6905a8e3617002ad13be9af24d9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Stromatolites%2C_Belt_Supergroup%2C_Glacier_National_Park.jpg/220px-Stromatolites%2C_Belt_Supergroup%2C_Glacier_National_Park.jpg",
				"previous": "One of the most dramatic evidences of this overthrust is visible in the form of Chief Mountain, an isolated peak on the edge of the eastern boundary of the park rising 2,500 feet (800 m) above the Great Plains.[42][43] There are six mountains in the park over 10,000 feet (3,000 m) in elevation, with Mount Cleveland at 10,466 feet (3,190 m) being the tallest.[44] Appropriately named Triple Divide Peak sends waters towards the Pacific Ocean, Hudson Bay, and Gulf of Mexico watersheds. This peak can effectively be considered to be the apex of the North American continent, although the mountain is only 8,020 feet (2,444 m) above sea level.[45]",
				"after": "The rocks in Glacier National Park are the best preserved Proterozoic sedimentary rocks in the world, with some of the world's most fruitful sources for records of early life. Sedimentary rocks of similar age located in other regions have been greatly altered by mountain building and other metamorphic changes; consequently fossils are less common and more difficult to observe.[46] The rocks in the park preserve such features as millimeter-scale lamination, ripple marks, mud cracks, salt-crystal casts, raindrop impressions, oolites, and other sedimentary bedding characteristics. Six fossilized species of Stromatolites, which were early organisms consisting primarily blue-green algae, have been documented and dated at about 1 billion years.[43] The discovery of the Appekunny Formation, a well preserved rock stratum in the park, pushed back the established date for the origination of animal life a full billion years. This rock formation has bedding structures which are believed to be the remains of the earliest identified metazoan (animal) life on Earth.[42]",
			"color": " "
		}
	}
}
