{
	"add": {
		"doc": {
			"id": "1650eaeb8ada8379ca68213db535b7facb7993f9cd588f76afc322753bc1b3b0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Joseph_Goupy%2C_1754_-_GFHandel.jpg/220px-Joseph_Goupy%2C_1754_-_GFHandel.jpg",
				"previous": "It is evident how much he learned from Arcangelo Corelli about writing for instruments, and from Alessandro Scarlatti about writing for the solo voice; but there is no single composer who taught him how to write for chorus.[60] Handel tended more and more to replace Italian soloists by English ones. The most significant reason for this change was the dwindling financial returns from his operas.[61] Thus a tradition was created for oratorios which was to govern their future performance. The performances were given without costumes and action; the singers appeared in their own clothes.[62]",
				"after": "In 1736 Handel produced Alexander's Feast. John Beard appeared for the first time as one of Handel's principal singers and became Handel's permanent tenor soloist for the rest of Handel's life.[63] The piece was a great success and it encouraged Handel to make the transition from writing Italian operas to English choral works. In Saul, Handel was collaborating with Charles Jennens and experimenting with three trombones, a carillon and extra-large military kettledrums (from the Tower of London), to be sure \"...it will be most excessive noisy\".[64] Saul and Israel in Egypt both from 1739 head the list of great, mature oratorios, in which the da capo aria became the exception and not the rule.[65] Israel in Egypt consists of little else but choruses, borrowing from the Funeral Anthem for Queen Caroline. In his next works Handel changed his course. In these works he laid greater stress on the effects of orchestra and soloists; the chorus retired into the background.[66] L'Allegro, il Penseroso ed il Moderato has a rather diverting character; the work is light and fresh.",
			"color": "dark|0.27839 gray|0.27839 dark|0.27839 grey|0.27839 gray|0.23686 grey|0.23686 dim|0.15507 gray|0.15507 dim|0.15507 grey|0.15507 silver|0.11476 light|0.055918 gray|0.055918 light|0.055918 grey|0.055918 gainsboro|0.04398 white|0.017059 smoke|0.017059 slate|0.012748 gray|0.012748 alice|0.010638 blue|0.010638 ghost|0.010463 white|0.010463 sea|0.01005 shell|0.01005 snow|0.0098598 lavender|0.0096949 blush|0.0096949 linen|0.0079656 white|0.0078171 mint|0.0062824 cream|0.0062824 floral|0.0054953 white|0.0054953 azure|0.0046997  "
		}
	}
}
