{
	"add": {
		"doc": {
			"id": "166c1daf28671e840b2551cfb055946fe27472293e4ab90764b8074bf3664310",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Chaplin_cbs_1933.jpg/220px-Chaplin_cbs_1933.jpg",
				"previous": "While the CBS prime-time lineup featured music, comedy and variety shows, the daytime schedule was a direct conduit into American homes – and into the hearts and minds of American women; for many, it was the bulk of their adult human contact during the course of the day. CBS time salesmen recognized early on that this intimate connection could be a bonanza for advertisers of female-interest products.[24] Starting in 1930, astrologer Evangeline Adams would consult the heavens on behalf of listeners who sent in their birthdays, a description of their problems – and a box-top from sponsor Forhan's toothpaste.[25] The low-key murmuring of smooth-voiced Tony Wons, backed by a tender violin, \"made him a soul mate to millions of women\"[26] on behalf of the R. J. Reynolds tobacco company, whose cellophane-wrapped Camel cigarettes were \"as fresh as the dew that dawn spills on a field of clover\".[27] The most popular radio-friend of all was M. Sayle Taylor, The Voice Of Experience, though his name was never uttered on air.[27] Women mailed descriptions of the most intimate of relationship problems to The Voice in the tens of thousands per week; sponsors Musterole ointment and Haley's M–O laxative enjoyed sales increases of several hundred percent in just the first month of The Voice Of Experience‍ '​s run.[28]",
				"after": "As the decade progressed, a new genre joined the daytime lineup: serial dramas – soap operas, so named for the products that sponsored them, by way of the ad agencies that actually produced them. Although the form, usually in quarter-hour episodes, proliferated widely in the mid- and late 1930s, they all had the same basic premise: that characters \"fell into two categories: 1) those in trouble and 2) those who helped people in trouble. The helping-hand figures were usually older.\"[29] At CBS, Just Plain Bill brought human insight and Anacin pain reliever into households; Your Family and Mine came courtesy of Sealtest Dairy products; Bachelor's Children first hawked Old Dutch Cleanser, then Wonder Bread; Aunt Jenny's Real Life Stories was sponsored by Spry Vegetable Shortening. Our Gal Sunday (Anacin again), The Romance of Helen Trent (Angélus cosmetics), Big Sister (Rinso laundry soap) and many others filled the daytime ether.[30]",
			"color": "black|0.21479 dim|0.12602 gray|0.12602 dim|0.12602 grey|0.12602 dark|0.12586 gray|0.12586 dark|0.12586 grey|0.12586 silver|0.10969 light|0.10015 gray|0.10015 light|0.10015 grey|0.10015 gainsboro|0.087773 gray|0.064712 grey|0.064712 white|0.029415 smoke|0.029415 alice|0.022489 blue|0.022489 ghost|0.019742 white|0.019742 snow|0.016559 azure|0.014274 mint|0.013275 cream|0.013275 white|0.013126 lavender|0.012636 blush|0.012636 sea|0.011535 shell|0.011535  "
		}
	}
}
