{
	"add": {
		"doc": {
			"id": "1674e10aaffc0884c11e79d9596afde62718bfe9a6bf38e5ed0a16eaf071949f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Vasa_Cohen_20006123a_hr.jpg/220px-Vasa_Cohen_20006123a_hr.jpg",
			"previous": [],
				"after": "Vasa sank because it had very little initial stability, which can be thought of as resistance to heeling over under the force of wind or waves acting on the hull. The reason for this is that the distribution of mass in the hull structure and the ballast, guns, provisions, and other objects loaded on board puts too much weight too high in the ship. The center of gravity is too high, and so it takes very little force to make the ship heel over, and there is not enough righting moment, force trying to make the ship return to an upright position. The reason that the ship has such a high center of gravity is not due to the guns. These weighed little over 60 tonnes, or about 5% of the total displacement of the loaded ship. This is relatively low weight and should be bearable in a ship this size. The problem is in the hull construction itself. The part of the hull above the waterline is too high and too heavily built in relation to the amount of hull in the water. The headroom in the decks is higher than necessary for crewmen who were, on average, only 1.67 meters (5 feet 5½ inches) tall, and thus the weight of the decks and the guns they carry is higher above the waterline than needed. In addition, the deck beams and their supporting timbers are over-dimensioned and too closely spaced for the loads they carry, so they contribute too much weight to the already tall and heavy upper works.[52]",
			"color": "black|0.16282 tan|0.067136 dark|0.05295 gray|0.05295 dark|0.05295 grey|0.05295 silver|0.046662 dim|0.045019 gray|0.045019 dim|0.045019 grey|0.045019 light|0.04101 gray|0.04101 light|0.04101 grey|0.04101 gray|0.034543 grey|0.034543 gainsboro|0.03453 antique|0.030039 white|0.030039 light|0.028894 salmon|0.028894 linen|0.026682 wheat|0.023603 sea|0.022892 shell|0.022892 floral|0.022729 white|0.022729 bisque|0.021971 white|0.021235 smoke|0.021235 peach|0.021223 puff|0.021223 salmon|0.021191 old|0.021019 lace|0.021019 tomato|0.019925 blanched|0.018013 almond|0.018013 papaya|0.016742 whip|0.016742 snow|0.016727 mint|0.016509 cream|0.016509 ivory|0.016486 white|0.013916 beige|0.012957 dark|0.010134 salmon|0.010134 burly|0.0095036 wood|0.0095036 corn|0.0091004 silk|0.0091004 azure|0.0086151 ghost|0.0085563 white|0.0085563 honeydew|0.0082916 misty|0.0079686 rose|0.0079686 alice|0.0068231 blue|0.0068231 moccasin|0.0063163 rosy|0.0060253 brown|0.0060253 lavender|0.0056765 blush|0.0056765 navajo|0.0048777 white|0.0048777 slate|0.0042794 gray|0.0042794 light|0.0040726 yellow|0.0040726  "
		}
	}
}
