{
	"add": {
		"doc": {
			"id": "16782acdda45e9fc0650b716e1b624e3a1f4eee42c86784fa99abb085dd43c12",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/US_Navy_081124-N-3659B-305_F-A-18C_Hornets_launch_from_the_Nimitz-class_aircraft_carrier_USS_Ronald_Reagan_%28CVN_76%29.jpg/220px-US_Navy_081124-N-3659B-305_F-A-18C_Hornets_launch_from_the_Nimitz-class_aircraft_carrier_USS_Ronald_Reagan_%28CVN_76%29.jpg",
				"previous": "Munitions are commonly stored on the lower decks because they are highly explosive should the compartment they are in be breached. Usually this is below the water line so that the area can be flooded in case of emergency.",
				"after": "As \"runways at sea\", aircraft carriers have a flat-top flight deck, which launches and recovers aircraft. Aircraft launch forward, into the wind, and are recovered from astern. The flight deck is where the most notable differences between a carrier and a land runway are found. Creating such a surface at sea poses constraints on the carrier – for example, the fact that it is a ship means that a full-length runway would be costly to construct and maintain. This affects take-off procedure, as a shorter runway length of the deck requires that aircraft accelerate more quickly to gain lift. This either requires a thrust boost, a vertical component to its velocity, or a reduced take-off load (to lower mass). The differing types of deck configuration, as above, influence the structure of the flight deck. The form of launch assistance a carrier provides is strongly related to the types of aircraft embarked and the design of the carrier itself.",
			"color": "dim|0.34121 gray|0.34121 dim|0.34121 grey|0.34121 gray|0.17243 grey|0.17243 dark|0.13411 gray|0.13411 dark|0.13411 grey|0.13411 silver|0.073328 black|0.065543 light|0.051331 gray|0.051331 light|0.051331 grey|0.051331 gainsboro|0.040938 white|0.014472 smoke|0.014472 slate|0.012177 gray|0.012177 alice|0.01075 blue|0.01075 ghost|0.0099244 white|0.0099244 snow|0.0088961 sea|0.007984 shell|0.007984 white|0.0075415 mint|0.0074966 cream|0.0074966 azure|0.0069343 light|0.0066764 slate|0.0066764 gray|0.0066764 lavender|0.0057921 blush|0.0057921 linen|0.0053853 floral|0.0053489 white|0.0053489  "
		}
	}
}
