{
	"add": {
		"doc": {
			"id": "167b58e9a3d31932386476d39f50d5a0bf87c37bc810774293c33c62a02f5796",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Jog_Rani.JPG/220px-Jog_Rani.JPG",
				"previous": "After India's independence, the Maharaja, Jayachamarajendra Wodeyar, allowed his kingdom's accession to India. In 1950, Mysore became an Indian state of the same name; the former Maharaja served as its Rajpramukh (head of state) until 1975. Following the long-standing demand of the Ekikarana Movement, Kodagu- and Kannada-speaking regions from the adjoining states of Madras, Hyderabad and Bombay were incorporated into the Mysore state, under the States Reorganization Act of 1956. The thus expanded state was renamed Karnataka, seventeen years later, in 1973.[44] In the early 1900s through the post-independence era, industrial visionaries such as Sir Mokshagundam Visvesvarayya born in Muddenahalli, Chikballapur District played an important role in the development of Karnataka's strong manufacturing and industrial base.",
			"after": [
				"The state has three principal geographical zones:",
				"The bulk of the state is in the Bayaluseeme region, the northern part of which is the second-largest arid region in India.[45] The highest point in Karnataka is the Mullayanagiri hills in Chickmagalur district which has an altitude of 1,929 metres (6,329 ft). Some of the important rivers in Karnataka are Kaveri, Tungabhadra, Krishna, Malaprabha and the Sharavathi."
			],
			"color": "black|0.2304 light|0.15778 gray|0.15778 light|0.15778 grey|0.15778 gainsboro|0.1291 silver|0.11692 dim|0.054533 gray|0.054533 dim|0.054533 grey|0.054533 linen|0.051575 dark|0.050293 gray|0.050293 dark|0.050293 grey|0.050293 gray|0.039457 grey|0.039457 white|0.030721 smoke|0.030721 sea|0.028108 shell|0.028108 old|0.02585 lace|0.02585 antique|0.021034 white|0.021034 floral|0.019803 white|0.019803 snow|0.012982 mint|0.0078734 cream|0.0078734 ivory|0.0070852 dark|0.0036096 slate|0.0036096 gray|0.0036096  "
		}
	}
}
