{
	"add": {
		"doc": {
			"id": "1680a105e1615b6ed2af3e1e660f29447d8fdf24561217467c3454dd05269c89",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Germans_in_Kosovska_Mitrovica.jpg/200px-Germans_in_Kosovska_Mitrovica.jpg",
				"previous": "Albanians and other Muslims were forced to emigrate, mainly with the land reform which struck Albanian landowners in 1919, but also with direct violent measures.[60][61] In 1935 and 1938 two agreements between the Kingdom of Yugoslavia and Turkey were signed on the expatriation of 240,000 Albanians to Turkey, which was not completed because of the outbreak of World War II.[62]",
				"after": "After the Axis invasion of Yugoslavia in 1941, most of Kosovo was assigned to Italian-controlled Albania, with the rest being controlled by Germany and Bulgaria. A three-dimensional conflict ensued, involving inter-ethnic, ideological, and international affiliations, with the first being most important. Nonetheless, these conflicts were relatively low-level compared with other areas of Yugoslavia during the war years, with one Serb historian estimating that 3,000 Albanians and 4,000 Serbs and Montenegrins were killed, and two others estimating war dead at 12,000 Albanians and 10,000 Serbs and Montenegrins.[63] An official investigation conducted by the Yugoslav government in 1964 recorded nearly 8,000 war-related fatalities in Kosovo between 1941 and 1945, 5,489 of whom were Serb and Montenegrin and 2,177 of whom were Albanian.[64] It is not disputed that between 1941 and 1945 tens of thousands of Serbs, mostly recent colonists, fled from Kosovo. Estimates range from 30,000 to 100,000.[65] There had been large-scale Albanian immigration from Albania to Kosovo which is by some scholars estimated in the range from 72,000[66][67] to 260,000 people (with a tendency to escalate, the last figure being in a petition of 1985). Some historians and contemporary references emphasize that a large-scale migration of Albanians from Albania to Kosovo is not recorded in Axis documents.[68]",
			"color": " "
		}
	}
}
