{
	"add": {
		"doc": {
			"id": "169bf9acb5c88ff6c154ae62555c6a250674eddea89dec4dc9f65349a152fdc9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Jaguar_-_Cameron_Park_Zoo_-_Waco%2C_Texas.jpg/220px-Jaguar_-_Cameron_Park_Zoo_-_Waco%2C_Texas.jpg",
				"previous": "In the past, conservation of jaguars sometimes occurred through the protection of jaguar \"hotspots\". These hotspots, described as jaguar conservation units, were large areas populated by about 50 jaguars. However, some researchers recently determined, to maintain a robust sharing of the jaguar gene pool necessary for maintaining the species, it is important that the jaguars are interconnected. To facilitate this, a new project, the Paseo del Jaguar, has been established to connect several jaguar hotspots.[80]",
				"after": "The only extant cat native to North America that roars,[81] the jaguar was recorded as an animal of the Americas by Thomas Jefferson in 1799.[82] There are multiple zoological reports of jaguar in California, two as far north as Monterey in 1814 (Langsdorff) and 1826 (Beechey).[83] The coastal Diegueño (Kumeyaay people) of San Diego and Cahuilla Indians of Palm Springs had words for jaguar and the cats persisted there until about 1860.[84] The only recorded description of an active jaguar den with breeding adults and kittens in the U.S. was in the Tehachapi Mountains of California prior to 1860.[83] In 1843, Rufus Sage, an explorer and experienced observer recorded jaguar present on the headwaters of the North Platte River 30–50 miles north of Long's Peak in Colorado. Cabot's 1544 map has a drawing of jaguar ranging over the Pennsylvania and Ohio valleys. Historically, the jaguar was recorded in far eastern Texas, and the northern parts of Arizona and New Mexico. However, since the 1940s, the jaguar has been limited to the southern parts of these states. Although less reliable than zoological records, native American artefacts with possible jaguar motifs range from the Pacific Northwest to Pennsylvania and Florida.[85]",
			"color": "black|0.4897 tan|0.067166 burly|0.05176 wood|0.05176 dark|0.050718 gray|0.050718 dark|0.050718 grey|0.050718 dim|0.050037 gray|0.050037 dim|0.050037 grey|0.050037 silver|0.0458 gray|0.041088 grey|0.041088 light|0.033353 gray|0.033353 light|0.033353 grey|0.033353 gainsboro|0.023114 wheat|0.011001 navajo|0.0089422 white|0.0089422 white|0.0080895 smoke|0.0080895 dark|0.0077429 khaki|0.0077429 moccasin|0.0060936 mint|0.0059494 cream|0.0059494 indian|0.0059167 red|0.0059167 snow|0.0057911 alice|0.0057159 blue|0.0057159 floral|0.0054672 white|0.0054672 white|0.0054628  "
		}
	}
}
