{
	"add": {
		"doc": {
			"id": "169cf2f4b849ac8202682bd42719c0d7e43b3c69c5464721a4fb44581aa3a5c7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Spinellus_fusiger_51504.jpg/220px-Spinellus_fusiger_51504.jpg",
			"previous": [
				"Mycena haematopus can be parasitized by Spinellus fusiger, another fungal species which gives the mushroom a strikingly hairy appearance.[8][17]",
				"The mushroom flesh can range from pale to the color of red wine (vinaceous), and has no distinctive odor. It oozes a red latex when cut.[11] The gills have an adnate attachment to the stem, meaning they are more or less directly attached to it. They are initially whitish or \"grayish vinaceous\" in color, and can develop reddish-brown stains. Between 20 and 30 gills reach from the cap edge to the stem, resulting in a gill spacing that is described as \"close to subdistant\"—gaps are visible between adjacent gills. There are additional gills, called lamellulae, that do not extend directly from the margin to the stem; these are arranged in two or three series (tiers) of equal length. The stem is up to 9 cm (3.5 in) tall and 0.1 to 0.2 cm (0.04 to 0.08 in) thick, hollow and brittle, and a dark reddish-brown color. In young fruit bodies, the upper part of the stem is densely covered with a pale cinnamon-colored powder which wears off with age. The stem has a mass of coarse hairs at the base. Like the cap, the stem also bleeds a red latex when it is cut or broken.[15][16]"
			],
				"after": "The spore print is white. The spores are elliptical, smooth, with dimensions of 8–11 by 5–7 µm. They are amyloid, meaning they will absorb iodine when stained with Melzer's reagent.[17] The spore-bearing cells (basidia) are 4-spored. Sterile cells called cystidia are numerous on the edges on the gills; they measure 33–60 µm (sometimes up to 80) by 9–12 µm. Cystidia that are present on the stipe (caulocystidia) appear in clusters, and clublike to irregular in shape, measuring 20–55 by 3.5–12.5 µm.[18] The gill tissue contains numerous lactifers, cells that produce the latex that is secreted when it is cut.[16]",
			"color": "dim|0.154 gray|0.154 dim|0.154 grey|0.154 dark|0.13835 gray|0.13835 dark|0.13835 grey|0.13835 gray|0.1291 grey|0.1291 black|0.093607 silver|0.08474 dark|0.058785 sea|0.058785 green|0.058785 light|0.043335 gray|0.043335 light|0.043335 grey|0.043335 light|0.03633 slate|0.03633 gray|0.03633 thistle|0.032502 light|0.026758 steel|0.026758 blue|0.026758 gainsboro|0.026749 slate|0.025216 gray|0.025216 dark|0.020649 olive|0.020649 green|0.020649 lavender|0.020563 rosy|0.015244 brown|0.015244 dark|0.013868 slate|0.013868 gray|0.013868 light|0.0098781 blue|0.0098781  "
		}
	}
}
