{
	"add": {
		"doc": {
			"id": "16b305a7909ce34fd32c9694b35db16c707dc396ab1fc92343aa1f86082d23c3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Coat_of_arms_of_Central_Java.svg/170px-Coat_of_arms_of_Central_Java.svg.png",
				"previous": "The aesthetic and technical mastery of Borobudur, and also its sheer size, has evoked the sense of grandeur and pride for Indonesians. Just like Angkor Wat for Cambodian, Borobudur has become a powerful symbol for Indonesia — to testify for its past greatness. Sukarno made a point of showing the site to foreign dignitaries. While Suharto regime — realized its important symbolic and economic meanings — diligently embarked on a massive project to restore the monument with the help from UNESCO. Many museums in Indonesia contains a scale model replica of Borobudur. The monument has become almost an icon, grouped with the wayang puppet play and gamelan music into a vague classical Javanese past from which Indonesians are to draw inspiration.[89]",
				"after": "Several archaeological relics taken from Borobudur or its replica, has been displayed in some museums in Indonesia and abroad. Other than Karmawibhangga Museum within Borobudur temple ground, some museums boast to host relics of Borobudur, such as Indonesian National Museum in Jakarta, Tropenmuseum in Amsterdam, British Museum in London, and Thai National Museum in Bangkok. Louvre museum in Paris, Malaysian National Museum in Kuala Lumpur, and Museum of World Religions in Taipei also displayed the replica of Borobudur.[77] The monument has drew global attention to classical Buddhist civilization of ancient Java.",
			"color": "black|0.36431 gold|0.35496 steel|0.089453 blue|0.089453 dark|0.01839 gray|0.01839 dark|0.01839 grey|0.01839 gray|0.01384 grey|0.01384 silver|0.012876 dim|0.012627 gray|0.012627 dim|0.012627 grey|0.012627 light|0.0097388 gray|0.0097388 light|0.0097388 grey|0.0097388 light|0.0094575 steel|0.0094575 blue|0.0094575 gainsboro|0.0086544 white|0.0072535 smoke|0.0072535 sea|0.0064313 green|0.0064313 ghost|0.006416 white|0.006416 alice|0.0063634 blue|0.0063634 snow|0.0063576 white|0.0062385 mint|0.0054254 cream|0.0054254 sea|0.005404 shell|0.005404 medium|0.0049047 sea|0.0049047 green|0.0049047 floral|0.0048825 white|0.0048825 azure|0.0048384 lavender|0.0046298 light|0.0044337 blue|0.0044337 lavender|0.004187 blush|0.004187 golden|0.0038328 rod|0.0038328  "
		}
	}
}
