{
	"add": {
		"doc": {
			"id": "16b9912c7f4ff6b905d4d10cb3a9a61cd605cae29be12b395b3118ea5046e652",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Banksia_marginata_seedling_WSF.jpg/220px-Banksia_marginata_seedling_WSF.jpg",
				"previous": "All banksias have developed proteoid or cluster roots in response to the nutrient-poor conditions of Australian soils (particularly lacking in phosphorus).[54] The root system of the suckering forms of Banksia marginata in Victoria and South Australia have a characteristic pattern with a deep tap root, and an extensive system of thick lateral roots 7.5–15 cm (3–6 in) below the surface. During the winter months, segments around 30 cm (1 ft) in length develop vegetative buds capable of forming suckers.[55] Clusters of fine proteoid roots up to 15 cm (6 in) long arise from these lateral roots.[56]",
				"after": "The response of Banksia marginata to fire is variable. In the Gibraltar Range and Sydney regions, plants are killed by fire and regenerate from seed.[36][38] They are serotinous, storing their seed in old cones, forming a seedbank in their canopy which is released after bushfire. A field study found that seeds were dispersed short distances (generally 8 m [25 ft] or less), with those closest to the parent plant faring the best.[57] In Little Desert National Park in northwestern Victoria and also eastern south Australia, it grows as a low shrub which suckers (shoots growing from lateral roots) after fire. Plants do not appear to live longer than 25 years;[58][59] after this time the ageing plants begin to die and are succeeded by younger plants arising from suckers around the parent.[58] A field study in Gippsland found counting the nodes of Banksia marginata plants to be accurate in indicating age within a year up to 21 years since the last fire. There is anecodotal evidence of plants reaching 150 years old in this region.[60] Plant species from communities dependent on fire are thought to self-select to be more flammable; Banksia marginata tested from a dry sclerophyll community in southeastern Tasmania was shown to burn readily, and fire would spread easily through it.[61]",
			"color": "gray|0.29696 grey|0.29696 dim|0.28819 gray|0.28819 dim|0.28819 grey|0.28819 dark|0.17258 gray|0.17258 dark|0.17258 grey|0.17258 silver|0.058698 dark|0.026931 slate|0.026931 gray|0.026931 black|0.026138 light|0.023968 gray|0.023968 light|0.023968 grey|0.023968 cadet|0.016887 blue|0.016887 rosy|0.016799 brown|0.016799 gainsboro|0.01319 dark|0.010162 sea|0.010162 green|0.010162 thistle|0.0093098 misty|0.0081727 rose|0.0081727  "
		}
	}
}
