{
	"add": {
		"doc": {
			"id": "16ed87d6d67cdb714385e88577b797f1e5fb8df502d63aecacf9805a87ea324c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Germania_70.svg/200px-Germania_70.svg.png",
				"previous": "Deteriorating climate in Scandinavia around 850 BC and later faster around 650 BC might have triggered migration of the Germanic tribes. By the time this migration was complete, around 250 BC, a few general cultural and linguistic groupings had emerged.[34][35] The North Sea Germanic (or Ingvaeones) inhabited the northern part of the Low Countries. They would later develop into the Frisii and the early Saxons.[35] A second grouping, the Weser-Rhine Germanic (or Istvaeones), extended along the middle Rhine and Weser and inhabited the Low Countries south of the great rivers. This group consisted of tribes that would eventually develop into the Salian Franks.[35] Also the Celtic La Tène culture (c. 450 BC up to the Roman conquest) had expanded over a wide range, including into the southern area of the Low Countries. Some scholars have speculated that even a third ethnic identity and language, neither Germanic nor Celtic, survived in the Netherlands until the Roman period, the Iron Age Nordwestblock culture,[36][37] that eventually was being absorbed by the Celts to the south and the Germanic peoples from the east.",
				"after": "During the Gallic Wars, the area south of the Oude Rijn and west of the Rhine was conquered by Roman forces under Julius Caesar from 57 BC to 53 BC.[37] Caesar describes two main tribes living in what is now the southern Netherlands: the Menapii and the Eburones. The Rhine became fixed around 12AD as Rome's northern frontier. Notable towns would arise along the Limes Germanicus: Nijmegen and Voorburg. At first part of Gallia Belgica, the area south of the Limes became part of the Roman province of Germania Inferior. The area to the north of the Rhine, inhabited by the Frisii, remained outside Roman rule (but not its presence and control), while the border tribes Batavi and Cananefates served in the Roman cavalry.[38] The Batavi rose against the Romans in the Batavian rebellion of 69AD, but were eventually defeated. The Batavi later merged with other tribes into the confederation of the Salian Franks, whose identity emerged at the first half of the third century.[39] Salian Franks appear in Roman texts as both allies and enemies. The Salian Franks were forced by the confederation of the Saxons from the east to move over the Rhine into Roman territory in the fourth century. From their new base in west Flanders and southwest Netherlands, they were raiding the English Channel. Roman forces pacified the region, but did not expel the Franks, who continued to be feared at least until the time of Julian the Apostate (358), when Salian Franks were allowed to settle as foederati in Toxandria.[39] After deteriorating climate conditions and the Romans withdrew, the Frisii disappeared from the northern Netherlands, probably forced to resettle within Roman territory as laeti in c. 296. Coastal lands remained largely unpopulated for the next two centuries.[40]",
			"color": "light|0.11693 gray|0.11693 light|0.11693 grey|0.11693 gainsboro|0.10932 pale|0.070137 golden|0.070137 rod|0.070137 bisque|0.046497 blanched|0.044869 almond|0.044869 silver|0.044565 wheat|0.038566 beige|0.037221 linen|0.034822 misty|0.033386 rose|0.033386 dark|0.030961 gray|0.030961 dark|0.030961 grey|0.030961 light|0.030166 yellow|0.030166 light|0.029945 golden|0.029945 rod|0.029945 yellow|0.029945 antique|0.029645 white|0.029645 corn|0.027264 silk|0.027264 papaya|0.026989 whip|0.026989 white|0.024686 smoke|0.024686 sea|0.023886 shell|0.023886 lemon|0.023387 chiffon|0.023387 gray|0.019943 grey|0.019943 light|0.013892 steel|0.013892 blue|0.013892 dark|0.012833 salmon|0.012833 lavender|0.011957 dim|0.011667 gray|0.011667 dim|0.011667 grey|0.011667 peach|0.010557 puff|0.010557 honeydew|0.010415 moccasin|0.0085671 salmon|0.0081709 tan|0.0075716 dark|0.0070553 sea|0.0070553 green|0.0070553 old|0.0069876 lace|0.0069876 lavender|0.0065018 blush|0.0065018 navajo|0.0063966 white|0.0063966 light|0.0063072 blue|0.0063072 light|0.0052689 salmon|0.0052689 light|0.0048694 coral|0.0048694  "
		}
	}
}
