{
	"add": {
		"doc": {
			"id": "16f20d563bd122a031257af1d38c3c9572dc7a29ca8efbc413bf95cf46872432",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Alamo_Square_with_Painted_Ladies%2C_SF%2C_CA%2C_jjron_26.03.2012.jpg/220px-Alamo_Square_with_Painted_Ladies%2C_SF%2C_CA%2C_jjron_26.03.2012.jpg",
				"previous": "Several of San Francisco's parks and nearly all of its beaches form part of the regional Golden Gate National Recreation Area, one of the most visited units of the National Park system in the United States with over 13 million visitors a year. Among the GGNRA's attractions within the city are Ocean Beach, which runs along the Pacific Ocean shoreline and is frequented by a vibrant surfing community, and Baker Beach, which is located in a cove west of the Golden Gate and part of the Presidio, a former military base. Also within the Presidio is Crissy Field, a former airfield that was restored to its natural salt marsh ecosystem. The GGNRA also administers Fort Funston, Lands End, Fort Mason, and Alcatraz. The National Park Service separately administers the San Francisco Maritime National Historical Park – a fleet of historic ships and waterfront property around Aquatic Park.",
				"after": "There are more than 220 parks maintained by the San Francisco Recreation & Parks Department.[215] The largest and best-known city park is Golden Gate Park,[216] which stretches from the center of the city west to the Pacific Ocean. Once covered in native grasses and sand dunes, the park was conceived in the 1860s and was created by the extensive planting of thousands of non-native trees and plants. The large park is rich with cultural and natural attractions such as the Conservatory of Flowers, Japanese Tea Garden and San Francisco Botanical Garden. Lake Merced is a fresh-water lake surrounded by parkland and near the San Francisco Zoo, a city-owned park that houses more than 250 animal species, many of which are endangered.[217] The only park managed by the California State Park system located principally in San Francisco, Candlestick Point was the state's first urban recreation area.[218]",
			"color": "light|0.37003 steel|0.37003 blue|0.37003 silver|0.12378 light|0.10915 gray|0.10915 light|0.10915 grey|0.10915 dark|0.090079 gray|0.090079 dark|0.090079 grey|0.090079 gainsboro|0.068243 gray|0.050705 grey|0.050705 dim|0.031625 gray|0.031625 dim|0.031625 grey|0.031625 antique|0.017161 white|0.017161 light|0.013587 blue|0.013587 blanched|0.0099675 almond|0.0099675 tan|0.009776 bisque|0.0095026 papaya|0.0094081 whip|0.0094081 wheat|0.0093172 linen|0.0072648 beige|0.0063499 old|0.0057536 lace|0.0057536 peach|0.00544 puff|0.00544 lavender|0.0050689 corn|0.0047219 silk|0.0047219 white|0.003818 smoke|0.003818 sea|0.0034669 shell|0.0034669  "
		}
	}
}
