{
	"add": {
		"doc": {
			"id": "16fceecd980c8dfa88dde3847069d7ce5ec8f9a92dd121103bfce5f968abd1b5",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d9/PalmettoHealthBaptistHospital.jpg/220px-PalmettoHealthBaptistHospital.jpg",
				"previous": "The Sisters of Charity Providence Hospitals is sponsored by the Sisters of Charity of Saint Augustine (CSA) Health System. The non-profit organization is licensed for 304 beds and comprises four entities: Providence Hospital, Providence Heart Institute, Providence Hospital Northeast, and Providence Orthopaedic & NeuroSpine Institute. Providence Hospital, located in downtown Columbia, was founded by the Sisters of Charity of Saint Augustine in 1938. The facility offers cardiac care through Providence Heart Institute, which is considered a quality cardiac center in South Carolina. Providence Hospital Northeast is a 46-bed community hospital established in 1999 that offers a range of medical services in surgery, emergency care, women's and children's services, and rehabilitation. Providence Northeast is home to Providence Orthopaedic & NeuroSpine Institute, which provides medical and surgical treatment of diseases and injuries of the bones, joints, and spine.",
				"after": "Palmetto Health is a South Carolina nonprofit public benefit corporation consisting of Palmetto Health Richland and Palmetto Health Baptist hospitals (2locations; 1 downtown and 1 in the Harbison area) in Columbia. Palmetto Health provides health care for nearly 70 percent of the residents of Richland County and almost 55 percent of the health care for both Richland and Lexington counties. Palmetto Health Richland is the primary teaching hospital for the University of South Carolina School of Medicine. Palmetto Health Baptist recently underwent a $40 million multi-phase modernization which included 37,000 square feet (3,400 m2) of new construction and 81,000 square feet (7,500 m2) of renovations. The extensive health system also operates Palmetto Health Children's Hospital and Palmetto Health Heart Hospital, the state's first freestanding hospital dedicated solely to heart care, which opened in January 2006. The Palmetto Health South Carolina Cancer Center offers patient services at the Palmetto Health Baptist and Palmetto Health Richland campuses; both are recognized by the American College of Surgeons Commission on Cancer as a Network Cancer Program.",
			"color": "gray|0.28747 grey|0.28747 dim|0.20106 gray|0.20106 dim|0.20106 grey|0.20106 dark|0.11461 gray|0.11461 dark|0.11461 grey|0.11461 rosy|0.063092 brown|0.063092 dark|0.060073 slate|0.060073 gray|0.060073 silver|0.056994 black|0.042608 slate|0.031089 gray|0.031089 light|0.023399 gray|0.023399 light|0.023399 grey|0.023399 light|0.022195 slate|0.022195 gray|0.022195 dark|0.022125 olive|0.022125 green|0.022125 gainsboro|0.014368 misty|0.0073151 rose|0.0073151  "
		}
	}
}
