{
	"add": {
		"doc": {
			"id": "16fe21d54c9ae724a0b48478d91d3edea7ba11e78b93a5f803e03849e13c4d38",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Flickr_-_moses_namkung_-_30_Seconds_to_Mars-3.jpg/170px-Flickr_-_moses_namkung_-_30_Seconds_to_Mars-3.jpg",
				"previous": "Leto's next film was the 2009 science fiction drama Mr. Nobody, directed by Jaco Van Dormael. He portrayed the title role of Nemo Nobody, the last mortal on Earth after the human race has achieved quasi-immortality. His role required him to play various versions of his character, from 34 to 118 years old, spending six hours daily for the full make-up and adopting the voice of an old-aged man.[70] Mr. Nobody premiered at the 2009 Venice Film Festival. Critical response praised the film's artistry and Leto's performance.[71] Boyd van Hoeij from Variety felt that \"his acting talent really comes into full view in his scenes as the last dying man on Earth. Despite too much old-age makeup, Leto nevertheless infuses the character with some real raw emotional power;\"[72] while Bruce Kirkland of Toronto Sun claimed that Leto gave \"a marvelously full-blooded, brain-spinning, tour-de-force performance.\"[73]",
				"after": "In 2009, Leto recruited scores of extras and all manner of surrealist street performers for the short film of \"Kings and Queens\", which features a critical mass movement founded with forward-thinking and eco-conscious intentions, through Los Angeles at night.[74] The short film premiered on November 9, 2009 at the Montalban Theater in Los Angeles and was positively received.[75] At the 2010 MTV Video Music Awards, \"Kings and Queens\" received four nominations, including Video of the Year and Best Direction, and went on to win Best Rock Video.[76] Thirty Seconds to Mars began their Into the Wild Tour in February 2010 and was among the hardest-working touring artists of the year.[77]",
			"color": "black|0.88003 lavender|0.0068828 white|0.0064451 smoke|0.0064451 ghost|0.0058175 white|0.0058175 alice|0.0057884 blue|0.0057884 snow|0.0054505 white|0.0051541 dark|0.0048169 gray|0.0048169 dark|0.0048169 grey|0.0048169 mint|0.0047493 cream|0.0047493 azure|0.0045863 dim|0.0045693 gray|0.0045693 dim|0.0045693 grey|0.0045693 gainsboro|0.0043956 lavender|0.0043389 blush|0.0043389 sea|0.0042303 shell|0.0042303 gray|0.0041299 grey|0.0041299 dark|0.004074 slate|0.004074 gray|0.004074 floral|0.0040466 white|0.0040466 rosy|0.0038344 brown|0.0038344 light|0.0038004 gray|0.0038004 light|0.0038004 grey|0.0038004 light|0.0037944 steel|0.0037944 blue|0.0037944 misty|0.00343 rose|0.00343 silver|0.003407  "
		}
	}
}
