{
	"add": {
		"doc": {
			"id": "1712a071c7d31609b7da0652b9ef925b8d4ba5a8ad596fe2c89fe5e6543261d9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Edwards%27_Dodo.jpg/220px-Edwards%27_Dodo.jpg",
				"previous": "All post-1638 depictions appear to be based on earlier images, around the time reports mentioning dodos became rarer. Differences in the depictions led authors such as Anthonie Cornelis Oudemans and Masauji Hachisuka to speculate about sexual dimorphism, ontogenic traits, seasonal variation, and even the existence of different species, but these theories are not accepted today. Because details such as markings of the beak, the form of the tail feathers, and colouration vary from account to account, it is impossible to determine the exact morphology of these features, whether they signal age or sex, or if they even reflect reality.[47] Dodo specialist Julian Hume argued that the nostrils of the living dodo would have been slits, as seen in the Gelderland, Cornelis Saftleven, Crocker Art Gallery, and Ustad Mansur images. According to this claim, the gaping nostrils often seen in paintings indicate that taxidermy specimens were used as models.[2]",
				"after": "The traditional image of the dodo is of a very fat and clumsy bird, but this view may be exaggerated. The general opinion of scientists today is that many old European depictions were based on overfed captive birds or crudely stuffed specimens.[48] It has also been suggested that the images might show dodos with puffed feathers, as part of display behaviour.[39] The Dutch painter Roelant Savery was the most prolific and influential illustrator of the dodo, having made at least ten depictions, often showing it in the lower corners. A famous painting of his from 1626, now called Edwards's Dodo as it was once owned by the ornithologist George Edwards, has since become the standard image of a dodo. It is housed in the Natural History Museum, London. The image shows a particularly fat bird and is the source for many other dodo illustrations.[49]",
			"color": "black|0.82852 khaki|0.045015 saddle|0.031362 brown|0.031362  "
		}
	}
}
