{
	"add": {
		"doc": {
			"id": "172aeabba0d56e2c8bedab7fe6212180e79ec655d0d2cd342cce127cf08b176e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Equinox-Revised-Julian-Jerusalem-SOLEX-11.png/220px-Equinox-Revised-Julian-Jerusalem-SOLEX-11.png",
				"previous": "The following is a scatter plot of actual astronomical northward equinox moments as numerically integrated by SOLEX 11[7][8] using DE421 mode[9] with extended (80-bit) floating point precision, high integration order (18th order), and forced solar mass loss[10] (\"forced\" means taken into account at all times). SOLEX can automatically search for northern hemisphere spring equinox moments by finding when the solar declination crosses the celestial equator northward, and then it outputs that data as the Terrestrial Time day and fraction of day relative to 1 January 2000 at noon (J2000.0 epoch). The progressive tidal slowing of the Earth rotation rate was accounted for by subtracting ΔT as calculated by the Espenak-Meeus polynomial set recommended at the NASA Eclipses web site[11] to obtain the J2000.0-relative Universal Time moments, which were then properly converted to Revised Julian dates and Jerusalem local apparent time, taking local apparent midnight as the beginning of each calendar day. The year range of the chart was limited to dates before the year 4400 AD—by then ΔT is expected to accumulate to about six hours, with an uncertainty of less than 21/2 hours.[12]",
				"after": "The chart shows that the long-term equinox drift of the Revised Julian calendar is quite satisfactory, at least until 4400 AD. The medium-term wobble spans about two days because, like the Gregorian calendar, the leap years of the Revised Julian calendar are not smoothly spread: they occur mostly at intervals of four years but there are occasional eight-year gaps (at 7 out of 9 century years). Evidently each of the authorities responsible for the Gregorian and Revised Julian calendars, respectively, accepted a modest amount of medium-term equinox wobble for the sake of traditionally perceived leap rule mental arithmetic simplicity. Therefore the wobble is essentially a curiosity that is of no practical or ritual concern.",
			"color": "gray|0.097226 grey|0.097226 dark|0.077067 gray|0.077067 dark|0.077067 grey|0.077067 white|0.06986 smoke|0.06986 ghost|0.063945 white|0.063945 alice|0.063919 blue|0.063919 sea|0.063595 shell|0.063595 snow|0.06351 white|0.062207 mint|0.06032 cream|0.06032 lavender|0.058257 blush|0.058257 floral|0.057726 white|0.057726 azure|0.05617 dim|0.049696 gray|0.049696 dim|0.049696 grey|0.049696 silver|0.046588 light|0.039669 gray|0.039669 light|0.039669 grey|0.039669 gainsboro|0.035737 linen|0.0095692 ivory|0.006532 lavender|0.0049309 light|0.0038719 pink|0.0038719 pink|0.003294  "
		}
	}
}
