{
	"add": {
		"doc": {
			"id": "172e55d4fc5ca128b1c27ed5d04a261b945f71f9b022105fe1df84421377b07b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Vladimir_Putin_with_Princess_Anne-1.jpg/220px-Vladimir_Putin_with_Princess_Anne-1.jpg",
				"previous": "Anne has always shown a keen interest in horses and equine pursuits. At the age of 21, Anne won the individual title at the European Eventing Championship, and was voted the BBC Sports Personality of the Year in 1971. For more than five years she also competed with the British eventing team, winning a silver medal in both individual and team disciplines in the 1975 European Eventing Championship, riding the home-bred Doublet. The following year Anne participated in the 1976 Olympic Games in Montreal as a member of the British team, riding the Queen's horse, Goodwill. Princess Anne assumed the Presidency of the Fédération Équestre Internationale from 1986 until 1994.[22] On 5 February 1987, she became the first Royal to appear as a contestant on a television quiz-show when she competed on the BBC panel game A Question of Sport. Her daughter, Zara Phillips is also a keen equestrian competitor. Together with her horse, Toytown, she won individual and team gold medals at the 2005 European Eventing Championship as well as individual gold and team silver medals at the 2006 FEI World Equestrian Games.",
				"after": "As Princess Royal, Anne undertakes a number of official duties on behalf of her mother, in support of the Queen's role as sovereign of the Commonwealth realms. Kevin S. MacLeod, the Canadian Secretary to the Queen, said of Anne in 2014: \"Her credo is 'Keep me busy. I'm here to work. I'm here to do good things. I'm here to meet as many people as possible.\"[23]",
			"color": "tan|0.07807 dark|0.069922 olive|0.069922 green|0.069922 burly|0.062021 wood|0.062021 rosy|0.061729 brown|0.061729 black|0.050941 dim|0.037895 gray|0.037895 dim|0.037895 grey|0.037895 floral|0.034924 white|0.034924 sea|0.032259 shell|0.032259 mint|0.030425 cream|0.030425 white|0.02901 smoke|0.02901 snow|0.027709 gray|0.026876 grey|0.026876 white|0.026443 ivory|0.025362 dark|0.024132 gray|0.024132 dark|0.024132 grey|0.024132 wheat|0.023567  "
		}
	}
}
