{
	"add": {
		"doc": {
			"id": "173fbab685ffea03c8a6bd3a33e8d1ca6d0fb0502438877ee500871d3b78ff81",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/British_Airways_Iberia_aircraft_tails_BA_IB.jpg/220px-British_Airways_Iberia_aircraft_tails_BA_IB.jpg",
				"previous": "Bob Ayling's leadership led to a cost savings of £750m and the establishment of a budget airline, Go, in 1998.[14] The next year, however, British Airways reported an 84% drop in profits in its first quarter alone, its worst in seven years.[15] In March 2000, Ayling was removed from his position and British Airways announced Rod Eddington as his successor. That year, British Airways and KLM conducted talks on a potential merger, reaching a decision in July to file an official merger plan with the European Commission.[16] The plan fell through in September 2000.[17] British Asia Airways ceased operations in 2001 after BA suspended flights to Taipei. Go was sold to its management and the private equity firm 3i in June 2001.[18] Eddington would make further workforce cuts due to reduced demand following 11 September attacks in 2001,[8] and BA sold its stake in Qantas in September 2004.[19] In 2005 Willie Walsh, managing director of Aer Lingus and a former pilot, became the chief executive officer of British Airways.[20] BA unveiled its new subsidiary OpenSkies in January 2008, taking advantage of the liberalisation of transatlantic traffic rights between Europe and the United States. OpenSkies flies non-stop from Paris to New York's JFK and Newark airports.[21]",
				"after": "On July 2008 British Airways announced a merger plan with Iberia, another airline in the Oneworld alliance, wherein each airline would retain its original brand.[22] The agreement was confirmed in April 2010,[23] and in July the European Commission and US Department of Transport permitted the merger and began to co-ordinate transatlantic routes with American Airlines.[24][25] On 6 October 2010 the alliance between British Airways, American Airlines and Iberia formally began operations. The alliance generates an estimated £230 million in annual cost-saving for BA, in addition to the £330 million which would be saved by the merge with Iberia.[26][27] This merger was finalised on 21 January 2011, resulting in the International Airlines Group (IAG), the world's third-largest airline in terms of annual revenue and the second-largest airline group in Europe.[23][28] Prior to merging, British Airways owned a 13.5% stake in Iberia, and thus received ownership of 55% of the combined International Airlines Group; Iberia's other shareholders received the remaining 45%.[29] As a part of the merger, British Airways ceased trading independently on the London Stock Exchange after 23 years as a constituent of the FTSE 100 Index.[30]",
			"color": "light|0.45036 steel|0.45036 blue|0.45036 dim|0.04377 gray|0.04377 dim|0.04377 grey|0.04377 gainsboro|0.042794 light|0.041176 gray|0.041176 light|0.041176 grey|0.041176 white|0.029777 smoke|0.029777 firebrick|0.029125 orange|0.028074 alice|0.027456 blue|0.027456 ghost|0.023099 white|0.023099 indian|0.022411 red|0.022411 gray|0.021424 grey|0.021424 lavender|0.019349 azure|0.016525 lavender|0.016268 blush|0.016268 snow|0.015987 dark|0.01574 gray|0.01574 dark|0.01574 grey|0.01574 silver|0.014008 mint|0.013262 cream|0.013262 white|0.012424 crimson|0.012303 brown|0.0097795 thistle|0.0094957 sea|0.0086095 shell|0.0086095 rosy|0.0076172 brown|0.0076172 light|0.0070784 cyan|0.0070784 misty|0.0064141 rose|0.0064141 floral|0.0063123 white|0.0063123 linen|0.0046562  "
		}
	}
}
