{
	"add": {
		"doc": {
			"id": "174a3b6491736ace55309cdf4da9f8cf3e5ca97447a24a7a09ce17f8899fa94f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Boarding_Wideroe_aircraft_at_Troms%C3%B8.jpg/220px-Boarding_Wideroe_aircraft_at_Troms%C3%B8.jpg",
				"previous": "Fred. Olsen & Co. decided to buy part of Widerøe again in the late 1960s, and in 1970 Braathens SAFE bought 18% of the company. In 1991 Braathens SAFE and SAS sold to Fred. Olsen, who owned 64% of the company. The other owners at that time were Torghatten Trafikkselskap, Nordlandsbanken and Fylkesbaatane i Sogn og Fjordane. In 1997 Fred. Olsen sold 29% of its stock to SAS Group, who later bought the rest of the company.",
				"after": "Following the deregulation of the Norwegian airline market in 1994, Widerøe launched new international routes, which included flights from Bergen and Stavanger to Aberdeen, Edinburgh and Newcastle in the UK, as well as from Trondheim to Copenhagen and Stockholm. For some of these operations, Widerøe acquired 76-seat Dash-8-Q400 aircraft. After Scandinavian Airlines bought Braathens in 2002, the group decided to operate Braathens' regional routes in Western Norway with the SAS Commuters Fokker 50 aircraft operating in Northern Norway. The routes in Western Norway were until then operated by Norwegian Air Shuttle, who then became a low-cost carrier. SAS Commuter left its operations in Northern Norway to Widerøe, who operate all the SAS Group's regional routes north of Trondheim. This involved that Widerøe took over the routes from Tromsø to Alta, Lakselv and Kirkenes, and the route from Evenes to Tromsø, Bodø and Trondheim from October 2002.[24]",
			"color": "dark|0.59157 slate|0.59157 gray|0.59157 dim|0.15267 gray|0.15267 dim|0.15267 grey|0.15267 gray|0.065253 grey|0.065253 black|0.052942 dark|0.037606 gray|0.037606 dark|0.037606 grey|0.037606 light|0.032128 slate|0.032128 gray|0.032128 slate|0.030036 gray|0.030036 light|0.013907 steel|0.013907 blue|0.013907 silver|0.010653  "
		}
	}
}
