{
	"add": {
		"doc": {
			"id": "175e58b37527d6c22b68835bfd9a66ad22145863c1dadc635ac3d808eb75b985",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Iran_Air_Boeing_747-200_cockpit_Sharifi.jpg/220px-Iran_Air_Boeing_747-200_cockpit_Sharifi.jpg",
				"previous": "In 1965, Joe Sutter was transferred from Boeing's 737 development team to manage the design studies for a new airliner, already assigned the model number 747.[19] Sutter initiated a design study with Pan Am and other airlines, to better understand their requirements. At the time, it was widely thought that the 747 would eventually be superseded by supersonic transport aircraft.[20] Boeing responded by designing the 747 so that it could be adapted easily to carry freight and remain in production even if sales of the passenger version declined. In the freighter role, the clear need was to support the containerized shipping methodologies that were being widely introduced at about the same time. Standard containers are 8 ft (2.4 m) square at the front (slightly higher due to attachment points) and available in 20 and 40 ft (6.1 and 12 m) lengths. This meant that it would be possible to support a 2-wide 2-high stack of containers two or three ranks deep with a fuselage size similar to the earlier CX-HLS project.",
				"after": "In April 1966, Pan Am ordered 25 747-100 aircraft for US$525 million. During the ceremonial 747 contract-signing banquet in Seattle on Boeing's 50th Anniversary, Juan Trippe predicted that the 747 would be \"... a great weapon for peace, competing with intercontinental missiles for mankind's destiny\".[21] As launch customer,[1][22] and because of its early involvement before placing a formal order, Pan Am was able to influence the design and development of the 747 to an extent unmatched by a single airline before or since.[23]",
			"color": "black|0.67827 saddle|0.087659 brown|0.087659 peru|0.085924 sienna|0.037924 burly|0.013633 wood|0.013633 sandy|0.013444 brown|0.013444  "
		}
	}
}
