{
	"add": {
		"doc": {
			"id": "17652e7e0716bc1b18efbd3d348864dcd86ca7cd5610d3d64ea47d4e2b370eb6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/DHC-7_G-BOAY_London_City_Aws_LCY_31.10.88_edited-2.jpg/220px-DHC-7_G-BOAY_London_City_Aws_LCY_31.10.88_edited-2.jpg",
				"previous": "The Twin Otter incorporated \"flaperons\" that drooped the ailerons as part of the flaps, but these were not included in the Dash 7 due to weight and complexity. Instead, the ailerons were reduced in size to allow more flap area, and were augmented with two sets of roll spoilers, or \"spoilerons\". The inboard roll spoilers operate at all speeds while the outboard roll spoilers only operate at speeds less than 130KIAS to allow for more roll control at slower speeds. Upon touchdown, both the inboard and outboard roll spoilers extend in unison to aid in destroying lift created by the wing. Each wing also includes two ground spoilers which only extend on touchdown. Most of the trailing edge is spanned by a complex double Fowler flap arrangement for high lift at low speed. During a typical STOL landing, flaps are selected to the 45° position allowing for steeper descents and slower approach speeds. Depending on weight, the VREF speed with flaps at 45° is between 70-85 knots. On touchdown, through \"squat switches\" in the main gear, the flaps automatically retract to the 25° position and thus reduce lift once on the runway producing better braking performance. The flaps also retract to 25° when engine power is increased during a go-around procedure. The four-engine layout aids lift at low speeds due to the wide span of the propellers blowing air over the wing (\"propwash\"). When reverse thrust is selected on landing, the props reverse pitch, push air forward and slow the aircraft very effectively along with the anti-skid wheel brakes. More importantly, if an engine fails, the asymmetric thrust is much less than on a twin-engine layout, thereby increasing safety and allowing for a lower VMC (minimum control speed) with an engine inoperative .",
				"after": "Development started in 1972 and the prototype first flew on March 27, 1975. Testing went smoothly, and the first delivery took place to Rocky Mountain Airways on February 3, 1978. The Dash 7 enabled Rocky Mountain Airways to operate scheduled passenger air service from Denver into the Avon STOLport in Colorado which was controlled by the airline. The Avon STOLport was located in a mountain valley in close proximity to the Vail ski resort. Another close-in ski resort airfield served by Rocky Mountain Airways with Dash 7 flights from Denver was Steamboat Springs Airport in Colorado. With a relatively short runway length of 4,452 feet and an airfield elevation of 6,882 feet, the Dash 7 was well suited for operations from this airport located in the Rocky Mountains.",
			"color": "black|0.38862 antique|0.089675 white|0.089675 tan|0.078448 linen|0.041511 old|0.032375 lace|0.032375 gainsboro|0.030299 papaya|0.029115 whip|0.029115 beige|0.025609 light|0.025126 gray|0.025126 light|0.025126 grey|0.025126 dark|0.020432 gray|0.020432 dark|0.020432 grey|0.020432 dark|0.019752 khaki|0.019752 sea|0.019729 shell|0.019729 blanched|0.017016 almond|0.017016 silver|0.016408 floral|0.016407 white|0.016407 wheat|0.014237 dim|0.012619 gray|0.012619 dim|0.012619 grey|0.012619 corn|0.012308 silk|0.012308 burly|0.011416 wood|0.011416 ivory|0.010684 gray|0.010007 grey|0.010007 dark|0.009788 slate|0.009788 gray|0.009788 bisque|0.0097845 misty|0.0084151 rose|0.0084151  "
		}
	}
}
