{
	"add": {
		"doc": {
			"id": "1765f20a825e09f3d2e590e91628558f0424abbfdeb9381cbb6318738de86b57",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Lockheed_L749A_F-BAZE_Algerie_ORY_31.05.57_edited-3.jpg/220px-Lockheed_L749A_F-BAZE_Algerie_ORY_31.05.57_edited-3.jpg",
				"previous": "In 1946, Compagnie Générale de Transports Aériens (CGTA) was established. It started flights between Algeria and Europe on a charter basis in 1947, but by the end of the decade scheduled flights serving Algiers, Basle, Bône, Geneva, Marseilles, Paris, Philippeville and Toulouse were operated.[13] Three 34-seater Bretagnes joined a fleet of seven DC-3s in 1952.[14] Compagnie Air Transport (CAT), subsidiary of Air France and Compagnie Générale Transatlantique, was formed in the late 1940s to connect Basle, Lyon, Marseilles, Paris and Toulouse with Algiers, Constantine and Oran. Seasonal London–Deauville and –Le Touquet flights were also undertaken. Following the drop in traffic after 1951, a merging partner was under consideration.[15]",
				"after": "CGTA and CAT merged on 23 May 1953 (1953-05-23) to form the Compagnie Générale de Transports Aériens Air Algérie,[15][16] with a combined fleet that included one Breguet 761, six Bretagnes, five DC-3s and three DC-4s.[17] Following merger, Air Algérie commenced seasonal services to Ajaccio, Clermont, Montpellier and Perpignan. Furthermore, Switzerland was added to the regular schedule, a stop at Palma was performed on a weekly basis in partnership with Aviaco, and most of the trans-Mediterranean routes were operated in a pool agreement with Air France, with the French carrier flying 54% of these services and the remainder was left for Air Algérie. Flights to the Cote d'Azur were added in the late 1950s.[15]",
			"color": "black|0.51014 dim|0.056196 gray|0.056196 dim|0.056196 grey|0.056196 dark|0.038734 gray|0.038734 dark|0.038734 grey|0.038734 gainsboro|0.037996 light|0.03746 gray|0.03746 light|0.03746 grey|0.03746 silver|0.034845 white|0.032114 smoke|0.032114 gray|0.031574 grey|0.031574 sea|0.0268 shell|0.0268 snow|0.025636 alice|0.025502 blue|0.025502 ghost|0.025294 white|0.025294 linen|0.024207 floral|0.022082 white|0.022082 white|0.021895 mint|0.019687 cream|0.019687 lavender|0.014067 blush|0.014067 azure|0.013098  "
		}
	}
}
