{
	"add": {
		"doc": {
			"id": "177149cfea48f9186fcbc9eafc0bae342950d70e8f7a8552d32f32debbfa165b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Baden_Powell.jpg/220px-Baden_Powell.jpg",
				"previous": "Baden-Powell was the garrison commander during the subsequent Siege of Mafeking, which lasted 217 days. Although Baden-Powell could have destroyed his stores and had sufficient forces to break out throughout much of the siege, especially since the Boers lacked adequate artillery to shell the town or its forces, he remained in the town to the point of his intended mounted soldiers eating their horses. The garrison held out until relieved, in part thanks to cunning deceptions devised by Baden-Powell. Fake minefields were planted and his soldiers pretended to avoid non-existent barbed wire while moving between trenches.[18] Baden-Powell did most of the reconnaissance work himself.[19] In one instance noting that the Boers had not removed the rail line, Baden-Powell loaded an armoured locomotive with sharpshooters and successfully sent it down the rails into the heart of the Boer encampment and back again in a strategic attempt to decapitate the Boer leadership.",
				"after": "Contrary views of Baden-Powell's actions during the siege argue that his success in resisting the Boers was secured at the expense of the lives of the native African soldiers and civilians, including members of his own African garrison. Pakenham stated that Baden-Powell drastically reduced the rations to the native garrison.[20] However, in 2001, after subsequent research, Pakenham decidedly retreated from this position.[9][21]",
			"color": "tan|0.2035 antique|0.0935 white|0.0935 dim|0.077026 gray|0.077026 dim|0.077026 grey|0.077026 brown|0.060264 misty|0.049917 rose|0.049917 linen|0.04643 slate|0.039973 gray|0.039973 papaya|0.039686 whip|0.039686 old|0.029631 lace|0.029631 blanched|0.028989 almond|0.028989 firebrick|0.026573 gray|0.023088 grey|0.023088 bisque|0.021544 gainsboro|0.018424 peach|0.01783 puff|0.01783 sea|0.017187 shell|0.017187 light|0.01639 gray|0.01639 light|0.01639 grey|0.01639 beige|0.014586 wheat|0.013642 dark|0.013426 gray|0.013426 dark|0.013426 grey|0.013426 indian|0.012535 red|0.012535 rosy|0.012159 brown|0.012159 dark|0.010768 slate|0.010768 gray|0.010768 corn|0.010282 silk|0.010282 floral|0.010165 white|0.010165 silver|0.0099845 light|0.0081643 slate|0.0081643 gray|0.0081643 crimson|0.0078745 burly|0.0076959 wood|0.0076959 ivory|0.0059398  "
		}
	}
}
