{
	"add": {
		"doc": {
			"id": "179969ba32886591eb3f16432c133a417c07c76690eadc1bcfd5ed0b81de2a0a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/United_Arab_Airlines_Ilyushin_Il-62_Volpati-1.jpg/220px-United_Arab_Airlines_Ilyushin_Il-62_Volpati-1.jpg",
				"previous": "Two more Comets, the fourth and fifth ones,[20] were ordered in early 1961.[26] Three ex-SAS DC-6s were purchased in April 1961 (1961-04). The Cairo–Lagos run was extended to Accra on 12 June and flights to Moscow commenced on 21 June.[20] A contract with Boeing for the purchase of Boeing 707-320B aircraft, with delivery dates between November 1961 (1961-11) and April 1964 (1964-04), was announced in September; the deal fell through when the airline could not find financing.[27] On 1 November, a new flight to Karachi and Bombay was launched, and the sixth and seventh Comets were ordered in December; these were delivered in April 1962 (1962-04).[28] Also in 1961, the Cairo–Nicosia run, suspended since the Suez crisis in 1956, was restored, flown with Viscount equipment.[29] Routed via Bangkok and Hong Kong, the Bombay service was extended to Tokyo in May 1962 (1962-05).[30] The three-strong crew of a DC-3 that crashed at Heliopolis on 16 May 1962 died, and 26 more people perished in an accident involving a Comet at Bangkok on 19 July the same year. Two more Comets were acquired in August, entering the fleet in September the same year and during 1963. On 15 February 1963, the route to Baghdad was resumed after a three-year hiatus, but the service was short-lived, as political tensions between Egypt, Iraq and Syria forced the disruption of flights to both this destination and to Damascus; on 1 April, a new service to Rhodesia was inaugurated. The carrier experienced two deadly accidents during 1963 that left a death toll of 93. The first one took place on 12 May when a DC-3 crashed near Alexandria, killing 27 passengers and a crew of four; the second accident occurred on 28 July and involved a Comet that crashed into the ocean near Bombay, killing 62. Short of aircraft to serve Tokyo, the route was terminated. In addition, another Comet, SU-ALM, resulted damaged in Benghazi on 12 September. The ninth and final Comet was delivered in 1964. Also that year, three ex-Pan Am DC-6Bs were purchased, and another three were acquired from Northwest Orient; these aircraft were put on service on domestic routes and began replacing the Viscounts. Also aimed at operating domestic services, seven Antonov An-24s were ordered for US$2.3 million.[28]",
				"after": "By March 1965 (1965-03), seven Comet 4Cs and four Viscounts worked on a route network across Europe, the Middle East and North Africa, along with the Cairo–Prague–Moscow run and a service to Lagos and Accra.[13] On 1 August, a subsidiary airline named Misrair started operations.[28][nb 2] A contract worth US$30 million for three Boeing 707-320Cs was signed with Boeing on 15 June 1966 and also included four additional machines on option. On 1 November, the airline suppressed the stop at Prague on the Cairo–Prague–Moscow service, and in January 1967 (1967-01) UAA started the Cairo–Frankfurt–Copenhagen run. On 22 June 1967, a Comet crashed in Kuwait while landing; there were no fatalities but the aircraft was written off. In August 1968 (1968-08), the airline took delivery of two Ilyushin Il-18s.[28] The first Boeing 707 was handed over by the aircraft manufacturer on 21 October the same year;[32] it was later put into service on the Cairo–London corridor.[28] One of the Il-18s was involved in a deadly crash while attempting to land at Aswan Airport on 20 March 1969. That March, the carrier started services to East Berlin with Il-18 equipment and in June the route to Tokyo via Kuwait, Bombay, Bangkok and Hong Kong was resumed.[28]",
			"color": "gray|0.20419 grey|0.20419 light|0.19914 steel|0.19914 blue|0.19914 dim|0.17899 gray|0.17899 dim|0.17899 grey|0.17899 light|0.12976 slate|0.12976 gray|0.12976 dark|0.063085 slate|0.063085 gray|0.063085 silver|0.037146 black|0.031716 slate|0.030369 gray|0.030369 dark|0.029708 gray|0.029708 dark|0.029708 grey|0.029708 light|0.012203 gray|0.012203 light|0.012203 grey|0.012203 gainsboro|0.0093841 white|0.0078219 smoke|0.0078219 snow|0.0065563 sea|0.0064885 shell|0.0064885 mint|0.0063186 cream|0.0063186 white|0.0061622 floral|0.0061529 white|0.0061529 ghost|0.0056578 white|0.0056578  "
		}
	}
}
