{
	"add": {
		"doc": {
			"id": "17b79d4e9000065f1315ba9aedbbd97f91b4e6fdf0c07059fa0853ed0c72df8b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/British_Airways_Trident_Three_G-AWZA.jpg/220px-British_Airways_Trident_Three_G-AWZA.jpg",
				"previous": "British Airways and Air France operated the supersonic airliner Aerospatiale-BAC Concorde, and the world's first supersonic passenger service flew in January 1976 from London Heathrow to Bahrain.[7] Services to the US began on 24 May 1976 with a flight to Washington Dulles airport, and flights to New York JFK airport followed on 22 September 1977. Service to Singapore was established in co-operation with Singapore Airlines as a continuation of the flight to Bahrain.[5] Following the Air France Concorde crash in Paris and a slump in air travel following the 11 September attacks in New York in 2001, it was decided to cease Concorde operations in 2003 after 27 years of service. The final commercial Concorde flight was BA002 from New York JFK to London Heathrow on 24 October 2003.[8]",
				"after": "In 1981 the airline was instructed to prepare for privatisation by the Conservative Thatcher government. Sir John King, later Lord King, was appointed chairman, charged with bringing the airline back into profitability. While many other large airlines struggled, King was credited with transforming British Airways into one of the most profitable air carriers in the world.[9] The flag carrier was privatised and was floated on the London Stock Exchange in February 1987.[10] British Airways effected the takeover of Britain's \"second\" airline, British Caledonian, in July of that same year.[11]",
			"color": "gray|0.36101 grey|0.36101 dim|0.25301 gray|0.25301 dim|0.25301 grey|0.25301 slate|0.087172 gray|0.087172 dark|0.076738 gray|0.076738 dark|0.076738 grey|0.076738 black|0.05584 light|0.037599 slate|0.037599 gray|0.037599 silver|0.020127 lavender|0.019635 gainsboro|0.017343 light|0.016762 gray|0.016762 light|0.016762 grey|0.016762 alice|0.011237 blue|0.011237 ghost|0.0090175 white|0.0090175 white|0.007151 smoke|0.007151 light|0.0071279 steel|0.0071279 blue|0.0071279 lavender|0.0034671 blush|0.0034671 snow|0.0032439  "
		}
	}
}
