{
	"add": {
		"doc": {
			"id": "17c7b5b05bdf7e481af8e6b4031ff865a46a622ff73a8180b758eaa07a8da720",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Benjamin_Franklin_1861_Issue-1c.jpg/170px-Benjamin_Franklin_1861_Issue-1c.jpg",
				"previous": "Franklin bequeathed £1,000 (about $4,400 at the time, or about $112,000 in 2011 dollars[165]) each to the cities of Boston and Philadelphia, in trust to gather interest for 200 years. The trust began in 1785 when the French mathematician Charles-Joseph Mathon de la Cour, who admired Franklin greatly, wrote a friendly parody of Franklin's \"Poor Richard's Almanack\" called \"Fortunate Richard\". The main character leaves a smallish amount of money in his will, five lots of 100 livres, to collect interest over one, two, three, four or five full centuries, with the resulting astronomical sums to be spent on impossibly elaborate utopian projects.[166] Franklin, who was 79 years old at the time, wrote thanking him for a great idea and telling him that he had decided to leave a bequest of 1,000 pounds each to his native Boston and his adopted Philadelphia. By 1990, more than $2,000,000 had accumulated in Franklin's Philadelphia trust, which had loaned the money to local residents. From 1940 to 1990, the money was used mostly for mortgage loans. When the trust came due, Philadelphia decided to spend it on scholarships for local high school students. Franklin's Boston trust fund accumulated almost $5,000,000 during that same time; at the end of its first 100 years a portion was allocated to help establish a trade school that became the Franklin Institute of Boston, and the whole fund was later dedicated to supporting this institute.[167][168]",
				"after": "Benjamin Franklin is a prominent figure in American history comparable to Washington, Jefferson and Lincoln, and as such he has been honored on U.S. postage stamps many times. The image of Franklin, the first Postmaster General of the United States, occurs on the face of U.S. postage more than any other notable American save that of George Washington.[169]",
			"color": "steel|0.14629 blue|0.14629 powder|0.11188 blue|0.11188 light|0.10092 blue|0.10092 sky|0.084338 blue|0.084338 light|0.078787 cyan|0.078787 pale|0.05358 turquoise|0.05358 honeydew|0.049373 light|0.048457 sky|0.048457 blue|0.048457 azure|0.04437 mint|0.038992 cream|0.038992 ivory|0.022563 beige|0.021267 floral|0.018763 white|0.018763 white|0.016514 smoke|0.016514 old|0.015855 lace|0.015855 alice|0.01568 blue|0.01568 cadet|0.014413 blue|0.014413 white|0.012416 linen|0.010518 sea|0.0098714 shell|0.0098714 gainsboro|0.0093524 light|0.0090588 steel|0.0090588 blue|0.0090588 snow|0.0079814 light|0.0075969 yellow|0.0075969 light|0.0075113 gray|0.0075113 light|0.0075113 grey|0.0075113 corn|0.0069815 silk|0.0069815 silver|0.0057975 ghost|0.0053101 white|0.0053101 dark|0.0045771 gray|0.0045771 dark|0.0045771 grey|0.0045771  "
		}
	}
}
