{
	"add": {
		"doc": {
			"id": "17cdd9ddac6a61bbbc5d6575590bc1bfddf7681348a71c195b5512353dd36597",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f5/Szkopiak_%26_Ward.jpg/220px-Szkopiak_%26_Ward.jpg",
				"previous": "The 1980 film Shamwari, also known as Chain Gang Killings in the United States, is an action thriller about two escaped prisoners, one black, one white and their developing friendship. The film was set and filmed in Rhodesia and several local white actors starred, such as Tamara Franke in the role of Tracy.[104]",
				"after": "In 1960 television was introduced into the then Southern Rhodesia. It was the first such service in the region, as South Africa did not introduce television until 1976 due to the potential ideological conflicts that it posed. The Rhodesian Broadcasting Corporation (RBC) TV was a commercial service carrying advertising, although there was also a television licence fee. Television reception was confined mainly to the large cities, and the majority of television personalities and viewers were from the white minority. The RBC used the BBC as a model in that a government department was not responsible for it, but a board of governors (selected by Ian Smith) were instead.[105] Popular television shows included Kwizzkids, Frankly Partridge and Music Time.[106] Possibly the best-known Director of the RBC was Dr. Harvey Ward. Prior to the introduction of television, RBC had developed a successful radio network, which continued. By 1978, three top white executives had fled overseas, including Dr. Ward who \"probably more than any other person, became identified with the right-wing bias on Rhodesia's radio and TV networks.\"[107] The RBC was later succeeded by the Zimbabwe Rhodesia Corporation and later in its present form as the Zimbabwe Broadcasting Corporation. The character Horace Von Khute, from the British television series Fonejacker is a Rhodesian who works for the police in intercepting a Ugandan bank scammer.",
			"color": "black|0.55569 peach|0.1018 puff|0.1018 tan|0.069578 bisque|0.043781 dark|0.024565 gray|0.024565 dark|0.024565 grey|0.024565 silver|0.022885 light|0.022548 gray|0.022548 light|0.022548 grey|0.022548 gainsboro|0.020099 antique|0.018449 white|0.018449 dim|0.016471 gray|0.016471 dim|0.016471 grey|0.016471 gray|0.013144 grey|0.013144 blanched|0.012553 almond|0.012553 linen|0.0077073 papaya|0.0073681 whip|0.0073681 burly|0.006834 wood|0.006834 white|0.0061892 smoke|0.0061892 old|0.0061055 lace|0.0061055 sea|0.0054084 shell|0.0054084 floral|0.0051879 white|0.0051879 beige|0.004715 dark|0.0043194 slate|0.0043194 gray|0.0043194  "
		}
	}
}
