{
	"add": {
		"doc": {
			"id": "17d1f4f250f6ba72ff9a66f71db82c4cc0fa3f90d68f9810efe756158f81972a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/SalemWitchcraftTrial_large.jpg/220px-SalemWitchcraftTrial_large.jpg",
				"previous": "Criminal law, also known as penal law, pertains to crimes and punishment.[151] It thus regulates the definition of and penalties for offences found to have a sufficiently deleterious social impact but, in itself, makes no moral judgment on an offender nor imposes restrictions on society that physically prevent people from committing a crime in the first place.[152] Investigating, apprehending, charging, and trying suspected offenders is regulated by the law of criminal procedure.[153] The paradigm case of a crime lies in the proof, beyond reasonable doubt, that a person is guilty of two things. First, the accused must commit an act which is deemed by society to be criminal, or actus reus (guilty act).[154] Second, the accused must have the requisite malicious intent to do a criminal act, or mens rea (guilty mind). However, for so called \"strict liability\" crimes, an actus reus is enough.[155] Criminal systems of the civil law tradition distinguish between intention in the broad sense (dolus directus and dolus eventualis), and negligence. Negligence does not carry criminal responsibility unless a particular crime provides for its punishment.[156][157]",
				"after": "Examples of crimes include murder, assault, fraud and theft. In exceptional circumstances defences can apply to specific acts, such as killing in self defence, or pleading insanity. Another example is in the 19th-century English case of R v Dudley and Stephens, which tested a defence of \"necessity\". The Mignonette, sailing from Southampton to Sydney, sank. Three crew members and Richard Parker, a 17-year-old cabin boy, were stranded on a raft. They were starving and the cabin boy was close to death. Driven to extreme hunger, the crew killed and ate the cabin boy. The crew survived and were rescued, but put on trial for murder. They argued it was necessary to kill the cabin boy to preserve their own lives. Lord Coleridge, expressing immense disapproval, ruled, \"to preserve one's life is generally speaking a duty, but it may be the plainest and the highest duty to sacrifice it.\" The men were sentenced to hang, but public opinion was overwhelmingly supportive of the crew's right to preserve their own lives. In the end, the Crown commuted their sentences to six months in jail.[158]",
			"color": "dim|0.23881 gray|0.23881 dim|0.23881 grey|0.23881 gray|0.20606 grey|0.20606 dark|0.17125 gray|0.17125 dark|0.17125 grey|0.17125 silver|0.092445 black|0.062918 antique|0.058364 white|0.058364 light|0.037521 gray|0.037521 light|0.037521 grey|0.037521 beige|0.018148 linen|0.017772 gainsboro|0.015496 old|0.015455 lace|0.015455 papaya|0.015143 whip|0.015143 corn|0.0089716 silk|0.0089716 floral|0.0081128 white|0.0081128 ivory|0.007298 sea|0.0071825 shell|0.0071825 blanched|0.0061003 almond|0.0061003  "
		}
	}
}
