{
	"add": {
		"doc": {
			"id": "17e5585376f4245ee8be0e1ad30ba910b7f9cb07691759cf358eb410c03d566a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/TAME_A320_Mariscal_Lamar_Airport_Cuenca_Ecuador.jpg/220px-TAME_A320_Mariscal_Lamar_Airport_Cuenca_Ecuador.jpg",
				"previous": "The first step taken towards this goal was in the incorporation of two Airbus A320 planes that TAME rented for a five-year period. These planes were delivered at the European Corporation Assemble factory, in Toulouse, they are the manufacturers of these modern planes. The main roof these planes are: Quito, Guayaquil and Galapagos, starting September 24, 2003. At the same time these planes were acquired, TAME started the gradual withdrawal of the Boeing 727-100 and 200, given that these planes had already worked their productive lives.",
				"after": "Finally, after a long process that took 35 months, TAME has completed 75% of the renovation process of its fleet. This process took such an extensive period of time due to the fact that there were 10 months where the company studied, analyzed and compared various types of planes that would meet all the requirements needed to fly through the difficult routes that the company offers. These studies lead to the decision of the Board of Directors to acquire Embraer’s 170/190 planes. This decision implied a letter of intent of purchase of 2 models of the 170 series and 1 of the 190 series, while at the same time keeping open the possibility to acquire 4 more planes of the 190 series, all of these from the Brazilian manufacturer. The following two years were the time needed in order to carry out all the legal dispositions applicable to the state-owned airline.",
			"color": "dim|0.32351 gray|0.32351 dim|0.32351 grey|0.32351 gray|0.17574 grey|0.17574 black|0.15231 slate|0.06831 gray|0.06831 light|0.050203 slate|0.050203 gray|0.050203 dark|0.039025 gray|0.039025 dark|0.039025 grey|0.039025 light|0.013313 golden|0.013313 rod|0.013313 yellow|0.013313 lemon|0.01277 chiffon|0.01277 blanched|0.012756 almond|0.012756 papaya|0.011981 whip|0.011981 corn|0.011578 silk|0.011578 wheat|0.011363 rosy|0.01078 brown|0.01078 antique|0.01039 white|0.01039 bisque|0.010345 beige|0.010309 light|0.0088494 yellow|0.0088494 pale|0.0072673 golden|0.0072673 rod|0.0072673 silver|0.007102 tan|0.0070085 dark|0.0065921 slate|0.0065921 gray|0.0065921 moccasin|0.0062555  "
		}
	}
}
