{
	"add": {
		"doc": {
			"id": "17f990531c65fc9e223f146c4e6407c0f7193b681cc19508a19d2834deddf26c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Old_map-Austin-1873-sm.jpg/220px-Old_map-Austin-1873-sm.jpg",
				"previous": "In 1835–1836, Texans fought and won independence from Mexico. Texas thus became its own independent country with its own president, congress, and monetary system. In 1839, the Texas Congress formed a commission to seek a site for a new capital to be named for Stephen F. Austin.[26] Mirabeau B. Lamar, second president of the newly formed Republic of Texas, advised the commissioners to investigate the area named Waterloo, noting the area's hills, waterways, and pleasant surroundings.[27] Waterloo was selected and the name Austin was chosen as the town's new name.[28] The location was seen as a convenient crossroads for trade routes between Santa Fe and Galveston Bay, as well as routes between northern Mexico and the Red River.[29] Austin is also the site where the southern leg of the Chisholm Trail leads to the Colorado River.[30]",
				"after": "Edwin Waller was picked by Lamar to survey the village and draft a plan laying out the new capital.[26] The original site was narrowed to 640 acres (259 ha) that fronted the Colorado River between two creeks, Shoal Creek and Waller Creek, which was later named in his honor. The 14-block grid plan was bisected by a broad north-south thoroughfare, Congress Avenue, running up from the river to Capital Square, where the new Texas State Capitol was to be constructed. A temporary one-story capitol was erected on the corner of Colorado and 8th Streets. On August 1, 1839, the first auction of 217 out of 306 lots total was held.[26][29] The grid plan Waller designed and surveyed now forms the basis of downtown Austin.",
			"color": "gray|0.30777 grey|0.30777 dark|0.27463 gray|0.27463 dark|0.27463 grey|0.27463 dim|0.18162 gray|0.18162 dim|0.18162 grey|0.18162 silver|0.093831 light|0.029374 gray|0.029374 light|0.029374 grey|0.029374 slate|0.014148 gray|0.014148 gainsboro|0.013466 antique|0.012906 white|0.012906 light|0.010462 slate|0.010462 gray|0.010462 linen|0.0056619 papaya|0.0050896 whip|0.0050896 blanched|0.0043309 almond|0.0043309 old|0.0042628 lace|0.0042628 misty|0.0042262 rose|0.0042262 tan|0.0037867 beige|0.0034623  "
		}
	}
}
