{
	"add": {
		"doc": {
			"id": "17fb54e074b7363b50dd9e5d955a4c79af7da9eedea7e36619d902976ee8a4bb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Fiterman_hall_damage.jpg/220px-Fiterman_hall_damage.jpg",
				"previous": "The bulk of the investigation of 7 World Trade Center was delayed until after reports were completed on the Twin Towers.[8] In the meantime, NIST provided a preliminary report about 7 World Trade Center in June 2004, and thereafter released occasional updates on the investigation.[37] According to NIST, the investigation of 7 World Trade Center was delayed for a number of reasons, including that NIST staff who had been working on 7 World Trade Center were assigned full-time from June 2004 to September 2005 to work on the investigation of the collapse of the Twin Towers.[49] In June 2007, Shyam Sunder explained, \"We are proceeding as quickly as possible while rigorously testing and evaluating a wide range of scenarios to reach the most definitive conclusion possible. The 7 WTC investigation is in some respects just as challenging, if not more so, than the study of the towers. However, the current study does benefit greatly from the significant technological advances achieved and lessons learned from our work on the towers.\"[50]",
				"after": "In November 2008, NIST released its final report on the causes of the collapse of 7 World Trade Center.[7] This followed NIST's August 21, 2008, draft report which included a period for public comments.[8] In its investigation, NIST utilized ANSYS to model events leading up to collapse initiation and LS-DYNA models to simulate the global response to the initiating events.[51] NIST determined that diesel fuel did not play an important role, nor did the structural damage from the collapse of the Twin Towers, nor did the transfer elements (trusses, girders, and cantilever overhangs). But the lack of water to fight the fire was an important factor. The fires burned out of control during the afternoon, causing floor beams near column 79 to expand and push a key girder off its seat, triggering the floors to fail around column 79 on Floors 8 to 14. With a loss of lateral support across nine floors, column 79 buckled – pulling the east penthouse and nearby columns down with it. With the buckling of these critical columns, the collapse then progressed east-to-west across the core, ultimately overloading the perimeter support, which buckled between Floors 7 and 17, causing the remaining portion of the building above to fall downward as a single unit. The fires, fueled by office contents, along with the lack of water, were the key reasons for the collapse.[7]",
			"color": "dark|0.13049 gray|0.13049 dark|0.13049 grey|0.13049 silver|0.12755 light|0.11891 gray|0.11891 light|0.11891 grey|0.11891 gray|0.11284 grey|0.11284 gainsboro|0.098005 dim|0.087464 gray|0.087464 dim|0.087464 grey|0.087464 lavender|0.034162 black|0.023595 rosy|0.022307 brown|0.022307 white|0.021189 smoke|0.021189 alice|0.019744 blue|0.019744 light|0.017674 steel|0.017674 blue|0.017674 ghost|0.016887 white|0.016887 slate|0.014012 gray|0.014012 light|0.013492 slate|0.013492 gray|0.013492 lavender|0.013303 blush|0.013303 tan|0.012634 thistle|0.011052 snow|0.010435 azure|0.0087269 white|0.007429  "
		}
	}
}
