{
	"add": {
		"doc": {
			"id": "181183b2b2acbabb7a12d4bd12c0f7f4478aa547e0784981dbe641079d988273",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Kilgour_Building%2C_OCLC%2C_Dublin%2C_OH.jpg/261px-Kilgour_Building%2C_OCLC%2C_Dublin%2C_OH.jpg",
			"previous": [],
				"after": "Originally named the Ohio College Library Center, OCLC began in 1967 through a collaboration of Ohio university presidents, vice presidents, and library directors who wanted to create a cooperative, computerized network for Ohio libraries. The group first met on July 5, 1967 on the campus of The Ohio State University to sign the articles of incorporation for the nonprofit organization.[3] The group hired Frederick G. Kilgour, a former Yale University medical school librarian, to design the shared cataloging system.[4] Kilgour wished to merge the latest information storage and retrieval system of the time, the computer, with the oldest, the library. The plan was to merge the catalogs of Ohio libraries electronically through a computer network and database in order to streamline operations, control costs, and increase efficiency in library management. The goal of this network and database was to bring libraries together to cooperatively keep track of the world's information in order to best serve researchers and scholars. The first library to do online cataloging through OCLC was the Alden Library at Ohio University on August 26, 1971. This was the first occurrence of online cataloging by any library worldwide.[3]",
			"color": "dark|0.13246 olive|0.13246 green|0.13246 dark|0.081929 gray|0.081929 dark|0.081929 grey|0.081929 gray|0.070031 grey|0.070031 dim|0.060254 gray|0.060254 dim|0.060254 grey|0.060254 dark|0.052584 slate|0.052584 gray|0.052584 powder|0.050711 blue|0.050711 antique|0.047264 white|0.047264 beige|0.041983 black|0.041978 old|0.03842 lace|0.03842 linen|0.035943 corn|0.031232 silk|0.031232 papaya|0.030615 whip|0.030615 light|0.030518 blue|0.030518 ivory|0.030133 floral|0.029418 white|0.029418 slate|0.023675 gray|0.023675 light|0.022955 yellow|0.022955 honeydew|0.02292 silver|0.02188 light|0.016501 slate|0.016501 gray|0.016501 sea|0.01492 shell|0.01492 light|0.013994 gray|0.013994 light|0.013994 grey|0.013994 gainsboro|0.011839  "
		}
	}
}
