{
	"add": {
		"doc": {
			"id": "181836c486586eefef7bd2f6cfbd145e06cb72d8635ebbc4c8bba25d299cc4bf",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d1/Longxingsi400x300.jpg/220px-Longxingsi400x300.jpg",
				"previous": "The text then went on to describe in full detail the intricate mechanical design for the two devices combined into one. (See the article on the south-pointing chariot).",
				"after": "Besides clockwork, hydraulic-powered armillary spheres, odometers, and mechanical compass vehicles, there were other impressive devices of mechanical engineering found during the Song dynasty. Although literary references for mechanical revolving repositories and book cases of Buddhist temples trace back to at least 823 during the Tang dynasty,[27] they came to prominence during the Song dynasty.[27] The invention of the revolving book case is considered to have happened earlier, and is credited to the layman Fu Xi in 544.[28] Revolving bookcases were popularized in Buddhist monasteries during the Song dynasty under the reign of Emperor Taizu, who ordered the mass printing of the Buddhist Tripiṭaka scriptures.[28] Furthermore, the oldest surviving rotating book case dates to the Song period (12th century), found at the Longxing Monastery of Zhengding, Hebei province.[27][29] However, there were nine prominently known revolving repositories during the Song period, and one of them was even featured in an illustration of Li Jie's book Yingzao Fashi ('Treatise on Architectural Methods') of 1103.[27][30] The rotating repository of 1119 in Kaifu Temple near Changsha had five wheels which all turned together,[31] and the revolving repository at Nanchan Temple of Suzhou featured a brake system of some sort (sinologists are still uncertain how this operated, since the earliest known curve brake bands appear in the time of Leonardo da Vinci in Europe).[31] A later Muslim traveler Shah Rukh (son of the Turco-Mongol warlord Timur) came to Ming dynasty China in 1420 during the reign of the Yongle Emperor, and described a revolving repository in Ganzhou of Gansu province that he called a 'kiosque':",
			"color": "dim|0.4471 gray|0.4471 dim|0.4471 grey|0.4471 gray|0.23153 grey|0.23153 dark|0.093108 gray|0.093108 dark|0.093108 grey|0.093108 black|0.079139 dark|0.052308 slate|0.052308 gray|0.052308 silver|0.02932 light|0.014415 gray|0.014415 light|0.014415 grey|0.014415 gainsboro|0.0094037  "
		}
	}
}
