{
	"add": {
		"doc": {
			"id": "181f76beb3933d834d0927a4a4d7429a4aca4934381a78957f5e7a296d658167",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Beaver_Creek_Fire_2013_Idaho_1.jpg/220px-Beaver_Creek_Fire_2013_Idaho_1.jpg",
			"previous": [],
				"after": "Sawtooth National Forest has an active Fire Management Program which recognizes that forest fires are a natural part of the ecosystem, but this was not always the case. The 1987 forest plan did not recognize fire as an ecosystem process or as a tool for ecosystem management; this was rectified in the 2012 forest plan.[16]:II-13 Previous firefighting efforts, which emphasized quickly extinguishing all fires, caused dead and dying trees to accumulate well in excess of the level found when fires are allowed to burn out naturally. Historically speaking, fires became more common in parts of the SNRA after the development of lodgepole pine forests, which occurred prior to 1450 AD.[67] Between 1989 and 1998 there were on average 50 fires per year, with 58 percent of them caused by lightning.[16]:II-13 The Smoky Mountains of Idaho were named from the frequent forest fires, and in 2007 the Castle Rock Fire burned 48,000 acres (19,000 ha) of the Smoky Mountains near Ketchum.[68] [69] In 2005 the Valley Road Fire burned 40,800 acres (16,500 ha) in the White Cloud Mountains after being ignited from embers that came from a trash barrel which were blown out on a windy day.[70] In August 2013 the Beaver Creek Fire and the Kelley Fire were both ignited by lightning and burned 111,490 acres (45,120 ha) and 17,346 acres (7,020 ha), respectively, of the Fairfield and Ketchum ranger districts.[71][72] Another lightning-caused fire, the McCan Fire, burned 23,389 acres (9,465 ha) of the Fairfield Ranger District and other lands north of Fairfield in 2013.[73] Both natural and prescribed fires are used as a tool to maintain desired vegetation and fuel levels. While the forest's fire plan operates within historical fire regimes, locally fire is actively suppressed to protect human life, investments, and resources.[16]:III-41",
			"color": "dark|0.53186 slate|0.53186 gray|0.53186 black|0.19222 dim|0.096124 gray|0.096124 dim|0.096124 grey|0.096124 cadet|0.055154 blue|0.055154 slate|0.042619 gray|0.042619 light|0.034086 slate|0.034086 gray|0.034086 gray|0.029857 grey|0.029857 coral|0.0089038  "
		}
	}
}
