{
	"add": {
		"doc": {
			"id": "183dcdd484bbf72d6295ae9379a065007a5066a3504c32d31c9b2fb7f47fe097",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Sydney_International_Terminal_Landside.JPG/220px-Sydney_International_Terminal_Landside.JPG",
			"previous": [],
				"after": "Terminal 1 was opened on 3 May 1970, replacing the old Overseas Passenger Terminal (which was located where Terminal 3 stands now) and has been greatly expanded since then. Today it is known as the International Terminal, located in the airport's north western sector. It has 25 gates (thirteen in concourse B numbered 8–37, and twelve in concourse C numbered 50–63) served by aerobridges. There are also a number of remote bays, though these are rarely used. It can accommodate the Airbus A380 with flights to and from Singapore on Singapore Airlines; Dallas/Fort Worth, London via Dubai, Los Angeles and Hong Kong (in Summer and Chinese New Year) on Qantas; Dubai and Auckland on Emirates; and Guangzhou (in Summer) on China Southern Airlines. The terminal building is split into three levels, one each for arrivals, departures and airline offices. The departure level has 20 rows of check-in desks each with 10 single desks making a total of 200 check-in desks. The terminal also has an observation deck located on the rooftop. The terminal hosts eight airline lounges: Two for Qantas, and one each for Etihad Airways, Air New Zealand, Singapore Airlines, Emirates, American Express and SkyTeam. The terminal underwent a major $500 million redevelopment that was completed in 2010, by which the shopping complex was expanded, outbound customs operations were centralised and the floor space of the terminal increased to 254,000 square metres (2,730,000 sq ft).[28]",
			"color": "black|0.25479 dark|0.20271 gray|0.20271 dark|0.20271 grey|0.20271 light|0.16318 slate|0.16318 gray|0.16318 gray|0.15953 grey|0.15953 dim|0.088966 gray|0.088966 dim|0.088966 grey|0.088966 slate|0.037382 gray|0.037382 tan|0.017533 sienna|0.0065667  "
		}
	}
}
