{
	"add": {
		"doc": {
			"id": "1841581d66d451f008854bb68956eeb3212819fc2c083e9b4471031e1b2fa552",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Mao-4armjunction-schematic.png/220px-Mao-4armjunction-schematic.png",
			"previous": [
				"",
				"The conceptual foundation for DNA nanotechnology was first laid out by Nadrian Seeman in the early 1980s, and the field began to attract widespread interest in the mid-2000s. This use of nucleic acids is enabled by their strict base pairing rules, which cause only portions of strands with complementary base sequences to bind together to form strong, rigid double helix structures. This allows for the rational design of base sequences that will selectively assemble to form complex target structures with precisely controlled nanoscale features. A number of assembly methods are used to make these structures, including tile-based structures that assemble from smaller structures, folding structures using the DNA origami method, and dynamically reconfigurable structures using strand displacement techniques. While the field's name specifically references DNA, the same principles have been used with other types of nucleic acids as well, leading to the occasional use of the alternative name nucleic acid nanotechnology."
			],
				"after": "Nanotechnology is often defined as the study of materials and devices with features on a scale below 100 nanometers. DNA nanotechnology, specifically, is an example of bottom-up molecular self-assembly, in which molecular components spontaneously organize into stable structures; the particular form of these structures is induced by the physical and chemical properties of the components selected by the designers.[4] In DNA nanotechnology, the component materials are strands of nucleic acids such as DNA; these strands are often synthetic and are almost always used outside the context of a living cell. DNA is well-suited to nanoscale construction because the binding between two nucleic acid strands depends on simple base pairing rules which are well understood, and form the specific nanoscale structure of the nucleic acid double helix. These qualities make the assembly of nucleic acid structures easy to control through nucleic acid design. This property is absent in other materials used in nanotechnology, including proteins, for which protein design is very difficult, and nanoparticles, which lack the capability for specific assembly on their own.[5]",
			"color": "white|0.086862 smoke|0.086862 snow|0.085166 ghost|0.08514 white|0.08514 alice|0.085137 blue|0.085137 sea|0.084853 shell|0.084853 white|0.084749 mint|0.08371 cream|0.08371 floral|0.083218 white|0.083218 azure|0.082924 lavender|0.080062 blush|0.080062 dark|0.021657 gray|0.021657 dark|0.021657 grey|0.021657 gray|0.020215 grey|0.020215 dim|0.019358 gray|0.019358 dim|0.019358 grey|0.019358 silver|0.015586 light|0.011996 gray|0.011996 light|0.011996 grey|0.011996 gainsboro|0.010474 blue|0.0088398 light|0.0082546 sea|0.0082546 green|0.0082546 black|0.0072515 dark|0.00675 cyan|0.00675 ivory|0.0049857 light|0.0046393 pink|0.0046393 pink|0.0045348 linen|0.0034211  "
		}
	}
}
