{
	"add": {
		"doc": {
			"id": "18434fc5a2dcae7435b9675b09b75d496d04611260ff311dcb21fe05af91a40a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Takeda_Shingen.jpg/180px-Takeda_Shingen.jpg",
			"previous": [
				"Other examples of the evolution in the Bushidō literature of the 13th to 16th centuries included the Japanese:",
				"Compiled over the course of three centuries, beginning in the 1180s, the Heike Monogatari depicts a highly fictionalized and idealized story of a struggle between two warrior clans, the Minamoto and Taira, at the end of the 12th century—a conflict known as the Genpei War. Clearly depicted throughout the Heike Monogatari is the ideal of the cultivated warrior. The warriors in the Heike Monogatari served as models for the educated warriors of later generations, although the ideals depicted by them were assumed to be beyond reach. Nevertheless, during the early modern era, these ideals were vigorously pursued in the upper echelons of warrior society and recommended as the proper form of the Japanese man of arms."
			],
				"after": "The sayings of Sengoku-period retainers and warlords such as Kato Kiyomasa and Nabeshima Naoshige were generally recorded or passed down to posterity around the turn of the 16th century when Japan had entered a period of relative peace. In a handbook addressed to \"all samurai, regardless of rank\", Kato states:",
			"color": "peach|0.19882 puff|0.19882 black|0.15594 bisque|0.1303 antique|0.071691 white|0.071691 blanched|0.069248 almond|0.069248 papaya|0.04694 whip|0.04694 dim|0.04579 gray|0.04579 dim|0.04579 grey|0.04579 misty|0.030421 rose|0.030421 tan|0.028053 wheat|0.023279 burly|0.022466 wood|0.022466 gray|0.017197 grey|0.017197 dark|0.015695 salmon|0.015695 firebrick|0.0097127 navajo|0.0089682 white|0.0089682 dark|0.0084048 gray|0.0084048 dark|0.0084048 grey|0.0084048 moccasin|0.0076017 light|0.0071211 salmon|0.0071211 linen|0.0071203 sandy|0.0068667 brown|0.0068667 old|0.0062084 lace|0.0062084 brown|0.0058494 corn|0.0056526 silk|0.0056526  "
		}
	}
}
