{
	"add": {
		"doc": {
			"id": "184d5463dc7d58c5cd9c08054711dbe69fe8769d6f71bbdbaa70effd3e46b394",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Bay_of_Fundy_Low_Tide.jpg/200px-Bay_of_Fundy_Low_Tide.jpg",
				"previous": "Water runoff often collects over watersheds flowing into rivers. A mathematical model used to simulate river or stream flow and calculate water quality parameters is a hydrological transport model. Some water is diverted to irrigation for agriculture. Rivers and seas offer opportunity for travel and commerce. Through erosion, runoff shapes the environment creating river valleys and deltas which provide rich soil and level ground for the establishment of population centers. A flood occurs when an area of land, usually low-lying, is covered with water. It is when a river overflows its banks or flood comes from the sea. A drought is an extended period of months or years when a region notes a deficiency in its water supply. This occurs when a region receives consistently below average precipitation.",
				"after": "Some runoff water is trapped for periods of time, for example in lakes. At high altitude, during winter, and in the far north and south, snow collects in ice caps, snow pack and glaciers. Water also infiltrates the ground and goes into aquifers. This groundwater later flows back to the surface in springs, or more spectacularly in hot springs and geysers. Groundwater is also extracted artificially in wells. This water storage is important, since clean, fresh water is essential to human and other land-based life. In many parts of the world, it is in short supply.",
			"color": "black|0.43943 rosy|0.19804 brown|0.19804 silver|0.078829 dark|0.077829 gray|0.077829 dark|0.077829 grey|0.077829 light|0.039168 gray|0.039168 light|0.039168 grey|0.039168 gray|0.025783 grey|0.025783 misty|0.020543 rose|0.020543 gainsboro|0.019811 antique|0.015843 white|0.015843 dim|0.013642 gray|0.013642 dim|0.013642 grey|0.013642 peach|0.013313 puff|0.013313  "
		}
	}
}
