{
	"add": {
		"doc": {
			"id": "18634552942cf1b5d46d59b9fa915b7be9c74e11f784b5554054256f8ba03d18",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/2012s_Motto_Beast_March_Back.JPG/220px-2012s_Motto_Beast_March_Back.JPG",
				"previous": "All cadets reside on campus for their entire four years in one of the seven barracks buildings. Most cadets are housed with one roommate, but some rooms are designed for three cadets. Cadets are grouped into companies identified by alpha-numeric codes. All companies live together in the same barracks area.[159] The academy has the cadets change companies after their freshman or sophomore years. This process is known as scrambling, and the method of scrambling has changed several times in recent years.[160][161] All 4,000 cadets dine together at breakfast and lunch in the Washington Hall during the weekdays.[162] The cadet fitness center, Arvin Cadet Physical Development Center (usually just called \"Arvin\" by cadets and faculty), which was rebuilt in 2004, houses extensive physical fitness facilities and equipment for student use.[163]",
				"after": "Each class of cadets elects representatives to serve as class president and fill several administrative positions.[164] They also elect a ring and crest committee, which designs the class's crest, the emblem that signifies their class and it is embossed upon their class rings. Each class crest is required to contain the initials USMA and their class motto.[165] The class motto is proposed by the class during cadet basic training and voted on by the class prior to the beginning of their freshman academic year. Class mottos typically have verbiage that rhymes or is phonetically similar with their class year.[165]",
			"color": "dark|0.3657 gray|0.3657 dark|0.3657 grey|0.3657 gray|0.25726 grey|0.25726 black|0.1705 dim|0.052663 gray|0.052663 dim|0.052663 grey|0.052663 silver|0.04304 dark|0.01594 olive|0.01594 green|0.01594 light|0.010653 gray|0.010653 light|0.010653 grey|0.010653 gold|0.0064691 gainsboro|0.0058844 slate|0.0055293 gray|0.0055293 tan|0.0054851  "
		}
	}
}
