{
	"add": {
		"doc": {
			"id": "187212c29b137f18fb448a8aaa6da7ac1093b1bb770c88a37853c2b8dd1ea51b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Peter_Bondra_scoring.jpg/220px-Peter_Bondra_scoring.jpg",
				"previous": "Offensive tactics include improving a team's position on the ice by advancing the puck out of one's zone towards the opponent's zone, progressively by gaining lines, first your own blue line, then the red line and finally the opponent's blue line. NHL rules instated for the 2006 season redefined the offside rule to make the two-line pass legal; a player may pass the puck from behind his own blue line, past both that blue line and the centre red line, to a player on the near side of the opponents' blue line. Offensive tactics are designed ultimately to score a goal by taking a shot. When a player purposely directs the puck towards the opponent's goal, he or she is said to \"shoot\" the puck.",
				"after": "A deflection is a shot that redirects a shot or a pass towards the goal from another player, by allowing the puck to strike the stick and carom towards the goal. A one-timer is a shot struck directly off a pass, without receiving the pass and shooting in two separate actions. Headmanning the puck, also known as breaking out, is the tactic of rapidly passing to the player farthest down the ice. Loafing, also known as cherry-picking, is when a player, usually a forward, skates behind an attacking team, instead of playing defense, in an attempt to create an easy scoring chance.",
			"color": "light|0.13393 gray|0.13393 light|0.13393 grey|0.13393 gainsboro|0.11425 silver|0.10732 dark|0.079152 gray|0.079152 dark|0.079152 grey|0.079152 gray|0.04102 grey|0.04102 white|0.040946 smoke|0.040946 linen|0.039031 dim|0.034202 gray|0.034202 dim|0.034202 grey|0.034202 sea|0.032303 shell|0.032303 black|0.027067 light|0.026911 steel|0.026911 blue|0.026911 snow|0.025821 lavender|0.023597 blush|0.023597 ghost|0.023294 white|0.023294 floral|0.022857 white|0.022857 alice|0.021575 blue|0.021575 white|0.018831 mint|0.018014 cream|0.018014 lavender|0.016404 thistle|0.015755 light|0.012723 slate|0.012723 gray|0.012723 slate|0.012603 gray|0.012603 old|0.01176 lace|0.01176 golden|0.011541 rod|0.011541 antique|0.011346 white|0.011346 dark|0.0093546 golden|0.0093546 rod|0.0093546 azure|0.0091503 misty|0.0070753 rose|0.0070753 tan|0.0063699  "
		}
	}
}
