{
	"add": {
		"doc": {
			"id": "188519defa068f51ea30c333f9d83a94ba9be2cccceeed385902727e76656471",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/7/76/Varaha_Cave_Bas_relief.jpg/220px-Varaha_Cave_Bas_relief.jpg",
			"previous": [],
				"after": "Although the Pallava records can be traced from the 2nd century AD, they did not rise to prominence as an imperial dynasty until the 6th century.[43] They transformed the institution of the kingship into an imperial one, and sought to bring vast amounts of territory under their direct rule. The Pallavas were followers of Hinduism, though for a short while one of their kings embraced Jainism and later converted to Hinduism.[44] The Bhakti movement in Hinduism was founded at this time, and rose along with the growing influence of Jainism and Buddhism.[45] The Pallavas pioneered the building of large, ornate temples in stone which formed the basis of the Dravidian temple architecture. They came into conflict with the Kannada Chalukyas of Badami. During this period, The great Badami Chalukya King Pulakesi II extended the Chalukya Empire up to the northern extents of the Pallava kingdom and defeated the Pallavas in several battles.[46] Pallava Narasimhavarman however reversed this victory in 642 by attacking and occupying Badami temporarily.[47] However a later Chalukya King Vikramaditya II took revenge by repeated invasions of the territory of Tondaimandalam and his subsequent victories over Pallava Nandivarman II and the annexation of Kanchipuram.[48] The Pallava dynasty was overthrown in the 9th century by the imperial Kannada Rashtrakutas who ruled from Gulbarga. King Krishna III, the last great Rashtrakuta king consolidated the empire so that it stretched from the Narmada River to Kaveri River and included the northern Tamil country (Tondaimandalam) while levying tribute on the king of Ceylon.[49]",
			"color": "tan|0.20836 antique|0.065837 white|0.065837 peach|0.064886 puff|0.064886 bisque|0.062458 blanched|0.051701 almond|0.051701 papaya|0.050925 whip|0.050925 old|0.042536 lace|0.042536 floral|0.041559 white|0.041559 linen|0.040482 sea|0.038684 shell|0.038684 ivory|0.034514 beige|0.03221 corn|0.031897 silk|0.031897 snow|0.02562 mint|0.025245 cream|0.025245 white|0.025011 smoke|0.025011 wheat|0.023547 white|0.0234 azure|0.016362 light|0.014422 yellow|0.014422 ghost|0.01377 white|0.01377 burly|0.011848 wood|0.011848 alice|0.011164 blue|0.011164 honeydew|0.01029 lavender|0.0070793 blush|0.0070793  "
		}
	}
}
