{
	"add": {
		"doc": {
			"id": "188c52a40ffdd1a722d3121e60fd488b79ff68efe035113fe5eea5ff7d91f147",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Thespis_-_Illustrated_London_News_Jan_6_1872.png/220px-Thespis_-_Illustrated_London_News_Jan_6_1872.png",
				"previous": "In 1871, John Hollingshead commissioned Gilbert to work with Sullivan on a holiday piece for Christmas, Thespis, or The Gods Grown Old, at the Gaiety Theatre. Thespis outran five of its nine competitors for the 1871 holiday season, and its run was extended beyond the length of a normal run at the Gaiety,[51] However, nothing more came of it at that point, and Gilbert and Sullivan went their separate ways. Gilbert worked again with Clay on Happy Arcadia (1872), and with Alfred Cellier on Topsyturveydom (1874), as well as writing several farces, operetta libretti, extravaganzas, fairy comedies, adaptations from novels, translations from the French, and the dramas described above. Also in 1874, he published his last contribution for Fun magazine (\"Rosencrantz and Guildenstern\"), after a gap of three years, then resigned due to disapproval of the new owner's other publishing interests.[52]",
				"after": "It would be nearly four years after Thespis was produced before the two men worked together again. In 1868, Gilbert had published a short comedic sketch libretto in Fun magazine entitled \"Trial by Jury: An Operetta\". In 1873, Gilbert arranged with the theatrical manager and composer, Carl Rosa, to expand the piece into a one-act libretto. Rosa's wife was to sing the role of the plaintiff. However, Rosa's wife died in childbirth in 1874. Later in 1874 Gilbert offered the libretto to Richard D'Oyly Carte, but Carte could not use the piece at that time. By early 1875, Carte was managing the Royalty Theatre, and he needed a short opera to be played as an afterpiece to Offenbach's La Périchole. He contacted Gilbert, asked about the piece, and suggested Sullivan to set the work. Sullivan was enthusiastic, and Trial by Jury was composed in a matter of weeks. The little piece was a runaway hit, outlasting the run of La Périchole and being revived at another theatre.[53]",
			"color": " "
		}
	}
}
