{
	"add": {
		"doc": {
			"id": "18912dcebd25058bea2e11cd7ed577a2ec70270eba03eadf1758ef4ff50b567f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/ChiefOshkosh.jpg/170px-ChiefOshkosh.jpg",
				"previous": "The Menominee Indian Tribe may have lived in the states of Wisconsin and Michigan for the last 10,000 years.[1][Note 1] Their traditional territory was about 10 million acres (4 million hectares). They first acknowledged that they were under the protection of the United States in 1817 in the Treaty of St. Louis.[3] In 1825 and 1827, the treaties of Prairie du Chien[4] and Butte des Morts[5] answered boundary questions. None of the early treaties addressed hunting and fishing rights.[6] In 1831, the tribe entered into the Treaty of Washington,[7] which ceded about 3,000,000 acres (1,200,000 ha) to the federal government. These two treaties reserved hunting and fishing rights for the tribe on the ceded land until the President of the United States ordered the land surveyed and sold to settlers. In 1836, the tribe entered into the Treaty of Cedar Point,[8] under which 4,184,000 acres (1,693,000 ha) were ceded to the federal government. The treaty did not mention hunting or fishing rights.",
				"after": "In 1848, the tribe entered into another treaty with the United States, the Treaty of Lake Poygan,[9] which ceded the tribe's remaining approximately 4,000,000 acres (1,600,000 ha) in exchange for 600,000 acres (240,000 ha) west of the Mississippi River in present-day Minnesota. This treaty was contingent on the tribe examining the land proposed for them and accepting it as suitable. In 1850, Chief Oshkosh led a delegation to the Crow Wing area and determined that the land was not suitable for the tribe, mainly because the proposed reservation was located between two warring tribes, the Dakota[Note 2] and Ojibwe.[Note 3] Oshkosh then pressed for a new treaty, stating that he \"preferred a home somewhere in Wisconsin, for the poorest region in Wisconsin was better than the Crow Wing.\"[12]",
			"color": "black|0.91086 sienna|0.015182 saddle|0.0061953 brown|0.0061953  "
		}
	}
}
