{
	"add": {
		"doc": {
			"id": "1896cf7489ab7e94ba8e402d19cf695648f6c22ad2c83a6510e610222820bb8e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/MCC_member.jpg/175px-MCC_member.jpg",
				"previous": "MCC has long had a deep involvement in coaching the game of cricket. As of 2013[update] the club's head coach Mark Alleyne heads an extensive operation involving the running of an indoor-cricket school and a team of coaches in England and around the world. MCC is famous for its coaching manual, the MCC Cricket Coaching Book, which is often regarded[by whom?] as the bible of cricket coaching.",
			"after": [
				"MCC has 18,000 full members and 6000 associate members.[7] Members have special rights to use the Pavilion and other stands at Lord's for all matches played at the ground.",
				"In order to join the waiting list of candidates for membership one must obtain the vote (of which each full member has one a year) of three members, and the additional sponsorship of a person on the List of MCC Sponsors (which consists of members of all MCC Sub-Committees; MCC Committee; MCC Out-Match Representatives; and the Current, Past, and Designate President). As the demand for membership always outstrips supply each year (i.e., there being just over 400 places in 2005), there continues to be a substantial waiting list for Full Ordinary Membership, currently around 27 years.[8] This waiting list has increased in recent years (up from 18 years in 2006), and is beginning to reflect the 30-year wait which was the norm in the 1920s. There are, however, ways to lessen the time it takes to become a full member: one may qualify as a Playing Member, or Out-Match Member (although this carries none of the privileges of membership, apart from being able to play for the club)."
			],
			"color": "maroon|0.14051 dark|0.11721 red|0.11721 firebrick|0.059303 peru|0.05851 dark|0.042531 gray|0.042531 dark|0.042531 grey|0.042531 light|0.042067 gray|0.042067 light|0.042067 grey|0.042067 silver|0.04098 lavender|0.03818 sandy|0.0376 brown|0.0376 gainsboro|0.035023 golden|0.03038 rod|0.03038 black|0.028407 saddle|0.025704 brown|0.025704 gray|0.022965 grey|0.022965 dark|0.022962 golden|0.022962 rod|0.022962 sienna|0.02097 dim|0.020427 gray|0.020427 dim|0.020427 grey|0.020427 light|0.019313 steel|0.019313 blue|0.019313 rosy|0.017399 brown|0.017399 white|0.012366 smoke|0.012366 chocolate|0.011876 linen|0.010042 alice|0.010031 blue|0.010031 sea|0.0088565 shell|0.0088565 ghost|0.0087503 white|0.0087503 snow|0.0080444 floral|0.0075293 white|0.0075293 misty|0.0072808 rose|0.0072808 mint|0.0068829 cream|0.0068829 white|0.0068422 antique|0.0066928 white|0.0066928 azure|0.0056189 old|0.0055211 lace|0.0055211  "
		}
	}
}
