{
	"add": {
		"doc": {
			"id": "18bfeacf5d437f07e6b5ee9668775fb3730ca3586aa4fdd2533f9d5d762ebcb5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Chroogomphus_vinicolor_116581.jpg/160px-Chroogomphus_vinicolor_116581.jpg",
			"previous": [],
				"after": "Suillus pungens is an ectomycorrhizal (EM) basidiomycete that forms symbiotic relationships almost exclusively with Monterey pine (Pinus radiata) and bishop pine (Pinus muricata); some collections have been made under knobcone pine (Pinus attenuata)[1] and ponderosa pine (Pinus ponderosa), but only within the range of Monterey pine.[5] All these trees have small scattered natural ranges largely restricted to California.[11] An EM symbiosis is a mutualistic relationship between an EM fungus and the root tip of a compatible EM plant. The fruit bodies of Suillus pungens grow solitarily, scattered or in groups in humus. They are often found growing near fruit bodies of Chroogomphus vinicolor[7] and Helvella lacunosa.[5] Suillus pungens is often the most abundant Suillus in the San Francisco Bay Area. The type collection was made on the campus of San Francisco State University in San Francisco, where it occurs in abundance during the fall and winter seasons. Although it occurs most frequently in the autumn and winter,[5] it is one of the few species of Suillus that continue to fruit sporadically throughout the year,[1] especially in wet weather.[5] It has also been identified in the southeastern Sierra Nevada[12] and on Santa Cruz Island.[13]",
			"color": "black|0.28489 dim|0.10847 gray|0.10847 dim|0.10847 grey|0.10847 gray|0.10168 grey|0.10168 dark|0.086749 gray|0.086749 dark|0.086749 grey|0.086749 silver|0.05151 tan|0.038663 rosy|0.03807 brown|0.03807 light|0.028634 gray|0.028634 light|0.028634 grey|0.028634 sandy|0.025353 brown|0.025353 peru|0.02172 burly|0.020899 wood|0.020899 gainsboro|0.02069 dark|0.015046 salmon|0.015046 sienna|0.011571 dark|0.010584 olive|0.010584 green|0.010584 honeydew|0.0094527  "
		}
	}
}
