{
	"add": {
		"doc": {
			"id": "18c687d6eb2002ee41e32770855efe0da61c6ec976cee17f4060594b6aee5e2d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/A-26A_609SOS_near_NKP_1969.jpg/220px-A-26A_609SOS_near_NKP_1969.jpg",
				"previous": "On 11 February 1964, two pilots from the 1st Air Commando Wing stationed at Hurlburt Field, Fla., died in the crash of a B-26 on Range 52 at Eglin AFB when it lost a wing during pull-out from a strafing pass. The aircraft was participating in a demonstration of the Special Air Warfare Center's counter insurgency capabilities and had completed a strafing run when the accident occurred. SAWC had presented the demonstration on an average of twice each month for the previous 21 months.[32] B-26 aircraft used by USAF Commandos in Vietnam were grounded 8 April 1964, following an official investigation into the 11 February accident. B-26 aircraft in use by the Vietnamese Air Force were also grounded in accordance with the U.S. ruling.[33]",
				"after": "In response to this, the On Mark Engineering Company of Van Nuys, California was selected by the Air Force to extensively upgrade the Invader for a counterinsurgency role. The first production flight of the B-26K was on 30 May 1964 at the Van Nuys Airport. On Mark converted 40 Invaders to the new B-26K Counter-Invader standard, which included upgraded engines, propellers, and brakes, re-manufactured wings, and wing tip fuel tanks, for use by the 609th Special Operations Squadron. In May 1966, the B-26K was re-designated A-26A for political reasons (Thailand did not allow the U.S. to have bombers stationed in country at the time, so the Invaders were redesignated with an \"A\", for attack aircraft) and deployed in Thailand to help disrupt supplies moving along the Ho Chi Minh trail. Two of these aircraft were further modified with a Forward Looking Infrared (FLIR system) under project Lonesome Tiger, as a part of Operation Shed Light.[34]",
			"color": "burly|0.2987 wood|0.2987 dark|0.23317 khaki|0.23317 tan|0.182 pale|0.061384 golden|0.061384 rod|0.061384 khaki|0.056387 black|0.045761 navajo|0.032042 white|0.032042 wheat|0.023843 moccasin|0.019458  "
		}
	}
}
