{
	"add": {
		"doc": {
			"id": "18d1c90bbca01e6e51ba30e0e3232d031951e6a19796a92d0e25baaf4b003f8d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Alfonso-V-el-Magnanimo.jpg/170px-Alfonso-V-el-Magnanimo.jpg",
				"previous": "During the five years which followed the First Siege of Krujë, Albania was allowed some respite as the new sultan set out to conquer the last vestiges of the Byzantine Empire, but a battle did take place in 1452 when another Ottoman army sent to Albania was defeated again by Skanderbeg's forces. During this period, skirmishes between Skanderbeg and the Dukagjin family, which had been dragging on for years, were put to an end by a reconciliatory intervention of the Pope, and in 1454, a peace treaty between them was finally reached.[88]",
				"after": "In November 1453, Skanderbeg informed King Alfonso that he had conquered some territories and a castle, and Alfonso replied some days later that soon Ramon d'Ortafà would return to continue the war against the Ottomans and promised more troops and supplies. In the beginning of 1454, Skanderbeg and the Venetians[89] informed King Alfonso and the Pope about a possible Ottoman invasion and asked for help. The Pope sent 3,000 ducats while Alfonso sent 500 infantry and a certain amount of money,[90] along with a message directed to Skanderbeg.[91] Meanwhile, the Venetian Senate was resenting Skanderbeg's alliance with the Kingdom of Naples, an old enemy of the Republic. Frequently they delayed their tributes to Skanderbeg and this was long a matter of dispute between the parties, with Skanderbeg threatening war on Venice at least three times during the 1448–1458 period, and Venice conceding in a conciliatory tone.[92]",
			"color": "black|0.79155 sienna|0.021923 peru|0.015611 burly|0.012925 wood|0.012925 dim|0.010707 gray|0.010707 dim|0.010707 grey|0.010707 sandy|0.0093441 brown|0.0093441 light|0.0091607 gray|0.0091607 light|0.0091607 grey|0.0091607 saddle|0.0087601 brown|0.0087601 silver|0.0087077 tan|0.0084906 gainsboro|0.007435 dark|0.0070755 gray|0.0070755 dark|0.0070755 grey|0.0070755 dark|0.0066038 olive|0.0066038 green|0.0066038 chocolate|0.0063342  "
		}
	}
}
