{
	"add": {
		"doc": {
			"id": "18eeb30d35bd7ff4549dda1a7eac21aeb5959c395b33a6690db0dfc5657a40d5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Link_trains_at_University_St_station_in_2010.jpg/220px-Link_trains_at_University_St_station_in_2010.jpg",
				"previous": "King County Metro provides frequent stop bus service within the city and surrounding county, as well as a South Lake Union Streetcar line between the South Lake Union neighborhood and Westlake Center in downtown.[227] Seattle is one of the few cities in North America whose bus fleet includes electric trolleybuses. Sound Transit currently provides an express bus service within the metropolitan area; two Sounder commuter rail lines between the suburbs and downtown; its Central Link light rail line, which opened in 2009, between downtown and Sea-Tac Airport gives the city its first rapid transit line that has intermediate stops within the city limits. Washington State Ferries, which manages the largest network of ferries in the United States and third largest in the world, connects Seattle to Bainbridge and Vashon Islands in Puget Sound and to Bremerton and Southworth on the Kitsap Peninsula.[228]",
				"after": "According to the 2007 American Community Survey, 18.6% of Seattle residents used one of the three public transit systems that serve the city, giving it the highest transit ridership of all major cities without heavy or light rail prior to the completion of Sound Transit's Central Link line.[229] The city has also been described by Bert Sperling as the fourth most walkable U.S. city and by Walk Score as the sixth most walkable of the fifty largest U.S. cities.[230][231]",
			"color": "black|0.25398 tan|0.082676 burly|0.044693 wood|0.044693 sea|0.034747 shell|0.034747 dim|0.034557 gray|0.034557 dim|0.034557 grey|0.034557 floral|0.033092 white|0.033092 dark|0.032212 gray|0.032212 dark|0.032212 grey|0.032212 silver|0.032105 white|0.031432 smoke|0.031432 gray|0.029936 grey|0.029936 snow|0.029704 mint|0.028134 cream|0.028134 white|0.027755 linen|0.026377 light|0.026038 gray|0.026038 light|0.026038 grey|0.026038 wheat|0.02151 ghost|0.020721 white|0.020721 gainsboro|0.019763 ivory|0.019716 azure|0.018879 old|0.017676 lace|0.017676 antique|0.016805 white|0.016805 alice|0.01571 blue|0.01571 lavender|0.013988 blush|0.013988  "
		}
	}
}
