{
	"add": {
		"doc": {
			"id": "18f5c9f0d68f13e6de23f80abde489a45dc150c5e99a703d2838ef316f4f6b99",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Giraffe-Drinking-Nairobi.JPG/220px-Giraffe-Drinking-Nairobi.JPG",
				"previous": "In mammals, the left recurrent laryngeal nerve is longer than the right; in the giraffe it is over 30 cm (12 in) longer. These nerves are longer in the giraffe than in any other living animal;[51] the left nerve is over 2 m (6 ft 7 in) long.[52] Each nerve cell in this path begins in the brainstem and passes down the neck along the vagus nerve, then branches off into the recurrent laryngeal nerve which passes back up the neck to the larynx. Thus, these nerve cells have a length of nearly 5 m (16 ft) in the largest giraffes.[51] The structure of a giraffe's brain resembles that of domestic cattle.[32]:31 The shape of the skeleton gives the giraffe a small lung volume relative to its mass.[53] Its long neck gives it a large amount of dead space, in spite of its narrow windpipe. These factors increase the resistance to airflow. Nevertheless, the animal can still supply enough oxygen to its tissues.[53]",
				"after": "The circulatory system of the giraffe has several adaptations for its great height. Its heart, which can weigh more than 11 kg (25 lb) and measures about 60 cm (2 ft) long, must generate approximately double the blood pressure required for a human to maintain blood flow to the brain. As such, the wall of the heart can be as thick as 7.5 cm (3.0 in).[15] Giraffes have unusually high heart rates for their size, at 150 beats per minute.[31]:76 In the upper neck, a rete mirabile prevents excess blood flow to the brain when the giraffe lowers its head.[17] The jugular veins also contain several (most commonly seven) valves to prevent blood flowing back into the head from the inferior vena cava and right atrium while the head is lowered.[54] Conversely, the blood vessels in the lower legs are under great pressure (because of the weight of fluid pressing down on them). To solve this problem, the skin of the lower legs is thick and tight; preventing too much blood from pouring into them.[17]",
			"color": "dark|0.10323 salmon|0.10323 light|0.092484 steel|0.092484 blue|0.092484 black|0.08704 light|0.084013 slate|0.084013 gray|0.084013 dim|0.069487 gray|0.069487 dim|0.069487 grey|0.069487 dark|0.069216 gray|0.069216 dark|0.069216 grey|0.069216 silver|0.062529 slate|0.058692 gray|0.058692 light|0.046068 gray|0.046068 light|0.046068 grey|0.046068 tan|0.042344 burly|0.040722 wood|0.040722 gray|0.040184 grey|0.040184 gainsboro|0.033618 lavender|0.022096 white|0.014024 smoke|0.014024 alice|0.013079 blue|0.013079 peach|0.012987 puff|0.012987 ghost|0.012591 white|0.012591 snow|0.010519  "
		}
	}
}
