{
	"add": {
		"doc": {
			"id": "1901f64dacbec5455f7dc69774aa23191eb7291f2694d367d73b2fc56151f8b4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/AggieMuster.jpg/220px-AggieMuster.jpg",
				"previous": "A visible designation tradition among senior undergraduates and alumni is the wearing of the Aggie Ring, whose design has been relatively unchanged since its introduction in 1894.[150] Students may order a ring after completing 90 credit hours of coursework, including at least 45 hours at A&M, or after graduation. Graduate students may receive a ring after 75% of their graduate coursework is completed or after the acceptance of their dissertation or thesis.[151] Though unsanctioned by the University, many students \"dunk\" their newly acquired Aggie Rings into a pitcher of beer and quickly chug the entire pitcher to \"earn\" the ring. Some students dunk their rings in alternative substances, including ice cream or nonalcoholic beverages.[152]",
				"after": "In keeping with the idea that all enrolled students and alumni comprise a family, Aggies have created two traditions to honor members of the Aggie family who have died. Aggie Muster is held annually on the anniversary of the Battle of San Jacinto, April 21, to honor the death during the previous year of any enrolled student or alumni. Over 300 Musters are held around the world, with the largest taking place at Reed Arena on the Texas A&M University campus.[153] All Muster ceremonies feature the Roll Call for the Absent. As the names of the deceased Aggies are called, a family member or friend answers \"Here\" and lights a candle, to symbolize that although their loved one is not present in body, his or her spirit will shine forever.[154][155] The event received worldwide attention during World War II, when 25 Aggies \"mustered\" during the battle for the island of Corregidor.[156]",
			"color": "tan|0.35365 black|0.18861 burly|0.050145 wood|0.050145 peach|0.032297 puff|0.032297 wheat|0.029985 bisque|0.029542 blanched|0.02644 almond|0.02644 antique|0.025357 white|0.025357 papaya|0.024606 whip|0.024606 beige|0.022419 corn|0.021738 silk|0.021738  "
		}
	}
}
