{
	"add": {
		"doc": {
			"id": "19026c27ff937970ba3e15804ea67c9e668e0f1fbc5f9eea4e6619f447a99957",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Kepler-solar-system-1.png/220px-Kepler-solar-system-1.png",
			"previous": [],
				"after": "Johannes Kepler's first major astronomical work, Mysterium Cosmographicum (The Cosmographic Mystery), was the first published defense of the Copernican system. Kepler claimed to have had an epiphany on July 19, 1595, while teaching in Graz, demonstrating the periodic conjunction of Saturn and Jupiter in the zodiac: he realized that regular polygons bound one inscribed and one circumscribed circle at definite ratios, which, he reasoned, might be the geometrical basis of the Universe. After failing to find a unique arrangement of polygons that fit known astronomical observations (even with extra planets added to the system), Kepler began experimenting with 3-dimensional polyhedra. He found that each of the five Platonic solids could be uniquely inscribed and circumscribed by spherical orbs; nesting these solids, each encased in a sphere, within one another would produce six layers, corresponding to the six known planets—Mercury, Venus, Earth, Mars, Jupiter, and Saturn. By ordering the solids correctly—octahedron, icosahedron, dodecahedron, tetrahedron, cube—Kepler found that the spheres could be placed at intervals corresponding (within the accuracy limits of available astronomical observations) to the relative sizes of each planet’s path, assuming the planets circle the Sun. Kepler also found a formula relating the size of each planet’s orb to the length of its orbital period: from inner to outer planets, the ratio of increase in orbital period is twice the difference in orb radius. However, Kepler later rejected this formula, because it was not precise enough.[13]",
			"color": "dim|0.18786 gray|0.18786 dim|0.18786 grey|0.18786 gray|0.18628 grey|0.18628 black|0.16751 dark|0.12914 gray|0.12914 dark|0.12914 grey|0.12914 silver|0.05659 light|0.038333 gray|0.038333 light|0.038333 grey|0.038333 gainsboro|0.030908 white|0.024678 smoke|0.024678 sea|0.021226 shell|0.021226 snow|0.020143 alice|0.020125 blue|0.020125 ghost|0.01982 white|0.01982 floral|0.019293 white|0.019293 mint|0.018526 cream|0.018526 white|0.018147 azure|0.016362 linen|0.011236 ivory|0.010973  "
		}
	}
}
