{
	"add": {
		"doc": {
			"id": "19036d3ddf4e6725f7c45937cdbf01a1611d32b5ecb9a654123a1ce931cc2673",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Merville-Bombardement.jpg/220px-Merville-Bombardement.jpg",
				"previous": "The 3rd Parachute Brigade, commanded by Brigadier James Hill, began to land at the same time as the main elements of 5th Parachute Brigade, and suffered from the same problems as the other Brigade. All of its constituent units being scattered throughout the area due to poor navigation and heavy cloud cover and several of the drop-zones either not being marked correctly or marked correctly but incorrectly positioned due to pathfinder error.[44] One of the first units to land was 9th Parachute Battalion, which had been given a number of objectives; not only was it to destroy the Merville artillery battery, it was also tasked with holding the village of Le Plein, blocking roads leading to that village, and capturing a German naval headquarters at Sallenelles near the River Orne.[44] However, the battalion scattered throughout the area, with a number of paratroopers landing a considerable distance from the designated DZ; Lieutenant-Colonel Terence Otway, the commander of the battalion, landed with the rest of his stick 400 yards (370 m) away from the drop-zone in a farmhouse being used as a command post by a German battalion, and after a brief fire-fight and helping other scattered paratroopers, only arrived at the drop-zone at 01:30.[45] By 02:35 only 110 paratroopers had arrived at the drop-zone, and only a single machine-gun and a small number of Bangalore torpedoes had been recovered. This was a significant set-back for the battalion, as the plan to assault the artillery battery relied on having the entire battalion present with a number of sappers, as well as a large quantity of heavy equipment.[46] Under strict orders that the battery was to be destroyed no later than 05:30, Otway felt that he could no longer wait for any more reinforcements and set off for the battery at 02:50, the under-strength battalion having been increased to around 150 paratroopers after a small group of stragglers arrived at 02:45.[47]",
				"after": "The battalion arrived at the battery at 04:00, where it linked up with the survivors of the pathfinder group who had been hit by the RAF raid against the battery, and began readying for an assault on the battery whilst the pathfinders marked out areas for the Bangalore torpedoes to be placed.[46] The battalion was divided into four assault groups, one for each of the casemates of the battery, and was ready by 04:30, when the gliders carrying the Royal Engineer sappers arrived over the battery. Only two arrived, one having been forced to land immediately after take-off because of mechanical complications, and both were engaged by anti-aircraft and machine-gun fire, causing one to land fifty yards short of the battery and setting the second alight which landed 400 yards (370 m) away.[48] Otway launched the assault as soon as the first glider overshot the battery, ordering the explosives to be detonated to form two paths through the outer perimeter, through which the paratroopers attacked. The defenders were alerted by the explosions and opened fire, inflicting heavy casualties; only four men assigned to assault Casemate Four survived long enough to reach the casemate, which they disabled by firing into apertures and throwing grenades into air vents. The other casemates were cleared with fragmentations and white phosphorus grenades as the crews had neglected to lock the doors leading into the battery.[49] A number of prisoners were taken by the paratroopers, and explosives were then readied to disable the artillery pieces inside the battery. However, it was discovered that the pieces were not modern 150 mm calibre weapons, but were instead Czechoslovakian First World War-era 100 mm field howitzers.[50] The paratroopers did the best with the explosives they had, using Gammon grenades to disable one gun and jamming shells into the muzzles of other guns, but the job was less than thorough, as at least one gun went back into action when the Germans later reoccupied the battery.[49] Having completed the assault, the paratroopers gathered the German prisoners and their wounded and retreated, having no wish to remain by the battery; the battalion possessed no radio, and if no signal were received by the light cruiser HMS Arethusa by 05:30 it would begin shelling the battery as a back-up plan. The paratroopers had achieved their primary objective, but at a heavy cost, with fifty paratroopers dead and twenty-five wounded, a casualty rate of exactly fifty percent. The battalion then attacked Le Plein, securing the village by expelling the platoon-sized enemy garrison.[51] The survivors retired to a planned rendezvous point at 05:30, the battalion too understrength to achieve its other secondary objectives.[49]",
			"color": " "
		}
	}
}
