{
	"add": {
		"doc": {
			"id": "1912a002b70d5eeb0e8288074856c4e793013fd265756fdb07f94539fe3ae04d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Sturnus_vulgaris_-California-8.jpg/220px-Sturnus_vulgaris_-California-8.jpg",
				"previous": "The common starling is 19–23 cm (7.5–9.1 in) long, with a wingspan of 31–44 cm (12–17 in) and a weight of 58–101 g (2.0–3.6 oz).[14] Among standard measurements, the wing chord is 11.8 to 13.8 cm (4.6 to 5.4 in), the tail is 5.8 to 6.8 cm (2.3 to 2.7 in), the culmen is 2.5 to 3.2 cm (0.98 to 1.26 in) and the tarsus is 2.7 to 3.2 cm (1.1 to 1.3 in).[14] The plumage is iridescent black, glossed purple or green, and spangled with white, especially in winter. The underparts of adult male common starlings are less spotted than those of adult females at a given time of year. The throat feathers of males are long and loose and are used in display while those of females are smaller and more pointed. The legs are stout and pinkish- or greyish-red. The bill is narrow and conical with a sharp tip; in the winter it is brownish-black but in summer, females have lemon yellow beaks while males have yellow bills with blue-grey bases. Moulting occurs once a year, in late summer after the breeding season has finished; the fresh feathers are prominently tipped white (breast feathers) or buff (wing and back feathers), which gives the bird a speckled appearance. The reduction in the spotting in the breeding season is achieved through the white feather tips largely wearing off. Juveniles are grey-brown and by their first winter resemble adults though often retaining some brown juvenile feathering especially on the head.[12][19] They can usually be sexed by the colour of the irises, rich brown in males, mouse-brown or grey in females. Estimating the contrast between an iris and the central always-dark pupil is 97% accurate in determining sex, rising to 98% if the length of the throat feathers is also considered.[20][21] The common starling is mid-sized by both starling standards and passerine standards. It is readily distinguished from other mid-sized passerines, such as thrushes, icterids or small corvids, by its relatively short tail, sharp, blade-like bill, round-bellied shape and strong, sizeable (and rufous-coloured) legs. In flight, its strongly pointed wings and dark colouration are distinctive, while on the ground its strange, somewhat waddling gait is also characteristic. The colouring and build usually distinguish this bird from other starlings, although the closely related spotless starling may be physically distinguished by the lack of iridescent spots in adult breeding plumage.[22]",
				"after": "Like most terrestrial starlings the common starling moves by walking or running, rather than hopping. Their flight is quite strong and direct; their triangular-shaped wings beat very rapidly and periodically the birds glide for a short way without losing much height before resuming powered flight. When in a flock the birds take off almost simultaneously, wheel and turn in unison, form a compact mass or trail off into a wispy stream, bunch up again and land in a coordinated fashion.[19] Common starling on migration can fly at 60–80 km/hr (37–50 mi/hr) and cover a total distance up to 1,000–1,500 km (600–900 mi).[23]",
			"color": "black|0.39774 gray|0.14041 grey|0.14041 dim|0.13668 gray|0.13668 dim|0.13668 grey|0.13668 tan|0.099026 dark|0.047654 gray|0.047654 dark|0.047654 grey|0.047654 bisque|0.022314 antique|0.02208 white|0.02208 silver|0.015136  "
		}
	}
}
