{
	"add": {
		"doc": {
			"id": "19157fb0dfc1aa82b060215dd3bd17e51c7a9ed0bf15f3d4a8a7867802e903cf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Constitution_of_the_United_States%2C_page_1.jpg/170px-Constitution_of_the_United_States%2C_page_1.jpg",
				"previous": "From the late 15th century to the 17th century, Western culture began to spread to other parts of the world through explorers and missionaries during the Age of Discovery, and by imperialists from the 17th century to the early 20th century. During the Great Divergence, a term coined by Samuel Huntington[23] the Western world overcame pre-modern growth constraints and emerged during the 19th century as the most powerful and wealthy world civilization of the time, eclipsing Qing China, Mughal India, Tokugawa Japan, and the Ottoman Empire. The process was accompanied and reinforced by the Age of Discovery and continued into the modern period. Scholars have proposed a wide variety of theories to explain why the Great Divergence happened, including lack of government intervention, geography, colonialism, and customary traditions.",
				"after": "Coming into the modern era, the historical understanding of the East-West contrast – as the opposition of Christendom to its geographical neighbors – began to weaken. As religion became less important, and Europeans came into increasing contact with far away peoples, the old concept of Western culture began a slow evolution towards what it is today. The Age of Discovery faded into the Age of Enlightenment of the 18th century, during which cultural and intellectual forces in Western Europe emphasized reason, analysis, and individualism rather than traditional lines of authority. It challenged the authority of institutions that were deeply rooted in society, such as the Catholic Church; there was much talk of ways to reform society with toleration, science and skepticism.",
			"color": "antique|0.27427 white|0.27427 papaya|0.13513 whip|0.13513 blanched|0.12315 almond|0.12315 beige|0.089442 bisque|0.070471 old|0.068281 lace|0.068281 linen|0.066132 corn|0.063246 silk|0.063246 tan|0.026224 wheat|0.017981 floral|0.017601 white|0.017601 sea|0.017069 shell|0.017069 ivory|0.013692 light|0.0086639 yellow|0.0086639  "
		}
	}
}
