{
	"add": {
		"doc": {
			"id": "19206bd00d608fa6b7f43cfb5b2991581021d68e98db60feffb6271c5c1a5f87",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Airport_Tel_Aviv_Bengurion.jpg/220px-Airport_Tel_Aviv_Bengurion.jpg",
			"previous": [],
				"after": "Prior to the opening of Terminal 3, Terminal 1 was the main terminal building at Ben Gurion Airport. At that time, the departures check-in area was located on the ground floor. From there, passengers proceeded upstairs to the main departures hall, which contained passport control, duty-free shops, VIP lounges, one synagogue and boarding gates. At the gates, travelers would be required to descend a flight of stairs to return to the ground floor where waiting shuttle buses transported them to airplanes on the tarmac. The arrivals hall with passport control, luggage carousels, duty-free pick-up and customs was located at the south end of the building. The shuttle-buses transferred passengers and crews to and from the terminal to airplanes which were parked on the tarmac over 500 m (1,600 ft) away. After Terminal 3 opened, Terminal 1 was closed except for domestic flights to the airport in Eilat and government flights such as special immigrant flights from North America and Africa. Chartered flights organised by Nefesh B'Nefesh carrying immigrants from North America and England use this terminal for their landing ceremonies several times a year.[12]",
			"color": "tan|0.40586 gray|0.088118 grey|0.088118 dark|0.085052 gray|0.085052 dark|0.085052 grey|0.085052 black|0.083515 dim|0.081577 gray|0.081577 dim|0.081577 grey|0.081577 dark|0.037408 slate|0.037408 gray|0.037408 silver|0.034457 light|0.032433 gray|0.032433 light|0.032433 grey|0.032433 gainsboro|0.028094 antique|0.024721 white|0.024721 linen|0.013207 slate|0.0080782 gray|0.0080782 cadet|0.0076088 blue|0.0076088 light|0.0070183 slate|0.0070183 gray|0.0070183 old|0.0062058 lace|0.0062058 sea|0.0052968 shell|0.0052968 white|0.0052254 smoke|0.0052254  "
		}
	}
}
