{
	"add": {
		"doc": {
			"id": "1935930a5594743b18f6e805c5242e487a10d22d0bc4ffa1bdcb4848ece107c1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Trinity_Episcopal_Cathedral_%28Phoenix%29.png/220px-Trinity_Episcopal_Cathedral_%28Phoenix%29.png",
				"previous": "Phoenix's population has historically been predominantly white. From 1890 to 1970, over 90% of the citizens were white. In recent years, this percentage has dropped, reaching 65% In 2010. However, a significant portion of this decrease can be attributed to new guidelines put out by the U.S. Census Bureau in 1980, when a question regarding Hispanic origin was added to the census questionnaire. This has led to an increasing tendency for some groups to no longer self-identify as white, and instead categorize themselves as \"other races\".[101] 20.6% of the population of the city was foreign born in 2010. Of the 1,342,803 residents over 5 years of age, 63.5% spoke only English, 30.6% spoke Spanish at home, 2.5% spoke another Indo-European language, 2.1% spoke Asian or Islander languages, with the remaining 1.4% speaking other languages. About 15.7% of non-English speakers reported speaking English less than \"very well\". The largest national ancestries reported were Mexican (35.9%), German (15.3%), Irish (10.3%), English (9.4%), Black (6.5%), Italian (4.5%), French (2.7%), Polish (2.5%), American Indian (2.2%), and Scottish (2.0%).[103]",
				"after": "In 2010, according to the Association of Religion Data Archives, which conducts religious census each ten years, 39% of those polled in Maricopa county considered themselves a member of a religious group. Of those who expressed a religious affiliation, the area's religious composition was reported as 35% Catholic, 22% to Evangelical Protestant denominations, 16% Latter-Day Saints (LDS), 14% to nondenominational congregations, 7% to Mainline Protestant denominations, and 2% Hindu. The remaining 4% belong to other religions, such as Buddhism, and Judaism. While there was an overall increase in the number of religious adherents over the decade of 103,000, that did not keep pace with the overall population increase in the country during the same period, which increased by almost three-quarters of million individuals, resulting in the percentage drop. The largest aggregate increases were in the LDS (a 58% increase) and Evangelical Protestant churches (14% increase), while all other categories actually saw their numbers drop slightly, or remain static. Overall, the Catholic Church had an 8% drop, while Mainline Protestant groups saw a 28% decline.[104]",
			"color": "dim|0.45382 gray|0.45382 dim|0.45382 grey|0.45382 gray|0.27784 grey|0.27784 dark|0.074045 gray|0.074045 dark|0.074045 grey|0.074045 tan|0.073856 black|0.02267 silver|0.0145 wheat|0.0084421 peach|0.0078443 puff|0.0078443 bisque|0.0072087  "
		}
	}
}
