{
	"add": {
		"doc": {
			"id": "193f59963643c739e9b0d561318cfbf79c12939c79ea7860d0375e44b8413b26",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Johannesburg_region_map_with_names.jpg/170px-Johannesburg_region_map_with_names.jpg",
			"previous": [],
				"after": "Johannesburg's suburbs are the product of urban sprawl and are regionalised into north, south, east and west, and they generally have different personalities. While the Central Business District and the immediate surrounding areas were formerly desirable living areas, the spatial accommodation of the suburbs has tended to see a flight from the city and immediate surrounds. The inner city buildings have been let out to the lower income groups and illegal immigrants and as a result abandoned buildings and crime have become a feature of inner city life. The immediate city suburbs include Yeoville, a hot spot for black nightlife despite its otherwise poor reputation. The suburbs to the south of the city are mainly blue collar neighbourhoods and situated closer to some townships. The suburbs to the west have in recent years floundered with the decline of the mining industry but have in some cases experienced some revival with properties being bought up by the native African middle class. The biggest sprawl lies to the east and north. The eastern suburbs are relatively prosperous and close to various industrial zones. The northern suburbs have been the recipient of most of the flight from the inner city and some residential areas have become commercialised particularly around the area of Sandton, stretching north towards Midrand, a half way point between Johannesburg and the capital Pretoria.",
			"color": "silver|0.17881 dark|0.13235 gray|0.13235 dark|0.13235 grey|0.13235 burly|0.11919 wood|0.11919 light|0.09613 slate|0.09613 gray|0.09613 light|0.093648 blue|0.093648 slate|0.089019 gray|0.089019 powder|0.060281 blue|0.060281 tan|0.056969 light|0.039155 steel|0.039155 blue|0.039155 light|0.02876 gray|0.02876 light|0.02876 grey|0.02876 gainsboro|0.015013 gray|0.011885 grey|0.011885 thistle|0.0068082 dim|0.0059505 gray|0.0059505 dim|0.0059505 grey|0.0059505 wheat|0.0049474  "
		}
	}
}
