{
	"add": {
		"doc": {
			"id": "1940c982c46afac7d7c37d326d5c29db73c67fa1ebb73fef5a57eea7e4159507",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Kalmar_museum_Kronan_violin.JPG/220px-Kalmar_museum_Kronan_violin.JPG",
				"previous": "More than 30,000 artifacts from Kronan have been salvaged and cataloged, ranging from bronze cannons of up to four tonnes to small eggshell fragments.[63] There have been several discoveries of considerable importance, and some of unique historical and archaeological value. One of the first finds was a small table cabinet with nine drawers containing navigational instruments, pipe-cleaning tools, cutlery and writing utensils, which most likely belonged to one of the officers.[64] As a flagship, Kronan carried a large amount of cash in the form of silver coins. Besides wages for the crew, a war chest was required for large, unforeseen expenses. In 1982, a collection of 255 gold coins was found, most of them ducats. The origin of the individual coins varied considerably, with locations such as Cairo, Reval (modern-day Tallinn), and Seville. Another 46 ducats were found in 2000.[65] The coin collection is probably the largest gold treasure ever encountered on Swedish soil, though it was not enough to cover large expenses, which has led to the assumption that they were the personal property of Admiral Lorentz Creutz.[66] In 1989, more than 900 silver coins were found in the remains of the orlop, at the time the largest silver coin collection ever discovered in Sweden. In 2005, a much larger cache of nearly 6,200 coins was uncovered and in 2006 yet another with more than 7,000 coins.[67] The silver treasure of 2005 consisted almost entirely of 4 öre-coins minted in 1675, which represented over 1% of the entire production of 4 öre-coins of that year.[68]",
				"after": "Several musical instruments have been found, including a trumpet, three violins and a viola da gamba, all expensive objects that probably belonged to either the officers or the trumpeters. One of the trumpeters on board was a member of the admiral's musical ensemble and it is assumed that one of the particularly fine, German-made instruments belonged to him. Another remnant of the officers' personal stores was discovered in 1997, consisting of a woven basket filled with tobacco and expensive imported foodstuffs and spices, including ginger, plums, grapes and cinnamon quills.[69]",
			"color": "dim|0.27984 gray|0.27984 dim|0.27984 grey|0.27984 maroon|0.19408 gray|0.12599 grey|0.12599 brown|0.10735 black|0.087831 rosy|0.038638 brown|0.038638 tan|0.026622 burly|0.025568 wood|0.025568 dark|0.023452 red|0.023452  "
		}
	}
}
