{
	"add": {
		"doc": {
			"id": "19627f824253fc62c9078eb0d53d53c4f1179ca41da258af319d748fe7bb33f7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/AGT1500_engine_and_M1_tank.JPEG/220px-AGT1500_engine_and_M1_tank.JPEG",
			"previous": [],
				"after": "The German Army's development division, the Heereswaffenamt (Army Ordnance Board), studied a number of gas turbine engines for use in tanks starting in mid-1944. The first gas turbine engines used for armoured fighting vehicle GT 101 was installed in the Panther tank.[38] The second use of a gas turbine in an armoured fighting vehicle was in 1954 when a unit, PU2979, specifically developed for tanks by C. A. Parsons & Co., was installed and trialled in a British Conqueror tank.[39] The Stridsvagn 103 was developed in the 1950s and was the first mass-produced main battle tank to use a turbine engine. Since then, gas turbine engines have been used as APUs in some tanks and as main powerplants in Soviet/Russian T-80s and U.S. M1 Abrams tanks, among others. They are lighter and smaller than diesels at the same sustained power output but the models installed to date are less fuel efficient than the equivalent diesel, especially at idle, requiring more fuel to achieve the same combat range. Successive models of M1 have addressed this problem with battery packs or secondary generators to power the tank's systems while stationary, saving fuel by reducing the need to idle the main turbine. T-80s can mount three large external fuel drums to extend their range. Russia has stopped production of the T-80 in favour of the diesel-powered T-90 (based on the T-72), while Ukraine has developed the diesel-powered T-80UD and T-84 with nearly the power of the gas-turbine tank. The French Leclerc MBT's diesel powerplant features the \"Hyperbar\" hybrid supercharging system, where the engine's turbocharger is completely replaced with a small gas turbine which also works as an assisted diesel exhaust turbocharger, enabling engine RPM-independent boost level control and a higher peak boost pressure to be reached (than with ordinary turbochargers). This system allows a smaller displacement and lighter engine to be used as the tank's powerplant and effectively removes turbo lag. This special gas turbine/turbocharger can also work independently from the main engine as an ordinary APU.",
			"color": "black|0.55335 dim|0.067343 gray|0.067343 dim|0.067343 grey|0.067343 dark|0.052051 gray|0.052051 dark|0.052051 grey|0.052051 gray|0.041663 grey|0.041663 pale|0.041012 golden|0.041012 rod|0.041012 dark|0.040453 khaki|0.040453 silver|0.027294 tan|0.027179 khaki|0.022851 light|0.016184 gray|0.016184 light|0.016184 grey|0.016184 lavender|0.012193 gainsboro|0.0091395 burly|0.0090055 wood|0.0090055  "
		}
	}
}
