{
	"add": {
		"doc": {
			"id": "1967b5f02ab5e6895abb85f127b8af9061d57ad1df47c81dc715095ccbfd3ed0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/NASA_salutes_Reagans.jpg/220px-NASA_salutes_Reagans.jpg",
				"previous": "Columbia spent 610 days in the Orbiter Processing Facility (OPF), another 35 days in the Vehicle Assembly Building (VAB), and 105 days on Pad 39A before finally lifting off.[2] Columbia was successfully launched on April 12, 1981, the 20th anniversary of the first human spaceflight (Vostok 1), and returned on April 14, 1981, after orbiting the Earth 36 times, landing on the dry lakebed runway at Edwards Air Force Base in California. Columbia then undertook three further research missions to test its technical characteristics and performance. Its first operational mission, with a four-man crew, was STS-5, which launched on November 11, 1982. At this point Columbia was joined by Challenger, which flew the next three shuttle missions, while Columbia underwent modifications for the first Spacelab mission.",
				"after": "In 1983, Columbia, under the command of John Young on what was his sixth spaceflight, undertook its second operational mission (STS-9), in which the Spacelab science laboratory and a six-person crew was carried, including the first non-American astronaut on a space shuttle, Ulf Merbold. After the flight, Columbia spent 18 months at the Rockwell Palmdale facility beginning in January 1984, undergoing modifications that removed the Orbiter Flight Test hardware and bringing it up to similar specifications as that of its sister orbiters. At that time the shuttle fleet was expanded to include Discovery and Atlantis.",
			"color": "black|0.067809 white|0.063264 smoke|0.063264 sea|0.061486 shell|0.061486 snow|0.059623 floral|0.057591 white|0.057591 white|0.056172 mint|0.05525 cream|0.05525 linen|0.054751 saddle|0.046515 brown|0.046515 dim|0.044174 gray|0.044174 dim|0.044174 grey|0.044174 azure|0.042946 ghost|0.04003 white|0.04003 ivory|0.039257 dark|0.034711 gray|0.034711 dark|0.034711 grey|0.034711 gainsboro|0.029555 old|0.029367 lace|0.029367 tan|0.028077 light|0.028074 gray|0.028074 light|0.028074 grey|0.028074 silver|0.024483 alice|0.02419 blue|0.02419 gray|0.020251 grey|0.020251 lavender|0.014531 blush|0.014531 antique|0.0091642 white|0.0091642 rosy|0.0083372 brown|0.0083372 burly|0.0072097 wood|0.0072097 lavender|0.0056026 honeydew|0.0053668  "
		}
	}
}
