{
	"add": {
		"doc": {
			"id": "1978c7be8af3f3df74eabab06ab1a8d2d1bb1cf5572a9284b5f155ed0aa51a49",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/3/3d/Wessex_2_Silchester_pic.jpg/220px-Wessex_2_Silchester_pic.jpg",
				"previous": "After making a beachhead and consolidating their position, the invaders next fought the Britons at the Battle of Natanleod, the location of which has been placed at Netley Marsh, \"508. This year Cerdic and Cynric killed a British king named Natanleod, and five thousand men with him. After that the land was known as Natanleag up to Cerdicesford\". Cerdicesford has been placed at various locations in southern Hampshire, including Chandler's Ford. The historian Albany Major places the site at Charford at the crossing of the river Avon, close to the border with Wiltshire.",
				"after": "The Chronicle appears to repeat itself with the annals for 514 and 519: \"514. The West-Saxons came to Briton with 3 ships to a place called Cerdicesora and in the same year they fought the Britons and put them to flight\", and \"519. Cerdic and Cynric received the West-Saxon kingdom, and the same year they fought with the Britons, in a place now called Cerdicesford. The royal line of Wessex ruled from that day\". Despite the repetition, there may have been multiple landings along the part of the coast known to the Saxons as Cerdic's Shore. It is likely that both Winchester and Silchester would have fallen to the West Saxons between the years 508 and 514, but this transition is only suggested by the absence of these important towns in the later annals of the British scribes. A later thrust by the West Saxons up the Avon towards Old Sarum in 519 appears to have been checked by the Britons at Charford. Albany Major, in Early Wars of Wessex, makes the case that the borders of Hampshire probably matched those of the first West Saxon kingdom established by Cerdic and his son. Evidence of this comes from the border between Hampshire and Berkshire, which generally follows the line of the Roman road that ran east and west through Silchester, but is deflected in the north in a rough semicircle, in such a way as to include the whole district around the town. Major argues that the capture of Silchester, of which no record has survived, was not the work of Angles but of the West Saxons, who probably struck north from Winchester, possibly acting in concert with a separate force making its way up the Thames Valley towards Reading. Silchester was desolated after its fall and it is most improbable that any regard would have been paid to its side of the border had the fixing of the county boundary been made at a later period.[5]",
			"color": "dark|0.10194 gray|0.10194 dark|0.10194 grey|0.10194 gray|0.075104 grey|0.075104 silver|0.074772 light|0.055835 gray|0.055835 light|0.055835 grey|0.055835 sea|0.05544 shell|0.05544 linen|0.053742 floral|0.048891 white|0.048891 dim|0.048871 gray|0.048871 dim|0.048871 grey|0.048871 white|0.047073 smoke|0.047073 gainsboro|0.047013 misty|0.04458 rose|0.04458 snow|0.043032 old|0.041223 lace|0.041223 black|0.037226 lavender|0.036357 blush|0.036357 antique|0.031153 white|0.031153 white|0.029121 ivory|0.02573 mint|0.022447 cream|0.022447 ghost|0.017976 white|0.017976 azure|0.010848 alice|0.010308 blue|0.010308 papaya|0.0071423 whip|0.0071423 rosy|0.0071372 brown|0.0071372 beige|0.0061289 corn|0.0034695 silk|0.0034695 honeydew|0.0030224  "
		}
	}
}
