{
	"add": {
		"doc": {
			"id": "197a8a98411e62ebb54be392a8c30f9b0ab507c9ae12b94d8d5f73fa1bc844b9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Shakira_-_2011_Singapore_Grand_Prix_%286%29.jpg/220px-Shakira_-_2011_Singapore_Grand_Prix_%286%29.jpg",
			"previous": [],
				"after": "The Sun Comes Out World Tour (also known as the Sale el Sol World Tour) was the fifth concert tour by Colombian singer-songwriter Shakira, launched in support of her eighth and ninth studio albums, She Wolf (2009) and Sale El Sol (2010). The tour was divided into three legs: a North American leg, a European leg, and a Latin American leg. The North American leg visited cities such as New York, Houston, and Los Angeles. The European leg appeared in cities such as Lyon, London, and Paris. It also visited countries such as Croatia, Russia, Spain and Switzerland. The Latin American leg of the tour was a part of the Pop Festival, which was heralded as an initiative to bring international music stars to Latin America. Venues at countries like Argentina, Brazil, Colombia and Mexico were decided for the Latin American leg to visit. The setlist of the tour was composed of songs taken primarily from Shakira's ninth studio album Sale el Sol and She Wolf (2009); the other songs were taken from her previous studio efforts. The stage was shaped like the letter \"T\" to enable maximum amount of viewers to see Shakira easily. A large screen was set behind the stage, on which various visuals, designed by entertainment branding agency Loyalkaspar, were projected. For the performances, Shakira mainly wore a mesh gold crop top coupled with skin-tight leather pants. Other attires Shakira wore during the concert shows included a hooded pink gown, a flamenco-skirt, and a feathery blue dress.",
			"color": "black|0.6783 saddle|0.038501 brown|0.038501 dim|0.036947 gray|0.036947 dim|0.036947 grey|0.036947 sienna|0.030091 gray|0.028147 grey|0.028147 dark|0.015551 gray|0.015551 dark|0.015551 grey|0.015551 peru|0.0099576 dark|0.00966 salmon|0.00966 slate|0.009627 gray|0.009627 orange|0.0096203 sandy|0.0095212 brown|0.0095212 chocolate|0.0077756 light|0.0071409 slate|0.0071409 gray|0.0071409 pale|0.0062126 golden|0.0062126 rod|0.0062126 silver|0.0061855 rosy|0.0058714 brown|0.0058714  "
		}
	}
}
