{
	"add": {
		"doc": {
			"id": "19888f052c6b0557a21c346866ac90942ea14538bd91237562a00fd39fb0a6a3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Fokker.70.taxi.arp.750pix.jpg/220px-Fokker.70.taxi.arp.750pix.jpg",
				"previous": "The earliest example of a true short-range jet is the BAe 146, produced by BAE Systems. However, like the de Havilland Canada Dash 7 before it, the BAe 146 was tuned to a very specific market, city-center to city-center service where low noise and excellent takeoff performance were paramount. Like the Dash 7, the market niche for this design proved to be fairly small, and its four engines meant it had higher maintenance costs than twin-engine designs. Unlike the Dash 7 example BAe did not respond by producing a twin-engine design that filled the same range requirements but offering lower operational costs. The BAe 146 was produced in three differently sized versions, being the BAe 146-100, the BAe 146-200 and the largest example, the BAe 146-300. The aircraft would later be manufactured as the Avro Regional Jet (ARJ).",
				"after": "This was addressed by Bombardier's twin-engine Canadair Regional Jet, which became a best-seller. The CRJ's range is enough to fill mid-range routes as well, routes previously served by larger aircraft such as the Boeing 737 and DC-9. These aircraft were originally intended to be used for direct airport-to-airport flights, bypassing hubs, and led to industry-wide discussions about the decline of the hub-and-spoke model. Although not as economical as the turboprop, by flying directly to and from smaller airports, they reduced the need for low-cost regional airliners. And although turboprops are quiet to outside observers, propwash makes them very noisy inside.[1] Passengers greatly preferred jets, both for real and perception reasons.",
			"color": "gray|0.24053 grey|0.24053 dark|0.23246 olive|0.23246 green|0.23246 dim|0.14016 gray|0.14016 dim|0.14016 grey|0.14016 dark|0.11612 gray|0.11612 dark|0.11612 grey|0.11612 light|0.038997 sky|0.038997 blue|0.038997 silver|0.037006 black|0.03557 light|0.023718 gray|0.023718 light|0.023718 grey|0.023718 gainsboro|0.018282 sky|0.011041 blue|0.011041 white|0.0087331 smoke|0.0087331 sea|0.0066086 shell|0.0066086 snow|0.0065711 steel|0.0064877 blue|0.0064877 white|0.0060161 light|0.0059906 steel|0.0059906 blue|0.0059906 ghost|0.0059049 white|0.0059049 floral|0.0056792 white|0.0056792 alice|0.005391 blue|0.005391 mint|0.0053627 cream|0.0053627 linen|0.0050059 lavender|0.0047016 blush|0.0047016  "
		}
	}
}
