{
	"add": {
		"doc": {
			"id": "1992b4260f7eb7ed06b5da50ae1d9f2885b73a7a34bfd87b11e39667548e1d61",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Allosaurus_attacks_Stegosaurus.jpg/170px-Allosaurus_attacks_Stegosaurus.jpg",
			"previous": [],
				"after": "Paleontologists accept Allosaurus as an active predator of large animals. There is dramatic evidence for allosaur attacks on Stegosaurus, including an Allosaurus tail vertebra with a partially healed puncture wound that fits a Stegosaurus tail spike, and a Stegosaurus neck plate with a U-shaped wound that correlates well with an Allosaurus snout.[92] Sauropods seem to be likely candidates as both live prey and as objects of scavenging, based on the presence of scrapings on sauropod bones fitting allosaur teeth well and the presence of shed allosaur teeth with sauropod bones.[93] However, as Gregory Paul noted in 1988, Allosaurus was probably not a predator of fully grown sauropods, unless it hunted in packs, as it had a modestly sized skull and relatively small teeth, and was greatly outweighed by contemporaneous sauropods.[10] Another possibility is that it preferred to hunt juveniles instead of fully grown adults.[6][68] Research in the 1990s and first decade of the 21st century may have found other solutions to this question. Robert T. Bakker, comparing Allosaurus to Cenozoic sabre-toothed carnivorous mammals, found similar adaptations, such as a reduction of jaw muscles and increase in neck muscles, and the ability to open the jaws extremely wide. Although Allosaurus did not have sabre teeth, Bakker suggested another mode of attack that would have used such neck and jaw adaptations: the short teeth in effect became small serrations on a saw-like cutting edge running the length of the upper jaw, which would have been driven into prey. This type of jaw would permit slashing attacks against much larger prey, with the goal of weakening the victim.[54]",
			"color": "dark|0.16914 gray|0.16914 dark|0.16914 grey|0.16914 tan|0.14527 silver|0.10793 black|0.10614 gray|0.0832 grey|0.0832 dim|0.055188 gray|0.055188 dim|0.055188 grey|0.055188 wheat|0.041836 burly|0.030486 wood|0.030486 light|0.027689 gray|0.027689 light|0.027689 grey|0.027689 bisque|0.022776 dark|0.021518 slate|0.021518 gray|0.021518 antique|0.019177 white|0.019177 peach|0.018022 puff|0.018022 blanched|0.016507 almond|0.016507  "
		}
	}
}
