{
	"add": {
		"doc": {
			"id": "19afc92232813e08dc1329e33515364be1bad22326ddfd3f0d45fcdad3e6b7dd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Speed_baths.jpg/220px-Speed_baths.jpg",
				"previous": "Bath may have been the site of the Battle of Badon (c. 500 AD), in which King Arthur is said to have defeated the Anglo-Saxons.[17] The city fell to the West Saxons in 577 after the Battle of Deorham;[18][18] the Anglo-Saxon poem The Ruin may describe the appearance of the Roman site about this time.[19] A monastery was founded at an early date – reputedly by Saint David, although more probably in 675 by Osric, King of the Hwicce,[20] perhaps using the walled area as its precinct.[21][22] Nennius, a 9th century historian, mentions a \"Hot Lake\" in the land of the Hwicce along the River Severn, and adds \"It is surrounded by a wall, made of brick and stone, and men may go there to bathe at any time, and every man can have the kind of bath he likes. If he wants, it will be a cold bath; and if he wants a hot bath, it will be hot\". Bede described hot baths in the geographical introduction to the Ecclesiastical History in terms very similar to those of Nennius.[23] King Offa of Mercia gained control of the monastery in 781 and rebuilt the church, which was dedicated to St. Peter.[24]",
				"after": "By the 9th century the old Roman street pattern was lost and Bath was a royal possession. King Alfred laid out the town afresh, leaving its south-eastern quadrant as the abbey precinct.[25] In the Burghal Hidage Bath is described as having walls of 1,375 yards (1,257 m) and was allocated 1000 men for defence.[26] During the reign of Edward the Elder coins were minted in Bath based on a design from the Winchester mint but with 'BAD' on the obverse relating to the Anglo-Saxon name for the town, Baðum, Baðan or Baðon, meaning \"at the baths,\"[27] and this was the source of the present name. Edgar of England was crowned king of England in Bath Abbey in 973.[28]",
			"color": "gray|0.12466 grey|0.12466 dark|0.12057 gray|0.12057 dark|0.12057 grey|0.12057 dim|0.10786 gray|0.10786 dim|0.10786 grey|0.10786 silver|0.07023 black|0.057103 light|0.047519 gray|0.047519 light|0.047519 grey|0.047519 gainsboro|0.034288 antique|0.034281 white|0.034281 linen|0.032848 misty|0.030056 rose|0.030056 slate|0.029171 gray|0.029171 light|0.02878 slate|0.02878 gray|0.02878 peru|0.026712 old|0.023834 lace|0.023834 sea|0.023451 shell|0.023451 rosy|0.022437 brown|0.022437 floral|0.019143 white|0.019143 sienna|0.016215 white|0.014389 smoke|0.014389 tan|0.014077 snow|0.013055 papaya|0.012515 whip|0.012515 lavender|0.011777 blush|0.011777 ivory|0.01143 saddle|0.010551 brown|0.010551 beige|0.0086803 white|0.0083926  "
		}
	}
}
