{
	"add": {
		"doc": {
			"id": "19b05ac6470d732c617b6d464bcdf2ecaddb2d78a1291088b62c42f355e49988",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/8th_Airlift_Squadron_C-17A_Globemaster_III_90-0535.jpg/220px-8th_Airlift_Squadron_C-17A_Globemaster_III_90-0535.jpg",
				"previous": "A January 1995 GAO report revealed that, over the original cost of $41.8 billion for 210 C17s, the 120 aircraft on order were costing $39.5 billion.[27] In March 1994, the U.S. Army decided it did not need the 60,000 lb (27,000 kg) Low Altitude Parachute Extraction System (LAPES) delivery with the C-17 and that the C-130's 42,000 lb (19,000 kg) capability was sufficient; C-17 testing was limited to this lower weight. Airflow issues prevented the C-17 from meeting airdrop requirements. A February 1997 GAO report revealed that a C-17 with a full payload could not land on 3,000 ft (910 m) wet runways; simulations suggested 5,000 ft (1,500 m) was required.[28] The YC-15 was transferred to AMARC to be made flightworthy again for further flight tests for the C-17 program in March 1997.[29] In 1995, most of the problems had been reportedly resolved.[30][31] The first C-17 squadron was declared operational by the USAF in January 1995.[32]",
				"after": "In 1996, DoD ordered another 80 aircraft for a total of 120.[33] In 1997 McDonnell Douglas merged with its former competitor, Boeing. In April 1999, Boeing proposed to cut the price of the C-17 if the Air Force bought 60 more,[34] and in August 2002, the order was increased to 180 aircraft.[35] In 2007, 190 C-17s were on order for the USAF.[36] On 6 February 2009, Boeing was awarded a $2.95 billion contract for 15 additional aircraft, increasing the total USAF C-17 fleet to 205 and extending production from August 2009 to August 2010.[37] On 6 April 2009, U.S. Secretary of Defense Robert Gates stated that there would be no more C-17s ordered beyond the 205 planned.[38] However, on 12 June 2009, the House Armed Services Air and Land Forces Subcommittee added a further 17 C-17s.[39]",
			"color": "black|0.73726 corn|0.21746 flower|0.21746 blue|0.21746 steel|0.028112 blue|0.028112  "
		}
	}
}
