{
	"add": {
		"doc": {
			"id": "19baa89b1722f8ae12ef1546eb7f889594f98d52276da11debdf99a31cd86763",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/German_losses_after_WWI.svg/220px-German_losses_after_WWI.svg.png",
			"previous": [],
				"after": "The treaty stripped Germany of 25,000 square miles (65,000 km2) of territory and 7,000,000 people. It also required Germany to give up the gains made via the Treaty of Brest-Litovsk and grant independence to the protectorates that had been established.[16] In Western Europe Germany was required to recognize Belgian sovereignty over Moresnet and cede control of the Eupen-Malmedy area. Within six months of the transfer, Belgium was required to conduct a plebiscite on whether the citizens of the region wanted to remain under Belgian sovereignty or return to German control, communicate the results to the League of Nations and abide by the League's decision.[43] To compensate for the destruction of French coal mines, Germany was to cede the output of the Saar coalmines to France and control of the Saar to the League of Nations for fifteen years; a plebiscite would then be held to decide sovereignty.[44] The treaty \"restored\" the provinces of Alsace-Lorraine to France by rescinding the treaties of Versailles and Frankfurt of 1871 as they pertained to this issue.[45] The sovereignty of Schleswig-Holstein was to be resolved by a plebiscite to be held at a future time (see Schleswig Plebiscites).[46]",
			"color": "light|0.12458 gray|0.12458 light|0.12458 grey|0.12458 gainsboro|0.12313 silver|0.12249 peach|0.098736 puff|0.098736 wheat|0.09815 navajo|0.09727 white|0.09727 moccasin|0.096873 bisque|0.095511 lemon|0.018016 chiffon|0.018016 light|0.017945 golden|0.017945 rod|0.017945 yellow|0.017945 dark|0.016595 gray|0.016595 dark|0.016595 grey|0.016595 light|0.01468 yellow|0.01468 gray|0.012938 grey|0.012938 tan|0.011137 dim|0.008762 gray|0.008762 dim|0.008762 grey|0.008762 crimson|0.0058501 burly|0.0052741 wood|0.0052741 black|0.0045515 red|0.0043089  "
		}
	}
}
