{
	"add": {
		"doc": {
			"id": "19c1c668dd10868955540accbbb3028f3144a43dcc757feee784cb9a34ccce98",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Hawker_Siddeley_HS_748_at_Cardiff_Airport.jpg/220px-Hawker_Siddeley_HS_748_at_Cardiff_Airport.jpg",
				"previous": "Dan-Air was the first British operator of the Boeing trijet, at the time the world's best-selling commercial jetliner. The first of three former Japan Airlines Boeing 727 100 series[36] was introduced on 13 April 1973[37] [38] The aircraft needed a full stall protection system, among other modifications, fitted to meet British requirements.[39][40]",
				"after": "Dan-Air's original eight Boeing 727-100s, which entered service between 1973 and 1978, differed from overseas-registered aircraft. Dan-Air's additional emergency doors each side of the rear fuselage as well as a stall-protection system known as a \"stick pusher\". The additional exits came from having an increased maximum seating capacity of 150. For certification, the British Civil Aviation Authority (CAA) requirement was that all passengers could leave within 90 seconds using only half the available exits. Stall protection had been introduced in the light of experience with the stalling characteristics of both civil and military British T-tailed jet aircraft[41] including the loss of a Hawker Siddeley Trident on a test flight over Norfolk when it entered a deep stall. This stall-protection system consisted of a stick pusher, a \"nudger\" and an independent \"shaker\" for each pilot. When the aircraft was in danger of stalling it warned the pilots by shaking the control columns as well as correcting attitude and altitude, in an attempt to increase air speed and so avert an irrecoverable deep stall. It was estimated that installing stall-protection cost Dan-Air £100,000 per aircraft and up to £1 million for the entire fleet.[38][42][43][44]",
			"color": "dim|0.18215 gray|0.18215 dim|0.18215 grey|0.18215 light|0.1608 steel|0.1608 blue|0.1608 black|0.07697 slate|0.070844 gray|0.070844 dark|0.050878 gray|0.050878 dark|0.050878 grey|0.050878 gray|0.045589 grey|0.045589 light|0.043966 slate|0.043966 gray|0.043966 lavender|0.042908 steel|0.026392 blue|0.026392 alice|0.024815 blue|0.024815 white|0.023725 smoke|0.023725 silver|0.023573 ghost|0.023414 white|0.023414 snow|0.020787 white|0.019989 azure|0.019208 light|0.019073 gray|0.019073 light|0.019073 grey|0.019073 mint|0.018182 cream|0.018182 gainsboro|0.018053 sea|0.017646 shell|0.017646 floral|0.015585 white|0.015585 lavender|0.014811 blush|0.014811 misty|0.0087351 rose|0.0087351 rosy|0.0073272 brown|0.0073272 ivory|0.0052969  "
		}
	}
}
