{
	"add": {
		"doc": {
			"id": "19db460cae059822b743a9a84f56f7e3dfbdbd8f2e0c7c8369b96961a44ae5a4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/The_Money-makers_A_Social_Parable_by_HF_Keenan.jpg/170px-The_Money-makers_A_Social_Parable_by_HF_Keenan.jpg",
				"previous": "Hay's novel provoked several works in response. Ohio Congressman Martin Foran announced in March 1884 that he would write a book rebutting the author's view of labor, and published it in 1886 under the title The Other Side. Harriet Boomer Barber (writing under the pen name Faith Templeton) kept a number of Hay's characters, while \"turning the American industrial world into a sort of Christian utopia\" in her Drafted In (1888).[53] Stephen Crane's 1895 short story, \"A Christmas Dinner Won in Battle\" satirizes The Bread-Winners.[53]",
				"after": "The most successful response was The Money-Makers (1885), published anonymously by Henry Francis Keenan, a former colleague of Hay's at the New-York Tribune. Keenan's work left little doubt that he had fixed on Hay as author of The Bread-Winners, as it contains characters clearly evoking Hay, his family, and associates. Aaron Grimestone parallels Amasa Stone, Hay's father-in-law.[54] When the Academy Opera House collapses, taking hundreds of lives, Grimestone is deemed responsible for its faulty construction—as Stone was for the deaths in the Ashtabula railway disaster. Grimestone eventually commits suicide by shooting himself in his bathroom, as did Stone in 1883. His daughter Eleanor parallels Clara Stone Hay, and Keenan's descriptions of Eleanor make it clear she is, like Clara, heavyset.[55][56] The character Archibald Hilliard is modeled after Hay, and the description of his appearance is that of Hay even to the mustache.[57] Hilliard was a secretary to a high official in Washington, and later a diplomat and editor, entering journalism in the same year as Hay.[54] Hilliard becomes a brilliant writer at the Atlas, a reforming New York paper like the Tribune, under the editorship of Horatio Blackdaw, that is, Tribune editor Whitelaw Reid.[57] Although she is not physically attractive to him, Hilliard woos Eleanor, convincing himself he is not merely a fortune seeker.[56]",
			"color": "peru|0.42908 black|0.34752 dark|0.078014 golden|0.078014 rod|0.078014 sienna|0.078014 saddle|0.049645 brown|0.049645  "
		}
	}
}
