{
	"add": {
		"doc": {
			"id": "1a266b053eef35a4a534b4bb40143473bb7906eb6d48a7c316d9cf0dd9898390",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Nov%C3%A9_M%C4%9Bsto_nad_Metuj%C3%AD_sundials_2011_3.jpg/170px-Nov%C3%A9_M%C4%9Bsto_nad_Metuj%C3%AD_sundials_2011_3.jpg",
				"previous": "Dials with faces perpendicular to the ground and which face directly South, North, East, or West are called vertical direct dials.[28] [29] It is widely believed, and stated in respectable publications, that a vertical dial cannot receive more than twelve hours of sunlight a day, no matter how many hours of daylight there are.[30] However, there is an exception. Vertical sundials in the tropics which face the nearer pole (e.g. north facing in the zone between the Equator and the Tropic of Cancer) can actually receive sunlight for more than 12 hours from sunrise to sunset for a short period around the time of the summer solstice. For example, at latitude 20 degrees North, on June 21, the sun shines on a north-facing vertical wall for 13 hours, 21 minutes.[31] Vertical sundials which do not face directly South (in the northern hemisphere) may receive significantly less than twelve hours of sunlight per day, depending on the direction they do face, and on the time of year. For example, a vertical dial that faces due East can tell time only in the morning hours; in the afternoon, the sun does not shine on its face. Vertical dials that face due East or West are polar dials, which will be described below. Vertical dials that face North are uncommon, because they tell time only during the spring and summer, and do not show the midday hours except in tropical latitudes (and even there, only around midsummer). For non-direct vertical dials — those that face in non-cardinal directions — the mathematics of arranging the style and the hour-lines becomes more complicated; it may be easier to mark the hour lines by observation, but the placement of the style, at least, must be calculated first; such dials are said to be declining dials.[32] [33] [34]",
				"after": "Vertical dials are commonly mounted on the walls of buildings, such as town-halls, cupolas and church-towers, where they are easy to see from far away. In some cases, vertical dials are placed on all four sides of a rectangular tower, providing the time throughout the day. The face may be painted on the wall, or displayed in inlaid stone; the gnomon is often a single metal bar, or a tripod of metal bars for rigidity. If the wall of the building faces toward the South, but does not face due South, the gnomon will not lie along the noon line, and the hour lines must be corrected. Since the gnomon's style must be parallel to the Earth's axis, it always \"points\" true North and its angle with the horizontal will equal the sundial's geographical latitude; on a direct south dial, its angle with the vertical face of the dial will equal the colatitude, or 90° minus the latitude.[35]",
			"color": "dim|0.28304 gray|0.28304 dim|0.28304 grey|0.28304 gray|0.15568 grey|0.15568 slate|0.095539 gray|0.095539 light|0.07961 slate|0.07961 gray|0.07961 light|0.075492 gray|0.075492 light|0.075492 grey|0.075492 gainsboro|0.070285 black|0.05423 silver|0.044004 dark|0.041814 gray|0.041814 dark|0.041814 grey|0.041814 golden|0.023097 rod|0.023097 linen|0.010477 orange|0.0078086 white|0.0072847 smoke|0.0072847 light|0.0051299 steel|0.0051299 blue|0.0051299  "
		}
	}
}
