{
	"add": {
		"doc": {
			"id": "1a2b974e16130f1e6c0d41d79cba35c9d7352d6bc2305994f1bcb49dfce29e3a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Mlacerda.png/150px-Mlacerda.png",
				"previous": "Vicente Rojas Lizcano, whose pseudonym was Biófilo Panclasta, was a Colombian individualist anarchist writer and activist. In 1904 he began using the name Biofilo Panclasta. \"Biofilo\" in Spanish stands for \"lover of life\" and \"Panclasta\" for \"enemy of all\".[268] He visited more than fifty countries propagandizing for anarchism which in his case was highly influenced by the thought of Max Stirner and Friedrich Nietszche. Among his written works there are Siete años enterrado vivo en una de las mazmorras de Gomezuela: Horripilante relato de un resucitado(1932) and Mis prisiones, mis destierros y mi vida (1929) which talk about his many adventures while living his life as an adventurer, activist and vagabond, as well as his thought and the many times he was imprisoned in different countries.",
				"after": "Maria Lacerda de Moura was a Brazilian teacher, journalist, anarcha-feminist, and individualist anarchist. Her ideas regarding education were largely influenced by Francisco Ferrer. She later moved to São Paulo and became involved in journalism for the anarchist and labor press. There she also lectured on topics including education, women's rights, free love, and antimilitarism. Her writings and essays garnered her attention not only in Brazil, but also in Argentina and Uruguay. In February 1923, she launched Renascença, a periodical linked with the anarchist, progressive, and freethinking circles of the period. Her thought was mainly influenced by individualist anarchists such as Han Ryner and Émile Armand.[99] She maintained contact with Spanish individualist anarchist circles.[29]",
			"color": "dim|0.33833 gray|0.33833 dim|0.33833 grey|0.33833 dark|0.2365 gray|0.2365 dark|0.2365 grey|0.2365 gray|0.19702 grey|0.19702 silver|0.13203 light|0.056545 gray|0.056545 light|0.056545 grey|0.056545 gainsboro|0.03862  "
		}
	}
}
