{
	"add": {
		"doc": {
			"id": "1a39a36949928ff319201d079e5ba3a79450d3f1e0e3e715ecf8bb3f14445110",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/European_Court_of_Human_Rights_Court_room.jpg/200px-European_Court_of_Human_Rights_Court_room.jpg",
			"previous": [],
				"after": "Law is a system of rules, usually enforced through a set of institutions. It shapes politics, economics and society in numerous ways and serves as a primary social mediator of relations between people. Contract law regulates everything from buying a bus ticket to trading on derivatives markets. Property law defines rights and obligations related to the transfer and title of personal (often referred to as chattel) and real property. Trust law applies to assets held for investment and financial security, while tort law allows claims for compensation if a person's rights or property are harmed. If the harm is criminalised in a statute, criminal law offers means by which the state can prosecute the perpetrator. Constitutional law provides a framework for the creation of law, the protection of human rights and the election of political representatives. Administrative law is used to review the decisions of government agencies, while international law governs affairs between sovereign states in activities ranging from trade to environmental regulation or military action. Writing in 350 BC, the Greek philosopher Aristotle declared: \"The rule of law is better than the rule of any individual.\"",
			"color": "black|0.1727 corn|0.154 flower|0.154 blue|0.154 dim|0.036827 gray|0.036827 dim|0.036827 grey|0.036827 white|0.035759 smoke|0.035759 dark|0.035288 gray|0.035288 dark|0.035288 grey|0.035288 alice|0.034307 blue|0.034307 ghost|0.031069 white|0.031069 gray|0.031 grey|0.031 light|0.02967 gray|0.02967 light|0.02967 grey|0.02967 gainsboro|0.029529 azure|0.029185 snow|0.028841 mint|0.028799 cream|0.028799 white|0.028032 silver|0.0257 sea|0.024733 shell|0.024733 light|0.02444 slate|0.02444 gray|0.02444 floral|0.024176 white|0.024176 slate|0.022722 gray|0.022722 steel|0.020092 blue|0.020092 light|0.017637 steel|0.017637 blue|0.017637 lavender|0.017069 lavender|0.016593 blush|0.016593 ivory|0.010591 beige|0.0089698 linen|0.0089331 light|0.0088904 cyan|0.0088904 dodger|0.0077511 blue|0.0077511 honeydew|0.007144 light|0.0070342 blue|0.0070342  "
		}
	}
}
