{
	"add": {
		"doc": {
			"id": "1a46e7255794b1ea18e6662ea686bfbd02833256f060ebca9c364aaff8d5d968",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Wankhede-1.JPG/220px-Wankhede-1.JPG",
				"previous": "Since 2000, the Indian team underwent major improvements with the appointment of John Wright as India's first ever foreign coach. India maintained their unbeaten home record against Australia in Test series after defeating them in 2001. The series was famous for the Kolkata Test match, in which India became only the third team in the history of Test cricket to win a Test match after following on. Australian captain Steve Waugh labelled India as the \"Final Frontier\" as a result of his side's inability to win a Test series in India.[17] Victory in 2001 against the Australians marked the beginning of a dream run for India under their captain Ganguly, winning Test matches in Zimbabwe, Sri Lanka, West Indies and England. The England series is also known for India's highest ODI run-chase of 325 runs at Lord's which came in the Natwest ODI Series final against England. In the same year, India were joint-winners of the ICC Champions Trophy with Sri Lanka, and then went to the 2003 Cricket World Cup in South Africa where they reached the final only to be beaten by Australia. The 2003–04 season also saw India play out a Test series in Australia where they drew 1–1 with the world champions, and then win a Test and ODI series in Pakistan.",
				"after": "At the end of the 2004 season, India suffered from lack of form and fitness from its older players. A defeat in a following home Test series against Australia was followed by an ODI home series defeat against Pakistan followed by a Test series levelled 1–1. Greg Chappell took over from John Wright as the coach of the Indian cricket team following the series, and his methods proved to be controversial during the beginning of his tenure. The tension resulted in a fallout between Chappell and Ganguly, resulting in Rahul Dravid being made captain. This triggered a revival in the team's fortunes, following the emergence of players like Mahendra Singh Dhoni, Suresh Raina, and the coming of age of players like Irfan Pathan and Yuvraj Singh. A thumping home series victory over Sri Lanka in 2005 and a drawn series with South Africa put India at second place in the ICC ODI rankings. Dravid, Tendulkar and Virender Sehwag were selected to play for the ICC World XI in the 2005 \"SuperTest\" against Australia. A convincing ODI series win in Pakistan in early 2006, following a loss in the Test series, gave India the world record of 17 successive ODI victories while batting second.[18] Towards the middle of 2006, however, a 4–1 series loss in the West Indies gave rise to a slump in India's ODI form, while they achieved a 1–0 victory in the Test series that followed, giving them their first Test series victory in the Caribbean since 1971. India's ODI form slumped further with a disappointing performance in the 2006 Champions Trophy and a drubbing in the ODI series in South Africa. This was followed yet again by an initial good performance in the Tests, giving India its first Test match win in South Africa, although they went on to lose the series 2–1. This Test series was marked by Ganguly's comeback to the Indian team.[19]",
			"color": "dark|0.98912 olive|0.98912 green|0.98912  "
		}
	}
}
