{
	"add": {
		"doc": {
			"id": "1a4f2faf3fd74cce8a7638f42fd1087940ad1110eaeb3e217931d122c1ab8ece",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/New_Clairvaux%2C_Sacred_Stones.jpg/220px-New_Clairvaux%2C_Sacred_Stones.jpg",
				"previous": "The current abbot of the Abbey of New Clairvaux, Thomas X. Davis, first saw the stones and pictured them reassembled as a monastery on September 15, 1955—his first day in California. He arrived that day in San Francisco to serve as a new monk in Vina, California, at the monastery of Our Lady of New Clairvaux. The monastery belonged to Trappists of the order known as Cistercians of the Strict Observance. The monks farmed and worshiped on land once used by Leland Stanford to grow wine grapes.[46] Davis's superior met him at the airport and drove him through Golden Gate Park where he stopped to show Davis the stones sitting among the weeds. From time to time in subsequent years, Davis inspected the stones only to find them in increasingly poor condition.[29]",
				"after": "In 1981, architectural historian Margaret Burke began working under a grant from the Hearst Foundation to inventory the remaining stones.[29] She said it was \"an excavation project\" because of the weeds, blackberry brambles and tree roots growing over them.[29] Burke identified about 60% of the stones belonging to the chapter house, a rectangular building originally spanning 31 by 46 feet (9.4 by 14.0 m). She separated the chapter house stones, surrounded them with a fence and began creating templates for rebuilding the arched entrances.[39] During 1980–1982 the museum board sought $45 million for an expansion project that included $3 million for rebuilding the chapter house.[2] Meanwhile, Davis asked a museum staff member for permission to take several truckloads of stones to Vina to be used for architectural decoration. Park workers helped him load the most ornate pieces he could find, and they were hauled away. Not told of the arrangement, Burke discovered that Davis had taken some of the chapter house stones, and the museum board insisted these be returned. Davis was left with 58 stones from other monastery buildings.[39]",
			"color": "dim|0.16126 gray|0.16126 dim|0.16126 grey|0.16126 olive|0.10892 gray|0.078905 grey|0.078905 dark|0.062916 gray|0.062916 dark|0.062916 grey|0.062916 silver|0.052016 light|0.046446 gray|0.046446 light|0.046446 grey|0.046446 slate|0.040695 gray|0.040695 black|0.040154 gainsboro|0.038974 sienna|0.038411 light|0.03286 slate|0.03286 gray|0.03286 saddle|0.031197 brown|0.031197 dark|0.025487 olive|0.025487 green|0.025487 rosy|0.022361 brown|0.022361 lavender|0.016779  "
		}
	}
}
