{
	"add": {
		"doc": {
			"id": "1a705d259b2731297d4c96fd11d7d9f20c1129116f06f1a153d5ac96ee7f0f5b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Pedro_menendez_de_Aviles.jpg/220px-Pedro_menendez_de_Aviles.jpg",
				"previous": "Second in power and number to the Calusa in South Florida were the Tequesta (also called Tekesta, Tequeste, and Tegesta). They occupied the southeastern portion of the lower peninsula in modern-day Dade and Broward counties. They may have been controlled by the Calusa, but accounts state that they sometimes refused to comply with the Calusa caciques, which resulted in war.[22] Like the Calusa, they rarely lived within the Everglades, but found the coastal prairies and pine rocklands to the east of the freshwater sloughs habitable. To the north, their territory was bordered by the Ais and Jaega. Like the Calusa, the Tequesta societies centered on the mouths of rivers. Their main village was probably on the Miami River or Little River. A large shell mound on the Little River marks where a village once stood.[34] Though little remains of the Tequesta society, a site of archeological importance called the Miami Circle was discovered in 1998 in downtown Miami. It may be the remains of a Tequesta structure.[35] Its significance has yet to be determined, though archeologists and anthropologists continue to study it.[36]",
				"after": "The Spanish described the Tequesta as greatly feared by their sailors, who suspected the natives of torturing and killing survivors of shipwrecks. Spanish priests wrote that the Tequesta performed child sacrifices to mark the occasion of making peace with a tribe with whom they had been fighting. Like the Calusa, the Tequesta hunted small game, but depended more upon roots and less on shellfish in their diets. They did not practice cultivated agriculture. They were skilled canoeists and hunted in the open ocean for what Fontaneda described as whales, but were probably manatees. They lassoed the manatees and drove a stake through their snouts.[23][34]",
			"color": " "
		}
	}
}
