{
	"add": {
		"doc": {
			"id": "1a75dad2916d39313ee692c44a14da9f05e3818b4c12385ad955bc712a7f7a4f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/TowerPlaza45.JPG/170px-TowerPlaza45.JPG",
				"previous": "Websites and online media companies in or near the city include All Media Guide, the Weather Underground, and Zattoo. Ann Arbor is the home to Internet2 and the Merit Network, a not-for-profit research and education computer network. Both are located in the South State Commons 2 building on South State Street, which once housed the Michigan Information Technology Center Foundation.[61] The city is also home to the headquarters of Google's AdWords program—the company's primary revenue stream.[62] The recent surge in companies operating in Ann Arbor has led to a decrease in its office and flex space vacancy rates. As of 31 December 2012, the total market vacancy rate for office and flex space is 11.80%, a 1.40% decrease in vacancy from one year previous, and the lowest overall vacancy level since 2003. The office vacancy rate decreased to 10.65% in 2012 from 12.08% in 2011, while the flex vacancy rate decreased slightly more, with a drop from 16.50% to 15.02%.[63]",
				"after": "Pfizer, once the city's second largest employer, operated a large pharmaceutical research facility on the northeast side of Ann Arbor. On 22 January 2007, Pfizer announced it would close operations in Ann Arbor by the end of 2008.[64] The facility was previously operated by Warner-Lambert and, before that, Parke-Davis. In December 2008, the University of Michigan Board of Regents approved the purchase of the facilities, and the university anticipates hiring 2,000 researchers and staff during the next 10 years.[65] The city is the home of other research and engineering centers, including those of Lotus Engineering, General Dynamics and the National Oceanic and Atmospheric Administration (NOAA). Other research centers sited in the city are the United States Environmental Protection Agency's National Vehicle and Fuel Emissions Laboratory[66] and the Toyota Technical Center.[67] The city is also home to National Sanitation Foundation International (NSF International), the nonprofit non-governmental organization that develops generally accepted standards for a variety of public health related industries and subject areas.[68]",
			"color": "dark|0.17461 slate|0.17461 gray|0.17461 slate|0.085117 gray|0.085117 light|0.06049 slate|0.06049 gray|0.06049 dim|0.057417 gray|0.057417 dim|0.057417 grey|0.057417 dark|0.056495 olive|0.056495 green|0.056495 gray|0.051791 grey|0.051791 sea|0.034192 shell|0.034192 floral|0.033964 white|0.033964 white|0.032199 smoke|0.032199 black|0.032166 mint|0.030047 cream|0.030047 snow|0.029888 white|0.028161 dark|0.026497 gray|0.026497 dark|0.026497 grey|0.026497 linen|0.024988 ivory|0.023745 azure|0.020624 ghost|0.020614 white|0.020614 pink|0.018925 old|0.018811 lace|0.018811 alice|0.016633 blue|0.016633 silver|0.015938 light|0.014912 gray|0.014912 light|0.014912 grey|0.014912 gainsboro|0.013616 antique|0.012427 white|0.012427 lavender|0.0096402 blush|0.0096402 beige|0.008698 honeydew|0.008129 misty|0.0078928 rose|0.0078928  "
		}
	}
}
