{
	"add": {
		"doc": {
			"id": "1a796b2c9acc982450f466dc046b8befe4dcc2bba53fd481f5819f0599853ebb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Soundersfcqwestfield.jpg/220px-Soundersfcqwestfield.jpg",
				"previous": "Seattle has three major men's professional sports teams: the National Football League's Seattle Seahawks, Major League Baseball's Seattle Mariners, and Major League Soccer's Seattle Sounders FC. Other professional sports teams include the 2004 and 2010 Women's National Basketball Association champions, Seattle Storm.[182] The Seahawks' CenturyLink Field has hosted playoff games in 2006, 2008, 2011 and 2014. The Seattle Seahawks have advanced to the Super Bowl three times (2005, 2013 and 2014 seasons. They won the Super Bowl title in the 2013–2014 season and lost against the New England Patriots in Super Bowl XLIX. The Seattle Sounders FC began play in Major League Soccer in 2009,[183] and also play at CenturyLink Field.",
				"after": "Seattle's professional sports history began at the start of the 20th century with the PCHA's Seattle Metropolitans, which in 1917 became the first American hockey team to win the Stanley Cup.[184] Seattle was also home to a previous Major League Baseball franchise in 1969: the Seattle Pilots. The team relocated to Milwaukee, Wisconsin and became the Milwaukee Brewers in 1970. From 1967 to 2008 Seattle was also home to an NBA franchise: the Seattle SuperSonics, who were the 1978–79 NBA champions. The team relocated to Oklahoma City, Oklahoma and became the Oklahoma City Thunder for the 2008-09 NBA season.[185]",
			"color": "dim|0.18095 gray|0.18095 dim|0.18095 grey|0.18095 gray|0.14789 grey|0.14789 black|0.12864 dark|0.089569 slate|0.089569 gray|0.089569 dark|0.071777 gray|0.071777 dark|0.071777 grey|0.071777 slate|0.054229 gray|0.054229 light|0.044342 slate|0.044342 gray|0.044342 olive|0.030129 drab|0.030129 silver|0.021014 tan|0.020763 rosy|0.016003 brown|0.016003 midnight|0.013901 blue|0.013901 thistle|0.01273 yellow|0.011839 green|0.011839 light|0.0086373 gray|0.0086373 light|0.0086373 grey|0.0086373 light|0.0082874 steel|0.0082874 blue|0.0082874  "
		}
	}
}
