{
	"add": {
		"doc": {
			"id": "1a7e1ebfa1f60463ffc4d78ed2f3f834edbead6d5136f217d7d783d8cc5f318d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/SDJ_Harlech_Castle_Gatehouse.jpg/220px-SDJ_Harlech_Castle_Gatehouse.jpg",
				"previous": "Concentric castles were widely copied across Europe, for instance when Edward I of England – who had himself been on Crusade – built castles in Wales in the late 13th century, four of the eight he founded had a concentric design.[90][91] Not all the features of the Crusader castles from the 13th century were emulated in Europe. For instance, it was common in Crusader castles to have the main gate in the side of a tower and for there to be two turns in the passageway, lengthening the time it took for someone to reach the outer enclosure. It is rare for this bent entrance to be found in Europe.[90]",
				"after": "One of the effects of the Livonian Crusade in the Baltic was the introduction of stone and brick fortifications. Although there were hundreds of wooden castles in Prussia and Livonia, the use of bricks and mortar was unknown in the region before the Crusaders. Until the 13th century and start of the 14th centuries, their design was heterogeneous, however this period saw the emergence of a standard plan in the region: a square plan, with four wings around a central courtyard.[92] It was common for castles in the East to have arrowslits in the curtain wall at multiple levels; contemporary builders in Europe were wary of this as they believed it weakened the wall. Arrowslits did not compromise the wall's strength, but it was not until Edward I's programme of castle building that they were widely adopted in Europe.[34]",
			"color": "dark|0.20661 gray|0.20661 dark|0.20661 grey|0.20661 dim|0.19104 gray|0.19104 dim|0.19104 grey|0.19104 gray|0.17216 grey|0.17216 silver|0.13031 light|0.078748 gray|0.078748 light|0.078748 grey|0.078748 gainsboro|0.054966 black|0.036202 slate|0.032951 gray|0.032951 dark|0.023305 slate|0.023305 gray|0.023305 light|0.019522 slate|0.019522 gray|0.019522 white|0.0085936 smoke|0.0085936 linen|0.0065575 lavender|0.0054207 blush|0.0054207 sea|0.0048414 shell|0.0048414  "
		}
	}
}
