{
	"add": {
		"doc": {
			"id": "1a8b5fbc0462c21da9a30b543a74956b742b6174cd7c89617594c11fc2989b74",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Poulain_de_race_ardennaise_1.jpg/220px-Poulain_de_race_ardennaise_1.jpg",
				"previous": "There is tremendous debate over the proper age to begin training a foal. Some advocate beginning to accustom a foal to human handling from the moment of birth, using a process termed imprinting or \"imprint training\". Others feel that imprint training of a foal interferes with the mare and foal bond and prefer to wait until the foal is a few days old, but do begin training within the first week to month of life. Yet other horse breeding operations wait until weaning, theorizing that a foal is more willing to bond to a human as a companion at the time it is separated from its mother. Regardless of theory, most modern horse breeding operations consider it wise to give a foal basic training while it is still young, and consider it far safer than trying to tame a semi-feral adult-sized horse.",
				"after": "Horses are not fully mature until the age of four or five, but most are started as working animals much younger, though care must be taken not to over-stress the \"soft\" bones of younger animals. Yearlings are generally too young to be ridden at all, though many race horses are put under saddle as \"long\" yearlings, in autumn. Physiologically young horses are still not truly mature as two-year olds, though some breeders and most race horse trainers do start young horses in a cart or under saddle at that age. The most common age for young horses to begin training under saddle is the age of three. A few breeds and disciplines wait until the animal is four.",
			"color": "black|0.40796 dark|0.11188 gray|0.11188 dark|0.11188 grey|0.11188 tan|0.10156 silver|0.093632 gray|0.092944 grey|0.092944 dim|0.074429 gray|0.074429 dim|0.074429 grey|0.074429 light|0.045485 gray|0.045485 light|0.045485 grey|0.045485  "
		}
	}
}
