{
	"add": {
		"doc": {
			"id": "1a8c611025a58abe53ae2257ed7efafe12590f58948eda50030aa09f37ca0ae3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Lophopsittacus.jpg/220px-Lophopsittacus.jpg",
				"previous": "Subfossils show that the males were larger, measuring 55–65 cm (22.6–25.5 in) to the females' 45–55 cm (18.7–22.6 in) and that both sexes had disproportionately large heads and beaks. The sexual dimorphism in size between male and female skulls is the largest among parrots.[5] Differences in the bones of the rest of the body and limbs are less pronounced; nevertheless, it had greater sexual dimorphism in overall size than any living parrot. The size differences between the two birds in the 1601 sketch may be due to this feature.[16] A 1602 account by Reyer Cornelisz has traditionally been interpreted as the only contemporary mention of size differences among broad-billed parrots, listing \"large and small Indian crows\" among the animals of the island. A full transcript of the original text was only published in 2003, and showed that a comma had been incorrectly placed in the English translation; \"large and small\" instead referred to \"field-hens\", possibly the red rail and the smaller Sauzier's wood rail.[17]",
				"after": "There has been some confusion over the colouration of the broad-billed parrot.[18] The report of van Neck's 1598 voyage, published in 1601, contained the first illustration of the parrot, with a caption stating that the bird had \"two or three colours\".[3] The last account of the bird, and the only mention of specific colours, was by Johann Christian Hoffman in 1673–75:",
			"color": "black|0.27458 tan|0.19149 burly|0.12795 wood|0.12795 dark|0.054191 khaki|0.054191 slate|0.048143 gray|0.048143 sandy|0.034323 brown|0.034323 saddle|0.031966 brown|0.031966 light|0.028041 slate|0.028041 gray|0.028041 wheat|0.025362 peru|0.018703 dim|0.016419 gray|0.016419 dim|0.016419 grey|0.016419 pale|0.016207 golden|0.016207 rod|0.016207 dark|0.015957 slate|0.015957 gray|0.015957 navajo|0.013179 white|0.013179 sienna|0.011553  "
		}
	}
}
