{
	"add": {
		"doc": {
			"id": "1a8c0df87694d1e128e737adb6be6e96d671a0915629b10fa823482171a49e22",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Caught_opah.jpg/170px-Caught_opah.jpg",
				"previous": "Lampris guttatus is a large discoid and deeply keeled fish with an attractive form and a conspicuous coloration. They can reach a maximum length of 2 m (6.6 ft) and a maximum weight of 270 kg (600 lb). The body is a deep steely blue grading to rosy on the belly, with white spots in irregular rows covering the flanks. Both the median and paired fins are a bright vermillion. Jaws are vermillion, too. The large eyes stand out as well, ringed with golden yellow. The body is covered in minute cycloid scales and its silvery, iridescent guanine coating is easily abraded.",
				"after": "They have long falcated pectoral fins inserted (more or less) horizontally. The caudal fins are broadly lunated, forked, and emarginated. Pelvic fins are similar but a little longer than pectoral fins, with about 14–17 rays. The anterior portion of a dorsal fin (with about 50–55 rays) is greatly elongated, also in a falcate profile similar to the pelvic fins. The anal fin (34–41 rays) is about as high and as long as the shorter portion of the dorsal fin, and both fins have corresponding grooves into which they can be depressed. The snout is pointed and the mouth small, toothless, and terminal. The lateral line forms a high arch over the pectoral fins before sweeping down to the caudal peduncle.",
			"color": "dark|0.15365 gray|0.15365 dark|0.15365 grey|0.15365 silver|0.13771 dim|0.10135 gray|0.10135 dim|0.10135 grey|0.10135 light|0.083121 gray|0.083121 light|0.083121 grey|0.083121 gray|0.081572 grey|0.081572 gainsboro|0.059222 rosy|0.035618 brown|0.035618 misty|0.030399 rose|0.030399 lavender|0.027866 blush|0.027866 sienna|0.025575 white|0.022727 smoke|0.022727 sea|0.020391 shell|0.020391 snow|0.019276 ghost|0.019079 white|0.019079 linen|0.01733 alice|0.015405 blue|0.015405 white|0.01485 lavender|0.01294 floral|0.011275 white|0.011275 firebrick|0.011132 black|0.010678 dark|0.0094086 slate|0.0094086 gray|0.0094086 mint|0.0085498 cream|0.0085498 slate|0.0085063 gray|0.0085063 brown|0.0081703  "
		}
	}
}
