{
	"add": {
		"doc": {
			"id": "1a912ef6f9eb3b646ede156dcaa696166d568277a4a42edc2d07c5eeba648a97",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Continental_Airlines_767-200ER.jpg/220px-Continental_Airlines_767-200ER.jpg",
				"previous": "Between 1993 and 1995, Continental experimented with an \"airline within an airline\" by launching CALite, later renamed Continental Lite, which provided all-economy, low-fare, no-frills service between primarily leisure destinations. Continental Lite operated with a dedicated fleet of 100 McDonnell Douglas DC-9-30 and Boeing 737–200 aircraft, each repainted with the 'Lite' livery and stripped of its first class cabin. (The Continental Lite experiment was rumored to be the result of \"extra\" aircraft on hand following the closure of Continental's Denver hub.) This service was based primarily at Continental's existing hub in Cleveland as well as a new hub established in Greensboro, NC. The experiment, which had been developed and launched by Bethune's predecessor, Robert Ferguson, proved unsuccessful and the brand was dissolved in 1995. Continental's short-lived Greensboro hub was dismantled in the process. On March 26, 1996, Continental launched the first phase of its website.[27] During this time period Continental was the subject of hostile takeover bids submitted by then Delta Air Lines and Northwest Airlines. The final deal struck with Northwest, as described by Bethune in his book, allowed Continental to keep its corporate identity but all major decisions, mergers and alliances, were controlled by means of a \"golden share\" owned by Northwest Airlines.[citation needed]",
				"after": "Beginning in 1998, Continental again embarked on a program to expand its international operations. In that year it inaugurated services to Ireland and Scotland, and in October 1998 the airline received its first Boeing 777-200ER aircraft, allowing non-stop flights from Newark and Houston to Tokyo, Japan, and from Newark to Tel Aviv, Israel. Continental in the same year launched partnerships with Northwest Airlines, Copa Airlines, Avant Airlines, Transbrasil, and Cape Air, and Continental and America West Airlines became the first two US airlines to launch interline electronic ticketing.[28] In 1999, Continental Airlines started service between Newark and Zurich, Switzerland, and from Cleveland to London. The Cleveland to London originally flew from Cleveland Hopkins International to London's Gatwick Airport, but moved in 2009 to London Heathrow. Due to the economic situation, this flight was suspended later that year. In 1998 Continental expanded its flycontinental.com functionality, including the addition of WebTV and Windows CE functionality and expanding services to Canadian users.[29]",
			"color": "gray|0.23891 grey|0.23891 black|0.10148 dim|0.098241 gray|0.098241 dim|0.098241 grey|0.098241 light|0.070335 gray|0.070335 light|0.070335 grey|0.070335 dark|0.064312 gray|0.064312 dark|0.064312 grey|0.064312 gainsboro|0.061571 silver|0.058033 light|0.044141 steel|0.044141 blue|0.044141 light|0.034564 slate|0.034564 gray|0.034564 white|0.02619 smoke|0.02619 alice|0.022834 blue|0.022834 lavender|0.022829 slate|0.020909 gray|0.020909 ghost|0.019187 white|0.019187 snow|0.015444 sea|0.012721 shell|0.012721 azure|0.012666 mint|0.012642 cream|0.012642 white|0.012585 linen|0.010794 lavender|0.0099431 blush|0.0099431 floral|0.0080328 white|0.0080328  "
		}
	}
}
