{
	"add": {
		"doc": {
			"id": "1aa94c7ac7129915005d26c6172653bf86500e46e4222df560eff6e172fc75b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Protesting_Australian_soldiers_1945_%28124202%29.jpg/220px-Protesting_Australian_soldiers_1945_%28124202%29.jpg",
				"previous": "In line with a plan approved by the Australian Government in September 1945, general demobilisation was conducted in four stages. The first stage ran from October 1945 to January 1946 and involved the discharge of 249,159 personnel, which was higher than the targets of 10,000 members of the Royal Australian Navy, 135,000 soldiers and 55,000 airmen specified in the demobilisation plan.[6] In the second stage 193,461 personnel left the military between February and 30 June 1946, though this was slightly lower than the target of 200,000.[10] The third stage ran from 1 July to 31 December by which time the services were reduced to 78,000 personnel, which was considered the strength necessary for the military's post-war tasks. Of the remaining servicemen, those who did not wish to volunteer for continuing service in the military were released in the fourth stage which began on 1 January 1947. At the end of this process the military's strength had fallen 60,000 personnel.[11] Where possible, service men and women were placed on leave and allowed to return home while awaiting discharge.[12]",
				"after": "The demobilisation of the military included disbanding the female branches of the three services. The Women's Royal Australian Naval Service, Australian Women's Army Service and Women's Auxiliary Australian Air Force had been formed during 1941 and 1942 to enable women to serve in the military but were disbanded during 1947, with military service being again restricted to men.[13] Demobilised service women were provided with similar assistance to male members of the military, but were placed under pressure to return to 'traditional' family roles.[14]",
			"color": " "
		}
	}
}
