{
	"add": {
		"doc": {
			"id": "1aaee31f52e2f4c1712a35b6c600562643d8c305a27d59e623e1d110cf3fdad1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/ODA_percent_of_GNI_2009.png/220px-ODA_percent_of_GNI_2009.png",
				"previous": "Sweden's doctrine of neutrality is often traced back to the 19th century as the country has not been in a state of war since the end of the Swedish campaign against Norway in 1814. During World War II Sweden joined neither the allied nor axis powers. This has sometimes been disputed since in effect Sweden allowed in select cases the Nazi regime to use its railroad system to transport troops and goods,[52][54] especially iron ore from mines in northern Sweden, which was vital to the German war machine.[54][117] However, Sweden also indirectly contributed to the defence of Finland in the Winter War, and permitted the training of Norwegian and Danish troops in Sweden after 1943.",
				"after": "During the early Cold War era, Sweden combined its policy of non-alignment and a low profile in international affairs with a security policy based on strong national defence.[118] The function of the Swedish military was to deter attack.[119] At the same time, the country maintained relatively close informal connections with the Western bloc, especially in the realm of intelligence exchange. In 1952, a Swedish DC-3 was shot down over the Baltic Sea by a Soviet MiG-15 jet fighter. Later investigations revealed that the plane was actually gathering information for NATO.[120] Another plane, a Catalina search and rescue plane, was sent out a few days later and shot down by the Soviets as well. Prime Minister Olof Palme made an official visit to Cuba during the 1970s, during which he denounced Fulgencio Batista's government and praised contemporary Cuban and Cambodian revolutionaries in a speech.",
			"color": "light|0.083522 steel|0.083522 blue|0.083522 light|0.082779 gray|0.082779 light|0.082779 grey|0.082779 silver|0.078511 dark|0.073794 gray|0.073794 dark|0.073794 grey|0.073794 gainsboro|0.069504 white|0.053943 smoke|0.053943 sea|0.051395 shell|0.051395 ghost|0.051175 white|0.051175 snow|0.050268 floral|0.048241 white|0.048241 white|0.048006 mint|0.047486 cream|0.047486 alice|0.046462 blue|0.046462 azure|0.043412 gray|0.039948 grey|0.039948 lavender|0.030159 blush|0.030159 dim|0.028345 gray|0.028345 dim|0.028345 grey|0.028345 lavender|0.027956 linen|0.015854 ivory|0.012573 light|0.0070687 slate|0.0070687 gray|0.0070687 slate|0.0059349 gray|0.0059349  "
		}
	}
}
