{
	"add": {
		"doc": {
			"id": "1ab925e5d67fbc332b98bfa0995c361757f4abd1aea5c3db9f4f357a89ed06cc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Allosaurus_Jaws_Steveoc86.jpg/220px-Allosaurus_Jaws_Steveoc86.jpg",
				"previous": "Paleontologists accept Allosaurus as an active predator of large animals. There is dramatic evidence for allosaur attacks on Stegosaurus, including an Allosaurus tail vertebra with a partially healed puncture wound that fits a Stegosaurus tail spike, and a Stegosaurus neck plate with a U-shaped wound that correlates well with an Allosaurus snout.[92] Sauropods seem to be likely candidates as both live prey and as objects of scavenging, based on the presence of scrapings on sauropod bones fitting allosaur teeth well and the presence of shed allosaur teeth with sauropod bones.[93] However, as Gregory Paul noted in 1988, Allosaurus was probably not a predator of fully grown sauropods, unless it hunted in packs, as it had a modestly sized skull and relatively small teeth, and was greatly outweighed by contemporaneous sauropods.[10] Another possibility is that it preferred to hunt juveniles instead of fully grown adults.[6][68] Research in the 1990s and first decade of the 21st century may have found other solutions to this question. Robert T. Bakker, comparing Allosaurus to Cenozoic sabre-toothed carnivorous mammals, found similar adaptations, such as a reduction of jaw muscles and increase in neck muscles, and the ability to open the jaws extremely wide. Although Allosaurus did not have sabre teeth, Bakker suggested another mode of attack that would have used such neck and jaw adaptations: the short teeth in effect became small serrations on a saw-like cutting edge running the length of the upper jaw, which would have been driven into prey. This type of jaw would permit slashing attacks against much larger prey, with the goal of weakening the victim.[54]",
				"after": "Similar conclusions were drawn by another study using finite element analysis on an Allosaurus skull. According to their biomechanical analysis, the skull was very strong but had a relatively small bite force. By using jaw muscles only, it could produce a bite force of 805 to 2,148 N, less than the values for alligators (13,000 N), lions (4,167 N), and leopards (2,268 N), but the skull could withstand nearly 55,500 N of vertical force against the tooth row. The authors suggested that Allosaurus used its skull like a hatchet against prey, attacking open-mouthed, slashing flesh with its teeth, and tearing it away without splintering bones, unlike Tyrannosaurus, which is thought to have been capable of damaging bones. They also suggested that the architecture of the skull could have permitted the use of different strategies against different prey; the skull was light enough to allow attacks on smaller and more agile ornithopods, but strong enough for high-impact ambush attacks against larger prey like stegosaurids and sauropods.[53] Their interpretations were challenged by other researchers, who found no modern analogues to a hatchet attack and considered it more likely that the skull was strong to compensate for its open construction when absorbing the stresses from struggling prey.[94] The original authors noted that Allosaurus itself has no modern equivalent, that the tooth row is well-suited to such an attack, and that articulations in the skull cited by their detractors as problematic actually helped protect the palate and lessen stress.[95] Another possibility for handling large prey is that theropods like Allosaurus were \"flesh grazers\" which could take bites of flesh out of living sauropods that were sufficient to sustain the predator so it would not have needed to expend the effort to kill the prey outright. This strategy would also potentially have allowed the prey to recover and be fed upon in a similar way later.[15] An additional suggestion notes that ornithopods were the most common available dinosaurian prey, and that allosaurs may have subdued them by using an attack similar to that of modern big cats: grasping the prey with their forelimbs, and then making multiple bites on the throat to crush the trachea.[6] This is compatible with other evidence that the forelimbs were strong and capable of restraining prey.[21]",
			"color": "dark|0.24719 gray|0.24719 dark|0.24719 grey|0.24719 dim|0.19264 gray|0.19264 dim|0.19264 grey|0.19264 gray|0.19224 grey|0.19224 silver|0.060111 white|0.028892 smoke|0.028892 ghost|0.027751 white|0.027751 alice|0.027722 blue|0.027722 snow|0.027431 sea|0.027243 shell|0.027243 white|0.026916 lavender|0.026911 blush|0.026911 mint|0.026222 cream|0.026222 floral|0.025607 white|0.025607 azure|0.025518 light|0.018954 gray|0.018954 light|0.018954 grey|0.018954 gainsboro|0.012962  "
		}
	}
}
