{
	"add": {
		"doc": {
			"id": "1ad4d3a8ec7bba8c38b8800644c1cc807e92bbb6ba77a3d809401b411f80c3b3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/PriestleyFuseli.jpg/170px-PriestleyFuseli.jpg",
				"previous": "Oxygen was first discovered by Swedish pharmacist Carl Wilhelm Scheele. He had produced oxygen gas by heating mercuric oxide and various nitrates by about 1772.[7][64] Scheele called the gas \"fire air\" because it was the only known supporter of combustion, and wrote an account of this discovery in a manuscript he titled Treatise on Air and Fire, which he sent to his publisher in 1775. That document was published in 1777.[68]",
				"after": "In the meantime, on August 1, 1774, an experiment conducted by the British clergyman Joseph Priestley focused sunlight on mercuric oxide (HgO) inside a glass tube, which liberated a gas he named \"dephlogisticated air\".[7] He noted that candles burned brighter in the gas and that a mouse was more active and lived longer while breathing it. After breathing the gas himself, he wrote: \"The feeling of it to my lungs was not sensibly different from that of common air, but I fancied that my breast felt peculiarly light and easy for some time afterwards.\"[27] Priestley published his findings in 1775 in a paper titled \"An Account of Further Discoveries in Air\" which was included in the second volume of his book titled Experiments and Observations on Different Kinds of Air.[64][69] Because he published his findings first, Priestley is usually given priority in the discovery.",
			"color": "antique|0.11174 white|0.11174 old|0.08083 lace|0.08083 papaya|0.080535 whip|0.080535 linen|0.077348 beige|0.076816 dim|0.075673 gray|0.075673 dim|0.075673 grey|0.075673 corn|0.071494 silk|0.071494 ivory|0.065172 floral|0.064736 white|0.064736 sea|0.053237 shell|0.053237 blanched|0.050228 almond|0.050228 gray|0.044283 grey|0.044283 light|0.037671 yellow|0.037671 bisque|0.030362 honeydew|0.029858 mint|0.014948 cream|0.014948 snow|0.011921 white|0.0092302 white|0.0088565 smoke|0.0088565 light|0.0032511 golden|0.0032511 rod|0.0032511 yellow|0.0032511  "
		}
	}
}
