{
	"add": {
		"doc": {
			"id": "1ad76550e77412b303346cf008807bd3331c53e78332f6a159360ecc716fcb63",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Castle_mountain_camp_1915.jpg/220px-Castle_mountain_camp_1915.jpg",
				"previous": "During World War I, immigrants from Austria, Hungary, Germany and Ukraine were sent to Banff to work in internment camps. The main camp was located at Castle Mountain, and was moved to Cave and Basin during winter. Much early infrastructure and road construction was done by men of various Slavic origins although Ukrainians constituted a majority of those held in Banff.[12] Historical plaques and a statue erected by the Ukrainian Canadian Civil Liberties Association commemorate those interned at Castle Mountain, and Cave and Basin National Historic Site where an interpretive pavilion dealing with Canada's first national internment operations is scheduled for opening in June 2013.",
				"after": "In 1931, the Government of Canada enacted the Unemployment and Farm Relief Act which provided public works projects in the national parks during the Great Depression. In Banff, workers constructed a new bathhouse and pool at Upper Hot Springs, to supplement Cave and Basin.[12] Other projects involved road building in the park, tasks around the Banff townsite, and construction of a highway connecting Banff and Jasper.[12] In 1934, the Public Works Construction Act was passed, providing continued funding for the public works projects. New projects included construction of a new registration facility at Banff's east gate, and construction of an administrative building in Banff. By 1940, the Icefields Parkway reached the Columbia Icefield area of Banff, and connected Banff and Jasper.[13]",
			"color": "dim|0.40619 gray|0.40619 dim|0.40619 grey|0.40619 gray|0.36146 grey|0.36146 dark|0.11341 gray|0.11341 dark|0.11341 grey|0.11341 black|0.078845 silver|0.025414 light|0.0082678 gray|0.0082678 light|0.0082678 grey|0.0082678 gainsboro|0.004777  "
		}
	}
}
