{
	"add": {
		"doc": {
			"id": "1ada09e7fcc8f56360275818131345450f795f6692b37707b8043aee4683665d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Yingzao_Fashi_1.JPG/220px-Yingzao_Fashi_1.JPG",
				"previous": "The professions of the architect, craftsman, carpenter, and structural engineer were not seen as professionally equal to that of a Confucian scholar-official. Architectural knowledge had been passed down orally for thousands of years in China, in many cases from a father craftsman to his son. Structural engineering and architecture schools were known to have existed during the Song period; one prestigious engineering school was headed by the renowned bridge-builder Cai Xiang (1012–1067) in medieval Fujian province.[198]",
				"after": "Besides existing buildings and technical literature of building manuals, Song dynasty artwork portraying cityscapes and other buildings aid modern-day scholars in their attempts to reconstruct and realize the nuances of Song architecture. Song dynasty artists such as Li Cheng, Fan Kuan, Guo Xi, Zhang Zeduan, Emperor Huizong of Song, and Ma Lin painted close-up depictions of buildings as well as large expanses of cityscapes featuring arched bridges, halls and pavilions, pagoda towers, and distinct Chinese city walls. The scientist and statesman Shen Kuo was known for his criticism of artwork relating to architecture, saying that it was more important for an artist to capture a holistic view of a landscape than it was to focus on the angles and corners of buildings.[199] For example, Shen criticized the work of the painter Li Cheng for failing to observe the principle of \"seeing the small from the viewpoint of the large\" in portraying buildings.[199]",
			"color": "antique|0.30623 white|0.30623 misty|0.15701 rose|0.15701 papaya|0.080767 whip|0.080767 linen|0.076314 bisque|0.076153 blanched|0.070642 almond|0.070642 light|0.047337 gray|0.047337 light|0.047337 grey|0.047337 peach|0.039381 puff|0.039381 gainsboro|0.02945 old|0.024604 lace|0.024604 dim|0.017841 gray|0.017841 dim|0.017841 grey|0.017841 silver|0.017693 dark|0.015903 gray|0.015903 dark|0.015903 grey|0.015903 tan|0.0097831 gray|0.0086249 grey|0.0086249 sea|0.006553 shell|0.006553 corn|0.0057392 silk|0.0057392 wheat|0.0045443  "
		}
	}
}
