{
	"add": {
		"doc": {
			"id": "1ada57188d93cbefc95064d271e157cf97060b93d61ff5557eb121a2ee41b32f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Children_in_playground.jpg/220px-Children_in_playground.jpg",
				"previous": "The first computers were Apple machines brought in by the University of the South Pacific Extension Centre around the early 1980s. The Treasury Department computerised its general ledger in 1986 using NEC personal computers that were IBM PC XT compatible.[citation needed] The Census of Households and Population in 1986 was the first to be processed using a personal computer with the assistance of David Marshall, FAO Adviser on Agricultural Statistics, advising UNFPA Demographer Dr Lawrence Lewis and Niue Government Statistician Bill Vakaafi Motufoou to switch from using manual tabulation cards. In 1987 Statistics Niue got its new personal computer NEC PC AT use for processing the 1986 census data; personnel were sent on training in Japan and New Zealand to use the new computer. The first Computer Policy was developed and adopted in 1988.[citation needed]",
				"after": "In 2003, Niue became the first territory to offer free wireless internet to all its inhabitants.[50] In August 2008 it has been reported that all school students have what is known as the OLPC XO-1, a specialised laptop by the One Laptop per Child project designed for children in the developing world.[51] Niue was also a location of tests for the OpenBTS project, which aims to deliver low-cost GSM base stations built with open source software.[52] In July 2011, Telecom Niue launched pre-paid mobile services (Voice/EDGE – 2.5G) as Rokcell Mobile based on the commercial GSM product of vendor Lemko. Three BTS sites will cover the nation. International roaming is not currently available. The fibre optic cable ring is now completed around the island (FTTC), Internet/ADSL services were rolled out towards the end of 2011.[citation needed]",
			"color": "dark|0.29854 gray|0.29854 dark|0.29854 grey|0.29854 gray|0.2749 grey|0.2749 dim|0.19003 gray|0.19003 dim|0.19003 grey|0.19003 black|0.087593 silver|0.065463 dark|0.037283 olive|0.037283 green|0.037283  "
		}
	}
}
