{
	"add": {
		"doc": {
			"id": "1ae205a1def3640dbe2eb141f45b3c3893fc18913e99e0214d2114c6120d03ca",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Doonerak2.jpg/170px-Doonerak2.jpg",
				"previous": "Marshall started work in 1925 with the Forest Service, where he worked until 1928.[27] Hoping to go to Alaska, he was assigned to the Northern Rocky Mountain Experiment Station at Missoula, Montana, in 1925.[28][29] Marshall's research at the Experimental Station focused on the dynamics of forest regeneration after fires. He had to fight a widespread fire after a July storm started more than 150 fires in Idaho's Kaniksu National Forest.[30] He was put in charge of supporting and provisioning one of the crews led by the Forest Service.[31] As he later recalled, Marshall worked \"18 to 20 hours a day as time-keeper, Chief of Commissary, Camp Boss, and Inspector of the fire line\".[30] Spending time with loggers and fire fighters, and seeing the conditions under which they worked, Marshall learned vital lessons about labor issues and natural resource use.[32] At the Experimental Station Marshall became interested in the unsafe conditions for many working Americans. He began to develop liberal and socialist philosophies.[33]",
				"after": "In 1929, Marshall was 28 years old and less than a year away from completing a PhD in plant pathology at Johns Hopkins University in Baltimore, Maryland, when he made his first trip to Alaska, visiting the upper Koyukuk River and the central Brooks Range.[13] The scientific objective of the trip was to study tree growth at the northern timberline near the Arctic Divide.[34] For his 15-month sojourn in the small town of Wiseman, Alaska, Marshall rented a one-room cabin next to the only roadhouse in the village and furnished it with books, records, a phonograph player, and a writing desk.[35] He placed the desk so that he could sit by the cabin's single window and admire the view of the Koyukuk River and the range of steep, snow-covered mountains in the background. His travels engendered in him a great love for the central Brooks Range in the Alaskan wilderness. Marshall was one of the first to explore much of the range, especially the headwaters of the North fork of the Koyukuk River, where he bestowed the name \"Gates of the Arctic\" on a pair of mountains. On September 11, 1929, Marshall's father Louis died in Zürich, Switzerland at the age of 73. Because their mother had died of cancer in 1916, the four children inherited most of their father's estate, worth several million dollars. Although he became financially independent, Bob Marshall continued to work throughout his life.[36]",
			"color": "black|0.84109 gray|0.025729 grey|0.025729 light|0.025647 slate|0.025647 gray|0.025647 slate|0.023289 gray|0.023289 dim|0.021622 gray|0.021622 dim|0.021622 grey|0.021622 dark|0.021525 gray|0.021525 dark|0.021525 grey|0.021525 tan|0.0094653 silver|0.0090587 light|0.0074486 steel|0.0074486 blue|0.0074486 steel|0.0072697 blue|0.0072697  "
		}
	}
}
