{
	"add": {
		"doc": {
			"id": "1af5d1b2e35d3b4ca69b77c31cbd9e4a4fb85a5a224161d046309d1f1f4932ec",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Tunisair_A320-200_TS-IMM_ZRH_2011-07-16.png/220px-Tunisair_A320-200_TS-IMM_ZRH_2011-07-16.png",
				"previous": "The number of employees had grown to 888 by March 1970 (1970-03). At this time, they had four Caravelles, two Cessna 402s, a DC-3 and a Nord 262, which were used on domestic services and international routes to Algeria, Belgium, France, Germany, the Netherlands,[nb 1] Italy, Libya, Morocco and Switzerland.[12] Tunis Air took delivery of its first Boeing aircraft, a Boeing 727-200, on 12 March 1972;[13] it was put on service on the Tunis–Paris run.[14] On 1 April 1972 (1972-04-01), a Boeing 707 that was leased from Sabena inaugurated the Tunis–London link.[15] The same day, new services to Luxembourg and Jeddah were launched.[16] Late in the year, a second Boeing 727s was ordered for delivery in July 1973 (1973-07).[14] In 1973, a third Boeing 727 was ordered for handover in December that year.[17] A fourth and fifth 727 were ordered in 1974 and 1975.[18][19][20][21] The gradual incorporation of the Boeing 727s permitted Tunisair to replace the Caravelles and to retire the remaining DC-3s.[11]",
				"after": "For the first time in its history, in 1995 the carrier started trading its shares at the Tunis stock exchange when 20% of the stake was floated.[22] Ahmed Smaoui took over as president and director general of the company in March 1997 (1997-03).[23] In January 1999 (1999-01), Abdelmalek Larifthe became the new president. Also in 1999, flights to Amman and Beirut were.[22] At April 2000 (2000-04) the airline had 7259 employees. At this time the fleet comprised one Airbus A300B4-200, two Airbus A319-100s, ten Airbus A320-200s, four Boeing 727-200 Advanced, three Boeing 737-200 Advanced, four Boeing 737-500s and three Boeing 737-600s that served the following destinations: Abu Dhabi, Algiers, Amman, Amsterdam, Athens, Barcelona, Beirut, Berlin, Bilbao, Bordeaux, Bratislava, Brussels, Budapest, Cairo, Casablanca, Copenhagen, Dakar, Damascus, Djerba, Dusseldorf, Frankfurt, Gafsa, Geneva, Graz, Hamburg, Istanbul, Jeddah, Lille, Linz, Lisbon, London, Luxembourg, Lyon, Madrid, Malta, Marseille, Milan, Monastir, Munich, Nice, Nouakchott, Palermo, Paris, Prague, Rome, Salzburg, Sfax, Stockholm, Strasbourg, Tabarka, Toulouse, Tozeur, Tunis, Vienna, Warsaw and Zurich.[6]",
			"color": "steel|0.72334 blue|0.72334 black|0.054525 light|0.039905 gray|0.039905 light|0.039905 grey|0.039905 gainsboro|0.033581 silver|0.028264 dark|0.020577 gray|0.020577 dark|0.020577 grey|0.020577 white|0.012704 smoke|0.012704 gray|0.012234 grey|0.012234 dim|0.0099515 gray|0.0099515 dim|0.0099515 grey|0.0099515 linen|0.0087408 lavender|0.0078982 blush|0.0078982 alice|0.0075693 blue|0.0075693 ghost|0.0075149 white|0.0075149 sea|0.0070258 shell|0.0070258 snow|0.0069363 white|0.0047378  "
		}
	}
}
