{
	"add": {
		"doc": {
			"id": "1b13642a06fed164cd4197a4da0e14b65ea7e1bf198bd34c71a5197f5bf76c25",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/USS_California_1921_H82114.jpg/220px-USS_California_1921_H82114.jpg",
				"previous": "In spite of the lull in battleship building during the World War, the years 1919–1922 saw the threat of a renewed naval arms race between the United Kingdom, Japan and the US. The Battle of Jutland exerted a huge influence over the designs produced in this period. The first ships which fit into this picture are the British Admiral class, designed in 1916. Jutland finally persuaded the Admiralty that lightly armoured battlecruisers were too vulnerable, and therefore the final design of the Admirals incorporated much-increased armour, increasing displacement to 42,000 tons. The initiative in creating the new arms race lay with the Japanese and United States navies. The United States Naval Appropriations Act of 1916 authorized the construction of 156 new ships, including ten battleships and six battlecruisers. For the first time, the United States Navy was threatening the British global lead.[139] This programme was started slowly (in part because of a desire to learn lessons from Jutland), and never fulfilled entirely. The new American ships (the Colorado-class battleships and Lexington-class battlecruisers), took a qualitative step beyond the British Queen Elizabeth class and Admiral classes by mounting 16-inch (406 mm) guns.[140]",
				"after": "At the same time, the Imperial Japanese Navy was finally gaining authorization for its 'eight-eight battlefleet'. The Nagato class, authorized in 1916, carried eight 16-inch guns like their American counterparts. The next year's naval bill authorized two more battleships and two more battlecruisers. The battleships, which became the Tosa class, were to carry ten 16-inch guns. The battlecruisers, the Amagi class, also carried ten 16-inch guns and were designed to be capable of 30 knots, capable of beating both the British Admiral- and the US Navy's Lexington-class battlecruisers.[141]",
			"color": " "
		}
	}
}
