{
	"add": {
		"doc": {
			"id": "1b159c1539cb97420f025627ff481f8ea87df6ed6dd32827d1df9aedd60ebed8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/A380_transport_Port_de_Bordeaux.jpg/220px-A380_transport_Port_de_Bordeaux.jpg",
				"previous": "For the surface movement of large A380 structural components, a complex route known as the Itinéraire à Grand Gabarit was developed. This involved the construction of a fleet of roll-on/roll-off (RORO) ships and barges, the construction of port facilities and the development of new and modified roads to accommodate oversized road convoys.[30] The front and rear fuselage sections are shipped on one of three RORO ships from Hamburg in northern Germany to the United Kingdom.[31] The wings are manufactured at Broughton in North Wales, then transported by barge to Mostyn docks, where the ship adds them to its cargo.[32]",
				"after": "In Saint-Nazaire in western France, the ship exchanges the fuselage sections from Hamburg for larger, assembled sections, some of which include the nose. The ship unloads in Bordeaux. The ship then picks up the belly and tail sections from Construcciones Aeronáuticas SA in Cádiz in southern Spain, and delivers them to Bordeaux. From there, the A380 parts are transported by barge to Langon, and by oversize road convoys to the assembly hall in Toulouse.[33] In order to avoid damage from direct handling, parts are secured in custom jigs carried on self-powered wheeled vehicles.[28]",
			"color": "dim|0.1525 gray|0.1525 dim|0.1525 grey|0.1525 light|0.13753 slate|0.13753 gray|0.13753 dark|0.12606 gray|0.12606 dark|0.12606 grey|0.12606 slate|0.12203 gray|0.12203 gray|0.070235 grey|0.070235 gainsboro|0.049132 light|0.047339 gray|0.047339 light|0.047339 grey|0.047339 silver|0.042995 dark|0.029833 slate|0.029833 gray|0.029833 white|0.026423 smoke|0.026423 alice|0.026407 blue|0.026407 ghost|0.024025 white|0.024025 lavender|0.023107 snow|0.018259 lavender|0.017377 blush|0.017377 azure|0.015901 white|0.015699 light|0.014576 steel|0.014576 blue|0.014576 mint|0.013181 cream|0.013181 sea|0.010213 shell|0.010213 black|0.0047701 floral|0.0043267 white|0.0043267  "
		}
	}
}
