{
	"add": {
		"doc": {
			"id": "1b416413fecc600b1ff0f3684b063d7c1aabb4eec8d3f47b2a3666de70a5e1fd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Flickr_-_The_U.S._Army_-_President_of_Rawanda_visits_son_at_West_Point.jpg/220px-Flickr_-_The_U.S._Army_-_President_of_Rawanda_visits_son_at_West_Point.jpg",
			"previous": [],
				"after": "Cadets have a host of extracurricular activities available, most run by the office of the Directorate of Cadet Activities (DCA).[168] DCA sponsors or operates 113 athletic and non-sport clubs.[169] Many cadets join several clubs during their time at the academy and find their time spent with their clubs a welcome respite from the rigors of cadet life.[170] DCA is responsible for a wide range of activities that provide improved quality of life for cadets, including: three cadet-oriented restaurants,[171] the Cadet Store,[172] and the Howitzer and Bugle Notes.[173] The Howitzer is the annual yearbook, while Bugle Notes, also known as the \"plebe bible,\" is the manual of plebe knowledge. Plebe knowledge is a lengthy collection of traditions, songs, poems, anecdotes, and facts about the academy, the army, the Old Corps, and the rivalry with Navy that all plebes must memorize during cadet basic training.[174][175][176] During plebe year, plebes may be asked, and are expected to answer, any inquiry about plebe knowledge asked by upper class cadets. Other knowledge is historical in nature, including information as found in Bugle Notes.[177] However, some knowledge changes daily, such as \"the days\" (a running list of the number of days until important academy events),[178] the menu in the mess hall for the day, or the lead stories in The New York Times.[177]",
			"color": "dim|0.33247 gray|0.33247 dim|0.33247 grey|0.33247 gray|0.16007 grey|0.16007 black|0.084129 dark|0.053454 gray|0.053454 dark|0.053454 grey|0.053454 tan|0.038622 silver|0.033398 light|0.027403 gray|0.027403 light|0.027403 grey|0.027403 gainsboro|0.02409 antique|0.02107 white|0.02107 linen|0.017451 beige|0.015732 sea|0.015521 shell|0.015521 white|0.014422 smoke|0.014422 floral|0.014197 white|0.014197 old|0.012968 lace|0.012968 papaya|0.010319 whip|0.010319 snow|0.0095458 ivory|0.0090397 mint|0.0088529 cream|0.0088529  "
		}
	}
}
