{
	"add": {
		"doc": {
			"id": "1b4a48ec9c7e5f725b77800e16acbb9d300f639badccaf96cc3aae094e1570f0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Sunset_over_the_marsh_at_Cardinal_Cove_-_NOAA.jpg/250px-Sunset_over_the_marsh_at_Cardinal_Cove_-_NOAA.jpg",
				"previous": "Maryland is bounded on its north by Pennsylvania, on its west by West Virginia, on its east by Delaware and the Atlantic Ocean, and on its south, across the Potomac River, by West Virginia and Virginia. The mid-portion of this border is interrupted by Washington, D.C., which sits on land originally part of Montgomery and Prince George's counties, including the town of Georgetown, Maryland, that was ceded to the Federal Government in 1790 to form the District of Columbia. (The Commonwealth of Virginia gave land south of the Potomac, including the town of Alexandria, Virginia, however Virginia retroceded its portion in 1846). The Chesapeake Bay nearly bisects the state and the counties east of the bay are known collectively as the Eastern Shore.",
				"after": "Most of the state's waterways are part of the Chesapeake Bay watershed, with the exceptions of a tiny portion of extreme western Garrett County (drained by the Youghiogheny River as part of the watershed of the Mississippi River), the eastern half of Worcester County (which drains into Maryland's Atlantic coastal bays), and a small portion of the state's northeast corner (which drains into the Delaware River watershed). So prominent is the Chesapeake in Maryland's geography and economic life that there has been periodic agitation to change the state's official nickname to the Bay State, a nickname that has been used by Massachusetts for decades.",
			"color": "black|0.32457 sandy|0.18692 brown|0.18692 pale|0.14555 golden|0.14555 rod|0.14555 khaki|0.12134 navajo|0.046815 white|0.046815 moccasin|0.037849 light|0.036884 salmon|0.036884 lemon|0.029083 chiffon|0.029083 wheat|0.019267 dark|0.012443 salmon|0.012443 light|0.0072825 golden|0.0072825 rod|0.0072825 yellow|0.0072825 burly|0.0069123 wood|0.0069123 peach|0.0057811 puff|0.0057811  "
		}
	}
}
