{
	"add": {
		"doc": {
			"id": "1b4e1a3c68dd5c1da2b394d93f20c4785122795e361c4babd1ad03be33dd7a2f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Logan_Airport_Terminal_A_at_night.jpg/220px-Logan_Airport_Terminal_A_at_night.jpg",
				"previous": "Logan International Airport has 103 gate positions total[37] divided among four terminals, A, B, C, and E. All terminals are connected by pre-security shuttle buses, as well as between Terminals A, B and E via moving walkways pre-security.[38] Moving walkways also connect the terminals to a central parking garage designed for consolidated service between all 4 terminals and the garage itself.[39] Massport ultimately plans to connect all terminals and gates post-security allowing for seamless connections between flights.[40] The concession program at the airport is developed, leased and managed by AirMall USA (formerly BAA USA) in Terminals B and E and Westfield Concession Management Inc. in Terminals A and C.",
				"after": "Terminal A, which replaced a 1970s-era building designed by Minoru Yamasaki once occupied by the now-defunct Eastern Airlines,[41] opened to passengers on March 16, 2005. The terminal, designed by Hellmuth, Obata and Kassabaum,[42] is divided into a main terminal (housing gates A1–A12) and a satellite building (housing gates A13–A22). The main terminal and the satellite building are connected through an underground walkway.[43] Terminal A was originally intended to be entirely occupied by Delta, however, Delta returned 11 of the gates to Massport for financial reasons. Terminal A features a Delta airline lounge (Delta Sky Club) on the third floor of the satellite building.[44]",
			"color": "dim|0.33783 gray|0.33783 dim|0.33783 grey|0.33783 gray|0.27684 grey|0.27684 dark|0.071726 gray|0.071726 dark|0.071726 grey|0.071726 silver|0.052076 black|0.051368 light|0.043746 gray|0.043746 light|0.043746 grey|0.043746 gainsboro|0.034686 slate|0.027681 gray|0.027681 linen|0.013857 light|0.013086 slate|0.013086 gray|0.013086 dark|0.01004 slate|0.01004 gray|0.01004 antique|0.0096535 white|0.0096535 sea|0.0073707 shell|0.0073707 white|0.006512 smoke|0.006512 old|0.0062657 lace|0.0062657 floral|0.0050072 white|0.0050072 dark|0.0046855 olive|0.0046855 green|0.0046855  "
		}
	}
}
