{
	"add": {
		"doc": {
			"id": "1b56fc5f498d67c0c9558797023761235c5c0a4f8161d72d4cb363420d7d20e9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/LORpresscon.jpg/220px-LORpresscon.jpg",
				"previous": "When Shea was hired by NASA, President John F. Kennedy's commitment to landing men on the Moon was still only seven months old, and many of the major decisions that shaped the Apollo program were yet to be made. Foremost among these was the mode that NASA would use to land on the Moon. When Shea first began to consider the issue in 1962, most NASA engineers and managers—including Wernher von Braun, the director of the Marshall Space Flight Center—favored either an approach called direct ascent, where the Apollo spacecraft would land on the Moon and return to the Earth as one unit, or Earth orbit rendezvous, where the spacecraft would be assembled while still in orbit around the Earth. However, dissenters such as John Houbolt, a Langley engineer, favored an approach that was then considered to be more risky: lunar orbit rendezvous, in which two spacecraft would be used. A command/service module (CSM) would remain in orbit around the Moon, while a lunar module would land on the Moon and return to dock with the CSM in lunar orbit, then be discarded.[9]",
				"after": "In November 1961, John Houbolt had sent a paper advocating lunar orbit rendezvous (LOR) to Robert Seamans, the deputy administrator of NASA. As Shea remembered, \"Seamans gave a copy of Houbolt's letter to Brainerd Holmes [the director of OMSF]. Holmes put the letter on my desk and said: Figure it out.\"[10] Shea became involved in the lunar orbit rendezvous decision as a result of this letter. While he began with a mild preference for earth orbit rendezvous, Shea \"prided himself\", according to space historians Murray and Cox, \"on going wherever the data took him\".[11] In this case, the data took him to NASA's Langley Research Center in Hampton, Virginia, where he met with John Houbolt and with the Space Task Group, and became convinced that LOR was an option worth considering.[12]",
			"color": " "
		}
	}
}
