{
	"add": {
		"doc": {
			"id": "1b693c4e2bfd23037c161c2c0c1864438c6dca885d8ae9bce59f0a461e3e97f1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/DeHavilland_DH50_biplane.jpg/220px-DeHavilland_DH50_biplane.jpg",
				"previous": "After World War I experienced fighter pilots were eager to show off their new skills. Many American pilots became barnstormers, flying into small towns across the country and showing off their flying abilities, as well as taking paying passengers for rides. Eventually the barnstormers grouped into more organized displays. Air shows sprang up around the country, with air races, acrobatic stunts, and feats of air superiority. The air races drove engine and airframe development—the Schneider Trophy, for example, led to a series of ever faster and sleeker monoplane designs culminating in the Supermarine S.6B. With pilots competing for cash prizes, there was an incentive to go faster. Amelia Earhart was perhaps the most famous of those on the barnstorming/air show circuit. She was also the first female pilot to achieve records such as crossing of the Atlantic and Pacific Oceans.",
				"after": "Other prizes, for distance and speed records, also drove development forwards. For example on June 14, 1919, Captain John Alcock and Lieutenant Arthur Brown co-piloted a Vickers Vimy non-stop from St. John's, Newfoundland to Clifden, Ireland, winning the £13,000 ($65,000)[74] Northcliffe prize. The first aerial crossing of the South Atlantic (the first using astronomical navigation only) was made by the Portuguese naval aviators Gago Coutinho and Sacadura Cabral in 1922, from Lisbon, Portugal, to Rio de Janeiro, Brazil, in an aircraft specifically fitted for himself with an artificial horizon for aeronautical use, an invention that revolutionized air navigation at the time.[75] Five years later Charles Lindbergh took the Orteig Prize of $25,000 for the first solo non-stop crossing of the Atlantic. Months after Lindbergh, Paul Redfern was the first to solo the Caribbean Sea and was last seen flying over Venezuela.",
			"color": " "
		}
	}
}
