{
	"add": {
		"doc": {
			"id": "1b776dd71266bd2102f33676fa9d150902a9dd2be78d959c7b6ab4b755c317fd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/RudderBereFerrersBenchEnd.jpg/220px-RudderBereFerrersBenchEnd.jpg",
				"previous": "Oars mounted on the side of ships evolved into quarter rudders, which were used from antiquity until the end of the Middle Ages in Europe. As the size of ships and the height of the freeboards increased, quarter-rudders became unwieldy and were replaced by the more sturdy stern-mounted rudders with pintle and gudgeon attachment. While stern-mounted rudders were found in Europe on a wide range of vessels since Roman times, including light war galleys in Mediterranean,[40] the oldest known depiction of a pintle-and-gudgeon rudder can be found on church carvings of Zedelgem and Winchester dating to around 1180.[9][33]",
				"after": "Historically, the radical concept of the medieval pintle-and-gudgeon rudder did not come as a single invention into being. It presented rather a combination of ideas which each had been long around before: rudders mounted on the stern, iron hinges and the straight sternpost of northern European ships.[41] While earlier rudders were mounted on the stern by the way of rudderposts or tackles, the iron hinges allowed for the first time to attach the rudder to the entire length of the sternpost in a really permanent fashion.[42] However, its full potential could only to be realized after the introduction of the vertical sternpost and the full-rigged ship in the 14th century.[41] From the age of discovery onwards, European ships with pintle-and-gudgeon rudders sailed successfully on all seven seas. Many historians' consensus considered the technology of stern-mounted rudder in Europe and Islam World, which was introduced by travelers in the Middle Ages, was transferred from China.[7][8][33] However, Lawrence Mott in his master thesis stated that the method of attachment for rudders in the Chinese and European worlds differed from each other, leading him to doubt the spread of the Chinese system of attachment [43]",
			"color": " "
		}
	}
}
