{
	"add": {
		"doc": {
			"id": "1b990a3faeaede0f37d87b9c2be677a761c3215071b88ef04ee783aec9b99dea",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Falconry_sport_of_kings_%281920%29_Peregrine_falcon_striking_red_grouse.png/220px-Falconry_sport_of_kings_%281920%29_Peregrine_falcon_striking_red_grouse.png",
			"previous": [],
				"after": "The peregrine falcon is a highly admired falconry bird, and has been used in falconry for more than 3,000 years, beginning with nomads in central Asia.[64] Its advantages in falconry include not only its athleticism and eagerness to hunt, but an equitable disposition that leads to it being one of the easier falcons to train.[72] The peregrine falcon has the additional advantage of a natural flight style of circling above the falconer (\"waiting on\") for game to be flushed, and then performing an effective and exciting high speed diving stoop to take the quarry. The speed and energy of the stoop allows the falcon to catch fast flying birds, and to deliver a knock out blow with a fist-like clenched talon against game that may be much larger than itself.[16] Additionally the versatility of the species, with agility allowing capture of smaller birds and a strength and attacking style allowing capture of game much larger than themselves, combined with the wide size range of the many peregrine subspecies, means there is a subspecies suitable to almost any size and type of game bird. This size range, evolved to fit various environments and prey species, is from the larger females of the largest subspecies to the smaller males of the smallest subspecies, approximately five to one (approximately 1500 g to 300 g). The males of smaller and medium-sized subspecies, and the females of the smaller subspecies, excel in the taking of swift and agile small game birds such as dove, quail, and smaller ducks. The females of the larger subspecies are capable of taking large and powerful game birds such as the largest of duck species, pheasant, and grouse.",
			"color": "black|0.19809 dark|0.1297 khaki|0.1297 light|0.054873 golden|0.054873 rod|0.054873 yellow|0.054873 lemon|0.053342 chiffon|0.053342 dark|0.046811 golden|0.046811 rod|0.046811 pale|0.045359 golden|0.045359 rod|0.045359 corn|0.042234 silk|0.042234 light|0.042115 yellow|0.042115 blanched|0.041583 almond|0.041583 olive|0.039772 beige|0.037944 papaya|0.036368 whip|0.036368 wheat|0.033144 antique|0.027918 white|0.027918 golden|0.02304 rod|0.02304 tan|0.02215 dim|0.021925 gray|0.021925 dim|0.021925 grey|0.021925 khaki|0.020848 bisque|0.016177 gray|0.01127 grey|0.01127 burly|0.010134 wood|0.010134 moccasin|0.009098  "
		}
	}
}
