{
	"add": {
		"doc": {
			"id": "1ba470c2a81bdc767fc554e47b71e1640173b259a588230dbbcb32e3fe9e39d6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Relativity_of_Simultaneity.svg/220px-Relativity_of_Simultaneity.svg.png",
				"previous": "Time has historically been closely related with space, the two together merging into spacetime in Einstein's special relativity and general relativity. According to these theories, the concept of time depends on the spatial reference frame of the observer, and the human perception as well as the measurement by instruments such as clocks are different for observers in relative motion. For example, if a spaceship carrying a clock flies through space at (very nearly) the speed of light, its crew does not notice a change in the speed of time on board their vessel because everything traveling at the same speed slows down at the same rate (including the clock, the crew's thought processes, and the functions of their bodies). However, to a stationary observer watching the spaceship fly by, the spaceship appears flattened in the direction it is traveling and the clock on board the spaceship appears to move very slowly. On the other hand, the crew on board the spaceship also perceives the observer as slowed down and flattened along the spaceship's direction of travel, because both are moving at very nearly the speed of light relative to each other. Because the outside universe appears flattened to the spaceship, the crew perceives themselves as quickly traveling between regions of space that (to the stationary observer) are many light years apart. This is reconciled by the fact that the crew's perception of time is different from the stationary observer's; what seems like seconds to the crew might be hundreds of years to the stationary observer. In either case, however, causality remains unchanged: the past is the set of events that can send light signals to an entity and the future is the set of events to which an entity can send light signals.[70][71][72]",
				"after": "Einstein showed in his thought experiments that people travelling at different speeds, while agreeing on cause and effect, measure different time separations between events, and can even observe different chronological orderings between non-causally related events. Though these effects are typically minute in the human experience, the effect becomes much more pronounced for objects moving at speeds approaching the speed of light. Many subatomic particles exist for only a fixed fraction of a second in a lab relatively at rest, but some that travel close to the speed of light can be measured to travel farther and survive much longer than expected (a muon is one example). According to the special theory of relativity, in the high-speed particle's frame of reference, it exists, on the average, for a standard amount of time known as its mean lifetime, and the distance it travels in that time is zero, because its velocity is zero. Relative to a frame of reference at rest, time seems to \"slow down\" for the particle. Relative to the high-speed particle, distances seem to shorten. Einstein showed how both temporal and spatial dimensions can be altered (or \"warped\") by high-speed motion.",
			"color": "black|0.9149 lime|0.023916 green|0.023916 green|0.009369 dark|0.0053118 red|0.0053118 medium|0.0051249 blue|0.0051249 dark|0.0049114 slate|0.0049114 blue|0.0049114 maroon|0.0048313  "
		}
	}
}
