{
	"add": {
		"doc": {
			"id": "1baf5d47759a2012dcd4620d59866a4b01d7885e3275caf105360fce2dd80924",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Henry_Fuseli_rendering_of_Hamlet_and_his_father%27s_Ghost.JPG/220px-Henry_Fuseli_rendering_of_Hamlet_and_his_father%27s_Ghost.JPG",
				"previous": "Shakespeare's early classical and Italianate comedies, containing tight double plots and precise comic sequences, give way in the mid-1590s to the romantic atmosphere of his most acclaimed comedies.[92] A Midsummer Night's Dream is a witty mixture of romance, fairy magic, and comic lowlife scenes.[93] Shakespeare's next comedy, the equally romantic Merchant of Venice, contains a portrayal of the vengeful Jewish moneylender Shylock, which reflects Elizabethan views but may appear derogatory to modern audiences.[94] The wit and wordplay of Much Ado About Nothing,[95] the charming rural setting of As You Like It, and the lively merrymaking of Twelfth Night complete Shakespeare's sequence of great comedies.[96] After the lyrical Richard II, written almost entirely in verse, Shakespeare introduced prose comedy into the histories of the late 1590s, Henry IV, parts 1 and 2, and Henry V. His characters become more complex and tender as he switches deftly between comic and serious scenes, prose and poetry, and achieves the narrative variety of his mature work.[97] This period begins and ends with two tragedies: Romeo and Juliet, the famous romantic tragedy of sexually charged adolescence, love, and death;[98] and Julius Caesar—based on Sir Thomas North's 1579 translation of Plutarch's Parallel Lives—which introduced a new kind of drama.[99] According to Shakespearean scholar James Shapiro, in Julius Caesar \"the various strands of politics, character, inwardness, contemporary events, even Shakespeare's own reflections on the act of writing, began to infuse each other\".[100]",
				"after": "In the early 17th century, Shakespeare wrote the so-called \"problem plays\" Measure for Measure, Troilus and Cressida, and All's Well That Ends Well and a number of his best known tragedies.[101] Many critics believe that Shakespeare's greatest tragedies represent the peak of his art. The titular hero of one of Shakespeare's most famous tragedies, Hamlet, has probably been discussed more than any other Shakespearean character, especially for his famous soliloquy which begins \"To be or not to be; that is the question\".[102] Unlike the introverted Hamlet, whose fatal flaw is hesitation, the heroes of the tragedies that followed, Othello and King Lear, are undone by hasty errors of judgement.[103] The plots of Shakespeare's tragedies often hinge on such fatal errors or flaws, which overturn order and destroy the hero and those he loves.[104] In Othello, the villain Iago stokes Othello's sexual jealousy to the point where he murders the innocent wife who loves him.[105] In King Lear, the old king commits the tragic error of giving up his powers, initiating the events which lead to the torture and blinding of the Earl of Gloucester and the murder of Lear's youngest daughter Cordelia. According to the critic Frank Kermode, \"the play-offers neither its good characters nor its audience any relief from its cruelty\".[106] In Macbeth, the shortest and most compressed of Shakespeare's tragedies,[107] uncontrollable ambition incites Macbeth and his wife, Lady Macbeth, to murder the rightful king and usurp the throne, until their own guilt destroys them in turn.[108] In this play, Shakespeare adds a supernatural element to the tragic structure. His last major tragedies, Antony and Cleopatra and Coriolanus, contain some of Shakespeare's finest poetry and were considered his most successful tragedies by the poet and critic T. S. Eliot.[109]",
			"color": "dim|0.24819 gray|0.24819 dim|0.24819 grey|0.24819 dark|0.21174 gray|0.21174 dark|0.21174 grey|0.21174 gray|0.17732 grey|0.17732 silver|0.10509 light|0.071367 gray|0.071367 light|0.071367 grey|0.071367 gainsboro|0.052703 black|0.01465 white|0.0134 smoke|0.0134 linen|0.012581 sea|0.010305 shell|0.010305 floral|0.0085517 white|0.0085517 snow|0.008382 mint|0.0074008 cream|0.0074008 white|0.0067451 ghost|0.0059293 white|0.0059293 alice|0.0053081 blue|0.0053081 old|0.0052883 lace|0.0052883 azure|0.0049976 lavender|0.0044817 blush|0.0044817 ivory|0.0043542 slate|0.0037982 gray|0.0037982  "
		}
	}
}
