{
	"add": {
		"doc": {
			"id": "1bc1cc965f2daf57fac1feb1bd93a00c05174519ab77550d5cdda16921a3d62f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Cansenate.jpg/220px-Cansenate.jpg",
				"previous": "The direct participation of the royal and viceroyal figures in areas of governance is limited.[103][107][108] In practice, their use of the executive powers is directed by the Cabinet, a committee of ministers of the Crown responsible to the elected House of Commons and chosen and headed by the Prime Minister of Canada (at present Stephen Harper),[109] the head of government. The governor general or monarch may, though, in certain crisis situations exercise their power without ministerial advice.[107] To ensure the stability of government, the governor general will usually appoint as prime minister the person who is the current leader of the political party that can obtain the confidence of a plurality in the House of Commons.[110] The Prime Minister's Office (PMO) is thus one of the most powerful institutions in government, initiating most legislation for parliamentary approval and selecting for appointment by the Crown, besides the aforementioned, the governor general, lieutenant governors, senators, federal court judges, and heads of Crown corporations and government agencies.[107] The leader of the party with the second-most seats usually becomes the Leader of Her Majesty's Loyal Opposition (presently Thomas Mulcair) and is part of an adversarial parliamentary system intended to keep the government in check.[111]",
				"after": "Each of the 308 members of parliament in the House of Commons is elected by simple plurality in an electoral district or riding. General elections must be called by the governor general, either on the advice of the prime minister, within four years of the previous election, or if the government loses a confidence vote in the House.[112] The 105 members of the Senate, whose seats are apportioned on a regional basis, serve until age 75.[113] Five parties had representatives elected to the federal parliament in the 2011 elections: the Conservative Party of Canada (governing party), the New Democratic Party (the Official Opposition), the Liberal Party of Canada, the Bloc Québécois, and the Green Party of Canada. The list of historical parties with elected representation is substantial.",
			"color": "black|0.82872 dark|0.057858 red|0.057858 maroon|0.039825 saddle|0.032567 brown|0.032567 firebrick|0.013714 sienna|0.0070254  "
		}
	}
}
