{
	"add": {
		"doc": {
			"id": "1bcdb011025caa631d2aa01229f40824e0a3394fc127ef0c8849f2443798d781",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Glastonbury_%28part_of%29_from_the_tor_arp.jpg/220px-Glastonbury_%28part_of%29_from_the_tor_arp.jpg",
				"previous": "The area continued to be inhabited during the Bronze Age, when the population supported itself largely by hunting and fishing in the surrounding marshes, living on artificial islands connected by wooden causeways on wooden piles. There have been many finds of metalwork during peat cutting, which may have been devotional offerings. Brent Knoll has been settled by people since at least the Bronze Age. It is the site of an Iron Age hill fort known as Brent Knoll Camp, with multiple ramparts (multivallate) following the contours of the hill.[82] Several settlements and hill forts were built on the natural \"islands\" of slightly raised land, including Brent Knoll, Glastonbury, and the low range of the Polden Hills. According to legend Ider son of Nuth, who was one of King Arthur's knights, went to the Mount of Frogs on a quest to slay three giants who lived there.[83][84][85] The fort has been claimed as the site of the Battle of Mons Badonicus.[86]",
				"after": "Sea salt was extracted during the Roman period, and a string of settlements were set up along the Polden Hills. Some possible settlement sites are also known in the Draycott and Cheddar Moors and around Highbridge.[87] The discovery at Shapwick of 9,238 silver Roman coins,[88][89] the second largest hoard ever found from the Roman Empire included coins dated from as early as 31–30 BC up until 224 AD.[90] The hoard also contained two rare coins which had not been discovered in Britain before,[89] and the largest number of silver denarii ever found in Britain.[88][91]",
			"color": "tan|0.18296 black|0.14956 dim|0.14246 gray|0.14246 dim|0.14246 grey|0.14246 gray|0.10602 grey|0.10602 slate|0.094913 gray|0.094913 light|0.064081 slate|0.064081 gray|0.064081 dark|0.044989 gray|0.044989 dark|0.044989 grey|0.044989 dark|0.04322 slate|0.04322 gray|0.04322 dark|0.042501 olive|0.042501 green|0.042501 burly|0.039616 wood|0.039616 steel|0.035068 blue|0.035068 rosy|0.014027 brown|0.014027 silver|0.012369  "
		}
	}
}
