{
	"add": {
		"doc": {
			"id": "1bd14760c850cfd5c6137a5e71034be444f93e90733ee5d8fe1a77848fc0460b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/UPS_Airlines_Boeing_767-34AF_%28ER%29_%28N315UP_27743_640%29_%285680291250%29.jpg/220px-UPS_Airlines_Boeing_767-34AF_%28ER%29_%28N315UP_27743_640%29_%285680291250%29.jpg",
				"previous": "In 1975, UPS started its first international operations as it moved into Canada; the next year, it started service in Germany.[5] As UPS had become a truly international company, the need for its own fleet of aircraft was becoming imminent rather than relying on commercial flights. Additionally, competitor Federal Express, with its own jet fleet, was making inroads on UPS and had become profitable for the first time in 1976. In 1978, the Airline Deregulation Act gave UPS a significant opportunity: the company could now establish its own airline and flying from city to city would require far fewer legislative hurdles, as the federal government now encouraged competition between airlines. In 1980, UPS opened its first major hub, located in Louisville, Kentucky. The location was chosen largely because it is three hours flying distance (by jet) from the majority of the continental United States. In addition, Louisville has relatively mild weather and is at the westernmost point of the Eastern time zone. Also in the early 1980s, the company began acquiring a fleet of jet aircraft recently retired from commercial aircraft duty; it was composed of Douglas DC-8s, Boeing 727-100s, and Boeing 747-100s.",
				"after": "In 1988, UPS Airlines was founded; at the time of its founding, UPS had a route network serving 41 countries connecting the United States to Asia and Europe. During the 1990s, the airline expanded its jet fleet with all-new aircraft. The first of its 75 Boeing 757-200s was delivered starting in 1987, while 32 767-300s were delivered beginning in 1995. In the 1990s, the airline began to expand its network beyond the Louisville hub with facilities in Rockford, Illinois; Philadelphia; Dallas/Fort Worth; Columbia, South Carolina; and Ontario, California.",
			"color": "light|0.15732 slate|0.15732 gray|0.15732 silver|0.15019 slate|0.14515 gray|0.14515 light|0.12255 gray|0.12255 light|0.12255 grey|0.12255 dark|0.11297 gray|0.11297 dark|0.11297 grey|0.11297 gainsboro|0.086806 gray|0.052879 grey|0.052879 tan|0.030598 light|0.014563 steel|0.014563 blue|0.014563 burly|0.010692 wood|0.010692 lavender|0.0097564 dim|0.0096122 gray|0.0096122 dim|0.0096122 grey|0.0096122 white|0.0081317 smoke|0.0081317 ghost|0.0068853 white|0.0068853 alice|0.0064794 blue|0.0064794 snow|0.006433 sea|0.0062929 shell|0.0062929 thistle|0.0057324 white|0.0057209 lavender|0.0054658 blush|0.0054658 linen|0.0054255 floral|0.005034 white|0.005034 mint|0.0050255 cream|0.0050255 azure|0.0048862 rosy|0.0038948 brown|0.0038948  "
		}
	}
}
