{
	"add": {
		"doc": {
			"id": "1bd8aceb6b3f9d59645d1493f4eaaa5fdc76eedabb3c187145bc7759e8a75430",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Theoderic_Quarter_Siliqua_80000847.jpg/220px-Theoderic_Quarter_Siliqua_80000847.jpg",
				"previous": "The political structure of Western Europe changed with the end of the united Roman Empire. Although the movements of peoples during this period are usually described as \"invasions\", they were not just military expeditions but migrations of entire peoples into the empire. Such movements were aided by the refusal of the western Roman elites to support the army or pay the taxes that would have allowed the military to suppress the migration.[39] The emperors of the 5th century were often controlled by military strongmen such as Stilicho (d. 408), Aspar (d. 471), Ricimer (d. 472), or Gundobad (d. 516), who were partly or fully of non-Roman background. When the line of western emperors ceased, many of the kings who replaced them were from the same background. Intermarriage between the new kings and the Roman elites was common.[40] This led to a fusion of Roman culture with the customs of the invading tribes, including the popular assemblies that allowed free male tribal members more say in political matters than was common in the Roman state.[41] Material artefacts left by the Romans and the invaders are often similar, and tribal items were often modelled on Roman objects.[42] Much of the scholarly and written culture of the new kingdoms was also based on Roman intellectual traditions.[43] An important difference was the gradual loss of tax revenue by the new polities. Many of the new political entities no longer supported their armies through taxes, instead relying on granting them land or rents. This meant there was less need for large tax revenues and so the taxation systems decayed.[44] Warfare was common between and within the kingdoms. Slavery declined as the supply weakened, and society became more rural.[45][F]",
				"after": "Between the 5th and 8th centuries, new peoples and powerful individuals filled the political void left by Roman centralised government.[43] The Ostrogoths settled in Italy in the late 5th century under Theodoric (d. 526) and set up a kingdom marked by its co-operation between the Italians and the Ostrogoths, at least until the last years of Theodoric's reign.[47] The Burgundians settled in Gaul, and after an earlier realm was destroyed by the Huns in 436 formed a new kingdom in the 440s. Between today's Geneva and Lyon, it grew to become the powerful realm of Burgundy in the late 5th and early 6th centuries.[48] In northern Gaul, the Franks and Britons set up small polities. The Frankish Kingdom was centred in north-eastern Gaul, and the first king of whom much is known is Childeric (d. 481).[G] Under Childeric's son Clovis (r. 509–511), the Frankish kingdom expanded and converted to Christianity. Britons, related to the natives of Britannia—modern-day Great Britain—settled in what is now Brittany.[50][H] Other monarchies were established by the Visigoths in Iberia, the Suevi in north-western Iberia, and the Vandals in North Africa.[48] In the 6th century, the Lombards settled in northern Italy, replacing the Ostrogothic kingdom with a grouping of duchies that occasionally selected a king to rule over them all. By the late 6th century this arrangement had been replaced by a permanent monarchy.[51]",
			"color": "dim|0.28546 gray|0.28546 dim|0.28546 grey|0.28546 gray|0.26579 grey|0.26579 dark|0.17225 gray|0.17225 dark|0.17225 grey|0.17225 silver|0.083981 light|0.053538 gray|0.053538 light|0.053538 grey|0.053538 gainsboro|0.039101 linen|0.014588 white|0.012415 smoke|0.012415 sea|0.011027 shell|0.011027 floral|0.0091932 white|0.0091932 old|0.0086382 lace|0.0086382 snow|0.0085608 mint|0.0075538 cream|0.0075538 white|0.006766 ivory|0.0057737 black|0.0047817 ghost|0.003696 white|0.003696  "
		}
	}
}
