{
	"add": {
		"doc": {
			"id": "1be89b21042ecd441aa2a40939c6c55a779f95f0fcbf0d4125cd36f60da88347",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/LockeEssay.jpg/200px-LockeEssay.jpg",
				"previous": "Locke dedicates the bulk of Some Thoughts Concerning Education to explaining how to instill virtue in children. He defines virtue as a combination of self-denial and rationality: \"that a man is able to deny himself his own desires, cross his own inclinations, and purely follow what reason directs as best, though the appetite lean the other way\" (Locke's emphasis).[25] Future virtuous adults must be able not only to practice self-denial but also to see the rational path. Locke was convinced that children could reason early in life and that parents should address them as reasoning beings. Moreover, he argues that parents should, above all, attempt to create a \"habit\" of thinking rationally in their children.[26] Locke continually emphasises habit over rule—children should internalise the habit of reasoning rather than memorise a complex set of prohibitions. This focus on rationality and habit corresponds to two of Locke's concerns in the Essay Concerning Human Understanding. Throughout the Essay, Locke bemoans the irrationality of the majority and their inability, because of the authority of custom, to change or forfeit long-held beliefs.[27] His attempt to solve this problem is not only to treat children as rational beings but also to create a disciplinary system founded on esteem and disgrace rather than on rewards and punishments.[28] For Locke, rewards such as sweets and punishments such as beatings turn children into sensualists rather than rationalists; such sensations arouse passions rather than reason.[29] He argues that \"such a sort of slavish discipline makes a slavish temper\" (Locke's emphasis).[30]",
				"after": "What is important to understand is what exactly Locke means when he advises parents to treat their children as reasoning beings. Locke first highlights that children \"love to be treated as Rational Creatures,\" thus parents should treat them as such. Tarcov argues that this suggests children can be considered rational only in that they respond to the desire to be treated as reasoning creatures and that they are \"motivated only [by] rewards and punishments\" to achieve that goal.[31]",
			"color": "wheat|0.18471 bisque|0.10867 moccasin|0.10447 tan|0.092897 peach|0.08554 puff|0.08554 navajo|0.084289 white|0.084289 blanched|0.080377 almond|0.080377 papaya|0.035658 whip|0.035658 lemon|0.026002 chiffon|0.026002 gray|0.022794 grey|0.022794 antique|0.021606 white|0.021606 light|0.019269 golden|0.019269 rod|0.019269 yellow|0.019269 dim|0.017937 gray|0.017937 dim|0.017937 grey|0.017937 corn|0.017517 silk|0.017517 dark|0.016831 gray|0.016831 dark|0.016831 grey|0.016831 beige|0.014325 pale|0.012218 golden|0.012218 rod|0.012218 light|0.010578 yellow|0.010578 silver|0.0086791 old|0.0060887 lace|0.0060887 burly|0.0048724 wood|0.0048724 black|0.0048435 light|0.0042831 gray|0.0042831 light|0.0042831 grey|0.0042831 linen|0.0037285  "
		}
	}
}
