{
	"add": {
		"doc": {
			"id": "1bf121f0e223cece653f38f47ca978f9f2b30bebad92e8254b1a26f192ce29aa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Puerto_Rico_Capitol.JPG/220px-Puerto_Rico_Capitol.JPG",
				"previous": "Constitutionally, Puerto Rico is subject to the plenary powers of the United States Congress under the territorial clause of Article IV of the U.S. Constitution.[107] Laws enacted at the federal level in the United States apply to Puerto Rico as well, regardless of its political status. Their residents, however, do not have voting representation in the U.S. Congress. Like the different states of the United States, Puerto Rico lacks \"the full sovereignty of an independent nation\", for example, the power to manage its \"external relations with other nations\", which is held by the U.S. federal government. The Supreme Court of the United States has indicated that once the U.S. Constitution has been extended to an area (by Congress or the courts), its coverage is irrevocable. To hold that the political branches may switch the Constitution on or off at will would lead to a regime in which they, not this Court, say \"what the law is.\".[108]",
				"after": "Puerto Ricans \"were collectively made U.S. citizens\" in 1917 as a result of the Jones-Shafroth Act.[109] However, U.S. citizens residing in Puerto Rico cannot vote for the U.S. president, though both major parties, Republican and Democrat, run primary elections in Puerto Rico to send delegates to vote on a presidential candidate. Since Puerto Rico is an unincorporated territory (see above) and not a U.S. state, the United States Constitution does not fully enfranchise US citizens residing in Puerto Rico.[91][110] (See also: \"Voting rights in Puerto Rico\"). Despite their American citizenship, however, only the \"fundamental rights\" under the federal constitution apply to Puerto Ricans. Various other U.S Supreme Court decisions have held which rights apply in Puerto Rico and which ones do not. Puerto Ricans have a long history of service in the U.S. armed forces and, since 1917, they have been included in the U.S. compulsory draft whenever it has been in effect.",
			"color": "gray|0.25788 grey|0.25788 silver|0.20594 dark|0.19923 gray|0.19923 dark|0.19923 grey|0.19923 dim|0.14143 gray|0.14143 dim|0.14143 grey|0.14143 light|0.084658 gray|0.084658 light|0.084658 grey|0.084658 gainsboro|0.045026 black|0.034899 misty|0.0044646 rose|0.0044646 linen|0.0041816 antique|0.0039107 white|0.0039107  "
		}
	}
}
