{
	"add": {
		"doc": {
			"id": "1c116b4a2a4a569319c35466ed3a613ee41faff21d2bb8cba3e681014484f180",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Rolls_Royce_Trent_800.jpg/220px-Rolls_Royce_Trent_800.jpg",
				"previous": "Testing of the Trent 800 began in September 1993, and certification was achieved in January 1995.[2] The first Boeing 777 with Trent 800 engines flew in May 1995, and entered service with Thai Airways International on 31 March 1996.[3] 180 minutes ETOPS approval was granted by the FAA on 10 October 1996.[4]",
				"after": "Initially Rolls-Royce had difficulty selling the engine: British Airways, traditionally a Rolls-Royce customer, submitted a large order for the competing General Electric GE90 engine. The breakthrough came when the company won orders from Singapore Airlines, previously a staunch Pratt & Whitney customer, for its 34 Boeing 777s; this was soon followed by large North American orders from American Airlines and Delta Air Lines for their 777 fleets. British Airways announced in September 1998 that it was returning to Rolls-Royce for its second batch of 777s, and did so again in April 2007. The Trent 800 has a 41% share of the engine market on the 777 variants for which it is available. Rolls-Royce Trent 800s are now commonly used on the Boeing 777 series. Major airlines such as Air New Zealand, British Airways, American Airlines, Kenya Airways, Emirates, and many other airlines now operate Boeing 777s with Trent 800s on a regular schedule.[5]",
			"color": "black|0.5522 dim|0.16037 gray|0.16037 dim|0.16037 grey|0.16037 dark|0.070109 gray|0.070109 dark|0.070109 grey|0.070109 gray|0.06911 grey|0.06911 silver|0.014268 light|0.01369 gray|0.01369 light|0.01369 grey|0.01369 slate|0.011982 gray|0.011982 gainsboro|0.010358 linen|0.010101 sea|0.0091955 shell|0.0091955 white|0.0090445 smoke|0.0090445 floral|0.0088408 white|0.0088408 snow|0.0082606 light|0.008231 slate|0.008231 gray|0.008231 mint|0.0079445 cream|0.0079445 ivory|0.0076622 white|0.0075788 old|0.0073494 lace|0.0073494 azure|0.0042208 ghost|0.0036403 white|0.0036403  "
		}
	}
}
