{
	"add": {
		"doc": {
			"id": "1c20d827769a24b37567db2e533c2df4680080abcd5b0456fb6bc72373f6080b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Thescelosaurus_neglectus_%281%29.jpg/220px-Thescelosaurus_neglectus_%281%29.jpg",
			"previous": [],
				"after": "Conflicting reports have been made as to its preferred habitat; two papers suggest it preferred channels to floodplains,[38][39] but another suggests it preferred the opposite.[40] The possible preference for channels is based on the relative abundance of thescelosaur fossils in sandstones, representing channel environments, in comparison to mudstones, representing floodplain environments.[39] No bonebeds or accumulations of multiple individuals have yet been reported. Dale Russell, in a popular work, noted that Thescelosaurus was the most common small herbivore in the Hell Creek Formation of the Fort Peck area. He described the environment of the time as a flat floodplain, with a relatively dry subtropical climate that supported a variety of plants ranging from angiosperm trees, to bald cypress, to ferns and ginkgos. Although most dinosaur skeletons from this area are incomplete, possibly due to the low preservation potential of forests, Thescelosaurus skeletons are much more complete, suggesting that this genus frequented stream channels. Thus when a Thescelosaurus died, it may have been in or near a river, making it easier to bury and preserve for later fossilization. Russell tentatively compared it to the capybaras and tapirs.[41] Other dinosaurs that shared its time and place include the ceratopsids Triceratops and Torosaurus, hadrosaurid Edmontosaurus, ankylosaurid Ankylosaurus, pachycephalosaurian Pachycephalosaurus, and the theropods Ornithomimus, Troodon, and Tyrannosaurus.[42][43] Thescelosaurus was also abundant in the Lance Formation. Toe bones from this genus are the most common finds after fossils of Triceratops and Edmontosaurus, and it may have been the most common dinosaur there in life, if the Lance Formation had a preservational bias against small animals.[44]",
			"color": "dark|0.18599 gray|0.18599 dark|0.18599 grey|0.18599 silver|0.17529 gray|0.14892 grey|0.14892 light|0.12958 gray|0.12958 light|0.12958 grey|0.12958 dim|0.1047 gray|0.1047 dim|0.1047 grey|0.1047 gainsboro|0.092725 black|0.073812 linen|0.016833 light|0.0095164 steel|0.0095164 blue|0.0095164 white|0.0094712 smoke|0.0094712 sea|0.0077929 shell|0.0077929 antique|0.0077594 white|0.0077594 misty|0.0051066 rose|0.0051066 old|0.0048482 lace|0.0048482 lavender|0.0041635 blush|0.0041635 floral|0.0041629 white|0.0041629 snow|0.0036662  "
		}
	}
}
