{
	"add": {
		"doc": {
			"id": "1c27c726d5f9ad175b8e7bf2d3d6eb327a58417f3d23046f11a16c2d485005a0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Old_Kannada_inscription_dated_1115_AD_in_the_Lakshmi_Devi_temple_at_Doddagaddavalli.jpg/120px-Old_Kannada_inscription_dated_1115_AD_in_the_Lakshmi_Devi_temple_at_Doddagaddavalli.jpg",
				"previous": "Portal:Arts/Featured article/27",
				"after": "Hoysala literature is the large body of literature in the Kannada and Sanskrit languages produced by the Hoysala Empire (1025–1343) in what is now southern India. Kannada literature during this period consisted of writings relating to the socio-religious developments of the Jain and Veerashaiva faiths, and to a lesser extent that of the Vaishnava faith. The earliest well-known brahmin writers in Kannada were from the Hoysala court. While most of the courtly textual production was in Kannada, an important corpus of monastic Vaishnava literature relating to Dvaita (dualistic) philosophy was written by the renowned philosopher Madhvacharya in Sanskrit. Writing Kannada literature in native metres was first popularised by the court poets. These metres were the sangatya, compositions sung to the accompaniment of a musical instrument; shatpadi, six-line verses; ragale, lyrical compositions in blank verse; and tripadi, three-line verses. However, Jain writers continued to use the traditional champu, composed of prose and verse. Important literary contributions in Kannada were made not only by court poets but also by noblemen, commanders, ministers, ascetics and saints associated with monasteries.",
			"color": "tan|0.2336 wheat|0.18079 moccasin|0.093412 burly|0.079468 wood|0.079468 navajo|0.07921 white|0.07921 bisque|0.05304 blanched|0.045626 almond|0.045626 lemon|0.029131 chiffon|0.029131 black|0.024756 papaya|0.023972 whip|0.023972 light|0.022486 golden|0.022486 rod|0.022486 yellow|0.022486 antique|0.019088 white|0.019088 pale|0.018152 golden|0.018152 rod|0.018152 beige|0.017105 corn|0.016913 silk|0.016913 peach|0.016736 puff|0.016736 dim|0.014729 gray|0.014729 dim|0.014729 grey|0.014729 light|0.010689 yellow|0.010689 gray|0.0056788 grey|0.0056788  "
		}
	}
}
