{
	"add": {
		"doc": {
			"id": "1c2b36c737a44e8f7ac47c9bf3e117cae9ef750f842a57c46c8d2ba528b84726",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Sopwith_Camel_1.jpg/220px-Sopwith_Camel_1.jpg",
				"previous": "Meanwhile, the synchronization gear (called the Stangensteuerung in German, for \"pushrod control system\") devised by the engineers of Anthony Fokker's firm was the first system to see production contracts, and would make the Fokker Eindecker monoplane a feared name over the Western Front, despite its being an adaptation of an obsolete pre-war French Morane-Saulnier racing airplane, with a mediocre performance and poor flight characteristics. The first victory for the Eindecker came on 1 July 1915, when Leutnant Kurt Wintgens, flying with the Feldflieger Abteilung 6 unit on the Western Front, forced down a Morane-Saulnier Type L two-seat \"parasol\" monoplane just east of Luneville. Wintgens' aircraft, one of the five Fokker M.5K/MG production prototype examples of the Eindecker, was armed with a synchronized, air-cooled aviation version of the Parabellum MG14 machine gun.",
				"after": "The success of the Eindecker kicked off a competitive cycle of improvement among the combatants, building ever more capable single-seat fighters. The Albatros D.I and Sopwith Pup of 1916 set the classic pattern followed by fighters for about twenty years. Most were biplanes and only rarely monoplanes or triplanes. The strong box structure of the biplane wing provided a rigid wing that allowed the accurate lateral control essential for dogfighting. They had a single operator, who flew the aircraft and also controlled its armament. They were armed with one or two Maxim or Vickers machine guns, which were easier to synchronize than other types, firing through the propeller arc. Gun breeches were directly in front of the pilot, with obvious implications in case of accidents, but jams could be cleared in flight, while aiming was simplified.",
			"color": "dark|0.39606 gray|0.39606 dark|0.39606 grey|0.39606 gray|0.31014 grey|0.31014 black|0.10866 dim|0.084611 gray|0.084611 dim|0.084611 grey|0.084611 silver|0.084078  "
		}
	}
}
