{
	"add": {
		"doc": {
			"id": "1c39f3802ca2a1e2beb3f98314089fb50b1d4bc2d12e312ec4b0037cd7233d22",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/NucleophilicAdditionWithOrganogermanium.png/220px-NucleophilicAdditionWithOrganogermanium.png",
				"previous": "Germane (GeH4) is a compound similar in structure to methane. Polygermanes—compounds that are similar to alkanes—with formula GenH2n+2 containing up to five germanium atoms are known.[32] The germanes are less volatile and less reactive than their corresponding silicon analogues.[32] GeH4 reacts with alkali metals in liquid ammonia to form white crystalline MGeH3 which contain the GeH3− anion.[32] The germanium hydrohalides with one, two and three halogen atoms are colorless reactive liquids.[32]",
				"after": "The first organogermanium compound was synthesized by Winkler in 1887; the reaction of germanium tetrachloride with diethylzinc yielded tetraethylgermane (Ge(C 2H 5) 4).[6] Organogermanes of the type R4Ge (where R is an alkyl) such as tetramethylgermane (Ge(CH 3) 4) and tetraethylgermane are accessed through the cheapest available germanium precursor germanium tetrachloride and alkyl nucleophiles. Organic germanium hydrides such as isobutylgermane ((CH 3) 2CHCH 2GeH 3) were found to be less hazardous and may be used as a liquid substitute for toxic germane gas in semiconductor applications. Many germanium reactive intermediates are known: germyl free radicals, germylenes (similar to carbenes), and germynes (similar to carbynes).[41][42] The organogermanium compound 2-carboxyethylgermasesquioxane was first reported in the 1970s, and for a while was used as a dietary supplement and thought to possibly have anti-tumor qualities.[43]",
			"color": "dark|0.2384 gray|0.2384 dark|0.2384 grey|0.2384 silver|0.19168 light|0.12974 gray|0.12974 light|0.12974 grey|0.12974 gray|0.10181 grey|0.10181 gainsboro|0.093743 dim|0.030747 gray|0.030747 dim|0.030747 grey|0.030747 light|0.029191 pink|0.029191 misty|0.026606 rose|0.026606 pink|0.025849 white|0.019711 smoke|0.019711 lavender|0.018441 blush|0.018441 sea|0.014167 shell|0.014167 linen|0.012511 ghost|0.011931 white|0.011931 snow|0.011395 alice|0.010735 blue|0.010735 white|0.0085492 floral|0.0070212 white|0.0070212 mint|0.005624 cream|0.005624 light|0.0048413 coral|0.0048413 azure|0.0041588  "
		}
	}
}
