{
	"add": {
		"doc": {
			"id": "1c54918fbf4a5cd584368fff7329132a6a31730d06509c9522a7b04d0c6f9efd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Astatine-iodide-3D-vdW.png/200px-Astatine-iodide-3D-vdW.png",
				"previous": "Astatine may form bonds to the other chalcogens; these include S7At+ and At(CSN)− 2 with sulfur, a coordination selenourea compound with selenium, and an astatine–tellurium colloid with tellurium.[71]",
				"after": "Astatine is known to react with its lighter homologs iodine, bromine, and chlorine in the vapor state; these reactions produce diatomic interhalogen compounds with formulas AtI, AtBr, and AtCl.[56] The first two compounds may also be produced in water – astatine reacts with iodine/iodide solution to form AtI, whereas AtBr requires (aside from astatine) an iodine/iodine monobromide/bromide solution. The excess of iodides or bromides may lead to AtBr− 2 and AtI− 2 ions,[56] or in a chloride solution, they may produce species like AtCl− 2 or AtBrCl− via equilibrium reactions with the chlorides.[57] Oxidation of the element with dichromate (in nitric acid solution) showed that adding chloride turned the astatine into a molecule likely to be either AtCl or AtOCl. Similarly, AtOCl− 2 or AtCl− 2 may be produced.[56] Polyhalides PdAtI2, CsAtI2, TlAtI2,[72][73][74] and PbAtI[75] are known or presumed to have been precipitated. In a plasma ion source mass spectrometer, the ions [AtI]+, [AtBr]+, and [AtCl]+ have been formed by introducing lighter halogen vapors into a helium-filled cell containing astatine, supporting the existence of stable neutral molecules in the plasma ion state.[56] No astatine fluorides have been discovered yet. Their absence has been speculatively attributed to the extreme reactivity of such compounds, including the reaction of an initially formed fluoride with the walls of the glass container to form a non-volatile product.[g] Thus, although the synthesis of an astatine fluoride is thought to be possible, it may require a liquid halogen fluoride solvent, as has already been used for the characterization of radon fluoride.[56][69]",
			"color": "purple|0.45694 dark|0.27212 magenta|0.27212 black|0.044104 silver|0.024536 dark|0.02429 gray|0.02429 dark|0.02429 grey|0.02429 light|0.020409 gray|0.020409 light|0.020409 grey|0.020409  "
		}
	}
}
