{
	"add": {
		"doc": {
			"id": "1c6ed13f1b051cea736265b774cbb5ab54290b28012457040d33e1fd9bcc7497",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/JeanBerry_svOndrej.jpg/220px-JeanBerry_svOndrej.jpg",
				"previous": "Soon after Berry's death in 1416, the bulk of his treasures were seized and melted down by the English, who were occupying much of northern France after their victory at the Battle of Agincourt the previous year. That the reliquary escaped this fate suggests it may have been given away by Berry, perhaps to his Burgundian cousins, in whose family it is next recorded (the Burgundian heiress Mary of Burgundy married the Habsburg Maximilian I, Holy Roman Emperor in 1477).[48] A reliquary that was donated to the church had a better chance of surviving than the similar secular works that are now only known from their descriptions in inventories, where scenes of courtly pleasure were depicted with portrait figures of the princes and their friends. A work belonging to Berry's elder brother Anjou showed the romance of Tristan and Isolde, with King Mark spying on the lovers from a tree above them, giving himself away when they see \"the enamelled reflection of his face in the enamelled brook\".[49]",
				"after": "One work that survived long enough to be recorded in an 18th-century painting had a very similar gold castle as its base, with a paradisal garden within the walls, in this case with trees bearing pearls and red gems. However the rest of the piece was very different in scale, with a single large white enamel figure of the Archangel Michael impaling Satan with a lance-like jewelled cross, completely out of scale with the garden in which he stands. This is the St Michael and the Devil Group, which can be reliably dated to before 1397, when it was given to King Charles VI of France, Berry's nephew, as a New Year's gift by another uncle, Philip the Bold, Duke of Burgundy. It later passed to a church at Ingolstadt in Bavaria, where it remained until it was destroyed in 1801.[50]",
			"color": "rosy|0.21253 brown|0.21253 midnight|0.19076 blue|0.19076 dim|0.040957 gray|0.040957 dim|0.040957 grey|0.040957 gray|0.035648 grey|0.035648 dark|0.032559 gray|0.032559 dark|0.032559 grey|0.032559 tan|0.032008 light|0.030333 gray|0.030333 light|0.030333 grey|0.030333 black|0.029817 silver|0.028851 dark|0.028198 sea|0.028198 green|0.028198 dark|0.024073 slate|0.024073 blue|0.024073 sienna|0.023864 cadet|0.023438 blue|0.023438 gainsboro|0.022949 firebrick|0.020352 dark|0.019008 slate|0.019008 gray|0.019008 dark|0.017833 salmon|0.017833 slate|0.014961 gray|0.014961 light|0.013812 slate|0.013812 gray|0.013812 burly|0.013762 wood|0.013762 brown|0.013503 linen|0.0099203 antique|0.0097521 white|0.0097521  "
		}
	}
}
