{
	"add": {
		"doc": {
			"id": "1c8fb9daa66f45702024e7d0a50ebba52ee6873f39418d3e6a724ae57d9ec995",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/The_omphalos_of_the_Cloud_Gate_%28pre-polish%29.jpg/220px-The_omphalos_of_the_Cloud_Gate_%28pre-polish%29.jpg",
				"previous": "Inside Cloud Gate's polished exterior shell are several steel structures that keep the sculpture standing. The first structural pieces, two type 304 stainless steel rings, were put into place in February 2004. As construction continued, crisscrossing pipe trusses were assembled between the two rings.[27] The trusses and supporting structures were only present for the construction phases. The finished sculpture has no inner bracing.[28] The supporting structural components were designed and constructed to ensure that no specific point was overloaded, and to avoid producing unwanted indentations on the exterior shell. The frame was also designed to expand and contract with the sculpture as temperatures fluctuate. As a result, the two large rings supporting the sculpture move independently of each other, allowing the shell to move independently of the rings.[23]",
				"after": "When Cloud Gate's interior components were completed, construction crews prepared to work on the outer shell; this comprises 168 stainless steel panels, each 3⁄8 inch (10 mm) thick and weighing 1,000 to 2,000 pounds (450 to 910 kg).[29] They were fabricated using three-dimensional modeling software.[23] Computers and robots were essential in the bending and shaping of the plates,[24] which was performed by English wheel and a robotic scanning device.[30] Metal stiffeners were welded to each panel's interior face to provide a small degree of rigidity. About a third of the plates, along with the entire interior structure, were fabricated in Oakland.[23] The plates were polished to 98 percent of their final state and covered with protective white film before being sent to Chicago via trucks.[31] Once in Chicago, the plates were welded together on-site, creating 2,442 linear feet (744 m) of welded seams.[29] Welders used keyhole welding machines rather than traditional welding guns.[6] The plates were fabricated so precisely that no on-site cutting or filing was necessary when lifting and fitting them into position.[29]",
			"color": "dim|0.12283 gray|0.12283 dim|0.12283 grey|0.12283 gray|0.10465 grey|0.10465 dark|0.06889 gray|0.06889 dark|0.06889 grey|0.06889 alice|0.035136 blue|0.035136 silver|0.034798 lavender|0.03204 dark|0.031898 salmon|0.031898 white|0.029134 smoke|0.029134 ghost|0.029058 white|0.029058 light|0.028069 blue|0.028069 snow|0.024283 light|0.024093 gray|0.024093 light|0.024093 grey|0.024093 white|0.022295 azure|0.021764 sea|0.021304 shell|0.021304 gainsboro|0.020903 rosy|0.020299 brown|0.020299 lavender|0.020183 blush|0.020183 mint|0.020056 cream|0.020056 indian|0.018923 red|0.018923 floral|0.017475 white|0.017475 light|0.015615 sky|0.015615 blue|0.015615 light|0.015615 slate|0.015615 gray|0.015615 light|0.015206 steel|0.015206 blue|0.015206 slate|0.014983 gray|0.014983 tan|0.013384 burly|0.013049 wood|0.013049 thistle|0.011413  "
		}
	}
}
