{
	"add": {
		"doc": {
			"id": "1c8f48da2fa69def94e77cf4b1865e63a842a0f3dc4c9d4935442a7916e46897",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Borromini_SantIvo.jpg/170px-Borromini_SantIvo.jpg",
				"previous": "Education in Italy is free and mandatory from ages six to sixteen,[189] and consists of five stages: kindergarten (scuola dell'infanzia), primary school (scuola primaria), lower secondary school (scuola secondaria di primo grado), upper secondary school (scuola secondaria di secondo grado) and university (università).[190] The Superior Graduate Schools are independent institutions similar to French Grandes écoles which offer advanced training and research through university-type courses or are dedicated to teaching at graduate or post-doctoral level.",
				"after": "Italy hosts a broad variety of universities, colleges and academies. Founded in 1088, the University of Bologna is likely the oldest in the world.[192] In 2009, the University of Bologna is, according to The Times, the only Italian college in the top 200 World Universities. Milan's Bocconi University has been ranked among the top 20 best business schools in the world by The Wall Street Journal international rankings, especially thanks to its M.B.A. program, which in 2007 placed it no. 17 in the world in terms of graduate recruitment preference by major multinational companies.[193] Bocconi was also ranked by Forbes as the best worldwide in the specific category Value for Money.[194] In May 2008, Bocconi overtook several traditionally top global business schools in the Financial Times Executive education ranking, reaching no. 5 in Europe and no. 15 in the world.[195]",
			"color": "dim|0.20822 gray|0.20822 dim|0.20822 grey|0.20822 black|0.19637 gray|0.17712 grey|0.17712 dark|0.16769 gray|0.16769 dark|0.16769 grey|0.16769 silver|0.067057 light|0.044659 gray|0.044659 light|0.044659 grey|0.044659 gainsboro|0.032055 white|0.012872 smoke|0.012872 alice|0.0087492 blue|0.0087492 mint|0.0083962 cream|0.0083962 snow|0.0081644 ghost|0.0077364 white|0.0077364 azure|0.0077315 sea|0.00759 shell|0.00759 white|0.0071408 floral|0.0070714 white|0.0070714 linen|0.0064103  "
		}
	}
}
