{
	"add": {
		"doc": {
			"id": "1cad8cfa57946b6acc0cc8a51ac243378d3d6917a806edae8184707043d0f083",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Taito_1.svg/25px-Taito_1.svg.png",
				"previous": "One of the most complex characters found in modern Chinese dictionaries[g] is 齉 (U+9F49) (nàng,  listen (help·info), pictured below, middle image), meaning \"snuffle\" (that is, a pronunciation marred by a blocked nose), with \"just\" thirty-six strokes. However, this is not in common use. The most complex character that can be input using the Microsoft New Phonetic IME 2002a for traditional Chinese is 龘 (dá, \"the appearance of a dragon flying\"). It is composed of the dragon radical represented three times, for a total of 16 × 3 = 48 strokes. Among the most complex characters in modern dictionaries and also in frequent modern use are 籲 (yù, \"to implore\"), with 32 strokes; 鬱 (yù, \"luxuriant, lush; gloomy\"), with 29 strokes, as in 憂鬱 (yōuyù, \"depressed\"); 豔 (yàn, \"colorful\"), with 28 strokes; and 釁 (xìn, \"quarrel\"), with 25 strokes, as in 挑釁 (tiǎoxìn, \"to pick a fight\"). Also in occasional modern use is 鱻 (xiān \"fresh\"; variant of 鮮 xiān) with 33 strokes.",
				"after": "The most complex Chinese character still in use may be[according to whom?] biáng (pictured right, bottom), with 57 strokes, which refers to Biang biang noodles, a type of noodle from China's Shaanxi province. This character along with the syllable biang cannot be found in dictionaries. The fact that it represents a syllable that does not exist in any Standard Chinese word means that it could be classified as a dialectal character.",
			"color": "gray|0.35284 grey|0.35284 dark|0.24881 gray|0.24881 dark|0.24881 grey|0.24881 dim|0.18762 gray|0.18762 dim|0.18762 grey|0.18762 silver|0.094417 light|0.043393 gray|0.043393 light|0.043393 grey|0.043393 gainsboro|0.029146 white|0.0070601 smoke|0.0070601 alice|0.0045199 blue|0.0045199 lavender|0.0044907 blush|0.0044907 ghost|0.0044226 white|0.0044226 sea|0.0043361 shell|0.0043361 snow|0.0042603 white|0.0037616 mint|0.0032431 cream|0.0032431 linen|0.0027973 floral|0.0025833 white|0.0025833  "
		}
	}
}
