{
	"add": {
		"doc": {
			"id": "1cd4a5efb910fdb7611829b63d52e9399ead45c5ad7af2155f64b1d1bded7c0a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Kerem.jpg/220px-Kerem.jpg",
				"previous": "Tel Aviv is an ethnically diverse city. The Jewish population, which forms the majority group in Tel Aviv consists of immigrants from all parts of the world and their descendants, including Ashkenazi Jews from Europe, North America, South America, Australia and South Africa, as well as Sephardic and Mizrahi Jews from Southern Europe, North Africa, India, Central Asia, West Asia,and the Arabian Peninsula. There are also a sizable number of Ethiopian Jews and their descendants living in Tel Aviv. In addition to Muslim and Arab Christian minorities in the city, several hundred Armenian Christians who reside in the city are concentrated mainly in Jaffa and some Christians from the former Soviet Union who immigrated to Israel with Jewish spouses and relatives. In recent years, Tel Aviv has received many non-Jewish migrants, students, foreign workers (documented and undocumented) and refugees. There are many refugees from African countries located in the southern part of the city.[122]",
				"after": "Tel Aviv is divided into nine districts that have formed naturally over the city's short history. The oldest of these is Jaffa, the ancient port city out of which Tel Aviv grew. This area is traditionally made up demographically of a greater percentage of Arabs, but recent gentrification is replacing them with a young professional and artist population. Similar processes are occurring in nearby Neve Tzedek, the original Jewish neighborhood outside of Jaffa. Ramat Aviv, a district in the northern part of the city that is largely made up of luxury apartments and includes Tel Aviv University, is currently undergoing extensive expansion and is set to absorb the beachfront property of Sde Dov Airport after its decommissioning.[123] The area known as HaKirya is the Israel Defense Forces (IDF) headquarters and a large military base.[91]",
			"color": "black|0.66213 dark|0.048745 olive|0.048745 green|0.048745 dim|0.045322 gray|0.045322 dim|0.045322 grey|0.045322 gray|0.038547 grey|0.038547 dark|0.03663 gray|0.03663 dark|0.03663 grey|0.03663 silver|0.022152 light|0.015142 gray|0.015142 light|0.015142 grey|0.015142 tan|0.010962 gainsboro|0.010559  "
		}
	}
}
