{
	"add": {
		"doc": {
			"id": "1cea3b19d556ecf733a2e4e830f3b33bb2680c267006a1c4ebba5d2d60d5b35c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/1836_P2C_Two_Cents_%28Judd-52%29_%28obv%29.jpg/220px-1836_P2C_Two_Cents_%28Judd-52%29_%28obv%29.jpg",
				"previous": "A two-cent piece had been proposed in 1806 by Connecticut Senator Uriah Tracy, along with a twenty-cent piece or \"double dime\". Reflecting the then-prevalent view that coins should contain their value in metal, Tracy's bill provided that the two-cent piece be made of billon, or debased silver. The bill was opposed by Mint Director Robert Patterson, as it would be difficult to refine the silver from melted-down pieces. Although Tracy's legislation passed the Senate twice, in 1806 and 1807, it failed in the House of Representatives.[1] Patterson sent a brass button with two of the billon planchets that would have been used for the coin to Tracy, showing how hard it would be to prevent counterfeiting.[2] The Mint considered a two-cent piece in 1836, and experiments were conducted by Second Engraver Christian Gobrecht and Melter and Refiner Franklin Peale. The piece was to be again of billon, and provision for the coin was included in early drafts of the Mint Act of 1837, but the proposal was dropped when Peale was able to show that the coin could be easily counterfeited.[3]",
				"after": "Until 1857, the cent coin was a large copper piece, containing about its face value in metal. These coins were unpopular, and in 1857, after receiving congressional approval, the Mint began issuing the Flying Eagle cent, of the diameter of the later Lincoln cent, but somewhat thicker and made of copper-nickel alloy.[4][5] These pieces readily circulated, and although the design did not strike well and was replaced by the Indian Head cent in 1859, the coins were commonly used until all federal coinage vanished from circulation in much of the United States in 1861 and 1862, during the economic turmoil of the American Civil War. This happened because many Northerners feared that if the war went poorly, paper money and government bonds might become worthless. The gap was filled by, among other things, private token issues, sometimes in copper-nickel approximating the size of the cent, but often thinner pieces in bronze.[6]",
			"color": "tan|0.18706 gray|0.15147 grey|0.15147 dark|0.10613 gray|0.10613 dark|0.10613 grey|0.10613 dim|0.096194 gray|0.096194 dim|0.096194 grey|0.096194 black|0.061786 silver|0.044978 antique|0.038825 white|0.038825 burly|0.0237 wood|0.0237 rosy|0.023573 brown|0.023573 peach|0.023101 puff|0.023101 bisque|0.022645 light|0.02022 gray|0.02022 light|0.02022 grey|0.02022 papaya|0.018598 whip|0.018598 blanched|0.018184 almond|0.018184 linen|0.016959 old|0.014098 lace|0.014098 misty|0.013216 rose|0.013216 wheat|0.013031 gainsboro|0.011244 sea|0.010114 shell|0.010114 beige|0.0092911 floral|0.0090614 white|0.0090614  "
		}
	}
}
