{
	"add": {
		"doc": {
			"id": "1cef3faeca81c32322c11400449d5fca2c6caa6781b13abf70fe675f4b8fd6d0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/SEEPZ_church_4.jpg/180px-SEEPZ_church_4.jpg",
			"previous": [],
				"after": "Mumbai (formerly Bombay) is the financial capital of India and one of the most populous cities in the world. At the time of arrival of the Portuguese, Bombay was an archipelago of seven islands. Growing apprehensive of the power of the Mughal emperor Humayun, Sultan Bahadur Shah of the Gujarat Sultanate was obliged to sign the Treaty of Bassein with the Portuguese Empire on 23 December 1534. According to the treaty, the seven islands of Bombay, the nearby strategic town of Bassein and its dependencies were offered to the Portuguese. The territories were later surrendered on 25 October 1535. The Portuguese were actively involved in the foundation and growth of their Roman Catholic religious orders in Bombay. They called the islands by various names, which finally took the written form Bombaim. The islands were leased to several Portuguese officers during their regime. The Portuguese Franciscans and Jesuits built several churches in the city, prominent being the St. Michael's Church at Mahim, St. John the Baptist Church at Andheri, St. Andrew's Church at Bandra, and Gloria Church at Byculla. The Portuguese also built several fortifications around the city like the Bombay Castle, Castella de Aguada (Bandra Fort), and Madh Fort. The British were in constant struggle with the Portuguese vying for hegemony over Bombay, as they recognized its strategic natural harbour and its natural isolation from land-attacks. By the middle of the 17th century the growing power of the Dutch Empire forced the British to acquire a station in western India. On 11 May 1661, the marriage treaty of Charles II of England and Catherine of Braganza, daughter of King John IV of Portugal, placed Bombay in possession of the British Empire, as part of dowry of Catherine to Charles.",
			"color": "tan|0.097026 antique|0.0863 white|0.0863 dim|0.083374 gray|0.083374 dim|0.083374 grey|0.083374 peach|0.067063 puff|0.067063 gray|0.060702 grey|0.060702 black|0.053145 bisque|0.049346 linen|0.045173 papaya|0.044608 whip|0.044608 misty|0.043721 rose|0.043721 blanched|0.042524 almond|0.042524 dark|0.03868 gray|0.03868 dark|0.03868 grey|0.03868 old|0.036849 lace|0.036849 sea|0.0308 shell|0.0308 floral|0.02735 white|0.02735 silver|0.026004 ivory|0.019435 beige|0.018789 corn|0.017699 silk|0.017699 light|0.014746 gray|0.014746 light|0.014746 grey|0.014746 snow|0.013732 white|0.013122 smoke|0.013122  "
		}
	}
}
