{
	"add": {
		"doc": {
			"id": "1cf0208afa95a141845f1e6a788b65d0a7ba49d4f74a16af3491a1e0948c0fcb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/HeadingleyWest.JPG/250px-HeadingleyWest.JPG",
				"previous": "The club was founded on 8 January 1863 in the Adelphi Hotel, Sheffield and was initially based at Bramall Lane. Headingley was first established in 1888 and Test cricket was first played there in 1899, eight years later than it hosted its inaugural first-class match when Yorkshire played Kent in 1891, the year in which the club's headquarters moved there. The \"out grounds\" in Hull, Sheffield, Bradford, Middlesbrough and Harrogate were used with great success until the 1970s.",
				"after": "On 31 December 2005, Yorkshire County Cricket Club purchased the Headingley cricket ground for £12 million from the Leeds Cricket, Football and Athletic Company, parent company of the Leeds rugby league club, with the help of a £9 million loan from Leeds City Council. This purchase ensures that Test cricket continues at the venue with a 15-year staging agreement. On 11 January 2006, the stadium was officially renamed the Headingley Carnegie Stadium as a result of sponsorship from Leeds Metropolitan University and the club announced plans on 11 January 2006 to rebuild the stand next to the rugby ground with 3,000 extra seats, taking capacity to 20,000.[85] The club also announced plans to redevelop the Winter shed (North) stand on 25 August 2006 providing a £12.5 million pavilion complex.[86]",
			"color": "khaki|0.23075 corn|0.13914 flower|0.13914 blue|0.13914 pale|0.13673 golden|0.13673 rod|0.13673 gray|0.045314 grey|0.045314 dim|0.042539 gray|0.042539 dim|0.042539 grey|0.042539 dark|0.041203 gray|0.041203 dark|0.041203 grey|0.041203 steel|0.027949 blue|0.027949 thistle|0.027124 lemon|0.026006 chiffon|0.026006 silver|0.024155 lavender|0.022979 light|0.020649 steel|0.020649 blue|0.020649 light|0.017587 gray|0.017587 light|0.017587 grey|0.017587 light|0.01514 golden|0.01514 rod|0.01514 yellow|0.01514 gainsboro|0.014293 light|0.013287 slate|0.013287 gray|0.013287 rosy|0.012903 brown|0.012903 slate|0.012124 gray|0.012124 dodger|0.0095909 blue|0.0095909 lavender|0.0093579 blush|0.0093579 ghost|0.0082005 white|0.0082005 white|0.0076338 smoke|0.0076338 alice|0.0070197 blue|0.0070197 snow|0.0060905 light|0.0054197 yellow|0.0054197  "
		}
	}
}
