{
	"add": {
		"doc": {
			"id": "1cfbaa44420cf217c0b931f857f5dc01c3adaf467eb81910e18361da41dd8860",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Miller_bowl_front.jpg/170px-Miller_bowl_front.jpg",
			"previous": [],
				"after": "Miller scored 49 in the First Test at Brisbane as Australia amassed 8/601, before dismissing Simpson and Hutton as England fell to an innings defeat.[211][457][465][467] A knee injury forced Miller to miss the Second Test at the SCG, which England won.[465][468][469] Miller returned for the Third Test at the MCG, but was initially unavailable to bowl due to lingering knee problems.[470] However, upon receiving an inquiry about the health of his knee before the match by Prime Minister of Australia Robert Menzies, Miller agreed to try to bowl for a short period and lift his team.[471][472] England elected to bat and Miller removed Hutton, Edrich and Compton with his outswinger. He ended up bowling for the entire first session of play and had 3/5 at lunch from nine overs, before finishing at 3/14. England were bowled out for 191.[211][471][473] Miller struggled with the bat, scoring six and seven as Frank Tyson's pace saw England inflict a second successive defeat on Australia.[474][475] Australia needed to win the Fourth Test in Adelaide to keep the series alive. Miller scored 44 and 14 as Australia were bowled out in the second innings to leave England with 94 for victory. Miller made a late burst, removing Edrich, Hutton and Colin Cowdrey in consecutive overs to leave England at 3/18.[476] He then took a difficult catch from Johnston to dismiss Peter May.[477] England were then 4/49 but hung on to win by five wickets and secure the Ashes.[478][479][480] It was the first time that Australia had lost three consecutive Tests since the Bodyline series of 1932–33.[481] Miller made 19 and 28 in the rain-affected draw in the Fifth Test. He ended the series with 167 runs at 23.86, his lowest ever at international level,[211][482] and took 10 wickets at 24.30.[483]",
			"color": "dim|0.66473 gray|0.66473 dim|0.66473 grey|0.66473 black|0.16114 gray|0.084825 grey|0.084825 tan|0.081857  "
		}
	}
}
