{
	"add": {
		"doc": {
			"id": "1d019f1adeab2602a36fcb20ffe1b5c479d465816c651ef36c075364613eb557",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Knesset_building_%28edited%29.jpg/220px-Knesset_building_%28edited%29.jpg",
			"previous": [],
				"after": "Many national institutions of Israel are located in Kiryat HaMemshala in Givat Ram in Jerusalem as a part of the Kiryat HaLeom project which is intended to create a large district that will house most government agencies and national cultural institutions. Some government buildings are located in Kiryat Menachem Begin. The city is home to the Knesset,[228] the Supreme Court,[229] the Bank of Israel, the National Headquarters of the Israel Police, the official residences of the President and Prime Minister, the Cabinet, and all ministries except for the Ministry of Defense (which is located in central Tel Aviv's HaKirya district) and the Ministry of Agriculture and Rural Development (which is located in the Tel Aviv suburb of Rishon LeZion, nearby Beit Dagan). Prior to the creation of the State of Israel, Jerusalem served as the administrative capital of the British Mandate for Palestine, which included present-day Israel and Jordan.[230] From 1949 until 1967, West Jerusalem served as Israel's capital, but was not recognized as such internationally because UN General Assembly Resolution 194 envisaged Jerusalem as an international city. As a result of the Six-Day War in 1967, the whole of Jerusalem came under Israeli control. On 27 June 1967, the government of Levi Eshkol extended Israeli law and jurisdiction to East Jerusalem, but agreed that administration of the Temple Mount compound would be maintained by the Jordanian waqf, under the Jordanian Ministry of Religious Endowments.[231] In 1988, Israel ordered the closure of Orient House, home of the Arab Studies Society, but also the headquarters of the Palestine Liberation Organization, for security reasons. The building reopened in 1992 as a Palestinian guesthouse.[232][233] The Oslo Accords stated that the final status of Jerusalem would be determined by negotiations with the Palestinian Authority. The accords banned any official Palestinian presence in the city until a final peace agreement, but provided for the opening of a Palestinian trade office in East Jerusalem. The Palestinian Authority regards East Jerusalem as the capital of a future Palestinian state.[234][235] President Mahmoud Abbas has said that any agreement that did not include East Jerusalem as the capital of Palestine would be unacceptable.[236] Israeli Prime Minister Benjamin Netanyahu has similarly stated that Jerusalem would remain the undivided capital of Israel. Due to its proximity to the city, especially the Temple Mount, Abu Dis, a Palestinian suburb of Jerusalem, has been proposed as the future capital of a Palestinian state by Israel. Israel has not incorporated Abu Dis within its security wall around Jerusalem. The Palestinian Authority has built a possible future parliament building for the Palestinian Legislative Council in the town, and its Jerusalem Affairs Offices are all located in Abu Dis.[237]",
			"color": "silver|0.24892 black|0.13219 dark|0.11735 gray|0.11735 dark|0.11735 grey|0.11735 light|0.1163 gray|0.1163 light|0.1163 grey|0.1163 dim|0.10334 gray|0.10334 dim|0.10334 grey|0.10334 gainsboro|0.06775 gray|0.035578 grey|0.035578 blanched|0.013648 almond|0.013648 antique|0.013643 white|0.013643 papaya|0.01288 whip|0.01288 beige|0.011611 bisque|0.011455 corn|0.010342 silk|0.010342 wheat|0.010296 light|0.0092003 golden|0.0092003 rod|0.0092003 yellow|0.0092003 lemon|0.0082819 chiffon|0.0082819 dark|0.0074461 olive|0.0074461 green|0.0074461 light|0.0072728 yellow|0.0072728  "
		}
	}
}
