{
	"add": {
		"doc": {
			"id": "1d183099cedd9d9e20760f95bb8640c8ad798aed8c6a8702dac30639b9f75df3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Hamburg_um_1600_Brook.jpg/220px-Hamburg_um_1600_Brook.jpg",
			"previous": [],
				"after": "In 1189, by imperial charter, Frederick I \"Barbarossa\" granted Hamburg the status of an Imperial Free City and tax-free access up[clarification needed] the Lower Elbe into the North Sea. In 1265, an allegedly forged letter was presented to or by the Rath of Hamburg.[15] This charter, along with Hamburg's proximity to the main trade routes of the North Sea and Baltic Sea, quickly made it a major port in Northern Europe. Its trade alliance with Lübeck in 1241 marks the origin and core of the powerful Hanseatic League of trading cities. On 8 November 1266, a contract between Henry III and Hamburg's traders allowed them to establish a hanse in London. This was the first time in history that the word hanse was used for the trading guild of the Hanseatic League.[16] In 1270, the solicitor of the senate of Hamburg, Jordan von Boitzenburg, wrote the first description of civil, criminal and procedural law for a city in Germany in the German language, the Ordeelbook (Ordeel: sentence).[17] On 10 August 1410, civil unrest forced a compromise (German: Rezeß, literally meaning: withdrawal). This is considered the first constitution of Hamburg.[18] In 1529, the city embraced Lutheranism, and it received Reformed refugees from the Netherlands and France and, in the 17th century, Sephardi Jews from Portugal.",
			"color": "dark|0.096929 khaki|0.096929 light|0.094292 gray|0.094292 light|0.094292 grey|0.094292 silver|0.092513 gainsboro|0.075134 dark|0.074256 gray|0.074256 dark|0.074256 grey|0.074256 pale|0.071576 golden|0.071576 rod|0.071576 khaki|0.050989 gray|0.049584 grey|0.049584 dim|0.047862 gray|0.047862 dim|0.047862 grey|0.047862 black|0.03283 tan|0.031659 antique|0.0207 white|0.0207 linen|0.020494 beige|0.016641 white|0.016109 smoke|0.016109 wheat|0.015904 old|0.0142 lace|0.0142 lemon|0.012818 chiffon|0.012818 sea|0.01261 shell|0.01261 floral|0.011974 white|0.011974 papaya|0.010795 whip|0.010795 light|0.010268 golden|0.010268 rod|0.010268 yellow|0.010268 corn|0.009881 silk|0.009881 ivory|0.0088142 blanched|0.0086194 almond|0.0086194 mint|0.0079013 cream|0.0079013 snow|0.0076126  "
		}
	}
}
