{
	"add": {
		"doc": {
			"id": "1d1d1b5952a4a9a63b88beff704bee73cc9168b887d5f61225f3c00fa25bd953",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Chanonry_of_Elgin.jpg/260px-Chanonry_of_Elgin.jpg",
			"previous": [],
				"after": "The chanonry, referred to in the cathedral's chartulary as the college of the chanonry or simply as the college, was the collection of the canons' manses that were grouped around the cathedral.[58] A substantial wall, over 3.5 metres (11 ft) high, 2 metres (6 ft 7 in) thick and around 820 metres (2,690 ft) in length,[59] enclosed the cathedral and manses and separated the church community from the laity; only the manse of Rhynie lay outside the west wall.[60] The houses of 17 vicars and the many chaplains were also situated outside the west wall.[37] The wall had four gates: the West Port gave access to the burgh, the North Port provided access to the road to the bishop's palace of Spynie, the South Port opened opposite the hospital of Maison Dieu and the surviving East or Panns Port allowed access to the meadowland called Le Pannis. The Panns Port illustrates the portcullis defences of the gate-houses (Fig. 1).[59] Each canon or dignitary was responsible for providing his own manse and was built to reflect his status within the chapter.[58] The castle having become unsuitable, Edward I of England stayed at the manse of Duffus on 10 and 11 September 1303 as did James II in 1455.[61] In 1489, nearly a century after the incendiary attacks on the cathedral and precinct by in 1390 and 1402, the cathedral records show a chanonry still lacking many of its manses. The chapter ordered that 13 canons, including the succentor and the archdeacon, should immediately \"erect, construct, build, and duly repair their manses, and the enclosures of their gardens within the college of Moray\".[62] The manse of the precentor, erroneously called the Bishop's House,[63] is partially ruined and is dated 1557. (Fig. 2) Vestiges of the Dean's Manse and the Archdeacon's Manse (Fig. 3) are now part of private buildings.[64]",
			"color": " "
		}
	}
}
