{
	"add": {
		"doc": {
			"id": "1d23d142b9631e90df698461e7d32a30d181693605d784b53b99fa7dab005fd0",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/3/31/Nid-oes-bradwr.jpg/250px-Nid-oes-bradwr.jpg",
				"previous": "In 1879, a period of twenty years of almost uninterrupted growth came to an end, and the slate industry was hit by a recession which lasted until the 1890s.[50] Management responded by tightening rules and making it more difficult for the men to take time off. Labour relations were worsened by differences in language, religion and politics between the two sides. The owners and top managers at most of the quarries were English-speaking, Anglican and Tory, while the quarrymen were Welsh-speaking and mainly Nonconformist and Liberal. Negotiations between the two sides usually involved the use of interpreters.[51] In October 1885, there was a dispute at Dinorwig over the curtailing of holidays which led to a lock-out lasting until February 1886.[52] At the Penrhyn Quarry, George Sholto Gordon Douglas-Pennant took over from his father Edward Gordon Douglas-Pennant in 1885, and in 1886 appointed E. A. Young as chief manager.[53] A more stringent management regime was introduced, and relations with the workforce deteriorated. This culminated in the suspension of 57 members of the union committee and 17 other men in September 1896, leading to a strike which lasted eleven months. The men were eventually obliged to go back to work, essentially on the management's terms, in August 1897. This strike became known as \"The Penrhyn Lockout\".[54]",
				"after": "There was an upturn in trade in 1892, heralding another period of growth in the industry. This growth was mainly at Blaenau Ffestiniog and in the Nantlle Valley, where the workforce at Penyrorsedd reached 450.[55] Slate production in Wales peaked at over half a million tons in 1898, with 17,000 men employed in the industry.[56] A second lock-out or strike[57] at the Penrhyn Quarry began on 22 November 1900 and lasted for three years. The causes of the dispute were complex, but included the extension of a system of contracting out parts of the quarry. The quarrymen, instead of arranging their own bargains, would find themselves working for a contractor.[58] The union's funds for strike pay were inadequate, and there was a great deal of hardship among the 2,800 workers. Lord Penrhyn reopened the quarry in June 1901, and about 500 men returned to work, to be castigated as \"traitors\" by the remainder. Eventually the workers were forced to return to work in November 1903 on terms laid down by Lord Penrhyn. Many of the men considered to have been prominent in the union were not re-employed, and many of those who had left the area to seek work elsewhere did not return. The dispute left a lasting legacy of bitterness in the Bethesda area.[59]",
			"color": " "
		}
	}
}
