{
	"add": {
		"doc": {
			"id": "1d4237b2086795f20ab02f80699bac73179af00480924209dbbfec05d1c67a96",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Alfred_Radcliffe-Brown.jpg/220px-Alfred_Radcliffe-Brown.jpg",
				"previous": "Modern social anthropology was founded in Britain at the London School of Economics and Political Science following World War I. Influences include both the methodological revolution pioneered by Bronisław Malinowski's process-oriented fieldwork in the Trobriand Islands of Melanesia between 1915 and 1918[17] and Alfred Radcliffe-Brown's theoretical program for systematic comparison that was based on a conception of rigorous fieldwork and the structure-functionalist conception of Durkheim’s sociology.[18][19] Other intellectual founders include W. H. R. Rivers and A. C. Haddon, whose orientation reflected the contemporary Parapsychologies of Wilhelm Wundt and Adolf Bastian, and Sir E. B. Tylor, who defined anthropology as a positivist science following Auguste Comte. Edmund Leach (1962) defined social anthropology as a kind of comparative micro-sociology based on intensive fieldwork studies. Scholars have not settled a theoretical orthodoxy on the nature of science and society, and their tensions reflect views which are seriously opposed.",
				"after": "A. R. Radcliffe-Brown also published a seminal work in 1922. He had carried out his initial fieldwork in the Andaman Islands in the old style of historical reconstruction. However, after reading the work of French sociologists Émile Durkheim and Marcel Mauss, Radcliffe-Brown published an account of his research (entitled simply The Andaman Islanders) that paid close attention to the meaning and purpose of rituals and myths. Over time, he developed an approach known as structural functionalism, which focused on how institutions in societies worked to balance out or create an equilibrium in the social system to keep it functioning harmoniously. (This contrasted with Malinowski's functionalism, and was quite different from the later French structuralism, which examined the conceptual structures in language and symbolism.)",
			"color": "dark|0.36822 gray|0.36822 dark|0.36822 grey|0.36822 dim|0.31289 gray|0.31289 dim|0.31289 grey|0.31289 gray|0.1256 grey|0.1256 silver|0.1164 slate|0.034734 gray|0.034734 light|0.031157 slate|0.031157 gray|0.031157 light|0.0098124 gray|0.0098124 light|0.0098124 grey|0.0098124  "
		}
	}
}
