{
	"add": {
		"doc": {
			"id": "1d5f78104fa22bb7acd058c9cd63843c148f02ede5365756f675e0850fba61f3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Bernissart_Iguanodon_mounted_skeleton.jpg/170px-Bernissart_Iguanodon_mounted_skeleton.jpg",
			"previous": [],
				"after": "The largest find of Iguanodon remains to that date occurred on 28 February 1878 in a coal mine at Bernissart in Belgium, at a depth of 322 m (1056 ft),[5] when two mineworkers, Jules Créteur and Alphonse Blanchard, accidentally hit on a skeleton that they initially took for petrified wood. With the encouragement of Alphonse Briart, supervisor of mines at nearby Morlanwelz, Louis de Pauw on 15 May 1878 started to excavate the skeletons and in 1882 Louis Dollo reconstructed them. At least 38 Iguanodon individuals were uncovered,[2] most of which were adults.[37] Many of them went on public display beginning in July 1883 and are still on public view; nine are displayed as standing mounts, and nineteen more are still in the Museum's basement.[5] The exhibit makes an impressive display in the Royal Belgian Institute of Natural Sciences, in Brussels. A replica of one of these is on display at the Oxford University Museum of Natural History and at the Sedgwick Museum in Cambridge. Most of the remains were referred to a new species, I. bernissartensis,[58] a larger and much more robust animal than the English remains had yet revealed, but one specimen was referred to the nebulous, gracile I. mantelli (now Dollodon bampingi). The skeletons were some of the first complete dinosaur skeletons known. Found with the dinosaur skeletons were the remains of plants, fish, and other reptiles,[5] including the crocodyliform Bernissartia.[59]",
			"color": "black|0.34055 tan|0.077914 burly|0.034455 wood|0.034455 sienna|0.03335 rosy|0.025189 brown|0.025189 light|0.023058 gray|0.023058 light|0.023058 grey|0.023058 antique|0.021999 white|0.021999 linen|0.021932 gainsboro|0.021331 sea|0.020518 shell|0.020518 floral|0.018832 white|0.018832 misty|0.018412 rose|0.018412 white|0.018026 smoke|0.018026 old|0.01716 lace|0.01716 silver|0.016969 snow|0.016454 saddle|0.016423 brown|0.016423 lavender|0.015474 blush|0.015474 thistle|0.015298 white|0.014536 ivory|0.013113 wheat|0.012872 mint|0.012647 cream|0.012647 ghost|0.012616 white|0.012616 dark|0.011805 gray|0.011805 dark|0.011805 grey|0.011805 beige|0.011632 papaya|0.011362 whip|0.011362 bisque|0.01056 peach|0.010377 puff|0.010377 lavender|0.010302 blanched|0.0097581 almond|0.0097581 alice|0.0093482 blue|0.0093482  "
		}
	}
}
