{
	"add": {
		"doc": {
			"id": "1d7169c3421c8e99881088e407f7409db7f43ae340ee0db88a7688036a32ff52",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/MatmorScleractinian.JPG/220px-MatmorScleractinian.JPG",
				"previous": "Like extant organisms, fossils vary in size from microscopic, even single bacterial cells[6] one micrometer in diameter, to gigantic, such as dinosaurs and trees many meters long and weighing many tons. A fossil normally preserves only a portion of the deceased organism, usually that portion that was partially mineralized during life, such as the bones and teeth of vertebrates, or the chitinous or calcareous exoskeletons of invertebrates. Fossils may also consist of the marks left behind by the organism while it was alive, such as animal tracks or feces (coprolites). These types of fossil are called trace fossils (or ichnofossils), as opposed to body fossils. Finally, past life leaves some markers that cannot be seen but can be detected in the form of biochemical signals; these are known as chemofossils or biomarkers.",
			"after": [
				"The process of fossilization varies according to tissue type and external conditions.",
				"Permineralization is a process of fossilization that occurs when an organism is buried. The empty spaces within an organism (spaces filled with liquid or gas during life) become filled with mineral-rich groundwater. Minerals precipitate from the groundwater, occupying the empty spaces. This process can occur in very small spaces, such as within the cell wall of a plant cell. Small scale permineralization can produce very detailed fossils. For permineralization to occur, the organism must become covered by sediment soon after death or soon after the initial decay process. The degree to which the remains are decayed when covered determines the later details of the fossil. Some fossils consist only of skeletal remains or teeth; other fossils contain traces of skin, feathers or even soft tissues. This is a form of diagenesis."
			],
			"color": "chocolate|0.29473 peru|0.16899 sandy|0.14694 brown|0.14694 sienna|0.065133 burly|0.052798 wood|0.052798 saddle|0.039049 brown|0.039049 black|0.033574 dark|0.02884 salmon|0.02884 light|0.027833 salmon|0.027833 maroon|0.023229 coral|0.022205 pale|0.012234 golden|0.012234 rod|0.012234 dark|0.010884 red|0.010884 tan|0.0098815 brown|0.0093314 navajo|0.0082543 white|0.0082543  "
		}
	}
}
