{
	"add": {
		"doc": {
			"id": "1da265d44106372fd3c16b1c1d56f2c573b76d1897e897a44773f6502d0895aa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Tower_Hill%2C_2006.jpg/220px-Tower_Hill%2C_2006.jpg",
				"previous": "Among those held and executed at the Tower was Anne Boleyn.[109] Although the Yeoman Warders were once the Royal Bodyguard, by the 16th and 17th centuries their main duty had become to look after the prisoners.[112] The Tower was often a safer place than other prisons in London such as the Fleet, where disease was rife. High-status prisoners could live in conditions comparable to those they might expect outside; one such example was that while Walter Raleigh was held in the Tower his rooms were altered to accommodate his family, including his son who was born there in 1605.[110] Executions were usually carried out on Tower Hill rather than in the Tower of London itself, and 112 people were executed on the hill over 400 years.[113] Before the 20th century, there had been seven executions within the castle on Tower Green; as was the case with Lady Jane Grey, this was reserved for prisoners for whom public execution was considered dangerous.[113] After Lady Jane Grey's execution on 12 February 1554,[114] Queen Mary I imprisoned her sister Elizabeth, later Queen Elizabeth I, in the Tower under suspicion of causing rebellion as Sir Thomas Wyatt had led a revolt against Mary in Elizabeth's name.[115]",
				"after": "The Office of Ordnance and Armoury Office were founded in the 15th century, taking over the Privy Wardrobe's duties of looking after the monarch's arsenal and valuables.[116] As there was no standing army before 1661, the importance of the royal armoury at the Tower of London was that it provided a professional basis for procuring supplies and equipment in times of war. The two bodies were resident at the Tower from at least 1454, and by 16th century they had moved to a position in the inner ward.[117] Political tensions between Charles I and Parliament in the second quarter of the 17th century led to an attempt by forces loyal to the King to secure the Tower and its valuable contents, including money and munitions. London's Trained Bands, a militia force, were moved into the castle in 1640. Plans for defence were drawn up and gun platforms were built, readying the Tower for war. The preparations were never put to the test. In 1642, Charles I attempted to arrest five members of parliament. When this failed he fled the city, and Parliament retaliated by removing Sir John Byron, the Lieutenant of the Tower. The Trained Bands had switched sides, and now supported Parliament; together with the London citizenry, they blockaded the Tower. With permission from the King, Byron relinquished control of the Tower. Parliament replaced Byron with a man of their own choosing, Sir John Conyers. By the time the English Civil War broke out in November 1642, the Tower of London was already in Parliament's control.[118]",
			"color": "dark|0.51034 gray|0.51034 dark|0.51034 grey|0.51034 silver|0.23828 dim|0.12133 gray|0.12133 dim|0.12133 grey|0.12133 gray|0.046466 grey|0.046466 black|0.03494 light|0.025175 gray|0.025175 light|0.025175 grey|0.025175 gainsboro|0.0085379  "
		}
	}
}
