{
	"add": {
		"doc": {
			"id": "1dba853b813eb6d6d25437399c8f1b25fbda8730bbc5ff0867456149a6556d5a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Fort_Yellowstone_Canteen_YNP1.jpg/220px-Fort_Yellowstone_Canteen_YNP1.jpg",
				"previous": "Captain Hiram M. Chittenden was the U.S. Army Corps of Engineers senior engineer in Yellowstone from 1899–1906. The Corps had been responsible for road and other infrastructure construction within the park since 1883.[17] In 1901, in cooperation with Captain John Pitcher, Acting Park Superintendent, he began a series of projects to improve the quality of life at the fort. Chittenden had a reservoir built in 1901 to provide a consistent supply of water for irrigation, human consumption and fire fighting. The engineers oversaw a project during 1901 which cleared, manured and seeded the area immediately in front of officers' row to create a grassy parade ground and seeded areas around the various buildings to reduce perennially dusty summer conditions. Fort Yellowstone transitioned from oil to electric lighting in 1902 after Chittenden completed a 100-kilowatt powerplant 300 yards (270 m) east of the fort.[5] The powerplant and reservoir no longer exist, but most of the grassy areas around Fort Yellowstone that Chittenden planned remain.[7]",
				"after": "In 1903, Captain Chittenden oversaw the design and construction of the second stone building in Yellowstone, the engineers headquarters (Bldg 39), often called the \"Pagoda\" because of its design. This structure is in a prominent but isolated location just north of the fort.[5] In 1918, after the National Park Service began administration of the park, the engineer's headquarters building became the first official park headquarters.[18]",
			"color": "dark|0.17155 gray|0.17155 dark|0.17155 grey|0.17155 gray|0.13341 grey|0.13341 silver|0.12448 dim|0.10769 gray|0.10769 dim|0.10769 grey|0.10769 light|0.089677 gray|0.089677 light|0.089677 grey|0.089677 gainsboro|0.064532 black|0.057174 linen|0.024305 sea|0.017906 shell|0.017906 light|0.017775 slate|0.017775 gray|0.017775 white|0.017128 smoke|0.017128 old|0.01683 lace|0.01683 slate|0.016693 gray|0.016693 floral|0.016179 white|0.016179 antique|0.015947 white|0.015947 snow|0.01194 olive|0.011091 drab|0.011091 ivory|0.010679 mint|0.010497 cream|0.010497 white|0.0088265 dark|0.0069487 olive|0.0069487 green|0.0069487 beige|0.0061769  "
		}
	}
}
