{
	"add": {
		"doc": {
			"id": "1dba3b120f960a7144051423e10c085052d60f9b931e8716aa829260d15d1c74",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Amanita_bisporigera_59865.jpg/220px-Amanita_bisporigera_59865.jpg",
			"previous": [],
				"after": "The spore print of A. bisporigera, like most Amanita, is white. The spores are roughly spherical, thin-walled, hyaline (translucent), amyloid, and measure 7.8–9.6 by 7.0–9.0 μm. The cap cuticle is made of partially gelatinized, filamentous interwoven hyphae, 2–6 μm in diameter. The tissue of the gill is bilateral, meaning it diverges from the center of the gill to its outer edge. The subhymenium is ramose—composed of relatively thin branching, unclamped hyphae. The spore-bearing cells, the basidia, are club-shaped, thin-walled, without clamps, with dimensions of 34–45 by 4–11 μm. They are typically two-spored, although rarely three- or four-spored forms have been found.[14] Although the two-spored basidia are a defining characteristic of the species, there is evidence of a tendency to shift towards producing four-spored basidia as the fruiting season progresses.[11] The volva is composed almost exclusively of densely interwoven filamentous hyphae, 2–10 μm in diameter, that are sparsely to moderately branched. There are few small inflated cells, which are mostly spherical to broadly elliptic. The tissue of the stem is made of abundant, sparsely branched, filamentous hyphae, without clamps, measuring 2–5 μm in diameter. The inflated cells are club-shaped, longitudinally oriented, and up to 2–3 by 15.7 μm. The annulus is made of abundant moderately branched filamentous hyphae, measuring 2–6 μm in diameter. The inflated cells are sparse, broadly elliptic to pear-shaped, and are rarely larger than 31 by 22 μm.[14] Pleurocystidia and cheilocystidia (cystidia found on the gill faces and edges, respectively) are absent, but there may be cylindrical to sac-like cells of the partial veil on the gill edges; these cells are hyaline and measure 24–34 by 7–16 μm.[10]",
			"color": "dark|0.99597 khaki|0.99597  "
		}
	}
}
