{
	"add": {
		"doc": {
			"id": "1dc392c8637a2014a70c08d2e2534aa99a5d06f1b7a29c93b3f92a0b1f775032",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Migraciones_austronesias.png/220px-Migraciones_austronesias.png",
				"previous": "The Spanish caste system based on race was abolished after the Philippines' independence from Spain in 1898, and the word 'Filipino' expanded to include the entire population of the Philippines regardless of racial ancestry.",
				"after": "The majority of Filipinos are Austronesians, a linguistic and genetic group that includes other ethnicities from maritime Southeast Asia, Madagascar, and the Pacific islands.[69] The current predominant theory on Austronesian expansion holds that Austronesians settled the Philippine islands through successive southward and eastward seaborne migrations from the Neolithic Austronesian populations of Taiwan.[70] Other hypotheses have also been put forward based on linguistic, archeological, and genetic studies. These include an origin from mainland South China (linking them to the Liangzhu culture and the Tapengkeng culture, later displaced or assimilated by the expansion of Sino-Tibetan peoples);[71][72] an in situ origin from the Sundaland continental shelf prior to the sea level rise at the end of the last glacial period (c. 10,000 BC);[73][74] or a combination of the two (the Nusantao Maritime Trading and Communication Network hypothesis) which advocates cultural diffusion rather than a series of linear migrations.[75]",
			"color": "misty|0.36717 rose|0.36717 lavender|0.25557 blush|0.25557 pink|0.05838 gray|0.02927 grey|0.02927 dark|0.023395 gray|0.023395 dark|0.023395 grey|0.023395 dim|0.022859 gray|0.022859 dim|0.022859 grey|0.022859 sea|0.02041 shell|0.02041 dark|0.018111 khaki|0.018111 light|0.017296 pink|0.017296 linen|0.015927 white|0.015403 smoke|0.015403 snow|0.015223 silver|0.01438 ghost|0.013122 white|0.013122 floral|0.012782 white|0.012782 white|0.01275 alice|0.011713 blue|0.011713 light|0.011489 gray|0.011489 light|0.011489 grey|0.011489 mint|0.011231 cream|0.011231 azure|0.0097067 gainsboro|0.0093543 antique|0.008915 white|0.008915 wheat|0.0046257 rosy|0.0040336 brown|0.0040336  "
		}
	}
}
