{
	"add": {
		"doc": {
			"id": "1dc4670bdf04c2bf9f64221b5a359baf1dca96c1a6d98f713750da62272b89fd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/NO_Mint_Courtyard.jpg/250px-NO_Mint_Courtyard.jpg",
				"previous": "The Mint's location occupies a prominent place in civic history. It sits at one of the two River corners of the French Quarter, which was formerly the entire city, or Vieux Carré, of New Orleans. Under French and Spanish rule this location was home to one of the city's defensive fortifications. In 1792 the Spanish governor, Francisco Luis Héctor de Carondelet, erected Fort San Carlos (later Fort St. Charles) here. The fort was demolished in 1821; and the nearby area was later named Jackson Square in honor of Andrew Jackson. As a general in the United States Army, Jackson's leadership had saved the city from invading British forces during December of 1814 and through January 8, 1815, the date of the famous Battle of New Orleans, the last significant battle of the War of 1812.[13]",
				"after": "The Mint building, which was constructed in red brick, was designed by architect William Strickland in the Greek Revival style, like most 19th-century public buildings in the United States.[14] Strickland was a student of the architect Benjamin Latrobe, a disciple of Neoclassicism who had helped design the United States Capitol building in Washington, D.C. Strickland himself, based in Philadelphia, had already designed the Philadelphia Mint building and the Second Bank of the United States, and would go on to design the Charlotte and Dahlonega facilities, making him the architect of the first four U.S. mint buildings.[15] Martin Gordon supervised the building's construction, which was undertaken by Benjamin F. Fox, the master carpenter and joiner, and John Mitchell, the master stonemason and builder.[16]",
			"color": "dim|0.23565 gray|0.23565 dim|0.23565 grey|0.23565 gray|0.17289 grey|0.17289 dark|0.1209 gray|0.1209 dark|0.1209 grey|0.1209 dark|0.060479 slate|0.060479 gray|0.060479 silver|0.057051 rosy|0.038836 brown|0.038836 light|0.029268 gray|0.029268 light|0.029268 grey|0.029268 slate|0.025485 gray|0.025485 gainsboro|0.022728 light|0.021389 slate|0.021389 gray|0.021389 white|0.019374 smoke|0.019374 alice|0.017084 blue|0.017084 mint|0.016703 cream|0.016703 ghost|0.016646 white|0.016646 snow|0.016504 azure|0.016235 white|0.0162 light|0.01542 blue|0.01542 floral|0.01377 white|0.01377 sea|0.012893 shell|0.012893 lavender|0.0093905 blush|0.0093905 light|0.0073554 steel|0.0073554 blue|0.0073554 light|0.0065936 cyan|0.0065936 powder|0.0059078 blue|0.0059078 misty|0.0048928 rose|0.0048928 linen|0.0045101 honeydew|0.0044173 ivory|0.0041836  "
		}
	}
}
