{
	"add": {
		"doc": {
			"id": "1dc5525fefbc633ef507cf43bdf9d367c71b86065879325c2ede0f6fa0a9878e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Cherry_Springs_State_Park_Small_Pavilion.jpg/220px-Cherry_Springs_State_Park_Small_Pavilion.jpg",
				"previous": "Cherry Springs was home to CCC Camp S-136-Pa, which was established on May 27, 1933.[25] According to the camp's 1936 History: \"Through the efforts of the [CCC] enrollees Cherry Springs Park, formerly a clearing, has been transformed into a park of which the people of Potter County can be proud of.\"[sic][26] A historic recreation of the original tavern was built, as were a rifle range, picnic tables and shelters, roads, and hiking trails. The young men of the CCC camps worked to clear brush from the woods as a fire prevention measure. After clearing the woods, they planted stands of Norway Spruce and white pine, as well as an apple orchard.[2][10] Camp-136-Pa closed on July 10, 1937.[25]",
				"after": "Men from CCC Camp S-88-Pa, based at nearby Lyman Run in Potter County,[27] were also active in the park. In 1939, they built a structure at Cherry Springs which is \"the largest and most unique of the CCC-built picnic pavilions\" in the state, and is listed on the National Register of Historic Places.[21] The pavilion overlooks PA Route 44 and is shaped like an H, with two partially enclosed structures (the vertical lines of the H) connected by a breezeway (the horizontal bar). The breezeway is a roof supported by eight log columns with log railings. The ends of the pavilion are built from log walls with white chinking, like log cabins. Each end has a large opening to the breezeway in one wall, while the other three sides are fully enclosed with a large window in the wall facing the highway, a stone fireplace and chimney on the opposite wall, and a door flanked by windows on the wall opposite the breezeway.[3][21][28]",
			"color": "gray|0.49234 grey|0.49234 dim|0.47576 gray|0.47576 dim|0.47576 grey|0.47576 dark|0.023018 gray|0.023018 dark|0.023018 grey|0.023018  "
		}
	}
}
