{
	"add": {
		"doc": {
			"id": "1dcc6d2f335a64f29380dc82234becc567d8761f572106362628df3ebdae6334",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/51/Elvispresleydebutalbum.jpeg/220px-Elvispresleydebutalbum.jpeg",
			"previous": [],
				"after": "On January 10, 1956, Presley made his first recordings for RCA in Nashville.[93] Extending the singer's by now customary backup of Moore, Black, and Fontana, RCA enlisted pianist Floyd Cramer, guitarist Chet Atkins, and three background singers, including Gordon Stoker of the popular Jordanaires quartet, to fill out the sound.[94] The session produced the moody, unusual \"Heartbreak Hotel\", released as a single on January 27.[93] Parker finally brought Presley to national television, booking him on CBS's Stage Show for six appearances over two months. The program, produced in New York, was hosted on alternate weeks by big band leaders and brothers Tommy and Jimmy Dorsey. After his first appearance, on January 28, introduced by disc jockey Bill Randle, Presley stayed in town to record at RCA's New York studio. The sessions yielded eight songs, including a cover of Carl Perkins' rockabilly anthem \"Blue Suede Shoes\". In February, Presley's \"I Forgot to Remember to Forget\", a Sun recording initially released the previous August, reached the top of the Billboard country chart.[95] Neal's contract was terminated and, on March 2, Parker became Presley's manager.[96]",
			"color": "light|0.16527 gray|0.16527 light|0.16527 grey|0.16527 silver|0.16244 gainsboro|0.13409 dark|0.12639 gray|0.12639 dark|0.12639 grey|0.12639 gray|0.0512 grey|0.0512 linen|0.048794 white|0.035896 smoke|0.035896 dim|0.031327 gray|0.031327 dim|0.031327 grey|0.031327 sea|0.031191 shell|0.031191 black|0.029227 old|0.025227 lace|0.025227 floral|0.02512 white|0.02512 snow|0.020364 mint|0.019013 cream|0.019013 dark|0.015777 sea|0.015777 green|0.015777 ivory|0.015666 white|0.014026 honeydew|0.0091747 antique|0.006921 white|0.006921 ghost|0.006296 white|0.006296 beige|0.0062955 lavender|0.0048917 blush|0.0048917 azure|0.0046947 misty|0.0034705 rose|0.0034705  "
		}
	}
}
