{
	"add": {
		"doc": {
			"id": "1dcfc43ce659207677f7870c74bd33780549abd0c0053bccc226d38646d4ae71",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Picture_203.jpg/220px-Picture_203.jpg",
				"previous": "The V&A is one of 17 museums across Europe and the Mediterranean participating in a project called Discover Islamic Art. Developed by the Brussels-based consortium Museum With No Frontiers, this online \"virtual museum\" brings together more than 1200 works of Islamic art and architecture into a single database.",
				"after": "The Victorian parts of the building have a complex history, with piecemeal additions by different architects. Founded in May 1852, it was not until 1857 that the museum moved to the present site. This area of London was known as Brompton but had been renamed South Kensington. The land was occupied by Brompton Park House, which was extended, most notably by the \"Brompton Boilers\",[34] which were starkly utilitarian iron galleries with a temporary look and were later dismantled and used to build the V&A Museum of Childhood. The first building to be erected that still forms part of the museum was the Sheepshanks Gallery in 1857 on the eastern side of the garden.[35] Its architect was civil engineer Captain Francis Fowke, Royal Engineers, who was appointed by Cole.[36] The next major expansions were designed by the same architect, the Turner and Vernon galleries built 1858-9[37] to house the eponymous collections (later transferred to the Tate Gallery) and now used as the picture galleries and tapestry gallery respectively. The North[38] and South Courts,[39] were then built, both of which opened by June 1862. They now form the galleries for temporary exhibitions and are directly behind the Sheepshanks Gallery. On the very northern edge of the site is situated the Secretariat Wing,[40] also built in 1862 this houses the offices and board room etc. and is not open to the public.",
			"color": "dim|0.35512 gray|0.35512 dim|0.35512 grey|0.35512 gray|0.24684 grey|0.24684 black|0.096953 dark|0.067337 gray|0.067337 dark|0.067337 grey|0.067337 dark|0.06132 slate|0.06132 gray|0.06132 silver|0.036313 light|0.026664 gray|0.026664 light|0.026664 grey|0.026664 gainsboro|0.020986  "
		}
	}
}
