{
	"add": {
		"doc": {
			"id": "1dd5c290829c17847dcead8e254b1c5ab39a66a57480620253b5e4924f51a0a6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Sthambha_buttalika_sculpture_in_Chennakesava_temple_at_Belur.jpg/170px-Sthambha_buttalika_sculpture_in_Chennakesava_temple_at_Belur.jpg",
				"previous": "Below the superstructure of the vimana are temple \"eaves\"[30] projecting half a meter from the wall. Below the eaves two different decorative schemes may be found, depending on whether a temple was built in the early or the later period of the empire. In the early temples built prior to the 13th century, there is one eave and below this are decorative miniature towers. A panel of Hindu deities and their attendants are below these towers, followed by a set of five different mouldings forming the base of the wall. In the later temples there is a second eave running about a metre below the upper eaves with decorative miniature towers placed between them. The wall images of gods are below the lower eaves, followed by six different mouldings of equal size. This is broadly termed \"horizontal treatment\".[31] The six mouldings at the base are divided in two sections. Going from the very base of the wall, the first horizontal layer contains a procession of elephants, above which are horsemen and then a band of foliage. The second horizontal section has depictions of the Hindu epics and Puranic scenes executed with detail. Above this are two friezes of yallis or makaras (imaginary beasts) and hamsas (swans). The vimana (tower) is divided into three horizontal sections and is even more ornate than the walls.[32]",
				"after": "Hoysala artists are famous for their sculptural detail, be it in the depiction of the Hindu epics, yallis, deities, Kirtimukha (gargoyles), eroticism or aspects of daily life. Their medium, the soft chlorite schist, enabled a virtuoso carving style. Their workmanship shows an attention paid to precise detail. Every aspect down to a fingernail or toenail is perfected.",
			"color": "silver|0.085749 white|0.078748 smoke|0.078748 snow|0.073329 mint|0.072982 cream|0.072982 azure|0.072635 white|0.072615 light|0.070868 gray|0.070868 light|0.070868 grey|0.070868 sea|0.068725 shell|0.068725 floral|0.067079 white|0.067079 ghost|0.063893 white|0.063893 alice|0.060753 blue|0.060753 dark|0.055254 gray|0.055254 dark|0.055254 grey|0.055254 gainsboro|0.05094 ivory|0.05002 honeydew|0.01721 lavender|0.015649 blush|0.015649 linen|0.0098581 old|0.0085145 lace|0.0085145  "
		}
	}
}
