{
	"add": {
		"doc": {
			"id": "1dd6b78cbc69ab1005bb20cf5970b7169ce44a50527d26ea64fdef5d8eacf533",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Give_it_2_me-Madonna_Lola.jpg/230px-Give_it_2_me-Madonna_Lola.jpg",
			"previous": [],
				"after": "\"Give It 2 Me\" received critical acclaim from music critics. Elysa Gardner from USA Today called the song \"thumping\" and \"breathless\", naming it one of the standout tracks of the album.[16] Caryn Ganz of Rolling Stone described \"Give It 2 Me\" as a \"thumpy self-empowerment anthem\".[6] About.com listed it as one of the top tracks on Hard Candy, and called it a \"wonderful, fun Madonna song to dance to\".[4] Mark Beech from Bloomberg Television complimented the track's \"insidious beats\".[12] Sal Cinquemani of Slant Magazine called it \"a little careerism on the dance floor\", for the line \"Give me a record and I'll break it\". However, she criticised the \"Get stupid\" interlude, calling it \"plain stupid\".[13] Jon Pareles from The New York Times, and Alexis Petridis of The Guardian, compared the song with Rick James' \"Super Freak\" (1981).[14][17] Mark Savage from BBC described the song as \"one of the [Hard Candy] record's few out-and-out pop moments, featuring a cute, bouncy beat, and a sense of humour that has been missing from Madonna's music since her Dick Tracy days.\"[11] Tom Ewing of Pitchfork named the song as one of Hard Candy's better tracks, possessing the album's \"most urgent tune\", stating that Madonna sings the lyrics \"Show me a record and I'll break it/ I can go on and on\" over \"hard-pushing electro-ska whose keyboards break up trying to keep pace.\"[18]",
			"color": "black|0.25657 gray|0.11079 grey|0.11079 dim|0.093438 gray|0.093438 dim|0.093438 grey|0.093438 dark|0.079662 gray|0.079662 dark|0.079662 grey|0.079662 midnight|0.040056 blue|0.040056 silver|0.034477 light|0.025891 gray|0.025891 light|0.025891 grey|0.025891 gainsboro|0.021905 peach|0.020925 puff|0.020925 dark|0.018572 salmon|0.018572 rosy|0.017531 brown|0.017531 white|0.015576 smoke|0.015576 burly|0.015139 wood|0.015139 sea|0.013891 shell|0.013891 snow|0.01313 tan|0.01297 ghost|0.012467 white|0.012467 lavender|0.012059 blush|0.012059 floral|0.011621 white|0.011621 alice|0.011453 blue|0.011453 white|0.011378 linen|0.0099378 slate|0.0098406 gray|0.0098406 mint|0.0095625 cream|0.0095625 misty|0.0093476 rose|0.0093476 azure|0.0079773 lavender|0.0075116 light|0.007309 slate|0.007309 gray|0.007309 bisque|0.0068478 antique|0.0067283 white|0.0067283  "
		}
	}
}
