{
	"add": {
		"doc": {
			"id": "1de13881aa067e48192225ff1732a09f25acf19079ba8650e55c94c2e06d8da0",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/8/86/UN_Counteroffensive_Korea_Feb_to_April_1951.PNG/220px-UN_Counteroffensive_Korea_Feb_to_April_1951.PNG",
			"previous": [],
				"after": "The United Nations counter offensive between February and April 1951 had been largely successful, with the US Eighth Army pushing the Chinese north of the Han River during Operation Killer, while Seoul was recaptured in mid-March during Operation Ripper and UN forces once again approached the 38th parallel.[3] Regardless, the strained relationship between General Douglas MacArthur and US President Harry S. Truman led to MacArthur's dismissal as Commander-in-Chief, and his replacement by General Matthew B. Ridgway.[4] Consequently, on 14 April 1951, General James Van Fleet replaced Ridgway as commander of the US Eighth Army and the United Nations forces in Korea. Ridgway flew to Tokyo the same day to replace MacArthur.[5] Meanwhile, the offensive continued with a series of short thrusts. Operation Courageous, in late March, pushed forward to the Benton Line, 8 kilometres (5.0 mi) south of the 38th parallel, while Operation Rugged in early-April pushed just north of the 38th parallel to the Kansas Line. Finally, in mid-April a further advance moved the US Eighth Army to the Utah Line.[6]",
			"color": "misty|0.50793 rose|0.50793 rosy|0.079089 brown|0.079089 thistle|0.069209 light|0.050021 gray|0.050021 light|0.050021 grey|0.050021 lavender|0.049238 blush|0.049238 gainsboro|0.038451 silver|0.034608 lavender|0.019458 light|0.018731 steel|0.018731 blue|0.018731 dark|0.017966 gray|0.017966 dark|0.017966 grey|0.017966 sea|0.01318 shell|0.01318 linen|0.012508 white|0.011757 smoke|0.011757 ghost|0.011086 white|0.011086 alice|0.010342 blue|0.010342 snow|0.0096794 white|0.0079517 floral|0.0075059 white|0.0075059 gray|0.0068247 grey|0.0068247 mint|0.0061922 cream|0.0061922 azure|0.005841  "
		}
	}
}
