{
	"add": {
		"doc": {
			"id": "1e005f2f24e0e4304f5095d0dd264cfa875b4a36321c0bbc5ad04b53c9d50211",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Museum_f%C3%BCr_Ostasiatische_Kunst_Dahlem_Berlin_Mai_2006_041.jpg/220px-Museum_f%C3%BCr_Ostasiatische_Kunst_Dahlem_Berlin_Mai_2006_041.jpg",
				"previous": "The sixty-one year reign of the Kangxi Emperor was the longest of any Chinese emperor. Kangxi's reign is also celebrated as the beginning of an era known as the \"High Qing\", during which the dynasty reached the zenith of its social, economic and military power. Kangxi's long reign started when he was eight years old upon the untimely demise of his father. To prevent a repeat of Dorgon's dictatorial monopolizing of power during the regency, the Shunzhi Emperor, on his deathbed, hastily appointed four senior cabinet ministers to govern on behalf of his young son. The four ministers — Sonin, Ebilun, Suksaha, and Oboi — were chosen for their long service, but also to counteract each other's influences. Most important, the four were not closely related to the imperial family and laid no claim to the throne. However as time passed, through chance and machination, Oboi, the most junior of the four, achieved such political dominance as to be a potential threat. Even though Oboi's loyalty was never an issue, his personal arrogance and political conservatism led him into an escalating conflict with the young emperor. In 1669 Kangxi, through trickery, disarmed and imprisoned Oboi — a significant victory for a fifteen-year-old emperor over a wily politician and experienced commander.",
				"after": "The early Manchu rulers also established two foundations of legitimacy which help to explain the stability of their dynasty. The first was the bureaucratic institutions and the neo-Confucian culture which they adopted from earlier dynasties.[43] Manchu rulers and Han Chinese scholar-official elites gradually came to terms with each other. The examination system offered a path for ethnic Han to become officials. Imperial patronage of Kangxi Dictionary demonstrated respect for Confucian learning, while the Sacred Edict of 1670 effectively extolled Confucian family values. The second major source of stability was the Central Asian aspect of their Manchu identity which allowed them to appeal to Mongol, Tibetan and Uighur constituents. The Qing rulers were simultaneously emperors to the Han Chinese, khans to the Mongols, and presented themselves as Buddhist sage rulers, patrons of Tibetan Buddhism, for the newly conquered areas of Central Asia.[44] The Kangxi Emperor also welcomed to his court Jesuit missionaries, who had first come to China under the Ming. Missionaries including Tomás Pereira, Martino Martini, Johann Adam Schall von Bell, Ferdinand Verbiest and Antoine Thomas held significant positions as military weapons experts, mathematicians, cartographers, astronomers and advisers to the emperor. The relationship of trust was however lost in the later Chinese Rites controversy.",
			"color": "antique|0.094249 white|0.094249 gray|0.08152 grey|0.08152 black|0.077063 dark|0.069906 gray|0.069906 dark|0.069906 grey|0.069906 dim|0.065805 gray|0.065805 dim|0.065805 grey|0.065805 tan|0.065739 linen|0.065689 gainsboro|0.057716 old|0.053005 lace|0.053005 misty|0.050981 rose|0.050981 papaya|0.050902 whip|0.050902 sea|0.046442 shell|0.046442 floral|0.037069 white|0.037069 silver|0.035097 light|0.034948 gray|0.034948 light|0.034948 grey|0.034948 saddle|0.02485 brown|0.02485 beige|0.01879 blanched|0.0080964 almond|0.0080964 burly|0.0077983 wood|0.0077983  "
		}
	}
}
