{
	"add": {
		"doc": {
			"id": "1e29641cb824a9b0c769eb21afbe65dd5b584214631921b5ed1eaea11692f7d4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Chateau-de-versailles-cour.jpg/440px-Chateau-de-versailles-cour.jpg",
			"previous": [],
				"after": "Since ancient times, much of the finest art has represented a deliberate display of wealth or power, often achieved by using massive scale and expensive materials. Much art has been commissioned by rulers or religious establishments, with more modest versions only available to the most wealthy in society. Nevertheless, there have been many periods where art of very high quality was available, in terms of ownership, across large parts of society, above all in cheap media such as pottery, which persists in the ground, and perishable media such as textiles and wood. In many different cultures, the ceramics of indigenous peoples of the Americas are found in such a wide range of graves that they were clearly not restricted to a social elite, though other forms of art may have been. Reproductive methods such as moulds made mass-production easier, and were used to bring high-quality Ancient Roman pottery and Greek Tanagra figurines to a very wide market. Cylinder seals were both artistic and practical, and very widely used by what can be loosely called the middle class in the Ancient Near East. Once coins were widely used these also became an art form that reached the widest range of society. Another important innovation came in the 15th century in Europe, when printmaking began with small woodcuts, mostly religious, that were often very small and hand-colored, and affordable even by peasants who glued them to the walls of their homes. Printed books were initially very expensive, but fell steadily in price until by the 19th century even the poorest could afford some with printed illustrations. Popular prints of many different sorts have decorated homes and other places for centuries.",
			"color": "gray|0.2219 grey|0.2219 dark|0.21595 gray|0.21595 dark|0.21595 grey|0.21595 dim|0.15858 gray|0.15858 dim|0.15858 grey|0.15858 slate|0.07974 gray|0.07974 light|0.075816 slate|0.075816 gray|0.075816 tan|0.043052 silver|0.035736 sienna|0.025016 rosy|0.023927 brown|0.023927 dark|0.023627 slate|0.023627 gray|0.023627 light|0.015078 gray|0.015078 light|0.015078 grey|0.015078 black|0.014127 peach|0.011838 puff|0.011838  "
		}
	}
}
