{
	"add": {
		"doc": {
			"id": "1e2cd18321ac008e441f49336ea99081b9fb07b1c4a98f67000750c78b58f748",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Sacred_Cow_airplane.jpg/220px-Sacred_Cow_airplane.jpg",
				"previous": "Franklin D. Roosevelt was the first president to fly in an aircraft while in office. The first aircraft obtained specifically for presidential travel was a Douglas Dolphin amphibian delivered in 1933 which was designated RD-2 by the US Navy and based at the Naval base at Anacostia D.C. The Dolphin was modified with a luxury upholstery for four passengers and a small separate sleeping compartment.[7] The aircraft remained in service as a presidential transport from 1933 until 1939.[8] There are no reports as to whether the president ever flew in the aircraft though. During World War II, Roosevelt traveled on the Dixie Clipper, a Pan Am-crewed Boeing 314 flying boat to the 1943 Casablanca Conference, in Morocco, a flight that covered 5,500 miles (in three \"legs\").[9] The threat from the German submarines throughout the Battle of the Atlantic made air travel the preferred method of VIP transatlantic transportation.[10]",
				"after": "Concerned about relying upon commercial airlines to transport the president, USAAF leaders ordered the conversion of a military aircraft to accommodate the special needs of the Commander in Chief.[11] The first dedicated aircraft proposed for presidential use was a C-87A VIP transport aircraft. This aircraft, number 41-24159, was re-modified in 1943 for use as a presidential VIP transport, the Guess Where II, intended to carry President Franklin D. Roosevelt on international trips.[12] Had it been accepted, it would have been the first aircraft to be used in presidential service, in effect the first Air Force One. However, after a review of the C-87's highly controversial safety record in service, the Secret Service flatly refused to approve the Guess Where II for presidential carriage.[12] Also, the C-87 was a derivative of the Consolidated B-24 Liberator bomber, so it presented strong offensive impressions to both enemy fighter aircraft as well as foreign dignitaries being visited, an issue not present with airframes that were used purely for transport. The Guess Where II was then used to transport senior members of the Roosevelt administration on various trips. In March 1944, it transported Eleanor Roosevelt on a goodwill tour of several Latin American countries. The C-87 was scrapped in 1945.[12]",
			"color": " "
		}
	}
}
