{
	"add": {
		"doc": {
			"id": "1e312461006b0b363484f9747b437abbb2d462dd6ef2a81aaa6869744258666f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Cross_Fla_Barge_canal_SR19W-01.jpg/220px-Cross_Fla_Barge_canal_SR19W-01.jpg",
				"previous": "Florida in the 20th century experienced a massive migration into the state. Undeveloped land sold well and draining to reclaim wetlands has often gone unchecked, and often encouraged by government. The St. Johns headwaters decreased in size from 30 square miles (78 km2) to one between 1900 and 1972.[128] Much of the land was reclaimed for urban use, but agricultural needs took their toll as fertilizers and runoff from cattle ranching washed into the St. Johns. Without wetlands to filter the pollutants, the chemicals stayed in the river and flushed into the Atlantic Ocean. Boaters destroyed the floating islands of muck and weeds in the upper basin with dynamite, causing the lakes to drain completely.[129]",
				"after": "What could have been the most serious human impact on nature in central Florida was the Cross Florida Barge Canal, an attempt to connect the Gulf and Atlantic coasts of the state by channeling the Ocklawaha River, first authorized in 1933.[note 5] The canal was intended to be 171 miles (275 km) long, 250 feet (76 m) wide, and 30 feet (9.1 m) deep.[130] Canal construction was top among the engineering priorities in the state, and by 1964 the U.S. Army Corps of Engineers began construction on the Cross Florida Barge Canal. Flood control was the primary impetus behind its construction, though the broader reasoning and feasibility of the project remained unclear. The Army Corps of Engineers was also constructing hundreds of miles of canals in the Everglades at the same time and by the 1960s was being accused of wasting tax money through its unnecessary construction projects.[131] In 1969 the Environmental Defense Fund filed suit in federal court to stop construction on the canal, citing irreparable harm that would be done to Florida waterways and the Floridan Aquifer, central and north Florida's fresh water source.[132]",
			"color": "dark|0.30175 olive|0.30175 green|0.30175 light|0.14279 steel|0.14279 blue|0.14279 dim|0.14048 gray|0.14048 dim|0.14048 grey|0.14048 slate|0.11435 gray|0.11435 light|0.098093 slate|0.098093 gray|0.098093 dark|0.073646 slate|0.073646 gray|0.073646 gray|0.03884 grey|0.03884 dark|0.031988 khaki|0.031988 steel|0.01623 blue|0.01623 dark|0.014641 gray|0.014641 dark|0.014641 grey|0.014641  "
		}
	}
}
