{
	"add": {
		"doc": {
			"id": "1e3d241da79526e3ff4a4b4667d8534f90071bd6fe76ea74b9b1f6380bde5760",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Christopher_Kraft%2C_flight_director_during_Project_Mercury%2C_works_at_his_console_inside_the_Flight_Control_area_at_Mercury_Mission_Control.jpg/220px-Christopher_Kraft%2C_flight_director_during_Project_Mercury%2C_works_at_his_console_inside_the_Flight_Control_area_at_Mercury_Mission_Control.jpg",
				"previous": "Mercury-Atlas 6, the flight of John Glenn, proved to be a testing experience both for Mission Control and for Kraft. One book on the history of the Apollo program calls it \"the single event that decisively shaped Flight Operations.\"[18] The mission, the first orbital flight by an American, unfolded normally until Glenn began his second orbit. At that point Kraft's systems controller, Don Arabian, reported that telemetry was showing a \"Segment 51\" indicator. This suggested that the capsule's landing bag, which was meant to deploy upon splashdown in order to provide a cushion, might have deployed early. Kraft believed that the Segment 51 indicator was due to faulty instrumentation rather than to an actual early deployment. However, if he was wrong, it would mean that the capsule's heat shield, which fitted on top of the landing bag, was now loose. A loose heat shield could cause the capsule to burn up during re-entry.[19]",
				"after": "On consulting with his flight controllers, Kraft became convinced that the indication was false, and that no action was needed. However, his superiors, including Mercury capsule designer Max Faget, felt differently. They overruled Kraft, telling him to instruct Glenn to leave the capsule's retrorocket package on during re-entry. The reasoning was that the package, which was strapped over the heatshield, would hold the heatshield in place if it was loose. Kraft, however, felt that this was an unacceptable risk. \"I was aghast,\" he remembered. \"If any of three retrorockets had solid fuel remaining, an explosion could rip everything apart.\"[20] Yet he agreed to follow the plan advocated by Faget and by Walt Williams, his superior in the flight operations division. The retrorockets would be kept on.",
			"color": "dark|0.18631 gray|0.18631 dark|0.18631 grey|0.18631 gray|0.13741 grey|0.13741 silver|0.073615 white|0.050239 smoke|0.050239 dim|0.047453 gray|0.047453 dim|0.047453 grey|0.047453 light|0.046945 gray|0.046945 light|0.046945 grey|0.046945 sea|0.046908 shell|0.046908 snow|0.046112 floral|0.045331 white|0.045331 white|0.044316 mint|0.043827 cream|0.043827 ghost|0.043508 white|0.043508 azure|0.040046 alice|0.037708 blue|0.037708 gainsboro|0.036905 linen|0.020711 lavender|0.019162 blush|0.019162 ivory|0.018904 black|0.0098981 old|0.0044718 lace|0.0044718  "
		}
	}
}
