{
	"add": {
		"doc": {
			"id": "1e3f449fcfaabbeb7cf46f4089f5e2d3fbf4bb74969f1f049bbb36ec33e82c4a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/New_York_Gay_Pride_2011.jpg/250px-New_York_Gay_Pride_2011.jpg",
				"previous": "New York City has the largest European and non-Hispanic white population of any American city. At 2.7 million in 2012, New York's non-Hispanic white population is larger than the non-Hispanic white populations of Los Angeles (1.1 million), Chicago (865,000), and Houston (550,000) combined.[232] The European diaspora residing in the city is very diverse. According to 2012 Census estimates, there were roughly 560,000 Italian Americans, 385,000 Irish Americans, 253,000 German Americans, 223,000 Russian Americans, 201,000 Polish Americans, and 137,000 English Americans. Additionally, Greek and French Americans numbered 65,000 each, with those of Hungarian descent estimated at 60,000 people. Ukrainian and Scottish Americans numbered 55,000 and 35,000, respectively. People identifying ancestry from Spain numbered 30,838 total in 2010.[233] People of Norwegian and Swedish descent both stood at about 20,000 each, while people of Czech, Lithuanian, Portuguese, Scotch-Irish, and Welsh descent all numbered between 12,000–14,000 people.[234] Arab Americans number over 160,000 in New York City,[235] with the highest concentration in Brooklyn. Central Asians, primarily Uzbek Americans, are a rapidly growing segment of the city's non-Hispanic white population, enumerating over 30,000, and including over half of all Central Asian immigrants to the United States,[236] most settling in Queens or Brooklyn. Albanian Americans are most highly concentrated in the Bronx.[237]",
				"after": "The wider New York City metropolitan area is also ethnically diverse.[240] The New York region continues to be by far the leading metropolitan gateway for legal immigrants admitted into the United States, substantially exceeding the combined totals of Los Angeles and Miami, the next most popular gateway regions.[241][242][243][244] It is home to the largest Jewish as well as Israeli communities outside Israel, with the Jewish population in the region numbering over 1.5 million in 2012 and including many diverse Jewish sects from around the Middle East and Eastern Europe.[228] The metropolitan area is also home to 20% of the nation's Indian Americans and at least 20 Little India enclaves, as well as 15% of all Korean Americans and four Koreatowns;[245][246] the largest Asian Indian population in the Western Hemisphere; the largest Russian American,[221] Italian American, and African American populations; the largest Dominican American, Puerto Rican American, and South American[221] and second-largest overall Hispanic population in the United States, numbering 4.8 million;[233] and includes at least 6 established Chinatowns within New York City alone,[247] with the urban agglomeration comprising a population of 779,269 overseas Chinese as of 2013 Census estimates,[248] the largest outside of Asia.[215][216]",
			"color": "black|0.23851 dim|0.096971 gray|0.096971 dim|0.096971 grey|0.096971 gray|0.071692 grey|0.071692 dark|0.060613 gray|0.060613 dark|0.060613 grey|0.060613 silver|0.037825 light|0.025211 gray|0.025211 light|0.025211 grey|0.025211 gainsboro|0.020106 slate|0.020034 gray|0.020034 light|0.019292 slate|0.019292 gray|0.019292 crimson|0.019062 dark|0.019002 red|0.019002 maroon|0.018473 tan|0.018314 rosy|0.015863 brown|0.015863 firebrick|0.015104 tomato|0.01397 light|0.012588 steel|0.012588 blue|0.012588 coral|0.011411 lavender|0.010295 misty|0.0098742 rose|0.0098742 dark|0.0097738 slate|0.0097738 gray|0.0097738 dark|0.0092109 olive|0.0092109 green|0.0092109 white|0.0088619 smoke|0.0088619  "
		}
	}
}
