{
	"add": {
		"doc": {
			"id": "1e510c1b8611d35c9cef68d24186594a08bc19aab1861e2f82dbc22a5a96154a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Okwanuchu_tribe_area.jpg/250px-Okwanuchu_tribe_area.jpg",
			"previous": [],
				"after": "Castle Lake was within the range of the Okwanuchu tribe,[28] one of a number of small Shastan-speaking tribes of Native Americans who were closely related to the adjacent larger Shasta tribe.[29] The Okwanuchu occupied territory near Mount Shasta, including the nearby present-day cities of Mount Shasta and Dunsmuir, California, and the upper Sacramento River canyon (among other areas). The Okwanuchu were speakers of the older Hokan-speaking family of languages, with archaeological sites associated with their range dating back more than 5000 years. However, members of a tribe of the Penutian-speaking family of languages, the Wintu, who arrived in central Northern California about 1200 years ago,[30] were out-competing their Hokan-language family neighbors, and were expanding Wintu territory.[31] It is unclear at the time of first contact with non-Native Americans in the 1820s which tribe was living nearest to Castle Lake. Little or no information is available about Native American use or beliefs regarding Castle Lake; for example, Castle Lake is not mentioned in a published collection of Wintu tales and legends.[32]",
			"color": "dark|0.12726 sea|0.12726 green|0.12726 silver|0.090762 light|0.088174 gray|0.088174 light|0.088174 grey|0.088174 dark|0.085742 gray|0.085742 dark|0.085742 grey|0.085742 gainsboro|0.07598 gray|0.051823 grey|0.051823 red|0.047318 white|0.038824 smoke|0.038824 dim|0.037399 gray|0.037399 dim|0.037399 grey|0.037399 snow|0.028558 sea|0.027485 shell|0.027485 alice|0.026959 blue|0.026959 white|0.026881 ghost|0.026849 white|0.026849 mint|0.024782 cream|0.024782 floral|0.022242 white|0.022242 lavender|0.021613 blush|0.021613 azure|0.020551 black|0.019204 linen|0.016933 rosy|0.015882 brown|0.015882 beige|0.009676 ivory|0.007138 honeydew|0.0063658  "
		}
	}
}
