{
	"add": {
		"doc": {
			"id": "1e5c592ae31a1770bc9d432efdef310f1c5b1146e88bb51c8db63f4dbac6ce51",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Japanese_cruiser_Yakumo.jpg/220px-Japanese_cruiser_Yakumo.jpg",
				"previous": "Britain, which had concluded as early as 1892 that it needed twice as many cruisers as any potential enemy to adequately protect its empire's sea lanes, responded to the perceived threat from France, Russia and, increasingly, Germany with a resumption of armored cruiser construction in 1898 with the Cressy class. At 21 knots, the Cressys were slower than the newer French cruisers. However, their 6-inch (152 mm) belt of Krupp steel was expected to keep out armor-piercing shells from a 6-inch (152 mm) quick-firing gun at likely battle ranges, while their two 9.2-inch (233.7 mm) and 12 6-inch (152 mm) guns offered comparable firepower. The 2,500-ton weight of their belt armor was an improvement over the 1809 tons of the otherwise similar Diadem class and very similar to that of the Canopus class of battleships. The Cressys were the beginning of a rapid expansion in British cruiser construction. Between 1899 and 1905, seven classes of armored cruisers were either completed or laid down, a total of 35 ships.[20]",
				"after": "Japan, which now received British technical assistance in naval matters and purchased larger vessels from France and Britain, began an armored cruiser program of its own. With the end of the First Sino-Japanese War in 1895 and the return under pressure from Russia (in what became known as the \"Triple Intervention\") of the Liaotung peninsula to China, Japan began a 10-year naval build-up program, under the slogan \"Perseverance and determination\" (臥薪嘗胆, Gashinshōtan) in preparation for further confrontations. The core of this 109-ship build-up was the \"Six-Six Program\" of six battleships and six (eventually eight) armored cruisers comparable to the British Cressy class. The Yakumo followed the basic pattern for these cruisers—on a 9,646 long tons (9,801 t) displacement, she carried four 7.99-inch (203 mm) and twelve 6-inch (150 mm) guns, was protected by a 3.5–6.7-inch (89–170 mm) main belt, 2.4-inch (61 mm) armored deck and 5.9-inch (150 mm) turret armor and steamed at 20.5 knots (23.6 mph; 38.0 km/h). They were considered a compromise between cruiser and battleship and were intended to augment capital ship strength in battle squadrons. This practice would persist until World War I.[21][22]",
			"color": "dark|0.32077 slate|0.32077 gray|0.32077 honeydew|0.28515 light|0.21028 cyan|0.21028 mint|0.083328 cream|0.083328 azure|0.056219  "
		}
	}
}
