{
	"add": {
		"doc": {
			"id": "1e87ca58bffb68ca4c1107312495b11cf0292768df0de86eb296866dfaef832b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Santa_Ana_River_Mouth.jpg/220px-Santa_Ana_River_Mouth.jpg",
				"previous": "About 4.8 million people lived in the Santa Ana River basin as of 2000.[15][16] Most of the population is concentrated close to the river in urban centers such as San Bernardino, Riverside, and Santa Ana. In the Inland Empire, most people live in a thin ribbon of land along the river, while the rest of the land is used for agriculture and ranching. In Orange County, however, nearly all the land is urban. As a result, the Santa Ana River watershed can be thought of as having two distinct parts, separated by the Santa Ana Mountains. Some major bodies of water in the watershed include Lake Elsinore, Lake Irvine, Lake Mathews, Lake Perris, Diamond Valley Lake, Lake Skinner, and Big Bear Lake.[16] Only one, Lake Elsinore, is naturally formed.[16] The rest are all formed by dams constructed by county or state water agencies. As an example, Diamond Valley Lake is for the California State Water Project.",
				"after": "Several major Southern California drainage basins border on that of the Santa Ana River. In the northwest is the San Gabriel River, another major river with its mouth in Long Beach. On the southwest, the San Diego Creek watershed forms much of the boundary within Orange County. Some of the rivers and streams that drain the area between the southwestern boundary of the watershed and the Pacific Ocean are Aliso Creek, San Juan Creek,[17] San Mateo Creek, the Santa Margarita River, and the San Luis Rey River. On the east are the drainage basins of the Whitewater River and the Coachella Valley, flowing into the Salton Sea,[16] and on the north is the Mojave River, which flows into the endorheic basin of the Mojave Desert.",
			"color": "light|0.13676 sky|0.13676 blue|0.13676 light|0.13214 slate|0.13214 gray|0.13214 dark|0.12227 gray|0.12227 dark|0.12227 grey|0.12227 sky|0.088979 blue|0.088979 silver|0.074941 dim|0.072911 gray|0.072911 dim|0.072911 grey|0.072911 antique|0.05457 white|0.05457 gray|0.046412 grey|0.046412 slate|0.042236 gray|0.042236 light|0.038513 gray|0.038513 light|0.038513 grey|0.038513 gainsboro|0.023202 light|0.023191 steel|0.023191 blue|0.023191 steel|0.019094 blue|0.019094 linen|0.013687 papaya|0.012999 whip|0.012999 light|0.010035 blue|0.010035 old|0.0092845 lace|0.0092845 beige|0.0085499 blanched|0.0082583 almond|0.0082583 light|0.006344 cyan|0.006344 black|0.0057114  "
		}
	}
}
