{
	"add": {
		"doc": {
			"id": "1e8ed305f4f14a60954a0ee7191b9763bbe3bc709a667a169850442d85066bf9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Silky_sifaka_Allocare.JPG/170px-Silky_sifaka_Allocare.JPG",
				"previous": "Until the 21st century, brief observations and lemur surveys had merely documented the presence of the silky sifaka in special reserves and national parks. More recently, a 14-month study and two short-term studies in Marojejy National Park have revealed previously unknown details about its behavioral biology, communication, and feeding ecology.[20][35] The silky sifaka has a variable social structure and is known to live in male-female pairs, one-male groups, and multi-male/multi-female groups. Group sizes range from two to nine individuals, while the home ranges are estimated to range from 34 to 47 ha (0.13 to 0.18 sq mi), varying in size by location.[17][20][29][36]",
				"after": "According to some studies, the silky sifaka spends most of its day resting and feeding (approximately 44.4% and 25% respectively). It also devotes approximately 16.8% of the day to social behavior, such as personal grooming, social grooming (allogrooming), and play. The rest of the day is spent traveling and sleeping.[20] Other sources report that the species divides half of the day between traveling and foraging, while the rest is spent resting.[17] Daily foraging usually starts at dawn unless delayed by rain. Group movement is usually led by females, and groups usually travel 700 m (2,300 ft) per day, and may climb 500 m (1,600 ft) along vertical slopes.[34] Although the species spends its time in the trees, terrestrial play is not uncommon, even among adults,[36] with play sessions lasting 30 minutes or more.[34] Like other sifakas, it uses a type of arboreal locomotion known as vertical clinging and leaping.[34] Dominance hierarchies have not been documented among female sifakas, including the silky sifaka, although seasonal hierarchies are known to occur.[37] Aggression, which is generally infrequent, occurs primarily during feeding, where females take priority over males,[36] although submissive signals are not always obvious.[34]",
			"color": "black|0.33479 dark|0.12031 gray|0.12031 dark|0.12031 grey|0.12031 dark|0.11295 sea|0.11295 green|0.11295 dark|0.084181 olive|0.084181 green|0.084181 dim|0.07183 gray|0.07183 dim|0.07183 grey|0.07183 gray|0.065436 grey|0.065436 silver|0.063564 light|0.034272 gray|0.034272 light|0.034272 grey|0.034272 olive|0.034002 drab|0.034002 gainsboro|0.025696 honeydew|0.01061  "
		}
	}
}
