{
	"add": {
		"doc": {
			"id": "1e906f006e09ff122106dc78d7caea70e162c876966e701ff5d1d8158b9841f4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/FootbridgeJohnsonCreek.jpg/220px-FootbridgeJohnsonCreek.jpg",
				"previous": "Johnson Creek begins near the unincorporated community of Cottrell, in Clackamas County, Oregon, southeast of Gresham in the foothills of the Cascade Range, and flows generally westward about 25 miles (40 km) to its confluence with the Willamette River, a major tributary of the Columbia River.[3][5][6] The creek passes through the cities of Gresham, Portland, and Milwaukie and crosses the border between Clackamas County and Multnomah County eight times.[5][6]",
				"after": "For much of its course, the creek flows at almost right angles to the numbered avenues of southeast Portland and its eastern suburbs. As the creek descends, so do the avenue numbers. The creek begins in uplands in Clackamas County east of Southeast 362nd Avenue and flows swiftly to the west for about 5 miles (8 km), crisscrossing the border between Clackamas County and Multnomah County 5 times in this upstream stretch, and passing under U.S. Route 26, the Mount Hood Highway, in Multnomah County at about 20 miles (32 km) from the mouth. Shortly thereafter, it receives Badger Creek and Sunshine Creek from the left and the North Fork of Johnson Creek from the right.[5][6]",
			"color": "black|0.33716 dim|0.13558 gray|0.13558 dim|0.13558 grey|0.13558 dark|0.099595 gray|0.099595 dark|0.099595 grey|0.099595 gray|0.098554 grey|0.098554 silver|0.061333 light|0.042333 gray|0.042333 light|0.042333 grey|0.042333 dark|0.035623 olive|0.035623 green|0.035623 gainsboro|0.032588 slate|0.019541 gray|0.019541 light|0.016989 slate|0.016989 gray|0.016989 dark|0.013799 slate|0.013799 gray|0.013799 white|0.012203 smoke|0.012203 sea|0.0085313 shell|0.0085313 ghost|0.008451 white|0.008451 snow|0.0084474 alice|0.0081271 blue|0.0081271 lavender|0.0074845 blush|0.0074845 white|0.0068073 linen|0.0067426 olive|0.0063121 drab|0.0063121 floral|0.0062423 white|0.0062423 mint|0.0056213 cream|0.0056213  "
		}
	}
}
