{
	"add": {
		"doc": {
			"id": "1e904a66af9ef6a8167a8be61a782b26aa4e33b890dece4552fcc49fbcd5c75f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Mary_Anning_by_B._J._Donne.jpg/170px-Mary_Anning_by_B._J._Donne.jpg",
				"previous": "The ichthyosaurs, plesiosaurs, and pterosaur she found, along with the first dinosaur fossils which were discovered by Gideon Mantell and William Buckland during the same period, showed that during previous eras the earth was inhabited by creatures very different from those living today, and provided important support for another controversial suggestion of Cuvier's: that there had been an \"age of reptiles\" when reptiles rather than mammals had been the dominant form of animal life. This phrase became popular after the publication in 1831 of a paper by Mantell entitled \"The Age of Reptiles\" that summarised the evidence that there had been an extended geological era when giant reptiles has swarmed the land, air, and sea.[64] These discoveries also played a key role in the development of a new discipline of geohistorical analysis within geology in the 1820s that sought to understand the history of the earth by using evidence from fossils to reconstruct extinct organisms and the environments in which they lived. This discipline eventually came to be called palaeontology.[65] Illustrations of scenes from \"deep time\" (now known as paleoart), such as Henry De la Beche's ground-breaking painting Duria Antiquior, helped convince people that it was possible to understand life in the distant past. De la Beche had been inspired to create the painting by a vivid description of the food chain of the Lias by William Buckland that was based on analysis of coprolites. The study of coprolites, pioneered by Anning and Buckland, would prove to be a valuable tool for understanding ancient ecosystems.[35]",
				"after": "Throughout the 20th century, beginning with H.A. Forde and his The Heroine of Lyme Regis: The Story of Mary Anning the Celebrated Geologist (1925), a number of writers saw Anning's life as inspirational. She was even the basis of Terry Sullivan's 1908 tongue twister, \"She sells seashells,\" according to P.J. McCartney in Henry de la Beche (1978):[66]",
			"color": "slate|0.3276 gray|0.3276 light|0.13913 slate|0.13913 gray|0.13913 dim|0.1157 gray|0.1157 dim|0.1157 grey|0.1157 dark|0.10114 gray|0.10114 dark|0.10114 grey|0.10114 silver|0.078544 gray|0.075618 grey|0.075618 dark|0.068252 slate|0.068252 gray|0.068252 cadet|0.049715 blue|0.049715 light|0.018385 blue|0.018385 light|0.0076731 gray|0.0076731 light|0.0076731 grey|0.0076731 tan|0.0074674  "
		}
	}
}
