{
	"add": {
		"doc": {
			"id": "1e94203973dfa2b44670558f3d8a5cec9504fe0bb4ad30fcb9ef7a712c9fb036",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Schnorr_von_Carolsfeld_-_Die_Schlacht_von_Iconium.jpg/220px-Schnorr_von_Carolsfeld_-_Die_Schlacht_von_Iconium.jpg",
				"previous": "Manuel's death on 24 September 1180 left his 11-year-old son Alexios II Komnenos on the throne. Alexios was highly incompetent at the office, but it was his mother, Maria of Antioch, and her Frankish background that made his regency unpopular.[131] Eventually, Andronikos I Komnenos, a grandson of Alexios I, launched a revolt against his younger relative and managed to overthrow him in a violent coup d'état.[132] Utilizing his good looks and his immense popularity with the army, he marched on to Constantinople in August 1182 and incited a massacre of the Latins.[132] After eliminating his potential rivals, he had himself crowned as co-emperor in September 1183. He eliminated Alexios II, and took his 12-year-old wife Agnes of France for himself.[132]",
				"after": "Andronikos began his reign well; in particular, the measures he took to reform the government of the Empire have been praised by historians. According to George Ostrogorsky, Andronikos was determined to root out corruption: Under his rule, the sale of offices ceased; selection was based on merit, rather than favouritism; officials were paid an adequate salary so as to reduce the temptation of bribery. In the provinces, Andronikos's reforms produced a speedy and marked improvement.[133] The aristocrats were infuriated against him, and to make matters worse, Andronikos seems to have become increasingly unbalanced; executions and violence became increasingly common, and his reign turned into a reign of terror.[134] Andronikos seemed almost to seek the extermination of the aristocracy as a whole. The struggle against the aristocracy turned into wholesale slaughter, while the Emperor resorted to ever more ruthless measures to shore up his regime.[133]",
			"color": "tan|0.43523 wheat|0.35238 blanched|0.043812 almond|0.043812 bisque|0.042354 moccasin|0.034204 papaya|0.016415 whip|0.016415 antique|0.012457 white|0.012457 beige|0.0078133  "
		}
	}
}
