{
	"add": {
		"doc": {
			"id": "1e9f57e65183c6b27a6062bcd0e48c6682e0c79316bbc0fefd27932f33e0b6bf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Jesus_College_Oxford_Chapel_Reredos_2009.jpg/300px-Jesus_College_Oxford_Chapel_Reredos_2009.jpg",
				"previous": "On 15 June 1863, the principal Charles Williams (principal 1857–1877) and fellows agreed to renovate the chapel.[10] One of the prime movers behind the decision was the vice-principal, Lewis Gilbertson, as part of his unsuccessful attempt to move the college towards Anglo-Catholicism.[78] The architect George Edmund Street was appointed, and had almost free rein in his work. In 1863, he said to the bursar that the chapel was \"so good in style considering its late date\" that it would be \"very inadvisable to alter it in any respect, save one, the old features of the walls and roofing\".[79] However, he later said that the fittings were \"incongruous\", with the seats being \"so thoroughly uncomfortable that kneeling is rendered all but impossible, and sitting even is concerted into a sort of penance\".[79] His work was completed in 1864, at a cost of £1,679 18s 10d.[n 13] The arch of the chancel was widened and the memorials to Sir Eubule Thelwell and Francis Mansell, which had been on each side of the arch, were moved to the north wall of the chancel. The original Jacobean woodwork was removed, with the exception of the screen donated by Edwards and the pulpit, new seats were installed and new paving was placed in the main part of the chapel. A stone reredos was added behind the altar, although the design originally submitted by Street was not approved and he was asked to make changes.[10][72] The reredos as finally installed has three marble panels: a crucifixion scene (centre), Christ carrying his cross (right) and Christ on the knees of St Mary (left). The altar has a slab and six pillars, all made from granite.[80]",
				"after": "Views of Street's alterations have differed. On 21 October 1864, Building News reported that the restoration was nearing completion and was of \"a very spirited character\". It said that the new \"handsome\" arch showed the east window \"to great advantage\", with \"other improvements\" including a \"handsome reredos\" and an \"exceedingly beautiful\" pavement of marble, alabaster and Minton's encaustic tiles.[10] Llewellyn Thomas said that there might be two opinions as to the success of the restoration, but there was \"no doubt\" that widening the arch was a mistake, since \"it has permanently dwarfed the proportions of the building\".[70] He said that the new woodwork, \"though good of its kind\", presented \"too violent a contrast\" with the ante-chapel screen.[70] Hardy was also critical, calling the work \"ill-considered\".[1] He complained that the Jacobean woodwork had been sold for too little, saying that it had been \"ruthlessly torn up and sold for a mere song to a passing stranger\", and described the reredos as \"somewhat tawdry\".[68] William Stride, writing at about the same time as Hardy, said that the \"beautiful\" Jacobean interior of the chapel had been \"destroyed\", and Oxford had \"narrowly escaped other irreparable losses\".[81] Norwich said that the restoration was \"good in individual details\" but was \"sadly damaging to its character and atmosphere\".[5]",
			"color": "tan|0.29263 burly|0.087213 wood|0.087213 dim|0.079935 gray|0.079935 dim|0.079935 grey|0.079935 gray|0.057873 grey|0.057873 saddle|0.034761 brown|0.034761 black|0.030064 dark|0.028028 gray|0.028028 dark|0.028028 grey|0.028028 sienna|0.027151 sea|0.024252 shell|0.024252 floral|0.02394 white|0.02394 peru|0.02391 white|0.023383 smoke|0.023383 snow|0.022823 white|0.022372 mint|0.02206 cream|0.02206  "
		}
	}
}
