{
	"add": {
		"doc": {
			"id": "1ef472fb25045b34a82a0c4c2115c1d55d6a55b651d6a9b19e84ab5c0fc1a1df",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Banquet_de_Charles_V_le_Sage.jpg/170px-Banquet_de_Charles_V_le_Sage.jpg",
			"previous": [],
				"after": "In Europe there were typically two meals a day: dinner at mid-day and a lighter supper in the evening. The two-meal system remained consistent throughout the late Middle Ages. Smaller intermediate meals were common, but became a matter of social status, as those who did not have to perform manual labor could go without them.[26] Moralists frowned on breaking the overnight fast too early, and members of the church and cultivated gentry avoided it. For practical reasons, breakfast was still eaten by working men, and was tolerated for young children, women, the elderly and the sick. Because the church preached against gluttony and other weaknesses of the flesh, men tended to be ashamed of the weak practicality of breakfast. Lavish dinner banquets and late-night reresopers (from Occitan rèire-sopar, \"late supper\") with considerable amounts of alcoholic beverage were considered immoral. The latter were especially associated with gambling, crude language, drunkenness, and lewd behavior.[27] Minor meals and snacks were common (although also disliked by the church), and working men commonly received an allowance from their employers in order to buy nuncheons, small morsels to be eaten during breaks.[28]",
			"color": "midnight|0.20067 blue|0.20067 light|0.087779 gray|0.087779 light|0.087779 grey|0.087779 dark|0.07291 gray|0.07291 dark|0.07291 grey|0.07291 gainsboro|0.070131 silver|0.065677 black|0.057335 antique|0.038124 white|0.038124 gray|0.037817 grey|0.037817 slate|0.033833 gray|0.033833 light|0.033011 slate|0.033011 gray|0.033011 dim|0.030473 gray|0.030473 dim|0.030473 grey|0.030473 dark|0.029619 slate|0.029619 gray|0.029619 dark|0.029115 slate|0.029115 blue|0.029115 steel|0.022564 blue|0.022564 tan|0.022471 linen|0.02241 misty|0.019436 rose|0.019436 rosy|0.010694 brown|0.010694 thistle|0.0095185 burly|0.0090146 wood|0.0090146 saddle|0.0085386 brown|0.0085386  "
		}
	}
}
