{
	"add": {
		"doc": {
			"id": "1ef8fe155dda6435b0a1f14429b9e8d6fc3185fe66e4c81c6ab501fc4ff538a8",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/0/04/Hogarth%27s_Evening.jpg/220px-Hogarth%27s_Evening.jpg",
				"previous": "In this scene more than any of the others Hogarth's sympathies seem to be with the lower classes and more specifically with the English. Although there is disorder on the English side of the street, there is an abundance of \"good eating\" and the characters are rosy-cheeked and well-nourished. Even the street girl can eat her fill. The pinch-faced Huguenots, on the other hand, have their customs and dress treated as mercilessly as any characters in the series.[17] A national enmity towards the French, even French refugees, may explain why the English are depicted somewhat more flatteringly here than they are by figures in the accompanying scenes. Hogarth mocked continental fashions again in Marriage à-la-mode (1743–1745) and made a more direct attack on the French in The Gate of Calais which he painted immediately upon returning to England in 1748 after he was arrested as a spy while sketching in Calais.[1]",
				"after": "Unlike the other three images, Evening takes place slightly outside the built-up area of the city, with views of rolling hills and wide evening skies. The cow being milked in the background indicates it is around 5 o'clock. While in Morning winter cold pervades the scene, Evening is oppressed by the heat of the summer. A pregnant woman and her husband attempt to escape from the claustrophobic city by journeying out to the fashionable Sadler's Wells (the stone entrance to Sadler's Wells Theatre is shown to the left). By the time Hogarth produced this series the theatre had lost any vestiges of fashionability and was satirised as having an audience consisting of tradesmen and their pretentious wives. Ned Ward described the clientele in 1699 as:[26]",
			"color": "dark|0.76205 khaki|0.76205 khaki|0.085023 gray|0.021431 grey|0.021431  "
		}
	}
}
