{
	"add": {
		"doc": {
			"id": "1efda0007b88381290e6267876aaa066ef8efe221a0fd535ce9fac27277e2b65",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Brown_Lemur_in_Andasibe.jpg/220px-Brown_Lemur_in_Andasibe.jpg",
				"previous": "By modern cladistic reckoning, the order Primates is monophyletic. The suborder Strepsirrhini, the \"wet-nosed\" primates, is generally thought to have split off from the primitive primate line about 63 mya,[38] although earlier dates are also supported.[39] The seven strepsirrhine families are the five related lemur families and the two remaining families that include the lorisids and the galagos.[1][18] Older classification schemes wrap Lepilemuridae into Lemuridae and Galagidae into Lorisidae, yielding a four-one family distribution instead of five-two as presented here.[1] During the Eocene, most of the northern continents were dominated by two groups, the adapiforms and the omomyids.[40][41] The former are considered members of Strepsirrhini, but did not have a toothcomb like modern lemurs; recent analysis has demonstrated that Darwinius masillae fits into this grouping.[42] The latter was closely related to tarsiers, monkeys, and apes. How these two groups relate to extant primates is unclear. Omomyids perished about 30 mya,[41] while adapiforms survived until about 10 mya.[43]",
				"after": "According to genetic studies, the lemurs of Madagascar diverged from the lorisoids approximately 75 mya.[39] These studies, as well as chromosomal and molecular evidence, also show that lemurs are more closely related to each other than to other strepsirrhine primates.[39][44] However, Madagascar split from Africa 160 mya and from India 90 mya.[45] To account for these facts, a founding lemur population of a few individuals is thought to have reached Madagascar from Africa via a single rafting event between 50 and 80 mya.[39][44][45] Other colonization options have been examined, such as multiple colonizations from Africa and India, but none are supported by the genetic and molecular evidence.[40]",
			"color": "dim|0.30227 gray|0.30227 dim|0.30227 grey|0.30227 gray|0.23661 grey|0.23661 dark|0.1936 gray|0.1936 dark|0.1936 grey|0.1936 black|0.16226 silver|0.055225 light|0.016147 gray|0.016147 light|0.016147 grey|0.016147 gainsboro|0.008777  "
		}
	}
}
