{
	"add": {
		"doc": {
			"id": "1f07e8e612eecb18bdda804e6feb18e225823ffc97dfd839d86d5f747f9e3eba",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Song_Taizu.jpg/170px-Song_Taizu.jpg",
				"previous": "Emperor Taizu of Song (r. 960–976) unified China by conquering other lands during his reign, ending the upheaval of the Five Dynasties and Ten Kingdoms period. In Kaifeng, he established a strong central government over the empire. He ensured administrative stability by promoting the civil service examination system of drafting state bureaucrats by skill and merit (instead of aristocratic or military position) and promoted projects that ensured efficiency in communication throughout the empire. In one such project, cartographers created detailed maps of each province and city that were then collected in a large atlas.[8] Emperor Taizu also promoted groundbreaking science and technological innovations by supporting such works as the astronomical clock tower designed and built by the engineer Zhang Sixun.[9]",
				"after": "The Song court maintained diplomatic relations with Chola India, the Fatimid Caliphate, Srivijaya, the Kara-Khanid Khanate of Central Asia, and other countries that were also trade partners with Japan.[10][11][12][13] However, China's closest neighbouring states had the greatest impact on its domestic and foreign policy. From its inception under Taizu, the Song dynasty alternated between warfare and diplomacy with the ethnic Khitans of the Liao dynasty in the northeast and with the Tanguts of the Western Xia in the northwest. The Song dynasty used military force in an attempt to quell the Liao dynasty and to recapture the Sixteen Prefectures, a territory under Khitan control that was traditionally considered to be part of China proper.[14] However, Song forces were repulsed by the Liao forces who engaged in aggressive yearly campaigns into northern Song territory until 1005, when the signing of the Shanyuan Treaty ended these northern border clashes. The Song were forced to provide tribute to the Khitans, although paying this tribute did little damage to the overall Song economy since the Khitans were heavily dependent upon importing massive amounts of goods from the Song.[15] More significantly, the Song state recognized the Liao state as its diplomatic equal.[16] The Song dynasty managed to win several military victories over the Tanguts in the early 11th century, culminating in a campaign led by the polymath scientist, general, and statesman Shen Kuo (1031–1095).[17] However, this campaign was ultimately a failure due to a rival military officer of Shen disobeying direct orders, and the territory gained from the Western Xia was eventually lost.[18] There was also a significant war fought against the Lý dynasty of Vietnam from 1075 to 1077 over a border dispute and the Song's severing of commercial relations with the Đại Việt kingdom.[19] After Lý forces inflicted heavy damages in a raid on Guangxi, the Song commander Guo Kui (1022–1088) penetrated as far as Thăng Long (modern Hanoi).[20] However, heavy losses on both sides prompted the Lý commander Thường Kiệt (1019–1105) to make peace overtures, allowing both sides to withdraw from the war effort; captured territories held by both Song and Lý were mutually exchanged in 1082, along with prisoners of war.[21]",
			"color": "beige|0.084564 light|0.073857 golden|0.073857 rod|0.073857 yellow|0.073857 wheat|0.067737 corn|0.05843 silk|0.05843 pale|0.056113 golden|0.056113 rod|0.056113 lemon|0.052289 chiffon|0.052289 light|0.048136 yellow|0.048136 golden|0.047827 rod|0.047827 antique|0.044126 white|0.044126 papaya|0.042129 whip|0.042129 chocolate|0.037452 blanched|0.034435 almond|0.034435 old|0.03354 lace|0.03354 burly|0.031092 wood|0.031092 moccasin|0.028837 honeydew|0.027722 navajo|0.0239 white|0.0239 linen|0.023409 ivory|0.022755 sandy|0.022253 brown|0.022253 bisque|0.018732 tan|0.017108 floral|0.016907 white|0.016907 peru|0.014218 sea|0.01112 shell|0.01112 khaki|0.0089675 mint|0.0086683 cream|0.0086683 peach|0.0080535 puff|0.0080535 white|0.0075762 smoke|0.0075762 gainsboro|0.0069185  "
		}
	}
}
