{
	"add": {
		"doc": {
			"id": "1f0b6d165494321103012deaa2289938ef05d7af70650c5d93700078643f6825",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Bundesarchiv_Bild_183-A0706-0018-030%2C_Ukraine%2C_ermordete_Familie.jpg/220px-Bundesarchiv_Bild_183-A0706-0018-030%2C_Ukraine%2C_ermordete_Familie.jpg",
				"previous": "While the Leibstandarte and the SS divisions were fighting in the front line, behind the lines it was a different story. The 1 SS Infantry and 2 SS Infantry Brigades, which had been formed from surplus concentration camp guards of the SS-TV, and the SS Cavalry Brigade moved into the Soviet Union behind the advancing armies. At first they fought Soviet partisans and cut off units of the Red Army in the rear of Army Group South, capturing 7,000 prisoners of war, but from mid-August 1941 until late 1942 they were assigned to the Reich Main Security Office headed by Reinhard Heydrich.[40][43] The brigades were now used for rear area security and policing, and were no longer under Army or Waffen-SS command. In the autumn of 1941, they left the anti-partisan role to other units and actively took part in the Holocaust. While assisting the Einsatzgruppen, they participated in the liquidation of the Jewish population of the Soviet Union, forming firing parties when required. The three brigades were responsible for the murder of tens of thousands by the end of 1941.[43]",
				"after": "Because it was more mobile and better able to carry out large-scale operations, the SS Cavalry Brigade played a pivotal role in the transition to the wholesale extermination of the Jewish population.[44] On 27 July, the Brigade was ordered into action, and by 1 August the SS Cavalry Regiment was responsible for the death of 800 people; by 6 August, this total had reached 3,000 \"Jews and partisans\".[45] On 1 August, after a meeting between Himmler, Erich von Bach-Zelewski and Hinrich Lohse, the brigades received the following order: \"Explicit order by RFSS: All Jews must be shot. Drive the female Jews into the swamps.\"[46]",
			"color": " "
		}
	}
}
