{
	"add": {
		"doc": {
			"id": "1f11e1a0f0772f941d66c566357a53fe7e45575f049b64ee7090ec33f98ec51f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Namibia_homelands_78.jpeg/220px-Namibia_homelands_78.jpeg",
				"previous": "Following the League's replacement by the United Nations in 1946, South Africa refused to surrender its earlier mandate to be replaced by a United Nations Trusteeship agreement, requiring closer international monitoring of the territory's administration (along with a definite independence schedule). The Herero Chief's Council submitted a number of petitions to the UN calling for it to grant Namibia independence during the 1950s. During the 1960s, when European powers granted independence to their colonies and trust territories in Africa, pressure mounted on South Africa to do so in Namibia. In 1966 the International Court of Justice dismissed a complaint brought by Ethiopia and Liberia against South Africa's continued presence in the territory, but the U.N. General Assembly subsequently revoked South Africa's mandate, while in 1971 the International Court of Justice issued an \"advisory opinion\" declaring South Africa's continued administration to be illegal.[17]",
				"after": "In response to the 1966 ruling by the International Court of Justice, South-West Africa People's Organisation (SWAPO) military wing, People's Liberation Army of Namibia, a guerrilla group began their armed struggle for independence,[18] but it was not until 1988 that South Africa agreed to end its occupation[19] of Namibia, in accordance with a UN peace plan for the entire region. During the South African occupation of Namibia, white commercial farmers, most of whom came as settlers from South Africa and represented 0.2% of the national population, owned 74% of the arable land.[20] Outside the central-southern area of Namibia (known as the \"Police Zone\" since the German era and which contained the main towns, industries, mines and best arable land), the country was divided into \"homelands\", the version of South African bantustan applied to Namibia, although only a few were actually established because indigenous Namibians often did not cooperate.",
			"color": "light|0.16184 blue|0.16184 tan|0.12631 wheat|0.091028 light|0.088828 coral|0.088828 powder|0.074042 blue|0.074042 bisque|0.043691 peach|0.043306 puff|0.043306 sky|0.041093 blue|0.041093 burly|0.038094 wood|0.038094 blanched|0.031182 almond|0.031182 dark|0.029615 salmon|0.029615 moccasin|0.023963 indian|0.022486 red|0.022486 antique|0.020642 white|0.020642 papaya|0.020447 whip|0.020447 navajo|0.017446 white|0.017446 salmon|0.016643 beige|0.011621 pale|0.011256 turquoise|0.011256 corn|0.011161 silk|0.011161 black|0.0063221 old|0.0063009 lace|0.0063009 light|0.005533 yellow|0.005533 light|0.0055121 golden|0.0055121 rod|0.0055121 yellow|0.0055121 light|0.0054152 steel|0.0054152 blue|0.0054152 silver|0.0052641 light|0.0045256 sky|0.0045256 blue|0.0045256 linen|0.0042198 light|0.0041893 gray|0.0041893 light|0.0041893 grey|0.0041893 lemon|0.0040031 chiffon|0.0040031  "
		}
	}
}
