{
	"add": {
		"doc": {
			"id": "1f1242a69f659e2df6d1966209e593825d323f0b9570ab91e3b807264e4349d8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/HazelhurstField.JPG/200px-HazelhurstField.JPG",
			"previous": [],
				"after": "During World War I, Stratton served in army aviation developing psychological recruitment tests for aviators. He worked at San Francisco, Rockwell Field, San Diego,[38] and at Hazelhurst Field, Mineola, New York. Joining as a captain,[39] he was promoted to major in 1918 along with a transfer to Mineola. Stratton presided over the Army Aviation Examining Board in San Francisco in 1917,[40] chaired the subcommittee of the National Research Council of the APA: \"Psychological Problems of Aviation, including Examination of Aviation Recruits\" in the summer of 1917, and headed the psychological section of the Medical Research Lab of the Army Medical Research Board at Hazelhurst Field,[41] a wing of the Army's Sanitary Corps, in 1918.[42] As a member of the psychological division,[43] his research focused on developing psychological recruiting tests for would-be aviators. The tests he designed tested for reaction times, ability to imagine completions of curves presented visually, and the ability to sense a gradual tilting of one's own body. Edward L. Thorndike pooled Stratton's results with other studies to statistically analyze and correlate weak performance to a poor flying record. Part of this research was carried out in the spring of 1918 with Captain Henmon at Kelly Field, and the army thought enough of the results to allow the tests for checking recruits in four new units.[44]",
			"color": "gray|0.14688 grey|0.14688 dark|0.14177 gray|0.14177 dark|0.14177 grey|0.14177 silver|0.14099 dim|0.13785 gray|0.13785 dim|0.13785 grey|0.13785 light|0.12044 gray|0.12044 light|0.12044 grey|0.12044 gainsboro|0.085761 antique|0.04668 white|0.04668 linen|0.040729 old|0.02869 lace|0.02869 sea|0.020585 shell|0.020585 beige|0.018607 floral|0.017217 white|0.017217 ivory|0.012183 white|0.0097717 smoke|0.0097717  "
		}
	}
}
