{
	"add": {
		"doc": {
			"id": "1f1f0b88b921d0e5d92ead4acd75fce44017ad357848acfd4796ffc61ba18038",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Pestle_Music_Theater_02.jpg/220px-Pestle_Music_Theater_02.jpg",
				"previous": "Due to the close proximity of aboriginal land to the mountains, many tribes have hoped to cash in on hot spring ventures and hotels, where they offer singing and dancing to add to the ambience. The Wulai Atayal in particular have been active in this area. Considerable government funding has been allocated to museums and culture centers focusing on Taiwan's aboriginal heritage. Critics often call the ventures exploitative and \"superficial portrayals\" of aboriginal culture, which distract attention from the real problems of substandard education (Mo 2005). Proponents of ethno-tourism suggest that such projects can positively impact the public image and economic prospects of the indigenous community.",
				"after": "A full-time aboriginal radio station, \"Ho-hi-yan\", was launched in 2005 (Ho Hi Yan 2005) with the help of the Executive Yuan, to focus on issues of interest to the indigenous community.[44] This came on the heels of a \"New wave of Indigenous Pop\" (Liu 2000), as aboriginal artists, such as A-mei (Puyuma tribe), Difang, A-Lin (Ami tribe), Princess Ai 戴愛玲 (Paiwan tribe), Pur-dur and Samingad (Puyuma tribe), and Landy Wen (Atayal tribe) became international pop-stars. The rock musician Chang Chen-yue is a member of the Ami tribe. Music has given aborigines both a sense of pride and a sense of cultural ownership. The issue of ownership was exemplified when the musical project Enigma used an Ami chant in their song \"Return to Innocence\", which was selected as the official theme of the 1996 Atlanta Olympics. The main chorus was sung by Difang and his wife, Igay. The Amis couple successfully sued Enigma's record label, which then paid royalties to the French museum that held the master recordings of the traditional songs, but the original artists, who had been unaware of the Enigma project, remained uncompensated. The Enigma suit raised serious issues regarding indigenous people's participation and compensation in the commoditizing of their cultures and traditions (Anderson 2000:283–90).",
			"color": "black|0.33519 dim|0.17461 gray|0.17461 dim|0.17461 grey|0.17461 gray|0.042007 grey|0.042007 dark|0.03776 gray|0.03776 dark|0.03776 grey|0.03776 maroon|0.020388 silver|0.019554 light|0.01651 gray|0.01651 light|0.01651 grey|0.01651 brown|0.01588 gainsboro|0.014128 white|0.012061 smoke|0.012061 dark|0.012002 slate|0.012002 gray|0.012002 sea|0.01164 shell|0.01164 firebrick|0.011198  "
		}
	}
}
