{
	"add": {
		"doc": {
			"id": "1f2e052ec4c6722cdfef502c142f40ac7b6c28e42f06e1960f53465e81b8de0f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Apollo_Lunar_Module_Fuel_Tank.jpg/220px-Apollo_Lunar_Module_Fuel_Tank.jpg",
			"previous": [],
				"after": "While most tanks are manufactured, some fuel tanks are still fabricated by metal craftsmen or hand-made in the case of bladder-style tanks. These include custom and restoration tanks for automotive,aircraft, motorcycles, and even tractors. Construction of fuel tanks follows a series of specific steps. The craftsman generally creates a mockup to determine the accurate size and shape of the tank, usually out of foam board. Next, design issues that affect the structure of the tank are addressed - such as where the outlet, drain, fluid level indicator, seams, and baffles go. Then the craftsmen must determine the thickness, temper and alloy of the sheet he will use to make the tank. After the sheet is cut to the shapes needed, various pieces are bent to create the basic shell and/or ends and baffles for the tank. Many fuel tanks' baffles (particularly in aircraft and racecars) contain lightening holes. These flanged holes serve two purposes, they reduce the weight of the tank while adding strength to the baffles. Toward the end of construction, openings are added for the filler neck, fuel pickup, drain, and fuel-level sending unit. Sometimes these holes are created on the flat shell, other times they are added at the end of the fabrication process. Baffles and ends can be riveted into place. The heads of the rivets are frequently brazed or soldered to prevent tank leaks. Ends can then be hemmed in and soldered, or flanged and brazed (and/or sealed with an epoxy-type sealant) or the ends can be flanged and then welded. Once the soldering, brazing or welding is complete, the fuel tank is leak-tested.[1]",
			"color": "silver|0.25546 dark|0.21859 gray|0.21859 dark|0.21859 grey|0.21859 light|0.18367 gray|0.18367 light|0.18367 grey|0.18367 gainsboro|0.13067 gray|0.035679 grey|0.035679 linen|0.025515 white|0.022733 smoke|0.022733 sea|0.017611 shell|0.017611 dim|0.01391 gray|0.01391 dim|0.01391 grey|0.01391 snow|0.012957 floral|0.012866 white|0.012866 lavender|0.01123 blush|0.01123 old|0.011025 lace|0.011025 white|0.0084128 ghost|0.007789 white|0.007789 mint|0.0071867 cream|0.0071867 antique|0.0054659 white|0.0054659 misty|0.0042376 rose|0.0042376 ivory|0.0038478 alice|0.0029219 blue|0.0029219  "
		}
	}
}
