{
	"add": {
		"doc": {
			"id": "1f4abb5ffc8f654e097293e65b9bbe14dd27298b8c725b4fe5871512265cfcb4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Continental_b757-200_n18119_landing_arp.jpg/220px-Continental_b757-200_n18119_landing_arp.jpg",
				"previous": "In 1990, Frank Lorenzo retired after 18 years at the helm of Texas International and later Texas Air and Continental Airlines, selling the majority of his Jet Capital Corporation to Scandinavian Airlines System (SAS). According to William F. Buckley, in his September 17, 1990 article on National Review, the sale to SAS was conditioned on Lorenzo leaving the company.[15] On December 3, 1990, Continental filed for its second bankruptcy, due to Lorenzo dedicating himself almost full-time to Eastern Air Lines acquisition and labor relations issues, the 1990 Iraqi invasion of Kuwait and the resultant Gulf War had prompted a dramatic increase in the price of jet fuel, and People Express had been highly leveraged at the time of its merger with Continental, having purchased Frontier Airlines just two years before.[19] In addition to Lorenzo embarking on deals which saddled the airline with other carriers' debts, he also began consolidating the different airlines into one system. That resulted in a fleet comprising numerous aircraft types and liveries.[20]",
				"after": "In the late 1980s, following a dramatic reduction of service by United Airlines and an unsuccessful attempt by USAir to establish point-to-point service, Continental expanded at Cleveland Hopkins International Airport and established what would become its third-largest system hub. Continental quickly gained nearly all of the gates in the C concourse (once dominated by United), and later expanded that concourse to 24 gates in addition to eventually constructing a new Concourse D in 1999.[21] On February 12, 1991, Continental unveiled a new blue and gray livery and the \"globe\" logo. This would continue as Continental's identity until it was dissolved in 2012, and was adopted by the post-merger United Airlines.[22][23] In 1993 Air Canada, Air Partners and Texas Pacific Group, enabled Continental to emerge from bankruptcy by investing $450 million in the airline.[citation needed] In March 1993 the airline cancelled its services to 9 U.S. destinations and 6 non-U.S. destinations, including all 24 weekly services between the United States and Australia and New Zealand in addition to its flights between Guam and Australia, effective October 31 of that year.[24] Under the leadership of former Boeing executive Gordon Bethune, who became President in October 1994, Continental began a successful transformation project. When Bethune took over in 1994 as COO and President of Continental Airlines the troubled airline had twice faced bankruptcy and was again headed that direction. A search firm hired by Continental's board of directors suggested Bethune, who had recently completed an Advanced Management Course at the Harvard Business School, to salvage the company.",
			"color": "dim|0.19402 gray|0.19402 dim|0.19402 grey|0.19402 dark|0.11169 gray|0.11169 dark|0.11169 grey|0.11169 silver|0.075373 gray|0.073937 grey|0.073937 light|0.070409 gray|0.070409 light|0.070409 grey|0.070409 gainsboro|0.057904 light|0.049979 steel|0.049979 blue|0.049979 light|0.046938 slate|0.046938 gray|0.046938 slate|0.045395 gray|0.045395 black|0.036945 white|0.023762 smoke|0.023762 lavender|0.021599 alice|0.020096 blue|0.020096 dark|0.018885 slate|0.018885 gray|0.018885 ghost|0.018336 white|0.018336  "
		}
	}
}
