{
	"add": {
		"doc": {
			"id": "1f51343eebe966db3a3376a898f2f4badc5ab5af8639b7830c9279b58b224f07",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Lion_and_baboon_1.jpg/250px-Lion_and_baboon_1.jpg",
				"previous": "Extensive studies show that lionesses normally prey on mammals with an average weight of 126 kg (278 lb), while kills made by male lions average 399 kg (880 lb).[80] In Africa, wildebeest rank at the top of preferred prey (making nearly half of the lion prey in the Serengeti) followed by zebra.[81] Lions do not prey on fully grown adult elephants; most adult hippopotamuses, rhinoceroses, and smaller gazelles, impala, and other agile antelopes are generally excluded. However, giraffes and buffaloes are often taken in certain regions. For instance, in Kruger National Park, giraffes are regularly hunted.[82] In Manyara Park, Cape buffaloes constitute as much as 62% of the lion's diet,[83] due to the high number density of buffaloes. Occasionally hippopotamus is also taken, but adult rhinoceroses are generally avoided. Warthogs are often taken depending on availability.[84] The lions of Savuti, Botswana, have adapted to hunting young elephants during the dry season, and a pride of 30 lions has been recorded killing individuals between the ages of four and eleven years.[85] In the Kalahari desert in South Africa, black-maned lions may chase baboons up a tree, wait patiently, then attack them when they try to escape:",
				"after": "Lions also attack domestic livestock and in India cattle contribute significantly to their diet.[56] Lions are capable of killing other predators such as leopards, cheetahs, hyenas, and wild dogs, though (unlike most felids) they seldom devour the competitors after killing them. A lion may gorge itself and eat up to 30 kg (66 lb) in one sitting;[86] if it is unable to consume all the kill it will rest for a few hours before consuming more. On a hot day, the pride may retreat to shade leaving a male or two to stand guard.[87] An adult lioness requires an average of about 5 kg (11 lb) of meat per day, a male about 7 kg (15 lb).[88]",
			"color": "black|0.40091 sienna|0.16068 coral|0.14156 dim|0.10125 gray|0.10125 dim|0.10125 grey|0.10125 tomato|0.037023 gray|0.024169 grey|0.024169  "
		}
	}
}
