{
	"add": {
		"doc": {
			"id": "1f544caf05c6d661dac2d7f86cbbab51f4e4aa17d83e7e79203b84f6270572d8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Albertosaurus_sculpture.jpg/220px-Albertosaurus_sculpture.jpg",
				"previous": "The near-absence of herbivore remains and the similar state of preservation common to the many individuals at the Albertosaurus bonebed quarry led Currie to conclude that the locality was not a predator trap like the La Brea Tar Pits in California, and that all of the preserved animals died at the same time. Currie claims this as evidence of pack behaviour.[7] Other scientists are skeptical, observing that the animals may have been driven together by drought, flood or for other reasons.[3][39][41]",
				"after": "There is plentiful evidence for gregarious behaviour among herbivorous dinosaurs, including ceratopsians and hadrosaurs.[42] However, only rarely are so many dinosaurian predators found at the same site. Small theropods like Deinonychus,[43] Coelophysis and Megapnosaurus (Syntarsus rhodesiensis)[44] have been found in aggregations, as have larger predators like Allosaurus and Mapusaurus.[45] There is some evidence of gregarious behaviour in other tyrannosaurids as well. Fragmentary remains of smaller individuals were found alongside \"Sue\", the Tyrannosaurus mounted in the Field Museum of Natural History in Chicago, and a bonebed in the Two Medicine Formation of Montana contains at least three specimens of Daspletosaurus, preserved alongside several hadrosaurs.[46] These findings may corroborate the evidence for social behaviour in Albertosaurus, although some or all of the above localities may represent temporary or unnatural aggregations.[7] Others have speculated that instead of social groups, at least some of these finds represent Komodo dragon-like mobbing of carcasses, where aggressive competition leads to some of the predators being killed and cannibalized.[39]",
			"color": "burly|0.2337 wood|0.2337 tan|0.15782 khaki|0.13641 black|0.10932 dark|0.047489 khaki|0.047489 navajo|0.036623 white|0.036623 pale|0.036149 golden|0.036149 rod|0.036149 wheat|0.0301 gold|0.027455 yellow|0.027208 moccasin|0.02167 peach|0.016438 puff|0.016438  "
		}
	}
}
