{
	"add": {
		"doc": {
			"id": "1f5cc87caf43a71429e2e37b72a83d80bed4115751214cc7616e4e6d2b9a30f2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/City_of_Lima%2C_Peru.jpg/220px-City_of_Lima%2C_Peru.jpg",
				"previous": "Peru engaged in a brief successful conflict with Ecuador in the Paquisha War as a result of territorial dispute between the two countries. After the country experienced chronic inflation, the Peruvian currency, the sol, was replaced by the Inti in mid-1985, which itself was replaced by the nuevo sol in July 1991, at which time the new sol had a cumulative value of one billion old soles. The per capita annual income of Peruvians fell to $720 (below the level of 1960) and Peru's GDP dropped 20% at which national reserves were a negative $900 million. The economic turbulence of the time acerbated social tensions in Peru and partly contributed to the rise of violent rebel rural insurgent movements, like Sendero Luminoso (Shining Path) and MRTA, which caused great havoc throughout the country. Concerned about the economy, the increasing terrorist threat from Sendero Luminoso and MRTA, and allegations of official corruption, Alberto Fujimori assumed presidency in 1990. Fujimori implemented drastic measures that caused inflation to drop from 7,650% in 1990 to 139% in 1991. Faced with opposition to his reform efforts, Fujimori dissolved Congress in the auto-golpe (\"self-coup\") of 5 April 1992. He then revised the constitution; called new congressional elections; and implemented substantial economic reform, including privatization of numerous state-owned companies, creation of an investment-friendly climate, and sound management of the economy. Fujimori's administration was dogged by insurgent groups, most notably Sendero Luminoso, which carried out terrorist campaigns across the country throughout the 1980s and 1990s. Fujimori cracked down on the insurgents and was successful in largely quelling them by the late 1990s, but the fight was marred by atrocities committed by both the Peruvian security forces and the insurgents: the Barrios Altos massacre and La Cantuta massacre by Government paramilitary groups, and the bombings of Tarata and Frecuencia Latina by Sendero Luminoso. Those incidents subsequently came to be seen as symbols of the human rights violations committed during the last years of violence.",
				"after": "During that time in early 1995, once again Peru and Ecuador clashed in the Cenepa War, but in 1998 the governments of both nations signed a peace treaty that clearly demarcated the international boundary between them. In November 2000, Fujimori resigned from office and went into a self-imposed exile, avoiding prosecution for human rights violations and corruption charges by the new Peruvian authorities. Since the end of the Fujimori regime, Peru has tried to fight corruption while sustaining economic growth.[35]",
			"color": "dim|0.24111 gray|0.24111 dim|0.24111 grey|0.24111 gray|0.23419 grey|0.23419 dark|0.18633 gray|0.18633 dark|0.18633 grey|0.18633 silver|0.071227 black|0.051961 slate|0.045357 gray|0.045357 light|0.034728 slate|0.034728 gray|0.034728 light|0.029793 gray|0.029793 light|0.029793 grey|0.029793 gainsboro|0.018495 dark|0.016478 olive|0.016478 green|0.016478 rosy|0.01403 brown|0.01403 dark|0.013097 slate|0.013097 gray|0.013097 sienna|0.0088803  "
		}
	}
}
