{
	"add": {
		"doc": {
			"id": "1f6d57a84657dbb99209121246076995fd2db198b230c394436e174e3c55842c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/%E4%BA%8C%E6%AC%A1%E9%9C%A7%E7%A4%BE%E4%BA%8B%E4%BB%B6.jpg/200px-%E4%BA%8C%E6%AC%A1%E9%9C%A7%E7%A4%BE%E4%BA%8B%E4%BB%B6.jpg",
				"previous": "The 1930 \"New Flora and Silva, Volume 2\" said of the mountain Aboriginals that the \"majority of them live in a state of war against Japanese authority\".[22] The Bunun and Atayal were described as the \"most ferocious\" Aboriginals, and police stations were targeted by Aboriginals in intermittent assaults.[23] By January 1915, all Aboriginals in northern Taiwan were forced to hand over their guns to the Japanese, however head hunting and assaults on police stations by Aboriginals still continued after that year.[24][25] Between 1921 to 1929 Aboriginal raids died down, but a major revival and surge in Aboriginal armed resistance erupted from 1930-1933 for four years during which the Wushe Incident occurred and Bunun carried out raids, after which armed conflict again died down.[26] According to a 1933-year book, wounded people in the Japanese war against the Aboriginals numbered around 4,160, with 4,422 civilians dead and 2,660 military personnel killed.[27] According to a 1935 report, 7,081 Japanese were killed in the armed struggle from 1896-1933 while the Japanese confiscated 29,772 Aboriginal guns by 1933.[28]",
				"after": "Beginning in the first year of Japanese rule, the colonial government embarked on a mission to study the aborigines so they could be classified, located and \"civilized\". The Japanese \"civilizing project\", partially fueled by public demand in Japan to know more about the empire, would be used to benefit the Imperial government by consolidating administrative control over the entire island, opening up vast tracts of land for exploitation (Suenari 2006:1–8). To satisfy these needs, \"the Japanese portrayed and catalogued Taiwan's indigenous peoples in a welter of statistical tables, magazine and newspaper articles, photograph albums for popular consumption\" (Matsuda 2003:181). The Japanese-based much of their information and terminology on prior Qing era narratives concerning degrees of \"civilization\" (Ka 1995:27–30).",
			"color": " "
		}
	}
}
