{
	"add": {
		"doc": {
			"id": "1f78884114fd46ca31dcdd518aba8179ae40ce3c2daec1b6fcb7f4d4438933e8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Majungasaurus_BW.jpg/220px-Majungasaurus_BW.jpg",
				"previous": "Computed tomography, also known as CT scanning, of a complete Majungasaurus skull (FMNH PR 2100) allowed a rough reconstruction of its brain and inner ear structure. Overall, the brain was very small relative to body size, but otherwise similar to many other non-coelurosaurian theropods, with a very conservative form closer to modern crocodilians than to birds. One difference between Majungasaurus and other theropods was its smaller flocculus, a region of the cerebellum that helps to coordinate movements of the eye with movements of the head. This suggests that Majungasaurus and other abelisaurids like Indosaurus, which also had a small flocculus, did not rely on quick head movements to sight and capture prey.[2]",
				"after": "Inferences about behavior can also be drawn from examination of the inner ear. The semicircular canals within the inner ear aid in balance, and the lateral semicircular canal is usually parallel to the ground when the animal holds its head in an alert posture. When the skull of Majungasaurus is rotated so that its lateral canal is parallel to the ground, the entire skull is nearly horizontal. This contrasts with many other theropods, where the head was more strongly downturned when in the alert position. The lateral canal is also significantly longer in Majungasaurus than in its more basal relative Ceratosaurus, indicating a greater sensitivity to side-to-side motions of the head.[2]",
			"color": "dark|0.22341 gray|0.22341 dark|0.22341 grey|0.22341 silver|0.16081 dark|0.15344 salmon|0.15344 sienna|0.097606 peru|0.056889 light|0.049231 salmon|0.049231 burly|0.048861 wood|0.048861 tan|0.039238 light|0.034607 gray|0.034607 light|0.034607 grey|0.034607 saddle|0.0332 brown|0.0332 gainsboro|0.020643 dark|0.012468 khaki|0.012468 rosy|0.0097606 brown|0.0097606 sandy|0.0070711 brown|0.0070711  "
		}
	}
}
