{
	"add": {
		"doc": {
			"id": "1f8b9ad8838b4283b84f7b53b130bf6e3b2ee0f8e1d0566d7b0d6e65d09d37d6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Mammuthus_primigenius_fraasi.JPG/220px-Mammuthus_primigenius_fraasi.JPG",
				"previous": "In 2005, researchers assembled a complete mitochondrial genome profile of the woolly mammoth, which allowed them to trace the close evolutionary relationship between mammoths and Asian elephants (Elephas maximus).[18] African elephants (Loxodonta africana) branched away from this clade around 6 million years ago, close to the time of the similar split between chimpanzees and humans. Before the publication of the Neanderthal genome, many researchers expected the first fully sequenced nuclear genome of an extinct species would be that of the mammoth.[19] A 2010 study confirmed these relationships, and suggested the mammoth and Asian elephant lineages diverged 5.8–7.8 million years ago, while African elephants diverged from an earlier common ancestor 6.6–8.8 million years ago.[20] In 2008, much of the woolly mammoth's chromosomal DNA was mapped. The analysis showed that the woolly mammoth and the African elephant are 98.55% to 99.40% identical.[21] The team mapped the woolly mammoth's nuclear genome sequence by extracting DNA from the hair follicles of both a 20,000-year-old mammoth retrieved from permafrost, and another that died 60,000 years ago.[22] In 2012, proteins were confidently identified for the first time, collected from a 43,000-year-old woolly mammoth.[23]",
				"after": "Since many remains of each species of mammoth are known from several localities, it is possible to reconstruct the evolutionary history of the genus through morphological studies. Mammoth species can be identified from the number of enamel ridges (or lamellar plates) on their molars; primitive species had few ridges, and the number increased gradually as new species evolved and replaced the preceding ones. The crowns of the teeth lengthened and the skulls became taller to accommodate this. At the same time, the skulls became shorter from front to back to minimise the weight.[24] The short and tall skulls of woolly and Columbian mammoths (Mammuthus columbi) are the culmination of this process.[25] These adaptations were acquired gradually as mammoths turned to more abrasive food items.[26]",
			"color": "rosy|0.15399 brown|0.15399 silver|0.097815 black|0.09257 dark|0.081574 gray|0.081574 dark|0.081574 grey|0.081574 light|0.075025 gray|0.075025 light|0.075025 grey|0.075025 gainsboro|0.057424 peach|0.052747 puff|0.052747 misty|0.05031 rose|0.05031 lavender|0.032965 blush|0.032965 sea|0.029607 shell|0.029607 white|0.028943 smoke|0.028943 linen|0.02635 snow|0.025917 gray|0.025208 grey|0.025208 ghost|0.021632 white|0.021632 floral|0.021383 white|0.021383 white|0.020608 dark|0.017314 salmon|0.017314 alice|0.015138 blue|0.015138 mint|0.014054 cream|0.014054 sienna|0.0096978 dim|0.0090774 gray|0.0090774 dim|0.0090774 grey|0.0090774  "
		}
	}
}
