{
	"add": {
		"doc": {
			"id": "1fafc23ea8d7d158c7f2a96eb078969da582fe080ea40ee30dfcf55e74d15788",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Telopea_speciosissima_seedpods.jpg/220px-Telopea_speciosissima_seedpods.jpg",
			"previous": [],
				"after": "Telopea speciosissima, the New South Wales waratah, is a large, erect shrub up to 3 or 4 metres (10–13 ft) in height with one or more stems.[3][4] Arising vertically or near vertically from a large woody base, or lignotuber, the stems are little branched. In late spring, there is a spurt of new growth after flowering, with new shoots often arising from old flowerheads.[5] The dark green leaves are alternate and usually coarsely-toothed, ranging from 13 to 25 cm (5–10 in) in length.[3] Enveloped in leafy bracts, the flowerheads develop over the winter and begin to swell in early spring,[3][6] before opening to reveal the striking inflorescences. The exact timing varies across New South Wales, but flowering can begin as early as August in the northern parts of its range, and finish in November in the southern, more elevated areas.[5] Spot flowering may also occur around March in autumn.[7] Containing up to 250 individual flowers, the domed flowerheads are crimson in colour and measure 7–10 cm (3–4 in) in diameter. They are cupped in a whorl of leafy bracts which are 5 to 7 cm (2–3 in) long and also red.[3][5] Variations are not uncommon; some flowerheads may be more globular or cone-shaped than dome-shaped, and the bracts may be whitish or dark red. The tips of the stigmas of some inflorescences may be whitish, contrasting with the red colour of the rest of the flowerhead.[8]",
			"color": "black|0.35033 rosy|0.10031 brown|0.10031 misty|0.063265 rose|0.063265 gray|0.059851 grey|0.059851 dim|0.057302 gray|0.057302 dim|0.057302 grey|0.057302 dark|0.032587 gray|0.032587 dark|0.032587 grey|0.032587 silver|0.020591 dark|0.018641 olive|0.018641 green|0.018641 lavender|0.017749 blush|0.017749 light|0.017574 gray|0.017574 light|0.017574 grey|0.017574 tan|0.016251 gainsboro|0.016154 sienna|0.014419 linen|0.014095 sea|0.013251 shell|0.013251 saddle|0.011327 brown|0.011327 white|0.011125 smoke|0.011125  "
		}
	}
}
