{
	"add": {
		"doc": {
			"id": "1fbfb2d85b0fa55e852ab2430102c3c91b797a66b93304f064f3e303e8aaa977",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Linezolid-from-xtal-2008-3D-balls.png/250px-Linezolid-from-xtal-2008-3D-balls.png",
			"previous": [],
				"after": "Linezolid is a synthetic antibiotic used for the treatment of serious infections caused by Gram-positive bacteria that are resistant to several other antibiotics. A member of the oxazolidinone class of drugs, linezolid is active against most Gram-positive bacteria that cause disease, including streptococci, vancomycin-resistant enterococci, and methicillin-resistant Staphylococcus aureus. The main indications of linezolid are infections of the skin and soft tissues and pneumonia (particularly hospital-acquired pneumonia), although off-label use for a variety of other infections is becoming popular. Discovered in the late 1980s and first approved for use in 2000, linezolid was the first commercially available oxazolidinone antibiotic. As of 2009, it is the only marketed oxazolidinone, although others are in development. As a protein synthesis inhibitor, it stops the growth of bacteria by disrupting their production of proteins. Resistance to linezolid has remained very low since it was first detected in 1999, although it may be increasing. When administered for short periods, linezolid is a relatively safe drug; it can be used in patients of all ages and in people with liver disease or poor kidney function. (more...)",
			"color": "black|0.28961 dim|0.096776 gray|0.096776 dim|0.096776 grey|0.096776 gray|0.082219 grey|0.082219 dark|0.082084 gray|0.082084 dark|0.082084 grey|0.082084 silver|0.058411 light|0.048049 gray|0.048049 light|0.048049 grey|0.048049 gainsboro|0.042083 white|0.029817 smoke|0.029817 lavender|0.023635 blush|0.023635 ghost|0.023547 white|0.023547 alice|0.023407 blue|0.023407 sea|0.023174 shell|0.023174 snow|0.022955 white|0.021199 mint|0.018907 cream|0.018907 floral|0.016683 white|0.016683 midnight|0.016656 blue|0.016656 azure|0.014569 maroon|0.011309 linen|0.011225 dark|0.010849 red|0.010849 rosy|0.0045344 brown|0.0045344  "
		}
	}
}
