{
	"add": {
		"doc": {
			"id": "1fc585b405f271bb70fe976611be0cd4274970be5b4a78bf08524989a9b15280",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Kegs_of_coins.png/220px-Kegs_of_coins.png",
				"previous": "Numismatists Anthony Swiatek and Walter Breen, in their encyclopedia of early commemoratives, suggested that the \"flawed\" first specimen was not destroyed, but was given to Ellsworth, a noted coin collector who possessed rarities such as the Brasher doubloon and two specimens of the 1804 dollar. They deemed it unlikely that experienced Mint workers would have selected a flawed planchet to use in the first strike, and that Ellsworth obtained the piece with Bosbyshell's agreement.[20]",
				"after": "On December 15, the Mint shipped five kegs of the new coins, each holding 10,000 pieces, to Chicago. Each keg held five bags with a thousand coins each, though in one keg, one bag was intentionally short four coins, as also in that keg was a cigar box containing four envelopes, with coins number 1, 400, 1492, and 1892 from the first day of production. The kegs were taken to the Chicago Sub-Treasury, and on December 19 at 1:00 pm conveyed to Room 404 of the Rand McNally Building, the exposition's headquarters. There, Harlow N. Higinbotham, president of the Exposition Company, took mallet and chisel in hand and opened the keg, removing the cigar box. Placing three of the envelopes in his pocket, he displayed the first coin to the assembled crowd, then exchanged it for a check—Wyckoff, Seamans & Benedict (later the Remington Typewriter Company and makers of the official typewriter of the fair), was purchasing the first coin struck for $10,000 as a publicity stunt.[21] That coin was donated to the newly established Columbian Museum (today the Field Museum).[22][23] The Company immediately put the pieces on sale for $1 each, and the first shipment was soon all sold to those who lined up to buy them, had ordered them by mail, or had purchased them at local banks that were given allocations.[24] No official packaging was provided; the pieces exist in holders supplied by various banks.[25]",
			"color": " "
		}
	}
}
