{
	"add": {
		"doc": {
			"id": "1fc897fc129ec962145d43a5ef95c62433298ca07aab66aab8694f41bc357e77",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Palaeopropithecus_ingens.jpg/220px-Palaeopropithecus_ingens.jpg",
				"previous": "Historically, lemurs ranged across the entire island inhabiting a wide variety of habitats, including dry deciduous forests, lowland forests, spiny thickets, subhumid forests, montane forest, and mangrove. Today, their collective range is restricted to 10% of the island, or approximately 60,000 km2 (23,000 sq mi).[54] Most of the remaining forests and lemurs are found along the periphery of the island. The center of the island, the Hauts-Plateaux, was converted by early settlers to rice paddies and grassland through slash-and-burn agriculture, known locally as tavy. As erosion depleted the soil, the cyclical forest regrowth and burning ended as the forest gradually failed to return.[55] Today, the level of floral diversity increases with precipitation, from the dry southern forests to the wetter northern forests to the rainforests along the east coast. Increased foliage corresponds to increased faunal diversity, including the diversity and complexity of lemur communities.[16]",
				"after": "Having evolved in Madagascar's challenging environment, replete with poor soils, extreme shifts in poor, seasonal plant productivity, and devastating climatic events such as extended droughts and annual cyclones,[15] lemurs have adopted unique combinations of unusual traits to survive, distinguishing them significantly from other primates. In response to limited, seasonal resources, lemurs may exhibit seasonal fat storage, hypometabolism (including torpor and hibernation in some cheirogaleids), small group sizes, low encephalization (relative brain size), cathemerality (activity both day and night), and/or strict breeding seasons.[15][56] Secondarily, extreme resource limitations and seasonal breeding are thought to have resulted in three other relatively common lemur traits: female dominance, sexual monomorphism (lack of size differences between the sexes), and male-male competition for mates involving low levels of agonism (conflict), such as sperm competition.[57]",
			"color": "dim|0.29621 gray|0.29621 dim|0.29621 grey|0.29621 gray|0.21008 grey|0.21008 dark|0.19851 olive|0.19851 green|0.19851 dark|0.13798 sea|0.13798 green|0.13798 powder|0.04977 blue|0.04977 dark|0.040904 gray|0.040904 dark|0.040904 grey|0.040904  "
		}
	}
}
