{
	"add": {
		"doc": {
			"id": "1fd742268d995245fc87964d00854a35589210c8907d14855ed95ff3d11f96cb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Aviva_Stadium%28Dublin_Arena%29.JPG/220px-Aviva_Stadium%28Dublin_Arena%29.JPG",
				"previous": "Croke Park is the largest sport stadium in Ireland. The headquarters of the Gaelic Athletic Association, it has a capacity of 84,500. It is the fourth largest stadium in Europe after Nou Camp in Barcelona, Wembley Stadium in London and Santiago Bernabéu Stadium in Madrid.[86] It hosts the premier Gaelic football and hurling games, international rules football and irregularly other sporting and non-sporting events including concerts. During the redevelopment of Lansdowne Road it played host to the Irish Rugby Union Team and Republic of Ireland national football team as well as hosting the Heineken Cup rugby 2008–09 semi-final between Munster and Leinster which set a world record attendance for a club rugby match.[87] The Dublin GAA team plays most of their home league hurling games at Parnell Park.",
				"after": "I.R.F.U. Stadium Lansdowne Road was laid out in 1874. This was the venue for home games of both the Irish Rugby Union Team and the Republic of Ireland national football team. A joint venture between the Irish Rugby Football Union, the FAI and the Government, saw it redeveloped into a new state-of-the-art 51,500 seat Aviva Stadium, which opened in May 2010.[88] Aviva Stadium hosted the 2011 UEFA Europa League Final.[89] Rugby union team Leinster Rugby play their competitive home games in the RDS Arena & the Aviva Stadium while Donnybrook Stadium hosts their friendlies and A games, Ireland A and Women, Leinster Schools and Youths and the home club games of All Ireland League clubs Old Wesley and Bective Rangers. County Dublin is home for 13 of the senior rugby union clubs in Ireland including 5 of the 10 sides in the top division 1A.[90]",
			"color": "dim|0.24178 gray|0.24178 dim|0.24178 grey|0.24178 gray|0.18953 grey|0.18953 slate|0.12708 gray|0.12708 light|0.11122 slate|0.11122 gray|0.11122 dark|0.086016 gray|0.086016 dark|0.086016 grey|0.086016 black|0.077605 silver|0.057286 dark|0.049059 slate|0.049059 gray|0.049059 light|0.028646 gray|0.028646 light|0.028646 grey|0.028646 gainsboro|0.015514  "
		}
	}
}
