{
	"add": {
		"doc": {
			"id": "1fd72cdd3aa681382fae859844fe2b2989c89a42a02f676d976d170ce53b5bbd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/England_v_Australia_1899.jpg/450px-England_v_Australia_1899.jpg",
				"previous": "In his early career Fry was an enthusiastic and successful right-arm fast-medium bowler. He returned his career best figures of 6–78 in the 1895 Varsity match,[33] and he twice took ten wickets in a match: 5–75 and 5–102 for the Gentlemen of England against I Zingari in 1895,[34] and 5–81 and 5–66 for Sussex against Nottinghamshire in 1896 (a match in which he also scored 89 and 65).[35] The late 1890s saw a re-emergence of the throwing controversy in cricket. Several professional bowlers including Arthur Mold and Ernie Jones were no-balled and forced to retire. Fry's bowling action was criticised by opponents and team-mates, and it was only a matter of time before he too was no-balled by umpire Jim Phillips.[36]",
				"after": "Fry scored 94 first-class centuries, including an unprecedented six consecutive centuries in 1901. No-one else has scored more consecutive hundreds.[37] He made his highest first-class score of 258 not out in 1911,[38] a season which led to his recall to the England Test team as captain in 1912. In 1921 Fry was once again considered for the Test side. The Selection Committee asked him to play in the First Test match at Nottingham under the captaincy of Johnny Douglas, with a view to taking over the captaincy for the remainder of the series if, as they anticipated, things went wrong. Fry declined on the basis that there was no sense in recalling a forty-nine-year-old merely as a player, but stated that he would consider returning as captain. As England were badly beaten at Nottingham the Selection Committee again pressed Fry to return for the Second Test but once again he declined, due to poor form. Following another heavy defeat in the Second Test the Selection Committee made a further attempt to persuade Fry to return for the Third Test as captain, a job he was now keen to accept. Unfortunately he injured a finger taking a catch during Hampshire's match with the Australians. In the short term, the injury did not appear too serious: he scored a half-century in Hampshire's first innings and, when they followed on in reply to the Australians' massive total he top scored with 37. Furthermore, in his next match against Nottinghamshire he scored 61 in the first innings (but registered a duck in the second). It appears however that the injury was affecting his fielding more than his batting and, for last time, C.B. felt obliged to stand down from the side for the next Test.[39] Fry later commentated on cricket matches, being called \"one of the most eloquent cricket commentators of all time.\"[40]",
			"color": "dim|0.29387 gray|0.29387 dim|0.29387 grey|0.29387 gray|0.26336 grey|0.26336 dark|0.13927 gray|0.13927 dark|0.13927 grey|0.13927 silver|0.047386 light|0.03128 gray|0.03128 light|0.03128 grey|0.03128 gainsboro|0.02344 linen|0.019905 sea|0.019679 shell|0.019679 floral|0.018543 white|0.018543 white|0.018241 smoke|0.018241 snow|0.016044 mint|0.015006 cream|0.015006 white|0.014092 old|0.013504 lace|0.013504 ivory|0.013107 antique|0.011409 white|0.011409 ghost|0.0088965 white|0.0088965 azure|0.0084988 alice|0.0053852 blue|0.0053852 beige|0.0045326 lavender|0.0042803 blush|0.0042803 honeydew|0.0034941  "
		}
	}
}
