{
	"add": {
		"doc": {
			"id": "1fdfe91207e3ff7575153c85617484378cc5b5097d297ea39fcaa0c25ef6bcca",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/York_%28Cumberland%29_House_Pall_Mall.jpg/150px-York_%28Cumberland%29_House_Pall_Mall.jpg",
				"previous": "One of Brettingham's greatest solo commissions came when he was asked to design a town house for the 9th Duke of Norfolk in St. James's Square, London.[12] Completed in 1756, the exterior of this mansion was similar to those of many of the great palazzi in Italian cities: bland and featureless, the piano nobile distinguishable only by its tall pedimented windows. This arrangement, devoid of pilasters and a pediment giving prominence to the central bays at roof height, was initially too severe for the English taste, even by the fashionable Palladian standards of the day. Early critics declared the design \"insipid\".[13]",
				"after": "However, the interior design of Norfolk House was to define the London town house for the next century.[13] The floor plan was based on an adaptation of one of the secondary wings he had built at Holkham Hall.[14] A circuit of reception rooms centred on a grand staircase, with the staircase hall replacing the Italian traditional inner courtyard or two-storey hall. This arrangement of salons allowed guests at large parties to circulate, having been received at the head of the staircase, without doubling back on arriving guests. The second advantage was that while each room had access to the next, it also had access to the central stairs, thus allowing only one or two rooms to be used at a time for smaller functions. Previously, guests in London houses had had to reach the principal salon through a long enfilade of minor reception rooms. In this square and compact way, Brettingham came close to recreating the layout of an original Palladian Villa. He transformed what Andrea Palladio had conceived as a country retreat into a London mansion appropriate for the lifestyle of the British aristocracy, with its reversal of the usual Italian domestic pattern of a large palazzo in town, and a smaller villa in the country. As happened so often in Brettingham's career, Robert Adam later developed this design concept further, and was credited with its success. However, Brettingham's plan for Norfolk House was to serve as the prototype for many London mansions over the next few decades.",
			"color": "gray|0.40708 grey|0.40708 dark|0.40708 gray|0.40708 dark|0.40708 grey|0.40708  "
		}
	}
}
