{
	"add": {
		"doc": {
			"id": "1fef4477a18e23b84831ce2340ee1834bf2d3fd73f62ec456281ee85d10c61c3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Massospondylus_baby_BW.jpg/220px-Massospondylus_baby_BW.jpg",
				"previous": "The embryos probably represented near-hatchlings.[63] While the skeletal features were similar to those of the adults, the body proportions were very dissimilar. The head was big with a short snout and very large orbits, whose diameter amounts 39 % of the entire skull length. The neck was short, contrasting to the very long neck in the adults. Girdle bones and caudals were relatively tiny.[54] The forelimbs were of equal length to the hindlimbs, indicating that newly hatched Massospondylus were quadrupedal, unlike the bipedal adults.[54] The discovery of hatching footprints with manus impressions confirmed their quadrupedality. These impressions show that the hand was not pronated, with palm faces facing each other and the thumb facing forwards.[64] The unpronated manus and the big head indicate that an effective locomotion was not possible for newly hatched Massospondylus.[8] Notably, the near-hatchings had no teeth, suggesting they had no way of feeding themselves.[54] Based on the lack of teeth and the ineffective locomotion, scientists speculate that postnatal care might have been necessary.[8][54] This is further supported by evidence that the hatchings remained at the nest sites until they had doubled in size.[64]",
				"after": "Newly hatched juveniles are known from a second prosauropod, Mussaurus; these remains resemble those of the embryonic Massospondylus, suggesting that quadrupedality was present in newly hatched Mussaurus and presumably other prosauropods as well.[8][63] The quadrupedality of the hatchings suggests that the quadrupedal posture of later sauropods may have evolved from retention of juvenile characteristics in adult animals, an evolutionary phenomenon known as pedomorphosis.[54] This discovery therefore \"sheds some light in the evolutionary pathways through which the peculiar adaptations of giant dinosaurs were attained\", stated French paleontologist Eric Buffetaut.[65]",
			"color": "dark|0.17034 gray|0.17034 dark|0.17034 grey|0.17034 dark|0.10923 khaki|0.10923 white|0.056799 smoke|0.056799 sea|0.056101 shell|0.056101 floral|0.054693 white|0.054693 snow|0.054347 mint|0.05374 cream|0.05374 white|0.053614 ghost|0.048152 white|0.048152 azure|0.047508 alice|0.044101 blue|0.044101 silver|0.034708 lavender|0.031696 blush|0.031696 ivory|0.025253 light|0.022749 gray|0.022749 light|0.022749 grey|0.022749 gainsboro|0.018611 tan|0.018416 linen|0.017811 old|0.010444 lace|0.010444 wheat|0.0083315 pale|0.0076708 golden|0.0076708 rod|0.0076708 black|0.0062819 honeydew|0.0060592 beige|0.00548 corn|0.0043525 silk|0.0043525 gray|0.0042109 grey|0.0042109 antique|0.0038584 white|0.0038584 burly|0.0037488 wood|0.0037488 papaya|0.0034415 whip|0.0034415 light|0.0034151 yellow|0.0034151  "
		}
	}
}
