{
	"add": {
		"doc": {
			"id": "1ff0067f6326286c4fdc5d7bf450ec5aa23be6af2efcf67d7462b208dc29abf8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/YAV-8B_construction_NAN11-78.jpg/220px-YAV-8B_construction_NAN11-78.jpg",
				"previous": "As the USMC wanted a substantially improved Harrier without the development of a new engine, the plan for Harrier II development was authorized by the United States Department of Defense (DoD) in 1976.[17][18] The United States Navy (USN), which had traditionally procured military aircraft for the USMC, insisted that the new design be verified with flight testing.[19] McDonnell Douglas modified two AV-8As with new wings, revised intakes, redesigned exhaust nozzles, and other aerodynamic changes; the modified forward fuselage and cockpit found on all subsequent aircraft were not incorporated on these prototypes.[20][21] Designated YAV-8B, the first converted aircraft flew on 9 November 1978, at the hands of Charles Plummer. The aircraft performed three vertical take-offs and hovered for seven minutes at Lambert–St. Louis International Airport.[22] The second aircraft followed on 19 February 1979, but crashed that November due to engine flameout; the pilot ejected safely.[21][23] Flight testing of these modified AV-8s continued into 1979.[17] The results showed greater than expected drag, hampering the aircraft's maximum speed. Further refinements to the aerodynamic profile yielded little improvement.[21] Positive test results in other areas, including payload, range, and V/STOL performance, led to the award of a development contract in 1979. The contract stipulated a procurement of 12 aircraft initially, followed by a further 324.[2][24]",
				"after": "Between 1978 and 1980, the DoD and USN repeatedly attempted to terminate the AV-8B program. There had previously been conflict between the USMC and USN over budgetary issues. At the time, the USN wanted to procure A-18s for its ground attack force and, to cut costs, pressured the USMC to adopt the similarly-designed F-18 fighter instead of the AV-8B to fulfill the role of close air support (both designs were eventually amalgamated to create the multirole F/A-18 Hornet).[25] Despite these bureaucratic obstacles, in 1981, the DoD included the Harrier II in its annual budget and five-year defense plan. The USN declined to participate in the procurement, citing the limited range and payload compared with conventional aircraft.[26]",
			"color": "silver|0.18547 light|0.17196 gray|0.17196 light|0.17196 grey|0.17196 dark|0.15317 gray|0.15317 dark|0.15317 grey|0.15317 gainsboro|0.14957 gray|0.077095 grey|0.077095 white|0.045534 smoke|0.045534 dim|0.045251 gray|0.045251 dim|0.045251 grey|0.045251 lavender|0.024938 blush|0.024938 linen|0.023094 alice|0.021437 blue|0.021437 ghost|0.020971 white|0.020971 sea|0.019691 shell|0.019691 snow|0.019133 white|0.013911 black|0.012849 floral|0.0069274 white|0.0069274 mint|0.0060335 cream|0.0060335 azure|0.0028492  "
		}
	}
}
