{
	"add": {
		"doc": {
			"id": "1ff031f68b5baad86e61fc9ab0acefe1ec36ce37ab3621eeb2073525a3228ed6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/The_Animals_Entering_Noah%27s_Ark_1570s_Jacopo_Bassano.jpg/220px-The_Animals_Entering_Noah%27s_Ark_1570s_Jacopo_Bassano.jpg",
				"previous": "Much information about the bird's appearance comes from a painting attributed to Jacob Hoefnagel, based on a bird in the menagerie of Emperor Rudolph II around 1610.[13] It is the only coloured depiction of the species, showing the plumage as reddish brown, but it is unknown whether it was based on a stuffed or living specimen.[9] The bird had most likely been brought alive to Europe, as it is unlikely that taxidermists were on board the visiting ships, and spirits were not yet used to preserve biological specimens. Most tropical specimens were preserved as dried heads and feet. It had probably lived in the emperor's zoo for a while together with the other animals painted for the same series.[4] The painting was discovered in the emperor's collection and published in 1868 by Georg von Frauenfeld, along with a painting of a dodo from the same collection and artist.[5] This specimen is thought to have been the only red rail that ever reached Europe.[14]",
				"after": "The travel journal of the Dutch East India Company ship Gelderland (1601–1603), rediscovered in the 1860s, contains good sketches of several now-extinct Mauritian birds attributed to the artist Joris Laerle, including an unlabelled red rail. The bird appears to have been stunned or killed, and the sketch is the earliest record of the species, but was only rediscovered in the 1860s. The image was sketched with pencil and finished in ink, but details such as a deeper beak and the shoulder of the wing are only seen in the underlying sketch.[15] In addition, there are three rather crude black-and-white sketches, but differences in them were enough for some authors to suggest that each image depicted a distinct species, leading to the creation of several scientific names which are now synonymous with Aphanapteryx bonasia.[11]",
			"color": "black|0.63852 gray|0.053175 grey|0.053175 dark|0.052214 gray|0.052214 dark|0.052214 grey|0.052214 dim|0.049307 gray|0.049307 dim|0.049307 grey|0.049307 silver|0.02462 light|0.021584 slate|0.021584 gray|0.021584 slate|0.01756 gray|0.01756 light|0.015936 gray|0.015936 light|0.015936 grey|0.015936 gainsboro|0.01245  "
		}
	}
}
