{
	"add": {
		"doc": {
			"id": "1ffd00c7d46d47a59bc75c2a8b5661d786b7c12ab9de4a322c254c0c836539c7",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d1/Norton_mechanical_filter.png/300px-Norton_mechanical_filter.png",
				"previous": "An early application of these new theoretical tools was in phonographic sound reproduction. A recurring problem with early phonograph designs was that mechanical resonances in the pickup and sound transmission mechanism caused excessively large peaks and troughs in the frequency response, resulting in poor sound quality. In 1923, Harrison of the Western Electric Company filed a patent for a phonograph in which the mechanical design was entirely represented as an electrical circuit. The horn of the phonograph is represented as a transmission line, and is a resistive load for the rest of the circuit, while all the mechanical and acoustic parts—from the pickup needle through to the horn—are translated into lumped components according to the impedance analogy. The circuit arrived at is a ladder topology of series resonant circuits coupled by shunt capacitors. This can be viewed as a bandpass filter circuit. Harrison designed the component values of this filter to have a specific passband corresponding to the desired audio passband (in this case 100 Hz to 6 kHz) and a flat response. Translating these electrical element values back into mechanical quantities provided specifications for the mechanical components in terms of mass and stiffness, which in turn could be translated into physical dimensions for their manufacture. The resulting phonograph has a flat frequency response in its passband and is free of the resonances previously experienced.[15] Shortly after this, Harrison filed another patent using the same methodology on telephone transmit and receive transducers.[16]",
				"after": "Harrison used Campbell's image filter theory, which was the most advanced filter theory available at the time. In this theory, filter design is viewed essentially as an impedance matching problem.[17] More advanced filter theory was brought to bear on this problem by Norton in 1929 at Bell Labs. Norton followed the same general approach though he later described to Darlington the filter he designed as being \"maximally flat\".[1] Norton's mechanical design predates the paper by Butterworth who is usually credited as the first to describe the electronic maximally flat filter.[18] The equations Norton gives for his filter correspond to a singly terminated Butterworth filter, that is, one driven by an ideal voltage source with no impedance, whereas the form more usually given in texts is for the doubly terminated filter with resistors at both ends, making it hard to recognise the design for what it is.[19] Another unusual feature of Norton's filter design arises from the series capacitor, which represents the stiffness of the diaphragm. This is the only series capacitor in Norton's representation, and without it, the filter could be analysed as a low-pass prototype. Norton moves the capacitor out of the body of the filter to the input at the expense of introducing a transformer into the equivalent circuit (Norton's figure 4). Norton has used here the \"turning round the L\" impedance transform to achieve this.[20]",
			"color": "dark|0.23319 gray|0.23319 dark|0.23319 grey|0.23319 gray|0.22404 grey|0.22404 dim|0.14564 gray|0.14564 dim|0.14564 grey|0.14564 silver|0.11922 light|0.060361 gray|0.060361 light|0.060361 grey|0.060361 gainsboro|0.043277 white|0.022718 smoke|0.022718 alice|0.017474 blue|0.017474 ghost|0.017361 white|0.017361 snow|0.016867 sea|0.016776 shell|0.016776 lavender|0.015708 blush|0.015708 white|0.015552 mint|0.013832 cream|0.013832 floral|0.011631 white|0.011631 azure|0.011119 linen|0.0071579 black|0.0062233  "
		}
	}
}
