{
	"add": {
		"doc": {
			"id": "200e2b18e93e2c890ff2a4e16c1972a0d28626953d7530821c8824e199a1456e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Hodges%2C_Resolution_and_Adventure_in_Matavai_Bay.jpg/220px-Hodges%2C_Resolution_and_Adventure_in_Matavai_Bay.jpg",
				"previous": "Supervised by his father, Georg Forster first took up the studies of zoology and botanics of the southern seas, mostly by drawing animals and plants. However, Georg also pursued his own interests which led to completely independent explorations in comparative geography and ethnology. He quickly learned the languages of the Polynesian islands. His reports on the people of Polynesia are well regarded even to today, as they show Forster's description of the inhabitants of the southern islands with empathy, sympathy and largely without Western or Christian prejudices.[10]",
				"after": "Unlike Louis Antoine de Bougainville, whose reports from a journey to Tahiti a few years earlier had initiated uncritical noble savage romanticism, Forster had a very sophisticated picture of the societies of the South Pacific islands.[10] He described various social structures and religions that he encountered on the Society Islands, Easter Island and in Tonga and New Zealand, and ascribed this diversity to the difference in living conditions of these people. At the same time he also observed that the languages of these fairly widely scattered islands are quite similar. About the inhabitants of the Nomuka islands (in the Ha'apai island group of present-day Tonga), he wrote that their languages, vehicles, weapons, furniture, clothes, tattoos, style of beard, in short all of their being matched perfectly with what he had already seen while studying tribes on Tongatapu. However, he wrote, \"we could not observe any subordination among them, though this had strongly characterised the natives of Tonga-Tabboo, who seemed to descend even to servility in their obeisance to the king.\"[11]",
			"color": "dim|0.69107 gray|0.69107 dim|0.69107 grey|0.69107 gray|0.13363 grey|0.13363 dark|0.083616 khaki|0.083616  "
		}
	}
}
