{
	"add": {
		"doc": {
			"id": "2015273b706b47a2be62db306b4997f81f1bf03580f58c69afe5fe07b0d7d315",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/September_11_2001_just_collapsed.jpg/200px-September_11_2001_just_collapsed.jpg",
			"previous": [],
				"after": "Terrorism is the main systematic use of terror especially as a means of coercion. At present, there is no internationally agreed definition of terrorism. Common definitions of terrorism refer only to those violent acts which are intended to create fear (terror), are perpetrated for an ideological goal (as opposed to a \"lone wolf\" attack), and deliberately target or disregard the safety of non-combatants. Some definitions also include acts of unlawful violence and war. The history of terrorist organizations suggests that they do not select terrorism for its political effectiveness. Individual terrorists tend to be motivated more by a desire for social solidarity with other members of their organization than by political platforms or strategic objectives, which are often murky and undefined. The word \"terrorism\" is politically and emotionally charged, and this greatly compounds the difficulty of providing a precise definition. Studies have found over 100 definitions of “terrorism”. The concept of terrorism is itself controversial because it is often used by states to delegitimize political or foreign opponents, and potentially legitimize the state's own use of terror against them. A less politically and emotionally charged, and better defined, term (used not only for terrorists, and not including all those who have been described as terrorists) is violent non-state actor. Terrorism has been practiced by a broad array of political organizations for furthering their objectives. It has been practiced by both right-wing and left-wing political parties, nationalistic groups, religious groups, revolutionaries, and ruling governments. One form is the use of violence against noncombatants for the purpose of gaining publicity for a group, cause, or individual.",
			"color": "dim|0.18457 gray|0.18457 dim|0.18457 grey|0.18457 gray|0.11305 grey|0.11305 dark|0.092964 gray|0.092964 dark|0.092964 grey|0.092964 antique|0.086804 white|0.086804 silver|0.061449 light|0.055836 gray|0.055836 light|0.055836 grey|0.055836 gainsboro|0.046556 linen|0.035005 black|0.032902 papaya|0.031349 whip|0.031349 slate|0.028615 gray|0.028615 old|0.025628 lace|0.025628 tan|0.020705 sea|0.020018 shell|0.020018 blanched|0.019633 almond|0.019633 beige|0.016555 floral|0.016076 white|0.016076 light|0.015616 slate|0.015616 gray|0.015616 dark|0.015503 slate|0.015503 gray|0.015503 misty|0.015288 rose|0.015288 bisque|0.012415 corn|0.010761 silk|0.010761 ivory|0.0095988 white|0.007705 smoke|0.007705  "
		}
	}
}
