{
	"add": {
		"doc": {
			"id": "20217ddfc28cb3c196b2650392e0599f7bd2e7d3898738c7de1146cb038fee09",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Ambositra_04.jpg/220px-Ambositra_04.jpg",
				"previous": "Game was regularly hunted and trapped in the forests, including frogs, snakes, lizards, hedgehogs and tenrecs, tortoises, wild boars, insects, larvae, birds and lemurs.[6] The first settlers encountered Madagascar's wealth of megafauna, including giant lemurs, elephant birds, giant fossa and the Malagasy hippopotamus. Early Malagasy communities may have eaten the eggs and—less commonly—the meat of Aepyornis maximus, the world's largest bird, which remained widespread throughout Madagascar as recently as the 17th century.[7] While several theories have been proposed to explain the decline and eventual extinction of Malagasy megafauna, clear evidence suggests that hunting by humans and destruction of habitats through slash-and-burn agricultural practices were key factors.[8][9] Although it has been illegal to hunt or trade any of the remaining species of lemur since 1964, these endangered animals continue to be hunted for immediate local consumption in rural areas or to supply the demand for exotic bush meat at some urban restaurants.[10]",
				"after": "As more virgin forest was lost to tavy, communities increasingly planted and cultivated permanent plots of land.[12] By 600 CE, groups of these early settlers had moved inland and begun clearing the forests of the central highlands. Rice was originally dry planted or cultivated in marshy lowland areas, which produced low yields. Irrigated rice paddies were adopted in the highlands around 1600, first in Betsileo country in the southern highlands, then later in the northern highlands of Imerina.[11] By the time terraced paddies emerged in central Madagascar over the next century,[11] the area's original forest cover had largely vanished. In its place were scattered villages ringed with nearby rice paddies and crop fields a day's walk away, surrounded by vast plains of sterile grasses.[2]",
			"color": "olive|0.56353 drab|0.56353 dark|0.15273 khaki|0.15273 dark|0.076179 olive|0.076179 green|0.076179 light|0.040611 slate|0.040611 gray|0.040611 dark|0.040014 gray|0.040014 dark|0.040014 grey|0.040014 silver|0.028461 light|0.027178 steel|0.027178 blue|0.027178 slate|0.023223 gray|0.023223 light|0.0097333 gray|0.0097333 light|0.0097333 grey|0.0097333 gray|0.0080106 grey|0.0080106 dim|0.0072129 gray|0.0072129 dim|0.0072129 grey|0.0072129  "
		}
	}
}
