{
	"add": {
		"doc": {
			"id": "202a520bc79345112073814cef8834f74e2b2811b2ff2bd1924d4f0d9e8700d3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Stella_Artois_Pro.jpg/200px-Stella_Artois_Pro.jpg",
			"previous": [],
				"after": "In January 2012, British MP Tom Watson discovered that Portland Communications had been removing the nickname of one of its clients' products (\"Wife Beater\", referring to Anheuser-Busch InBev's Stella Artois beer) from Wikipedia. Chartered Institute of Public Relations (CIPR) CEO Jane Wilson noted, \"Stella Artois is on the 'wife-beater' page because it is a nick-name in common currency for that brand of strong continental lager. The brand managers who want to change this have a wider reputational issue to address, editing the term from a Wikipedia page will not get rid of this association.\"[71] Other edits from Portland's offices included changes to articles about another Portland client, the Kazakhstan's BTA Bank, and its former head Mukhtar Ablyazov. Portland did not deny making the changes, arguing they had been done transparently and in accordance with Wikipedia's policies.[72] Portland Communications welcomed CIPR's subsequent announcement of a collaboration with Wikipedia and invited Jimmy Wales to speak to their company, as he did at Bell Pottinger.[73] Tom Watson was optimistic about the collaboration: \"PR professionals need clear guidelines in this new world of online-information-sharing. That's why I am delighted that interested parties are coming together to establish a clear code of conduct.\"[74]",
			"color": "white|0.10939 smoke|0.10939 ghost|0.10825 white|0.10825 alice|0.10784 blue|0.10784 lavender|0.10746 blush|0.10746 snow|0.10652 white|0.10049 lavender|0.095943 sea|0.050249 shell|0.050249 light|0.046587 steel|0.046587 blue|0.046587 azure|0.027685 olive|0.017314 drab|0.017314 gainsboro|0.016795 mint|0.014914 cream|0.014914 floral|0.013509 white|0.013509 black|0.01128 light|0.010405 gray|0.010405 light|0.010405 grey|0.010405 linen|0.0079734 light|0.0065452 slate|0.0065452 gray|0.0065452 slate|0.0044667 gray|0.0044667 silver|0.004161 dark|0.0034597 olive|0.0034597 green|0.0034597  "
		}
	}
}
