{
	"add": {
		"doc": {
			"id": "2052c61c30579bf7248a37930be95bb568c9fe8a17286b030f8be345f06de4d1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/QF12pdr18cwtGunsXTurretHMSDreadnought.jpg/220px-QF12pdr18cwtGunsXTurretHMSDreadnought.jpg",
				"previous": "The first dreadnoughts tended to have a very light secondary armament intended to protect them from torpedo boats. Dreadnought carried 12-pounder guns; each of her twenty-two 12-pounders could fire at least 15 rounds a minute at any torpedo boat making an attack.[54] The South Carolinas and other early American dreadnoughts were similarly equipped.[55] At this stage, torpedo boats were expected to attack separately from any fleet actions. Therefore, there was no need to armour the secondary gun armament, or to protect the crews from the blast effects of the main guns. In this context, the light guns tended to be mounted in unarmoured positions high on the ship to minimize weight and maximize field of fire.[56]",
				"after": "Within a few years, the principal threat was from the destroyer—larger, more heavily armed, and harder to destroy than the torpedo boat. Since the risk from destroyers was very serious, it was considered that one shell from a battleship's secondary armament should sink (rather than merely damage) any attacking destroyer. Destroyers, in contrast to torpedo boats, were expected to attack as part of a general fleet engagement, so it was necessary for the secondary armament to be protected against shell splinters from heavy guns, and the blast of the main armament. This philosophy of secondary armament was adopted by the German navy from the start; Nassau, for instance, carried twelve 150-mm (5.9 in) and sixteen 88-mm (3.45 in) guns, and subsequent German dreadnought classes followed this lead.[39] These heavier guns tended to be mounted in armoured barbettes or casemates on the main deck. The Royal Navy increased its secondary armament from 12-pounder to first 4-inch (100 mm) and then 6-inch (150 mm) guns, which were standard at the start of World War I;[57] the US standardized on 5-inch (130 mm) calibre for the war but planned 6-inch guns for the ships designed just afterwards.[58]",
			"color": " "
		}
	}
}
