{
	"add": {
		"doc": {
			"id": "205d8a0d544ac382eb892f0c202bd4dd80b41ef8e43e8a1f2b26d96d0496db91",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Mckin.jpg/170px-Mckin.jpg",
				"previous": "McKinley’s good standing with labor became useful that year as he campaigned for the Republican nomination for Ohio's 17th congressional district.[47] Delegates to the county conventions thought he could attract blue-collar voters, and in August 1876, McKinley was nominated.[47] By that time, Hayes had been nominated for President, and McKinley campaigned for him while running his own congressional campaign.[48] Both were successful. McKinley, campaigning mostly on his support for a protective tariff, defeated the Democratic nominee, Levi L. Lamborn, by 3,300 votes, while Hayes won a hotly disputed election to reach the presidency.[48] McKinley’s victory came at a personal cost: his income as a congressman would be half of what he earned as a lawyer.[49]",
				"after": "McKinley first took his congressional seat in October 1877, when President Hayes summoned Congress into special session.[b] With the Republicans in the minority, McKinley was given unimportant committee assignments, which he undertook conscientiously.[51] McKinley’s friendship with Hayes did McKinley little good on Capitol Hill; the President was not well-regarded by many leaders there.[52] The young congressman broke with Hayes on the question of the currency, but it did not affect their friendship.[53] The United States had effectively been placed on the gold standard by the Coinage Act of 1873; when silver prices dropped significantly, many sought to make silver again a legal tender, equally with gold. Such a course would be inflationary, but advocates argued that the economic benefits of the increased money supply would be worth the inflation; opponents warned that “free silver” would not bring the promised benefits and would harm the United States in international trade.[54] McKinley voted for the Bland-Allison Act of 1878, which mandated large government purchases of silver for striking into money, and also joined the large majorities in each house that overrode Hayes’ veto of the legislation. In so doing, McKinley voted against the position of the House Republican leader, his fellow Ohioan and friend, James Garfield.[55]",
			"color": " "
		}
	}
}
