{
	"add": {
		"doc": {
			"id": "20922ba9c01483e4740444898bb6691aeb4bca49ab0dd567823416988ba8c8ca",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Hybridpeak.svg/220px-Hybridpeak.svg.png",
				"previous": "The DA36 E-Star, an aircraft designed by Siemens, Diamond Aircraft and EADS, employs a series hybrid powertrain with the propeller being turned by a Siemens 70 kW (94 hp) electric motor. The aim is to reduce fuel consumption and emissions by up to 25 percent. An onboard 40 hp (30 kW) Austro Engines Wankel rotary engine and generator provides the electricity. A propeller speed reduction unit is eliminated. The electric motor uses electricity stored in batteries, with the engines off, to take off and climb reducing sound emissions. The series-hybrid powertrain using the Wankel engine reduces the weight of the plane by 100 kilograms from its predecessor. The DA36 E-Star first flew in June 2013, making this the first ever flight of a series-hybrid powertrain. Diamond Aircraft state that the technology using Wankel engines is scalable to a 100-seat aircraft.[91][92]",
				"after": "Due to the compact size and the high power to weight ratio of a Wankel engine, a number have been proposed for electric vehicles as range extenders with a number of concept cars displaying a series hybrid powertrain arrangement. A Wankel engine used only as a generator has packaging and weight distribution advantages, maximizing interior passenger and luggage space when used in a vehicle. The engine/generator may be at one end of the vehicle with the electric driving motors at the other connected only by thin light cables. In 2010 Audi revealed a prototype series-hybrid electric car, the A1 e-tron, that incorporated a small 250 cc Wankel engine running at 5,000 rpm recharging the car's batteries as needed, and providing electricity directly to the electric driving motor.[93][94] In 2010 FEV Inc revealed that in their prototype electric version of the Fiat 500 a Wankel engine would also be used as a range extender.[95] Valmet Automotive of Finland in 2013 revealed a prototype incorporating a Wankel powered series-hybrid powertrain car named the EVA, utilizing an engine manufactured by the German company Wankel SuperTec.[96]",
			"color": "aqua|0.16099 cyan|0.16099 black|0.13844 dark|0.12385 turquoise|0.12385 tomato|0.11554 dim|0.056446 gray|0.056446 dim|0.056446 grey|0.056446 dark|0.038545 cyan|0.038545 teal|0.0347 dark|0.029249 gray|0.029249 dark|0.029249 grey|0.029249 light|0.027907 sea|0.027907 green|0.027907 gray|0.0279 grey|0.0279 medium|0.027632 turquoise|0.027632 silver|0.024966 turquoise|0.012149 olive|0.0056987 drab|0.0056987 dark|0.0056563 slate|0.0056563 gray|0.0056563  "
		}
	}
}
