{
	"add": {
		"doc": {
			"id": "2096b0f2160c5481fee10b9334b463cf07720db677fff4bd77c55ee72db08229",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Plateosaurus_trossingensis.jpg/220px-Plateosaurus_trossingensis.jpg",
				"previous": "Material assigned to Plateosaurus has been found at over 50 localities in Germany (mainly along the Neckar and Pegnitz river valleys), Switzerland (Frick) and France.[17] Three localities are of special importance, because they yielded specimens in large numbers and of unusually good quality: near Halberstadt in Saxony-Anhalt, Germany; Trossingen in Baden-Württemberg, Germany; and Frick.[12] Between the 1910s and 1930s, excavations in a clay pit in Saxony-Anhalt revealed between 39 and 50 skeletons that belonged to Plateosaurus, along with teeth and a small number of bones of the theropod Liliensternus, and two skeletons and some fragments of the turtle Proganochelys.[12] Some of the plateosaur material was assigned to P. longiceps, a species described by palaeontologist Otto Jaekel in 1914[18] but now considered a junior synonym of P. engelhardti. Most of the material found its way to the Museum für Naturkunde in Berlin, where much of it was destroyed during World War II.[17] The Halberstadt quarry today is covered by a housing development.[17]",
				"after": "The second major German locality with P. engelhardti finds, a quarry in Trossingen in the Black Forest, was worked repeatedly in the 20th century.[17] Between 1911 and 1932, excavations during six field seasons led by German palaeontologists Eberhard Fraas (1911–1912), Friedrich von Huene (1921–23),[2][19] and finally Reinhold Seemann (1932) revealed a total of 35 complete or partially complete skeletons of Plateosaurus, as well as fragmentary remains of approximately 70 more individuals.[17] The large number of specimens from Swabia had already caused German palaeontologist Friedrich August von Quenstedt to nickname the animal Schwäbischer Lindwurm (Swabian lindworm or Swabian dragon).[B] Much of the Trossingen material was destroyed in 1944, when the Naturaliensammlung in Stuttgart (predecessor to the State Museum of Natural History Stuttgart (SMNS)) burnt to the ground after an Allied bombing raid. Luckily, however, a 2011 study by SMNS curator Rainer Schoch found that, at least from the finds of Seemann's 1932 excavation, \"the scientifically most valuable material is still available\".[C]",
			"color": "tan|0.49203 wheat|0.15064 black|0.088207 moccasin|0.037001 pale|0.028151 golden|0.028151 rod|0.028151 navajo|0.022893 white|0.022893 dark|0.02256 sea|0.02256 green|0.02256 blanched|0.019652 almond|0.019652 bisque|0.019107 burly|0.017332 wood|0.017332 dim|0.015328 gray|0.015328 dim|0.015328 grey|0.015328 gray|0.01243 grey|0.01243 lemon|0.012339 chiffon|0.012339  "
		}
	}
}
