{
	"add": {
		"doc": {
			"id": "20a277448a5497129786c7add4580796e7eb048d1eb6b10bb3330d689879c407",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Windsor_Castle_Crimson_Drawing_Room.jpg/170px-Windsor_Castle_Crimson_Drawing_Room.jpg",
				"previous": "The interior of the State Apartments was mostly designed by Wyatville in the early 19th century. Wyatville intended each room to illustrate a particular architectural style and to display the matching furnishings and fine arts of the period.[21] With some alterations over the years, this concept continues to dominate the apartments. Different rooms follow the Classical, Gothic and Rococo styles, together with an element of Jacobethan in places.[22] Many of the rooms on the eastern end of the castle had to be restored following the 1992 fire, using \"equivalent restoration\" methods – the rooms were restored so as to appear similar to their original appearance, but using modern materials and concealing modern structural improvements.[23][nb 2] These rooms were also partially redesigned at the same time to more closely match modern tastes. Art historian Hugh Roberts has praised the State Apartments as \"a superb and unrivalled sequence of rooms widely regarded as the finest and most complete expression of later Georgian taste.\"[1] Others, such as architect Robin Nicolson and critic Hugh Pearman, have described them as \"bland\" and \"distinctly dull\".[24]",
				"after": "Wyatville's most famous work are those rooms designed in a Rococo style. These rooms take the fluid, playful aspects of this mid-18th-century artistic movement, including many original pieces of Louis XV decoration, but project them on a \"vastly inflated\" scale.[25] Investigations after the 1992 fire have shown though that many Rococo features of the modern castle, originally thought to have been 18th-century fittings transferred from Carlton House or France, are in fact 19th-century imitations in plasterwork and wood, designed to blend with original elements.[26] The Grand Reception Room is the most prominent of these Rococo designs, 100 ft (30 m) long and 40 ft (12 m) tall and occupying the site of Edward III's great hall.[27] This room, restored after the fire, includes a huge French Rococo ceiling, characterised by Ian Constantinides, the lead restorer, as possessing a \"coarseness of form and crudeness of hand ... completely overshadowed by the sheer spectacular effect when you are at a distance\".[28] The room is set off by a set of restored Gobelins French tapestries.[28] Although decorated with less gold leaf than in the 1820s, the result remains \"one of the greatest set-pieces of Regency decoration\".[29] The White, Green and Crimson Drawing Rooms include a total of 62 trophies: carved, gilded wooden panels illustrating weapons and the spoils of war, many with Masonic meanings.[30] Restored or replaced after the fire, these trophies are famous for their \"vitality, precision and three-dimensional quality\", and were originally brought from Carlton House in 1826, some being originally imported from France and others carved by Edward Wyatt.[30] The soft furnishings of these rooms, although luxurious, are more modest than the 1820s originals, both on the grounds of modern taste and cost.[31]",
			"color": "black|0.39291 chocolate|0.089806 dark|0.055397 orange|0.055397 maroon|0.044985 orange|0.042889 sandy|0.036775 brown|0.036775 dark|0.034468 red|0.034468 firebrick|0.018399 peru|0.015881 burly|0.011759 wood|0.011759 golden|0.011384 rod|0.011384 brown|0.0097559 peach|0.0094118 puff|0.0094118 saddle|0.0083622 brown|0.0083622 white|0.0072307 smoke|0.0072307 navajo|0.0072269 white|0.0072269 misty|0.0071132 rose|0.0071132 snow|0.0069321 white|0.0067385 ghost|0.0065125 white|0.0065125 lavender|0.0064802 blush|0.0064802 mint|0.0062379 cream|0.0062379 alice|0.006198 blue|0.006198 sea|0.0061137 shell|0.0061137 floral|0.0060091 white|0.0060091 red|0.0059496 sienna|0.0059262 azure|0.0056262  "
		}
	}
}
