{
	"add": {
		"doc": {
			"id": "20a688529896f57702f463e8512998517c20e795394d4119866e45f6fead9a0c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Colton_Point_Locomotive.jpg/220px-Colton_Point_Locomotive.jpg",
				"previous": "As the 19th century progressed, fewer pines were left and more hemlocks and hardwoods were cut and processed locally.[14] By 1810 there were 11 sawmills in the Pine Creek watershed, and by 1840 there were 145, despite a flood in 1832 which wiped out nearly all the mills along the creek.[11][14] Selective harvesting of pines was replaced by clearcutting of all lumber in a tract. The first lumbering activity close to what is now Colton Point was in 1838 when William Dodge and partners built a settlement at Big Meadows and formed the Pennsylvania Joint Land and Lumber Company. Dodge's company purchased thousands of acres of land in the area, including what is now Colton Point State Park.[8] In 1865 the last pine spar raft floated down the creek, and on March 28, 1871 the General Assembly passed a law which allowed construction of splash dams and allowed creeks to be cleared to allow loose logs to float better. The earliest spring log drives floated up to 20,000,000 board feet (50,000 m3) of logs in Pine Creek at one time.[14] These logs floated to the West Branch Susquehanna River and to sawmills near the Susquehanna Boom at Williamsport.[13] Log drives could be dangerous: just north of the park is Barbour Rock, named for Samuel Barbour, who lost his life on Pine Creek there after breaking up a log jam.[15] Hemlock wood was not widely used until the advent of wire nails, but the bark was used to tan leather. After 1870 the largest tanneries in the world were in the Pine Creek watershed, and required 2,000 pounds (900 kg) of bark to produce 150 pounds (70 kg) of quality sole leather.[14]",
				"after": "In 1879 Henry Colton, who worked for the Williamsport Lumber Company, supervised the cutting of white pine on the land owned by Silas Billings; this land would later become the park.[14][c] Colton gave his name to the Colton Point overlook on the west rim of the Pine Creek Gorge.[9][16] Deadman Hollow Road in the park is named for a trapper whose decomposed body was found in his own bear trap there in the early 20th century. Fourmile Run flows through the park: its O'Connor Branch is named for the dead trapper's brothers, who were loggers in the area.[15]",
			"color": " "
		}
	}
}
