{
	"add": {
		"doc": {
			"id": "20af4c39bd57b960cb6ba694a0ed9086cc599ac8859afff779bfc07490d9c8ec",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/7025Sweetwater.Snowstorm004.130220.jpg/220px-7025Sweetwater.Snowstorm004.130220.jpg",
				"previous": "July is the wettest month of the year (1.05 inches (27 mm)), while June is the driest (.02 inches (0.51 mm)). On September 8, 2014, the city of Phoenix recorded its single highest rainfall total by the National Weather Service with a total of 3.30 inches. This total rainfall on this day measured more than Phoenix's annual rainfall average and broke a 75-year old previous record of 2.91 inches, set back on September 4, 1939.[70][71] This storm was created from the remnants of Hurricane Norbert that had moved up from the Gulf of California and turned the city's major interstates and low-lying roadways into flood plains, stranding hundreds of motorists.[72] Dewpoints range from 39.0 °F (4 °C) in June to 58.2 °F (15 °C) in August.[61]",
				"after": "On average, Phoenix has only one day per year where the temperature drops to or below freezing.[61] However, the frequency of freezes increases the further one moves outward from the urban heat island. Frequently, outlying areas of Phoenix see frost. Officially, the earliest freeze on record occurred on November 4, 1956, and the latest occurred on March 31, 1987.[a] The all-time lowest recorded temperature in Phoenix was 16 °F (−9 °C) on January 7, 1913, while the coldest daily maximum was 36 °F (2 °C) on December 10, 1898. The longest continuous stretch without a day of frost in Phoenix was over 5 years, from November 23, 1979, to January 31, 1985.[73][74] Snow is a very rare occurrence for the city of Phoenix. Snowfall was first officially recorded in 1898, and since then, accumulations of 0.1 inches (0.25 cm) or greater have occurred only eight times. The heaviest snowstorm on record dates to January 21–22, 1937, when 1 to 4 inches (2.5 to 10.2 cm) fell in parts of the city and did not melt entirely for three days. Before that, 1 inch (2.5 cm) had fallen on January 20, 1933. On February 2, 1939, 0.5 inches (1.3 cm) fell. Snow also fell on March 12, 1917 and on November 28, 1919. The most recent snow of significance fell on December 6, 1998, across the northwest portions of the valley that are below 2,000 feet. During the 1998 event, Sky Harbor reported a dusting of snow. The last measurable snowfall was recorded when 0.1 inches (0.25 cm) fell in central Phoenix on December 11, 1985.[75] On December 30, 2010 and February 20, 2013, graupel fell, although it was widely believed to be snow.[76][77]",
			"color": "dim|0.4018 gray|0.4018 dim|0.4018 grey|0.4018 gray|0.29649 grey|0.29649 black|0.21603 dark|0.056535 gray|0.056535 dark|0.056535 grey|0.056535 silver|0.012556 light|0.00683 gray|0.00683 light|0.00683 grey|0.00683  "
		}
	}
}
