{
	"add": {
		"doc": {
			"id": "20c8d6a247f0459cb880d3c2eee820d100d068a2f25769509f55402ab9101fa3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/NSFK_Wimpel_F%C3%B6rdernde_Mitglieder.svg/200px-NSFK_Wimpel_F%C3%B6rdernde_Mitglieder.svg.png",
				"previous": "After the defeat of Germany, the service was dissolved on 8 May 1920 under the conditions of the Treaty of Versailles, which also mandated the destruction of all military aircraft of Germany.",
				"after": "Since the Treaty of Versailles forbade Germany to have an air force, German pilots trained in violation of the treaty in secret. Initially, civil aviation schools within Germany were used, yet only light trainers could be used in order to maintain the façade that the trainees were going to fly with civil airlines such as Deutsche Luft Hansa. To train its pilots on the latest combat aircraft, Germany solicited the help of its future enemy, the Soviet Union, which was also isolated in Europe. A secret training airfield was established at Lipetsk in 1924 and operated for approximately nine years using mostly Dutch and Russian, but also some German, training aircraft before being closed in 1933. This base was officially known as 4th squadron of the 40th wing of the Red Army. Hundreds of Luftwaffe pilots and technical personnel visited, studied and were trained at Soviet air force schools in several locations in Central Russia.[5] Roessing, Blume, Fosse, Teetsemann, Heini, Makratzki, Blumendaat and many other future Luftwaffe aces were trained in Russia in joint Russian-German schools that were set up under the patronage of Ernst-August Köstring.",
			"color": "midnight|0.71142 blue|0.71142 dark|0.051168 gray|0.051168 dark|0.051168 grey|0.051168 gray|0.047966 grey|0.047966 dim|0.033736 gray|0.033736 dim|0.033736 grey|0.033736 silver|0.024438 black|0.017793 dark|0.017309 slate|0.017309 blue|0.017309 light|0.013569 gray|0.013569 light|0.013569 grey|0.013569 gainsboro|0.0098173 white|0.0077049 smoke|0.0077049 sea|0.006622 shell|0.006622 snow|0.0065905 ghost|0.0065093 white|0.0065093 alice|0.0064547 blue|0.0064547 white|0.0063139 mint|0.0058473 cream|0.0058473 floral|0.0057723 white|0.0057723 lavender|0.0052933 blush|0.0052933 azure|0.005203 slate|0.0042996 gray|0.0042996 light|0.0028106 slate|0.0028106 gray|0.0028106  "
		}
	}
}
