{
	"add": {
		"doc": {
			"id": "20cd95a0367837fc3166912b9e7dd6e684ec73f6215b24607a5fe71b8573efcb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Iberia_Caravelle_Fitzgerald.jpg/220px-Iberia_Caravelle_Fitzgerald.jpg",
				"previous": "Iberia, Compañía Aérea de Transportes was incorporated on 28 June 1927 with a capital investment by the financier Horacio Echevarrieta and Deutsche Luft Hansa of 1.1 million pesetas. Flight operations started on 14 December 1927. Within a year, the company was sponsored by the Spanish government to provide postal transport between Madrid and Barcelona. During the dictatorship of Miguel Primo de Rivera, the aviation companies in Spain were combined and became state-controlled as a general interest public utility, coming into effect in early 1928. As a consequence, Iberia was merged into Compañía de Líneas Aéreas Subvencionadas S.A. (C.L.A.S.S.A.) and ceased activities on 29 May 1929. The name \"Iberia\" continued to be registered by Director-General Daniel de Araoz y Aréjula. As the name \"Iberia\" was still registered, it was used when operations began in nationalist-held territory towards the end of the Spanish Civil War. Following the Civil War, Iberia became a purely domestic airline.",
				"after": "The airline was nationalised on 30 September 1944 and became part of INI. In 1946, Iberia was the first airline to fly between Europe and South America after WWII, using a Douglas DC-4 to operate flights between Madrid and Buenos Aires.[3] By the Pact of Madrid in 1953, visa requirements were eliminated for US visitors to Spain. This stimulated the start of transatlantic flights between Spain and United States the following year. In addition, the amendments made in Montreal to the Convention on International Civil Aviation on 14 June 1954 were liberal to Spain, allowing mass tourism using charter planes.",
			"color": "dim|0.29201 gray|0.29201 dim|0.29201 grey|0.29201 gray|0.26363 grey|0.26363 black|0.082261 slate|0.06572 gray|0.06572 dark|0.064243 gray|0.064243 dark|0.064243 grey|0.064243 silver|0.027473 light|0.021852 gray|0.021852 light|0.021852 grey|0.021852 dark|0.020161 slate|0.020161 gray|0.020161 gainsboro|0.01982 light|0.016182 slate|0.016182 gray|0.016182 white|0.013344 smoke|0.013344 sea|0.010802 shell|0.010802 snow|0.010315 linen|0.0096139 white|0.0087877 floral|0.0087076 white|0.0087076 mint|0.0085433 cream|0.0085433 ghost|0.0083839 white|0.0083839 alice|0.007756 blue|0.007756 lavender|0.0063926 blush|0.0063926 azure|0.0058544 rosy|0.0043527 brown|0.0043527 old|0.0040336 lace|0.0040336  "
		}
	}
}
