{
	"add": {
		"doc": {
			"id": "20e4b8a3291d7c1fac84ed441daa9d0d6f765f8d20ec75b57173d4764a57d1ff",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Quagga_in_enclosure.jpg/220px-Quagga_in_enclosure.jpg",
				"previous": "Historically, quagga taxonomy was further complicated by the fact that the extinct southernmost population of Burchell's zebra (Equus quagga burchellii, formerly Equus burchellii burchellii) was thought to be a distinct subspecies (also sometimes thought a full species, E. burchellii). The extant northern population, the \"Damara zebra\", was later named Equus quagga antiquorum, which means that it is today also referred to as E. q. burchellii, after it was realised they were the same taxon. The extinct population was long thought very close to the quagga, since it also showed limited striping on its hind parts.[8] As an example of this, Shortridge placed the two in the now disused subgenus Quagga in 1934.[11] Most experts now suggest that the two subspecies represent two ends of a cline.[12]",
				"after": "Different subspecies of plains zebra were recognised as members of Equus quagga by early researchers, though there was much confusion over which species were valid.[13] Quagga subspecies were described on the basis of differences in striping patterns, but these differences were since attributed to individual variation within the same populations.[14] Some subspecies and even species, such as E. q. danielli and Hippotigris isabellinus, were only based on illustrations (iconotypes) of aberrant quagga specimens.[15][16] Some authors have described the quagga as a kind of wild horse rather than a zebra, and one craniometric study from 1980 seemed to confirm its affiliation with the horse (Equus caballus).[12] It has been pointed out that early morphological studies were erroneous; using skeletons from stuffed specimens can be problematical, as early taxidermists sometimes used donkey and horse skulls inside their mounts when the originals were unavailable.[17]",
			"color": " "
		}
	}
}
