{
	"add": {
		"doc": {
			"id": "20ea3033c1b872c4425b92dae4e57f5c39c70287648de867719cf7f981fd3487",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Narcissus-Caravaggio_%281594-96%29_edited.jpg/220px-Narcissus-Caravaggio_%281594-96%29_edited.jpg",
				"previous": "The large scale reproduction of a comic strip frame was considered radical and revolutionary at the time.[26] Critics applauded the work's playfulness, inherent humor and irreverence. According to Diane Waldman of the Solomon R. Guggenheim Museum, \"Look Mickey is broad comedy and falls into the category of slapstick ...\"[27] In Lichtenstein's obituary, Los Angeles Times critic Christopher Knight described the work as \"a slyly hilarious riff on Abstract Expressionism\".[18] Lichtenstein's slight alterations to its \"linear clarity and colour\", the critic writes, add to its aesthetic value and grandeur, reinforced by his choice of scale.[28] A common misconception about Lichtenstein comes from the fact that in his best known works, his meticulous approach to painting is purposely disguised because he superficially seeks his paintings to appear as if facsimiles of industrial produced pop culture icons.[22] Graham Bader wrote that \"Lichtenstein's painting in fact appears more the product of industrial manufacture than the very pulp image on which it is based.\"[29] Look Mickey is considered self-referential in the sense that the artist is painting something through which the viewer may see elements of the artist.[30]",
				"after": "Bader observes that Look Mickey is concerned both with the artistic process and Lichtenstein's new painting techniques. He believes it can be considered a self-portrait in the sense that it \"explicitly situates the painting's maker himself within the self-enclosed narcissistic circuit at its center\". The painting shows Donald looking into the reflective water at Lichtenstein's blue 'rfl' signature \"as a kind of surrogate for the image's creator\", in a manner that is reminiscent of Caravaggio's Narcissus, in which the subject gazes at his own reflection on the water.[30] This is viewed as an allegory of Lichtenstein's position as an artist trained to develop his realist instincts despite the prominence of abstract expressionism. When viewed this way, Mickey serves as the \"vanguard modernist\" superego towering over Lichtenstein and laughing at his retrograde efforts.[25]",
			"color": "black|0.90509 burly|0.027706 wood|0.027706 tan|0.017603 wheat|0.0090955 navajo|0.0079361 white|0.0079361 moccasin|0.0065605 pale|0.0044321 golden|0.0044321 rod|0.0044321  "
		}
	}
}
