{
	"add": {
		"doc": {
			"id": "20f6abc3b6f7154da3f728a4a8bd0743af86e33ea3949155e2a9cd27642bcd70",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Nycticebus_coucang_003.jpg/170px-Nycticebus_coucang_003.jpg",
				"previous": "According to folklore, brachial gland secretions are generally thought to contain venom because of apparent anaphylactic reactions by humans following their bites.[101] Slow lorises can indeed inflict painful bites. Animal dealers in Southeast Asia keep tanks of water nearby so that in case of a bite, they can submerge both their arm and the slow loris to make the animal let go.[99] The secretion from the brachial gland is similar to the allergen in cat dander, hence it seems most plausible that the secretions merely elicit an allergic reaction, not toxicosis.[102] Loris bites cause a painful swelling, and the single case of human death reported in the scientific literature was believed to have resulted from anaphylactic shock.[103] However, although the toxin is only produced when the brachial secretion and saliva are mixed, both the secretion and saliva may have unique chemical properties and may act separately. Furthermore, secondary toxins may be introduced from the consumption of wild food, augmenting the toxicity. The combined brachial secretion and saliva of recently captured wild lorises was shown to contain batrachotoxins, which were not found in slow lorises held in captivity for more than a year.[104]",
				"after": "Studies suggest that slow lorises are polygynandrous.[105] Infants are either parked on branches while their parents find food or else are carried by one of the parents.[90] Due to their long gestations (about six months), small litter sizes, low birth weights, long weaning times (three to six months),[106] and long gaps between births, slow loris populations have one of the slowest growth rates among mammals of similar size.[107] Pygmy slow lorises are likely to give birth to twins—from 50% to 100% of births, depending on the study; in contrast, this phenomenon is rare (3% occurrence) in Bengal slow lorises. A seven-year study of captive-bred pygmy slow lorises showed a skewed sex distribution, with 1.68 males born for every 1 female.[49]",
			"color": "black|0.75403 tan|0.051587 burly|0.034388 wood|0.034388 dim|0.027254 gray|0.027254 dim|0.027254 grey|0.027254 gray|0.018964 grey|0.018964 dark|0.013202 gray|0.013202 dark|0.013202 grey|0.013202 peach|0.0099263 puff|0.0099263 silver|0.00839 light|0.0067152 gray|0.0067152 light|0.0067152 grey|0.0067152 navajo|0.0051166 white|0.0051166 bisque|0.0047447 antique|0.0047193 white|0.0047193  "
		}
	}
}
