{
	"add": {
		"doc": {
			"id": "20f679a00f49ba443f01b298799fecad95777664ad6a15aec2b1412dbb96a694",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Man_of_Mark.png/170px-Man_of_Mark.png",
				"previous": "McKinley made himself available to the public every day except Sunday, receiving delegations from the front porch of his home. The railroads subsidized the visitors with low excursion rates—the pro-silver Cleveland Plain Dealer disgustedly stated that going to Canton had been made “cheaper than staying at home”.[100][101] Delegations marched through the streets from the railroad station to McKinley’s home on North Market Street. Once there, they crowded close to the front porch—from which they surreptitiously whittled souvenirs—as their spokesman addressed McKinley. The candidate then responded, speaking on campaign issues in a speech molded to suit the interest of the delegation. The speeches were carefully scripted to avoid extemporaneous remarks; even the spokesman’s remarks were approved by McKinley or a representative. This was done as the candidate feared an offhand comment by another that might rebound on him.[100][102][103]",
				"after": "Most Democratic newspapers refused to support Bryan, the major exception being the New York Journal, controlled by William Randolph Hearst, whose fortune was based on silver mines. In biased reporting and through the sharp cartoons of Homer Davenport, Hanna was viciously characterized as a plutocrat, trampling on labor. McKinley was drawn as a child, easily controlled by big business.[104] Even today, these depictions still color the images of Hanna and McKinley: one as a heartless businessman, the other as a creature of Hanna and others of his ilk.[105]",
			"color": "gray|0.19844 grey|0.19844 dim|0.19571 gray|0.19571 dim|0.19571 grey|0.19571 dark|0.17101 gray|0.17101 dark|0.17101 grey|0.17101 silver|0.1327 light|0.11977 gray|0.11977 light|0.11977 grey|0.11977 gainsboro|0.10441 white|0.020225 smoke|0.020225 black|0.016405 alice|0.0088987 blue|0.0088987 ghost|0.0073091 white|0.0073091 lavender|0.0066532 blush|0.0066532 snow|0.004754 sea|0.0038363 shell|0.0038363 linen|0.0033794 white|0.0029852  "
		}
	}
}
