{
	"add": {
		"doc": {
			"id": "20ff8cbeece5469cb7b97f092965e349a1d1c9e1c83af455442d85d10dd8a6e1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Big_Plunketts_Creek_Winter_Panorama_crop.jpg/220px-Big_Plunketts_Creek_Winter_Panorama_crop.jpg",
				"previous": "Second growth forests have since covered most of the clear-cut land. The beginnings of today's protected areas were established in the late nineteenth and early twentieth centuries: Pennsylvania's state legislature authorized the acquisition of abandoned clear-cut land in 1897, creating the state forest system.[52] The Game Commission began acquiring property for State Game Lands in 1920,[41] and established the Northcentral State Game Farm on Plunketts Creek in 1945 to raise wild turkey. It was converted to ringneck pheasant production in 1981, and, as of 2007, it is one of four Pennsylvania state game farms producing about 200,000 pheasants each year for release on land open to public hunting.[53] The Northcentral State Game Farm is in the Plunketts Creek valley just south of Proctor, and a part of it is on the right bank of Loyalsock Creek downstream of the confluence. The Loyalsock State Game Farm is 13 miles (21 km) downstream on Loyalsock Creek, at the village of Loyalsockville. When a May 2007 fire destroyed a brooder house there just days before 18,000 pheasant chicks were due to hatch, the eggs were transferred to the nearby Northcentral State Game Farm without reduction in the production goal.[54]",
				"after": "As of 2007, Proctor has two separate businesses: a general store (which also sells gasoline) and a bed and breakfast.[55] The church which used to host the annual \"Proctor Homecoming\" reunions still stands, but is closed. Barbours has no store or gas station, but does have one church.[22] Barbours is home to the Plunketts Creek Township Volunteer Fire Company and township municipal building (which houses a small branch library).[11] Since 1967, Barbours has been home to Pneu-Dart, which makes tranquilizer darts and guns for livestock and wildlife capture and control. In 1997, Pneu-Dart had eight employees.[22][56] Today much of Plunketts Creek's watershed is wooded and protected as part of Loyalsock State Forest or Pennsylvania State Game Lands No. 134.[42] Pennsylvania's state forests and game lands are managed, and small-scale lumbering operations continue in the watershed today.[57] Barbours has one sawmill, in 1997 it had thirty contract loggers and fifteen employees, with $1.2 million in annual gross sales.[22]",
			"color": "dim|0.22899 gray|0.22899 dim|0.22899 grey|0.22899 gray|0.17966 grey|0.17966 dark|0.135 gray|0.135 dark|0.135 grey|0.135 silver|0.075905 light|0.051314 gray|0.051314 light|0.051314 grey|0.051314 slate|0.050187 gray|0.050187 light|0.042774 slate|0.042774 gray|0.042774 gainsboro|0.040092 light|0.027499 steel|0.027499 blue|0.027499 white|0.01792 smoke|0.01792 lavender|0.017862 ghost|0.014361 white|0.014361 snow|0.013211 sea|0.012905 shell|0.012905 alice|0.012682 blue|0.012682 lavender|0.012607 blush|0.012607 linen|0.011376 white|0.010875 floral|0.0095131 white|0.0095131 mint|0.0083107 cream|0.0083107 black|0.0060936 azure|0.0058971  "
		}
	}
}
