{
	"add": {
		"doc": {
			"id": "211bc98fed1cfee69db1b0f92b4917db3a2a0fb3fda270e9b4d8a127e61fbad2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Mammuthus.jpg/220px-Mammuthus.jpg",
			"previous": [],
				"after": "The appearance of the woolly mammoth is probably the best known of any prehistoric animal due to the many frozen specimens with preserved soft tissue and depictions by contemporary humans in their art. Fully grown males reached shoulder heights between 2.7 and 3.4 m (9 and 11 ft) and weighed up to 6 tonnes (6.6 short tons). This is almost as large as extant male African elephants, which commonly reach 3–3.4 m (9.8–11.2 ft), and is less than the size of the earlier mammoth species M. meridionalis and M. trogontherii, and the contemporary M. columbi. The reason for the smaller size is unknown. Female woolly mammoths averaged 2.6–2.9 m (8.5–9.5 ft) in height and were built more lightly than males, weighing up to 4 tonnes (4.4 short tons). A newborn calf would have weighed about 90 kg (200 lb). These sizes are deduced from comparison with modern elephants of similar size.[29] Few frozen specimens have preserved genitals, so the gender is usually determined through examination of the skeleton. The best indication of sex is the size of the pelvic girdle, as the birth canal is always wider in females than in males.[30] Though the mammoths on Wrangel Island were smaller than those of the mainland, their size varied, and they were not small enough to be considered \"dwarves\".[31] It has been claimed that the last woolly mammoth populations decreased in size and increased their sexual dimorphism, but this was dismissed in a 2012 study.[32]",
			"color": "red|0.21166 black|0.14729 blue|0.063761 medium|0.045108 blue|0.045108 aqua|0.044498 cyan|0.044498 gray|0.039289 grey|0.039289 dark|0.037935 gray|0.037935 dark|0.037935 grey|0.037935 yellow|0.03722 dim|0.03395 gray|0.03395 dim|0.03395 grey|0.03395 silver|0.022269 white|0.015436 smoke|0.015436 light|0.015321 gray|0.015321 light|0.015321 grey|0.015321 alice|0.013986 blue|0.013986 ghost|0.01392 white|0.01392 sea|0.013787 shell|0.013787 snow|0.013781 white|0.013371 mint|0.01291 cream|0.01291 lavender|0.012817 blush|0.012817 gainsboro|0.012454 floral|0.01212 white|0.01212 azure|0.011651 crimson|0.011072 firebrick|0.01027 dark|0.0085648 blue|0.0085648 turquoise|0.008137 navy|0.0071188 brown|0.0053134 dark|0.0052221 turquoise|0.0052221 medium|0.0039729 turquoise|0.0039729 indigo|0.003722  "
		}
	}
}
