{
	"add": {
		"doc": {
			"id": "2120998326348129e0c2fdadbcc7546504dd2583b7437a9c3add96a316cd6f3c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Chris_Colfer--Comic_Con_2010_cropped.jpg/150px-Chris_Colfer--Comic_Con_2010_cropped.jpg",
				"previous": "One of Colfer's major influences is Whoopi Goldberg. He said, \"When I was little, my favorite movie I used to watch was Sister Act, and my mother stated that I would place towels on my head and sing with Whoopi and the nuns.\" Colfer stated on his Twitter account that actor Robin Williams was his \"hero\" growing up before Williams committed suicide, and said, \"You know someone is special when the whole world considers them family.\" Colfer stated that Kristin Chenoweth was another major influence on him, claiming in one interview with Jay Leno that he was nervous sitting next to her, and that Kristin was his very first celebrity crush. Colfer stated that Glee‍‍ '​‍s producer Ryan Murphy also became a huge influence on him, with him stating he would often get himself into trouble with his mother when he was caught watching Nip/Tuck, and that Murphy was the first person in Hollywood to ever let him work, despite him being horrible at auditions, describing Murphy as his \"fairy godfather\" in his 2011 Golden Globes speech. He also stated that Elton John influenced him to respond to hateful, anti-gay people with love, kindness and respect rather than anger and resentment. Colfer said two of his favorite artists are Betty Who and Melissa Etheridge on his Twitter.",
			"after": [],
			"color": "black|0.34659 misty|0.095284 rose|0.095284 rosy|0.051778 brown|0.051778 antique|0.037099 white|0.037099 peach|0.035974 puff|0.035974 linen|0.035524 sea|0.029182 shell|0.029182 old|0.026043 lace|0.026043 pink|0.025196 floral|0.022119 white|0.022119 dark|0.020012 salmon|0.020012 light|0.020012 pink|0.020012 bisque|0.018455 papaya|0.017717 whip|0.017717 lavender|0.017215 blush|0.017215 light|0.016586 steel|0.016586 blue|0.016586 snow|0.016317 white|0.01548 smoke|0.01548 ivory|0.014132 blanched|0.014068 almond|0.014068 white|0.011545 mint|0.0089819 cream|0.0089819 beige|0.0080091 corn|0.0079409 silk|0.0079409 light|0.0071429 coral|0.0071429 dark|0.0066104 gray|0.0066104 dark|0.0066104 grey|0.0066104 ghost|0.0057579 white|0.0057579 indian|0.0052441 red|0.0052441  "
		}
	}
}
