{
	"add": {
		"doc": {
			"id": "21244ed82ee556b113a36488b369bb5de47f67dde4090ec03ca43c67bc153c32",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a6/Hobbs_signing_autographs.jpg/250px-Hobbs_signing_autographs.jpg",
				"previous": "Hobbs was particularly successful in 1925. Early in the season a string of centuries, including a run of four in consecutive innings, made him the first batman to reach 1,000 runs that season and brought him close to Grace's record of 126 first-class hundreds.[208] He scored the 125th century of his career against Kent on 20 July,[209] but amid intense press and public interest, Hobbs lost form through a combination of anxiety and fatigue. He continued to score well, but could not reach three figures in an innings—after one innings of 54, a newspaper headline proclaimed that \"Hobbs Fails Again\".[210] It was not until 15 August, against Somerset, that Hobbs scored 101 to reached the landmark, an achievement praised and feted throughout the country over the following weeks. On the final day of the match, Hobbs scored another century to become the outright record holder.[211] He ended his season with an innings of 266 in a Gentlemen v Players match at the Scarborough Festival, his highest to date and the best score made in the Gentlemen v Players series, and 104 for the Rest of England against Yorkshire, the County Champions.[212] In total, he scored 16 centuries—setting a record for most centuries in a season[213]—and totalled 3,024 runs at an average of 70.32 to top the national averages for the first time.[37][212] Following his successful season, Hobbs was in great demand. He attended several functions in his honour but rejected offers to appear on stage, in film and to stand as a Liberal parliamentary candidate.[214]",
				"after": "Hobbs was given a third benefit by Surrey in 1926 which raised £2,670.[215] Further recognition came when he and Rhodes joined the England selection committee for the Ashes series to be played that summer; for professional cricketers to serve as England selectors was unprecedented.[215] Hobbs began the season well,[216] and after the first Test, which was badly affected by rain, he remained in form by scoring 261 against Oxford University, sharing an opening partnership of 428 with Sandham; this remained a Surrey first wicket record as of 2014.[217][218] In the drawn second Test, he and Sutcliffe shared an opening stand of 182. Hobbs scored 119 but was criticised for slowing down later in his innings, leading to accusations that he was more concerned with reaching three figures than batting for the team.[219] The third Test was also drawn. England followed on in the face of a large Australian total, but Hobbs and Sutcliffe opened the second innings with a partnership of 156 and Hobbs scored 88 as the game was saved.[220] During the fourth Test, he temporarily assumed the captaincy when Arthur Carr withdrew from the match owing to illness; Hobbs became the first professional to captain England at home. The selectors and players on both teams believed Hobbs performed well tactically. He scored 74 in England's innings, but heavy rain ensured a fourth successive draw.[221]",
			"color": " "
		}
	}
}
