{
	"add": {
		"doc": {
			"id": "212d4b0f6202e11c6362207bb8612c3943f7b04a1939dfdc195bf7479dc9bf0b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/North_America_satellite_orthographic.jpg/150px-North_America_satellite_orthographic.jpg",
				"previous": "North America is a continent in the Earth's northern hemisphere and western hemisphere. It is bordered on the north by the Arctic Ocean, on the east by the North Atlantic Ocean, on the southeast by the Caribbean Sea, and on the south and west by the North Pacific Ocean; South America lies to the southeast. It covers an area of about 24,709,000 square kilometers (9,540,000 square miles), about 4.8% of the planet's surface or about 16.5% of its land area. As of July 2008, its population was estimated at nearly 529 million people. It is the third-largest continent in area, following Asia and Africa, and the fourth in population after Asia, Africa, and Europe. North America and South America are collectively known as the Americas or simply America.",
				"after": "North and South America are generally accepted as having been named after the Italian explorer Amerigo Vespucci, who explored South America between 1497 and 1502, and was the first European to suggest that the Americas were not the East Indies. Scientists have several theories as to the origins of the early human population of North America. The indigenous peoples of North America themselves have many creation myths, by which they assert that they have been present on the land since its creation. Before contact with Europeans, the natives of North America were divided into many different polities, from small bands of a few families to large empires. They lived in several \"culture areas\", which roughly correspond to geographic and biological zones and give a good indication of the main lifeway or occupation of the people who lived there.",
			"color": "dark|0.3335 olive|0.3335 green|0.3335 black|0.11955 tan|0.046445 dim|0.045892 gray|0.045892 dim|0.045892 grey|0.045892 dark|0.034291 gray|0.034291 dark|0.034291 grey|0.034291 gray|0.030785 grey|0.030785 white|0.029469 smoke|0.029469 snow|0.027893 white|0.027577 mint|0.027211 cream|0.027211 sea|0.026699 shell|0.026699 azure|0.026694 ghost|0.026635 white|0.026635 floral|0.025891 white|0.025891 alice|0.024999 blue|0.024999 silver|0.02068 light|0.01572 gray|0.01572 light|0.01572 grey|0.01572 lavender|0.015562 blush|0.015562  "
		}
	}
}
