{
	"add": {
		"doc": {
			"id": "212fa27efe2e58e2e427888a6178570ded73e793971ac13a450db7569cd2c8ab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Michigan_Stadium_2011.jpg/220px-Michigan_Stadium_2011.jpg",
				"previous": "Ann Arbor has a long history of openness to marijuana, given Ann Arbor's decriminalization of cannabis, the large number of medical marijuana dispensaries in the city (one dispensary, called People's Co-op, was directly across the street from Michigan Stadium until zoning forced it to move one mile to the west), the large number of pro-marijuana residents, and the annual Hash Bash: an event that is held on the first Saturday of April. Until (at least) the successful passage of Michigan's medical marijuana law, the event had arguably strayed from its initial intent, although for years, a number of attendees have received serious legal responses due to marijuana use on University of Michigan property, which does not fall under the City's progressive and compassionate ticketing program.[84]",
				"after": "Ann Arbor is a major scene of college sports, most notably at the University of Michigan, a member of the Big Ten Conference. Several well-known college sports facilities exist in the city, including Michigan Stadium, the largest American football stadium in the world[85] with a 109,901 seating capacity. The stadium is colloquially known as \"The Big House\".[86] Crisler Center and Yost Ice Arena play host to the school's basketball (both men's and women's) and ice hockey teams, respectively.[87] Concordia University, a member of the NAIA, also fields sports teams.[88]",
			"color": "black|0.28254 dim|0.064087 gray|0.064087 dim|0.064087 grey|0.064087 gray|0.061748 grey|0.061748 tan|0.058086 dark|0.045083 gray|0.045083 dark|0.045083 grey|0.045083 rosy|0.036681 brown|0.036681 dark|0.033096 khaki|0.033096 gold|0.025397 silver|0.024677 yellow|0.018416 light|0.017166 gray|0.017166 light|0.017166 grey|0.017166 burly|0.016881 wood|0.016881 slate|0.016689 gray|0.016689 olive|0.015623 drab|0.015623 light|0.014048 slate|0.014048 gray|0.014048 gainsboro|0.014014 dark|0.012114 slate|0.012114 blue|0.012114 lavender|0.011675 light|0.011485 steel|0.011485 blue|0.011485 midnight|0.010982 blue|0.010982 thistle|0.010956  "
		}
	}
}
