{
	"add": {
		"doc": {
			"id": "2132fd89914cf838158c01533586dbb18be6f6f6d281d544e2efbf634e0239cc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Kruja_Skanderbeg_Museum_DSC01309.jpg/220px-Kruja_Skanderbeg_Museum_DSC01309.jpg",
				"previous": "Meanwhile, the position of Venice toward Skanderbeg had changed perceptibly because the Republic had entered into their own Ottoman–Venetian War (1463–1479). During this period the Republic saw Skanderbeg as an invaluable ally, and on 20 August 1463, the peace treaty of 1448 was renewed and this time other conditions were added: the right of asylum in Venice, an article stipulating that any Venetian treaty with the Ottomans would include a guarantee of Albanian independence, and allowing the presence of several Venetian ships in the Adriatic waters around Lezhë.[111]",
				"after": "In November 1463, Pope Pius II tried to organize a new crusade against the Ottomans, similar to what Pope Nicholas V and Pope Calixtus III had tried to do before him. Pius II invited all the Christian nobility to join, and the Venetians immediately answered the appeal.[112] So did Skanderbeg, who on 27 November 1463, declared war on the Ottomans and attacked their forces near Ohrid. Pius II's planned crusade envisioned assembling 20,000 soldiers in Taranto, while another 20,000 would be gathered by Skanderbeg. They would have been marshalled in Durazzo under Skanderbeg's leadership and would have formed the central front against the Ottomans. However, Pius II died in August 1464, at the crucial moment when the crusading armies were gathering and preparing to march in Ancona, and Skanderbeg was again left alone facing the Ottomans.[112]",
			"color": "dim|0.35739 gray|0.35739 dim|0.35739 grey|0.35739 gray|0.22694 grey|0.22694 dark|0.18227 gray|0.18227 dark|0.18227 grey|0.18227 silver|0.084992 light|0.04117 gray|0.04117 light|0.04117 grey|0.04117 gainsboro|0.027395 black|0.024256 linen|0.0096992 antique|0.0063643 white|0.0063643 misty|0.0058645 rose|0.0058645 sea|0.0053906 shell|0.0053906 old|0.004687 lace|0.004687 white|0.004391 smoke|0.004391  "
		}
	}
}
