{
	"add": {
		"doc": {
			"id": "21346f77022797186d445dca778e6acdec15f5d07039f179caf6b5aecc1ba9e8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Washington_State_Ferry_Tacoma.jpg/220px-Washington_State_Ferry_Tacoma.jpg",
				"previous": "Washington ranks second in the United States in the production of wine, behind only California.[77] By 2006, the state had over 31,000 acres (130 km2) of vineyards, a harvest of 120,000 short tons (109,000 t) of grapes, and exports going to over 40 countries around the world from the 600 wineries located in the state. While there are some viticultural activities in the cooler, wetter western half of the state, the majority (99%) of wine grape production takes place in the desert-like eastern half.[78] The rain shadow of the Cascade Range leaves the Columbia River Basin with around 8 inches (200 mm) of annual rain fall, making irrigation and water rights of paramount interest to the Washington wine industry. Viticulture in the state is also influenced by long sunlight hours (on average, two more hours a day than in California during the growing season) and consistent temperatures.[79]",
				"after": "Washington has a system of state highways, called State Routes, as well as an extensive ferry system which is the largest in the nation[80] and the third largest in the world. There are 140 public airfields in Washington, including 16 state airports owned by the Washington State Department of Transportation. Seattle-Tacoma International Airport (Sea-Tac) is the major commercial airport of greater Seattle.[81] Boeing Field in Seattle is one of the busiest primary non-hub airports in the US.[82] The unique geography of Washington creates exceptional transportation challenges.[citation needed]",
			"color": "dim|0.25671 gray|0.25671 dim|0.25671 grey|0.25671 gray|0.21943 grey|0.21943 silver|0.14988 light|0.14627 gray|0.14627 light|0.14627 grey|0.14627 gainsboro|0.13221 black|0.031755 slate|0.030447 gray|0.030447 dark|0.018236 gray|0.018236 dark|0.018236 grey|0.018236 dark|0.0088302 slate|0.0088302 gray|0.0088302 light|0.0053252 slate|0.0053252 gray|0.0053252  "
		}
	}
}
