{
	"add": {
		"doc": {
			"id": "2160e537d1b97728cf33fef7e8bcd8d8195e53f3d71107f875314c300a0565b1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Segre.jpg/170px-Segre.jpg",
				"previous": "In 1936, a team of Romanian physicist Horia Hulubei and French physicist Yvette Cauchois claimed to have discovered element 85 via X-ray analysis. In 1939 they published another paper which supported and extended previous data. In 1944, Hulubei published a summary of data he had obtained up to that time, claiming it was supported by the work of other researchers. He chose the name \"dor\", presumably from the Romanian for \"longing\" [for peace], as the world had been at war for almost five years by then. As Hulubei was writing in French, a language which does not accommodate the \"ine\" suffix, dor would likely have been rendered in English as \"dorine\", had it been adopted. In 1947, Hulubei's claim was effectively rejected by the Austrian chemist Friedrich Paneth, who would later chair the IUPAC committee responsible for recognition of new elements. Even though Hulubei's samples did contain astatine, his means to detect it were too weak, by current standards, to enable correct identification.[86] Even though Hulubei's samples did contain astatine, his means to detect it were too weak, by current standards, to enable correct identification. He had also been involved in an earlier false claim as to the discovery of element 87 (francium) and this is thought to have caused other researchers to downplay his work.[87]",
				"after": "In 1940, the Swiss chemist Walter Minder announced the discovery of element 85 as the beta decay product of radium A (polonium-218), choosing the name \"helvetium\" (from Helvetia, \"Switzerland\"). Karlik and Bernert were unsuccessful in reproducing his experiments, and subsequently attributed Minder's results to contamination of his radon stream (radon-222 is the parent isotope of polonium-218).[88][h] In 1942, Minder, in collaboration with the English scientist Alice Leigh-Smith, announced the discovery of another isotope of element 85, presumed to be the product of thorium A (polonium-216) beta decay. They named this substance \"anglo-helvetium\",[89] but Karlik and Bernert were again unable to reproduce these results.[54]",
			"color": " "
		}
	}
}
