{
	"add": {
		"doc": {
			"id": "216227e554765a5b81c68e29304c72b8d41dc98c2e436fdd4c59f22d19aa581e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Centre-ville_de_Beyrouth.JPG/220px-Centre-ville_de_Beyrouth.JPG",
				"previous": "The Beirut Central District (BCD) or Centre Ville is the name given to Beirut’s historical and geographical core by \"Solidere\", the \"vibrant financial, commercial, and administrative hub of the country.\"[75] It is an area thousand of years old, traditionally a focus of business, finance, culture and leisure. Its reconstruction constitutes one of the most ambitious contemporary urban developments.[76] Due to the devastation incurred on the city center from the Lebanese Civil War, the Beirut Central District underwent a thorough reconstruction and development plan that gave it back its cultural and economic position in the region. Ever since, Beirut Central District has evolved into an integrated business and commercial environment and the focus of the financial activity in the region. That evolution was accompanied with the relocation of international organizations, reoccupation of civic and government buildings, expansion of financial activities, and establishment of regional headquarters and global firms in the city center.[77]",
				"after": "Assessment of the demand for build-up space in the BCD has been done in reference to a number of macro-economic, demographic, and urban planning considerations at a time of marked need for new activity poles in the city, such as Souks, financial, cultural and recreational centers.[78] The district's total area is 4,690,000 square meters, the majority of which is dedicated to residential space (1,924,000 sq meters).[79] The Beirut Central District contains over 60 gardens, squares and open spaces. These spaces comprise landscaped streets, gardens, historical squares, pedestrian areas and sea promenades thus totaling to an area of 96 acres (39 ha) of open spaces.",
			"color": "black|0.26775 gray|0.16658 grey|0.16658 dim|0.13067 gray|0.13067 dim|0.13067 grey|0.13067 dark|0.092563 gray|0.092563 dark|0.092563 grey|0.092563 silver|0.060598 light|0.052459 gray|0.052459 light|0.052459 grey|0.052459 gainsboro|0.040029 dark|0.039778 olive|0.039778 green|0.039778 antique|0.026597 white|0.026597 linen|0.016487 sea|0.0086567 shell|0.0086567 white|0.008391 smoke|0.008391 misty|0.0071077 rose|0.0071077 old|0.0069517 lace|0.0069517 light|0.0062192 slate|0.0062192 gray|0.0062192 lavender|0.0062127 blush|0.0062127 slate|0.0061805 gray|0.0061805  "
		}
	}
}
