{
	"add": {
		"doc": {
			"id": "21755d8906441139080588fe7a409f7780623ae2d9e2862a407e144afcca7e28",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/%D0%AD%D0%BB%D1%8C%D0%B1%D1%80%D1%83%D1%81_%D1%81_%D0%BF%D0%B5%D1%80%D0%B5%D0%B2%D0%B0%D0%BB%D0%B0_%D0%93%D1%83%D0%BC%D0%B1%D0%B0%D1%88%D0%B8.JPG/220px-%D0%AD%D0%BB%D1%8C%D0%B1%D1%80%D1%83%D1%81_%D1%81_%D0%BF%D0%B5%D1%80%D0%B5%D0%B2%D0%B0%D0%BB%D0%B0_%D0%93%D1%83%D0%BC%D0%B1%D0%B0%D1%88%D0%B8.JPG",
				"previous": "The two widest separated points in Russia are about 8,000 km (4,971 mi) apart along a geodesic line. These points are: the boundary with Poland on a 60 km (37 mi) long Vistula Spit separating the Gdańsk Bay from the Vistula Lagoon; and the farthest southeast of the Kuril Islands. The points which are furthest separated in longitude are 6,600 km (4,101 mi) apart along a geodesic line. These points are: in the west, the same spit; in the east, the Big Diomede Island. The Russian Federation spans 9 time zones.",
				"after": "Most of Russia consists of vast stretches of plains that are predominantly steppe to the south and heavily forested to the north, with tundra along the northern coast. Russia possesses 10% of the world's arable land.[149] Mountain ranges are found along the southern borders, such as the Caucasus (containing Mount Elbrus, which at 5,642 m (18,510 ft) is the highest point in both Russia and Europe) and the Altai (containing Mount Belukha, which at the 4,506 m (14,783 ft) is the highest point of Siberia outside of the Russian Far East); and in the eastern parts, such as the Verkhoyansk Range or the volcanoes of Kamchatka Peninsula (containing Klyuchevskaya Sopka, which at the 4,750 m (15,584 ft) is the highest active volcano in Eurasia as well as the highest point of Asian Russia). The Ural Mountains, rich in mineral resources, form a north-south range that divides Europe and Asia.",
			"color": "steel|0.19576 blue|0.19576 slate|0.1751 gray|0.1751 silver|0.1381 light|0.13315 slate|0.13315 gray|0.13315 dark|0.11387 gray|0.11387 dark|0.11387 grey|0.11387 light|0.077296 gray|0.077296 light|0.077296 grey|0.077296 gainsboro|0.042399 light|0.038118 steel|0.038118 blue|0.038118 dark|0.034491 slate|0.034491 gray|0.034491 black|0.031648  "
		}
	}
}
