{
	"add": {
		"doc": {
			"id": "217a5a3d919c56a13f5483f67c2fdd034d672849de8a0ac55b2e734fd1f02e15",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Chastity_belt_Heyser_0.png/220px-Chastity_belt_Heyser_0.png",
				"previous": "This view persisted well into the Victorian era, where such medical censure of masturbation was in line with the widespread social conservatism and opposition to open sexual behavior common at the time.[95][96] There were recommendations to have boys' pants constructed so that the genitals could not be touched through the pockets, for schoolchildren to be seated at special desks to prevent their crossing their legs in class and for girls to be forbidden from riding horses and bicycles because the sensations these activities produce were considered too similar to masturbation. Boys and young men who nevertheless continued to indulge in the practice were branded as \"weak-minded.\"[97] Many \"remedies\" were devised, including eating a bland, meatless diet. This approach was promoted by Dr. John Harvey Kellogg (inventor of corn flakes) and Rev. Sylvester Graham (inventor of Graham crackers). The medical literature of the times describes procedures for electric shock treatment, infibulation, restraining devices like chastity belts and straitjackets, cauterization or – as a last resort – wholesale surgical excision of the genitals. Routine neonatal circumcision was widely adopted in the United States and the UK at least partly because of its believed preventive effect against masturbation (see also History of male circumcision). In later decades, the more drastic of these measures were increasingly replaced with psychological techniques, such as warnings that masturbation led to blindness, hairy hands or stunted growth. Some of these persist as myths even today.",
				"after": "At the same time, the supposed medical condition of hysteria—from the Greek hystera or uterus—was being treated by what would now be described as medically administered or medically prescribed masturbation for women. Techniques included use of the earliest vibrators and rubbing the genitals with placebo creams.[98]",
			"color": " "
		}
	}
}
