{
	"add": {
		"doc": {
			"id": "2191d39af241c211294f3bc21981e3c17b3fd11c10ad7533211859c5e3a50b49",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Non_rhotic-whites-usa.png/250px-Non_rhotic-whites-usa.png",
				"previous": "Compared with English as spoken in England, North American English[6] is more homogeneous. Some distinctive accents can be found on the East Coast (for example, in eastern New England, New York City, Philadelphia, and Baltimore) partly because these areas were in close contact with England and imitated prestigious varieties of English at a time when these were undergoing changes.[7] In addition, many speech communities on the East Coast have existed in their present locations for centuries, while the interior of the country was settled by people from all regions of the existing United States and developed a far more general linguistic pattern.[citation needed]",
				"after": "Studies on historical usage of English in the United States and the United Kingdom suggest that spoken American English did not simply evolve from period British English, but rather retained many archaic features contemporary British English has since lost.[9] Most North American speech is rhotic, because in the 17th century, when English was brought to the Americas, most English in England was rhotic. Rhoticity has been further supported by the influences of Hiberno-English, West Country English and Scottish English.[10] In most varieties of North American English, the sound corresponding to the letter r is a postalveolar approximant [ɹ̠] or retroflex approximant [ɻ] rather than a trill or a tap (as often heard, for example, in Scotland or India). A unique \"bunched tongue\" variant of the approximant r sound is also associated with the United States, and seems particularly noticeable in the Midwest and South.[11] The loss of syllable-final r in North America, known as non-rhoticity, is confined mostly to the accents of eastern New England, New York City and surrounding areas and the coastal portions of the South, and African American Vernacular English.",
			"color": "white|0.088381 smoke|0.088381 sea|0.085163 shell|0.085163 ghost|0.085065 white|0.085065 alice|0.084957 blue|0.084957 snow|0.084866 lavender|0.08439 blush|0.08439 white|0.083937 mint|0.082583 cream|0.082583 floral|0.081584 white|0.081584 azure|0.080128 light|0.037439 coral|0.037439 light|0.030762 gray|0.030762 light|0.030762 grey|0.030762 gainsboro|0.027364 silver|0.025227 dark|0.0079378 gray|0.0079378 dark|0.0079378 grey|0.0079378 linen|0.0062196 indian|0.0056739 red|0.0056739 light|0.0055684 pink|0.0055684 pink|0.0051466 misty|0.0039753 rose|0.0039753  "
		}
	}
}
