{
	"add": {
		"doc": {
			"id": "2199b1f79d36e84ea6acd4248ce27b3d57721a7b5a1f4a69be2a3c0fe11fc8a5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Space_shuttle_mission_profile.jpg/220px-Space_shuttle_mission_profile.jpg",
				"previous": "System Stack",
				"after": "All Space Shuttle missions were launched from Kennedy Space Center (KSC). The weather criteria used for launch included, but were not limited to: precipitation, temperatures, cloud cover, lightning forecast, wind, and humidity.[66] The Shuttle was not launched under conditions where it could have been struck by lightning. Aircraft are often struck by lightning with no adverse effects because the electricity of the strike is dissipated through its conductive structure and the aircraft is not electrically grounded. Like most jet airliners, the Shuttle was mainly constructed of conductive aluminum, which would normally shield and protect the internal systems. However, upon liftoff the Shuttle sent out a long exhaust plume as it ascended, and this plume could have triggered lightning by providing a current path to ground. The NASA Anvil Rule for a Shuttle launch stated that an anvil cloud could not appear within a distance of 10 nautical miles.[67] The Shuttle Launch Weather Officer monitored conditions until the final decision to scrub a launch was announced. In addition, the weather conditions had to be acceptable at one of the Transatlantic Abort Landing sites (one of several Space Shuttle abort modes) to launch as well as the solid rocket booster recovery area.[66][68] While the Shuttle might have safely endured a lightning strike, a similar strike caused problems on Apollo 12, so for safety NASA chose not to launch the Shuttle if lightning was possible (NPR8715.5).",
			"color": "silver|0.090688 dark|0.083864 gray|0.083864 dark|0.083864 grey|0.083864 light|0.083607 gray|0.083607 light|0.083607 grey|0.083607 light|0.074418 steel|0.074418 blue|0.074418 gainsboro|0.068574 beige|0.033555 white|0.02845 smoke|0.02845 linen|0.027691 floral|0.026305 white|0.026305 lavender|0.026041 old|0.025673 lace|0.025673 sea|0.02449 shell|0.02449 corn|0.022837 silk|0.022837 ivory|0.022231 light|0.022082 golden|0.022082 rod|0.022082 yellow|0.022082 antique|0.021885 white|0.021885 light|0.021162 slate|0.021162 gray|0.021162 light|0.02105 yellow|0.02105 snow|0.019908 mint|0.019164 cream|0.019164 alice|0.018093 blue|0.018093 lemon|0.018042 chiffon|0.018042 white|0.017121 ghost|0.017051 white|0.017051 gray|0.017002 grey|0.017002 honeydew|0.016681 papaya|0.015765 whip|0.015765 lavender|0.012648 blush|0.012648 azure|0.012206 dim|0.010677 gray|0.010677 dim|0.010677 grey|0.010677 slate|0.0099338 gray|0.0099338 blanched|0.008933 almond|0.008933 black|0.0077687 thistle|0.0055188 sienna|0.0050942 pale|0.0046825 golden|0.0046825 rod|0.0046825 misty|0.0039037 rose|0.0039037  "
		}
	}
}
