{
	"add": {
		"doc": {
			"id": "219e84c6539554a56260334affad1873ef8c9a44c893a94b76b53f274d8c0e07",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Ancient_Benin_city.JPG/220px-Ancient_Benin_city.JPG",
				"previous": "At the beginning of the 19th century, Usman dan Fodio directed a successful jihad and created and led the centralised Fulani Empire (also known as the Sokoto Caliphate). The territory controlled by the resultant state included much of modern-day northern and central Nigeria; it lasted until the 1903 break-up of the Empire into various European colonies.",
				"after": "For centuries, various peoples in modern-day Nigeria traded overland with traders from North Africa. Cities in the area became regional centers in a broad network of trade routes that spanned western, central and northern Africa. In the 16th century, Spanish and Portuguese explorers were the first Europeans to begin significant, direct trade with peoples of modern-day Nigeria, at the port they named Lagos and in Calabar. Europeans traded goods with peoples at the coast; coastal trade with Europeans also marked the beginnings of the Atlantic slave trade.[45] The port of Calabar on the historical Bight of Biafra (now commonly referred to as the Bight of Bonny) become one of the largest slave trading posts in West Africa in the era of the transatlantic slave trade. Other major slaving ports in Nigeria were located in Badagry, Lagos on the Bight of Benin and on Bonny Island on the Bight of Biafra.[45][46] The majority of those enslaved and taken to these ports were captured in raids and wars.[47] Usually the captives were taken back to the conquerors' territory as forced labor; after time, they were sometimes acculturated and absorbed into the conquerors' society. A number of slave routes were established throughout Nigeria linking the hinterland areas with the major coastal ports. Some of the more prolific slave traders were linked with the Oyo Empire in the southwest, the Aro Confederacy in the southeast and the Sokoto Caliphate in the north.[45][46]",
			"color": " "
		}
	}
}
