{
	"add": {
		"doc": {
			"id": "21a3eb4ccfa1e5fe6b63b287fca90f164b7d05cc4c1164907c497f228c0cd15f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/RiverEamontAtBroughamCastle%28SimonLedingham%29Jun2004.jpg/300px-RiverEamontAtBroughamCastle%28SimonLedingham%29Jun2004.jpg",
			"previous": [],
				"after": "The site of Brougham Castle has been fortified since the Romans erected the fort of Brocavum at the intersection of three Roman roads. With the rivers Eamont and Lowther flowing nearby and meeting to the west, the site had natural defences and the area was fertile and easy to cultivate. A civilian settlement grew around the fort. When Angles arrived in the area they named the place Brougham, meaning \"the village by the fort\".[2] Between the end of Roman rule in the early 5th century and the Norman Conquest in the late 11th century, Cumbria was a turbulent area. Although the site was a defendable position, there is no evidence that Brougham was refortified during this time. In 1092, William II (also known as William Rufus) captured Cumbria south of the Solway Firth and established a new border far north of Brougham. The site at Brougham remained unfortified. Carlisle Castle secured the border, and castles at Appleby and Brough, both south east of Brougham, protected the line of communication from Carlisle to Yorkshire.[3] In 1203, the barony of Westmorland – containing Appleby, Brough, and Brougham – was granted to Robert de Vieuxpont by King John. A favourite of John's, Vieuxpont was one of only a few lords loyal to him in northern England, whose inhabitants became so discontented with the king's rule that they eventually rebelled. Around 1214, Vieuxpont asserted control over more land, including half the manor of Brougham. It was in this atmosphere of unrest that Brougham Castle was founded.[4]",
			"color": "dark|0.20754 slate|0.20754 gray|0.20754 dark|0.10652 olive|0.10652 green|0.10652 gray|0.10016 grey|0.10016 dark|0.081016 gray|0.081016 dark|0.081016 grey|0.081016 dim|0.069441 gray|0.069441 dim|0.069441 grey|0.069441 silver|0.049976 slate|0.038754 gray|0.038754 dark|0.03652 sea|0.03652 green|0.03652 light|0.024467 slate|0.024467 gray|0.024467 antique|0.022432 white|0.022432 light|0.022144 gray|0.022144 light|0.022144 grey|0.022144  "
		}
	}
}
