{
	"add": {
		"doc": {
			"id": "21b304447ecbbede000e1588b4dbb10306f69a1ff42fec9b87949292900acd1a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Stanford_Memorial_Church_dedication_inscription.JPG/220px-Stanford_Memorial_Church_dedication_inscription.JPG",
				"previous": "Repairs of the earthquake damage began immediately. The church and the Old Chemistry were the only two buildings in the Inner Quad that were repaired.[23] The extent of the damage was such that the church had to be completely rebuilt. It was dismantled stone by stone, which, along with the windows, were labelled and stored.[21] \"To assure permanence\" in case of further earthquakes, the masonry was anchored to concrete-reinforced walls.[18] The building's crossing received a tiled hipped roof and an oculus, which lit the interior of the church, and was added above the renovated dome. The original dome had been decorated with \"a frescoed Victorian interpretation of God's eye—complete with tear—surrounded by cherubs and shooting star\".[24] The new dome had a frescoed ceiling decorated with bronze designs as opposed to the gold leaf present before the earthquake.[25] A further structural alteration was that the irregular rose window of the facade was replaced by a more regular round-arched window like the smaller ones flanking it.[20]",
				"after": "The dedication, which was engraved in large letters below the facade mosaic, was replaced by a smaller dedication plaque placed at the lower left of the facade.[26] The mosaics were restored by Camerino, who did not appraise the damage until 1913. He had saved the original drawings in Venice, so he removed and re-fabricated the chancel mosaic, and redesigned the entire exterior mosaic.[8] Camerino also donated mosaics to fill the spaces left by the removal of the dedication. The tile floor was replaced with cork. The Stanford alumni magazine, in early 1917, declared the renovation complete, stating that \"the church, for almost the first time since it was begun, is finished\".[26]",
			"color": "silver|0.26643 dark|0.2272 gray|0.2272 dark|0.2272 grey|0.2272 light|0.21144 gray|0.21144 light|0.21144 grey|0.21144 gainsboro|0.14389 gray|0.032068 grey|0.032068 light|0.027723 steel|0.027723 blue|0.027723 linen|0.025951 antique|0.01417 white|0.01417 sea|0.0068639 shell|0.0068639 old|0.0067828 lace|0.0067828 white|0.0060486 smoke|0.0060486 light|0.0047849 slate|0.0047849 gray|0.0047849 dim|0.0045599 gray|0.0045599 dim|0.0045599 grey|0.0045599 misty|0.004392 rose|0.004392 floral|0.0031826 white|0.0031826  "
		}
	}
}
