{
	"add": {
		"doc": {
			"id": "21ef9dfca7824f9232f6d1d60e2736ea1f8fe0015aba61092c09097df8e3a9d0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Archaeopteryx_lithographica%2C_replica_of_London_specimen%2C_Staatliches_Museum_f%C3%BCr_Naturkunde_Karlsruhe%2C_Germany_-_20100925.jpg/170px-Archaeopteryx_lithographica%2C_replica_of_London_specimen%2C_Staatliches_Museum_f%C3%BCr_Naturkunde_Karlsruhe%2C_Germany_-_20100925.jpg",
				"previous": "In 2010, Robert L. Nudds and Gareth J. Dyke in the journal Science published a paper in which they analysed the rachises of the primary feathers of Confuciusornis and Archaeopteryx. The analysis suggested that the rachises on these two genera were thinner and weaker than those compared to modern birds relative to body weight. The authors determined that Archaeopteryx, along with Confuciusornis, were unable to use flapping flight.[35] This study was criticized by Philip J. Currie and Luis Chiappe, however. Chiappe suggested that it is difficult to measure the rachises of fossilized feathers, and Currie speculated that Archaeopteryx and Confuciusornis must have been able to fly to some degree, as their fossils are preserved in what is believed to have been in marine or lake sediments, suggesting that they must have been able to fly over deep water.[36] Gregory Paul also disagreed with the study, arguing in a 2010 response that Nudds and Dyke had overestimated the weights of these early birds, and that more accurate weight estimates allowed powered flight even with relatively narrow rachises. Nudds and Dyke had assumed a weight of 250 grams for the Munich specimen Archaeopteryx, a young juvenile, based on published weight estimates of larger specimens. Paul argued that a more reasonable body weight estimate for the Munich specimen is about 140 grams. Paul also criticized the measurements of the rachises themselves, noting that the feathers in the Munich specimen are poorly preserved. Nudds and Dyke reported a diameter of 0.75 millimetre (0.030 in) for the longest primary feather, which Paul could not confirm using photographs. Paul measured some of the inner primary feathers, finding rachises 1.25–1.4 mm across.[37] Despite these criticisms, Nudds and Dyke stood by their original conclusions. They claimed that Paul's statement, that an adult Archaeopteryx would have been a better flyer than the juvenile Munich specimen, was dubious. This, they reasoned, would require even thicker rachis, evidence for which has not yet been presented.[38] Another possibility is that they hadn't achieved true flight, but instead used their wings as aids for extra lift while running over water after the fashion of the basilisk lizard, which could explain their presence in lake and marine deposits (see Evolution of bird flight).[39][40]",
				"after": "In 2004, scientists analyzing a detailed CT scan of the braincase of the London Archaeopteryx concluded that its brain was significantly larger than that of most dinosaurs, indicating that it possessed the brain size necessary for flying. The overall brain anatomy was reconstructed using the scan. The reconstruction showed that the regions associated with vision took up nearly one-third of the brain. Other well-developed areas involved hearing and muscle coordination.[41] The skull scan also revealed the structure of its inner ear. The structure more closely resembles that of modern birds than the inner ear of non-avian reptiles. These characteristics taken together, suggest that Archaeopteryx had the keen sense of hearing, balance, spatial perception, and coordination needed to fly.[42] Archaeopteryx had a cerebrum-to-brain-volume ratio 78% of the way to modern birds from the condition of non-coelurosaurian dinosaurs such as Carcharodontosaurus or Allosaurus, which had a crocodile-like anatomy of the brain and inner ear.[43] Newer research show that while the species' brain was more complex than that of more primitive theropods, it had a more generalized brain volume among maniraptoran dinosaurs, even smaller than that of other non-avian dinosaurs in several instances, which indicates the neurological capabilities required of flight was already a common trait in the maniraptoran clade.[44]",
			"color": "tan|0.14542 wheat|0.13589 pale|0.1007 golden|0.1007 rod|0.1007 antique|0.066607 white|0.066607 beige|0.046228 burly|0.045243 wood|0.045243 dark|0.043285 khaki|0.043285 linen|0.039651 old|0.037634 lace|0.037634 moccasin|0.036955 gainsboro|0.033769 light|0.032623 gray|0.032623 light|0.032623 grey|0.032623 papaya|0.030072 whip|0.030072 corn|0.022421 silk|0.022421 blanched|0.021364 almond|0.021364 floral|0.021077 white|0.021077 navajo|0.019615 white|0.019615 sea|0.019435 shell|0.019435 ivory|0.017622 silver|0.01138 light|0.010403 golden|0.010403 rod|0.010403 yellow|0.010403 light|0.0098099 yellow|0.0098099 white|0.0097822 smoke|0.0097822 lemon|0.0093459 chiffon|0.0093459 bisque|0.0083798 honeydew|0.0078572 mint|0.0044852 cream|0.0044852  "
		}
	}
}
