{
	"add": {
		"doc": {
			"id": "21f010b9d33c9fc1c5686c5cf29d28984d1e4d39e2eced1e7ddb807eebdd7277",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/MD_Route_16.svg/40px-MD_Route_16.svg.png",
				"previous": "Interstate Highways and US Highways are assigned at the national level. Interstate Highways are numbered in a grid—even-numbered routes are east–west routes (the lowest numbers are along Mexico and the Gulf of Mexico), and odd-numbered routes are north–south routes (with the lowest numbers along the Pacific Ocean). US Highways are also numbered in a grid—even numbered for east–west routes (with the lowest numbers along Canada) and odd numbered for north–south routes (with the lowest numbers along the Atlantic Ocean). For this reason, mainline (two-digit) Interstate Highways in Maryland all have numbers between 81 and 97 for north-south routes and between 68 and 70 for east-west routes. In addition, mainline US Highways all have numbers between 1 and 29 for north-south routes and between 40 and 50 for east-west routes. Three-digit Interstate and U.S. Highways, also known as \"child routes,\" are branches off their main one- or two-digit \"parents\". The Interstate and US Highways are generally maintained by the SHA, with some toll roads maintained by the Maryland Transportation Authority (MdTA) and some roads maintained by municipalities, including most roads in the city of Baltimore. Interstate 95 (I-95) and U.S. Route 40 (US 40) are the longest examples in the state.",
			"after": [],
			"color": "black|0.14284 dark|0.062588 gray|0.062588 dark|0.062588 grey|0.062588 white|0.060239 snow|0.059965 white|0.058817 smoke|0.058817 dim|0.058384 gray|0.058384 dim|0.058384 grey|0.058384 ghost|0.056893 white|0.056893 mint|0.056396 cream|0.056396 alice|0.054807 blue|0.054807 sea|0.053892 shell|0.053892 azure|0.051302 gray|0.051192 grey|0.051192 floral|0.050502 white|0.050502 silver|0.04813 lavender|0.040703 blush|0.040703 light|0.038208 gray|0.038208 light|0.038208 grey|0.038208 gainsboro|0.034397 ivory|0.013105 linen|0.0076434  "
		}
	}
}
