{
	"add": {
		"doc": {
			"id": "21f2d6e64eac4aaadb887ed739086cce48be32c9e6ba47df33cd3f66d18c630a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Thistle_landslide.png/300px-Thistle_landslide.png",
				"previous": "Debates ensued over the fate of the Marysvale branch line. The mines at the end of the line had long closed; the last train to traverse the entire length of the line passed through in 1970. Still, farmers and industry in the Sevier and Sanpete Valleys generated enough traffic that the line broke even most years. However, this line was severely damaged, with several washed-out bridges and railroad tracks draping over the sides of newly created cliffs. The railroad determined that at best it would take years to recover the cost of rebuilding the line.[38]",
				"after": "The residents of Richfield pressured the Rio Grande to use the portion of the line that was still intact and build a connection to an existing Union Pacific line near Nephi, roughly parallel to State Route 28. However, the railroad determined that including land acquisition, the cost would be comparable to rebuilding the old route. In addition, the Rio Grande would have to pay trackage rights to the Union Pacific for the connection from Nephi, which would further erode profits on a line that was barely profitable. In the end, the Rio Grande sold the line to a scrap dealer who dismantled it.[38] A 2002 study placed the cost of rebuilding the modified routing of the Marysvale branch line at $80 million (equivalent to $105 million in 2015).[37]",
			"color": "light|0.4753 blue|0.4753 dark|0.11411 gray|0.11411 dark|0.11411 grey|0.11411 gray|0.073171 grey|0.073171 dim|0.05497 gray|0.05497 dim|0.05497 grey|0.05497 silver|0.043796 light|0.016721 gray|0.016721 light|0.016721 grey|0.016721 gainsboro|0.015154 alice|0.012188 blue|0.012188 light|0.011255 steel|0.011255 blue|0.011255 white|0.011222 smoke|0.011222 lavender|0.010288 sea|0.010186 shell|0.010186 snow|0.00997 mint|0.0099333 cream|0.0099333 floral|0.0098323 white|0.0098323 white|0.0096216 ghost|0.0085178 white|0.0085178 azure|0.0081736 light|0.0069249 slate|0.0069249 gray|0.0069249 pink|0.0068636 misty|0.0064616 rose|0.0064616 salmon|0.0059444 steel|0.0057605 blue|0.0057605 dark|0.0056992 salmon|0.0056992 slate|0.0054541 gray|0.0054541 light|0.0053928 pink|0.0053928 lavender|0.0053558 blush|0.0053558 linen|0.0052917 light|0.0047187 coral|0.0047187 ivory|0.0044154  "
		}
	}
}
