{
	"add": {
		"doc": {
			"id": "21f6cb1bb3899f146810838ca94870f982963109850df317743a3e4b7b84e501",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/LindwallSignedCard.jpg/225px-LindwallSignedCard.jpg",
				"previous": "Hutton returned for the Fourth Test at Headingley and an opening partnership of 168 resulted until he was bowled by Lindwall. England ran up a large score of 496, with Lindwall taking 2/79.[41] In reply, Australia was still some way behind when Lindwall came in at 6/329. With the fall of Sam Loxton and Ron Saggers, Australia was at 8/355 with only Bill Johnston and Ernie Toshack remaining. Lindwall hit out, scoring 77, an innings marked by powerful driving and pulling,[42] dominating in stands of 48 and 55 with Johnston and Toshack respectively, leaving Australia 38 runs in arrears on the first innings.[41] Lindwall took 2/84 before England declared on the final day, leaving Australia to chase a world Test record of 404 for victory, which they did successfully. Centuries to Bradman and Morris in a 301-run stand saw Australia seal the series 3–0 with a world record.[41][43]",
				"after": "The final Test at The Oval saw Lindwall at his best. English skipper Yardley won the toss and elected to bat on a rain affected pitch. Lindwall had Compton dismissed before lunch after Morris had taken a difficult catch.[44] After the break, England had struggled to 4/35, before Lindwall bowled Yardley with a swinging yorker. He then had Godfrey Evans, Alec Bedser and Jack Young all yorked in the space of two runs.[45] The innings ended at 52 when Hutton leg glanced and was caught by wicket-keeper Don Tallon, who caught the ball one handed at full stretch to his left. Lindwall described the catch as one of the best he had ever seen.[44] In his post-lunch spell, Lindwall bowled 8.1 overs, taking five wickets for eight runs,[46] finishing with 6/20 in 16.1 overs.[45] Bradman described the spell as \"the most devastating and one of the fastest I ever saw in Test cricket\".[44] After Australia had replied with 389, England were bowled out for 188 in their second innings, giving Australia an innings victory and the series 4–0. Lindwall took 3/50 to give him 9/70 for the match. He ended the series as the leading wicket-taker with 27 wickets at 19.62, and scored 191 runs at 31.83.[47] The English were unable to cope with his swing, with 43 of his wickets coming after the batsmen had missed the ball and were bowled.[15] For the entire tour, Lindwall took 86 wickets at 15.68 and scored 405 runs at 24.17.[47] Lindwall's Test haul of 27 scalps equalled the record for an Australian fast bowler in England.[15] Wisden recognised him by naming him as one of its five Wisden Cricketers of the Year in 1949, citing his ability to allow Australia to seize the initiative in all but one of the Tests by achieving early breakthroughs against their batting. Wisden said that \"by whatever standard he is judged\",[15] Lindwall must \"be placed permanently in the gallery of great fast bowlers\",[15] attributing his success to \"superb control of length and direction, his change of pace and general skill, the like of which in a slower bowler could be classed as cunning\".[15] The ferocity of Lindwall's bouncer often prompted opposing batsmen to retreat onto the back foot even before he had released the ball.[15]",
			"color": "tan|0.28265 wheat|0.1848 bisque|0.073662 peach|0.066222 puff|0.066222 moccasin|0.058961 blanched|0.046959 almond|0.046959 black|0.044596 navajo|0.037033 white|0.037033 papaya|0.026075 whip|0.026075 dim|0.025433 gray|0.025433 dim|0.025433 grey|0.025433 antique|0.017629 white|0.017629 gray|0.016347 grey|0.016347 corn|0.013053 silk|0.013053 burly|0.011824 wood|0.011824 beige|0.010377 lemon|0.010023 chiffon|0.010023 light|0.0092179 golden|0.0092179 rod|0.0092179 yellow|0.0092179 dark|0.0086639 gray|0.0086639 dark|0.0086639 grey|0.0086639 light|0.0069152 yellow|0.0069152 silver|0.0068399 old|0.006723 lace|0.006723 linen|0.0056481 light|0.0048343 gray|0.0048343 light|0.0048343 grey|0.0048343 ivory|0.0041806 floral|0.0040183 white|0.0040183 gainsboro|0.0034095 sea|0.003153 shell|0.003153  "
		}
	}
}
