{
	"add": {
		"doc": {
			"id": "21f70e05ed8fc7334005f770cbfe914301c5abf2217afdb1c2f9ddc34b9641bd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Scottish_Parliament_seating.JPG/220px-Scottish_Parliament_seating.JPG",
				"previous": "The most notable feature of the chamber is the roof.[40] The roof is supported by a structure of laminated oak beams joined with a total of 112 stainless steel connectors (each slightly different), which in turn are suspended on steel rods from the walls. The connecting nodes were fabricated by welders for Scotland's oil industry.[41] Such a structure enables the debating chamber to span over 30 metres (100 ft) without any supporting columns.[41] In entering the chamber, MSPs pass under a stone lintel—the Arniston Stone—that was once part of the pre-1707 Parliament building, Parliament House. The use of the Arniston Stone in the structure of the debating chamber symbolises the connection between the historical Parliament of Scotland and the present day Scottish Parliament.[42]",
				"after": "Cut into the western wall of the debating chamber are laminated glass panels, of different shapes, intended to give a human dimension to the chamber.[38] At night, light is shone through the glass panels and is projected onto the MSPs' desks to create the impression that the chamber is never unoccupied.[38] Natural light diffuses into the chamber and is provided by \"glass fins\" which run down from light spaces in the ceiling.[33] Glimpses out of the chamber are given to the landscape and city beyond, intentionally, to visually connect the MSPs to Scotland. The necessities of a modern parliament, banks of light, cameras, electronic voting and the MSPs' console have all been transformed into works of craft and art, displaying the sweeping curves and leaf motifs that inform the rest of the building. Such is the level of craftsmanship, a result of the union of Miralles' inventive designs, superb detailing by RMJM and excellent craftsmanship in execution, that Jencks was prompted to state that the [Parliament] is \"an arts and crafts building, designed with high-tech flair. You really have to go back to the Houses of Parliament in London to get interior design of such a high creative level—in fact, it is more creative\".[43]",
			"color": "saddle|0.45543 brown|0.45543 black|0.17192 peru|0.15333 sandy|0.082614 brown|0.082614 sienna|0.059014 burly|0.03761 wood|0.03761 tan|0.029527  "
		}
	}
}
