{
	"add": {
		"doc": {
			"id": "22147a2e6dde3b6cb9f34d819fa6eb47f692cc43506df4b7a19a64254bf9db0a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Ngorongoro_2012_05_30_2353_%287500935618%29.jpg/220px-Ngorongoro_2012_05_30_2353_%287500935618%29.jpg",
				"previous": "It has been claimed that IUCN put the needs of nature above those of humans, disregarding economic considerations and the interests of indigenous peoples and other traditional users of the land. Until the 1980s IUCN favored the “Yellowstone Model’ of conservation which called for the removal of humans from protected areas. The expulsion of the Maasai people from Serengeti National Park and the Ngorongoro Conservation Area is perhaps the best known example of this approach.[2][6]",
				"after": "This is linked to another criticism that has been directed at IUCN, namely that throughout its history it has mainly been ‘Northern focused’, i.e. had a West-European or North-American perspective on global conservation. Some critics point to the fact that many individuals involved in the establishment of IUCN had been leading figures in the British Society for the Preservation of the Wild Fauna of Empire, which wanted to protect species against the impact of ‘native’ hunting pressure in order to safeguard hunting by Europeans.[29] The fact that at least until the 1990s, most of IUCN staff, the chairs of the Commissions and the IUCN President came from western countries has also led to criticism.[10] Over the past decade, IUCN has changed its approach. It now aims to work in close cooperation with indigenous groups. It has also become more regionalized in its operations and more truly global in its staffing.[10]",
			"color": "black|0.34006 dim|0.12258 gray|0.12258 dim|0.12258 grey|0.12258 dark|0.10998 gray|0.10998 dark|0.10998 grey|0.10998 gray|0.10501 grey|0.10501 silver|0.06986 firebrick|0.025392 light|0.024957 gray|0.024957 light|0.024957 grey|0.024957 slate|0.017455 gray|0.017455 midnight|0.014972 blue|0.014972 maroon|0.014844 gainsboro|0.013598 light|0.013441 slate|0.013441 gray|0.013441 dark|0.012989 red|0.012989 brown|0.012965 rosy|0.010145 brown|0.010145  "
		}
	}
}
