{
	"add": {
		"doc": {
			"id": "2220db0639c7509051cb0ad0c02a2708bcffd5ca195e6b2ecf8190207dd6cf96",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Ann_anbor_wshg_st.jpg/220px-Ann_anbor_wshg_st.jpg",
				"previous": "Ann Arbor's \"Tree Town\" nickname stems from the dense forestation of its parks and residential areas. The city contains more than 50,000 trees along its streets and an equal number in parks.[34] In recent years, the emerald ash borer has destroyed many of the city's approximately 10,500 ash trees.[35] The city contains 157 municipal parks ranging from small neighborhood green spots to large recreation areas. Several large city parks and a university park border sections of the Huron River.[36] Fuller Recreation Area, near the University Hospital complex, contains sports fields, pedestrian and bike paths, and swimming pools. The Nichols Arboretum, owned by the University of Michigan, is a 123-acre (50 ha) arboretum that contains hundreds of plant and tree species. It is on the city's east side, near the university's Central Campus.[37] Located across the Huron River just beyond the university's North Campus is the university's Matthaei Botanical Gardens, which contains 300 acres of gardens and a large tropical conservatory.",
				"after": "The Kerrytown Shops, Main Street Business District, the State Street Business District, and the South University Business District are commercial areas in downtown Ann Arbor. Three commercial areas south of downtown include the areas near I-94 and Ann Arbor-Saline Road, Briarwood Mall, and the South Industrial area. Other commercial areas include the Arborland/Washtenaw Avenue and Packard Road merchants on the east side, the Plymouth Road area in the northeast, and the Westgate/West Stadium areas on the west side.[38] Downtown contains a mix of 19th- and early-20th-century structures and modern-style buildings, as well as a farmers' market in the Kerrytown district.[39] The city's commercial districts are composed mostly of two- to four-story structures, although downtown and the area near Briarwood Mall contain a small number of high-rise buildings.[40]",
			"color": "black|0.38127 dim|0.2408 gray|0.2408 dim|0.2408 grey|0.2408 gray|0.066728 grey|0.066728 dark|0.042938 gray|0.042938 dark|0.042938 grey|0.042938 tan|0.029958 silver|0.024228 rosy|0.021038 brown|0.021038  "
		}
	}
}
