{
	"add": {
		"doc": {
			"id": "2236f53f290fcf77be7b0e2bf56206bb1b295b0bf23e2acb49d640799e1e722f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Noah_Webster_letter_to_Eliza_Webster_on_abolitionism_1837.jpg/200px-Noah_Webster_letter_to_Eliza_Webster_on_abolitionism_1837.jpg",
				"previous": "Webster's dictionaries dominated the English speaking world. In 1850, for example, Blackie and Son in Glasgow published the first general dictionary of English that relied heavily upon pictorial illustrations integrated with the text. Its The Imperial Dictionary, English, Technological, and Scientific, Adapted to the Present State of Literature, Science, and Art; On the Basis of Webster's English Dictionary used Webster's for most of their text, adding some additional technical words that went with illustrations of machinery.[45]",
				"after": "Webster in early life was something of a freethinker, but in 1808 he became a convert to Calvinistic orthodoxy, and thereafter became a devout Congregationalist who preached the need to Christianize the nation.[46] Webster grew increasingly authoritarian and elitist, fighting against the prevailing grain of Jacksonian Democracy. Webster viewed language as a tool to control unruly thoughts. His American Dictionary emphasized the virtues of social control over human passions and individualism, submission to authority, and fear of God; they were necessary for the maintenance of the American social order. As he grew older, Webster's attitudes changed from those of an optimistic revolutionary in the 1780s to those of a pessimistic critic of man and society by the 1820s.[47]",
			"color": "wheat|0.19897 tan|0.12285 moccasin|0.11611 bisque|0.105 blanched|0.088142 almond|0.088142 navajo|0.06652 white|0.06652 lemon|0.051542 chiffon|0.051542 papaya|0.047732 whip|0.047732 peach|0.045049 puff|0.045049 light|0.043743 golden|0.043743 rod|0.043743 yellow|0.043743 corn|0.033447 silk|0.033447 light|0.022006 yellow|0.022006 beige|0.017858 antique|0.016363 white|0.016363 burly|0.011837 wood|0.011837 pale|0.0076823 golden|0.0076823 rod|0.0076823  "
		}
	}
}
