{
	"add": {
		"doc": {
			"id": "224b5c5eba7291daf3132d6d69196e2623af649f5130b074cf1bee67f1f9bdd9",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/97/BookCerneEvangalist.jpeg/240px-BookCerneEvangalist.jpeg",
				"previous": "Lindisfarne was a very important centre of book production, along with Ripon and Monkwearmouth-Jarrow. The Lindisfarne Gospels might be the single most beautiful book produced in the Middle Ages, and the Echternach Gospels and (probably) the Book of Durrow are other products of Lindisfarne. A Latin gospel book, the Lindisfarne Gospels are richly illuminated and decorated in an Insular style that blends not only Irish and Western Mediterranean elements but, incorporates imagery from the Eastern Mediterranean, including Coptic Christianity as well.[178] Produced in the north of England at the same time was the Codex Amiatinus, which has been called \"the finest book in the world.\"[179] It is certainly one of the largest, weighing 34 kilograms.[180] It is a pandect, which was rare in the Middle Ages: all the books of the Bible in one volume. The Codex Amiatinus was produced at Monkwearmouth-Jarrow in 692 under the direction of Abbot Ceolfrith. Bede probably had something to do with it. The production of the Codex shows the riches of the north of England at this time. We have records of the monastery needing a new grant of land to raise two thousand more cattle to get the calf skins to make the vellum to make the manuscript.[181] The Codex Amiatinus was meant to be a gift to the Pope, and Ceolfrith was taking it to Rome when he died on the way. The copy ended up in Florence, where it still is today - a ninth-century copy of this book is even today the personal Bible of the Pope.[182]",
				"after": "In the 8th century, Anglo-Saxon Christian art flourished with grand decorated manuscripts and sculptures, along with 'secular' works which bear comparable ornament, like the Witham pins and the Coppergate helmet.[183] The flourishing of sculpture in Mercia, occurred slightly later than in Northumbria and is dated to the second half of the 8th century. Some fine decorated southern books, above all the Bible fragment, can be securely assigned to the earlier 9th century, owing to the similarity of their script to that of charters from that period; The Book of Cerne is an early 9th century Insular or Anglo-Saxon Latin personal prayer book with Old English components. This manuscript was decorated and embellished with four painted full-page miniatures, major and minor letters, continuing panels, and litterae notibiliores.[184] Further decorated motifs used in these manuscripts, such as hunched, triangular beasts, also appear on objects from the Trewhiddle hoard (buried in the 870s) and on the rings which bear the names of King Æthelwulf and Queen Æthelswith, which are the centre of a small corpus of fine ninth-century metalwork.",
			"color": "tan|0.62386 burly|0.27449 wood|0.27449 black|0.039744 dim|0.022486 gray|0.022486 dim|0.022486 grey|0.022486 peach|0.01123 puff|0.01123  "
		}
	}
}
