{
	"add": {
		"doc": {
			"id": "224fd74acc184893e98292a4b9ee57ba5081ba320fc92f1251636ec2704a7334",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/South_Korean_refugees_mid-1950.jpg/220px-South_Korean_refugees_mid-1950.jpg",
				"previous": "One facet of the changing attitude toward Korea and whether to get involved was Japan. Especially after the fall of China to the Communists, U.S. East Asian experts saw Japan as the critical counterweight to the Soviet Union and China in the region. While there was no United States policy that dealt with South Korea directly as a national interest, its proximity to Japan increased the importance of South Korea. Said Kim: \"The recognition that the security of Japan required a non-hostile Korea led directly to President Truman's decision to intervene... The essential point... is that the American response to the North Korean attack stemmed from considerations of US policy toward Japan.\"[116]",
				"after": "A major consideration was the possible Soviet reaction in the event that the US intervened. The Truman administration was fretful that a war in Korea was a diversionary assault that would escalate to a general war in Europe once the United States committed in Korea. At the same time, \"[t]here was no suggestion from anyone that the United Nations or the United States could back away from [the conflict]\".[117] Truman believed if aggression went unchecked a chain reaction would be initiated that would marginalize the United Nations and encourage Communist aggression elsewhere. The UN Security Council approved the use of force to help the South Koreans and the US immediately began using what air and naval forces that were in the area to that end. The Administration still refrained from committing on the ground because some advisers believed the North Koreans could be stopped by air and naval power alone.[118]",
			"color": "dim|0.44492 gray|0.44492 dim|0.44492 grey|0.44492 black|0.26355 gray|0.15563 grey|0.15563 dark|0.062817 gray|0.062817 dark|0.062817 grey|0.062817 slate|0.035156 gray|0.035156 silver|0.018601 light|0.0095661 slate|0.0095661 gray|0.0095661 light|0.0061748 gray|0.0061748 light|0.0061748 grey|0.0061748  "
		}
	}
}
