{
	"add": {
		"doc": {
			"id": "2270e4e3acbf8906fac21d0f9c9f0d8bc13765d51401cb46ee5a7c4dbbb6b823",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Lautrec_in_bed_1893.jpg/220px-Lautrec_in_bed_1893.jpg",
				"previous": "In 15–16th-century French and English depictions of relationships between women (Lives of Gallant Ladies by Brantôme in 1665, John Cleland's 1749 erotica Memoirs of a Woman of Pleasure, L'Espion Anglais by various authors in 1778), writers' attitudes spanned from amused tolerance to arousal, whereupon a male character would participate to complete the act. Physical relationships between women were often encouraged; men felt no threat as they viewed sexual acts between women to be accepted when men were not available, and not comparable to fulfillment that could be achieved by sexual acts between men and women.[196] At worst, if a woman became enamored of another woman, she became a tragic figure. Physical and therefore emotional satisfaction was considered impossible without a natural phallus. Male intervention into relationships between women was necessary only when women acted as men and demanded the same social privileges.[197]",
				"after": "Lesbianism became almost exclusive to French literature in the 19th century, based on male fantasy and the desire to shock bourgeois moral values.[199] Honoré de Balzac, in The Girl with the Golden Eyes (1835), employed lesbianism in his story about three people living amongst the moral degeneration of Paris, and again in Cousin Bette and Séraphîta. His work influenced novelist Théophile Gautier's Mademoiselle de Maupin, which provided the first description of a physical type that became associated with lesbians: tall, wide-shouldered, slim-hipped, and athletically inclined.[200] Charles Baudelaire repeatedly used lesbianism as a theme in his poems \"Lesbos\", \"Femmes damnées 1\" (\"Damned Women\"), and \"Femmes damnées 2\".[201]",
			"color": "tan|0.20199 brown|0.097943 burly|0.080446 wood|0.080446 dark|0.064206 gray|0.064206 dark|0.064206 grey|0.064206 silver|0.058259 light|0.046064 gray|0.046064 light|0.046064 grey|0.046064 wheat|0.044814 gray|0.037898 grey|0.037898 gainsboro|0.033354 peach|0.031095 puff|0.031095 navajo|0.030708 white|0.030708 firebrick|0.027311 dim|0.025864 gray|0.025864 dim|0.025864 grey|0.025864 moccasin|0.025257 bisque|0.024469 antique|0.01868 white|0.01868 blanched|0.016663 almond|0.016663 papaya|0.011354 whip|0.011354 pale|0.010511 golden|0.010511 rod|0.010511 linen|0.0079973 beige|0.0079451  "
		}
	}
}
