{
	"add": {
		"doc": {
			"id": "2273d1a20f3397325d6f5171bb836b4eb166d1933eed5fb48c5d2b9bb5746541",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/German_prisoners_SS-Panzerdivision_Totenkopf.jpg/220px-German_prisoners_SS-Panzerdivision_Totenkopf.jpg",
				"previous": "Without any further reinforcements in men or materiel, the Waffen-SS divisions were hard put to stop the Allied advance. 1 SS Leibstandarte and 2 SS Das Reich took part in the failed Operation Lüttich in early August.[75] The end came in mid August when the German Army was encircled and trapped in the Falaise pocket, including the 1 SS Leibstandarte, 10 SS Frundsberg and 12 SS Hitlerjugend and the 17 SS Götz von Berlichingen, while the 2 SS Das Reich and the 9 SS Hohenstaufen were ordered to attack Hill 262 from the outside in order to keep the gap open.[76] By 22 August the Falaise pocket had been closed, and all German forces west of the Allied lines were dead or in captivity.[77] In the fighting around Hill 262 alone, casualties totalled 2,000 killed and 5,000 taken prisoner.[78] The 12 SS Hitlerjugend had lost 94 per cent of its armour, nearly all of its artillery, and 70 per cent of its vehicles.[79] The division had close to 20,000 men and 150 tanks before the campaign started, and was now reduced to 300 men and 10 tanks.[79]",
				"after": "With the German Army in full retreat, two further Waffen-SS formations entered the battle in France, the SS Panzergrenadier Brigade 49 and the SS Panzergrenadier Brigade 51. Both had been formed in June 1944 from staff and students at the SS-Junkerschule.[80] They were stationed in Denmark to allow the garrison there to move into France, but were brought forward at the beginning of August to the area south and east of Paris. Both Brigades were tasked to hold crossings over the Seine River allowing the Army to retreat. Eventually they were forced back and then withdrew, the surviving troops being incorporated into the 17 SS Götz von Berlichingen.",
			"color": " "
		}
	}
}
