{
	"add": {
		"doc": {
			"id": "22898c88fbaf6b1ef615e2a486e7a5f7eb116c54cef89cc7bb34dbd1553540a5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Chase_Stone_Barn_-_Green_Grass.jpg/220px-Chase_Stone_Barn_-_Green_Grass.jpg",
				"previous": "Wisconsin's economy also diversified during the early years of statehood. While lead mining diminished, agriculture became a principal occupation in the southern half of the state. Railroads were built across the state to help transport grains to market, and industries like J.I. Case & Company in Racine were founded to build agricultural equipment. Wisconsin briefly became one of the nation's leading producers of wheat during the 1860s.[34] Meanwhile, the lumber industry dominated in the heavily forested northern sections of Wisconsin, and sawmills sprang up in cities like La Crosse, Eau Claire, and Wausau. These economic activities had dire environmental consequences. By the close of the 19th century, intensive agriculture had devastated soil fertility, and lumbering had deforested most of the state.[35] These conditions forced both wheat agriculture and the lumber industry into a precipitous decline.",
				"after": "Beginning in the 1890s, farmers in Wisconsin shifted from wheat to dairy production in order to make more sustainable and profitable use of their land. Many immigrants carried cheese-making traditions that, combined with the state's suitable geography and dairy research led by Stephen Babcock at the University of Wisconsin, helped the state build a reputation as \"America's Dairyland.\"[36] Meanwhile, conservationists including Aldo Leopold helped reestablish the state's forests during the early 20th century,[37] paving the way for a more renewable lumber and paper milling industry as well as promoting recreational tourism in the northern woodlands. Manufacturing also boomed in Wisconsin during the early 20th century, driven by an immense immigrant workforce arriving from Europe. Industries in cities like Milwaukee ranged from brewing and food processing to heavy machine production and toolmaking, leading Wisconsin to rank 8th among U.S. states in total product value by 1910.[38]",
			"color": "olive|0.31468 drab|0.31468 tan|0.14582 dark|0.12446 olive|0.12446 green|0.12446 dark|0.10271 gray|0.10271 dark|0.10271 grey|0.10271 sky|0.0591 blue|0.0591 light|0.050142 sky|0.050142 blue|0.050142 light|0.037738 steel|0.037738 blue|0.037738 silver|0.027278 black|0.024111 light|0.019635 blue|0.019635 wheat|0.017199 dark|0.015399 slate|0.015399 gray|0.015399 light|0.009043 slate|0.009043 gray|0.009043 burly|0.0086543 wood|0.0086543 gray|0.0084657 grey|0.0084657  "
		}
	}
}
