{
	"add": {
		"doc": {
			"id": "229171d6b6c81dc720d17adb0935821dff4398cf3b825c41681e8c2f9e23b015",
			"url": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Hedley_Verity.jpg",
			"previous": [],
				"after": "Jardine planned to use Verity to contain the batsmen and prevent them scoring runs, while the fast bowlers rested.[53] However, Verity was not expected to be a big success on the tour. The good batting conditions, the aggressive Australian approach to playing spin bowlers and Verity's lack of experience led critics to dismiss his potential contribution to the English bowling attack,[54] but Verity had a successful start to the tour. Assisted by overnight rain, he took seven for 37, including the wicket of Don Bradman, against a Combined XI, comprising some of the best Australian players.[55][56] In the following game, against South Australia, Verity took eight wickets, including five for 42 in the second innings.[57] By now, the press had begun to pay attention to Verity's achievements, and former Australian batsman Clem Hill expressed his admiration for Verity.[58][59] Selected for the first Test on the strength of his early tour performances, Verity bowled just 17 overs in the game, mainly being used to give the fast bowlers a rest. He did not take any wickets and Verity himself believed he had bowled poorly.[60] England won the match, using Bodyline tactics which had first been used earlier in the tour.[61] After the Test, the tourists travelled to Tasmania to play two matches against the state team. Verity played in the second, and although rain interrupted play, restricting Verity to five overs, he scored his first half-century in first-class cricket.[27][62] However, he was left out of the team for the second Test and was replaced by Bill Bowes. England played four fast bowlers but Jardine had misjudged the playing surface; the Australian spinners were very effective on a slow-paced pitch and Australia levelled the series.[63][64]",
			"color": "dark|0.24981 gray|0.24981 dark|0.24981 grey|0.24981 gray|0.19209 grey|0.19209 dim|0.14352 gray|0.14352 dim|0.14352 grey|0.14352 silver|0.1349 light|0.10186 gray|0.10186 light|0.10186 grey|0.10186 gainsboro|0.080482 slate|0.022433 gray|0.022433 white|0.016008 smoke|0.016008 light|0.015493 slate|0.015493 gray|0.015493 lavender|0.0099871 lavender|0.0083372 blush|0.0083372 alice|0.0060755 blue|0.0060755 ghost|0.0059865 white|0.0059865 linen|0.0048878 snow|0.0032408 sea|0.0029218 shell|0.0029218  "
		}
	}
}
