{
	"add": {
		"doc": {
			"id": "229d2aba82e9b9372d8bc9bedd53cecb713284ebeb2f5e531eba2bd84165020e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Mapofrocheseterenglandfromfreemanswilliamrufus1882e.jpg/350px-Mapofrocheseterenglandfromfreemanswilliamrufus1882e.jpg",
				"previous": "After the abandonment of Rochester's first castle it was replaced by another on the current site, in the south-west corner of the town walls. Founded between 1087 and 1089, some parts of the castle survive although it has been much altered by use and reuse in subsequent centuries. William the Conqueror had granted Lanfranc, Archbishop of Canterbury, the manor of Haddenham in Buckinghamshire – which as of the Domesday Survey had an annual income of £40 – for the duration of his life. In turn, the archbishop had granted the manor to Rochester's monks, so on the Conqueror's death Lanfranc and Gundulf, who was appointed Bishop of Rochester in 1077, had to appeal for reconfirmation of the original grant from the new king. William Rufus demanded £100 in exchange for confirmation of the grant. The two bishops felt such a sum was beyond their means and sought a compromise. Instead it was agreed that Gundulf would build a new stone castle at Rochester. Initially the two bishops were concerned that the cost would exceed the king's original request and that they would be responsible for the castle's upkeep. However Henry, Earl of Warwick, convinced them that a castle suitable for the king could be constructed for £40 and that following its completion the castle would be handed over to someone else. The actual cost to Gundulf was £60.[8] The bishop was a skilled architect and supervised the construction of the Tower of London's eponymous White Tower on behalf of William the Conqueror.[9] Gundulf's castle was adjacent to Rochester Cathedral. According to archaeologist Oliver Creighton, when castles were positioned close to churches or cathedrals it suggested a link between the two, and in this case both were owned by the Bishop of Rochester. Often the same craftsmen and architects would work on these closely related buildings, leading to similarities in some of their features. Along with Durham and Old Sarum, Rochester is one of the best examples of a closely linked castle and religious building.[10]",
				"after": "In 1127 King Henry I granted Rochester Castle to the Archbishop of Canterbury, William de Corbeil, and his successors in perpetuity. He was given permission to build \"a fortification or tower within the castle and keep and hold it forever\". Corbeil is responsible for building the great tower or keep that still stands today, albeit in an altered state.[11] The 12th century saw many castles in England rebuilt in stone, an advancement in sophistication of design and technology. Although Rochester had already been given a stone curtain wall by Bishop Gundulf, the Keep dates from this period.[12] It visually dominated the rest of the castle, towering above its outer walls, and acted as a residence containing the castle's best accommodation. A sturdy fortification, it could also serve as a stronghold in the event of military action.[11] Such was the importance of the keep as a symbol of Rochester it was depicted on the town's seal in the 13th century.[13]",
			"color": " "
		}
	}
}
