{
	"add": {
		"doc": {
			"id": "22a6fd5bb54cc7d4464d59f825669e11ac33ed1de967ae36407f51600e347b96",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Albino_crow_and_its_mother.JPG/220px-Albino_crow_and_its_mother.JPG",
				"previous": "Four degrees of albinism have been described. The most common form is termed partial albinism, in which local areas of the bird's body, such as certain feathers, are lacking the pigment melanin. The white areas may be symmetrical, with both sides of the bird showing a similar pattern. In imperfect albinism, the pigment is partially inhibited in the skin, eyes, or feathers, but is not absent from any of them. Incomplete albinism is the complete absence of pigment from the skin, eyes, or feathers, but not all three.[10]",
				"after": "A completely albino bird is the most rare. The eyes in this case are pink or red, because blood shows through in the absence of pigment in the irises. The beak, legs, and feet are very pale or white. Albino adults are rare in the wild because their eyesight is poor resulting in greater risk of predation.[11] They are likely easier targets for predators because their colour distinguishes them from their environment. Falconers have observed that their trained birds are likely to attack a white pigeon in a flock because it is conspicuous. A complete albino often has weak eyesight and brittle wing and tail feathers, which may reduce its ability to fly. In flocks, albinos are often harassed by their own species. Such observations have been made among red-winged blackbirds, barn swallows, and African penguins. In a nesting colony of the latter, three unusual juveniles—one black-headed, one white-headed, and one full albino—were shunned and abused by companions.[10]",
			"color": "black|0.55068 lavender|0.062472 light|0.060476 steel|0.060476 blue|0.060476 dim|0.045721 gray|0.045721 dim|0.045721 grey|0.045721 tan|0.036581 dark|0.034281 gray|0.034281 dark|0.034281 grey|0.034281 gray|0.032886 grey|0.032886 silver|0.020325 light|0.01853 slate|0.01853 gray|0.01853 burly|0.018472 wood|0.018472 light|0.015901 gray|0.015901 light|0.015901 grey|0.015901 slate|0.015258 gray|0.015258 alice|0.014674 blue|0.014674 gainsboro|0.014631 ghost|0.011463 white|0.011463 white|0.0075857 smoke|0.0075857  "
		}
	}
}
