{
	"add": {
		"doc": {
			"id": "22a60820c0fd1a80e098a3fa2e480e15c6719d75a364040d5256da6488c65e30",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Astropecten_aranciacus_Naxos08_1775_dett.jpg/220px-Astropecten_aranciacus_Naxos08_1775_dett.jpg",
				"previous": "Most starfish have five arms that radiate from a central disc, but the number varies with the group. Luidia ciliaris has seven arms, members of the Solasteridae have ten to fifteen while the Antarctic Labidiaster annulatus can have up to fifty. It is not unusual in species that typically have five arms for some individuals to possess six or more through abnormal development.[9]",
				"after": "The body wall consists of a thin cuticle, an epidermis consisting of a single layer of cells, a thick dermis formed of connective tissue and a thin coelomic myoepithelial layer, which provides the longitudinal and circular musculature. The dermis contains an endoskeleton of calcium carbonate components known as ossicles. These are honeycombed structures composed of calcite microcrystals arranged in a lattice.[10] They vary in form, with some bearing external granules, tubercles and spines, but most are tabular plates that fit neatly together in a tessellated manner and form the main covering of the aboral surface.[11] Some are specialised structures such as the madreporite (the entrance to the water vascular system), pedicellariae and paxillae.[10] Pedicellariae are compound ossicles with forceps-like jaws. They remove debris from the body surface and wave around on flexible stalks in response to physical or chemical stimuli while continually making biting movements. They often form clusters surrounding spines.[12][13] Paxillae are umbrella-like structures found on starfish that live buried in sediment. The edges of adjacent paxillae meet to form a false cuticle with a water cavity beneath in which the madreporite and delicate gill structures are protected. All the ossicles, including those projecting externally, are covered by the epidermal layer.[10]",
			"color": "dark|0.31987 slate|0.31987 gray|0.31987 dark|0.17571 gray|0.17571 dark|0.17571 grey|0.17571 dim|0.1527 gray|0.1527 dim|0.1527 grey|0.1527 gray|0.13446 grey|0.13446 silver|0.06226 black|0.03008 slate|0.027273 gray|0.027273 light|0.016508 gray|0.016508 light|0.016508 grey|0.016508 light|0.015429 slate|0.015429 gray|0.015429 rosy|0.011892 brown|0.011892 brown|0.0085549  "
		}
	}
}
