{
	"add": {
		"doc": {
			"id": "22ab4900dbf284dd2f23aac005f5a49c2c31cfde948bcc5ae0f3c68599f6c9e4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Scarborough_Train_Station_%284%29.jpg/220px-Scarborough_Train_Station_%284%29.jpg",
				"previous": "The village is home to neighborhoods and business and residential areas, including the central business district, the hamlets of Scarborough and Chilmark, and residential areas Central Briarcliff West, the Tree Streets and the Crossroads.",
				"after": "Scarborough, often called Scarborough-on-Hudson because it borders the Hudson River, is an 0.45-square-mile (1.2 km2) unincorporated district divided between Briarcliff Manor and the village of Ossining, with most of the area within Briarcliff Manor and a few streets in the village of Ossining. Briarcliff Manor's portion of Scarborough was annexed into the village in 1906.[6](p44) Scarborough is largely residential, and has some of the most expensive houses in the village, due in part to its proximity to the Hudson. Condominium complexes within Scarborough include Kemeys Cove, built in 1974, and Scarborough Manor, a 7-story, 205-unit complex built in the 1960s.[35] The hamlet has a post office and a station on the Metro-North Hudson Line within walking distance of most houses in the hamlet.[35] Unlike most of Briarcliff Manor, Scarborough is within the Ossining Union Free School District. During the 17th century, Scarborough became one of the first trading posts for the Dutch on the Hudson. During the early 20th century, the Astor, Rockefeller, and Vanderbilt families entertained guests on their river-view country estates in the Scarborough area. The Scarborough Historic District, including the Scarborough Presbyterian Church, is on the National Register of Historic Places. Across the street from the church is Sparta Cemetery, containing graves of local Revolutionary War veterans and the Leatherman. A notable building is Beechwood, built in 1780 and considered one of the finest examples of Federal architecture in Westchester County.[5](p8)[14] Beechwood was later purchased by Frank A. Vanderlip, who constructed the Scarborough School on the estate. The school was founded in 1913,[36] and closed in 1978. Holly Hill is also part of the historic district. Hubert Rogers, a New York City attorney, had the house designed around 1927 by William Adams Delano; Rogers named it Weskora. After his death Brooke Astor purchased the estate, renaming it Holly Hill for its holly trees.[6](pp116–7) Directly across from Holly Hill is the U.S. headquarters of Philips Research, built on part of Waldheim, the former 130-acre (53 ha) estate of James Speyer.[37]",
			"color": "black|0.35632 dim|0.068635 gray|0.068635 dim|0.068635 grey|0.068635 gray|0.050292 grey|0.050292 dark|0.048303 gray|0.048303 dark|0.048303 grey|0.048303 khaki|0.044222 white|0.027367 smoke|0.027367 alice|0.027299 blue|0.027299 ghost|0.026984 white|0.026984 snow|0.026736 white|0.026733 azure|0.026578 mint|0.026457 cream|0.026457 floral|0.025373 white|0.025373 tan|0.023656 sea|0.020235 shell|0.020235 silver|0.020217 pale|0.016628 golden|0.016628 rod|0.016628 dark|0.013593 slate|0.013593 gray|0.013593 lavender|0.011773 blush|0.011773 light|0.010659 steel|0.010659 blue|0.010659 light|0.0095694 gray|0.0095694 light|0.0095694 grey|0.0095694 light|0.0095413 cyan|0.0095413 navajo|0.0085724 white|0.0085724 wheat|0.0075521 light|0.006734 slate|0.006734 gray|0.006734 moccasin|0.0067307 slate|0.0061951 gray|0.0061951 gainsboro|0.0058567 burly|0.0057605 wood|0.0057605 honeydew|0.0057603 ivory|0.0054511  "
		}
	}
}
