{
	"add": {
		"doc": {
			"id": "22ab20cfc7b7c43b2e00988283882d0fa246dc703789f641c0f83bde7075f455",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/FrogSkin.png/300px-FrogSkin.png",
				"previous": "The integumentary structure contains some typical characteristics common to terrestrial vertebrates, such as the presence of highly cornified outer layers, renewed periodically through a moulting process controlled by the pituitary and thyroid glands. Local thickenings (often called warts) are common, such as those found on toads. The outside of the skin is shed periodically more or less in one piece, in contrast to mammals and birds where it is shed in flakes. Amphibians often eat the sloughed skin.[33] Caecilians are unique among amphibians in having mineralized dermal scales embedded in the dermis between the furrows in the skin. The similarity of these to the scales of bony fish is largely superficial. Lizards and some frogs have somewhat similar osteoderms forming bony deposits in the dermis, but this is an example of convergent evolution with similar structures having arisen independently in diverse vertebrate lineages.[50]",
				"after": "Amphibian skin is permeable to water. Gas exchange can take place through the skin (cutaneous respiration) and this allows adult amphibians to respire without rising to the surface of water and to hibernate at the bottom of ponds.[33] To compensate for their thin and delicate skin, amphibians have evolved mucous glands, principally on their heads, backs and tails. The secretions produced by these help keep the skin moist. In addition, most species of amphibian have granular glands that secrete distasteful or poisonous substances. Some amphibian toxins can be lethal to humans while others have little effect.[51] The main poison-producing glands, the paratoids, produce the neurotoxin bufotoxin and are located behind the ears of toads, along the backs of frogs, behind the eyes of salamanders and on the upper surface of caecilians.[52]",
			"color": "pale|0.16868 violet|0.16868 red|0.16868 silver|0.15279 rosy|0.11586 brown|0.11586 thistle|0.090272 pink|0.066924 light|0.057603 coral|0.057603 indian|0.03724 red|0.03724 misty|0.033537 rose|0.033537 dark|0.0235 salmon|0.0235 white|0.015527 smoke|0.015527 ghost|0.01538 white|0.01538 light|0.015359 pink|0.015359 snow|0.015292 light|0.014812 gray|0.014812 light|0.014812 grey|0.014812 sea|0.014792 shell|0.014792 alice|0.014502 blue|0.014502 lavender|0.014278 blush|0.014278 white|0.013274 mint|0.012126 cream|0.012126 floral|0.011403 white|0.011403 gainsboro|0.011029 azure|0.0092232 dark|0.0090714 gray|0.0090714 dark|0.0090714 grey|0.0090714  "
		}
	}
}
