{
	"add": {
		"doc": {
			"id": "22c6c57df2a0c1de11e99152c95ecda223e3242d472a89414d17e91f12048441",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/CO75thRETROJET.jpg/220px-CO75thRETROJET.jpg",
				"previous": "In September 2008, Continental announced that it would commence providing seasonal non-stop service between Houston and Rio de Janeiro. The new non-stop flight was timed to provide roundtrip flight connections at Continental's Houston hub to more than 160 cities throughout the U.S., Canada, Central America, Europe, and Asia.[44] Continental renewed its lease for around 450,000 square feet (42,000 m2) in Continental Center I.[45] Continental announced that its 4th quarter 2008 net loss widened to $266 million on costs for pilot retirement and reducing the value of its fuel hedges.[46] In January 2009, Continental became the first commercial carrier to successfully demonstrate the use of sustainable biofuel to power an aircraft in North America. During the demonstration flight, Continental’s test pilots successfully conducted a number of flight maneuvers, and the biofuel met all performance requirements as compared with traditional jet fuel. The biofuel blend included components derived from algae and jatropha plants, both sustainable, second-generation sources that do not impact food crops or water resources or contribute to deforestation.[47] In March 2009, Continental became the first U.S. carrier to inaugurate scheduled service between New York and Shanghai, China, with daily non-stop flights from the airline’s hub at Newark Liberty International Airport.[48]",
			"after": [],
			"color": "peru|0.37829 dim|0.16679 gray|0.16679 dim|0.16679 grey|0.16679 gray|0.090464 grey|0.090464 sienna|0.076741 saddle|0.036763 brown|0.036763 dark|0.018053 gray|0.018053 dark|0.018053 grey|0.018053 burly|0.01325 wood|0.01325 tan|0.012395 sea|0.011578 shell|0.011578 white|0.011445 smoke|0.011445 chocolate|0.011123 floral|0.011113 white|0.011113 snow|0.010753 silver|0.010596 white|0.0099115 coral|0.0097903 mint|0.0096406 cream|0.0096406  "
		}
	}
}
