{
	"add": {
		"doc": {
			"id": "22c897cacc7f18d58c12df19e90264581300ad43c0ca31781decdcf6aebd6e89",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Lions_taking_down_cape_buffalo.jpg/250px-Lions_taking_down_cape_buffalo.jpg",
				"previous": "Lions also attack domestic livestock and in India cattle contribute significantly to their diet.[56] Lions are capable of killing other predators such as leopards, cheetahs, hyenas, and wild dogs, though (unlike most felids) they seldom devour the competitors after killing them. A lion may gorge itself and eat up to 30 kg (66 lb) in one sitting;[86] if it is unable to consume all the kill it will rest for a few hours before consuming more. On a hot day, the pride may retreat to shade leaving a male or two to stand guard.[87] An adult lioness requires an average of about 5 kg (11 lb) of meat per day, a male about 7 kg (15 lb).[88]",
				"after": "Because lionesses hunt in open spaces where they are easily seen by their prey, cooperative hunting increases the likelihood of a successful hunt; this is especially true with larger species. Teamwork also enables them to defend their kills more easily against other large predators such as hyenas, which may be attracted by vultures from kilometres away in open savannas. Lionesses do most of the hunting; males attached to prides do not usually participate in hunting, except in the case of larger quarry such as giraffe and buffalo. In typical hunts, each lioness has a favored position in the group, either stalking prey on the \"wing\" then attacking, or moving a smaller distance in the centre of the group and capturing prey in flight from other lionesses.[89] There is evidence that male lions are just as successful at hunting as females; they are solo hunters who ambush prey in small bush.[90] Young lions first display stalking behaviour around three months of age, although they do not participate in hunting until they are almost a year old. They begin to hunt effectively when nearing the age of two.[91]",
			"color": "dim|0.54289 gray|0.54289 dim|0.54289 grey|0.54289 gray|0.3292 grey|0.3292 dark|0.055327 gray|0.055327 dark|0.055327 grey|0.055327 tan|0.034218  "
		}
	}
}
