{
	"add": {
		"doc": {
			"id": "22c941b2fcf600995e4835755d109188820efd9b0b3f8eb55815ffd6f58524eb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Caesar%27s_Tower%2C_Warwick_Castle%2C_2006.jpg/220px-Caesar%27s_Tower%2C_Warwick_Castle%2C_2006.jpg",
				"previous": "In 1153, the wife of Roger de Beaumont, 2nd Earl of Warwick, was tricked into believing that her husband was dead, and surrendered control of the castle to the invading army of Henry of Anjou, later King Henry II.[1][10] According to the Gesta Regis Stephani, a 12th-century historical text, Roger de Beaumont died on hearing the news that his wife had handed over the castle.[11] Henry later returned the castle to the Earls of Warwick as they had been supporters of his mother, Empress Matilda, in The Anarchy of 1135–54.[12]",
				"after": "During the reign of King Henry II (1154–89), the motte-and-bailey was replaced with a stone castle. This new phase took the form of a shell keep with all the buildings constructed against the curtain wall.[13] During the barons' rebellion of 1173–74, the Earl of Warwick remained loyal to King Henry II, and the castle was used to store provisions.[1] The castle and the lands associated with the earldom passed down in the Beaumont family until 1242. When Thomas de Beaumont, 6th Earl of Warwick died, the castle and lands passed to his sister, Lady Margery, countess of Warwick in her own right. Her husband died soon after, and while she looked for a suitable husband, the castle was in the ownership of King Henry III. When she married John du Plessis in December 1242, the castle was returned to her.[1] During the Second Barons' War of 1264–67, William Maudit, 8th Earl of Warwick, was a supporter of King Henry III.[1] The castle was taken in a surprise attack by the forces of Simon de Montfort, 6th Earl of Leicester, from Kenilworth Castle in 1264.[1] According to 15th-century chronicler John Rous, the walls along the northeastern side of Warwick Castle were slighted, so \"that it should be no strength to the king\".[1] Maudit and his countess were taken to Kenilworth Castle and held until a ransom was paid. After the death of William Mauduit in 1267, the title and castle passed to his nephew William de Beauchamp, 9th Earl of Warwick. Following William's death, Warwick Castle passed through seven generations of the Beauchamp family, who over the next 180 years were responsible for most of the additions made to the castle. In 1312, Piers Gaveston, 1st Earl of Cornwall, was captured by Guy de Beauchamp, 10th Earl of Warwick, and imprisoned in Warwick Castle until his execution on 9 June 1312.[1][14] A group of magnates led by the Earl of Warwick and Thomas, 2nd Earl of Lancaster, accused Gaveston of stealing the royal treasure.[15]",
			"color": "black|0.44467 dim|0.15369 gray|0.15369 dim|0.15369 grey|0.15369 dark|0.13911 olive|0.13911 green|0.13911 gray|0.058456 grey|0.058456 dark|0.053213 slate|0.053213 gray|0.053213 dark|0.048546 gray|0.048546 dark|0.048546 grey|0.048546 silver|0.022228 antique|0.013284 white|0.013284 light|0.0091584 gray|0.0091584 light|0.0091584 grey|0.0091584  "
		}
	}
}
