{
	"add": {
		"doc": {
			"id": "22cfd00a5c2ca74c84e596fe874be537566628a210be888777135e521509a863",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Botanical_Magazine_1581_Dryandra_floribunda.jpeg/220px-Botanical_Magazine_1581_Dryandra_floribunda.jpeg",
				"previous": "Brown's paper was approved for printing in May 1809, but did not appear in print until March the following year. In the meantime, Joseph Knight published On the cultivation of the plants belonging to the natural order of Proteeae, which appeared to draw heavily on Brown's unpublished material, without permission, and in most cases without attribution.[15] It contained the first publication of Brown's Josephia, for which two species were listed. The first, Josephia sessilis, was based on one of Menzies' specimens: \"This species, discovered by Mr. A. Menzies on the West coast of New Holland, is not unlike some varieties of Ilex Aquifolium, and now in his Majesty's collection at Kew.\"[16] The etymology of the specific epithet was not explicitly stated, but it is universally accepted that it comes from the Latin sessilis (sessile, stalkless), in reference to the sessile leaves of this species.[1] Blame for the alleged plagiarism largely fell on Richard Salisbury, who had been present at Brown's readings and is thought to have provided much of the material for Knight's book. Salisbury was ostracized by the botanical community, which undertook to ignore his work as much as possible.[15] By the time Brown's monograph appeared in print, Brown had exchanged the generic name Josephia for Dryandra, giving the name Dryandra floribunda to Knight's Josephia sessilis.[17] As there were then no firm rules pertaining to priority of publication,[18] Brown's name was accepted, and remained the current name for over a century.[19]",
				"after": "Another significant early collection was the apparent discovery of the species at the Swan River in 1827. In that year, the colonial botanist of New South Wales Charles Fraser visited the area as part of an exploring expedition under James Stirling. Among the plants that Fraser found growing on the south side of the river entrance was \"a beautiful species of Dryandra\",[20] which was probably this species.[21]",
			"color": "black|0.41379 dark|0.21416 khaki|0.21416 dark|0.19601 olive|0.19601 green|0.19601 tan|0.066243  "
		}
	}
}
