{
	"add": {
		"doc": {
			"id": "22d2739b63d68945e4ec9666d1791d0f3c7912566aa6bb730a02290c285746f7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/d/d5/BW_Dienstanzug_Heer_%28Grundform_M%C3%A4nner_Gebirgsj%C3%A4ger%29.jpg",
			"previous": [
				"According to the official Bundeswehr website, the brigade has a current strength of 6,500 soldiers.[2]",
				"Honouring tradition, upon the creation of the Bundeswehr in 1956, the mountain infantry returned as a distinctive arm of the West German army. Until 2001, they were organized as the 1. Gebirgsdivision, but this division was disbanded in a general reform. The successor unit is Gebirgsjägerbrigade 23 which has its headquarters in Bad Reichenhall. The battalions of these mountain infantry are deployed in southern Bavaria as this is the only high mountain area in Germany touching the Northern Alps. Since 2008 the unit is officially called \"Gebirgsjägerbrigade 23 Bayern (Bavaria)\" as a commendation of the close relationship between the state and the Gebirgsjäger."
			],
				"after": "The soldiers of the mountain infantry wear a grey cap (Bergmütze) with an edelweiß on its left side, stem to the front. This distinguishes them from all other German army soldiers who wear berets and the Austrian army, whose edelweiß has its stem to the back. The formal uniform, which is based on traditional alpine mountain climbing trekking outfits (Berganzug), is also different from the standard mainstream German army uniform, and consists of a light-weight grey ski blouse (Skibluse), black Stirrup trousers (Keilhose) or especially during the summer periods \"Culottes\" knee-breeches (kniebundhose) similar to knickerbockers, and ankle-height mountaineering boots (Bergstiefel) or dual-use mountaineering ski boots. A soldier is allowed to wear the edelweiß on the forage cap after he has completed the \"Edelweißmarsch\". This honor is only allowed for the mountain infantry.",
			"color": "gray|0.29785 grey|0.29785 black|0.1939 dim|0.18251 gray|0.18251 dim|0.18251 grey|0.18251 dark|0.11835 gray|0.11835 dark|0.11835 grey|0.11835 silver|0.058547 light|0.036956 gray|0.036956 light|0.036956 grey|0.036956 gainsboro|0.025445 rosy|0.022967 brown|0.022967 dark|0.022496 salmon|0.022496 burly|0.017225 wood|0.017225  "
		}
	}
}
