{
	"add": {
		"doc": {
			"id": "22ecc93148ea5bc8a33c3111a81d0150fe059d698e6d44af506e5edb635d2783",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/State_Mill%2C_Grand_Forks%2C_ND_1915.JPG/220px-State_Mill%2C_Grand_Forks%2C_ND_1915.JPG",
				"previous": "North Dakota's earliest industries were fur trading and agriculture. Although less than 10% of the population is employed in the agricultural sector,[68] it remains a major part of the state's economy, ranking 9th in the nation in the value of crops and 18th in total value of agricultural products sold. Large farms generate the most crops. The share of people in the state employed in agriculture is comparatively high: as of 2008[update], only approximately 2–3 percent of the population of the United States is directly employed in agriculture.[69] North Dakota has about 90% of its land area in farms with 27,500,000 acres (111,000 km2) of cropland, the third-largest amount in the nation. Between 2002 and 2007, total cropland increased by about one million acres (4,000 km²), the only state showing an increase. Over the same period, 1,800,000 acres (7,300 km2) were shifted into soybean and corn production, the largest such shift in the United States.[70] There is concern about too much in monoculture, making the economy liable to risk from insect or crop diseases, in addition to adverse effects on habitat of wildlife and birds, and balance of the ecosystem.",
				"after": "The state is the largest producer in the U.S. of many cereal grains, including barley (36% of U.S. crop), durum wheat (58%), hard red spring wheat (48%), oats (17%), and combined wheat of all types (15%). It is the second leading producer of buckwheat (20%). As of 2007[update], corn became the state's largest crop produced, although it is only 2% of total U.S. production.[70] The Corn Belt extends to North Dakota, but is situated more on the edge of the region instead of in its center. Corn yields are high in the southeast part of the state and smaller in other parts of the state. Most of the cereal grains are grown for livestock feed.",
			"color": "tan|0.35687 saddle|0.21326 brown|0.21326 sienna|0.20381 burly|0.2031 wood|0.2031  "
		}
	}
}
