{
	"add": {
		"doc": {
			"id": "2307671bdfb60ca0ff95ba1ee3cdf9b35c47193d0e034d400c149b5615bbda47",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Madagascar_physical_map.svg/240px-Madagascar_physical_map.svg.png",
				"previous": "The rova's earliest defining features had crystallised among the Merina as residences for local rulers at least 100 years before the emergence of the united Kingdom of Imerina under Andriamanelo. According to custom, a rova's foundation was always elevated relative to the surrounding village. The compound also always featured a kianja (central courtyard) marked by a vatomasina (tall sacred stone) where the sovereign would stand to deliver kabary (royal speeches or decrees). Contained within the rova was at least one lapa (royal palace or residence) as well as the fasana (tomb) of one or more of the site's founders.[5] The sovereign's lodgings typically stood in the northern part of the rova, while the spouse or spouses lived in the southern part.[6] It was not until the dawn of the 19th century that a perimeter wall of sharpened wooden stakes would constitute another defining feature of rova construction.[5]",
				"after": "The Rova of Antananarivo is located 1,480 metres (4,860 ft) above sea level on Analamanga, originally the highest of the numerous hills in Antananarivo.[7] Around 1610[8] or 1625,[9] Andrianjaka, King of Imerina and grandson of King Andriamanelo, ordered a garrison of 1,000 soldiers to seize the strategic site from its original Vazimba inhabitants. He reportedly succeeded with minimal bloodshed. According to oral history, the mere encampment of his army at the foot of Analamanga was sufficient to secure the submission of the Vazimba.[10] Andrianjaka's army then cleared the forest covering the hill's summit and built a traditional rova to serve as an initial garrison, including an unnamed simple wooden house within it as a palace for the king. Soon afterward Andrianjaka built two more houses, reportedly named Masoandrotsiroa (\"There Are Not Two Suns\", also called Masoandro) and Besakana (\"Great Breadth\").[11] According to another account, Besakana may have been the name of the very first of the three houses Andrianjaka built within the Rova.[12] The king also designated the construction site and design for the royal tombs he named Trano Masina Fitomiandalana (\"Seven Sacred Houses Arranged in Order\", also called Fitomiandalana), which were to be laid out in a line.[13] Andrianjaka's own tomb was the first of these to be built.[14]",
			"color": "dark|0.36326 sea|0.36326 green|0.36326 wheat|0.10183 lemon|0.099566 chiffon|0.099566 light|0.090419 golden|0.090419 rod|0.090419 yellow|0.090419 pale|0.06605 golden|0.06605 rod|0.06605 moccasin|0.03522 dark|0.021758 gray|0.021758 dark|0.021758 grey|0.021758 blanched|0.01659 almond|0.01659 sky|0.013603 blue|0.013603 light|0.012699 sky|0.012699 blue|0.012699 white|0.012329 smoke|0.012329 alice|0.012202 blue|0.012202 silver|0.011755 sea|0.011305 shell|0.011305 ghost|0.011276 white|0.011276 light|0.011258 blue|0.011258 snow|0.011095 white|0.010807 mint|0.010533 cream|0.010533 azure|0.010394 floral|0.010026 white|0.010026 lavender|0.008695 blush|0.008695 light|0.0080612 gray|0.0080612 light|0.0080612 grey|0.0080612 gainsboro|0.0073742 cadet|0.0071812 blue|0.0071812 light|0.0038339 slate|0.0038339 gray|0.0038339  "
		}
	}
}
