{
	"add": {
		"doc": {
			"id": "231a4446dd631567c5be8dbe266b2a2fafe45200055d5563f06f736b987e3ea6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Golden_Gate_Bridge_1926.jpg/220px-Golden_Gate_Bridge_1926.jpg",
				"previous": "Interstate 80 begins at the approach to the Bay Bridge and is the only direct automobile link to the East Bay. U.S. Route 101 connects to the western terminus of Interstate 80 and provides access to the south of the city along San Francisco Bay toward Silicon Valley. Northbound, the routing for U.S. 101 uses arterial streets Mission Street, Van Ness Avenue, Lombard Street, Richardson Avenue, and Doyle Drive to connect to the Golden Gate Bridge, the only direct automobile link to Marin County and the North Bay.",
				"after": "State Route 1 also enters San Francisco from the north via the Golden Gate Bridge, but turns south away from the routing of U.S. 101, first onto Park Presidio Blvd through Golden Gate Park, and then bisecting the west side of the city as the 19th Avenue arterial thoroughfare, joining with Interstate 280 at the city's southern border. Interstate 280 continues this southerly routing along the central portion of the Peninsula south to San Jose. Interstate 280 also turns to the east along the southern edge of the city, terminating just south of the Bay Bridge in the South of Market neighborhood. After the 1989 Loma Prieta Earthquake, city leaders decided to demolish the Embarcadero Freeway as well, and voters approved demolition of a portion of the Central Freeway, converting them into street-level boulevards.[261]",
			"color": "dim|0.23753 gray|0.23753 dim|0.23753 grey|0.23753 slate|0.084547 gray|0.084547 gray|0.075201 grey|0.075201 dark|0.07128 slate|0.07128 gray|0.07128 light|0.059544 slate|0.059544 gray|0.059544 peach|0.049343 puff|0.049343 bisque|0.03071 linen|0.026501 antique|0.025271 white|0.025271 white|0.023575 smoke|0.023575 gainsboro|0.023078 sea|0.022365 shell|0.022365 blanched|0.022065 almond|0.022065 snow|0.020637 old|0.019843 lace|0.019843 papaya|0.019125 whip|0.019125 floral|0.018156 white|0.018156 beige|0.013818 ghost|0.013378 white|0.013378 alice|0.013241 blue|0.013241 lavender|0.012239 blush|0.012239 light|0.011755 gray|0.011755 light|0.011755 grey|0.011755 corn|0.011654 silk|0.011654 mint|0.011406 cream|0.011406 wheat|0.01133 dark|0.01107 gray|0.01107 dark|0.01107 grey|0.01107 white|0.010639 ivory|0.0099316 brown|0.0084799 azure|0.0060383 rosy|0.00594 brown|0.00594  "
		}
	}
}
