{
	"add": {
		"doc": {
			"id": "231ecd044e97731f91dd5f92e4093e75459542552427223e3496500443a8472d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Ophthalmologist_Business_Card_of_Doctor_Jose_Rizal_from_Hong_Kong_End_of_19_Century.jpg/220px-Ophthalmologist_Business_Card_of_Doctor_Jose_Rizal_from_Hong_Kong_End_of_19_Century.jpg",
				"previous": "Shortly after he graduated from the Ateneo Municipal de Manila (now Ateneo de Manila University), Rizal (who was then 16 years old) and a friend, Mariano Katigbak, came to visit Rizal's maternal grandmother in Tondo, Manila. Mariano brought along his sister, Segunda Katigbak, a 14-year old Batangueña from Lipa, Batangas. It was the first time they met and Rizal described Segunda as \"rather short, with eyes that were eloquent and ardent at times and languid at others, rosy–cheeked, with an enchanting and provocative smile that revealed very beautiful teeth, and the air of a sylph; her entire self diffused a mysterious charm.\" His grandmother's guests were mostly college students and they knew that Rizal had skills in painting. They suggested that Rizal should make a portrait of Segunda. He complied reluctantly and made a pencil sketch of her. Unfortunately for him, Katigbak was engaged to Manuel Luz.[22]",
				"after": "From December 1891 to June 1892, Rizal lived with his family in Number 2 of Rednaxela Terrace, Mid-levels, Hong Kong Island. Rizal used 5 D'Aguilar Street, Central district, Hong Kong Island, as his ophthalmologist clinic from 2 pm to 6 pm. This period of his life included his recorded affections of which nine were identified. They were Gertrude Beckett of Chalcot Crescent (London), wealthy and high-minded Nelly Boustead of the English and Iberian merchant family, last descendant of a noble Japanese family Seiko Usui (affectionately called O-Sei-san), his earlier friendship with Segunda Katigbak, Leonor Valenzuela, and eight-year romantic relationship with a distant cousin, Leonor Rivera (popularly thought to be the inspiration for the character of María Clara in Noli me tangere).",
			"color": "light|0.15479 gray|0.15479 light|0.15479 grey|0.15479 gainsboro|0.13392 silver|0.12544 black|0.07068 dark|0.069826 gray|0.069826 dark|0.069826 grey|0.069826 linen|0.051599 white|0.049927 smoke|0.049927 sea|0.040444 shell|0.040444 dim|0.03331 gray|0.03331 dim|0.03331 grey|0.03331 gray|0.032573 grey|0.032573 floral|0.03156 white|0.03156 snow|0.031417 mint|0.02479 cream|0.02479 white|0.024138 ghost|0.021234 white|0.021234 old|0.01988 lace|0.01988 alice|0.018235 blue|0.018235 lavender|0.013302 blush|0.013302 ivory|0.013215 azure|0.012976 antique|0.011859 white|0.011859 misty|0.0039405 rose|0.0039405 honeydew|0.0039362 beige|0.0035998  "
		}
	}
}
