{
	"add": {
		"doc": {
			"id": "2325afb00d479423bf853ff00bb0da9ca82e8225516eaf4958768f0dbf42fc82",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Starr_990520-0830_Casuarina_equisetifolia.jpg/220px-Starr_990520-0830_Casuarina_equisetifolia.jpg",
				"previous": "Procellariids begin to attend their nesting colony around one month prior to laying. Males will arrive first and attend the colony more frequently than females, partly in order to protect a site or burrow from potential competitors. Prior to laying there is a period known as the pre-laying exodus in which both the male and female are away from the colony, building up reserves in order to lay and undertake the first incubation stint respectively. This pre-laying exodus can vary in length from 9 days (as in the Cape petrel)[37] to around 50 days in Atlantic petrels.[38] All procellariids lay one egg per pair per breeding season, in common with the rest of the Procellariiformes. The egg is large compared to that of other birds, weighing 6–24% of the female's weight. Immediately after laying the female goes back to sea to feed while the male takes over incubation. Incubation duties are shared by both sexes in shifts that vary in length between species, individuals and even the stage of incubation. The longest recorded shift was 29 days by a Murphy's petrel from Henderson Island; the typical length of a gadfly petrel stint is between 13 and 19 days. Fulmarine petrels, shearwaters and prions tend to have shorter stints, averaging between 3 to 13 days. Incubation takes a long time, from 40 days for the smaller species (such as prions) to around 55 days for the larger species. The incubation period is longer if eggs are abandoned temporarily; procellariid eggs are resistant to chilling and can still hatch after being left unattended for a few days.",
				"after": "After hatching the chick is brooded by a parent until it is large enough to thermoregulate efficiently, and in some cases defend itself from predation. This guard stage lasts a short while for burrow-nesting species (2–3 days) but longer for surface nesting fulmars (around 16–20 days) and giant petrels (20–30 days). After the guard stage both parents feed the chick. In many species the parent's foraging strategy alternates between short trips lasting 1–3 days and longer trips of 5 days.[39] The shorter trips, which are taken over the continental shelf, benefit the chick with faster growth, but longer trips to more productive pelagic feeding grounds are needed for the parents to maintain their own body condition. The meals are composed of both prey items and stomach oil, an energy-rich food that is lighter to carry than undigested prey items.[40] This oil is created in a stomach organ known as a proventriculus from digested prey items, and gives procellariids and other Procellariifromes their distinctive musty smell. Chick development is quite slow for birds, with fledging taking place at around 2 months after hatching for the smaller species and 4 months for the largest species. The chicks of some species are abandoned by the parents; parents of other species continue to bring food to the nesting site after the chick has left. Chicks put on weight quickly and some can outweigh their parents; although, they will slim down before they leave the nest.[11] All procellariid chicks fledge by themselves, and there is no further parental care after fledging. Life expectancy of Procellariidae is between 15 and 20 years; although, the oldest recorded member was a northern fulmar that was over 50 years.[11]",
			"color": "dark|0.23003 gray|0.23003 dark|0.23003 grey|0.23003 gray|0.12361 grey|0.12361 silver|0.11149 dim|0.10045 gray|0.10045 dim|0.10045 grey|0.10045 slate|0.0726 gray|0.0726 light|0.068969 slate|0.068969 gray|0.068969 light|0.044207 gray|0.044207 light|0.044207 grey|0.044207 black|0.032339 gainsboro|0.025229 wheat|0.022306 tan|0.019656 burly|0.017679 wood|0.017679 navajo|0.017566 white|0.017566 moccasin|0.017099 pale|0.0096612 golden|0.0096612 rod|0.0096612 antique|0.0076032 white|0.0076032 linen|0.0063505 beige|0.0060751 old|0.0052988 lace|0.0052988 lemon|0.0048456 chiffon|0.0048456 light|0.0048083 steel|0.0048083 blue|0.0048083 honeydew|0.0042634  "
		}
	}
}
