{
	"add": {
		"doc": {
			"id": "232aab822cae34c0e10cdbcae210ce5d5f565a9d0ecd231e9171b52318e29d10",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Ketham_p64.jpg/220px-Ketham_p64.jpg",
				"previous": "Two skeletons to the rear left and right of the print are labelled as James Field, a well-known boxer who also featured on a poster in the second plate, and Macleane, an infamous highwayman. Both men were hanged shortly before the print was published (Macleane in 1750 and Field in 1751). The skeletons seemingly point to one another. Field's name above the skeleton on the left may have been a last minute substitution for \"GENTL HARRY\" referring to Henry Simms, also known as Young Gentleman Harry. Simms was a robber who was executed in 1747.[14] The motif of the lone \"good man\" is carried through to this final plate, where one of the academics points at the skeleton of James Field, indicating the inevitable outcome for those who start down the path of cruelty.[5]",
				"after": "The composition of the scene is a pastiche of the frontispiece of Andreas Vesalius's De humani corporis fabrica, and it possibly also borrows from Quack Physicians' Hall (c. 1730) by the Dutch artist Egbert van Heemskerck, who had lived in England and whose work Hogarth admired.[22] An earlier source of inspiration may have been a woodcut in the 1495 Fasciculo di medicina by Johannes de Ketham which, although simpler, has many of the same elements, including the seated president flanked by two windows.[19]",
			"color": "silver|0.12002 dark|0.11339 gray|0.11339 dark|0.11339 grey|0.11339 light|0.091736 gray|0.091736 light|0.091736 grey|0.091736 gainsboro|0.06917 linen|0.068868 old|0.059669 lace|0.059669 sea|0.057122 shell|0.057122 floral|0.055492 white|0.055492 white|0.050298 smoke|0.050298 ivory|0.050059 mint|0.045181 cream|0.045181 snow|0.042494 white|0.034575 antique|0.029688 white|0.029688 honeydew|0.026304 beige|0.019325 gray|0.019251 grey|0.019251 corn|0.0087467 silk|0.0087467 papaya|0.0083971 whip|0.0083971 azure|0.0065486 ghost|0.0059918 white|0.0059918 blanched|0.0044005 almond|0.0044005 light|0.0036214 yellow|0.0036214 lavender|0.0036124 blush|0.0036124  "
		}
	}
}
