{
	"add": {
		"doc": {
			"id": "23304688ebbdfa0b0978ff9e3517876817c955c33c01e0b4d5f222ef31a38aa1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Medical_student_at_the_laboratories_of_ITESM_CCM.jpg/220px-Medical_student_at_the_laboratories_of_ITESM_CCM.jpg",
				"previous": "In Zimbabwe medical school is offered at the University of Zimbabwe and the National University of Science and Technology. Medical training is offered as an undergraduate course.",
				"after": "There are public and private universities which provide medical tuition in Argentina, with the fundamental and unresolved dispute being which system of education is of higher quality. A person who can afford to attend a private university, quite expensive for the average person, will choose that over public education.[citation needed] Nevertheless, quality of education is generally not the reason they make that choice: private universities have smaller groups of students in each class, which means the professor can deliver a more tailored education by not having to deal with hundreds of students at a time. The Universidad Adventista del Plata, for instance, has about 70 students in each class, turning classes into an environment in which the students feel freer to participate and ask questions. Another advantage of private over public is that it is considerably easier to be admitted. In general, the admission process for a public School of Medicine (which involves a very competitive examination) is more difficult than that of a private institution, the main reason being a large number of applicants in public universities and not enough place for all who apply. When it comes to educational quality, however, it is now generally believed that inequalities are not significant between public and private education.[citation needed]",
			"color": "black|0.36364 gray|0.14718 grey|0.14718 dim|0.11792 gray|0.11792 dim|0.11792 grey|0.11792 slate|0.084992 gray|0.084992 dark|0.081748 gray|0.081748 dark|0.081748 grey|0.081748 light|0.075918 slate|0.075918 gray|0.075918 silver|0.019173 pale|0.011596 golden|0.011596 rod|0.011596 light|0.0090096 steel|0.0090096 blue|0.0090096 light|0.0084233 gray|0.0084233 light|0.0084233 grey|0.0084233 dark|0.005539 slate|0.005539 gray|0.005539 tan|0.005404 gainsboro|0.0048936  "
		}
	}
}
