{
	"add": {
		"doc": {
			"id": "23335a8d2027285a6d4a666d0747ddeafe986dce7f02ea1c21b3698f295a8a3e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Roadtown%2C_Tortola.jpg/220px-Roadtown%2C_Tortola.jpg",
				"previous": "Crime in the British Virgin Islands is comparatively low by Caribbean standards (and indeed compared to the neighbouring US Virgin Islands).[12] Whilst statistics and hard data are relatively rare, and are not regularly published by Governmental sources in the British Virgin Islands, the Premier did announce that in 2013 there has been a 14% decline in recorded crime as against 2012.[13] Homicides are rare,[14] with just one incident recorded in 2013. The British and US Virgin Islands sit at the axis of a major drugs transshipment point between Latin America and the continental United States. The American DEA regards the adjacent US territories of Puerto Rico and the US Virgin Islands as a \"High Intensity Drug Trafficking Area\".[15] A co-operation agreement exists between the British Virgin Islands and the US Coastguard allowing American forces to pursue suspected drug traffickers through the territorial waters of the British Virgin Islands. In August 2011 a joint raid between the American DEA and the Royal Virgin Islands Police Force arrested a number of British Virgin Islands residents who are accused of being involved in major drugs transshipments,[16] although their extradition to the United States has become bogged down in endless legal wrangling.[17]",
				"after": "As an offshore financial centre,[18] the British Virgin Islands enjoys one of the more prosperous economies of the Caribbean region, with a per capita average income of around $42,300 (2010 est.) [19] The average monthly income earned by a worker in the Territory was US$2,452 as at the time of the 2010 Census.[1] 29% of the population fell into the \"low income\" category.",
			"color": "black|0.33414 light|0.21917 sky|0.21917 blue|0.21917 slate|0.061854 gray|0.061854 light|0.051858 blue|0.051858 light|0.03546 slate|0.03546 gray|0.03546 dark|0.03409 gray|0.03409 dark|0.03409 grey|0.03409 dim|0.033637 gray|0.033637 dim|0.033637 grey|0.033637 gray|0.031804 grey|0.031804 light|0.029083 steel|0.029083 blue|0.029083 dark|0.025514 slate|0.025514 gray|0.025514 dark|0.017728 olive|0.017728 green|0.017728 silver|0.016714 lavender|0.012787 alice|0.012377 blue|0.012377 light|0.011384 gray|0.011384 light|0.011384 grey|0.011384 light|0.0089084 cyan|0.0089084 gainsboro|0.0086537 azure|0.0070437 sky|0.0056218 blue|0.0056218 steel|0.0050467 blue|0.0050467 white|0.0049982 smoke|0.0049982 mint|0.0046291 cream|0.0046291  "
		}
	}
}
