{
	"add": {
		"doc": {
			"id": "23386778e0bebcca557a18332d14e60e707f0e7707741ec92a493e555ee08440",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Aushwitz-_hundreds_of_thousands_walked_down_these_steps.JPG/220px-Aushwitz-_hundreds_of_thousands_walked_down_these_steps.JPG",
				"previous": "Prisoners were transported from all over German-occupied Europe by rail, arriving in daily convoys.[128] By July 1942, the SS were conducting \"selections\". Incoming Jews were segregated; those deemed able to work were sent to the right and admitted into the camp, and those deemed unfit for labor were sent to the left and immediately gassed.[129] The group selected to die, about three-quarters of the total,[b] included almost all children, women with small children, all the elderly, and all those who appeared on brief and superficial inspection by an SS doctor not to be completely fit.[131] After the selection process was complete, those too ill or too young to walk to the crematoria were transported there on trucks or killed on the spot with a bullet to the head.[132][133] The belongings of the arrivals were seized by the SS and sorted in an area of the camp called \"Canada\", so called because Canada was seen as a land of plenty. Many of the SS at the camp enriched themselves by pilfering the confiscated property.[134]",
				"after": "SS officers told the victims they were to take a shower and undergo delousing. The victims undressed in an outer chamber and walked into the gas chamber, which was disguised as a shower facility. Some were even issued soap and a towel.[135] The Zyklon B was delivered by ambulance to the crematoria by a special SS bureau known as the Hygienic Institute.[136] The actual delivery of the gas to the victims was always handled by the SS, on the order of the supervising SS doctor.[137][138] After the doors were shut, SS men dumped in the Zyklon B pellets through vents in the roof or holes in the side of the chamber. The victims were dead within 20 minutes.[137] Despite the thick concrete walls, screaming and moaning from within could be heard outside. In one failed attempt to muffle the noise, two motorcycle engines were revved up to full throttle nearby, but the sound of yelling could still be heard over the engines.[139]",
			"color": "dim|0.31105 gray|0.31105 dim|0.31105 grey|0.31105 gray|0.27005 grey|0.27005 dark|0.20273 gray|0.20273 dark|0.20273 grey|0.20273 silver|0.11947 light|0.059444 gray|0.059444 light|0.059444 grey|0.059444 gainsboro|0.02632 black|0.0037532 slate|0.0037089 gray|0.0037089  "
		}
	}
}
