{
	"add": {
		"doc": {
			"id": "233ee33c62edadbc4206baa98168e6086ef37ce3d371496c781083abd0d63ad1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/HEL_SK_Business_Lounge_general_overview.jpg/220px-HEL_SK_Business_Lounge_general_overview.jpg",
				"previous": "Independent programs such as Priority Pass offer access to selected airline lounges for an annual fee, while Airport Angel, Red Dot Lounges and Go Simply offer prebookable access without need for membership. Premium credit and charge cards[8][9] such as Diners Club International, American Express Platinum and Centurion Card charge cards, and the Morgan Stanley i24 Card,[10][better source needed] offer lounge programs for members. As of 2008 the American Express Platinum (in some countries) and Centurion charge cards, Morgan Stanley i24 card and the RBS Black Card include Priority Pass membership.[citation needed] Some banks like HSBC now offer a lounge access program for premium clients.[citation needed] American Express also offers access to lounges belonging to Prioity Pass and is expanding its own line of lounges.[citation needed]",
				"after": "Besides offering more comfortable seating, lounges usually provide complimentary alcoholic and non-alcoholic beverages, and light snacks[1] such as fruit, cheese, soup, pastries and breakfast items.[citation needed] In the United States and Canada, nearly all domestic lounges offer an open bar for domestic beer, house wine and well liquor, with premium beverages such as imported beer, top-shelf liquor, high end wines and champagne available for purchase.[11][12] In US states where open bars are prohibited by law, non-premium beverages may be sold at a token rate (e.g. $1 per drink).[citation needed]",
			"color": "dim|0.27186 gray|0.27186 dim|0.27186 grey|0.27186 gray|0.19924 grey|0.19924 dark|0.086504 gray|0.086504 dark|0.086504 grey|0.086504 black|0.053039 light|0.050827 blue|0.050827 light|0.047983 slate|0.047983 gray|0.047983 slate|0.047635 gray|0.047635 dark|0.047544 slate|0.047544 gray|0.047544 silver|0.044367 light|0.04205 steel|0.04205 blue|0.04205 powder|0.021804 blue|0.021804 light|0.019013 gray|0.019013 light|0.019013 grey|0.019013 gainsboro|0.012564 steel|0.0089706 blue|0.0089706  "
		}
	}
}
