{
	"add": {
		"doc": {
			"id": "233f42ad7e50f08aa808bd36dc03b3e4aa1d16631abbfa50e8ba74769357e52d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Brazil_State_Acre.svg/200px-Brazil_State_Acre.svg.png",
				"previous": "Although the idea of river navigation was complicated, in 1869, the North American engineer George Earl Church obtained from the Bolivian government a concession to create and explore a navigation enterprise that linked the Mamoré and Madeira Rivers. Shortly afterwards, he realized the real difficulty of this undertaking. He changed the plans to construction of a railroad. Negotiations advanced and, by 1870, Church received permission from the Brazilian government to build a railroad along the rubber territories of the Madeira River.",
				"after": "The increase in uncontrolled extraction of rubber was increasing tensions and close to provoking an international conflict. The Brazilian workers advanced further and further into the forests in the territory of Bolivia in search of new rubber trees for extraction, creating conflicts and skirmishes on the frontier towards the end of the 19th century. The Bolivian Army, led by José Plácido de Castro, was sent into the area to protect Bolivian resources. The newly proclaimed Brazilian republic was drawing a considerable profit from the lucrative rubber trade, but the \"Acre question\" (as the border conflicts caused by rubber extraction became known) preoccupied it.",
			"color": "antique|0.09305 white|0.09305 linen|0.090284 old|0.088109 lace|0.088109 papaya|0.087123 whip|0.087123 sea|0.086446 shell|0.086446 beige|0.085627 floral|0.085588 white|0.085588 corn|0.084599 silk|0.084599 ivory|0.084103 blanched|0.080553 almond|0.080553 light|0.023776 steel|0.023776 blue|0.023776 light|0.022413 gray|0.022413 light|0.022413 grey|0.022413 silver|0.020478 dark|0.015562 gray|0.015562 dark|0.015562 grey|0.015562 light|0.013964 slate|0.013964 gray|0.013964 crimson|0.013819 gainsboro|0.008917 gray|0.0045003 grey|0.0045003  "
		}
	}
}
