{
	"add": {
		"doc": {
			"id": "234b5bc7ad549aa4ee9246ce91384681f76d0cf02aac4c3d2e879b89a9d65622",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Pezophaps_stalagmite.jpg/220px-Pezophaps_stalagmite.jpg",
			"previous": [],
				"after": "The Rodrigues solitaire probably became extinct sometime between the 1730s and 1760s; the exact date is unknown. Its disappearance coincided with the tortoise trade between 1730 and 1750; traders burnt off vegetation, hunted solitaires and imported cats and pigs that preyed on eggs and chicks.[38] In 1755, Joseph-François Charpentier de Cossigny attempted to obtain a live specimen, as he had been assured the Rodrigues solitaire still survived in remote areas of the island. Though trying for 18 months, and offering large rewards, none could be found. He noted that cats were blamed for decimating the species, but suspected that it was due to hunting by humans instead.[38] Alexandre Guy Pingré did not encounter any solitaires when he visited Rodrigues to observe the 1761 transit of Venus, although he had been assured they survived. His friend Pierre Charles Le Monnier named the constellation Turdus Solitarius after the bird to commemorate the journey. Although the Rodrigues solitaire is the only extinct bird to have a former constellation named for it, celestial mapmakers did not know what it looked like and star maps depict other birds.[29]",
			"color": "dark|0.084829 gray|0.084829 dark|0.084829 grey|0.084829 gainsboro|0.07642 silver|0.074992 light|0.070806 gray|0.070806 light|0.070806 grey|0.070806 linen|0.070765 misty|0.062897 rose|0.062897 sea|0.060731 shell|0.060731 gray|0.059716 grey|0.059716 white|0.057078 smoke|0.057078 lavender|0.053424 blush|0.053424 floral|0.051856 white|0.051856 snow|0.050637 old|0.049925 lace|0.049925 dim|0.04416 gray|0.04416 dim|0.04416 grey|0.04416 antique|0.042255 white|0.042255 white|0.028963 ghost|0.023553 white|0.023553 ivory|0.012609 mint|0.010695 cream|0.010695 alice|0.0041907 blue|0.0041907 black|0.002592  "
		}
	}
}
