{
	"add": {
		"doc": {
			"id": "2356683a48bddba157fca042b252c2f328ff740b0fae631094dfb4ea67dc4d52",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Pedacaris_Incident_cartoon.jpg/170px-Pedacaris_Incident_cartoon.jpg",
				"previous": "In December 1902, the German government asked Roosevelt to arbitrate its dispute with Venezuela over unpaid debts. Hay did not think this appropriate, as Venezuela also owed the U.S. money, and quickly arranged for the International Court of Arbitration in The Hague to step in. Hay supposedly said, as final details were being worked out, \"I have it all arranged. If Teddy will keep his mouth shut until tomorrow noon!\"[181] Hay and Roosevelt also differed over the composition of the Joint High Commission that was to settle the Alaska boundary dispute. The commission was to be composed of \"impartial jurists\" and the British and Canadians duly appointed notable judges. Roosevelt appointed politicians, including Secretary Root and Senator Lodge. Although Hay was supportive of the President's choices in public, in private he protested loudly to Roosevelt, complained by letter to his friends, and offered his resignation. Roosevelt declined it, but the incident confirmed him in his belief that Hay was too much of an Anglophile to be trusted where Britain was concerned. The American position on the boundary dispute was imposed on Canada by a 4–2 vote, with the one English judge joining the three Americans.[181]",
				"after": "One incident involving Hay that benefitted Roosevelt politically was the kidnapping of Greek-American playboy Ion Perdicaris in Morocco[e] by chieftain Mulai Ahmed er Raisuli, an opponent of Sultan Abdelaziz. Raisuli demanded a ransom, but also wanted political prisoners to be released and control of Tangier in place of the military governor. Raisuli supposed Perdicaris to be a wealthy American, and hoped United States pressure would secure his demands. In fact, Perdicaris, though born in New Jersey, had renounced his citizenship during the Civil War to avoid Confederate confiscation of property in South Carolina, and had accepted Greek naturalization, a fact not generally known until years later, but that decreased Roosevelt's desire for military action. The sultan was ineffective in dealing with the incident, and Roosevelt considered seizing the Tangier waterfront, source of much of Abdelaziz's income, as a means of motivating him. With Raisuli's demands escalating, Hay, with Roosevelt's approval, finally cabled the consul-general in Tangier, Samuel Gummeré:",
			"color": "black|0.13909 blanched|0.07578 almond|0.07578 wheat|0.074965 papaya|0.066339 whip|0.066339 bisque|0.063497 antique|0.056027 white|0.056027 corn|0.052424 silk|0.052424 beige|0.045925 light|0.045867 golden|0.045867 rod|0.045867 yellow|0.045867 tan|0.043008 dim|0.041983 gray|0.041983 dim|0.041983 grey|0.041983 lemon|0.039548 chiffon|0.039548 light|0.036363 yellow|0.036363 gray|0.031241 grey|0.031241 moccasin|0.025639 dark|0.025057 gray|0.025057 dark|0.025057 grey|0.025057 old|0.020367 lace|0.020367 peach|0.016462 puff|0.016462 silver|0.016439 ivory|0.013719 linen|0.012286 light|0.0097738 gray|0.0097738 light|0.0097738 grey|0.0097738 floral|0.0093161 white|0.0093161 sea|0.0059806 shell|0.0059806 gainsboro|0.0055954  "
		}
	}
}
