{
	"add": {
		"doc": {
			"id": "2366358f6a8f4898fe74430009875268dea5182026b9bf9e843fe952d1e7654e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Jerusalem_Light_Rail_in_Zion_Square_on_A_Rainy_morning_-_November_2011.jpg/220px-Jerusalem_Light_Rail_in_Zion_Square_on_A_Rainy_morning_-_November_2011.jpg",
				"previous": "A new master plan for the city will see many high-rise buildings, including skyscrapers, built in certain, designated areas of downtown Jerusalem. Under the plan, towers will line Jaffa Road and King George Street. One of the proposed towers along King George Street, the Migdal Merkaz HaYekum, is planned as a 65-story building, which would make it one of the tallest buildings in Israel. At the entrance to the city, near the Jerusalem Chords Bridge and the Central Bus Station, twelve towers rising between 24 and 33 stories will be built, as part of a complex that will also include an open square and an underground train station serving a new express line between Jerusalem and Tel Aviv, and will be connected by bridges and underground tunnels. Eleven of the skyscrapers will be either office or apartment buildings, and one will be a 2,000-room hotel. The complex is expected to attract many businesses from Tel Aviv, and become the city's main business hub. In addition, a complex for the city's courts and the prosecutor's office will be built, as well as new buildings for Central Zionist Archives and Israel State Archives.[346][347][348] The skyscrapers built throughout the city are expected to contain public space, shops, restaurants, and entertainment venues, and it has been speculated that this may lead to a revitalization of downtown Jerusalem.[349][350]",
				"after": "Jerusalem is served by highly developed communication infrastructures, making it a leading logistics hub for Israel.",
			"color": "dim|0.36071 gray|0.36071 dim|0.36071 grey|0.36071 gray|0.23164 grey|0.23164 dark|0.1386 gray|0.1386 dark|0.1386 grey|0.1386 black|0.056077 silver|0.051893 slate|0.033597 gray|0.033597 light|0.03215 gray|0.03215 light|0.03215 grey|0.03215 gainsboro|0.02389 light|0.0228 slate|0.0228 gray|0.0228 lavender|0.0086274 alice|0.0062778 blue|0.0062778 white|0.0058673 smoke|0.0058673 dark|0.0057805 slate|0.0057805 gray|0.0057805  "
		}
	}
}
