{
	"add": {
		"doc": {
			"id": "236ea61633d85fd99b2c0a3363493ad8106e14e0cddc200cd673c8b02949d25e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Historic_Everglades_Regions.jpg/220px-Historic_Everglades_Regions.jpg",
			"previous": [],
				"after": "Several ecosystems are present in the Everglades, and boundaries between them are subtle or do not exist. The primary feature of the Everglades is the sawgrass marsh. The iconic water and sawgrass combination in the shallow river 100 miles (160 km) long and 60 miles (97 km) wide that spans from Lake Okeechobee to Florida Bay is often referred to as the \"true Everglades\" or just \"the Glades\".[39][40] Prior to the first drainage attempts in 1905, the sheetflow occupied nearly a third of the lower Florida peninsula.[30] Sawgrass thrives in the slowly moving water, but may die in unusually deep floods if oxygen is unable to reach its roots. It is particularly vulnerable immediately after a fire.[41] The hydroperiod for the marsh is at least nine months, and can last longer.[42] Where sawgrass grows densely, few animals or other plants live, although alligators choose these locations for nesting. Where there is more room, periphyton grows.[43] Periphyton supports larval insects and amphibians, which in turn are consumed as food by birds, fish, and reptiles. It also absorbs calcium from water, which adds to the calcitic composition of the marl.[44]",
			"color": "black|0.17862 dim|0.17334 gray|0.17334 dim|0.17334 grey|0.17334 gray|0.10553 grey|0.10553 dark|0.075145 slate|0.075145 gray|0.075145 dark|0.049405 gray|0.049405 dark|0.049405 grey|0.049405 midnight|0.035439 blue|0.035439 silver|0.032081 slate|0.025305 gray|0.025305 medium|0.023587 blue|0.023587 light|0.022929 gray|0.022929 light|0.022929 grey|0.022929 dark|0.017897 olive|0.017897 green|0.017897 thistle|0.016692 gainsboro|0.016222 light|0.015547 slate|0.015547 gray|0.015547 steel|0.01209 blue|0.01209 dark|0.011378 slate|0.011378 blue|0.011378 dark|0.010904 khaki|0.010904 dark|0.010549 blue|0.010549 white|0.009395 smoke|0.009395  "
		}
	}
}
