{
	"add": {
		"doc": {
			"id": "236f1b88aefac27a95458c35d5c1d1015f8dcca45483bd10e5c9aba4aa85fb45",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/M_Reading_Detail3.jpg/240px-M_Reading_Detail3.jpg",
				"previous": "Van der Weyden's pose for the Magdalene is similar to a number of female religious figures painted by his master Robert Campin or his workshop.[14] It closely resembles, in theme and tone, the figure of Saint Barbara in Campin's Werl Altarpiece,[14] and also the Virgin in an Annunciation attributed to Campin in Brussels.[15] Typically for a van der Weyden, the Magdalen's face has an almost sculpted look, and the elements of her clothes are conveyed in minute detail. She wears a green robe; in medieval art the Magdalene is usually depicted naked (sometimes clad only in her long hair) or in richly coloured dress, typically red, blue or green, almost never in white.[16] Her robe is tightly pulled below her bust by a blue sash, while the gold brocade of her underskirt is adorned by a jewelled hem.[11] Art critic Charles Darwent observed that the Magdalen's past as a \"fallen woman\" is hinted at by the nap in the fur lining of her dress and the few strands of hair loose from her veil. Darwent wrote, \"Even her fingers, absent-mindedly circled, suggest completeness. In her mix of purity and eroticism, van der Weyden's Magdalen feels whole; but she isn't.\"[17] In the medieval period, fur symbolized female sexuality and was commonly associated with the Magdalene. Medieval historian Philip Crispin explains that artists such as Memling and Matsys often portrayed the Magdalen in furs and notes that she \"is noticeably dressed in fur-lined garments in The Magdalen Reading by Rogier van der Weyden\".[18]",
				"after": "The level of detail used in portraying the Magdalene has been described by Campbell as \"far exceed[ing]\" van Eyck. Her lips are painted with a shades of vermilion, white and red which are mixed into each other to give a transparent look at the edges. The fur lining of her dress is painted in a range of greys running from almost pure white to pure black. Rogier gave the fur a textured look by painting stripes parallel to the line of the dress and then feathering the paint before it dried. The gold on the cloth is rendered with a variety of impasto, grid and dots of varying colour and size.[19]",
			"color": "wheat|0.5027 tan|0.37311  "
		}
	}
}
