{
	"add": {
		"doc": {
			"id": "237883823583014663c1aa5e715a51095b7e1d9fef36261a28777314467f052a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Hubble_Control_Centre.jpg/220px-Hubble_Control_Centre.jpg",
				"previous": "HST's guidance system can also be used as a scientific instrument. Its three Fine Guidance Sensors (FGS) are primarily used to keep the telescope accurately pointed during an observation, but can also be used to carry out extremely accurate astrometry; measurements accurate to within 0.0003 arcseconds have been achieved.[40]",
				"after": "The Space Telescope Science Institute (STScI) is responsible for the scientific operation of the telescope and the delivery of data products to astronomers. STScI is operated by the Association of Universities for Research in Astronomy (AURA) and is physically located in Baltimore, Maryland on the Homewood campus of Johns Hopkins University, one of the 39 US universities and seven international affiliates that make up the AURA consortium. STScI was established in 1981[41][42] after something of a power struggle between NASA and the scientific community at large. NASA had wanted to keep this function in-house, but scientists wanted it to be based in an academic establishment.[43][44] The Space Telescope European Coordinating Facility (ST-ECF), established at Garching bei München near Munich in 1984, provided similar support for European astronomers until 2011, when these activities were moved to the European Space Astronomy Centre.",
			"color": "black|0.56263 gray|0.075905 grey|0.075905 dim|0.069938 gray|0.069938 dim|0.069938 grey|0.069938 dark|0.030527 gray|0.030527 dark|0.030527 grey|0.030527 dark|0.018494 slate|0.018494 gray|0.018494 silver|0.017775 light|0.012382 gray|0.012382 light|0.012382 grey|0.012382 gainsboro|0.0095999 tan|0.0091765 floral|0.0082054 white|0.0082054 white|0.0081015 smoke|0.0081015 sea|0.0080344 shell|0.0080344 snow|0.0074027 linen|0.0072547 white|0.0071891  "
		}
	}
}
