{
	"add": {
		"doc": {
			"id": "2379adb4e0c40a070d182fad54d036567b646b832022561e724fdf5089bc8d21",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Prince_Albert_Victor%2C_Duke_of_Clarence_%281864-1892%29.jpg/220px-Prince_Albert_Victor%2C_Duke_of_Clarence_%281864-1892%29.jpg",
				"previous": "Oscar Wilde alluded to the scandal in The Picture of Dorian Gray, first published in 1890.[40] Reviews of the novel were hostile; in a clear reference to the Cleveland Street scandal, one reviewer called it suitable for \"none but outlawed noblemen and perverted telegraph boys\".[41][42][43] Wilde's 1891 revision of the novel omitted certain key passages, which were considered too homoerotic.[43][44] In 1895, Wilde unsuccessfully sued Lord Alfred's father, the Marquess of Queensberry, for libel. Sir Edward Carson, Lord Queensberry's counsel, used quotes from the novel against Wilde and questioned him about his associations with young working men.[45] After the failure of his suit, Wilde was charged with gross indecency, found guilty and subsequently sentenced to two years' hard labour. He was prosecuted by Charles Gill, who had defended Veck in the Cleveland Street case.[46]",
				"after": "Prince Albert Victor died in 1892, but society gossip about his sex life continued. Sixty years after the scandal the official biographer of King George V, Harold Nicolson, was told by Lord Goddard, who was a twelve-year-old schoolboy at the time of the scandal, that Prince Albert Victor \"had been involved in a male brothel scene, and that a solicitor had to commit perjury to clear him. The solicitor was struck off the rolls for his offence, but was thereafter reinstated.\"[47] In fact, none of the lawyers involved in the case was convicted of perjury or struck off at the time, indeed most had very distinguished careers. However, Arthur Newton was struck off for 12 months for professional misconduct in 1910 after falsifying letters from another of his clients—the notorious murderer Harvey Crippen.[48] In 1913, he was struck off indefinitely and sentenced to three years' imprisonment for obtaining money by false pretences.[49] Newton may have invented and spread the rumours about Prince Albert Victor in an attempt to protect his clients from prosecution by forcing a cover-up.[50] State papers on the case in the Public Record Office, released to the public in the 1970s, provide no information on the prince's involvement other than Newton's threat to implicate him.[51] Hamilton Cuffe wrote to the Director of Public Prosecutions, Sir Augustus Stephenson, \"I am told that Newton has boasted that if we go on a very distinguished person will be involved (PAV). I don't mean to say that I for one instant credit it—but in such circumstances as this one never knows what may be said, be concocted or be true.\"[52] Surviving private letters from Somerset to his friend Lord Esher, confirm that Somerset knew of the rumours but did not know if they were true. He writes, \"I can quite understand the Prince of Wales being much annoyed at his son's name being coupled with the thing ... we were both accused of going to this place but not together ... I wonder if it is really a fact or only an invention.\"[53] In his correspondence, Sir Dighton Probyn refers to \"cruel and unjust rumours with regard to PAV\" and \"false reports dragging PAV's name into the sad story\".[54] When Prince Albert Victor's name appeared in the American press, the New York Herald published an anonymous letter, almost certainly written by Charles Hall, saying \"there is not, and never was, the slightest excuse for mentioning the name of Prince Albert Victor.\"[55] Biographers who believe the rumours suppose that Prince Albert Victor was bisexual,[56] but this is strongly contested by others who refer to him as \"ardently heterosexual\" and his involvement in the rumours as \"somewhat unfair\".[57]",
			"color": " "
		}
	}
}
