{
	"add": {
		"doc": {
			"id": "237c952e8cac8521da4cf0eb06d60111cae501efc058c9f8a92ee9f829669bd4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/John_Davey_House.jpg/220px-John_Davey_House.jpg",
				"previous": "Kent is also home to the Kent State University Museum, located in Rockwell Hall on the KSU campus. The museum focuses on the history of fashion design and decorative arts in the United States and around the world from the 18th century to the present.[92] Each year in early May, the university hosts an annual commemoration of the Kent State shootings, which typically features several speakers, forums, artwork, and other related events.[93] On campus, Kent State operates the May 4 Visitors' Center, which covers the shootings and the events surrounding them. It is housed in Taylor Hall on the site added to the National Register of Historic Places in 2010 and includes three galleries covering art and media from the era of the 1960s leading up to the shootings, images from the actual event, and the local and national impact after the shootings. The center opened to the public October 20, 2012 during the Kent State Homecoming weekend.[94][95]",
				"after": "In addition to the Kent State Shootings Site near the center of campus, there are also a number of additional sites and districts in Kent on the National Register of Historic Places, some of which are open to the public. The Kent Industrial District is a historical district along the Cuyahoga River adjacent to downtown that includes an area and structures that were important in Kent's early history.[96] On the northwestern part of the Kent State University campus is the Ohio State Normal College At Kent district, which includes the school's five original classic revival buildings dating to 1913.[97] There is also the West Main Street District just west of downtown that includes 20 private homes of architectural and historical significance from the post-Civil War and early 20th century periods. The district includes the Kent Masonic Center, which was originally built in the early 1880s as the home of Marvin Kent and his family, and the former residence of Martin L. Davey, who served as Governor of Ohio.[98][99] Buildings in Kent listed on the register include three private homes noted for their architecture styles: the John Davey House for the Second Empire style, and both the Aaron Ferrey and Charles Kent Houses as examples of Gothic Revival.[100][101][102] Other buildings include the 1869 Kent Jail, now used by the Parks and Recreation Department, and the 1837 Franklin Township Hall, the site of eventual U.S. President James A. Garfield's first nomination for public office in 1859.[7][103] As part of its renovation and redevelopment, the former Franklin Hotel, first opened in 1920, was added to the NRHP in 2013 for its local historical significance and its connections to notable people.[104]",
			"color": "dark|0.30786 olive|0.30786 green|0.30786 olive|0.087349 drab|0.087349 pale|0.06388 golden|0.06388 rod|0.06388 rosy|0.052885 brown|0.052885 thistle|0.046206 dark|0.034464 gray|0.034464 dark|0.034464 grey|0.034464 gray|0.03299 grey|0.03299 dim|0.031678 gray|0.031678 dim|0.031678 grey|0.031678 khaki|0.023179 silver|0.022376 light|0.016749 gray|0.016749 light|0.016749 grey|0.016749 lemon|0.014633 chiffon|0.014633 dark|0.01403 khaki|0.01403 light|0.013893 golden|0.013893 rod|0.013893 yellow|0.013893 gainsboro|0.013274 linen|0.012675 sea|0.012357 shell|0.012357 floral|0.012194 white|0.012194 white|0.011653 smoke|0.011653 beige|0.011106 old|0.011049 lace|0.011049  "
		}
	}
}
