{
	"add": {
		"doc": {
			"id": "23a136621f9d475e21bccb58025de5b9aa3c671b68a9c339352fe7d168f2faba",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Bird_blink-edit.jpg/300px-Bird_blink-edit.jpg",
				"previous": "Birds have a very efficient system for diffusing oxygen into the blood; birds have a ten times greater surface area to gas exchange volume than mammals. As a result, birds have more blood in their capillaries per unit of volume of lung than a mammal.[74] The arteries are composed of thick elastic muscles to withstand the pressure of the ventricular constriction, and become more rigid as they move away from the heart. Blood moves through the arteries, which undergo vasoconstriction, and into arterioles which act as a transportation system to distribute primarily oxygen as well as nutrients to all tissues of the body.[75] As the arterioles move away from the heart and into individual organs and tissues they are further divided to increase surface area and slow blood flow. Travelling through the arterioles blood moves into the capillaries where gas exchange can occur. Capillaries are organized into capillary beds in tissues, it is here that blood exchanges oxygen for carbon dioxide waste. In the capillary beds blood flow is slowed to allow maximum diffusion of oxygen into the tissues. Once the blood has become deoxygenated it travels through venules then veins and back to the heart. Veins, unlike arteries, are thin and rigid as they do not need to withstand extreme pressure. As blood travels through the venules to the veins a funneling occurs called vasodilation bringing blood back to the heart.[75] Once the blood reaches the heart it moves first into the right atrium, then the right ventricle to be pumped through the lungs for further gas exchange of carbon dioxide waste for oxygen. Oxygenated blood then flows from the lungs through the left atrium to the left ventricle where it is pumped out to the body.",
			"after": [],
			"color": "silver|0.27277 light|0.21851 gray|0.21851 light|0.21851 grey|0.21851 gainsboro|0.168 dark|0.1623 gray|0.1623 dark|0.1623 grey|0.1623 dark|0.065806 khaki|0.065806 gray|0.065261 grey|0.065261 dim|0.019073 gray|0.019073 dim|0.019073 grey|0.019073 tan|0.0059274 slate|0.0054863 gray|0.0054863 white|0.0044192 smoke|0.0044192 light|0.0041691 slate|0.0041691 gray|0.0041691  "
		}
	}
}
