{
	"add": {
		"doc": {
			"id": "23b9887667c1e0dde76f6299b8ca2af4b94e107da19480d049a2c397f3bac5c5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Tacuinum_Sanitatis-cabbage_harvest.jpg/170px-Tacuinum_Sanitatis-cabbage_harvest.jpg",
			"previous": [],
				"after": "While grains were the primary constituent of most meals; vegetables such as cabbage, beets, onions, garlic and carrots were common foodstuffs. Many of these were eaten daily by peasants and workers, but were less prestigious than meat. The cookbooks, intended mostly for those who could afford such luxuries, which appeared in the late Middle Ages, contained only a small number of recipes using vegetables as the main ingredient. The lack of recipes for many basic vegetable dishes, such as potages, has been interpreted not to mean that they were absent from the meals of the nobility, but rather that they were considered so basic that they did not require recording.[51] Carrots were available in many variants during the Middle Ages: among them a tastier reddish-purple variety and a less prestigious green-yellow type. Various legumes, like chickpeas, fava beans and peas were also common and important sources of protein, especially among the lower classes. With the exception of peas, legumes were often viewed with some suspicion by the dietitians advising the upper class, partly because of their tendency to cause flatulence but also because they were associated with the coarse food of peasants. The importance of vegetables to the common people is illustrated by accounts from 16th-century Germany stating that many peasants ate sauerkraut from three to four times a day.[52]",
			"color": "tan|0.16523 burly|0.081656 wood|0.081656 dark|0.063505 salmon|0.063505 wheat|0.059478 dark|0.048146 khaki|0.048146 tomato|0.042664 black|0.036665 navajo|0.035267 white|0.035267 moccasin|0.032935 light|0.030055 slate|0.030055 gray|0.030055 dim|0.027564 gray|0.027564 dim|0.027564 grey|0.027564 peach|0.027126 puff|0.027126 bisque|0.025731 slate|0.023159 gray|0.023159 pale|0.023032 golden|0.023032 rod|0.023032 light|0.021927 salmon|0.021927 blanched|0.021205 almond|0.021205 gray|0.018074 grey|0.018074 lemon|0.017963 chiffon|0.017963 sienna|0.017816 light|0.01517 golden|0.01517 rod|0.01517 yellow|0.01517 papaya|0.014394 whip|0.014394 dark|0.013411 gray|0.013411 dark|0.013411 grey|0.013411 light|0.012627 steel|0.012627 blue|0.012627 corn|0.011754 silk|0.011754 coral|0.011481  "
		}
	}
}
