{
	"add": {
		"doc": {
			"id": "23c888c4d52f532b078b88097a20336530a0bee9b60cbcffaf8375816fee9f2a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Milestones-c119-N13745-070919-01-16.jpg/220px-Milestones-c119-N13745-070919-01-16.jpg",
				"previous": "Many C-119s were provided to other nations as part of the Military Assistance Program, including Belgium, Brazil, Ethiopia, India, Italy, Jordan, Taiwan, and (as previously mentioned) South Vietnam. The type was also used by the Royal Canadian Air Force, and by the United States Navy and United States Marine Corps under the designation R4Q until 1962 when they were also redesignated as C-119.",
				"after": "A number of aircraft were acquired by companies who were contracted by the United States Forest Service (USFS) and the Bureau of Land Management to provide airtankers for fighting wildfires. Others were pressed into civilian cargo service. After a series of crashes, the age and safety of the aircraft being used as airtankers became a serious concern, and the U.S. C-119 airtanker fleet was permanently grounded in 1987. Eventually, many of these aircraft were provided to museums across the U.S. in a complicated - and ultimately illegal - scheme where stored USAF Lockheed C-130 Hercules transports and Navy Lockheed P-3 Orion anti-submarine patrol aircraft were provided to the contractors in exchange for the C-119s.[8] (See U.S. Forest Service airtanker scandal.) After the end of the airtanker days, many C-119s flew in Alaska for Northern Pacific Transport, Gifford Aviation, Stebbins & Ambler Air transport, and Delta Associates, being used for public service contracts, such as hauling building materials to the villages in the bush of Alaska that have no road access.",
			"color": "light|0.37376 slate|0.37376 gray|0.37376 slate|0.18745 gray|0.18745 gray|0.093207 grey|0.093207 black|0.085384 dark|0.066735 gray|0.066735 dark|0.066735 grey|0.066735 dim|0.064429 gray|0.064429 dim|0.064429 grey|0.064429 silver|0.030814 light|0.020489 gray|0.020489 light|0.020489 grey|0.020489 gainsboro|0.015957 sienna|0.015062 tan|0.0085645  "
		}
	}
}
