{
	"add": {
		"doc": {
			"id": "23eaf292a77a754bf298b15bdd0f21a1b40b3427ae8e2f8849bd07a2aa167093",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Protein_folding.png/300px-Protein_folding.png",
			"previous": [],
				"after": "Proteins are an essential component to many biological functions and participate in virtually all processes within biological cells. They often act as enzymes, performing biochemical reactions including cell signaling, molecular transportation, and cellular regulation. As structural elements, some proteins act as a type of skeleton for cells, and as antibodies, while other proteins participate in the immune system. Before a protein can take on these roles, it must fold into a functional three-dimensional structure, a process that often occurs spontaneously and is dependent on interactions within its amino acid sequence and interactions of the amino acids with their surroundings. Protein folding is driven by the search to find the most energetically favorable conformation of the protein, i.e. its native state. Thus, understanding protein folding is critical to understanding what a protein does and how it works, and is considered a \"holy grail\" of computational biology.[11][12] Despite folding occurring within a crowded cellular environment, it typically proceeds smoothly. However, due to a protein's chemical properties or other factors, proteins may misfold — that is, fold down the wrong pathway and end up misshapen. Unless cellular mechanisms are capable of destroying or refolding such misfolded proteins, they can subsequently aggregate and cause a variety of debilitating diseases.[13] Laboratory experiments studying these processes can be limited in scope and atomic detail, leading scientists to use physics-based computational models that, when complementing experiments, seek to provide a more complete picture of protein folding, misfolding, and aggregation.[14][15]",
			"color": "lime|0.342 green|0.342 dark|0.21075 green|0.21075 forest|0.13858 green|0.13858 green|0.10286 white|0.014853 smoke|0.014853 ghost|0.014634 white|0.014634 alice|0.01462 blue|0.01462 sea|0.014608 shell|0.014608 snow|0.014598 white|0.014566 mint|0.014508 cream|0.014508 floral|0.013952 white|0.013952 azure|0.013827 black|0.013714 lavender|0.012699 blush|0.012699 gray|0.012516 grey|0.012516 light|0.0062338 green|0.0062338 dark|0.006074 gray|0.006074 dark|0.006074 grey|0.006074 dim|0.0059941 gray|0.0059941 dim|0.0059941 grey|0.0059941 silver|0.0053387 light|0.0049159 gray|0.0049159 light|0.0049159 grey|0.0049159  "
		}
	}
}
