{
	"add": {
		"doc": {
			"id": "243915dab071f930609d95ffba0b7f4f31d3537546ec17017e89f02431b45880",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Philippine_Airlines_Boeing_747-200%3B_N743PR%40FRA%3B28.12.1995_%286168990807%29.jpg/220px-Philippine_Airlines_Boeing_747-200%3B_N743PR%40FRA%3B28.12.1995_%286168990807%29.jpg",
				"previous": "In 2004, PAL launched services to Las Vegas to mark its 63rd year of service. PAL also returned to Laoag and started services to Macau on codeshare with Air Macau. In that same year, the PAL entered into code share agreements with Air France and KLM Royal Dutch Airlines for services to Paris and Amsterdam, respectively.[23] Code share service to Paris was cut due to the merging of the two European airlines and the formation of Air France-KLM. Service to Amsterdam remained, operated by KLM. PAL also continued an overhaul of its fleet with the arrival of two new Airbus A320-214s and continued modernizing its ticketing systems with the launch of electronic ticketing. For the first time in Philippine history, the airline flew President-elect Gloria Macapagal-Arroyo and Vice-President-elect Noli de Castro to their inauguration in Cebu City. Arroyo rode a chartered PAL Airbus A330-300, while de Castro was aboard a separate Airbus A320-200.",
				"after": "In March 2005, PAL started services to Nagoya and restored scheduled flights to Beijing after a 15-year hiatus. In response to rival Cebu Pacific's increasing domestic market share, mainly due to its massive re-fleeting program[24] and its own aging Boeing 737 fleet, PAL signed an agreement for the purchase and lease of up to 18 Airbus A319-112s and A320-214s from Airbus and GE Capital Aviation Services (GECAS) on December 6, 2005.",
			"color": "light|0.15683 steel|0.15683 blue|0.15683 dark|0.099433 gray|0.099433 dark|0.099433 grey|0.099433 gray|0.092992 grey|0.092992 antique|0.089761 white|0.089761 bisque|0.072193 dim|0.057947 gray|0.057947 dim|0.057947 grey|0.057947 peach|0.049008 puff|0.049008 tan|0.047575 blanched|0.046266 almond|0.046266 silver|0.037014 papaya|0.034979 whip|0.034979 misty|0.027848 rose|0.027848 light|0.023929 gray|0.023929 light|0.023929 grey|0.023929 wheat|0.022907 lavender|0.020464 light|0.017664 slate|0.017664 gray|0.017664 gainsboro|0.013944 slate|0.013551 gray|0.013551 linen|0.011322 old|0.0075741 lace|0.0075741 moccasin|0.0067888 corn|0.0052165 silk|0.0052165 navajo|0.0045092 white|0.0045092 black|0.0040113  "
		}
	}
}
