{
	"add": {
		"doc": {
			"id": "243a27410cb1842bb59f6aa9af6f34b1f592cb9a827b25d3bdf5be6bca19d339",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Bullfrog_Special_Map_1906.jpg/220px-Bullfrog_Special_Map_1906.jpg",
				"previous": "By 1907, about 4,000 people lived in Rhyolite, according to Richard E. Lingenfelter in Death Valley & the Amargosa: A Land of Illusion.[34] Russell R. Elliott cites an estimated population of 5,000 in 1907–08 in Nevada's Twentieth-Century Mining Boom, noting that \"accurate population figures during the boom are impossible to obtain\".[35] Alan H. Patera in Rhyolite: The Boom Years states published estimates of the peak population have been \"as high as 6,000 or 8,000, but the town itself never claimed more than 3,500 through its newspapers\".[36] The newspapers estimated that 6,000 people lived in the Bullfrog mining district, which included the towns of Rhyolite, Bullfrog, Gold Center, and Beatty as well as camps at the major mines.[36]",
				"after": "Rhyolite in 1907 had concrete sidewalks, electric lights, water mains, telephone and telegraph lines, daily and weekly newspapers, a monthly magazine, police and fire departments, a hospital, school, train station and railway depot, at least three banks, a stock exchange, an opera house, a public swimming pool and two formal church buildings. Most prominent was the three-story John S. Cook and Co. Bank on Golden Street. Finished in 1908, it cost more than $90,000,[34] equivalent to $2,360,000 in 2015.[27] Much of the cost went for Italian marble stairs, imported stained-glass windows, and other luxuries. The building housed brokerage offices, and a post office, as well as the bank. Other large buildings included the train depot, the three-story Overbury Block, and the two-story eight-room school. A miner named Tom T. Kelly built the Bottle House in February 1906 from 50,000 discarded beer and liquor bottles.[34] Another building housed the Rhyolite Mining Stock Exchange, which opened on March 25, 1907, with 125 members, including brokers from New York, Philadelphia, Los Angeles, and other large cities. The small, modestly equipped storefront listed shares of 74 Bullfrog companies and a similar number of companies in nearby mining districts. Sixty thousand shares changed hands on the first day, and by the end of the second week the number had topped 750,000.[37]",
			"color": "wheat|0.45184 tan|0.45172 bisque|0.062193 blanched|0.024671 almond|0.024671 papaya|0.0042542 whip|0.0042542  "
		}
	}
}
