{
	"add": {
		"doc": {
			"id": "243e06e0b3f834ca69f4cd9bfdc7076402a89294312022ac6ca7a135d1b5975a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Pfluger.jpg/220px-Pfluger.jpg",
				"previous": "In 1998, the Board of Regents of the Texas Tech University System created the Texas Tech University Public Art Collection to enliven the campus environment and extend the educational mission of the university. It is funded by using one percent of the estimated total cost of each new building on campus.[119] The collection features pieces from artists such as Tom Otterness and Glenna Goodacre. The Texas Tech University Public Art Collection is ranked among the ten best university public art collections in the United States by Public Art Review.[120][121]",
				"after": "The university also hosts the Museum of Texas Tech University, which was founded in 1929 and is accredited by the American Alliance of Museums.[122] The museum is home to over three million objects and specimens and houses the Moody Planetarium, art galleries, a sculpture court, and a natural science research laboratory. The museum also operates the Val Verde County research site and the Lubbock Lake Landmark,[123] an archaeological site and natural history preserve in the city of Lubbock. The site has evidence of 12,000 years of use by ancient cultures on the Llano Estacado (Southern High Plains), and allows visitors to watch active archaeological digs. Visiting scientists and tourists may also participate in the discovery process. Lubbock Lake Landmark is a National Historic Landmark, which lists it on the National Register of Historic Places, and is a designated State Archaeological Landmark.[124] Texas Tech is also the location of the Southwest Collection of historical archives and the sponsoring institution of the West Texas Historical Association.[125] Located on the northern edge of the campus is the National Ranching Heritage Center, a museum of ranching history. The site spans 27.5 acres (0.111 km2) and is home to 38 historic structures that have been restored to their original condition. Structures represented at the center include: a linecamp, a dugout, a bunkhouse, a blacksmith shop, a cowchip house, a schoolhouse, corrals, shipping pens, windmills, chuckwagons, and a coal-burning locomotive.[126]",
			"color": "light|0.71919 steel|0.71919 blue|0.71919 light|0.073673 blue|0.073673 black|0.05086 silver|0.028208 dark|0.026797 gray|0.026797 dark|0.026797 grey|0.026797 dim|0.025837 gray|0.025837 dim|0.025837 grey|0.025837 gray|0.02055 grey|0.02055 light|0.019491 gray|0.019491 light|0.019491 grey|0.019491 gainsboro|0.009651  "
		}
	}
}
