{
	"add": {
		"doc": {
			"id": "244403139adeab73d346606bbf3cea74e1462e1937c184b7e1a040fd12a28374",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Ceratophrys_cornuta_skeleton_front.jpg/220px-Ceratophrys_cornuta_skeleton_front.jpg",
				"previous": "Amphibians have a skeletal system that is structurally homologous to other tetrapods, though with a number of variations. They all have four limbs except for the legless caecilians and a few species of salamander with reduced or no limbs. The bones are hollow and lightweight. The musculoskeletal system is strong to enable it to support the head and body. The bones are fully ossified and the vertebrae interlock with each other by means of overlapping processes. The pectoral girdle is supported by muscle, and the well-developed pelvic girdle is attached to the backbone by a pair of sacral ribs. The ilium slopes forward and the body is held closer to the ground than is the case in mammals.[54]",
				"after": "In most amphibians, there are four digits on the fore foot and five on the hind foot, but no claws on either. Some salamanders have fewer digits and the amphiumas are eel-like in appearance with tiny, stubby legs. The sirens are aquatic salamanders with stumpy forelimbs and no hind limbs. The caecilians are limbless. They burrow in the manner of earthworms with zones of muscle contractions moving along the body. On the surface of the ground or in water they move by undulating their body from side to side.[55]",
			"color": "tan|0.30512 antique|0.071827 white|0.071827 dim|0.070384 gray|0.070384 dim|0.070384 grey|0.070384 linen|0.041134 papaya|0.038664 whip|0.038664 old|0.037955 lace|0.037955 blanched|0.033308 almond|0.033308 dark|0.031087 gray|0.031087 dark|0.031087 grey|0.031087 beige|0.03093 sea|0.026715 shell|0.026715 floral|0.026127 white|0.026127 silver|0.025512 bisque|0.025223 wheat|0.023723 light|0.023071 gray|0.023071 light|0.023071 grey|0.023071 gray|0.022937 grey|0.022937 corn|0.021668 silk|0.021668 gainsboro|0.020902 ivory|0.020294 white|0.014053 smoke|0.014053 burly|0.011827 wood|0.011827 black|0.010934 snow|0.01065  "
		}
	}
}
