{
	"add": {
		"doc": {
			"id": "24557770d4c051a7297e1dbec3fd6202965b076651544088065365851d9b6e30",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Noisy-Miner4.jpg/170px-Noisy-Miner4.jpg",
			"previous": [],
				"after": "The noisy miner engages in most activities in a group. Roosting, foraging, preening, bathing and dust-bathing or anting are communal activities. Dawn song is a communal chorus, particularly during the breeding season. The communal interaction is facilitated by ritualised displays that have been categorised as flight displays, postural displays, and facial displays. In 'long flight' displays, initiated by either male or female birds, groups of up to twenty birds from more than one coterie fly about 40 metres (130 ft) above the canopy for distances of up to 1.5 kilometres (0.93 mi) from the colony, constantly calling and not returning to the colony for about twenty minutes. As they return the remaining birds show signs of agitation, and sometimes fly up to join them. The 'short flight' display is performed by the male, and may be analogous to the territorial advertising displays of other birds. In a ritualised movement, the noisy miner flies out from a perch across an open area, in a rhythmic undulating pattern, usually calling in flight. At the end of the clearing it turns on an upward swoop and flies silently back to a perch near the starting point. The 'head-up flight' is performed by the female during the nesting period, and may function to attract male helpers. In its most intense form the body and tail are held almost vertically, with legs dangling and the head held up and back. It is performed by the female when she is selecting the nest site, and when carrying nest-building material, and probably has the function of indicating the location of the nest to other group members.[43]",
			"color": "dark|0.28578 gray|0.28578 dark|0.28578 grey|0.28578 silver|0.18841 gray|0.18438 grey|0.18438 dim|0.14359 gray|0.14359 dim|0.14359 grey|0.14359 light|0.070106 gray|0.070106 light|0.070106 grey|0.070106 gainsboro|0.033731 rosy|0.016907 brown|0.016907 dark|0.015516 olive|0.015516 green|0.015516 black|0.013247  "
		}
	}
}
