{
	"add": {
		"doc": {
			"id": "24691b90fa81ab6ac20ef734bacee7bf495b85c1f298e069c4f3f51f1224e158",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Thylacine-chicken.png/220px-Thylacine-chicken.png",
			"previous": [],
				"after": "Although the thylacine was extinct on mainland Australia, it survived into the 1930s on the island state of Tasmania. At the time of the first settlement, the heaviest distributions were in the northeast, northwest and north-midland regions of the state.[39] They were rarely sighted during this time but slowly began to be credited with numerous attacks on sheep. This led to the establishment of bounty schemes in an attempt to control their numbers. The Van Diemen's Land Company introduced bounties on the thylacine from as early as 1830, and between 1888 and 1909 the Tasmanian government paid £1 per head. (Current value today, after inflation and introduction of decimal currency: $132.29) for dead adult thylacines and ten shillings for pups. In all they paid out 2,184 bounties, but it is thought that many more thylacines were killed than were claimed for.[34] Its extinction is popularly attributed to these relentless efforts by farmers and bounty hunters.[34] However, it is likely that multiple factors led to its decline and eventual extinction, including competition with wild dogs introduced by European settlers,[70] erosion of its habitat, the concurrent extinction of prey species, and a distemper-like disease that also affected many captive specimens at the time.[28][71] Whatever the reason, the animal had become extremely rare in the wild by the late 1920s. Despite the fact that the thylacine was believed by many to be responsible for attacks on sheep, in 1928 the Tasmanian Advisory Committee for Native Fauna recommended a reserve to protect any remaining thylacines, with potential sites of suitable habitat including the Arthur-Pieman area of western Tasmania.[72]",
			"color": "dark|0.21243 gray|0.21243 dark|0.21243 grey|0.21243 silver|0.16746 gray|0.13279 grey|0.13279 light|0.13181 gray|0.13181 light|0.13181 grey|0.13181 gainsboro|0.10748 dim|0.082687 gray|0.082687 dim|0.082687 grey|0.082687 white|0.031648 smoke|0.031648 lavender|0.018039 blush|0.018039 linen|0.018027 alice|0.017659 blue|0.017659 ghost|0.017146 white|0.017146 sea|0.0165 shell|0.0165 snow|0.016055 white|0.01288 mint|0.009368 cream|0.009368 floral|0.0049367 white|0.0049367 azure|0.002845  "
		}
	}
}
