{
	"add": {
		"doc": {
			"id": "248dd753bd8e0f99093645dd074ba36a185e613973a3a81bf129f1b0d80fea0f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/The1967greenbag.jpg/220px-The1967greenbag.jpg",
				"previous": "On October 2, 2007, the Weill Institute of Music at Carnegie Hall announced that the City College choir was one of four high school choirs selected to participate in the National High School Choral Festival on March 10, 2008. The four choirs will perform Johannes Brahms' A German Requiem under the direction of Craig Jessop, Mormon Tabernacle Choir Director. The choirs will also be led by their own directors in performing choral selections of their choosing.[101]",
				"after": "The Green Bag is the senior class annual at the Baltimore City College. Published continuously since 1896, The Green Bag is the oldest publication still in existence at the school and one of the oldest high school or college yearbooks in America.[102] G. Warfield Hobbs Jr. (later an Episcopal priest), president of the 1896 senior class and first editor-in-chief of The Green Bag, gave the publication its name in recognition of the role of City College graduates in political leadership. Historically, the famous green \"carpet bag\" in the 19th century containing the lists of political appointees (also known as \"patronage\") of the Governor of Maryland to be approved by the General Assembly of Maryland has long been known as the \"green bag\", though the derivation of the term is unknown. So the term became synanmous with \"good news\" and \"glad tidings\", such as could be applied to the feelings that recent graduates felt when seeing and reading their new yearbooks published soon after their graduations.[103] The first yearbooks contained sketches of faculty and seniors, and included recollections, anecdotes, stories, and quotes significant to the student body. Underclassmen were included for the first time with individual portraits in the growing student body in 1948. In 2007, The Green Bag released its first full-color edition, one of the most colorful since color printing of photographs was first introduced in The Bag in 1963 and again in 1967. For many years the annual was printed by the local well-known printer/publisher of H.G. Roebuck and Son, owned by a B.C.C. alumnus up to 1970[104]",
			"color": "dim|0.53603 gray|0.53603 dim|0.53603 grey|0.53603 gray|0.33408 grey|0.33408 dark|0.084358 gray|0.084358 dark|0.084358 grey|0.084358 silver|0.022533 black|0.0061453 light|0.0056983 gray|0.0056983 light|0.0056983 grey|0.0056983  "
		}
	}
}
