{
	"add": {
		"doc": {
			"id": "248f729882701c6fb4dc8283d5ded41e966ba06f99db8e30ece639ad2514288b",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d9/Guangara_Libertaria_cover.jpg/220px-Guangara_Libertaria_cover.jpg",
			"previous": [],
				"after": "Beginning in mid–1960, but greatly accelerating in the summer of 1961, great numbers of Cuban anarchists migrated to the United States. That summer, in New York, the Movimiento Libertario Cubano en el Exilio (Cuban Anarchist Movement in Exile [MLCE]) was formed by some of these exiles, making contact with Spanish anarchists exiled following the Spanish Civil War, who were also living in New York. They also made contact with Sam Dolgoff and the New York-based Libertarian League. Very quickly, donations to exiled Cuban anarchists were collected from around the world. However, donations soon dried up following the publishing of the Gaona manifesto, as many anarchists in other countries were swayed by the arguments in the document.[clarification needed] In response to the widespread effect of the manifesto, the MLCE issued the Boletín de Información Libertaria with support from the Libertarian League, and the paper of the Federación Libertaria Argentina (FLA).[5] Among many others, the FLA printed an essay by Abelardo Iglesias titled Revolución y Contrarevolución which stated the differences the Cuban anarchists saw between Marxist and anarchist revolution: \"To expropriate capitalist enterprises, handing them over to the workers and technicians, THIS IS REVOLUTION. But to convert them into state monopolies in which the only right of the producer is to obey, THIS IS COUNTER-REVOLUTION.\"[10]",
			"color": "peach|0.24563 puff|0.24563 bisque|0.14848 tan|0.13243 antique|0.099894 white|0.099894 blanched|0.086128 almond|0.086128 papaya|0.067586 whip|0.067586 misty|0.038334 rose|0.038334 linen|0.028048 old|0.020403 lace|0.020403 black|0.018951 wheat|0.014776 burly|0.012315 wood|0.012315 dark|0.0088378 gray|0.0088378 dark|0.0088378 grey|0.0088378 corn|0.0081731 silk|0.0081731 rosy|0.0079521 brown|0.0079521 gray|0.0079521 grey|0.0079521 dim|0.0076734 gray|0.0076734 dim|0.0076734 grey|0.0076734 sea|0.0069937 shell|0.0069937 silver|0.0066206 beige|0.0064725 floral|0.0042217 white|0.0042217 light|0.0041765 gray|0.0041765 light|0.0041765 grey|0.0041765  "
		}
	}
}
