{
	"add": {
		"doc": {
			"id": "249163bf229800d8dddb951ae8fb384b71d8596e940c2522d1a2673c22a5ec2c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Numbered_condor.jpg/220px-Numbered_condor.jpg",
				"previous": "The eggs hatch after 53 to 60 days of incubation by both parents. Chicks are born with their eyes open and sometimes can take up to a week to leave the shell completely.[21] The young are covered with a grayish down until they are almost as large as their parents. They are able to fly after five to six months, but continue to roost and forage with their parents until they are in their second year, at which point the parents typically turn their energies to a new nest.[19] Ravens are the main predatory threat to condor eggs, while golden eagles and bears are potential predators of condor offspring.",
				"after": "In modern times, a wide variety of causes have contributed to the condor's decline. Its low clutch size (one young per nest), combined with a late age of sexual maturity, make the bird vulnerable to artificial population decline. Significant past damage to the condor population has also been attributed to poaching, especially for museum specimens,[45] lead poisoning (from eating animals containing lead shot),[46] DDT poisoning,[47] electric power lines, egg collecting, and habitat destruction. During the California Gold Rush, some condors were even kept as pets.[48] The leading cause of mortality in nestling condors is the ingestion of trash that is fed to them by their parents.[49]",
			"color": "black|0.64382 dim|0.098861 gray|0.098861 dim|0.098861 grey|0.098861 gray|0.032156 grey|0.032156 dark|0.018427 gray|0.018427 dark|0.018427 grey|0.018427 white|0.015058 smoke|0.015058 sea|0.013963 shell|0.013963 snow|0.013656 silver|0.013465 light|0.013175 gray|0.013175 light|0.013175 grey|0.013175 floral|0.012924 white|0.012924 white|0.012644 mint|0.012233 cream|0.012233 gainsboro|0.011738 ghost|0.011063 white|0.011063 slate|0.0097682 gray|0.0097682 azure|0.0094412 linen|0.00937 alice|0.009229 blue|0.009229 lavender|0.0069266 blush|0.0069266 light|0.0066739 slate|0.0066739 gray|0.0066739 ivory|0.0057241 old|0.0046228 lace|0.0046228  "
		}
	}
}
