{
	"add": {
		"doc": {
			"id": "249714b1bcba351af2a313ff9d61102b86385ec16b995b7c2cd691bc8f3fbf68",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Arctic_Monkeys_Orange_RF07.jpg/220px-Arctic_Monkeys_Orange_RF07.jpg",
				"previous": "The county has some successful bands such as Black Dyke, Brighouse & Rastrick, Yorkshire Imperial, Yorkshire Building Society, and Carlton Main Frickley. Historically the bands evolved around the mines, mills and steel works in the county but the demise of these industries has meant that the bands are now professional ensembles in their own right.[citation needed] Although brass is still considered by many in the UK to be a niche form of music, its popularity has increased overseas and UK bands often perform in Europe, Australia, the Far East and the US.[citation needed]",
				"after": "During the 1970s David Bowie, himself of a father from Tadcaster in North Yorkshire,[173] hired three musicians from Hull Mick Ronson, Trevor Bolder and Mick Woodmansey; together they recorded Ziggy Stardust and the Spiders from Mars, an album considered by a magazine article as one of a 100 greatest and most influential of all time.[174] In the following decade, Def Leppard, from Sheffield achieved worldwide fame, particularly in America. Their 1983 album, Pyromania (album) and 1987 album, Hysteria (Def Leppard album) became one of the most successful albums of all time. Yorkshire had a very strong post-punk scene which went on to achieve widespread acclaim and success, including; The Sisters of Mercy, The Cult, Vardis, Gang of Four, ABC, The Human League, New Model Army, Soft Cell, Chumbawamba, The Wedding Present and The Mission.[175] Pulp from Sheffield had a massive hit in the form of Common People during 1995, the song focuses on working-class northern life.[176] The 21st century saw popularity of indie rock and post-punk revival bands from the area with the Kaiser Chiefs, The Cribs and the Arctic Monkeys, the latter of whom hold the record for the fastest-selling debut album in British music history with Whatever People Say I Am, That's What I'm Not.[177] Also, the indie rock band One Night Only come from the village Helmsley.",
			"color": "black|0.31549 firebrick|0.26937 brown|0.089863 dim|0.041171 gray|0.041171 dim|0.041171 grey|0.041171 slate|0.030802 gray|0.030802 dark|0.0277 gray|0.0277 dark|0.0277 grey|0.0277 gray|0.025501 grey|0.025501 light|0.022209 slate|0.022209 gray|0.022209 silver|0.019353 crimson|0.019334 light|0.012864 steel|0.012864 blue|0.012864 lavender|0.012836 light|0.012477 gray|0.012477 light|0.012477 grey|0.012477 rosy|0.011487 brown|0.011487 thistle|0.011316  "
		}
	}
}
