{
	"add": {
		"doc": {
			"id": "249a9045e99cb9689ec3a021857cd614d461f4cc7f8a6c0c634c9cf9122f1159",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Bing_Crosby_star_HWF.JPG/220px-Bing_Crosby_star_HWF.JPG",
				"previous": "On October 13, 1977 Crosby flew alone to Spain to play golf and hunt partridge.[68] On October 14, 1977 at the La Moraleja Golf Course near Madrid, Crosby played eighteen holes of golf. His partner was World Cup champion Manuel Piñero; their opponents were club president Cesar de Zulueta and Valentin Barrios.[68] According to Barrios, Crosby was in good spirits throughout the day, and was photographed several times during the round.[68][69] At the ninth hole, construction workers building a house nearby recognized him, and when asked for a song, Crosby sang \"Strangers in the Night\".[68] Crosby, who had a 13 handicap, and his partner won by one stroke.[68] As Crosby and his party headed back to the clubhouse, Crosby said, \"That was a great game of golf, fellas.\"[68] At about 6:30 pm, Crosby collapsed about 20 yards from the clubhouse entrance and died instantly from a massive heart attack.[68] At the clubhouse and later in the ambulance, house physician Dr. Laiseca tried to revive him, but was unsuccessful. At Reina Victoria Hospital he was administered the last rites of the Catholic Church and was pronounced dead.[68] On October 18, following a private funeral mass at St. Paul's Catholic Church in Westwood,[70] Crosby was buried at Holy Cross Cemetery in Culver City, California.[71][72]",
			"after": [
				"He is a member of the National Association of Broadcasters Hall of Fame in the radio division.[73]",
				"The family launched an official website[74] on October 14, 2007, the 30th anniversary of Crosby's death."
			],
			"color": "black|0.401 dark|0.18319 gray|0.18319 dark|0.18319 grey|0.18319 gray|0.1371 grey|0.1371 rosy|0.096468 brown|0.096468 silver|0.057427 dim|0.053161 gray|0.053161 dim|0.053161 grey|0.053161 light|0.017392 gray|0.017392 light|0.017392 grey|0.017392 tan|0.015312 gainsboro|0.0069445  "
		}
	}
}
