{
	"add": {
		"doc": {
			"id": "24a3235ec49cdfe760f9a88412ab4b82b4bb8de5a278cfdfd91772b98b757d1f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Tower_House_dining_room.jpg/220px-Tower_House_dining_room.jpg",
				"previous": "The library, its walls lined with bookcases,[46] features a sculptured mantelpiece resembling the Tower of Babel. The hooded chimneypiece represents the \"dispersion of languages\", with figures depicting Nimrod ruling over the elements of speech.[38] Two trumpeters represent the pronouns, a queen embodies the verb, a porter the noun, and numerous other gilded and painted figures are displayed. The ceiling is divided into eight compartments, with depictions of the six founders of law and philosophy, Moses, St. Paul, Luther, Mahomet, Aristotle and Justinian.[40] An illuminated alphabet frieze of architecture and the visual arts running around the bookcases completes the scheme, with the letters of the alphabet incorporated, including a letter \"H\" falling below the cornice.[40] Due to H-dropping being a social taboo in Victorian times, Handley-Read described it as the \"most celebrated of all Burges's jokes\".[47] Artists and craftsmen are featured at work on each lettered door of the bookcases that surround the room.[7] In a panel in one of the glazed doors which open onto the garden, Burges is shown standing in front of a model of the Tower House.[48] He features as Architect, the A forming the first letter of the alphabet frieze. Both the Architecture Cabinet and the Great Bookcase stood in this room.[49] The stained glass windows in the room represent painting, architecture and sculpture, and were painted by Weekes.",
				"after": "On the wall opposite the library fireplace is an opening into the drawing room. Inside there are three stained glass windows which are set in ornamented marble linings.[7] Opposite the windows stood the Zodiac Settle,[50] which Burges moved from Buckingham Street. Love is the central decorative scheme to the room,[7] with the ceiling painted with medieval cupids, and the walls covered with mythical lovers.[46] Carved figures from the Roman de la Rose decorate the chimneypiece,[7] which Crook considered \"one of the most glorious that Burges and Nicholls ever produced\".[51] Echoing Crook, Charles Handley-Read wrote, \"Working together, Burges and Nicholls had transposed a poem into sculpture with a delicacy that is very nearly musical. The Roman de la Rose has come to life.\"[52]",
			"color": " "
		}
	}
}
