{
	"add": {
		"doc": {
			"id": "24bc7489fb783c139183f0f33ab7e29f5e997cd67a20bf84bfa7a2ce6d21afe7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/BadgeAKA2.jpg/150px-BadgeAKA2.jpg",
				"previous": "Alpha Kappa Alpha continued to grow at Howard. By the end of the 1911–12 school year, there were more than twenty members of the sorority and the organization had become an influential part of student life at Howard.[18] Following the annual celebration \"Ivy Day\" on Howard campus in Spring 1912, founder and former Basileus Nellie Quander learned that several other newly initiated members of the sorority planned to change the colors, letters, and constitution of the sorority, and to make it more active outside Howard University. On January 13, 1913, the entire twenty-two-member undergraduate chapter voted to transform the original Alpha Kappa Alpha into Delta Sigma Theta. Quander actively worked to maintain the integrity and tenets of Alpha Kappa Alpha. She, along with the women who had become ΑΚΑs during the four years of the sorority's existence who had since graduated, elected to remain Alpha Kappa Alpha. Quander set up a three-person committee that successfully petitioned to incorporate ΑΚΑ as a perpetual entity. Alpha Kappa Alpha was nationally incorporated on January 29, 1913.[19]",
				"after": "Alpha Kappa Alpha continued to grow nationally. A second chapter at the University of Chicago was chartered in fall 1913.[21] The sorority played an active role in voicing concerns of the day. The women, former members who started Delta Sigma Theta, participated in the 1913 Women's Suffrage March.[22] In addition, Alpha Kappa Alpha helped to support members by providing scholarship funds for school and foreign studies.[23] Alpha Kappa Alpha began to unite members at the annual Boulé, the sorority's governing body.[1] The sorority's pledge was written by Grace Edwards and was adopted by the 1920 Boulé.[24] In addition, the sorority's crest was designed by Phyllis Wheatley Waters and accepted in the same Boulé.[24] A year later, at the 1921 Boulé, the Ivy Leaf was designated as \"the official organ of Alpha Kappa Alpha,\" and Founders' Week, paying honor to ΆKΆ's founders was established.[24][25] Pearls were first introduced to the sorority in the same year.[24] The sorority membership pin was accepted in the following Boulé in Kansas City, Missouri.[26] At the 1947 Boulé, pins for honorary members were designed and approved.[27]",
			"color": "tan|0.72409 wheat|0.11641 black|0.10291  "
		}
	}
}
