{
	"add": {
		"doc": {
			"id": "24d4072a8e5bbd7b3faf0bb9ddc2401f2a8770ac69423bbfb29b9c138000f22f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Nashorn.medici.jpg/220px-Nashorn.medici.jpg",
				"previous": "A second woodcut was executed by Hans Burgkmair in Augsburg around the same time as Dürer's in Nuremberg. Burgkmair corresponded with merchants in Lisbon and Nuremberg, but it is not clear whether he had access to a letter or sketch as Dürer did, perhaps even Dürer's sources, or saw the animal himself in Portugal.[30] His image is truer to life, omitting Dürer's more fanciful additions and including the shackles and chain used to restrain the rhinoceros;[30] however, Dürer's woodcut is more powerful and eclipsed Burgkmair's in popularity. Only one impression (example) of Burgkmair's image has survived,[31] whereas Dürer's print survives in many impressions. Dürer produced a first edition of his woodcut in 1515, in the first state, which is distinguished by only five lines of text in the heading,[10] and many further printings followed after Dürer's death in 1528, including two printings in the 1540s, and a further two in the late 16th century.[32] Later printings have six lines of descriptive text.[10] A tone block was created around 1620 to create a chiaroscuro woodcut in two tones, (seen in the printing by Willem Janssen in Amsterdam).[32][33] The original woodblock continued to be used, even though later printings are marred by woodworm holes and a crack through the rhino's legs.[34]",
				"after": "Despite its errors, the image remained very popular,[5] and was taken to be an accurate representation of a rhinoceros until the late 18th century. Dürer may have anticipated this and deliberately chosen to create a woodcut, rather than a more refined and detailed engraving, as this was cheaper to produce and more copies could be printed.[34] Images derived from it were included in naturalist texts, including Sebastian Münster's Cosmographiae (1544), Conrad Gessner's Historiae Animalium (1551), Edward Topsell's Histoire of Foure-footed Beastes (1607) and many others. A rhinoceros that was clearly based on Dürer's woodcut was chosen by Alessandro de' Medici as his emblem in June 1536, with the motto \"Non vuelvo sin vencer\" (old Spanish for \"I shall not return without victory\").[35] A sculpture of a rhinoceros based on Dürer's image was placed at the base of a 70-foot (21 m) high obelisk designed by Jean Goujon and erected in front of the Church of the Sepulchre in the rue Saint-Denis in Paris in 1549 for the royal entry welcoming the arrival of the new King of France, Henry II.[36] A similar rhinoceros, in relief, decorates a panel in one of the bronze west doors of Pisa Cathedral. The rhinoceros was depicted in numerous other paintings and sculptures, and became a popular decoration for porcelain. The popularity of the inaccurate Dürer image remained undiminished despite an Indian rhinoceros spending eight years in Madrid from 1580 to 1588 (although a few examples of a print of the Madrid rhinoceros sketched by Philippe Galle in Antwerp in 1586, and derivative works, have survived), and the exhibition of a live rhinoceros in London a century later, from 1684–86, and of a second individual after 1739.[37]",
			"color": "dim|0.16596 gray|0.16596 dim|0.16596 grey|0.16596 gray|0.14788 grey|0.14788 dark|0.11943 gray|0.11943 dark|0.11943 grey|0.11943 silver|0.06264 white|0.045441 smoke|0.045441 sea|0.044355 shell|0.044355 linen|0.042988 floral|0.042949 white|0.042949 snow|0.042374 light|0.041726 gray|0.041726 light|0.041726 grey|0.041726 mint|0.041111 cream|0.041111 white|0.040702 ivory|0.037369 old|0.031974 lace|0.031974 gainsboro|0.031852 azure|0.026785 ghost|0.020074 white|0.020074 honeydew|0.005076 lavender|0.0037306 blush|0.0037306  "
		}
	}
}
