{
	"add": {
		"doc": {
			"id": "24fce0a29c9ea3191df4a06b42aa045c84e9fdbc49a2e8884ffdddf2a13c3950",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Living_Legends.jpg/220px-Living_Legends.jpg",
			"previous": [],
				"after": "The B-17 began operations in World War II with the Royal Air Force (RAF) in 1941 (but was not successful), and in the Southwest Pacific with the U.S. Army. The 19th Bombardment Group had deployed to Clark Field in the Philippines a few weeks before the Japanese attack on Pearl Harbor as the first of a planned heavy bomber buildup in the Pacific. Half of the group's B-17s were wiped out on 8 December 1941 when they were caught on the ground during refueling and rearming for a planned attack on Japanese airfields on Formosa. The small force of B-17s operated against the Japanese invasion force until they were withdrawn to Darwin, in Australia's Northern Territory. In early 1942, the 7th Bombardment Group began arriving in Java with a mixed force of B-17s and LB-30/B-24s.[69] A squadron of B-17 from this force detached to the Middle East to join the First Provisional Bombardment Group thus becoming the first American B-17 squadron to go to war against the Germans.[citation needed] After the defeat in Java, the 19th withdrew to Australia where it continued in combat until it was sent back home by Gen. George C. Kenney when he arrived in Australia in mid-1942.[70] In July 1942, the first USAAF B-17s were sent to England to join Eighth Air Force. Later that year two groups moved to Algeria to join Twelfth Air Force for operations in North Africa. The B-17s were primarily involved in the daylight precision strategic bombing campaign against German targets ranging from U-boat pens, docks, warehouses and airfields to industrial targets such as aircraft factories.[71] In the campaign against German aircraft forces in preparation for the invasion of France, B-17 and B-24 raids were directed against German aircraft production while their presence drew the Luftwaffe fighters into battle with Allied fighters.[7]",
			"color": " "
		}
	}
}
