{
	"add": {
		"doc": {
			"id": "2506b61ffad7b7c4798bfac660b27e3d40fe97a02d876fa800d7d21ad2be57b2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Myrmecophaga_tridactyla_skeleton2.jpg/220px-Myrmecophaga_tridactyla_skeleton2.jpg",
				"previous": "Unlike those of other mammals, the necks of anteaters, especially the giant, are thicker than the backs of their heads.[13] A small hump can be found at the back of its neck. The giant anteater's coat is mostly grey and salted with white. Its fore limbs are white, with black bands around the wrists, while its hind limbs are dark. Thick black bands with white outlines stretch from throat to shoulder, where they end in triangular points. The body ends in a brown tail. The coat hairs are long, especially on the tail, which makes the tail look larger than it actually is. A stiff mane stretches along its back.[4] The bold pattern was thought to be disruptive camouflage, but a 2009 study suggests it is warning coloration.[15] While adult males are slightly larger and more muscular than females, with wider heads and necks, visual sex determination can be difficult. The (retracted) penis and testes are located internally between the rectum and urinary bladder in males, and females have a single pair of mammary glands near the armpits.[16]",
				"after": "The giant anteater has broad ribs. Despite its specific name, it has five toes on each foot. Four toes on the front feet have claws, which are particularly elongated on the second and third digits.[16] The giant anteater walks on its front knuckles, similar to the African apes, specifically gorillas and chimpanzees. Doing this allows the giant anteater to keep its claws out of the way while walking. The middle digits, which support most of its weight, are extended at the metacarpophalangeal joints and bent at the interphalangeal joints.[17] Unlike the front feet, the hind feet have short claws on all five toes and walk plantigrade.[4] As a \"hook-and-pull\" digger, the giant anteater's enlarged supraspinous fossa gives the teres major more leverage—increasing the front limbs' pulling power—and the triceps muscle helps power the flexion of the thickened third digit of the front feet.[18]",
			"color": "burly|0.27152 wood|0.27152 navajo|0.14759 white|0.14759 moccasin|0.10916 wheat|0.095762 tan|0.076833 pale|0.044525 golden|0.044525 rod|0.044525 gray|0.027327 grey|0.027327 chocolate|0.025001 lemon|0.02055 chiffon|0.02055 sienna|0.017041 saddle|0.016312 brown|0.016312 light|0.012664 golden|0.012664 rod|0.012664 yellow|0.012664 blanched|0.011781 almond|0.011781 bisque|0.010156 papaya|0.0096187 whip|0.0096187 corn|0.0094345 silk|0.0094345 antique|0.0085755 white|0.0085755 light|0.0084488 yellow|0.0084488 beige|0.007763  "
		}
	}
}
