{
	"add": {
		"doc": {
			"id": "2508a75dc267762b4becbbb7371f9cd7674886f53cee95750c78b2cdea9c2f75",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Coat_of_arms_of_Armenia.svg/150px-Coat_of_arms_of_Armenia.svg.png",
			"previous": [],
				"after": "The Coat of Arms of Armenia consists of an eagle and a lion supporting a shield. The coat of arms combines new and old symbols. The eagle and lion are ancient Armenian symbols dating from the first Armenian kingdoms. The shield itself consists of many components. In the center is a depiction of Mount Ararat, where Noah's ark came to rest after the great flood. Surrounding Mount Ararat are symbols of old Armenian dynasties. In the lower left is the emblem of the Artaxiad Dynasty that ruled in the 1st century BC. In the upper left is the emblem for the Bagratuni Dynasty that ruled during the Middle Ages, between 7th and 11th centuries. That dynasty was destroyed by the Byzantine Empire's encroachment and by Seljuk invasions in the 11th century AD. In the upper right is the emblem of the first dynasty to reign over a Christian Armenia, the Arsacid Dynasty of Armenia. This dynasty ruled from the 1st century AD to 428 AD. In the lower right is the emblem of the Rubenid dynasty. This dynasty reigned in Lesser Armenia (also known as Cilicia), a state that expanded and prospered during the 12th and 13th centuries, until the Mamelukes and Turks eventually conquered it.",
			"color": "dark|0.23652 orange|0.23652 dark|0.12264 gray|0.12264 dark|0.12264 grey|0.12264 gray|0.10328 grey|0.10328 silver|0.079394 light|0.049288 gray|0.049288 light|0.049288 grey|0.049288 dim|0.048888 gray|0.048888 dim|0.048888 grey|0.048888 firebrick|0.044161 brown|0.037305 gainsboro|0.036759 navajo|0.016416 white|0.016416 white|0.015193 smoke|0.015193 sandy|0.014881 brown|0.014881 sea|0.013727 shell|0.013727 snow|0.013007 ghost|0.01207 white|0.01207 white|0.011553 peach|0.011357 puff|0.011357 alice|0.011287 blue|0.011287 lavender|0.010871 blush|0.010871 floral|0.01077 white|0.01077 mint|0.01025 cream|0.01025 bisque|0.010191 moccasin|0.009712 wheat|0.0091118 azure|0.0084296 linen|0.0078533  "
		}
	}
}
