{
	"add": {
		"doc": {
			"id": "250b9d834c960bb1346670b958f2c433b4b0e303bff272a8f2b9b8fd7d6c1bc5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Noisy_Miner_chicks.jpg/220px-Noisy_Miner_chicks.jpg",
			"previous": [],
				"after": "The noisy miner does not use a stereotyped courtship display; displays can involve ‘driving’ where the male jumps or flies at the female from 1–2 metres (3.3–6.6 ft) away, and if she moves away he pursues her aggressively. The female may perform a ‘bowed-wing display’ where the wings and tail are spread and quivered, with the wings arched and the head pointing down. The male may adopt a vertical or horizontal ‘eagle display’ with wings and tail spread wide and held still for several seconds. Copulation is frequent and conspicuous, with both males and females copulating with several birds, while other members of the colony display or otherwise interfere with the mating pair.[43] Copulation usually occurs on larger, exposed branches close to the nest site and can occur at any time of the day, although slightly more often between 11:00 and 13:00 when communal activities are less frequent. [52] The frenzied courtship activity had led to speculation that the female mates promiscuously to recruit males to help care for the young, however recent genetic testing shows that 96.5% of noisy miner broods result from monogamous mating and that multiple paternity is rare. An observation of banded birds noted that while females copulated repeatedly, it was always with the same male. Mate switching between broods is uncommon, with pairs staying together over several years.[53]",
			"color": "dim|0.19978 gray|0.19978 dim|0.19978 grey|0.19978 light|0.18019 steel|0.18019 blue|0.18019 gray|0.10588 grey|0.10588 light|0.096095 slate|0.096095 gray|0.096095 slate|0.086531 gray|0.086531 dark|0.080308 olive|0.080308 green|0.080308 black|0.07546 dark|0.07355 gray|0.07355 dark|0.07355 grey|0.07355 dark|0.029838 sea|0.029838 green|0.029838 lavender|0.01474 silver|0.012311 rosy|0.0097332 brown|0.0097332  "
		}
	}
}
