{
	"add": {
		"doc": {
			"id": "250bed0a91fb440883f2cc8bbeae13a1898cf1158a7c0946f366e5655fea81ab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/USS_Nimitz_%28Nov._3%2C_2003%29.jpg/220px-USS_Nimitz_%28Nov._3%2C_2003%29.jpg",
				"previous": "England emerged as a major naval power in the mid-17th century in the first Anglo-Dutch war with a technical victory. Successive decisive Dutch victories in the second and third Anglo-Dutch Wars confirmed the Dutch mastery of the seas during the Dutch Golden Age, financed by the expansion of the Dutch Empire. The French Navy won some important victories near the end of the 17th century but a focus upon land forces led to the French Navy's relative neglect, which allowed the Royal Navy to emerge with an ever-growing advantage in size and quality, especially in tactics and experience, from 1695. Throughout the 18th century the Royal Navy gradually gained ascendancy over the French Navy, with victories in the War of Spanish Succession (1701–1714), inconclusive battles in the War of Austrian Succession (1740–1748), victories in the Seven Years' War (1754–1763), a partial reversal during the American War of Independence (1775–1783), and consolidation into uncontested supremacy during the 19th century from the Battle of Trafalgar in 1805. These conflicts saw the development and refinement of tactics which came to be called the line of battle.",
				"after": "The next stage in the evolution of naval warfare was the introduction of metal plating along the hull sides. The increased mass required steam-powered engines, resulting in an arms race between armor and weapon thickness and firepower. The first armored vessels, the French Gloire and British HMS Warrior, made wooden vessels obsolete. Another significant improvement came with the invention of the rotating turrets, which allowed the guns to be aimed independently of ship movement. The battle between the CSS Virginia and the USS Monitor during the American Civil War (1861–1865) is often cited as the beginning of this age of maritime conflict. The Russian Navy was considered the third strongest in the world on the eve of the Russo-Japanese War, which turned to be a catastrophe for the Russian military in general and the Russian Navy in particular. Although neither party lacked courage, the Russians were defeated by the Japanese in the Battle of Port Arthur, which was the first time in warfare that mines were used for offensive purposes. The warships of the Baltic Fleet sent to the Far East were lost in the Battle of Tsushima. A further step change in naval firepower occurred when the United Kingdom launched HMS Dreadnought (1906), but naval tactics still emphasized the line of battle.",
			"color": "dim|0.28157 gray|0.28157 dim|0.28157 grey|0.28157 black|0.25736 gray|0.18183 grey|0.18183 dark|0.080177 gray|0.080177 dark|0.080177 grey|0.080177 silver|0.045868 light|0.030028 gray|0.030028 light|0.030028 grey|0.030028 gainsboro|0.022395 white|0.010488 smoke|0.010488 linen|0.010204 sea|0.0097817 shell|0.0097817 floral|0.008487 white|0.008487 snow|0.0083536 white|0.0071633 mint|0.0069173 cream|0.0069173 old|0.0057768 lace|0.0057768  "
		}
	}
}
