{
	"add": {
		"doc": {
			"id": "250f28d2cbc1f68e3a28f4361c8426ede03fd394d314582e6e12b301cab4e83f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Hms-shannon-1875-plan.gif/220px-Hms-shannon-1875-plan.gif",
				"previous": "The British responded with Shannon, begun in 1873, launched in 1875 and armed with two 10-inch (254 mm) and seven 9-inch (229 mm) rifled guns. Two ships of the Nelson class followed, armed with four 10-inch (254 mm) and eight 9-inch (229 mm) guns. These early armored cruisers were essentially scaled-down versions of the first-rate ironclad warships of the time and, like their Russian counterparts, were essentially belted cruisers. Their 9-inch (229 mm) belts were thicker than that of the Russians but did not extend the full length of the hull due to weight but tapered off at both ends. Past this belt, the designers placed a 3-inch (76 mm) armored deck, situated deepest in the ships, to guard magazines and machinery against plunging fire. Above this deck, space was allocated for coal bunkers and storerooms. These areas served a two-fold purpose. The bunkers served as added protection, since two feet of coal was considered the equivalent of one foot of steel. Also, if either of the ships became flooded from battle damage, it was hoped the contents of the bunkers and storerooms would aid in their continued buoyancy. Because of this unarmored protection, these ships could be considered the first protected cruisers. However, these ships also shared the liabilities of the Russian ones and because of this, the British Navy was never happy with them. Shannon‍ '​s top speed of 12.25 knots and Nelson‍ '​s of 14 knots made them too slow to deal with fast cruisers and they were not armored well enough to take on a first-class battleship. Their armor belts also sat below the ships' waterlines, which made them of limited benefit.[8]",
				"after": "The underlying problem with these early warships was that technology had not caught up to the demands being made of them; therefore, they represented a series of compromises and could not be fully effective. They were typically powered by double-expansion steam engines fed by boilers which generated steam at perhaps 60 or 70 psi pressure, which gave relatively poor efficiency and short range. Even with improved engines, the dearth of overseas refueling stations made a full sailing rig a necessity. As sailing ships required a high freeboard and a large degree of stability, the use of armored turrets as used on monitors and some battleships was ruled out, because a turret was a very heavy weight high in the ship and its placement necessitated a lower freeboard than was warranted for an oceangoing vessel. (The loss of H.M.S. Captain in 1870 with nearly all of her 500-man crew illustrated graphically what could happen in a heavy sea with a turret-equipped steam-and-sail vessel.) Consequently, armored cruisers retained a more traditional broadside arrangement. Their armor was distributed in a thick belt around the waterline along most of their length; the gun positions on deck were not necessarily armored at all. The limitations of these ships would not be rectified fully until decades after their construction.[9]",
			"color": " "
		}
	}
}
