{
	"add": {
		"doc": {
			"id": "251e8f39cd31249ee6fb4070503896b3461b687930231bd89cd068eabc233318",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Constitution_of_India.jpg/220px-Constitution_of_India.jpg",
				"previous": "Roman law was heavily influenced by Greek philosophy, but its detailed rules were developed by professional jurists and were highly sophisticated.[21][22] Over the centuries between the rise and decline of the Roman Empire, law was adapted to cope with the changing social situations and underwent major codification under Theodosius II and Justinian I.[23] Although codes were replaced by custom and case law during the Dark Ages, Roman law was rediscovered around the 11th century when medieval legal scholars began to research Roman codes and adapt their concepts. Latin legal maxims (called brocards) were compiled for guidance. In medieval England, royal courts developed a body of precedent which later became the common law. A Europe-wide Law Merchant was formed so that merchants could trade with common standards of practice rather than with the many splintered facets of local laws. The Law Merchant, a precursor to modern commercial law, emphasised the freedom to contract and alienability of property.[24] As nationalism grew in the 18th and 19th centuries, the Law Merchant was incorporated into countries' local law under new civil codes. The Napoleonic and German Codes became the most influential. In contrast to English common law, which consists of enormous tomes of case law, codes in small books are easy to export and easy for judges to apply. However, today there are signs that civil and common law are converging.[25] EU law is codified in treaties, but develops through the precedent laid down by the European Court of Justice.",
				"after": "Ancient India and China represent distinct traditions of law, and have historically had independent schools of legal theory and practice. The Arthashastra, probably compiled around 100 AD (although it contains older material), and the Manusmriti (c. 100–300 AD) were foundational treatises in India, and comprise texts considered authoritative legal guidance.[26] Manu's central philosophy was tolerance and pluralism, and was cited across Southeast Asia.[27] This Hindu tradition, along with Islamic law, was supplanted by the common law when India became part of the British Empire.[28] Malaysia, Brunei, Singapore and Hong Kong also adopted the common law. The eastern Asia legal tradition reflects a unique blend of secular and religious influences.[29] Japan was the first country to begin modernising its legal system along western lines, by importing bits of the French, but mostly the German Civil Code.[30] This partly reflected Germany's status as a rising power in the late 19th century. Similarly, traditional Chinese law gave way to westernisation towards the final years of the Ch'ing dynasty in the form of six private law codes based mainly on the Japanese model of German law.[31] Today Taiwanese law retains the closest affinity to the codifications from that period, because of the split between Chiang Kai-shek's nationalists, who fled there, and Mao Zedong's communists who won control of the mainland in 1949. The current legal infrastructure in the People's Republic of China was heavily influenced by Soviet Socialist law, which essentially inflates administrative law at the expense of private law rights.[32] Due to rapid industrialisation, today China is undergoing a process of reform, at least in terms of economic, if not social and political, rights. A new contract code in 1999 represented a move away from administrative domination.[33] Furthermore, after negotiations lasting fifteen years, in 2001 China joined the World Trade Organisation.[34]",
			"color": "light|0.25547 gray|0.25547 light|0.25547 grey|0.25547 silver|0.25231 gainsboro|0.17904 gray|0.090335 grey|0.090335 dark|0.087774 gray|0.087774 dark|0.087774 grey|0.087774 dim|0.061575 gray|0.061575 dim|0.061575 grey|0.061575 linen|0.020699 antique|0.0081753 white|0.0081753 sea|0.0074915 shell|0.0074915 white|0.0069573 smoke|0.0069573 old|0.0065119 lace|0.0065119 misty|0.0050985 rose|0.0050985 floral|0.0044738 white|0.0044738  "
		}
	}
}
