{
	"add": {
		"doc": {
			"id": "25331636042337eb472686f64ffab2a9ee5d1f875c1f90a4255331f4b6e2a5b9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Ok%C4%99cie_-_samolot_na_pasie_35.JPG/220px-Ok%C4%99cie_-_samolot_na_pasie_35.JPG",
				"previous": "By December 1992 the airline became a joint stock company, as a transitional step towards partial privatisation, which was effected in late 1999, State Treasury - 67.97% of shares in the company; Regionalny Fundusz Gospodarczy S.A. - 25,1%; the employees - 6.93%. In 1994 the airline signed a code-sharing agreement with American Airlines on flights to and from Warsaw as well as onward flights in the United States and Poland operated by both companies; flights to Thessaloniki, Zagreb and Nice were inaugurated, and according to an IATA report, in this year LOT had the youngest fleet of any airline in the world. After years of planning, in 1997 LOT set up a sister airline, EuroLOT, which, essentially operating as its parent airline's regional subsidiary, took over domestic flights. The airline was developed with the hope that it would increase transit passenger-flow through Warsaw's Chopin Airport, whilst at the same time providing capacity on routes with smaller load factors and play a part in developing LOT's reputation as the largest transit airline in Central and Eastern Europe. By 1999 LOT had purchased a number of small Embraer 145 regional jets in order to expand its short-haul fleet, and had, with the approval of the Minister of the State Treasury, begun a process of selling shares to the Swiss company SAirGroup Holding, this then led to the airline's incorporation into the then-nascent Qualiflyer Group.",
				"after": "Expansion of LOT's route network continued in the early 2000s and the potential of the airline's hub at Warsaw Chopin Airport to become a major transit airport was realised with more and more success. In 2000 LOT took delivery of its largest ever order of 11 aircraft and by 2001 had reached a milestone passengers-carried figure of 3 million customers in one year; such an expansion led to the reconstruction of much of LOT's ground infrastructure, and by 2002 a new central Warsaw head office was opened on Ul. 17 Stycznia. On 26 October 2003, LOT, after the collapse of the Qualiflyer Group, became the 14th member of the Star Alliance. By 2006 a new base of operations, with the reconstruction of Warsaw Chopin Airport, had opened, thus allowing LOT's full transit airline potential to be developed for the first time ever. The new airport is much larger than any previous airport in Poland and has since provided LOT passengers with comfortable, high-quality service. In that same year Pope Benedict XVI returned to Rome on a LOT flight following his pilgrimage to Poland.",
			"color": "dark|0.35368 gray|0.35368 dark|0.35368 grey|0.35368 gray|0.14903 grey|0.14903 silver|0.14504 black|0.069431 dim|0.056675 gray|0.056675 dim|0.056675 grey|0.056675 dark|0.05072 olive|0.05072 green|0.05072 light|0.043622 gray|0.043622 light|0.043622 grey|0.043622 gainsboro|0.030762 dark|0.019338 slate|0.019338 gray|0.019338 white|0.011399 smoke|0.011399 alice|0.009379 blue|0.009379 ghost|0.0076541 white|0.0076541 azure|0.0072259 mint|0.0068487 cream|0.0068487 snow|0.0068124 white|0.0062453 sea|0.0051989 shell|0.0051989  "
		}
	}
}
