{
	"add": {
		"doc": {
			"id": "254890e94f94c433289daa558bf826a1978ed4f40e63a6c26e69684eef10a5f2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Colegiata_de_San_Isidro_%28Madrid%29_02.jpg/170px-Colegiata_de_San_Isidro_%28Madrid%29_02.jpg",
				"previous": "The Bishop Chapel is a gothic chapel which was built in the 16th century by order of the Bishop of Plasencia, Gutierre de Vargas. It was originally built to house the remains of Saint Isidore Laborer (Madrid's patron saint), but it was used as the Vargas family mausoleum. Inside are the altairpiece and the tombs of the Vargas family, which were the work of Francisco Giralte, a disciple of Alonso Berruguete. They are considered masterpieces of Spanish Renaissance sculpture.",
				"after": "St. Isidore Church was built between 1620 and 1664 by order of Empress Maria of Austria, daughter of Charles V of Germany and I of Spain, to become part of a school run by the Jesuits which still exists today. Its dome is the first example of a dome drawing on a wooden frame covered with plaster, which, given its lightness makes it easy to support the walls. It was the cathedral of Madrid between 1885 and 1993, which is the time it took to build the Almudena. The artwork inside were mostly burned during the Spanish Civil War, but it retained the tomb that holds the incorrupt body of Saint Isidore Laborer and the urn containing the ashes of his wife Maria Torribia.",
			"color": "black|0.33443 slate|0.096637 gray|0.096637 dim|0.095844 gray|0.095844 dim|0.095844 grey|0.095844 light|0.067764 slate|0.067764 gray|0.067764 gray|0.033266 grey|0.033266 white|0.030635 smoke|0.030635 snow|0.030079 ghost|0.030069 white|0.030069 white|0.029995 mint|0.029752 cream|0.029752 azure|0.029395 alice|0.028907 blue|0.028907 sea|0.028725 shell|0.028725 floral|0.028688 white|0.028688 light|0.024567 steel|0.024567 blue|0.024567 dark|0.023197 gray|0.023197 dark|0.023197 grey|0.023197 lavender|0.021148 blush|0.021148 ivory|0.0075632 silver|0.0068037  "
		}
	}
}
