{
	"add": {
		"doc": {
			"id": "2573a7a7040b3663c8588ee5c8b6962f4c5baf5eb3ddce0638eb93e4cfb2e0e3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Bombycilla_garrulus_egg.jpg/220px-Bombycilla_garrulus_egg.jpg",
				"previous": "Waxwings are not highly territorial, and, although normally solitary breeders, several pairs may nest close together where there are a number of good nest sites.[2] Males may sometimes deter rivals from approaching their mates, and females may squabble over nest sites. Aggression is shown by sleeking down the feathers and crest, showing the black throat, and opening the bill. The breeding display is almost the opposite of this; the male erects his body and crest feathers, and turns his head away from the female. The male may repeatedly present a gift of a small item, often food, to his partner, placing it in her open bill. In about 90% of cases, this display does not lead to copulation.[30] Older males have more red tips to the wings and are preferred by females.[23]",
				"after": "The nest, built by both sexes, is a cup of thin twigs lined with softer material such as fine grass, moss, fur or lichen. It is constructed 1.3–15 m (4–50 ft) above the ground in a pine or scrub, commonly close to the trunk. The eggs are a glossy pale blue spotted with black and grey and the clutch is 3–7 eggs, although five or six is most common.[14][19] The average size of the egg is 24 mm × 18 mm (0.94 in × 0.71 in), and it weighs 3.8 g (0.13 oz), of which 5% is shell. The eggs are incubated for 13–14 days by the female alone.[17] She is fed regurgitated berries by her mate, and rarely leaves the nest. The chicks are altricial and naked, and have bright red mouths; they are fed by both parents, although the male brings most of the food, mainly insects, in the first few days. The young are subsequently fed largely with fruit. The chicks fledge about 14–16 days after hatching.[2] They are fed by the adults for about two weeks after fledging.[23]",
			"color": " "
		}
	}
}
