{
	"add": {
		"doc": {
			"id": "25ac61baeb76fd0a98e662d796c8e9c7ec169305a1e8c3c6d46952492f6acebf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Blue_Stilton_Quarter_Front.jpg/220px-Blue_Stilton_Quarter_Front.jpg",
				"previous": "Certain types of cheeses require inoculation of milk curds with fungal species that impart a unique flavor and texture to the cheese. Examples include the blue color in cheeses such as Stilton or Roquefort, which are made by inoculation with Penicillium roqueforti.[209] Molds used in cheese production are non-toxic and are thus safe for human consumption; however, mycotoxins (e.g., aflatoxins, roquefortine C, patulin, or others) may accumulate because of growth of other fungi during cheese ripening or storage.[210]",
				"after": "Many mushroom species are poisonous to humans, with toxicities ranging from slight digestive problems or allergic reactions as well as hallucinations to severe organ failures and death. Genera with mushrooms containing deadly toxins include Conocybe, Galerina, Lepiota, and, the most infamous, Amanita.[211] The latter genus includes the destroying angel (A. virosa) and the death cap (A. phalloides), the most common cause of deadly mushroom poisoning.[212] The false morel (Gyromitra esculenta) is occasionally considered a delicacy when cooked, yet can be highly toxic when eaten raw.[213] Tricholoma equestre was considered edible until being implicated in serious poisonings causing rhabdomyolysis.[214] Fly agaric mushrooms (Amanita muscaria) also cause occasional non-fatal poisonings, mostly as a result of ingestion for use as a recreational drug for its hallucinogenic properties. Historically, fly agaric was used by different peoples in Europe and Asia and its present usage for religious or shamanic purposes is reported from some ethnic groups such as the Koryak people of north-eastern Siberia.[215]",
			"color": "black|0.69765 tan|0.041493 wheat|0.029989 papaya|0.021841 whip|0.021841 blanched|0.021725 almond|0.021725 corn|0.021187 silk|0.021187 light|0.020098 golden|0.020098 rod|0.020098 yellow|0.020098 beige|0.019696 peach|0.018983 puff|0.018983 bisque|0.018705 light|0.018416 yellow|0.018416 lemon|0.017359 chiffon|0.017359 antique|0.014544 white|0.014544 moccasin|0.0066677 old|0.0066643 lace|0.0066643 ivory|0.0059938  "
		}
	}
}
