{
	"add": {
		"doc": {
			"id": "25ad55b935f442b7ce61046898721250e233d7da82f9b9140cf7568d2c8bae2d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/UA93_fuselage_debris.jpg/170px-UA93_fuselage_debris.jpg",
				"previous": "Flight 93 fragmented violently upon impact. Most of the aircraft wreckage was found near the impact crater.[83] Investigators found some very light debris including paper and nylon scattered up to eight miles (13 km) from the impact point in New Baltimore, Pennsylvania.[84] Other tiny aircraft fragments were found 1.5 miles (2.4 km) away at Indian Lake, Pennsylvania.[85] All human remains were found within a 70-acre (28 ha) area surrounding the impact point.[85] Somerset County Coroner Wally Miller was involved in the investigation and identification of the remains. In examining the wreckage, the only human body part he could see was part of a backbone.[86] Miller later found and identified 1,500 pieces of human remains totaling about 600 pounds (272 kg), or eight percent of the total.[87] The rest of the remains were consumed by the impact.[88] Investigators identified four victims by September 22 and eleven by September 24.[89][90] They identified another by September 29.[91] Thirty-four passengers were identified by October 27.[92] All the people on board the flight were identified by December 21. Human remains were so fragmented that investigators could not determine whether any victims were dead before the plane crashed. Death certificates for the 40 victims listed the cause of death as homicide and listed the cause of death for the four hijackers as suicide.[93] The remains and personal effects of the victims were returned to the families.[94] The remains of the hijackers, identified by the process of elimination, were turned over to the Federal Bureau of Investigation (FBI) as evidence.[95]",
				"after": "Investigators also found a knife concealed in a cigarette lighter.[96] They located the flight data recorder on September 13 and the cockpit voice recorder the following day.[97][98] The voice recorder was found buried 25 feet (8 m) below the crater. The FBI initially refused to release the voice recording, rejecting requests by Congresswoman Ellen Tauscher and family members of those on board.[99] The FBI subsequently allowed the relatives of the Flight 93 victims to listen to the recording in a closed session on April 18, 2002.[100] Jurors for the Zacarias Moussaoui trial heard the tape as part of the proceedings and the transcript was publicly released on April 12, 2006.[101]",
			"color": "dark|0.22854 gray|0.22854 dark|0.22854 grey|0.22854 silver|0.14225 dim|0.11075 gray|0.11075 dim|0.11075 grey|0.11075 gray|0.097435 grey|0.097435 light|0.064035 slate|0.064035 gray|0.064035 light|0.063508 gray|0.063508 light|0.063508 grey|0.063508 slate|0.059337 gray|0.059337 dark|0.050162 slate|0.050162 gray|0.050162 black|0.040936 gainsboro|0.03756 light|0.015801 steel|0.015801 blue|0.015801 misty|0.0072017 rose|0.0072017 linen|0.007189 white|0.0063402 smoke|0.0063402 sea|0.0057216 shell|0.0057216 antique|0.0052413 white|0.0052413  "
		}
	}
}
