{
	"add": {
		"doc": {
			"id": "25b1018b69ed7091769a69c9fbcf0652422b7237bbfb5b684dc40dee3417e70c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Darjeeling_War_Memorial%2C_at_Batasia_Loop%2C_Darjeeling%2C.jpg/220px-Darjeeling_War_Memorial%2C_at_Batasia_Loop%2C_Darjeeling%2C.jpg",
				"previous": "In 1828, a delegation of the British East India Company (BEIC) officials on its way to the Nepal-Sikkim border stayed in Darjeeling and decided that the region was a suitable site for a sanatorium for British soldiers.[6][7] The company negotiated a lease of the area west of the Mahananda River from the Chogyal of Sikkim in 1835.[8] In 1849, the BEIC director Arthur Campbell and the explorer and botanist Joseph Dalton Hooker were imprisoned in the region by the Sikkim Chogyal. The BEIC sent a force to free them. Continued friction between the BEIC and the Sikkim authorities resulted in the annexation of 640 square miles (1,700 km2) of territory by the British in 1850. In 1864, the Bhutanese rulers and the British signed the Treaty of Sinchula that ceded the passes leading through the hills and Kalimpong to the British.[5] Further discord between Sikkim and the British resulted in a war, culminating in the signing of a treaty and the annexation by the British of the area east of the Teesta River in 1865.[9] By 1866, Darjeeling district had assumed its current shape and size, covering an area of 1,234 square miles (3,200 km2).[5]",
				"after": "During the British Raj, Darjeeling's temperate climate led to its development as a hill station for British residents seeking to escape the summer heat of the plains. The development of Darjeeling as a sanatorium and health resort proceeded briskly.[4] Arthur Campbell, a surgeon with the Company, and Lieutenant Robert Napier were responsible for establishing a hill station there. Campbell's efforts to develop the station, attract immigrants to cultivate the slopes and stimulate trade resulted in a hundredfold increase in the population of Darjeeling between 1835 and 1849.[5][10] The first road connecting the town with the plains was constructed between 1839 and 1842.[4][10] In 1848, a military depot was set up for British soldiers, and the town became a municipality in 1850.[10] Commercial cultivation of tea in the district began in 1856, and induced a number of British planters to settle there.[6] Darjeeling became the formal summer capital of the Bengal Presidency after 1864.[11] Scottish missionaries undertook the construction of schools and welfare centres for the British residents, laying the foundation for Darjeeling's notability as a centre of education. The opening of the Darjeeling Himalayan Railway in 1881 further hastened the development of the region.[12] In 1899, Darjeeling was rocked by major landslides that caused severe damage to the town and the native population.[13]",
			"color": "gray|0.21186 grey|0.21186 dark|0.17058 gray|0.17058 dark|0.17058 grey|0.17058 black|0.15475 dim|0.13749 gray|0.13749 dim|0.13749 grey|0.13749 dark|0.13681 olive|0.13681 green|0.13681 silver|0.069403 light|0.030196 gray|0.030196 light|0.030196 grey|0.030196 slate|0.018751 gray|0.018751 gainsboro|0.018037 light|0.015231 slate|0.015231 gray|0.015231 dark|0.014641 slate|0.014641 gray|0.014641  "
		}
	}
}
