{
	"add": {
		"doc": {
			"id": "25c8b7f9429c1be95e4d67d3086d549395f9044a3d179b69366931568b4baa10",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/AnthonyRoll-second_roll_sample.jpg/220px-AnthonyRoll-second_roll_sample.jpg",
			"previous": [],
				"after": "The Anthony Roll was originally a set of three separate vellum rolls. It exists today in the form of a bound volume containing the first and third rolls while the second roll is preserved in its original form. The three original rolls were made up out of a total of 17 individual membranes glued to the back of the next membrane. The membranes were of a width of 70 cm (27 ½ inches) and a height varying from 79 to 96 cm (31 to 37 ¾ inches).[11] After receiving the first and third rolls Pepys had his clerks cut the rolls up and bound in a single volume as a book, now known as Pepys 2991. The transformation of the two rolls created a horizontal page structure, and some of the ornamentation that was cut in process was copied into the volume by hand. Pepys also inserted abstracts between the two rolls and a summarizing table that was not Anthony's, but pre-dated Pepys' binding of the rolls. This radical treatment of the original document has damaged some of the illustrations and is today deprecated. The first three illustrations of the Henry Grace à Dieu, Mary Rose and Peter Pomegranate were all too large to fit on one page and were therefore converted to two-page spreads. The resulting bend down the centre of the illustrations led to noticeable loss of detail. Despite this, there are no plans to attempt a recreation of the original structure of the first and third rolls. The second roll, British Library Additional MS 22047, is still in its original condition with the exception of a written endorsement by Mary Fox from 1857 and some damage caused by an application of chemicals to reveal faded writing.[12]",
			"color": "antique|0.13226 white|0.13226 tan|0.10951 beige|0.080634 papaya|0.076459 whip|0.076459 blanched|0.075456 almond|0.075456 wheat|0.064925 old|0.050276 lace|0.050276 linen|0.0496 corn|0.042396 silk|0.042396 bisque|0.038013 floral|0.029703 white|0.029703 sea|0.028131 shell|0.028131 ivory|0.025511 gainsboro|0.019429 white|0.018047 smoke|0.018047 light|0.015538 gray|0.015538 light|0.015538 grey|0.015538 mint|0.013771 cream|0.013771 snow|0.012808 light|0.012346 yellow|0.012346 honeydew|0.010305 black|0.010132 light|0.010117 golden|0.010117 rod|0.010117 yellow|0.010117 white|0.0093951 burly|0.0065174 wood|0.0065174  "
		}
	}
}
