{
	"add": {
		"doc": {
			"id": "25d6a62fd0696be05d5dc04fce6e3689c1ece3257c801b469dc7e576d0eaf376",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Fratercula_arctica_-Skellig_Michael%2C_County_Kerry%2C_Ireland-8.ogv/220px--Fratercula_arctica_-Skellig_Michael%2C_County_Kerry%2C_Ireland-8.ogv.jpg",
				"previous": "The Atlantic puffin diet consists almost entirely of fish, though examination of its stomach contents shows that it occasionally eats shrimps, other crustaceans, molluscs and polychaete worms, especially in more coastal waters.[28] When fishing, it swims underwater using its semi-extended wings as paddles to \"fly\" through the water and its feet as a rudder. It swims fast and can reach considerable depths and stay submerged for up to a minute. It can eat shallow-bodied fish as long as 18 cm (7 in) but its prey is commonly smaller fish, around 7 cm (3 in) long. It has been estimated that an adult bird needs to eat about forty of these per day—sand eels, herring, sprats and capelin being the most often consumed. It fishes by sight and can swallow small fish while submerged, but larger specimens are brought to the surface. It can catch several small fish in one dive, holding the first ones in place in its beak with its muscular, grooved tongue while it catches others. The two mandibles are hinged in such a way that they can be held parallel to hold a row of fish in place and these are also retained by inward-facing serrations on the edges of the beak. It copes with the excess salt that it swallows partly through its kidneys and partly by excretion through specialised salt glands in its nostrils.[20]",
				"after": "In the spring, mature birds return to land, usually to the colony at which they were hatched. Birds that were removed as chicks and released elsewhere were found to show fidelity to their point of liberation.[29] They congregate for a few days on the sea in small groups offshore before returning to the cliff top nesting sites. Each large puffin colony is subdivided into sub-colonies by physical boundaries such as stands of bracken or gorse. Early arrivals take control of the best locations, the most desirable nesting sites being the densely packed burrows on grassy slopes just above the cliff edge where take-off is most easily accomplished. The birds are usually monogamous, but this is the result of their fidelity to their nesting sites rather than to their mates and they often return to the same burrows year after year. Later arrivals at the colony may find that all the best nesting sites have already been taken and be pushed towards the periphery where they are in greater danger of predation. Younger birds may come ashore a month or more after the mature birds and find no remaining nesting sites. They will not breed till the following year although it has been found that if the ground cover surrounding the colony is cut back before these sub-adults arrive, the number of successfully nesting pairs may be increased.[30]",
			"color": "dim|0.20813 gray|0.20813 dim|0.20813 grey|0.20813 black|0.19804 gray|0.19289 grey|0.19289 dark|0.15442 gray|0.15442 dark|0.15442 grey|0.15442 silver|0.096562 light|0.051172 gray|0.051172 light|0.051172 grey|0.051172 gainsboro|0.032978 dark|0.012454 olive|0.012454 green|0.012454 linen|0.0073002 white|0.0065662 smoke|0.0065662 sea|0.0051851 shell|0.0051851  "
		}
	}
}
