{
	"add": {
		"doc": {
			"id": "25d9cfb1f957428bb4ea201a9a8a1a707630fc203d9a50fdb8d616063ad80c24",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Yalta_summit_1945_with_Churchill%2C_Roosevelt%2C_Stalin.jpg/220px-Yalta_summit_1945_with_Churchill%2C_Roosevelt%2C_Stalin.jpg",
				"previous": "In May 1940, Germany attacked France through the Low Countries. France capitulated in June 1940. By August Germany began a bombing offensive on Britain, but failed to convince the Britons to give up.[151] In 1941, Germany invaded the Soviet Union in the Operation Barbarossa.[152] On 7 December 1941 Japan's attack on Pearl Harbor drew the United States into the conflict as allies of the British Empire and other allied forces.[153][154]",
				"after": "After the staggering Battle of Stalingrad in 1943, the German offensive in the Soviet Union turned into a continual fallback. The Battle of Kursk, which involved the largest tank battle in history, was the last major German offensive on the Eastern Front. In 1944, British and American forces invaded France in the D-Day landings, opening a new front against Germany. Berlin finally fell in 1945, ending World War II in Europe. The war was the largest and most destructive in human history, with 60 million dead across the world.[155] More than 40 million people in Europe had died as a result of World War II,[156] including between 11 and 17 million people who perished during the Holocaust.[157] The Soviet Union lost around 27 million people (mostly civilians) during the war, about half of all World War II casualties.[158] By the end of World War II, Europe had more than 40 million refugees.[159] Several post-war expulsions in Central and Eastern Europe displaced a total of about 20 million people.[160]",
			"color": "black|0.55367 dim|0.077043 gray|0.077043 dim|0.077043 grey|0.077043 dark|0.07026 gray|0.07026 dark|0.07026 grey|0.07026 gray|0.065185 grey|0.065185 silver|0.048885 light|0.03602 gray|0.03602 light|0.03602 grey|0.03602 gainsboro|0.027572 slate|0.017865 gray|0.017865 rosy|0.016494 brown|0.016494 light|0.01524 slate|0.01524 gray|0.01524 linen|0.0088715 white|0.0079317 smoke|0.0079317 sea|0.0068951 shell|0.0068951 misty|0.005843 rose|0.005843 floral|0.005399 white|0.005399  "
		}
	}
}
