{
	"add": {
		"doc": {
			"id": "25e2b37ff41e1a15bbd3b527f3e09ff5f5273f5d7ce648997c437b9de3f5bb62",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Barclays%2C_Poole.jpg/220px-Barclays%2C_Poole.jpg",
				"previous": "The service sector is the principal economy of Poole; a large number of employees work for the service economy of local residents or for the tourist economy. During the 1970s, Poole's less restrictive regional planning policies attracted businesses wishing to relocate from London.[52] These included employers in the banking and financial sector, such as Barclays Bank (who operate a regional headquarters in Poole), American Express Bank and the corporate trust division of Bank of New York Mellon. Other important service sector employers include Link House Publications, the national headquarters and Lifeboat College of the Royal National Lifeboat Institution (RNLI), the UK headquarters of Fitness First, Bournemouth University and Poole NHS Primary Care Trust. Poole is also the headquarters for clothing company Animal, cosmetics manufacturer, Lush, and Merlin Entertainments, the world's second-largest theme park operator after Disney.[64] The Dolphin Shopping Centre is Poole's main retail area, and the largest indoor shopping centre in Dorset.[65] It opened in 1969 as an Arndale Centre, and underwent three major refurbishments in 1980, 1989 and 2004. The centre provides 47,000 square metres (510,000 sq ft) of retail space with 110 stores and two multi-storey car parks with 1,400 parking spaces. A pedestrianised high street containing shops, bars, public houses and restaurants connects the Dolphin Centre with the historic Old Town area and Poole Quay.[65] Tourism is important to the Poole's economy and was worth an estimated £158 million in 2002.[52] Poole's Harbour, Quay, Poole Pottery and the beaches are some of the main attractions for visitors.[45] Visitor accommodation consists of hotels, guest houses and bed and breakfast rooms located around the town, particularly in Sandbanks and the town centre. Rockley Park, a large caravan site in Hamworthy, is owned and operated by Haven and British Holidays.[66]",
				"after": "Since the 1970s, Poole has become one of Britain's busiest ports.[52][67] Investment in new port facilities in Hamworthy, and the deepening of shipping channels allowed considerable growth in cross-channel freight and passenger traffic.[52] The port is a destination for bulk cargo imports such as steel, timber, bricks, fertiliser, grain, aggregates and palletised traffic. Export cargoes include clay, sand, fragmented steel and grain.[39] Commercial ferry operators run regular passenger and freight services from Poole to Cherbourg, St Malo and the Channel Islands.[39] The Royal Marines operate out of the harbour at RM Poole, established in Hamworthy in 1954.[68] The base is home to 1 Assault Group Royal Marines (responsible for landing craft and small boat training), a detachment of the Royal Marines Reserve and special forces unit the Special Boat Service.[69][70] In 2008, 105 fishing boats were registered and licensed to the port and held a permit issued by the Southern Sea Fisheries District Committee (SSFDC) to fish commercially.[71] It is the largest port in terms of licences in the SSFDC district which covers the coastline of Dorset, Hampshire and the Isle of Wight, and one of the largest registered fishing fleets in the UK.[72] However, the fleet is gradually declining because of rising fuel costs and restrictive fishing quotas introduced by the European Union.[71][73] A large number of unlicensed boats also operate charted or private angling excursions.[72]",
			"color": "dim|0.33298 gray|0.33298 dim|0.33298 grey|0.33298 gray|0.15981 grey|0.15981 dark|0.086388 gray|0.086388 dark|0.086388 grey|0.086388 silver|0.082376 light|0.08074 gray|0.08074 light|0.08074 grey|0.08074 black|0.075415 gainsboro|0.06538 linen|0.016545 white|0.012925 smoke|0.012925 sea|0.0090665 shell|0.0090665 slate|0.0080972 gray|0.0080972 dark|0.0079943 olive|0.0079943 green|0.0079943 floral|0.0061141 white|0.0061141 old|0.0060382 lace|0.0060382 light|0.0053891 slate|0.0053891 gray|0.0053891 snow|0.0053517 dark|0.0045279 slate|0.0045279 gray|0.0045279  "
		}
	}
}
