{
	"add": {
		"doc": {
			"id": "25e252d5ee2ea3a982f4e88d998c2e042e4850615c9986a1a33897ba9244e399",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/ABC_Black_Box.ogv/220px--ABC_Black_Box.ogv.jpg",
			"previous": [
				"",
				"FDR and CVR may be combined in a single unit. The two recorders are required by international regulation to be capable of surviving the conditions likely to be encountered in a severe aircraft accident. For this reason, they are typically specified to withstand an impact of 3400 g and temperatures of over 1,000 °C (1,830 °F) as required by EUROCAE ED-112. They have been required in commercial aircraft in the US since 1967."
			],
				"after": "As with many successful devices, probably no single person could be credited with the invention of the flight recorder. One of the earliest and proven attempts was made by François Hussenot and Paul Beaudouin in 1939 at the Marignane flight test center, France, with their \"type HB\" flight recorder; they were essentially photograph-based flight recorders, because the record was made on a scrolling eight meters long by 88 milimeters wide photographic film. The latent image was made by a thin ray of light deviated by a mirror tilted according to the magnitude of the data to record (altitude, speed, etc.).[1][2] A pre-production run of 25 \"HB\" recorders was ordered in 1941 and HB recorders remained in use in French test centers well into the seventies.[3] In 1947, Hussenot founded the Société Française des Instruments de Mesure with Beaudouin and another associate, so as to market his invention, which was also known as the \"hussenograph\". This company went on to become a major supplier of data recorders, used not only aboard aircraft but also trains and other vehicles. SFIM is today part of the Safran group and is still present on the flight recorder market. The advantage of the film technology was that it could be easily developed afterwards and provides a durable, visual feedback of the flight parameters without needing any playback device. On the other hand, unlike magnetic bands or later flash memory-based technology, a photographic film cannot be erased and recycled, and so it must be changed periodically. As such, this technology was reserved for one-shot uses, mostly during planned test flights; and it was not mounted aboard civilian aircraft during routine commercial flights. Also, the cockpit conversation was not recorded.",
			"color": "beige|0.24948 honeydew|0.23253 dim|0.19898 gray|0.19898 dim|0.19898 grey|0.19898 dark|0.12575 slate|0.12575 gray|0.12575 gray|0.0586 grey|0.0586 black|0.023131 ivory|0.019968 dark|0.012951 gray|0.012951 dark|0.012951 grey|0.012951 mint|0.011744 cream|0.011744 old|0.011295 lace|0.011295 silver|0.00876 gainsboro|0.0083715  "
		}
	}
}
