{
	"add": {
		"doc": {
			"id": "25e9e9fe2f26435217f377707915c423cc7d1678cc5b27f2ed8049756df3db65",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/df/Featured_stars_2.png/100px-Featured_stars_2.png",
				"previous": "Current Featured articles:",
				"after": "Architects: Matthew Brettingham, William Bruce, William Burges, John Douglas, Charles Holden, El Lissitzky, Benjamin Mountfort, I. M. Pei, Albert Speer, Rudolf Wolters. Buildings: 7 World Trade Center, Angkor Wat, Baden-Powell House, Belton House, Borobudur, BP Pedestrian Bridge, Bramall Hall, Buckingham Palace, Buildings and architecture of Bristol, Buildings of Jesus College, Oxford, Buildings of Nuffield College, Oxford, Building of the World Trade Center, Catherine de' Medici's building projects, Chicago Board of Trade Building, Heian Palace, Holkham Hall, IG Farben Building, House with Chimaeras, Hoysala architecture, City of Manchester Stadium, Mosque, Michigan State Capitol, New Orleans Mint, Oregon State Capitol, Oriel College, Oxford, Palazzo Pitti, Palladian architecture, Pennsylvania State Capitol, Round Church, Preslav, Sanssouci, Santa Maria de Ovila, Scottish Parliament building, Sicilian Baroque, St. Michael's Cathedral, Qingdao, St. Michael's Golden-Domed Monastery, St Nicholas, Blakeney, Vkhutemas, The Tower House, West Wycombe Park Featured lists Chicago Landmarks, National Treasures of Japan (castles), National Treasures of Japan (shrines), Pritzker Prize, New churches by John Douglas, Church restorations, amendments and furniture by John Douglas, Houses and associated buildings by John Douglas, Non-ecclesiastical and non-residential works by John Douglas, Scheduled monuments in Maidstone, Works by Charles Holden, Grade I listed buildings in: Bath and North East Somerset, Maidstone, Mendip, North Somerset, Sedgemoor, South Somerset, Taunton Deane, West Somerset, List of tallest buildings in: Boston, Chicago, Cleveland, Dallas, Detroit, Dubai, Hong Kong, Las Vegas, London, Los Angeles, Manchester, Miami, Minneapolis, Philadelphia, Providence, San Francisco, Shanghai, Singapore, Tokyo, Toronto, Tulsa, Vancouver, Listed buildings in: Runcorn (urban area), Runcorn (rural area), Widnes",
			"color": "gray|0.26124 grey|0.26124 dark|0.21839 gray|0.21839 dark|0.21839 grey|0.21839 dim|0.18592 gray|0.18592 dim|0.18592 grey|0.18592 rosy|0.099862 brown|0.099862 silver|0.074858 dark|0.033901 khaki|0.033901 olive|0.033441 tan|0.028915 yellow|0.027918 light|0.017002 gray|0.017002 light|0.017002 grey|0.017002  "
		}
	}
}
