{
	"add": {
		"doc": {
			"id": "25ef2df02320ec56b6a17e075ea90f198ce933f8daf5b5eac78b0e2a8f5e5e6a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Greenland_kayak_seal_hunter_2006.jpg/220px-Greenland_kayak_seal_hunter_2006.jpg",
				"previous": "Well-known Inuit politicians include Premier of Nunavut, Eva Aariak, Nancy Karetak-Lindell, former MP for the riding of Nunavut, and Kuupik Kleist, Prime Minister of Greenland. Leona Aglukkaq, current MP, was the first Inuk to be sworn into the Canadian Federal Cabinet as Health Minister in 2008. In May 2011 after being re-elected for her second term, Ms. Aglukkaq was given the additional portfolio of Minister of the Canadian Northern Economic Development Agency. In July 2013 she was sworn in as the Minister of the Environment.[134]",
				"after": "Visual and performing arts are strong. In 2002 the first feature film in Inuktitut, Atanarjuat, was released worldwide to great critical and popular acclaim. It was directed by Zacharias Kunuk, and written, filmed, produced, directed, and acted almost entirely by the Inuit of Igloolik. In 2009 the film, Le Voyage D'Inuk, a Greenlandic language feature film directed by Mike Magidson and co-written by Magidson and French film producer Jean-Michel Huctin.[135] One of the most famous Inuit artists is Pitseolak Ashoona. Susan Aglukark is a popular singer. Mitiarjuk Attasie Nappaaluk works at preserving Inuktitut and has written the first novel published in that language.[136] In 2006, Cape Dorset was hailed as Canada's most artistic city, with 23% of the labor force employed in the arts.[137] Inuit art such as soapstone carvings is one of Nunavut's most important industries.",
			"color": "slate|0.33928 gray|0.33928 dark|0.13806 slate|0.13806 gray|0.13806 light|0.12631 slate|0.12631 gray|0.12631 black|0.089256 dim|0.025492 gray|0.025492 dim|0.025492 grey|0.025492 white|0.018358 smoke|0.018358 ghost|0.017809 white|0.017809 alice|0.017158 blue|0.017158 snow|0.017077 white|0.016334 sea|0.015891 shell|0.015891 lavender|0.015342 blush|0.015342 mint|0.014477 cream|0.014477 floral|0.013886 white|0.013886 gray|0.013613 grey|0.013613 azure|0.013534 dark|0.011062 gray|0.011062 dark|0.011062 grey|0.011062 saddle|0.011017 brown|0.011017 silver|0.010452 gainsboro|0.010279 light|0.010151 gray|0.010151 light|0.010151 grey|0.010151 rosy|0.0072195 brown|0.0072195 lavender|0.0071444 sienna|0.0059765  "
		}
	}
}
