{
	"add": {
		"doc": {
			"id": "2626a9c4d5ca59ba0633e1349a9889eda46bbe32da39d3cb433571d97ccde9fb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Fractional_3c_worn.jpg/170px-Fractional_3c_worn.jpg",
				"previous": "Nickel, formerly used in the cent, now had no place in American coinage. This was unsatisfactory to Wharton, who sought its return. Although Pollock made no mention of further nickel coinage in his 1864 annual report, Wharton in April of that year published a pamphlet proposing that all non-precious metal coinage be composed of 75% copper and 25% nickel. The copper-nickel cents had contained only 12% nickel, and even so had been difficult for the Mint to strike due to the hardness of the metal, the use of which damaged equipment and quickly broke dies. An alloy of 25% nickel would be even more difficult to coin. Wharton argued that the tough alloy would be difficult to counterfeit.[12]",
				"after": "Congress had by the Act of March 3, 1863 authorized fractional currency in the denomination of 3 cents; when these notes reached circulation the following year they proved wildly unpopular. The 1864 law which had substituted bronze for copper-nickel had also outlawed \"copperheads\" or private token issues. Even though these could now only be issued anonymously, and so could not be redeemed, the copperheads were preferred to the 3-cent shinplasters. Some copperhead tokens even read \"Substitute for shinplasters\". The notes soon became filthy and ragged, making them even more disliked. They were more difficult to value in quantity than notes with denominations divisible by five. According to Walter Breen, \"This was the moment Wharton's supporters had been waiting for.\"[13] Wharton and his advocates argued that the three-cent notes should be redeemed with equivalent coins. They contended that were Congress to order a three-cent bronze coin, such a piece would be as big as an obsolete large cent, and might be used to deceive the blind into accepting the pre-1857 cent rather than the more valuable coin.[14] Pollock, previously an opponent of nickel coinage, had a change of heart and became a supporter.[15]",
			"color": "dim|0.66997 gray|0.66997 dim|0.66997 grey|0.66997 gray|0.29802 grey|0.29802  "
		}
	}
}
