{
	"add": {
		"doc": {
			"id": "26269b4b47a3a22d63562cd95883faaddd6562a7451910ecd17158dfe6735630",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Alexander_von_Humboldt-selfportrait.jpg/185px-Alexander_von_Humboldt-selfportrait.jpg",
				"previous": "Abu Rayhan Biruni (976-1048) first described a polar equi-azimuthal equidistant projection of the celestial sphere.[22][verification needed] He was regarded as the most skilled when it came to mapping cities and measuring the distances between them, which he did for many cities in the Middle East and the Indian subcontinent. He often combined astronomical readings and mathematical equations, in order to develop methods of pin-pointing locations by recording degrees of latitude and longitude. He also developed similar techniques when it came to measuring the heights of mountains, depths of the valleys, and expanse of the horizon. He also discussed human geography and the planetary habitability of the Earth. He also calculated the latitude of Kath, Khwarezm, using the maximum altitude of the Sun, and solved a complex geodesic equation in order to accurately compute the Earth's circumference, which were close to modern values of the Earth's circumference.[23] His estimate of 6,339.9 km for the Earth radius was only 16.8 km less than the modern value of 6,356.7 km. In contrast to his predecessors, who measured the Earth's circumference by sighting the Sun simultaneously from two different locations, al-Biruni developed a new method of using trigonometric calculations, based on the angle between a plain and mountain top, which yielded more accurate measurements of the Earth's circumference, and made it possible for it to be measured by a single person from a single location.[24][verification needed]",
				"after": "The European Age of Discovery during the 16th and the 17th centuries, where many new lands were discovered and accounts by European explorers such as Christopher Columbus, Marco Polo, and James Cook revived a desire for both accurate geographic detail, and more solid theoretical foundations in Europe. The problem facing both explorers and geographers was finding the latitude and longitude of a geographic location. The problem of latitude was solved long ago but that of longitude remained; agreeing on what zero meridian should be was only part of the problem. It was left to John Harrison to solve it by inventing the chronometer H-4 in 1760, and later in 1884 for the International Meridian Conference to adopt by convention the Greenwich meridian as zero meridian.[25]",
			"color": "dim|0.27854 gray|0.27854 dim|0.27854 grey|0.27854 silver|0.21552 gray|0.19744 grey|0.19744 light|0.17833 gray|0.17833 light|0.17833 grey|0.17833 dark|0.10464 gray|0.10464 dark|0.10464 grey|0.10464 gainsboro|0.012207  "
		}
	}
}
