{
	"add": {
		"doc": {
			"id": "262a4bffcef403d9e75a3a1429f3ed6abd72beb0a51df27b4b4e19375e6edb4e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Korea-Gyeongju_Hyanggyo-04.jpg/220px-Korea-Gyeongju_Hyanggyo-04.jpg",
				"previous": "Gyeongju is strongly associated with the education tradition of Hwarangdo (\"Way of the Flower of Young Men\") which was established and flourished during the Silla period. It is a military and philosophical code that offered the basis of training to Hwarang, a military cadet of youths from the aristocratic class. The training equally emphasized practicing academic and martial arts based on Buddhism and patriotism. A number of Silla's greatest generals and military leaders such as Kim Yu-sin were Hwarang who played a central role in Silla unification of the Korean peninsula. As Silla was integrated into the next ruling dynasty, Goryeo, the system declined and was officially disbanded in the Joseon dynasty. However, the spirit and discipline were revived in the second half of the 20th century as a form of Korean martial arts with the same name.[170][171]",
				"after": "Formal education has a longer history in Gyeongju than anywhere else in South Korea. The Gukhak, or national academy, was established here in 682, at the beginning of the Unified Silla period.[172] Its curriculum focused on the Confucian classics for local officials.[22] After the fall of Silla in the 10th century, the Gukhak closed. However, due to Gyeongju's role as a provincial center under the Goryeo and early Joseon dynasties, the city was home to state-sponsored provincial schools (hyanggyo) under both dynasties such as Gyeongju Hyanggyo. During the later Joseon dynasty there were several seowon, or private Confucian academies, were set up in the city such as Oksan Seowon and Seoak Seowon.[173]",
			"color": "tan|0.44414 dark|0.22978 khaki|0.22978 burly|0.14428 wood|0.14428 black|0.031742 peach|0.024672 puff|0.024672 olive|0.01773 drab|0.01773 wheat|0.014832 yellow|0.013158 green|0.013158 pale|0.012841 golden|0.012841 rod|0.012841 khaki|0.012229 dim|0.0079914 gray|0.0079914 dim|0.0079914 grey|0.0079914 bisque|0.0076241  "
		}
	}
}
