{
	"add": {
		"doc": {
			"id": "26356f9b400d89b760f5b163502e42e711eff4b1ea84ec552cb4ddba0a48644b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Ricketts_Glen_State_Park_Canoes.jpg/220px-Ricketts_Glen_State_Park_Canoes.jpg",
				"previous": "Ricketts Glen State Park has extensive acreage of \"interior forest\" that is far from open space; several bird species that are area-sensitive are found within these forests in the park, including the black-throated green warbler, red-eyed vireo, dark-eyed junco and black-capped chickadee. Two species of owl, barred and northern saw-whet, inhabit the deep forests.[23] The hemlock forests of the glens are home to the Louisiana waterthrush, Acadian flycatcher, Blackburnian warbler, blue-headed vireo, magnolia warbler, brown creeper, golden-crowned kinglet and winter wren.[23] Wood thrush are found in the lower elevations of the park and are replaced within the ecosystem by hermit thrush at the higher elevations.[23] The Canada warbler and black-throated blue warbler are on several watchlists, but are common within the park. The Canada warbler inhabits blueberry thickets with white-throated sparrow, while the black-throated blue warbler is found in the forests atop the plateau with the least flycatcher.[23] Common raven are regularly seen soaring over the forests of the park looking for carrion. Canada goose are present in the park and have been classified as a \"pest\" due to their high numbers and the large amount of fecal waste they leave on the shores of Lake Jean.[23] Ricketts Glen's forests also support populations of Nashville and yellow-rumped warblers, yellow-bellied sapsucker, red-breasted nuthatch, and purple finch.[23]",
				"after": "10,144 acres (4,105 ha) of the park are open to hunting and trapping. Common game animals include black bear, gray squirrel, ring-necked pheasant, ruffed grouse, wild turkey, and white-tailed deer. The common fur-bearing animals in Ricketts Glen State Park are beaver, bobcat, coyote, mink, muskrat, and raccoon.[3]",
			"color": "dim|0.21235 gray|0.21235 dim|0.21235 grey|0.21235 dark|0.16383 slate|0.16383 gray|0.16383 dark|0.12532 olive|0.12532 green|0.12532 gray|0.11695 grey|0.11695 brown|0.085829 crimson|0.051804 firebrick|0.046708 indian|0.034879 red|0.034879 slate|0.034626 gray|0.034626 dark|0.025834 gray|0.025834 dark|0.025834 grey|0.025834 light|0.019145 slate|0.019145 gray|0.019145 tan|0.012007 rosy|0.011861 brown|0.011861  "
		}
	}
}
