{
	"add": {
		"doc": {
			"id": "263d953ca300fe4dbe738f61f126e8520df2e85f9b85976e4b4ef59585c4eb91",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/ThompsonWatergate.jpg/220px-ThompsonWatergate.jpg",
				"previous": "Congress can establish post offices and post roads, issue patents and copyrights, fix standards of weights and measures, establish Courts inferior to the Supreme Court, and \"make all Laws which shall be necessary and proper for carrying into Execution the foregoing Powers, and all other Powers vested by this Constitution in the Government of the United States, or in any Department or Officer thereof.\" Article Four gives Congress the power to admit new states into the Union.",
				"after": "One of Congress's foremost non-legislative functions is the power to investigate and oversee the executive branch.[73] Congressional oversight is usually delegated to committees and is facilitated by Congress's subpoena power.[74] Some critics have charged that Congress has in some instances failed to do an adequate job of overseeing the other branches of government. In the Plame affair, critics including Representative Henry A. Waxman charged that Congress was not doing an adequate job of oversight in this case.[75] There have been concerns about congressional oversight of executive actions such as warrantless wiretapping, although others respond that Congress did investigate the legality of presidential decisions.[76] Political scientists Ornstein and Mann suggested that oversight functions do not help members of Congress win reelection. Congress also has the exclusive power of removal, allowing impeachment and removal of the president, federal judges and other federal officers.[77] There have been charges that presidents acting under the doctrine of the unitary executive have assumed important legislative and budgetary powers that should belong to Congress.[78] So-called signing statements are one way in which a president can \"tip the balance of power between Congress and the White House a little more in favor of the executive branch,\" according to one account.[79] Past presidents, including Ronald Reagan, George H. W. Bush, Bill Clinton, and George W. Bush[80] have made public statements when signing congressional legislation about how they understand a bill or plan to execute it, and commentators including the American Bar Association have described this practice as against the spirit of the Constitution.[81][82] There have been concerns that presidential authority to cope with financial crises is eclipsing the power of Congress.[83] In 2008, George F. Will called the Capitol building a \"tomb for the antiquated idea that the legislative branch matters.\"[84]",
			"color": " "
		}
	}
}
