{
	"add": {
		"doc": {
			"id": "264f3b4c5a33f0af4c36cca74d684fa473605da47092bb47c0ec1db6ededa4d3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Phyllomedusa_burmeisteri01.jpg/220px-Phyllomedusa_burmeisteri01.jpg",
			"previous": [],
				"after": "Tree frogs are found high in the canopy, where they scramble around on the branches, twigs, and leaves, sometimes never coming down to earth. The \"true\" tree frogs belong to the family Hylidae, but members of other frog families have independently adopted an arboreal habit, a case of convergent evolution. These include the glass frogs (Centrolenidae), the bush frogs (Hyperoliidae), some of the narrow-mouthed frogs (Microhylidae), and the shrub frogs (Rhacophoridae).[89] Most tree frogs are under 10 cm (4 in) in length, with long legs and long toes with adhesive pads on the tips. The surface of the toe pads is formed from a closely packed layer of flat-topped, hexagonal epidermal cells separated by grooves into which glands secrete mucus. These toe pads, moistened by the mucus, provide the grip on any wet or dry surface, including glass. The forces involved include boundary friction of the toe pad epidermis on the surface and also surface tension and viscosity.[102] Tree frogs are very acrobatic and can catch insects while hanging by one toe from a twig or clutching onto the blade of a windswept reed.[103] Some members of the subfamily Phyllomedusinae have opposable toes on their feet. The reticulated leaf frog (Phyllomedusa ayeaye) has a single opposed digit on each fore foot and two opposed digits on its hind feet. This allows it to grasp the stems of bushes as it clambers around in its riverside habitat.[104]",
			"color": "black|0.43878 dark|0.36432 olive|0.36432 green|0.36432 khaki|0.027848 dark|0.027554 khaki|0.027554 pale|0.027171 golden|0.027171 rod|0.027171 golden|0.01897 rod|0.01897 dark|0.011013 golden|0.011013 rod|0.011013 dim|0.010385 gray|0.010385 dim|0.010385 grey|0.010385 burly|0.010235 wood|0.010235  "
		}
	}
}
