{
	"add": {
		"doc": {
			"id": "2650581ccdd926a069e5febd118d32974df79ee6597d7231ea7a27a820e1cc7d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/United_Airlines_Boeing_777-200_Meulemans.jpg/220px-United_Airlines_Boeing_777-200_Meulemans.jpg",
				"previous": "On April 16, 2010, United resumed merger talks with Continental Airlines. (The two airlines had previously discussed merging in 2008.)[42] The board of directors of both Continental and UAL Corporation's United Airlines reached an agreement to combine operations on May 2, 2010. The combined carrier would retain the United Airlines name, but use Continental's logo and livery, and Continental's CEO Jeff Smisek would head the new company. The merger was contingent upon shareholder and regulatory approval.[43]",
				"after": "The Continental–United merger was approved by the European Commission in July 2010 and by the US Justice Department on August 27, 2010.[44][45] On September 17, 2010, United's shareholders approved the merger deal with Continental Airlines.[46] Both carriers planned to begin merging operations in 2011 to form the world's biggest carrier.[47] On October 1, 2010, UAL Corporation completed its merger with Continental Airlines and changed its name to United Continental Holdings, Inc. The airline received a single operating certificate from the FAA on November 30, 2011.[48] On March 3, 2012, Continental and United merged their passenger service systems, frequent-flier programs, and websites which officially eliminated the Continental name and brand as far as the public was concerned.[49]",
			"color": "light|0.6984 slate|0.6984 gray|0.6984 black|0.080262 slate|0.033214 gray|0.033214 dark|0.018796 gray|0.018796 dark|0.018796 grey|0.018796 silver|0.014437 light|0.012802 gray|0.012802 light|0.012802 grey|0.012802 dim|0.012332 gray|0.012332 dim|0.012332 grey|0.012332 light|0.01158 steel|0.01158 blue|0.01158 gainsboro|0.011526 gray|0.010245 grey|0.010245 linen|0.0093024 antique|0.0079708 white|0.0079708 sea|0.0075674 shell|0.0075674 old|0.0071174 lace|0.0071174 white|0.0068055 smoke|0.0068055 floral|0.0064629 white|0.0064629  "
		}
	}
}
