{
	"add": {
		"doc": {
			"id": "265426bc5aa861bf11585b308684ddc20877819c02717b80a927f43a5c18d659",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/The_Garden_of_Earthly_Delights_by_Bosch_High_Resolution.jpg/480px-The_Garden_of_Earthly_Delights_by_Bosch_High_Resolution.jpg",
				"previous": "In the 14th century, as Gothic art gave way to the International Gothic era, a number of schools developed in northern Europe. Early Netherlandish art originated in French courtly art, and is especially tied to the tradition and conventions of illuminated manuscripts. Modern art historians see the era as beginning with 14th-century manuscript illuminators. They were followed by panel painters such as Melchior Broederlam and Robert Campin, the latter generally considered the first Early Netherlandish master, under whom van der Weyden served his apprenticeship.[9] Illumination reached a peak in the region in the decades after 1400, mainly due to the patronage of Burgundian and House of Valois-Anjou dukes such as Philip the Bold, Louis I of Anjou and Jean, Duke of Berry. This patronage continued in the low countries with the Burgundian dukes, Philip the Good and his son Charles the Bold.[12] The demand for illuminated manuscripts declined towards the end of the century, perhaps because of the costly production process in comparison to panel painting. Yet illumination remained popular at the luxury end of the market, and prints, both engravings and woodcuts, found a new mass market, especially those by artists such as Martin Schongauer and Albrecht Dürer.[13]",
				"after": "Following van Eyck's innovations, the first generation of Netherlandish painters emphasised light and shadow, elements usually absent from 14th-century illuminated manuscripts.[14] Biblical scenes were depicted with more naturalism, which made their content more accessible to viewers, while individual portraits became more evocative and alive.[15] Johan Huizinga said that art of the era was meant to be fully integrated with daily routine, to \"fill with beauty\" the devotional life in a world closely tied to the liturgy and sacraments.[16] After about 1500 a number of factors turned against the pervasive Northern style, not least the rise of Italian art, whose commercial appeal began to rival Netherlandish art by 1510, and overtook it some ten years later. Two events symbolically and historically reflect this shift: the transporting of a marble Madonna and Child by Michelangelo to Bruges in 1506,[13] and the arrival of Raphael's tapestry cartoons to Brussels in 1517, which were widely seen while in the city.[17] Although the influence of Italian art was soon widespread across the north, it in turn had drawn on the 15th-century northern painters, with Michelangelo's Madonna based on a type developed by Hans Memling.[13]",
			"color": "black|0.34376 dark|0.082248 olive|0.082248 green|0.082248 dark|0.077287 slate|0.077287 gray|0.077287 dim|0.064773 gray|0.064773 dim|0.064773 grey|0.064773 dark|0.059473 khaki|0.059473 tan|0.057178 olive|0.050341 gray|0.04756 grey|0.04756 saddle|0.029483 brown|0.029483 dark|0.028666 gray|0.028666 dark|0.028666 grey|0.028666 silver|0.020041  "
		}
	}
}
