{
	"add": {
		"doc": {
			"id": "2676b41039893e6e4f548ba1c01332b69b776c7fc57898ca0fcd9290b6adb4dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Pezophaps.png/220px-Pezophaps.png",
				"previous": "The Rodrigues solitaire probably became extinct sometime between the 1730s and 1760s; the exact date is unknown. Its disappearance coincided with the tortoise trade between 1730 and 1750; traders burnt off vegetation, hunted solitaires and imported cats and pigs that preyed on eggs and chicks.[38] In 1755, Joseph-François Charpentier de Cossigny attempted to obtain a live specimen, as he had been assured the Rodrigues solitaire still survived in remote areas of the island. Though trying for 18 months, and offering large rewards, none could be found. He noted that cats were blamed for decimating the species, but suspected that it was due to hunting by humans instead.[38] Alexandre Guy Pingré did not encounter any solitaires when he visited Rodrigues to observe the 1761 transit of Venus, although he had been assured they survived. His friend Pierre Charles Le Monnier named the constellation Turdus Solitarius after the bird to commemorate the journey. Although the Rodrigues solitaire is the only extinct bird to have a former constellation named for it, celestial mapmakers did not know what it looked like and star maps depict other birds.[29]",
				"after": "In 1786, subfossil Rodrigues solitaire bones encrusted in stalagmite were discovered in a cave and sent to Georges Cuvier about 1830. For unknown reasons, he stated they had recently been found on Mauritius, which caused confusion, until they were compared with other bones from Rodrigues that were found to belong to the same species.[39] These finds confirmed Leguat's descriptions, but at this time no living residents of Rodrigues remembered having seen live specimens. In 1831, a man who had lived on Rodrigues for 40 years said that he had never seen birds large enough to be Rodrigues solitaires. Rodrigues covers only 104 square kilometres (40 sq mi), making it implausible that the bird would have survived undetected.[23]",
			"color": "gray|0.40157 grey|0.40157 dark|0.17763 gray|0.17763 dark|0.17763 grey|0.17763 dim|0.13726 gray|0.13726 dim|0.13726 grey|0.13726 antique|0.04986 white|0.04986 silver|0.041976 beige|0.024311 linen|0.023561 light|0.022416 gray|0.022416 light|0.022416 grey|0.022416 old|0.021281 lace|0.021281 papaya|0.019667 whip|0.019667 gainsboro|0.01594 corn|0.011433 silk|0.011433 floral|0.010244 white|0.010244 sea|0.010237 shell|0.010237 ivory|0.0082376 blanched|0.005808 almond|0.005808 tan|0.0044961  "
		}
	}
}
