{
	"add": {
		"doc": {
			"id": "2679442a0cbbf38d5c763430fa9aeb67789d0396a38a66d68b77c39a72d108f6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Norton_Priory_tiles.jpg/220px-Norton_Priory_tiles.jpg",
			"previous": [],
				"after": "A large number of tiles and tile fragments that had lined the floor of the church and some of the monastic buildings were found in the excavations.[123] The oldest tiles date from the early 14th century. The total area of tiles discovered was about 80 square metres (860 sq ft), and is \"the largest area of a floor of this type to be found in any modern excavation\".[124] The site has \"the largest, and most varied, excavated collection of medieval tiles in the North West\" and \"the greatest variety of individual mosaic shapes found anywhere in Britain\".[125] The tiles found made a pavement forming the floor of the choir of the church and the transepts. The chancel floor was probably also tiled; these tiles have not survived because the chancel was at a higher level than the rest of the church, and the tiles would have been removed during subsequent gardening. A dump of tiles to the south of the site of the chapter house suggests that this was also tiled.[124] In the 15th century a second tile floor was laid on top of the original floor in the choir where it had become worn.[126] The tiles on the original floor were of various shapes, forming a mosaic.[124] The tiles were all glazed and coloured, the main colours being black, green and yellow. Many of them had been decorated by impressing a wooden stamp into the moist clay before it was fired; these are known as line-impressed tiles.[127] The line-impressed designs included masks of lions or other animals, rosettes, and trefoils.[128] Other tiles or tile fragments showed portions of trees, foliage, birds and inscriptions.[129] In the chapels of the north transept, the burial place of the Dutton family, were tiles depicting mail, thought to be part of a military effigy, and tiles bearing fragments of heraldic designs.[130] The tiles from the upper (later) pavement were all square, and again were line-inscribed with patterns forming parts of larger designs.[131] A related discovery at the excavation was the kiln in which most of the tiles on the site were fired.[132]",
			"color": "peru|0.28076 sienna|0.21984 dark|0.095742 slate|0.095742 gray|0.095742 tan|0.069533 dim|0.069241 gray|0.069241 dim|0.069241 grey|0.069241 sandy|0.048955 brown|0.048955 black|0.048738 saddle|0.035296 brown|0.035296 burly|0.029441 wood|0.029441 dark|0.025236 khaki|0.025236 gray|0.021963 grey|0.021963  "
		}
	}
}
