{
	"add": {
		"doc": {
			"id": "26852b5b9ad756536a0651599f796c3eb758e0232a8469a441fb6ff080180009",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Ramaria_botrytis_190863.jpg/180px-Ramaria_botrytis_190863.jpg",
				"previous": "The fruit bodies produced by the fungus are 7 to 15 cm (2.8 to 5.9 in) wide and 6 to 20 cm (2.4 to 7.9 in) tall.[9] They are fleshy cauliflower-like masses with a stout central stem that splits into a few lower primary branches before branching densely above. The stem is short and thick—between 1.5 and 6 cm (0.6 and 2.4 in) in diameter—and tapers downward. Initially white, in age both the stem and branches turn pale yellow to buff to tan.[13] Old fruit bodies can fade to become almost white,[19] or may be ochre due to fallen spores.[14] The branching pattern is irregular, with the primary branches few and thick—typically 2–3 cm (0.8–1.2 in)—and the final branches slender (2–3 mm),[13] and usually terminated with five to seven branchlets.[7] The branchlet tips are pink to purplish-red. The flesh is solid and white,[13] and has an odor described variously as indistinct[20] or pleasant.[21] A drop of Melzer's reagent applied to the stem tissue reveals a weak amyloid staining reaction that often requires more than 30 minutes to develop. This reaction can be used to help distinguish R. botrytis from other similar fungi.[7]",
				"after": "Spores are produced by basidia on the outer surface of the branches. Viewed in deposit, the spores are pale yellow. Microscopically, they have fine longitudinal or oblique striations that often fuse together in a vein-like network. They range in shape from roughly cylindrical to sigmoid (curved like the letter \"S\"), and their dimensions are 12–16 by 4–5 µm.[22][23] Basidia are four-spored (occasionally two-spored), and measure 59–82 by 8–11 µm. The sterigmata (slender projections of the basidia that attach to the spores) are 4–8 µm long. The hymenium and subhymenium (the tissue layer immediately under the hymenium) combined are about 80 µm thick. Hyphae comprising the subhymenium are interwoven, 2.5–4.5 µm in diameter, thin-walled, and clamped.[7]",
			"color": "burly|0.22084 wood|0.22084 navajo|0.1278 white|0.1278 sandy|0.12363 brown|0.12363 khaki|0.12119 pale|0.065951 golden|0.065951 rod|0.065951 moccasin|0.039467 wheat|0.029799 golden|0.026486 rod|0.026486 peach|0.021536 puff|0.021536 tan|0.021303 light|0.014818 salmon|0.014818 dark|0.013804 khaki|0.013804 peru|0.012984 dim|0.011945 gray|0.011945 dim|0.011945 grey|0.011945 bisque|0.0096314 dark|0.0095764 salmon|0.0095764 orange|0.0088215 gray|0.0085591 grey|0.0085591  "
		}
	}
}
