{
	"add": {
		"doc": {
			"id": "26a5d574fb53254781bb819d97bbc076d1fbf72aad50666e5385f15feb6c654d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Parlamaid_na_h-Alba_Doras_BPA_200411.jpg/220px-Parlamaid_na_h-Alba_Doras_BPA_200411.jpg",
				"previous": "In October 2009, a new agreement was made which allows Scottish Gaelic to be used formally between Scottish Government ministers and European Union officials. The deal was signed by Britain's representative to the EU, Sir Kim Darroch, and the Scottish government. This does not give Scottish Gaelic official status in the EU, but gives it the right to be a means of formal communications in the EU's institutions. The Scottish government will have to pay for the translation from Gaelic to other European languages. The deal was received positively in Scotland; Secretary of State for Scotland Jim Murphy said the move was a strong sign of the UK government's support for Gaelic. He said that \"Allowing Gaelic speakers to communicate with European institutions in their mother tongue is a progressive step forward and one which should be welcomed\". Culture Minister Mike Russell said that \"this is a significant step forward for the recognition of Gaelic both at home and abroad and I look forward to addressing the council in Gaelic very soon. Seeing Gaelic spoken in such a forum raises the profile of the language as we drive forward our commitment to creating a new generation of Gaelic speakers in Scotland.\"[48]",
				"after": "The Scottish Gaelic used in Machine-readable British passports differs from Irish passports in places. \"Passport\" is rendered Cead-siubhail (in Irish, Pas); \"The European Union\", Aonadh Eòrpach (in Irish, An tAontas Eorpach), while \"Northern Ireland\" is Èirinn a Tuath in Gaelic (the Irish equivalent is Tuaisceart Éireann).",
			"color": "dim|0.39594 gray|0.39594 dim|0.39594 grey|0.39594 gray|0.27231 grey|0.27231 dark|0.19242 gray|0.19242 dark|0.19242 grey|0.19242 silver|0.067815 light|0.030399 gray|0.030399 light|0.030399 grey|0.030399 gainsboro|0.018943 black|0.0070475  "
		}
	}
}
