{
	"add": {
		"doc": {
			"id": "26a933f0e778d31754b21c82d7605756fc90c06d0c65cc24d77e66e777a3e911",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/United_States_farm_subsidies_%28source_Congressional_Budget_Office%29.svg/290px-United_States_farm_subsidies_%28source_Congressional_Budget_Office%29.svg.png",
				"previous": "It has been suggested that some transgenic plants may some day be developed which would allow for maintaining or increasing yields while requiring fewer fossil-fuel-derived inputs than conventional crops.[180] The possibility of success of these programs is questioned by ecologists and economists concerned with unsustainable GMO practices such as terminator seeds.[181][182] While there has been some research on sustainability using GMO crops, at least one prominent multi-year attempt by Monsanto Company has been unsuccessful, though during the same period traditional breeding techniques yielded a more sustainable variety of the same crop.[183]",
				"after": "Agricultural policy is the set of government decisions and actions relating to domestic agriculture and imports of foreign agricultural products. Governments usually implement agricultural policies with the goal of achieving a specific outcome in the domestic agricultural product markets. Some overarching themes include risk management and adjustment (including policies related to climate change, food safety and natural disasters), economic stability (including policies related to taxes), natural resources and environmental sustainability (especially water policy), research and development, and market access for domestic commodities (including relations with global organizations and agreements with other countries).[184] Agricultural policy can also touch on food quality, ensuring that the food supply is of a consistent and known quality, food security, ensuring that the food supply meets the population's needs, and conservation. Policy programs can range from financial programs, such as subsidies, to encouraging producers to enroll in voluntary quality assurance programs.[185]",
			"color": "red|0.4897 blue|0.095808 magenta|0.090189 fuchsia|0.090189 aqua|0.047472 cyan|0.047472 yellow|0.038323 black|0.038323 dim|0.024492 gray|0.024492 dim|0.024492 grey|0.024492 green|0.014119 maroon|0.013687 dark|0.013687 red|0.013687 dark|0.0087163 gray|0.0087163 dark|0.0087163 grey|0.0087163 medium|0.0076358 blue|0.0076358 silver|0.0062671 gray|0.0062431 grey|0.0062431 dark|0.0051866 cyan|0.0051866 teal|0.0038899 dark|0.0038899 magenta|0.0038899 white|0.0036959 smoke|0.0036959  "
		}
	}
}
