{
	"add": {
		"doc": {
			"id": "26c04352c8e40de1356c4ffcce92e4141c091b7088e84958e62326d4879088e6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Reproduction_Hunnu_bow_-_National_Museum_of_Mongolian_History.jpg/150px-Reproduction_Hunnu_bow_-_National_Museum_of_Mongolian_History.jpg",
				"previous": "In the 1920s, Pyotr Kozlov's excavations of the royal tombs at Noin-Ula in northern Mongolia that date to around the 1st century CE, provided a glimpse into the lost world of the Xiongnu. Other archaeological sites have been unearthed in Inner Mongolia and elsewhere; they represent the Neolithic and historical periods of the Xiongnu's history.[82] Those included the Ordos culture, many of them had been identified as the Xiongnu cultures. The region was occupied predominantly by peoples showing Mongoloid features, known from their skeletal remains and artifacts. Portraits found in the Noin-Ula excavations demonstrate other cultural evidences and influences, showing that Chinese and Xiongnu art have influenced each other mutually. Some of these embroidered portraits in the Noin-Ula kurgans also depict the Xiongnu with long braided hair with wide ribbons, which are seen to be identical with the Turkic Ashina clan hair-style.[83] Well-preserved bodies in Xiongnu and pre-Xiongnu tombs in the Mongolian Republic and southern Siberia show both 'Mongoloid' and 'Caucasian' features.[84] Analysis of skeletal remains from sites attributed to the Xiongnu provides an identification of dolichocephalic Mongoloid, ethnically distinct from neighboring populations in present-day Mongolia.[85] Russian and Chinese anthropological and craniofacial studies show that the Xiongnu were physically very heterogenous, with six different population clusters showing different degrees of Mongoloid and Caucasoid physical traits. These clusters point to significant cross-regional migrations (both east to west and west to east) that likely started in the Neolithic period and continued to the medieval Mongolian period.[64]",
				"after": "Presently, there exist four fully excavated and well documented cemeteries: Ivolga,[86] Dyrestui,[87] Burkhan Tolgoi,[88][89] and Daodunzi.[90][91] Additionally thousands of tombs have been recorded in Transbaikalia and Mongolia. In addition to these, the Tamir 1 excavation site from a 2005 Silkroad Arkanghai Excavation Project is the only Xiongnu cemetery in Mongolia to be fully mapped in scale.[92] Tamir 1 was located on Tamiryn Ulaan Khoshuu, a prominent granitic outcrop near other cemeteries of the Neolithic, Bronze Age, and Mongol periods.[93] Important finds at the site included a lacquer bowl, glass beads, and three TLV mirrors. Archaeologists from this project believe that these artifacts paired with the general richness and size of the graves suggests that this cemetery was for more important or wealthy Xiongnu individuals.[93] The TLV mirrors are of particular interest. Three mirrors were acquired from three different graves at the site. The mirror found at feature 160 is believed to be a low-quality, local imitation of a Han mirror, while the whole mirror found at feature 100 and fragments of a mirror found at feature 109 are believed to belong to the classical TLV mirrors and date back to the Xin Dynasty or the early to middle Eastern Han period.[94] The archaeologists have chosen to, for the most part, refrain from positing anything about Han-Xiongnu relations based on these particular mirrors. However, they were willing to mention the following: \"There is no clear indication of the ethnicity of this tomb occupant, but in a similar brick-chambered tomb of late Eastern Han period at the same cemetery, archaeologists discovered a bronze seal with the official title that the Han government bestowed upon the leader of the Xiongnu. The excavators suggested that these brick chamber tombs all belong to the Xiongnu (Qinghai 1993).\"[94]",
			"color": "tan|0.68379 dark|0.12141 gray|0.12141 dark|0.12141 grey|0.12141  "
		}
	}
}
