{
	"add": {
		"doc": {
			"id": "26c4a643def4fa2ee7ccac43d233ce749dfe76e1ccbd2e6cdb2b72e4be4e8fa2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Apollo_11_insignia.png/220px-Apollo_11_insignia.png",
			"previous": [],
				"after": "For Mint Chief Engraver Frank Gasparro, the opportunity to put Eisenhower on a coin was the fulfillment of a longtime dream. On June 19, 1945, Gasparro had been one of more than 4,000,000 people who gathered in New York to watch a parade in honor of the Allied victory in Europe. Although Gasparro, then an assistant engraver at the Mint, only saw a glimpse of General Eisenhower, he stepped back from the crowd and sketched the general's features. That sketch served as the basis of his design for the obverse. Gasparro consulted with the late president's widow, Mamie Eisenhower, as to the designs of both sides of the coin; the former First Lady was presented with a galvano (a metallic model used in the coin design process) by Brooks and Gasparro on January 1, 1971.[24] Gasparro wrote in 1991 that he had six weeks to complete the work beginning in mid-November 1970, that his extensive research into eagles over the years was a great help in creating the reverse, and that his sketches were adopted without change. The chief engraver was not given full freedom of design; he was instructed to have the layout of the obverse resemble that of the Washington quarter.[25]",
			"color": "black|0.18275 dark|0.060445 gray|0.060445 dark|0.060445 grey|0.060445 dim|0.052892 gray|0.052892 dim|0.052892 grey|0.052892 silver|0.051386 light|0.049525 gray|0.049525 light|0.049525 grey|0.049525 white|0.044922 smoke|0.044922 gainsboro|0.044496 gray|0.041135 grey|0.041135 snow|0.03953 ghost|0.039098 white|0.039098 sea|0.038977 shell|0.038977 alice|0.03649 blue|0.03649 white|0.03587 lavender|0.033386 blush|0.033386 floral|0.032455 white|0.032455 mint|0.031009 cream|0.031009 saddle|0.029596 brown|0.029596 azure|0.025067 linen|0.018969 slate|0.017418 gray|0.017418 light|0.016914 slate|0.016914 gray|0.016914 dark|0.013572 slate|0.013572 gray|0.013572 steel|0.010011 blue|0.010011 misty|0.0094975 rose|0.0094975 ivory|0.0077735 lavender|0.006592 sienna|0.0060132  "
		}
	}
}
