{
	"add": {
		"doc": {
			"id": "26c51f19387e53fae9beac514f7c375d4e81245abc715bbfb79b5844f5296536",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Semantic_field_diagram_of_words_for_sentient_beings_in_Old_Norse.gif/400px-Semantic_field_diagram_of_words_for_sentient_beings_in_Old_Norse.gif",
				"previous": "For a long time, views about elves in Old Norse mythology were defined by Snorri Sturluson's Prose Edda, which talks about svartálfar, døkkálfar and ljósálfar. However, these words are only attested in the Prose Edda and texts based on it, and it is now agreed that they reflect traditions of dwarves, demons, and angels, partly showing Snorri's 'paganisation' of a Christian cosmology learned from the Elucidarius.[23]",
				"after": "Scholars of Old Norse mythology now focus on references to elves in Old Norse poetry, particularly the Elder Edda. The only character explicitly identified as an elf in classical Eddaic poetry, if any, is Völundr, the protagonist of Völundarkviða.[52] However, elves are frequently mentioned in the alliterating formulaic collocation Æsir ok Álfar ('Æsir and elves') and its variants. This shows a strong tradition of associating elves with the Æsir, or sometimes even of not distinguishing between the two groups.[53] The collocation is paralleled in the Old English poem Wið færstice;[54] in the Germanic personal name system;[15] and in Skaldic verse the word elf is used in the same way as words for gods.[55] Sigvatr Þórðarson’s skaldic travelogue Austrfaravísur, composed around 1020, mentions an álfablót (‘elves' sacrifice’) in Edskogen in what is now southern Sweden.[56] There does not seem to have been any clear-cut distinction between humans and gods; like the Æsir, then, elves were presumably thought of as being human(-like) and existing in opposition to the giants.[57] Many commentators have also (or instead) argued for conceptual overlap between elves and dwarves in Old Norse mythology, which may fit with trends in the medieval German evidence.[4]",
			"color": " "
		}
	}
}
