{
	"add": {
		"doc": {
			"id": "26cc66920365e431aec62c9d04f10cf6da77c4fc8463d07ba6b03c63712cf928",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Fenway_Park_2009.jpg/220px-Fenway_Park_2009.jpg",
				"previous": "Boston has teams in the four major North American professional sports leagues plus Major League Soccer, and has won 35 championships in these leagues, As of 2013[update]. It is one of six cities (along with Chicago, Detroit, Los Angeles, New York and Philadelphia) to have won championships in all four major sports. It has been suggested[167][168][169] that Boston is the new \"TitleTown, USA\", as the city's professional sports teams have won nine championships since 2001: Patriots (2001, 2003, 2004, and 2014), Red Sox (2004, 2007, and 2013), Celtics (2008), and Bruins (2011). This love of sports has made Boston the United States Olympic Committee's choice to bid to hold the 2024 Summer Olympic Games.[170] See Boston bid for the 2024 Summer Olympics.",
				"after": "The Boston Red Sox, a founding member of the American League of Major League Baseball in 1901, play their home games at Fenway Park, near Kenmore Square in the city's Fenway section. Built in 1912, it is the oldest sports arena or stadium in active use in the United States among the four major professional American sports leagues, encompassing Major League Baseball, the National Football League, National Basketball Association, and the National Hockey League.[171] Boston was the site of the first game of the first modern World Series, in 1903. The series was played between the AL Champion Boston Americans and the NL champion Pittsburgh Pirates.[172][173] Persistent reports that the team was known in 1903 as the \"Boston Pilgrims\" appear to be unfounded.[174] Boston's first professional baseball team was the Red Stockings, one of the charter members of the National Association in 1871, and of the National League in 1876. The team played under that name until 1883, under the name Beaneaters until 1911, and under the name Braves from 1912 until they moved to Milwaukee after the 1952 season. Since 1966 they have played in Atlanta as the Atlanta Braves.[175]",
			"color": "black|0.67998 dim|0.044838 gray|0.044838 dim|0.044838 grey|0.044838 burly|0.038202 wood|0.038202 gray|0.017813 grey|0.017813 rosy|0.017299 brown|0.017299 light|0.01699 salmon|0.01699 sienna|0.015473 khaki|0.015417 navajo|0.013966 white|0.013966 pale|0.011556 golden|0.011556 rod|0.011556  "
		}
	}
}
