{
	"add": {
		"doc": {
			"id": "26cc23c173e188aa1040da726182d06b75815ed32bc8edf6bdb9c014b483f789",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Boeing_707-138B_Qantas_Jett_Clipper_Ella_N707JT.jpg/225px-Boeing_707-138B_Qantas_Jett_Clipper_Ella_N707JT.jpg",
				"previous": "Among the first European settlers in Renton were Henry Tobin and his wife Diana Tobin. The town of Renton was founded as the 'Renton Cooperative Coal Organization' on Feb 16, 1895 by Erasmus M. Smithers. Smithers discovered coal there and brought in Charles D. Shattuck as coal mine operator. Renton was incorporated as a city in 1901 (September 6) when coal mining and timber processing were the most important economic industries in the area. The town was prone to flooding from the Cedar and Black Rivers. In 1916 the completion of the Lake Washington Ship Canal lowered the surface of Lake Washington several feet which consequently eliminated drainage of Lake Washington through the Black River. The Cedar River was then diverted to drain into Lake Washington instead of the Black River. The culmination of these actions reduced the threat of annual flooding.",
				"after": "Paccar has traditionally been a large employer in the city as well with its Kenworth Truck plant located in Renton's industrial area on the south end of Lake Washington In 1907 the Seattle Car Mfg Company also known as the Car Company moved to a large manufacturing plant in Renton after demand for the company's railroad equipment exceeded the capacity of its Seattle plant. The Car Company was the only manufacturer of train cars on the west coast. Seattle Car expanded from building logging cars to many types of railway cars, in 1909 building passenger cars for China's Sun Ning Railway, and refrigerator cars in 1909. The Renton plant expanded to foundry capabilities in 1911, and Seattle Car and Foundry Co merged with the Twohy Brothers of Portland in 1917 and became the Pacific Car and Foundry Company or Paccar. During the great depression the Renton Paccar plant developed power winches for use in the logging industry. When World War II arrived the Renton manufacturing switched its production towards the war effort, and by the wars end in 1945 had built 1,500 Sherman Tanks. In the second half of the 20th century Paccar's train cars manufactured at the Renton facility were of such high quality that there was not enough repeat business, rail equipment in 1965 came to only 1/3 of the company's sales. The Paccar Renton plan manufactured structural steel until the 1970s recession, and in the early 1980s the Paccar Railcar Division; the last vestige of the original Pacific Car and Foundry Co closed down. In 1993 a new Kenworth assembly plant opens on the former site of Pacific Car and Foundry. The Kenworth truck manufacturing facility in Renton is named as a leader in King County's Best Workplace for Recyclers.[5]",
			"color": "silver|0.31548 light|0.21464 gray|0.21464 light|0.21464 grey|0.21464 gainsboro|0.14075 dark|0.087278 gray|0.087278 dark|0.087278 grey|0.087278 light|0.081104 steel|0.081104 blue|0.081104 dim|0.022257 gray|0.022257 dim|0.022257 grey|0.022257 white|0.016231 smoke|0.016231 gray|0.01559 grey|0.01559 light|0.011158 slate|0.011158 gray|0.011158 alice|0.0096143 blue|0.0096143 slate|0.0088923 gray|0.0088923 black|0.0081646 brown|0.00573 ghost|0.0046514 white|0.0046514 azure|0.004569 light|0.0044506 blue|0.0044506 mint|0.0043217 cream|0.0043217 lavender|0.0042134 dark|0.0038338 slate|0.0038338 gray|0.0038338 maroon|0.0036948 snow|0.0034057  "
		}
	}
}
