{
	"add": {
		"doc": {
			"id": "26d4f21b09268e6f66b17307d289079a2196c6a1a0758816212ec1bbf029468e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Scotty%27s_Castle_under_construction.JPG/287px-Scotty%27s_Castle_under_construction.JPG",
				"previous": "After abandoning their wagons, they eventually were able to hike out of the valley. Just after leaving the valley, one of the women in the group turned and said, \"Goodbye Death Valley,\" giving the valley they endured its name.[20][note 3] Included in the party was William Lewis Manly whose autobiographical book Death Valley in '49 detailed this trek and popularized the area (geologists later named the prehistoric lake that once filled the valley after him).",
				"after": "The ores that are most famously associated with the area were also the easiest to collect and the most profitable: evaporite deposits such as salts, borate, and talc. Borax was found by Rosie and Aaron Winters near Furnace Creek Ranch (then called Greenland) in 1881.[21] Later that same year, the Eagle Borax Works became Death Valley's first commercial borax operation. William Tell Coleman built the Harmony Borax Works plant and began to process ore in late 1883 or early 1884, continuing until 1888.[22] This mining and smelting company produced borax to make soap and for industrial uses.[23] The end product was shipped out of the valley 165 miles (266 km) to the Mojave railhead in 10-ton-capacity wagons pulled by \"twenty-mule teams\" that were actually teams of 18 mules and two horses each.[23] The teams averaged two miles (3 km) an hour and required about 30 days to complete a round trip.[21] The trade name 20-Mule Team Borax was established by Francis Marion Smith's Pacific Coast Borax Company after Smith acquired Coleman's borax holdings in 1890. A memorable advertising campaign used the wagon's image to promote the Boraxo brand of granular hand soap and the Death Valley Days radio and television programs. In 1914, the Death Valley Railroad was built to serve mining operations on the east side of the valley. Mining continued after the collapse of Coleman's empire, and by the late 1920s the area was the world's number one source of borax.[5] Some four to six million years old, the Furnace Creek Formation is the primary source of borate minerals gathered from Death Valley's playas.[21]",
			"color": " "
		}
	}
}
