{
	"add": {
		"doc": {
			"id": "26e901afc8e0841599d81985b9e8a92b4ebec5ebe108c165dd81967cda0d2f90",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Ciconia_ciconia_juv_small.jpg/220px-Ciconia_ciconia_juv_small.jpg",
				"previous": "The white stork's decline due to industrialisation and agricultural changes (principally the draining of wetlands and conversion of meadows to crops such as maize) began in the 19th century: the last wild individual in Belgium was seen in 1895, in Sweden in 1955, in Switzerland in 1950 and in the Netherlands in 1991. However, the species has since been reintroduced to many regions.[113] It has been rated as Least Concern by the IUCN since 1994, after being evaluated as Near Threatened in 1988.[1] The white stork is one of the species to which the Agreement on the Conservation of African-Eurasian Migratory Waterbirds (AEWA) applies.[114] Parties to the agreement are required to engage in a wide range of conservation strategies described in a detailed action plan. The plan is intended to address key issues such as species and habitat conservation, management of human activities, research, education, and implementation.[115] Threats include the continued loss of wetlands, collisions with overhead power lines, use of persistent pesticides (such as DDT) to combat locusts in Africa, and largely illegal hunting on migration routes and wintering grounds.[8]",
				"after": "A large population of white storks breeds in central (Poland, Ukraine and Germany) and southern Europe (Spain and Turkey). In a 2004/05 census, there were 52,500 pairs in Poland, 30,000 pairs in Ukraine, 20,000 pairs in Belarus, 13,000 pairs in Lithuania (the highest known density of this species in the world), 10,700 pairs in Latvia, and 10,200 in Russia. There were around 5,500 pairs in Romania, 5,300 in Hungary and an estimated 4,956 breeding pairs in Bulgaria.[116] In Germany, the majority of the total 4,482 pairs were in the eastern region, especially in the states of Brandenburg and Mecklenburg-Vorpommern (1296 and 863 pairs in 2008 respectively).[117] Apart from Spain and Portugal (33,217 and 7,684 pairs in 2004/05 respectively), populations are generally much less stable. The Danish population declined to just three pairs in 2005. In the eastern Mediterranean region Turkey has a sizeable population of 6195 pairs, and Greece 2139 pairs. In Western Europe the white stork remains a rare bird despite conservation efforts. In 2004 France had only 973 pairs, and the Netherlands 528 pairs.[116]",
			"color": "black|0.58721 dim|0.12497 gray|0.12497 dim|0.12497 grey|0.12497 gray|0.080083 grey|0.080083 dark|0.048824 gray|0.048824 dark|0.048824 grey|0.048824 light|0.038513 slate|0.038513 gray|0.038513 slate|0.026641 gray|0.026641 light|0.020516 steel|0.020516 blue|0.020516 silver|0.016285 tan|0.010518 light|0.006535 gray|0.006535 light|0.006535 grey|0.006535  "
		}
	}
}
