{
	"add": {
		"doc": {
			"id": "26ea991827111e965f7e94994c76b4cd4504ffed63b8aa132baa2b287d16a8ce",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Anak_Plaque_1921.jpg/220px-Anak_Plaque_1921.jpg",
				"previous": "A philanthropic organization, the ANAK Society annually awards two undergraduate student scholarships, the George Wingfield Semmes Memorial Scholarship[39] and the Merri Gaye Hitt Memorial Scholarship.[40] Semmes and Hitt were both Georgia Tech alumni and ANAK members; Semmes, the Class of 1910[41] and Hitt, the Class of 1977.[42] Additionally, the society annually recognizes distinguished Georgia Tech alumni with the Joseph M. Pettit Distinguished Service Award (formerly the ANAK Service Award).[43] Finally, since 1942 (annually since 1947),[7] the society has presented the ANAK Award to an outstanding Georgia Tech faculty member.[44] This award is considered \"the highest honor the undergraduate student body can bestow on a Georgia Tech faculty member\".[7] For example, upon his retirement in 1999, Georgia Tech professor David J. McGill recalled winning the ANAK Award in 1990 as the highlight of his teaching career, despite having also won two Outstanding Teaching Awards (in 1974 and 1986) and being named the Carnegie Foundation's Professor of the Year for the state of Georgia in 1996.[45]",
				"after": "The ANAK Society has donated a number of gifts to Georgia Tech. In 1921, the society donated a staircase connecting Tech Tower to the D. P. Savant Building.[46] The staircase bears a plaque naming ANAK as the benefactor,[47] one of very few conspicuous declarations of the society's existence on the Georgia Tech campus. On September 26, 1947, ANAK presented a life-size bronze bust of Georgia Tech football head coach William A. Alexander to the Georgia Tech Athletic Association to commemorate the society's 40th anniversary.[29] The bust was sculpted by Julian H. Harris, a noted sculptor, architect, and Georgia Tech professor from 1936 to 1972.[48] Along with the Class of 1924, ANAK gifted a portrait of William Henry Emerson, Georgia Tech's first dean, to Georgia Tech in 1924. The portrait was painted by noted Atlanta artist Kate Edwards. After being lost some time in the 1980s, the portrait was found and restored in the early 1990s. It has hung in the atrium of the Lyman Hall Building since October 15, 1992.[49] Along with the Omicron Delta Kappa honor society,[50] ANAK was involved in the dedication of the Paul G. Mayer Memorial Garden on May 30, 1987.[29] The garden, located between the Georgia Tech Library and the William Vernon Skiles Classroom Building, features a plaque bearing the lidless eye symbol of the ANAK Society.[14]",
			"color": "dark|0.45409 gray|0.45409 dark|0.45409 grey|0.45409 gray|0.21485 grey|0.21485 silver|0.096951 light|0.074045 slate|0.074045 gray|0.074045 dim|0.059184 gray|0.059184 dim|0.059184 grey|0.059184 light|0.033812 gray|0.033812 light|0.033812 grey|0.033812 slate|0.031304 gray|0.031304 gainsboro|0.018156  "
		}
	}
}
