{
	"add": {
		"doc": {
			"id": "26ec8f2ba3bb8c4efc323b6e79ecfffc7c768428775a6c0c8602852c13ac5d5f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Museo_Thyssen-Bornemisza_%28Madrid%29_04.jpg/220px-Museo_Thyssen-Bornemisza_%28Madrid%29_04.jpg",
				"previous": "The Reina Sofía Museum, in full Reina Sofía National Art Museum (Museo Nacional Centro de Arte Reina Sofía, abbreviated as MNCARS), is the Spain's national museum of 20th-century art. The museum is mainly dedicated to Spanish art. Highlights of the museum include excellent collections of Spain's greatest 20th-century masters, Pablo Picasso, Salvador Dalí, Joan Miró, Juan Gris and Julio González. Certainly the most famous masterpiece in the museum is Picasso's painting Guernica. The Reina Sofía also hosts a free-access library specializing in art, with a collection of over 100,000 books, over 3,500 sound recordings and almost 1,000 videos.[78]",
				"after": "The Thyssen-Bornemisza Museum (Museo Thyssen-Bornemisza) is an art museum that fills the historical gaps in its counterparts' collections: in the Prado's case this includes Italian primitives and works from the English, Dutch and German schools, while in the case of the Reina Sofía the Thyssen-Bornemisza collection, once the second largest private collection in the world after the British Royal Collection,[79] includes Impressionists, Expressionists, and European and American paintings from the second half of the 20th century, with over 1,600 paintings.[80]",
			"color": "dark|0.12782 gray|0.12782 dark|0.12782 grey|0.12782 gray|0.11223 grey|0.11223 silver|0.11161 black|0.084687 dim|0.062967 gray|0.062967 dim|0.062967 grey|0.062967 light|0.049888 gray|0.049888 light|0.049888 grey|0.049888 linen|0.039658 sea|0.0374 shell|0.0374 white|0.036597 smoke|0.036597 floral|0.036469 white|0.036469 old|0.035283 lace|0.035283 gainsboro|0.033463 snow|0.032778 mint|0.031983 cream|0.031983 ivory|0.031105 white|0.026098 dark|0.016838 olive|0.016838 green|0.016838 antique|0.016633 white|0.016633 honeydew|0.010239 ghost|0.0087921 white|0.0087921 slate|0.0082328 gray|0.0082328 beige|0.0063877 light|0.0060976 slate|0.0060976 gray|0.0060976 lavender|0.0060737 blush|0.0060737 dark|0.0059142 khaki|0.0059142 olive|0.0045332  "
		}
	}
}
