{
	"add": {
		"doc": {
			"id": "27073dcf4d63d05296896d3b45193307aed2148325cc52e7e3a88c4965d70e0a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/AlytesObstetricansMaleWithEggs.jpg/220px-AlytesObstetricansMaleWithEggs.jpg",
				"previous": "Little is known about the longevity of frogs and toads in the wild, but some can live for many years. Skeletochronology is a method of examining bones to determine age. Using this method, the ages of mountain yellow-legged frogs (Rana muscosa) were studied, the phalanges of the toes showing seasonal lines where growth slows in winter. The oldest frogs had ten bands, so their age was believed to be 14 years, including the four-year tadpole stage.[133] Captive frogs and toads have been recorded as living for up to 40 years, an age achieved by a European common toad (Bufo bufo). The cane toad (Bufo marinus) has been known to survive 24 years in captivity, and the American bullfrog (Rana catesbeiana) 14 years.[134] Frogs from temperate climates hibernate during the winter, and four species are known to be able to withstand freezing during this time, including the wood frog (Rana sylvatica).[135]",
				"after": "Although care of offspring is poorly understood in frogs, up to an estimated 20% of amphibian species may care for their young in some way.[136] The evolution of parental care in frogs is driven primarily by the size of the water body in which they breed. Those that breed in smaller water bodies tend to have greater and more complex parental care behaviour.[137] Because predation of eggs and larvae is high in large water bodies, some frog species started to lay their eggs on land. Once this happened, the desiccating terrestrial environment demands that one or both parents keep them moist to ensure their survival.[138] The subsequent need to transport hatched tadpoles to a water body required an even more intense form of parental care.[137]",
			"color": "gray|0.39753 grey|0.39753 dim|0.35607 gray|0.35607 dim|0.35607 grey|0.35607 dark|0.10272 gray|0.10272 dark|0.10272 grey|0.10272 silver|0.02638 black|0.026224 dark|0.0133 khaki|0.0133 tan|0.013055 burly|0.0088679 wood|0.0088679 light|0.0085362 gray|0.0085362 light|0.0085362 grey|0.0085362 slate|0.0074269 gray|0.0074269 light|0.0061804 slate|0.0061804 gray|0.0061804  "
		}
	}
}
