{
	"add": {
		"doc": {
			"id": "27105cda4ce47d33e1c92563d9445cdacc5f3e0507ae5ebddd1b93475dd0ebd0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Ram%27s-Head_Lady%27s-Slipper_%28Cypripedium_arietinum%29.jpg/100px-Ram%27s-Head_Lady%27s-Slipper_%28Cypripedium_arietinum%29.jpg",
				"previous": "The Metacomet Ridge hosts a combination of microclimates unusual to the region. Dry, hot upper ridges support oak savannas, often dominated by chestnut oak and a variety of understory grasses and ferns. Eastern red-cedar, a dry-loving species, clings to the barren edges of cliffs. Backslope plant communities tend to be similar to the adjacent upland plateaus and nearby Appalachians, containing species common to the northern hardwood and oak-hickory forest ecosystem types. Eastern hemlock crowds narrow ravines, blocking sunlight and creating damp, cooler growing conditions with associated cooler climate plant species. Talus slopes are especially rich in nutrients and support a number of calcium-loving plants uncommon in the region. Miles of high cliffs make ideal raptor habitat, and the Metacomet Ridge is a seasonal raptor migration corridor.",
				"after": "Because the topography of the ridge offers such varied terrain, many species reach the northern or southern limit of their range on the Metacomet Ridge; others are considered rare nationally or globally. Examples of rare species that live on the ridge include the prickly pear cactus, peregrine falcon, northern copperhead, showy lady's slipper, yellow corydalis, ram's–head lady's slipper, basil mountain mint, and devil's bit lily.[1][20]",
			"color": "black|0.21962 yellow|0.12829 green|0.12829 dim|0.11656 gray|0.11656 dim|0.11656 grey|0.11656 olive|0.090645 drab|0.090645 dark|0.082065 olive|0.082065 green|0.082065 rosy|0.031414 brown|0.031414 gray|0.027482 grey|0.027482 indian|0.024149 red|0.024149 pale|0.017714 violet|0.017714 red|0.017714 thistle|0.013078 honeydew|0.012858 gainsboro|0.012446  "
		}
	}
}
