{
	"add": {
		"doc": {
			"id": "2716e5669f5a539f85d1e42b20ff507830b1825b3a66e0d0290550dd1537accb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Majungasaurus_skull.jpg/220px-Majungasaurus_skull.jpg",
				"previous": "Numerous fragmentary remains from Mahajanga Province in northwestern Madagascar were recovered by French collectors over the next 100 years, many of which were deposited in the Muséum National d'Histoire Naturelle in Paris.[1] In 1955, René Lavocat described a theropod dentary (MNHN.MAJ 1) with teeth from the Maevarano Formation in the same region where the original material was found. The teeth matched those first described by Depéret, but the strongly curved jaw bone was very different from both Megalosaurus and Dryptosaurus. Based on this dentary, Lavocat created the new genus Majungasaurus, using an older spelling of Mahajanga as well as the Greek word σαυρος/sauros (meaning \"lizard\").[16] Hans-Dieter Sues and Philippe Taquet described a dome-shaped skull fragment (MNHN.MAJ 4) as a new genus of pachycephalosaur (Majungatholus atopus) in 1979. This was the first report of a pachycephalosaur in the Southern Hemisphere.[17]",
				"after": "In 1993, scientists from the State University of New York at Stony Brook and the University of Antananarivo began the Mahajanga Basin Project, a series of expeditions to examine the fossils and geology of the Late Cretaceous sediments near the village of Berivotra, in Mahajanga Province.[1] Among these scientists was paleontologist David W. Krause of Stony Brook. The first expedition turned up hundreds of theropod teeth identical to those of Majungasaurus, some of which were attached to an isolated premaxilla that was described in 1996.[18] The following seven expeditions would turn up tens of thousands of fossils, many of which belonged to species new to science. The Mahajanga Basin Project claims credit for quintupling the known diversity of fossil taxa in the region.[1]",
			"color": "dark|0.61653 gray|0.61653 dark|0.61653 grey|0.61653  "
		}
	}
}
