{
	"add": {
		"doc": {
			"id": "2724b043fc240d991eafa01efa39ea886f558671c69529b2d847abc914b2b9b7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/John_Constable_The_Hay_Wain.jpg/220px-John_Constable_The_Hay_Wain.jpg",
				"previous": "The County's coat of arms comprises three Saxon seax knives (although looking rather more like scimitars) arranged on a red background (Gules three Seaxes fessewise in pale Argent pomels and hilts Or points to the sinister and cutting edges upwards); the three-seax device is also used as the official logo of Essex County Council having been granted as such in 1932.[20] The emblem was attributed to Anglo-Saxon Essex in Early Modern historiography. The earliest reference the arms of the East Saxon kings was by Richard Verstegan, the author of A Restitution of Decayed Intelligence (Antwerp, 1605), claiming that \"Erkenwyne king of the East-Saxons did beare for his armes, three [seaxes] argent, in a field gules\". There is no earlier evidence substantiating Verstegan's claim, which is an anachronism for the Anglo-Saxon period seeing that heraldry only evolved in the 12th century, well after the Norman conquest. John Speed in his Historie of Great Britaine (1611) follows Verstegan in his descriptions of the arms of Erkenwyne, but he qualifies the statement by adding \"as some or our heralds have emblazed\".[20]",
				"after": "Essex is also home to the Dunmow Flitch Trials, a traditional ceremony that takes place every four years and consists of a test of a married couple's devotion to one another. A common claim of the origin of the Dunmow Flitch dates back to 1104 and the Augustinian Priory of Little Dunmow, founded by Lady Juga Baynard. Lord of the Manor Reginald Fitzwalter and his wife dressed themselves as humble folk and begged blessing of the Prior a year and a day after marriage. The Prior, impressed by their devotion bestowed upon them a flitch of bacon. Upon revealing his true identity, Fitzwalter gave his land to the Priory on the condition a flitch should be awarded to any couple who could claim they were similarly devoted. By the 14th century, the Dunmow Flitch Trials appear to have achieved a significant reputation outside the local area. The author William Langland, who lived on the Welsh borders, mentions it in his 1362 book The Vision of Piers Plowman in a manner that implies general knowledge of the custom among his readers.[21]",
			"color": "dark|0.29896 gray|0.29896 dark|0.29896 grey|0.29896 black|0.27831 silver|0.22666 light|0.080522 gray|0.080522 light|0.080522 grey|0.080522  "
		}
	}
}
