{
	"add": {
		"doc": {
			"id": "27372190663b6ebf1b972e50761f6ad0087b74d5bfb313c817d8fdc6206cf214",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Air_France_A380_Voyageur_CDG.jpg/220px-Air_France_A380_Voyageur_CDG.jpg",
				"previous": "The cabin has features to reduce traveller fatigue such as a quieter interior and higher pressurisation than previous generation of aircraft; the A380 is pressurised to the equivalent altitude of 1,520 m (5,000 ft) up to 12,000 m (39,000 ft).[171][172] It has 50% less cabin noise, 50% more cabin area and volume, larger windows, bigger overhead bins, and 60 cm (2.0 ft) extra headroom versus the 747-400.[173][174] Seating options range from 4-abreast in first class to 11-across in economy.[175][176] On other aircraft, economy seats range from 41.5 cm (16.3 in) to 52.3 cm (20.6 in) in width,[177] A380 economy seats are up to 48 cm (19 in) wide in a 10-abreast configuration;[178] compared with the 10-abreast configuration on the 747-400 which typically has seats 44.5 cm (17.5 in) wide.[179]",
				"after": "The A380's upper and lower decks are connected by two stairways, fore and aft, wide enough to accommodate two passengers side-by-side; this cabin arrangement allows multiple seat configurations. The maximum certified carrying capacity is 853 passengers in an all-economy-class layout,[43] Airbus lists the \"typical\" three-class layout as accommodating 525 passengers, with 10 first, 76 business, and 439 economy class seats.[113] Airline configurations range from Korean Air's 407 passengers to Air Austral's proposed 840 passengers.[180][181] and average around 480–490 seats. The A380's interior illumination system uses bulbless LEDs in the cabin, cockpit, and cargo decks. The LEDs in the cabin can be altered to create an ambience simulating daylight, night, or intermediate levels.[182] On the outside of the aircraft, HID lighting is used for brighter illumination.",
			"color": "black|0.71159 dim|0.10549 gray|0.10549 dim|0.10549 grey|0.10549 gray|0.079726 grey|0.079726 dark|0.045669 gray|0.045669 dark|0.045669 grey|0.045669 silver|0.013558 slate|0.010286 gray|0.010286 light|0.0066096 slate|0.0066096 gray|0.0066096  "
		}
	}
}
