{
	"add": {
		"doc": {
			"id": "274961d6d03705fc0522ff12ad6b19e5defceeb319c70b6c4bcec82274c3cb72",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Venus_of_Brassempouy.jpg/220px-Venus_of_Brassempouy.jpg",
				"previous": "Woolly mammoth bones were used as construction material for dwellings by both Neanderthals and modern humans during the ice age. More than 70 such dwellings are known, mainly from the Russian Plain. The bases of the huts were circular, and ranged from 8 to 24 square metres (86 to 258 sq ft). The arrangement of dwellings varied, and ranged from 1 m (3.3 ft) to 20 m (66 ft) apart, depending on location. Large bones were used as foundations for the huts, tusks for the entrances, and the roofs were probably skins held in place by bones or tusks. Some huts had floors that extended 40 cm (16 in) below ground. Some huts included fireplaces, which used bones as fuel, probably because wood was scarce. It is possible that some of the bones used for materials came from mammoths killed by humans, but the state of the bones, and the fact that bones used to build a single dwelling varied by several thousands of years in age, suggests that they were collected remains of long-dead animals. Woolly mammoth bones were also made into various tools, furniture, and musical instruments. Large bones, such as shoulder blades, were also used to cover dead human bodies during burial.[75]",
				"after": "Woolly mammoth ivory was used to create art objects. Several Venus figurines, including the Venus of Brassempouy and the Venus of Lespugue, were made from this material. Weapons made from ivory, such as daggers, spears, and a boomerang, are also known. To be able to process the ivory, the large tusks had to be chopped, chiselled and split into smaller, more manageable pieces. Some ivory artefacts show that tusks had been straightened, and it is unknown how this was achieved.[76]",
			"color": "tan|0.17604 burly|0.10017 wood|0.10017 black|0.074024 wheat|0.071176 blanched|0.03794 almond|0.03794 moccasin|0.037361 antique|0.036454 white|0.036454 bisque|0.035333 papaya|0.034781 whip|0.034781 navajo|0.033329 white|0.033329 corn|0.030729 silk|0.030729 beige|0.030239 old|0.027135 lace|0.027135 linen|0.022856 ivory|0.022225 peach|0.022028 puff|0.022028 light|0.021741 golden|0.021741 rod|0.021741 yellow|0.021741 floral|0.021154 white|0.021154 light|0.021097 yellow|0.021097 lemon|0.020271 chiffon|0.020271 sea|0.017259 shell|0.017259 pale|0.015492 golden|0.015492 rod|0.015492 white|0.010614 smoke|0.010614 mint|0.010593 cream|0.010593 snow|0.010017 white|0.0090158 honeydew|0.0084874  "
		}
	}
}
