{
	"add": {
		"doc": {
			"id": "274d6e4f3e7048bd03c28e63a381ad710981c29d0de2303d7199488baf72f2f0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Fairychapeltoun.JPG/150px-Fairychapeltoun.JPG",
				"previous": "While many fairies will confuse travelers on the path, the will o' the wisp can be avoided by not following it. Certain locations, known to be haunts of fairies, are to be avoided; C. S. Lewis reported hearing of a cottage more feared for its reported fairies than its reported ghost.[49] In particular, digging in fairy hills was unwise. Paths that the fairies travel are also wise to avoid. Home-owners have knocked corners from houses because the corner blocked the fairy path,[50] and cottages have been built with the front and back doors in line, so that the owners could, in need, leave them both open and let the fairies troop through all night.[51] Locations such as fairy forts were left undisturbed; even cutting brush on fairy forts was reputed to be the death of those who performed the act.[52] Fairy trees, such as thorn trees, were dangerous to chop down; one such tree was left alone in Scotland, though it prevented a road being widened for seventy years.[53] Good house-keeping could keep brownies from spiteful actions, because if they did not think the house is clean enough, they pinched people in their sleep. Such water hags as Peg Powler and Jenny Greenteeth, prone to drowning people, could be avoided by avoiding the bodies of water they inhabit.[40]",
				"after": "Other actions were believed to offend fairies. Brownies were known to be driven off by being given clothing, though some folktales recounted that they were offended by inferior quality of the garments given, and others merely stated it, some even recounting that the brownie was delighted with the gift and left with it.[54] Other brownies left households or farms because they heard a complaint, or a compliment.[55] People who saw the fairies were advised not to look closely, because they resented infringements on their privacy.[56] The need to not offend them could lead to problems: one farmer found that fairies threshed his corn, but the threshing continued after all his corn was gone, and he concluded that they were stealing from his neighbors, leaving him the choice between offending them, dangerous in itself, and profiting by the theft.[57]",
			"color": "light|0.25572 slate|0.25572 gray|0.25572 slate|0.19933 gray|0.19933 dim|0.13399 gray|0.13399 dim|0.13399 grey|0.13399 light|0.1331 steel|0.1331 blue|0.1331 gray|0.069898 grey|0.069898 dark|0.0639 gray|0.0639 dark|0.0639 grey|0.0639 dark|0.058856 green|0.058856 black|0.030322 silver|0.01437 dark|0.011032 olive|0.011032 green|0.011032 lavender|0.006953  "
		}
	}
}
