{
	"add": {
		"doc": {
			"id": "275b3aae7cbcf1854d1c9ff643afa7cd92e39d8fd3750db9ed8da4a15c1f44f6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/FAU_Davie_Campus.jpg/220px-FAU_Davie_Campus.jpg",
			"previous": [],
				"after": "The Davie Campus of Florida Atlantic University was established in 1990 on 38 acres (0.15 km²) of land in western Broward County.[76] The campus serves approximately 3,488 students, or 13% of the Florida Atlantic student body, making it the university's second largest campus by enrollment.[70] The campus features a multi-story student union with offices for student government and student organizations, a multipurpose area and student lounge, a bookstore, and cafeteria.[77] The union also contains a student health center that provides medical services and health counseling.[77] Davie is also the home of \"environmental research initiatives focused on Everglades restoration.\"[78] FAU colleges offering courses at the FAU Davie campus include Design and Social Inquiry; Arts and Letters; Business; Education; Nursing; and Science. The campus is located on Broward College's Central Campus. Students may enter BC as freshmen and graduate from FAU with undergraduate degrees in over 14 disciplines. More than 315,000 square feet of carefully designed classrooms, laboratories and faculty, staff and student offices are located on this campus along with a shared-use, 112,000 square-foot FAU/BC library designed for the 21st century.",
			"color": "dim|0.2084 gray|0.2084 dim|0.2084 grey|0.2084 dark|0.15634 gray|0.15634 dark|0.15634 grey|0.15634 gray|0.12648 grey|0.12648 silver|0.10848 light|0.083502 gray|0.083502 light|0.083502 grey|0.083502 gainsboro|0.063572 light|0.039271 slate|0.039271 gray|0.039271 black|0.025883 light|0.023174 blue|0.023174 slate|0.017994 gray|0.017994 dark|0.014259 slate|0.014259 gray|0.014259 white|0.013913 smoke|0.013913 powder|0.012231 blue|0.012231 lavender|0.01132 light|0.0096816 steel|0.0096816 blue|0.0096816 alice|0.0094289 blue|0.0094289 ghost|0.0080193 white|0.0080193 lavender|0.007417 blush|0.007417 linen|0.0071197  "
		}
	}
}
