{
	"add": {
		"doc": {
			"id": "275f4be3df32e0f9f8119e38b2ccbca20400d9dd3f8cad115f57741c46b527d1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/20070616_Crown_Fountain_%286%29.JPG/220px-20070616_Crown_Fountain_%286%29.JPG",
				"previous": "The front face of each tower is animated with a continuous, dynamic exhibit of lights and electronic images.[1] Although the screens on the towers periodically display clips of landscapes such as waterfalls, most intriguing are the display of faces of Chicago residents. About 1,000 faces of Chicagoans are shown in a random rotation,[2] the order determined using a Barco show controller.[3] Each face is displayed for five minutes, with a brief period between each of these videos during which the sculpture is unlit. As a result, no more than 12 faces appear per hour during the summer. However, during the winter a version without the final one minute of puckering is shown, so the video segments then are only four minutes each.[10][19] The video pattern also includes a three-minute water scene every half-hour and a 30-second fade-to-black every 15 minutes. If all the faces were shown consecutively, instead of randomly, they would each appear about once every eight days.[10] A June 2007 article in the Chicago Sun-Times reported that many of the subjects who had their images digitized for the project had yet to either see their own images or hear of anyone who had seen them.[10]",
				"after": "The spouting water from the faces of the towers appears to be flowing from the displayed subject's mouth from a 6-inch (150 mm) nozzle located in the center of each interior face 12 feet (3.7 m) above the reflecting pool.[19] Images are shown daily year-round, while the water feature only operates from May 1 to approximately October 31,[4] weather permitting.[32] The park is open to the public daily from 6 a.m. to 11 p.m.[51]",
			"color": "gray|0.3591 grey|0.3591 dim|0.27692 gray|0.27692 dim|0.27692 grey|0.27692 dark|0.071888 gray|0.071888 dark|0.071888 grey|0.071888 silver|0.042511 white|0.020294 smoke|0.020294 light|0.019906 gray|0.019906 light|0.019906 grey|0.019906 alice|0.019785 blue|0.019785 ghost|0.019699 white|0.019699 snow|0.019637 white|0.019332 mint|0.018984 cream|0.018984 sea|0.01897 shell|0.01897 lavender|0.018796 blush|0.018796 azure|0.018099 floral|0.016075 white|0.016075 gainsboro|0.011631 black|0.011164  "
		}
	}
}
