{
	"add": {
		"doc": {
			"id": "275f383a098bcf2516919b6a277418db10289e7e5e1480b1424e210ea7de59c2",
			"url": "https://upload.wikimedia.org/math/c/f/5/cf56131676d727b30562f5eb94207974.png",
			"previous": [
				"The Winter load line is one forty-eighth of the summer load draft below the summer load line.",
				"The Summer load line is the primary load line and it is from this mark that all other marks are derived. The position of the summer load line is calculated from the Load Line Rules and depends on many factors such as length of ship, type of ship, type and number of superstructures, amount of sheer, bow height and so on. The horizontal line through the circle of the Plimsoll mark is at the same level as the summer load line."
			],
				"after": "Certain vessels are assigned Timber Freeboards, but before these can be assigned certain additional conditions have to be met. One of these conditions is that the vessel must have a forecastle of at least 0.07 the length of the vessel and of not less than standard height, which is 1.8 metres for a vessel 75 metres or less in length and 2.3 metres for a vessel 125 metres or more in length with intermediate heights for intermediate lengths. A poop or raised quarter deck is also required if the length is less than 100 metres. The letter L prefixes the load line marks to indicate a timber load line.[8] Except for the Timber Winter North Atlantic freeboard the other freeboards are less than the standard freeboards. This allows these ships to carry additional timber as deck cargo, but with the facility to jettison this cargo.",
			"color": "dark|0.3309 gray|0.3309 dark|0.3309 grey|0.3309 gray|0.2866 grey|0.2866 silver|0.15646 dim|0.087659 gray|0.087659 dim|0.087659 grey|0.087659 light|0.065661 gray|0.065661 light|0.065661 grey|0.065661 gainsboro|0.042161 white|0.0084233 smoke|0.0084233 linen|0.0039367 lavender|0.0034238 blush|0.0034238 alice|0.0032373 blue|0.0032373 ghost|0.0030818 white|0.0030818 sea|0.0028598 shell|0.0028598 snow|0.0027044  "
		}
	}
}
