{
	"add": {
		"doc": {
			"id": "277638a567b308405557be5af55f7659fc5326e1b49c219da712492824965b3a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/IcelandicHorseInWinter.jpg/220px-IcelandicHorseInWinter.jpg",
				"previous": "Icelandic horses weigh between 330 and 380 kilograms (730 and 840 lb)[1] and stand an average of 13 and 14 hands (52 and 56 inches, 132 and 142 cm) high, which is often considered pony size, but breeders and breed registries always refer to Icelandics as horses.[2][3] Several theories have been put forward as to why Icelandics are always called horses, among them the breed's spirited temperament and large personality.[4][5] Another theory suggests that the breed's weight, bone structure and weight-carrying abilities mean it can be classified as a horse, rather than a pony.[6] The breed comes in many coat colors, including chestnut, dun, bay, black, gray, palomino, pinto and roan. There are over 100 names for various colors and color patterns in the Icelandic language.[2][3] They have well-proportioned heads, with straight profiles and wide foreheads. The neck is short, muscular, and broad at the base; the withers broad and low; the chest deep; the shoulders muscular and slightly sloping; the back long; the croup broad, muscular, short and slightly sloping. The legs are strong and short, with relatively long cannon bones and short pasterns. The mane and tail are full, with coarse hair, and the tail is set low. The breed is known to be hardy and an easy keeper.[7] The breed has a double coat developed for extra insulation in cold temperatures.[8]",
				"after": "Characteristics differ between various groups of Icelandic horses, depending on the focus of individual breeders. Some focus on animals for pack and draft work, which are conformationally distinct from those bred for work under saddle, which are carefully selected for their ability to perform the traditional Icelandic gaits. Others are bred solely for horsemeat. Some breeders focus on favored coat colors.[2]",
			"color": "rosy|0.1279 brown|0.1279 misty|0.088401 rose|0.088401 dim|0.081603 gray|0.081603 dim|0.081603 grey|0.081603 gray|0.070526 grey|0.070526 dark|0.048985 gray|0.048985 dark|0.048985 grey|0.048985 thistle|0.038247 tan|0.037154 black|0.036417 silver|0.031976 antique|0.028431 white|0.028431 linen|0.026957 lavender|0.024804 blush|0.024804 sienna|0.024502 light|0.024125 gray|0.024125 light|0.024125 grey|0.024125 peach|0.02334 puff|0.02334 sea|0.022324 shell|0.022324 gainsboro|0.019735 slate|0.019047 gray|0.019047 saddle|0.018055 brown|0.018055 old|0.016636 lace|0.016636 floral|0.015933 white|0.015933 white|0.014667 smoke|0.014667 snow|0.01455 bisque|0.013907 lavender|0.013744 papaya|0.012988 whip|0.012988 blanched|0.011169 almond|0.011169 light|0.010547 slate|0.010547 gray|0.010547 ghost|0.0099195 white|0.0099195 white|0.0095845  "
		}
	}
}
