{
	"add": {
		"doc": {
			"id": "277940abb84a91e9169fedf934e71f02ec2658967162a8857754f233edf4c8a5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Bringing_in_the_tea_leaf%2C_Darjeeling%2C_1890.jpg/220px-Bringing_in_the_tea_leaf%2C_Darjeeling%2C_1890.jpg",
			"previous": [],
				"after": "The history of Darjeeling is intertwined with that of Sikkim, Nepal, British India and Bhutan. Until the early 19th century, the hilly area around Darjeeling was controlled by the kingdom of Sikkim, while the plains around Siliguri were intermittently occupied by the Kingdom of Nepal,[3] with settlement consisting of a few villages of Lepcha and Kirati people.[4] The Chogyal of Sikkim had been engaged in unsuccessful warfare against the Gorkhas of Nepal. From 1780, the Gorkhas made several attempts to capture the entire region of Darjeeling. By the beginning of 19th century, they had overrun Sikkim as far eastward as the Teesta River and had conquered and annexed the Terai. In the meantime, the British were engaged in preventing the Gorkhas from overrunning the whole of the northern frontier. The Anglo-Gorkha war broke out in 1814, which resulted in the defeat of the Gorkhas and subsequently led to the signing of the Sugauli Treaty in 1815. According to the treaty, Nepal had to cede all those territories which the Gorkhas had annexed from the Chogyal of Sikkim to the British East India Company (i.e. the area between Mechi River and Teesta River). Later in 1817, through the Treaty of Titalia, the British East India Company reinstated the Chogyal of Sikkim, restored all the tracts of land between the Mechi River and the Teesta River to the Chogyal of Sikkim and guaranteed his sovereignty.[5]",
			"color": "black|0.51278 antique|0.075725 white|0.075725 blanched|0.045618 almond|0.045618 papaya|0.042726 whip|0.042726 bisque|0.042364 dim|0.038179 gray|0.038179 dim|0.038179 grey|0.038179 gray|0.03529 grey|0.03529 dark|0.024565 gray|0.024565 dark|0.024565 grey|0.024565 beige|0.023582 linen|0.021324 old|0.021161 lace|0.021161 tan|0.019998 corn|0.019052 silk|0.019052 silver|0.014479 floral|0.010066 white|0.010066 sea|0.0096615 shell|0.0096615 ivory|0.0086262  "
		}
	}
}
