{
	"add": {
		"doc": {
			"id": "278655f408ad2fac52eeeda90d78612cdcedf30d4e3b57750fba222ff80c934a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Thomas_Banks_Shakespeare_attended_by_Painting_and_Poetry_c_1789.jpg/220px-Thomas_Banks_Shakespeare_attended_by_Painting_and_Poetry_c_1789.jpg",
				"previous": "In June 1788, Boydell and his nephew secured the lease on a site at 52 Pall Mall (51°30′20.5″N 0°8′12″W﻿ / ﻿51.505694°N 0.13667°W﻿ / 51.505694; -0.13667) to build the gallery and engaged George Dance, then the Clerk of the City Works, as the architect for the project.[51] Pall Mall at that time had a mix of expensive residences and commercial operations, such as bookshops and gentleman's clubs, popular with fashionable London society. The area also contained some less genteel establishments: King's Place (now Pall Mall Place), an alley running to the east and behind Boydell's gallery, was the site of Charlotte Hayes's high-class brothel.[52] Across King's Place, immediately to the east of Boydell's building, 51 Pall Mall had been purchased on 26 February 1787 by George Nicol, bookseller and future husband of Josiah's elder sister, Mary Boydell. As an indication of the changing character of the area, this property had been the home of Goostree's gentleman's club from 1773 to 1787. Begun as a gambling establishment for wealthy young men, it had later become a reformist political club that counted William Pitt and William Wilberforce as members.[51]",
				"after": "Dance's Shakespeare Gallery building had a monumental, neoclassical stone front, and a full-length exhibition hall on the ground floor. Three interconnecting exhibition rooms occupied the upper floor, with a total of more than 4,000 square feet (370 m2) of wall space for displaying pictures. The two-storey façade was not especially large for the street, but its solid classicism had an imposing effect.[51] Some reports describe the exterior as \"sheathed in copper\".[53]",
			"color": "silver|0.29332 light|0.24567 gray|0.24567 light|0.24567 grey|0.24567 dark|0.11055 gray|0.11055 dark|0.11055 grey|0.11055 dim|0.10575 gray|0.10575 dim|0.10575 grey|0.10575 gainsboro|0.089516 gray|0.066856 grey|0.066856 black|0.033911 antique|0.025526 white|0.025526 linen|0.0094762  "
		}
	}
}
