{
	"add": {
		"doc": {
			"id": "278be71672165649ddd2349ae92b97cd7978685a1210eefb5ca9c69714918b1b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Air_India_First_Suite.jpg/220px-Air_India_First_Suite.jpg",
				"previous": "First-class seats vary from large reclining seats with more legroom and width than other classes to suites with a fully reclining seat, workstation and TV surrounded by privacy dividers. International first-class seats usually have between 147–239 cm (58–94 inches) of seat pitch and between 48–89 cm (19–35 inches) of width while domestic flights may have between 86–173 cm (34–68 inches) of pitch and between 46–56 cm (18–22 inches) in width. In fact this means there is less discomfort for taller people. Some airlines have first-class seats which allow passengers to let one guest sit for a short while face-to-face with the occupant of the cabin.",
				"after": "First-class passengers usually have at least one lavatory for their exclusive use, with more than one on larger planes. Business- and economy-class passengers are not normally permitted in the first-class cabin. Normally AVOD (audiovisual on demand) entertainment is offered, although sometimes normal films, television programs and interactive games are provided on medium-large seat-back or armrest-mounted flat panel monitors. Especially for long-haul and high-yielding routes on top airlines, a first-class seat may have facilities akin to a five-star hotel, such as a mini-bar.",
			"color": "black|0.13758 white|0.071122 smoke|0.071122 sea|0.067345 shell|0.067345 mint|0.066456 cream|0.066456 floral|0.065663 white|0.065663 snow|0.064908 white|0.063353 azure|0.058807 ghost|0.057324 white|0.057324 alice|0.056491 blue|0.056491 lavender|0.039938 blush|0.039938 light|0.038617 gray|0.038617 light|0.038617 grey|0.038617 gainsboro|0.037049 linen|0.034519 silver|0.026142 beige|0.015882 old|0.015368 lace|0.015368 ivory|0.013782 dark|0.011676 gray|0.011676 dark|0.011676 grey|0.011676 antique|0.010839 white|0.010839  "
		}
	}
}
