{
	"add": {
		"doc": {
			"id": "279beeb0ec7d1ed133e7b3d22206415315586dc7110d1137b411a5a6f74f48a6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Bundesarchiv_DVM_10_Bild-23-61-11%2C_Gro%C3%9Fer_Kreuzer_%22SMS_Bl%C3%BCcher%22.jpg/220px-Bundesarchiv_DVM_10_Bild-23-61-11%2C_Gro%C3%9Fer_Kreuzer_%22SMS_Bl%C3%BCcher%22.jpg",
				"previous": "Another powerful armored cruiser was the Russian Rurik, completed in 1908. Armed with four 10-inch (254 mm) in two twin turrets fore and aft and eight 8-inch (203 mm) in turrets along the ship's sides, she displaced 15,190 tons and carried a 6-inch (152 mm) belt, two armored decks and 8-inch (203 mm) armor on her turrets and conning tower. Her top speed was 21 knots. Rurik was unusual in that she was Russian designed but British built; the Russian Navy was not usually a customer of British shipyards. She was reportedly one of the best armored cruisers built, with an advanced sprinkler protection for the magazines. Intended as the first of a three-ship class, Rurik‍ '​s sisters were cancelled with the advent of the battlecruiser HMS Invincible.[36]",
				"after": "\"The supreme embodiment of the armored cruiser,\" in historian Robert K. Massie's words, was the German ship SMS Blücher.[37] An enlarged version of the Scharnhorst class with a speed of 24.25 knots, armed with 12 8.2-inch (208 mm) and eight 5.9-inch (150 mm) guns, Blücher was planned as an armored cruiser in part because the British had misled the Germans on the Invincibles then being constructed. The Germans expected these new British ships to be armed with six or eight 9.2 in (23 cm) guns.[38] One week after the final decision to construct Blücher, the German naval attache learned they would carry eight 30.5 cm (12.0 in) guns, the same type mounted on battleships. With no funds available to redesign Blücher, work was ordered to proceed as scheduled.[39] Although much more powerful than a typical armored cruiser, she was significantly weaker than the new British battlecruisers.[40]",
			"color": " "
		}
	}
}
