{
	"add": {
		"doc": {
			"id": "279d4d1579a14fd7c004639dc649b3dd6b4ac4c115b750ffe499bb326e008767",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/10-Cell_Face_Wide_View.jpg/220px-10-Cell_Face_Wide_View.jpg",
				"previous": "The Curtis-Wright reactor was dismantled and its fuel returned to the AEC. Martin Company, which soon became Martin Marietta, leased the hot cells, intending to use them in the manufacture of small radioisotope thermoelectric generators. Curtiss-Wright warned Penn State \"that the radiation involved in Martin's operations would be 'extremely high' and of a type that posed a particular risk to human health\",[8] but Curtiss-Wright itself had left both solid and liquid radioactive waste in the facility. Some of the Curtiss-Wright waste was contaminated with toxic beryllium oxide. Penn State had acquired the reactor license and with it came legal responsibility for the nuclear waste on the site; its plan with the AEC called for the release of 90 percent of the liquid radioactive waste into the environment and the burial of most radioactive solids on site. Items coated with beryllium oxide dust \"were covered in plastic and buried out in the woods\", where some were subsequently unearthed by black bears and white-tailed deer.[8][38][47] Once jet engine testing stopped, the bunkers at the test cells were used \"to store hazardous and explosive material\".[48]",
				"after": "In 1962 Martin Marietta began to manufacture Systems for Nuclear Auxiliary Power (SNAP) thermoelectric generators under a contract with the AEC; their AEC license allowed them to have up to 6 million curies of radioactive strontium-90 in the form of strontium titanate, which powered the SNAP generators. A SNAP-7 reactor made at Quehanna was used in the world's first nuclear-powered lighthouse, the Baltimore Harbor Light, from May 1964 to April 1966.[8][38] In early 1963, Curtiss-Wright still owned or leased all of Quehanna and sublet land along Quehanna Highway to a firm that recovered copper from wire by burning off its insulation, a procedure that contaminated the soil. On July 12, 1963, Pennsylvania Governor William Scranton announced the termination of Curtiss-Wright's lease on 42,596 acres (17,238 ha); the state paid the company for the roads it had built, and Curtiss-Wright donated six of the eight buildings in the industrial complex to the state.[49] In 1965 the state legislature passed an act declaring the former leased area a wilderness area,[28][49] and Maurice K. Goddard, secretary of the Department of Forests and Waters, named it the Quehanna Wilderness Area.[50]",
			"color": " "
		}
	}
}
