{
	"add": {
		"doc": {
			"id": "27a917c9b635176d0961aa495c27aa46cdbeff62e76c2654544083582872fecf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Lambeosaurus_magnicristatus_DB.jpg/220px-Lambeosaurus_magnicristatus_DB.jpg",
			"previous": [],
				"after": "Modern birds are well known for communicating using primarily visual and auditory signals, and the wide diversity of visual display structures among fossil dinosaur groups suggests that visual communication has always been important to dinosaur biology. However, the evolution of dinosaur vocalization is less certain. In 2008, paleontologist Phil Senter examined the evidence for vocalization in Mesozoic animal life, including dinosaurs.[91] Senter found that, contrary to popular depictions of roaring dinosaurs in motion pictures, it is likely that most Mesozoic dinosaurs were not capable of creating any vocalizations (though the hollow crests of the lambeosaurines could have functioned as resonance chambers used for a wide range of vocalizations).[92][93] To draw this conclusion, Senter studied the distribution of vocal organs in modern reptiles and birds. He found that vocal cords in the larynx probably evolved multiple times among reptiles, including crocodilians, which are able to produce guttural roars. Birds, on the other hand, lack a larynx. Instead, bird calls are produced by the syrinx, a vocal organ found only in birds, and which is not related to the larynx, meaning it evolved independently from the vocal organs in reptiles. The syrinx depends on the air sac system in birds to function; specifically, it requires the presence of a clavicular air sac near the wishbone or collar bone. This air sac leaves distinctive marks or opening on the bones, including a distinct opening in the upper arm bone (humerus). While extensive air sac systems are a unique characteristic of saurischian dinosaurs, the clavicular air sac necessary to vocalize does not appear in the fossil record until the enantiornithines (one exception, Aerosteon, probably evolved its clavicular air sac independently of birds for reasons other than vocalization).[91]",
			"color": "gray|0.29945 grey|0.29945 dim|0.22204 gray|0.22204 dim|0.22204 grey|0.22204 dark|0.2213 gray|0.2213 dark|0.2213 grey|0.2213 silver|0.06149 black|0.029369 antique|0.0181 white|0.0181 light|0.015844 gray|0.015844 light|0.015844 grey|0.015844 tan|0.014149 dark|0.013887 orange|0.013887 peru|0.013027 burly|0.009174 wood|0.009174 bisque|0.0082587 blanched|0.0069758 almond|0.0069758 gainsboro|0.0068515 papaya|0.0066373 whip|0.0066373 orange|0.006368 saddle|0.005923 brown|0.005923 peach|0.0049313 puff|0.0049313  "
		}
	}
}
