{
	"add": {
		"doc": {
			"id": "27ab3782eabbfe399543f4fa67808a14c8159f22bbc21d0a3b0ec9cc77533475",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Bar-tailed_Godwit_migration.jpg/220px-Bar-tailed_Godwit_migration.jpg",
				"previous": "Many bird species migrate to take advantage of global differences of seasonal temperatures, therefore optimising availability of food sources and breeding habitat. These migrations vary among the different groups. Many landbirds, shorebirds, and waterbirds undertake annual long distance migrations, usually triggered by the length of daylight as well as weather conditions. These birds are characterised by a breeding season spent in the temperate or polar regions and a non-breeding season in the tropical regions or opposite hemisphere. Before migration, birds substantially increase body fats and reserves and reduce the size of some of their organs.[68][127] Migration is highly demanding energetically, particularly as birds need to cross deserts and oceans without refuelling. Landbirds have a flight range of around 2,500 km (1,600 mi) and shorebirds can fly up to 4,000 km (2,500 mi),[128] although the bar-tailed godwit is capable of non-stop flights of up to 10,200 km (6,300 mi).[129] Seabirds also undertake long migrations, the longest annual migration being those of sooty shearwaters, which nest in New Zealand and Chile and spend the northern summer feeding in the North Pacific off Japan, Alaska and California, an annual round trip of 64,000 km (39,800 mi).[130] Other seabirds disperse after breeding, travelling widely but having no set migration route. Albatrosses nesting in the Southern Ocean often undertake circumpolar trips between breeding seasons.[131]",
				"after": "Some bird species undertake shorter migrations, travelling only as far as is required to avoid bad weather or obtain food. Irruptive species such as the boreal finches are one such group and can commonly be found at a location in one year and absent the next. This type of migration is normally associated with food availability.[132] Species may also travel shorter distances over part of their range, with individuals from higher latitudes travelling into the existing range of conspecifics; others undertake partial migrations, where only a fraction of the population, usually females and subdominant males, migrates.[133] Partial migration can form a large percentage of the migration behaviour of birds in some regions; in Australia, surveys found that 44% of non-passerine birds and 32% of passerines were partially migratory.[134] Altitudinal migration is a form of short distance migration in which birds spend the breeding season at higher altitudes elevations and move to lower ones during suboptimal conditions. It is most often triggered by temperature changes and usually occurs when the normal territories also become inhospitable due to lack of food.[135] Some species may also be nomadic, holding no fixed territory and moving according to weather and food availability. Parrots as a family are overwhelmingly neither migratory nor sedentary but considered to either be dispersive, irruptive, nomadic or undertake small and irregular migrations.[136]",
			"color": "black|0.29323 dark|0.20797 olive|0.20797 green|0.20797 slate|0.12922 gray|0.12922 dim|0.093227 gray|0.093227 dim|0.093227 grey|0.093227 light|0.044843 slate|0.044843 gray|0.044843 dark|0.039885 gray|0.039885 dark|0.039885 grey|0.039885 gray|0.036565 grey|0.036565  "
		}
	}
}
