{
	"add": {
		"doc": {
			"id": "27c9d9b59fe7623a793872c4223ef34858f2a3cf799275a518afa13ee5f274b6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Albert_libertad.jpg/180px-Albert_libertad.jpg",
				"previous": "\"In this sense, the theoretical positions and the vital experiences of french individualism are deeply iconoclastic and scandalous, even within libertarian circles. The call of nudist naturism, the strong defence of bith control methods, the idea of \"unions of egoists\" with the sole justification of sexual practices, that will try to put in practice, not without difficulties, will establish a way of thought and action, and will result in sympathy within some, and a strong rejection within others.\"[29]",
				"after": "French individualist anarchists grouped behind Émile Armand, published L'Unique after World War II. L'Unique went from 1945 to 1956 with a total of 110 numbers.[201][202] Gérard de Lacaze-Duthiers was a French writer, art critic, pacifist and anarchist. Lacaze-Duthiers, an art critic for the Symbolist review journal La Plume, was influenced by Oscar Wilde, Nietzsche and Max Stirner. His (1906) L'Ideal Humain de l'Art helped found the 'Artistocracy' movement—a movement advocating life in the service of art.[203] His ideal was an anti-elitist aestheticism: \"All men should be artists\".[204] Together with André Colomer and Manuel Devaldes, he founded L'Action d'Art, an anarchist literary journal, in 1913.[205] After World War II he contributed to the journal L'Unique.[206] Within the synthesist anarchist organization, the Fédération Anarchiste, there existed an individualist anarchist tendency alongside anarcho-communist and anarchosyndicalist currents.[207] Individualist anarchists participating inside the Fédération Anarchiste included Charles-Auguste Bontemps, Georges Vincey and André Arru.[207] The new base principles of the francophone Anarchist Federation were written by the individualist anarchist Charles-Auguste Bontemps and the anarcho-communist Maurice Joyeux which established an organization with a plurality of tendencies and autonomy of federated groups organized around synthesist principles.[208] Charles-Auguste Bontemps was a prolific author mainly in the anarchist, freethinking, pacifist and naturist press of the time.[208] His view on anarchism was based around his concept of \"Social Individualism\" on which he wrote extensively.[208] He defended an anarchist perspective which consisted on \"a collectivism of things and an individualism of persons.\"[209]",
			"color": " "
		}
	}
}
