{
	"add": {
		"doc": {
			"id": "27d62403d4cf13e9bed37c8d6ec85b44dbd159b9ffeb58184985d05ffea768a0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/LaTrochita12EnNahuelPanFormacionEstacionada.jpg/220px-LaTrochita12EnNahuelPanFormacionEstacionada.jpg",
				"previous": "At the urging of the Chilean government, the Spanish company Endesa hopes to build a number of large hydro-electric dams in the Chilean Patagonia, which has raised environmental concerns from a large number of local and international NGOs. The first dams proposed would be built on the Baker and Pascua rivers, but dams have also been proposed on others, including the famed Futaleufú River in Chile and Santa Cruz river in Argentina. The dams would affect the minimum ecological flows and threaten the fishing, wilderness-tourism and agricultural interests along the river. The electricity would be fed into high-voltage lines (to be built by a Canadian company) and taken 1,200 miles (1,900 km) north to the industry and mining hub around Santiago. The lines would cut through a number of previously pristine national parks and protected areas. The rightist Piñera government considered the power to be essential for economic growth, while opponents claimed it would destroy Patagonia's growing tourism industry. On June 11, 2014, the new leftist Bachelet government rejected the dam project, estimated to be worth about 8 billion dollars, after years of pressure from environmental groups.",
				"after": "Due to its sparse rainfall in agricultural areas, Argentine Patagonia already has numerous dams for irrigation, some of which are also used for hydropower. Coal is mined in the Rio Turbio area and used for electrical generation. Patagonia's notorious winds have already made the area Argentina's main source of wind power, and there are plans for major increases in wind power generation. Patagonia has always been Argentina's main area, and Chile's only area, of conventional oil and gas production. Oil and gas have played an important role in the rise of Neuquén-Cipolleti as Patagonia's most populous urban area, and in the growth of Comodoro Rivadavia,[31] Punta Arenas, and Rio Grande as well. The development of the Neuquén basin's enormous unconventional oil and gas reserves through hydraulic fracturing has just begun, but the YPF-Chevron Loma Campana field in the Vaca Muerta formation is already the world's largest producing shale oil field outside North America according to YPF CEO Miguel Gallucio.",
			"color": "tan|0.41952 black|0.349 dim|0.086744 gray|0.086744 dim|0.086744 grey|0.086744  "
		}
	}
}
