{
	"add": {
		"doc": {
			"id": "27ec60bb4870706bdb8a90abe91be65be9e6ac53ff2530cc2f3dcf7af8990a6c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Flickr_-_The_U.S._Army_-_Marksmanship_training_%281%29.jpg/220px-Flickr_-_The_U.S._Army_-_Marksmanship_training_%281%29.jpg",
				"previous": "Following their basic and advanced training at the individual-level, soldiers may choose to continue their training and apply for an \"additional skill identifier\" (ASI). The ASI allows the army to take a wide ranging MOS and focus it into a more specific MOS. For example, a combat medic, whose duties are to provide pre-hospital emergency treatment, may receive ASI training to become a cardiovascular specialist, a dialysis specialist, or even a licensed practical nurse. For commissioned officers, ASI training includes pre-commissioning training either at USMA, or via ROTC, or by completing OCS. After commissioning, officers undergo branch specific training at the Basic Officer Leaders Course, (formerly called Officer Basic Course), which varies in time and location according their future assignments. Further career development is available through the Army Correspondence Course Program.",
				"after": "Collective training at the unit level takes place at the unit's assigned station, but the most intensive training at higher echelons is conducted at the three combat training centers (CTC); the National Training Center (NTC) at Fort Irwin, California, the Joint Readiness Training Center (JRTC) at Fort Polk, Louisiana, and the Joint Multinational Training Center (JMRC) at the Hohenfels Training Area in Hohenfels, Germany. ARFORGEN is the Army Force Generation process approved in 2006 to meet the need to continuously replenish forces for deployment, at unit level, and for other echelons as required by the mission. Individual-level replenishment still requires training at a unit level, which is conducted at the continental US (CONUS) replacement center at Fort Bliss, in New Mexico and Texas, before their individual deployment.",
			"color": "dim|0.22533 gray|0.22533 dim|0.22533 grey|0.22533 dark|0.16234 gray|0.16234 dark|0.16234 grey|0.16234 gray|0.15069 grey|0.15069 black|0.079033 silver|0.072763 light|0.057849 slate|0.057849 gray|0.057849 light|0.054238 steel|0.054238 blue|0.054238 slate|0.052185 gray|0.052185 light|0.037709 gray|0.037709 light|0.037709 grey|0.037709 gainsboro|0.025709 lavender|0.021379 alice|0.0076886 blue|0.0076886 rosy|0.0067425 brown|0.0067425 ghost|0.0061064 white|0.0061064 white|0.0060029 smoke|0.0060029  "
		}
	}
}
