{
	"add": {
		"doc": {
			"id": "2801973a9cdb2d007675d7e70750b719221fea9fafb58bcc3c77e39a1c2a141f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Cutthroat_Trout.JPG/220px-Cutthroat_Trout.JPG",
				"previous": "Along with mountain lions, wolves are the largest top predators that live in the forest and have no predators of their own except humans. Most of the area's native mammal species are present in the forest, with the exception of grizzly bears, which have become locally extinct. Plans for their reintroduction to central Idaho have been proposed since the 1990s, but have not progressed because of concerns similar to those with the wolf reintroduction as well as fears for human safety.[43][44][45][46] The northern and high elevation areas of the forest contain habitat for wolverines and the endangered Canada lynx, but no recent sightings of these species have been reported.[3]",
				"after": "Elk (also known as wapiti), mule deer, and pronghorn (also called pronghorn antelope) are some of the most commonly seen large mammals. During winter, pronghorn that spend the summer in the Sawtooth Valley migrate south to the lower elevations on the Snake River Plain, and some sections of the forest are closed to motorized use to protect the elk winter range. Bighorn sheep are rare sights in the forest, but the forest contains one-third of Idaho's mountain goat population, and they are commonly seen at high elevations in the Boulder, White Cloud, Pioneer, and Sawtooth mountains. Other mammals in the forest include the coyote, moose, bobcat, beaver, yellow-bellied marmot, American pika, and American badger.[47]",
			"color": "light|0.23058 slate|0.23058 gray|0.23058 gray|0.20454 grey|0.20454 slate|0.18353 gray|0.18353 dark|0.13088 gray|0.13088 dark|0.13088 grey|0.13088 dim|0.067235 gray|0.067235 dim|0.067235 grey|0.067235 black|0.059392 dark|0.058154 slate|0.058154 gray|0.058154 silver|0.018958 light|0.0088573 gray|0.0088573 light|0.0088573 grey|0.0088573 gainsboro|0.0068649  "
		}
	}
}
