{
	"add": {
		"doc": {
			"id": "280376d65baa1328ba25b72b782dcc2d473c02719a1ec0061baca6482d835e4c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Pioneer_mills_radcliffe.jpg/220px-Pioneer_mills_radcliffe.jpg",
			"previous": [],
				"after": "The first documented reference to industry in Radcliffe is after 1680, in the Radcliffe parish registers, which make increasing mention of occupations such as woollen webster (weaving), linen webster, and whitster (bleacher). These were cottage industries which worked alongside local agriculture. In 1780 Robert Peel built the first factory in the town, several hundred yards upstream from Radcliffe Bridge (at the end of Peel Street). With a weir and goit providing motive power for a water wheel, the factory was built for throstle spinning and the weaving of cotton—a relatively new introduction to Britain. The water wheel proved to be insufficient, and so around 1804 the goit was extended. The weir (known as Rectory Weir)[22] was made from timber.[23] Conditions were poor; the mill employed child labour bought from workhouses in Birmingham and London. Children were boarded on an upper floor of the building, and bound until they reached the age of 21. They were unpaid, and were kept locked up each night. Shifts were typically 10–10.5 hours in length, and children returning from a day shift would sleep in the same bed as children leaving for a night shift. Peel himself admitted that conditions at the mill were \"very bad\".[24] In 1784 an outbreak of typhoid prompted Lord Grey de Wilton to inform the magistrates of the Salford Hundred;[25] keen to prevent the spread of the disease to neighbouring towns and villages, they sent doctors to assess the situation. Their recommendations included leaving the windows of the mill open at night, fumigation of rooms with tobacco (as this was thought to discourage disease), regular cleaning of rooms and toilets and occasional bathing of children.[26] The report forced the magistrates, led by Thomas Butterworth Bayley, to abandon the practice of binding parish apprentices to any mill not adhering to these conditions. The report also prompted Peel to introduce an Act of Parliament to improve factory hygiene, which later became the Factory Act of 1802.[27][28] Over time, conditions at the mill improved; in the mid-1790s the physician John Aikin, a critic of the factory system, praised working conditions at the mill,[29] and in 1823 inspections by local magistrates of conditions in mills across the county revealed that unlike many others, the factory at Radcliffe was adhering to all requirements of the Factory Acts.[30]",
			"color": "black|0.51214 dim|0.3136 gray|0.3136 dim|0.3136 grey|0.3136 gray|0.090779 grey|0.090779 dark|0.04187 gray|0.04187 dark|0.04187 grey|0.04187 slate|0.018163 gray|0.018163 light|0.012103 slate|0.012103 gray|0.012103  "
		}
	}
}
