{
	"add": {
		"doc": {
			"id": "2804a554bdd37615190f6cab107deb53f9e72fba9fcad3aa05b1c7ee71d3b1b7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Justin_Timberlake_Cannes_2013.jpg/100px-Justin_Timberlake_Cannes_2013.jpg",
			"previous": [],
				"after": "\"Cry Me a River\" is a song recorded by American singer-songwriter Justin Timberlake (pictured) for his debut studio album, Justified (2002). Taking inspiration from his former relationship with singer Britney Spears, he wrote it with Scott Storch and Timbaland. Jive Records released the song to contemporary hit and rhythmic radio in the US in 2002 as the album's second single. Accompanied by an electric piano, beatboxing, guitars, and synthesizers, \"Cry Me a River\" is a funk and R&B song about a brokenhearted man moving on from his unfaithful girlfriend. It received generally positive reviews from critics, who considered it a stand-out track on Justified and praised Timbaland's production. It won a Grammy Award for Best Male Pop Vocal Performance at the 2004 ceremony, and the music video won the awards for Best Male Video and Best Pop Video at the 2003 MTV Video Music Awards. The song peaked at number three on the US Billboard Hot 100 and Pop Songs charts and charted in the top ten in other countries. Timberlake performed \"Cry Me a River\" on his four major concert tours from 2003 through 2015. The song has been covered by Leona Lewis and Taylor Swift, among others. Spears recorded an answer song titled \"Everytime\" for her 2003 studio album In the Zone. (Full article...)",
			"color": "rosy|0.3085 brown|0.3085 dark|0.18217 gray|0.18217 dark|0.18217 grey|0.18217 silver|0.1136 gray|0.084897 grey|0.084897 dim|0.07913 gray|0.07913 dim|0.07913 grey|0.07913 light|0.036183 cyan|0.036183 black|0.032615 pale|0.031528 turquoise|0.031528 light|0.029664 gray|0.029664 light|0.029664 grey|0.029664 powder|0.016504 blue|0.016504 light|0.013776 blue|0.013776 gainsboro|0.011169 light|0.0080139 coral|0.0080139  "
		}
	}
}
