{
	"add": {
		"doc": {
			"id": "280c5db84382119d0e0e40a274061a2582a327b85c600294a8e1380517348fac",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Cope_Elasmosaurus.jpg/220px-Cope_Elasmosaurus.jpg",
				"previous": "Cope and Marsh came from very different backgrounds. Cope was born into a wealthy and influential Quaker family based in Philadelphia. Although his father wanted his son to work as a farmer, Cope distinguished himself as a naturalist.[5] In 1864, already a member of the Academy of Natural Sciences, Cope became a professor of zoology at Haverford College and joined Ferdinand Hayden on his expeditions west. In contrast, Marsh would have grown up poor, the son of a struggling family in Lockport, New York, had it not been for the benefaction of his uncle, philanthropist George Peabody.[6] Marsh persuaded his uncle to build the Peabody Museum of Natural History, placing Marsh as head of the museum. Combined with the inheritance he received from Peabody upon his death in 1869, Marsh was financially comfortable (although, partly because of Peabody's stern views on marriage, Marsh would remain a lifelong bachelor).[7]",
				"after": "On one occasion, the two scientists had gone on a fossil-collecting expedition to Cope's marl pits in New Jersey, where William Parker Foulke had discovered the holotype specimen of Hadrosaurus foulkii, described by the paleontologist Joseph Leidy; this was one of the first American dinosaur finds, and the pits were still rich with fossils.[2] Though the two parted amicably, Marsh secretly bribed the pit operators to divert future fossil finds to him, instead of Cope.[2] The two began attacking each other in papers and publications, and their personal relations deteriorated.[8] Marsh humiliated Cope by pointing out his reconstruction of the plesiosaur Elasmosaurus was flawed, with the head placed where the tail should have been (or so he claimed, 20 years later;[9] it was Leidy who published the correction shortly afterwards).[10] Cope, in turn, began collecting in what Marsh considered his private bone-hunting turf in Kansas and in Wyoming, further damaging their relationship.[8][11]",
			"color": "light|0.20536 gray|0.20536 light|0.20536 grey|0.20536 gainsboro|0.18868 silver|0.12673 linen|0.068454 misty|0.067261 rose|0.067261 lavender|0.059572 blush|0.059572 white|0.055794 smoke|0.055794 sea|0.052349 shell|0.052349 snow|0.043355 ghost|0.03667 white|0.03667 dark|0.036487 gray|0.036487 dark|0.036487 grey|0.036487 alice|0.027157 blue|0.027157 floral|0.017719 white|0.017719 white|0.0079137 gray|0.0031817 grey|0.0031817  "
		}
	}
}
