{
	"add": {
		"doc": {
			"id": "280f426f7c4523f9658ba4f9aa3610ba736bf4bae6ccabd265ac40f8ec3970ab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Car_Wash%2C_San_Bernardino%2C_CA.jpg/220px-Car_Wash%2C_San_Bernardino%2C_CA.jpg",
			"previous": [],
				"after": "The neighborhoods of San Bernardino are not commonly named. Some reflect geographical regions that existed before annexation, and others originated with specific housing developments. Arrowhead Springs extends from the historic Arrowhead Springs Hotel and Spa in the north to I-210 in the south and from Shandin Hills in the west to east Twin Creek in the east. Del Rosa is the area generally between the foothills and Highland, Mountain and Arden Avenues. Delmann Heights is the area north of Highland Avenue, west of I-215, and east of the unincorporated area of Muscoy, California (which is within the city's sphere of influence for annexation). Some portions of Highland are within the city of San Bernardino, generally consistent with the portions of historical \"West Highlands\" north of Highland Avenue. The city also contains the post office for Patton, California, the area coextensive with Patton Hospital. Mountain Shadows is the development name for the area between Palm Avenue and Highland Avenue to State Route 330. The \"West Side\" is used generically to refer to the areas West of I-215. North Loma Linda is the area west of Mountain View Acres (the border with Redlands), south of the Santa Ana River, north of the San Bernardino Freeway (I-10), and east of Tippecanoe Avenue. The area north of Northpark Boulevard from University Parkway to Electric Avenue, and the area north of 40th Street from Electric Avenue to Harrison Street is called Arrowhead Farms. The area west of University Parkway, and north of Kendall Drive to the north city area is called Verdemont. The \"Bench\" or \"Rialto Bench\" refers to the area with Rialto mailing addresses between Foothill Boulevard and Base Line Street.",
			"color": "silver|0.091557 indian|0.086668 red|0.086668 light|0.080368 gray|0.080368 light|0.080368 grey|0.080368 black|0.06928 gainsboro|0.063144 dark|0.050573 gray|0.050573 dark|0.050573 grey|0.050573 dim|0.047474 gray|0.047474 dim|0.047474 grey|0.047474 brown|0.037717 gray|0.033488 grey|0.033488 firebrick|0.028632 antique|0.022794 white|0.022794 light|0.022176 steel|0.022176 blue|0.022176 linen|0.021973 light|0.02024 blue|0.02024 dark|0.019334 khaki|0.019334 old|0.018875 lace|0.018875 sea|0.017498 shell|0.017498 floral|0.016772 white|0.016772 white|0.012658 smoke|0.012658 ivory|0.01227 slate|0.012073 gray|0.012073 powder|0.011401 blue|0.011401 light|0.011155 slate|0.011155 gray|0.011155 beige|0.01115 papaya|0.010866 whip|0.010866 snow|0.009833 misty|0.0095642 rose|0.0095642 golden|0.00913 rod|0.00913 rosy|0.0080559 brown|0.0080559 dark|0.0075188 slate|0.0075188 gray|0.0075188 corn|0.0070007 silk|0.0070007 blanched|0.0069406 almond|0.0069406  "
		}
	}
}
