{
	"add": {
		"doc": {
			"id": "281f3b6e5b68d38c8e76303fd8f1d48b389507284f0c8a98f8e1b9c5961f7449",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Caprimulgus_europaeus_-Beldibi%2C_Mugla%2C_Turkey_-two_eggs_in_a_nest-8_%283%29.jpg/220px-Caprimulgus_europaeus_-Beldibi%2C_Mugla%2C_Turkey_-two_eggs_in_a_nest-8_%283%29.jpg",
				"previous": "In cold or inclement weather, several nightjar species can slow their metabolism and go into torpor,[21] notably the common poorwill, which will maintain that state for weeks.[22] The European nightjar has been observed in captivity to be able to maintain a state of torpor for at least eight days without harm, but the relevance of this to wild birds is unknown.[19]",
				"after": "Breeding is normally from late May to August, but may be significantly earlier in northwest Africa or western Pakistan. Returning males arrive about two weeks before the females and establish territories which they patrol with wings held in a V-shape and tail fanned, chasing intruders while wing-clapping and calling. Fights may take place in flight or on the ground. The male's display flight involves a similar wing and tail position with frequent wing clapping as he follows the female in a rising spiral. If she lands, he continues to display with bobbing and fluttering until the female spreads her wings and tail for copulation. Mating occasionally takes place on a raised perch instead of the ground. In good habitat, there may be 20 pairs per square kilometre (50 per square mile).[3]",
			"color": "black|0.18743 dark|0.12842 gray|0.12842 dark|0.12842 grey|0.12842 silver|0.11511 gray|0.098658 grey|0.098658 light|0.094766 gray|0.094766 light|0.094766 grey|0.094766 gainsboro|0.07309 dim|0.067319 gray|0.067319 dim|0.067319 grey|0.067319 linen|0.026493 white|0.023769 smoke|0.023769 tan|0.023349 sea|0.02096 shell|0.02096 floral|0.016883 white|0.016883 snow|0.016272 old|0.013912 lace|0.013912 mint|0.012118 cream|0.012118 white|0.011842 ghost|0.0092317 white|0.0092317 antique|0.009097 white|0.009097 lavender|0.0080776 blush|0.0080776 burly|0.0075439 wood|0.0075439 ivory|0.007471 alice|0.0062581 blue|0.0062581  "
		}
	}
}
