{
	"add": {
		"doc": {
			"id": "282901a51ac875ef52c14bd87ebb4c9611aa1e5c9fb9c89fdbc14db92350fc2e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/RSAF_Typhoon_at_Malta_-_Gordon_Zammit.jpg/220px-RSAF_Typhoon_at_Malta_-_Gordon_Zammit.jpg",
				"previous": "The end of the Cold War in 1991 led many governments to significantly decrease military spending as a \"peace dividend\". Air force inventories were cut. Research and development programs working on \"fifth-generation\" fighters took serious hits. Many programs were canceled during the first half of the 1990s, and those that survived were \"stretched out\". While the practice of slowing the pace of development reduces annual investment expenses, it comes at the penalty of increased overall program and unit costs over the long-term. In this instance, however, it also permitted designers to make use of the tremendous achievements being made in the fields of computers, avionics and other flight electronics, which had become possible largely due to the advances made in microchip and semiconductor technologies in the 1980s and 1990s. This opportunity enabled designers to develop fourth-generation designs – or redesigns – with significantly enhanced capabilities. These improved designs have become known as \"Generation 4.5\" fighters, recognizing their intermediate nature between the 4th and 5th generations, and their contribution in furthering development of individual fifth-generation technologies.",
				"after": "The primary characteristics of this sub-generation are the application of advanced digital avionics and aerospace materials, modest signature reduction (primarily RF \"stealth\"), and highly integrated systems and weapons. These fighters have been designed to operate in a \"network-centric\" battlefield environment and are principally multirole aircraft. Key weapons technologies introduced include beyond-visual-range (BVR) AAMs; Global Positioning System (GPS)-guided weapons, solid-state phased-array radars; helmet-mounted sights; and improved secure, jamming-resistant datalinks. Thrust vectoring to further improve transient maneuvering capabilities has also been adopted by many 4.5th generation fighters, and uprated powerplants have enabled some designs to achieve a degree of \"supercruise\" ability. Stealth characteristics are focused primarily on frontal-aspect radar cross section (RCS) signature-reduction techniques including radar-absorbent materials (RAM), L-O coatings and limited shaping techniques.",
			"color": "dark|0.26131 gray|0.26131 dark|0.26131 grey|0.26131 silver|0.19389 black|0.14645 light|0.097055 gray|0.097055 light|0.097055 grey|0.097055 light|0.080824 steel|0.080824 blue|0.080824 gray|0.062973 grey|0.062973 gainsboro|0.042523 dim|0.037099 gray|0.037099 dim|0.037099 grey|0.037099 light|0.032659 slate|0.032659 gray|0.032659 slate|0.02056 gray|0.02056  "
		}
	}
}
