{
	"add": {
		"doc": {
			"id": "282942dd60eaaebf8a52ef4136cf4b9cb285387764eba4f5000a7e1bdab0d374",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/El_dos_de_mayo_de_1808_en_Madrid.jpg/220px-El_dos_de_mayo_de_1808_en_Madrid.jpg",
				"previous": "Napoleon I of France declared himself First Consul of the French Republic on 18 February 1799, and crowned himself Emperor in 1804. Because Spain controlled access to the Mediterranean, the country was politically and strategically important to French interests. The reigning Spanish sovereign, Charles IV, was internationally regarded as ineffectual. Even in his own court he was seen as a \"half-wit king who renounces cares of state for the satisfaction of hunting\",[6] and a cuckold unable to control his energetic wife, Maria Luisa of Parma. Napoleon took advantage of the weak king by suggesting the two nations conquer and divide Portugal, with France and Spain each taking a third of the spoils, and the final third going to the Spanish Prime Minister Manuel de Godoy, along with the title Prince of the Algarve. Godoy was seduced, and accepted the French offer. He failed, however, to grasp Napoleon's true intentions, and was unaware that his new ally and co-sovereign, the former king's son Ferdinand VII of Spain, was using the invasion merely as a ploy to seize the Spanish parliament and throne. Ferdinand intended not only that Godoy be killed during the impending power struggle, but also that the lives of his own parents be sacrificed.[6]",
				"after": "Under the guise of reinforcing the Spanish armies, 23,000 French troops entered Spain unopposed in November 1807.[7] Even when Napoleon's intentions became clear the following February, the occupying forces found little resistance apart from isolated actions in disconnected areas, including Saragossa.[8] Napoleon's principal commander, Marshal Joachim Murat, believed that Spain would benefit from rulers more progressive and competent than the Bourbons, and Napoleon's brother Joseph Bonaparte was to be made king.[9] After Napoleon convinced Ferdinand to return Spanish rule to Charles IV, the latter was left with no choice but to abdicate, on 19 March 1808, in favor of Joseph Bonaparte.",
			"color": "black|0.38362 tan|0.32997  "
		}
	}
}
