{
	"add": {
		"doc": {
			"id": "283fae569cdb1a281acf081218ec6bcb4e4ce158f11b147e7a66fa6b92e053e2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/His_Best_Customer.jpeg/220px-His_Best_Customer.jpeg",
				"previous": "Gertie was McCay's first piece of animation with detailed backgrounds.[62] McCay drew the foreground characters, while art student neighbor John A. Fitzsimmons traced the backgrounds.[70] McCay pioneered the \"McCay Split System\" of inbetweening, in which major poses or positions were drawn first, and the intervening frames drawn after. This relieved tedium and improved the timing of the film's actions. McCay refused to patent his system,[71] and was sued in 1914 by animator John Randolph Bray,[72] who took advantage of McCay's lapse by patenting many of McCay's techniques, including the use of registration marks, tracing paper, the Mutoscope action viewer, and the cycling of drawings to create repetitive action.[73] The lawsuit was unsuccessful, and there is evidence that McCay may have countersued — he thereafter received royalty payments from Bray for licensing the techniques.[74]",
				"after": "Hearst was disappointed with the quality of McCay's newspaper work. Infuriated that he couldn't reach McCay during a vaudeville performance, Hearst pulled from his papers advertising for the theatre where McCay performed.[75] Editor Arthur Brisbane told him that he was \"a serious artist, not a comic cartoonist\",[76] and that he was to give up his comic strip work to focus on editorial illustrations.[76] Hearst pressured McCay's agents to reduce the number of his vaudeville appearances, and he was induced to sign a contract with Hearst that limited his vaudeville appearances to greater New York,[69] with occasional exceptions.[77] In February 1917, Hearst had McCay give up entirely on vaudeville and all other paid work outside the Hearst empire, though he was occasionally granted permission for particular shows. Hearst increased McCay's salary to cover the loss of income.[78]",
			"color": " "
		}
	}
}
