{
	"add": {
		"doc": {
			"id": "287144ddfe6b5dbb175c286749c9642f64cc7aca910f951aff08e17c8898d16c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Interior_Teatro_Colon_Bogota.jpg/180px-Interior_Teatro_Colon_Bogota.jpg",
				"previous": "In general, Colombian music blends European-influenced guitar and song structure with large gaita flutes and percussion instruments from the indigenous population, while its percussion structure and dance forms come from Africa. Colombian music reflects a wealth of musical influences that have given birth to a dynamic musical environment. Some of the most popular music genres that have marked the Colombian music with special relevance are the cumbia, vallenato, joropo, salsa, bambuco, rock, pop and the classical music. Shakira and Juanes are two of the most well-known Colombian musicians internationally.[230] Colombian music is promoted mainly by the support of the largest record labels, independent companies and the Government of Colombia, through the Ministry of Culture.",
				"after": "Colombian architecture is mainly derived of adapting European styles to local conditions, and Spanish influence, especially Andalusian, can be easily seen. The Teatro Colón in Bogotá is a lavish example of Colombian architecture from the Republican period, and the Archbishopric Cathedral also in the capital, was made in the neoclassic style in 1792, by Colombian architect Domingo de Petrés. Rogelio Salmona, whose works are noted for their use of red brick and natural shapes, is a widely renowned Colombian architect.[223]",
			"color": "tan|0.20797 antique|0.063245 white|0.063245 peach|0.052491 puff|0.052491 dark|0.048569 gray|0.048569 dark|0.048569 grey|0.048569 silver|0.048249 burly|0.042487 wood|0.042487 linen|0.042294 light|0.033952 gray|0.033952 light|0.033952 grey|0.033952 old|0.033732 lace|0.033732 papaya|0.033076 whip|0.033076 bisque|0.032854 sea|0.030505 shell|0.030505 floral|0.02948 white|0.02948 gray|0.027434 grey|0.027434 blanched|0.027012 almond|0.027012 gainsboro|0.02395 beige|0.022519 ivory|0.021637 wheat|0.019827 corn|0.019018 silk|0.019018 misty|0.018377 rose|0.018377 dim|0.016635 gray|0.016635 dim|0.016635 grey|0.016635 white|0.015433 smoke|0.015433 snow|0.014452 white|0.010336 mint|0.010065 cream|0.010065 lavender|0.0085312 blush|0.0085312 light|0.007514 yellow|0.007514 navajo|0.0073425 white|0.0073425 moccasin|0.0066041 ghost|0.0063998 white|0.0063998 honeydew|0.0058896  "
		}
	}
}
