{
	"add": {
		"doc": {
			"id": "287905c90ed5a7347dc4c935ce54e4105e16cba86faf97eb4fb7566c608a9d90",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Klasa_radetzky.png/220px-Klasa_radetzky.png",
				"previous": "Germany's first pre-dreadnoughts, the Brandenburg class, were laid down in 1890. By 1905, a further 19 battleships were built or under construction, thanks to the sharp increase in naval expenditure justified by the 1898 and 1900 Navy Laws.[38] This increase was due to the determination of the navy chief Alfred von Tirpitz and the growing sense of national rivalry with the UK. Besides the Brandenburg class, German pre-dreadnoughts include the ships of the Kaiser Friedrich III, Wittelsbach, and Braunschweig classes—culminating in the Deutschland class, which served in both World Wars. On the whole, the German ships were less powerful than their British equivalents but equally robust.[39]",
				"after": "Russia equally entered into a programme of naval expansion in the 1890s; one of Russia's main objectives was to maintain its interests against Japanese expansion in the Far East. The Petropavlovsk class begun in 1892 took after the British Royal Sovereigns; later ships showed more French influence on their design, such as the Borodino class. The weakness of Russian shipbuilding meant that many ships were built overseas for Russia; the best ship, the Retvizan, being largely constructed in America.[40] The Russo-Japanese War of 1904–05 was a disaster for the Russian pre-dreadnoughts; of the 15 battleships completed since Petropavlovsk, eleven were sunk or captured during the war. One of these, the famous Potemkin, mutinied and was scuttled, however she was later raised and recommissioned. After the war, Russia completed four more pre-dreadnoughts after 1905.",
			"color": "gray|0.10759 grey|0.10759 dark|0.089421 gray|0.089421 dark|0.089421 grey|0.089421 dim|0.080722 gray|0.080722 dim|0.080722 grey|0.080722 white|0.06502 smoke|0.06502 sea|0.062519 shell|0.062519 alice|0.062495 blue|0.062495 ghost|0.062487 white|0.062487 snow|0.062401 white|0.061772 mint|0.061011 cream|0.061011 floral|0.060066 white|0.060066 azure|0.059394 lavender|0.059065 blush|0.059065 silver|0.039914 light|0.024422 gray|0.024422 light|0.024422 grey|0.024422 gainsboro|0.019467 linen|0.0048258 ivory|0.00336  "
		}
	}
}
