{
	"add": {
		"doc": {
			"id": "28842d383deeb4124d5f8b22e0c9fa6b8fd28ea6f6cb35c73f2e1845e151b19d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/BathRoyalCrescentAirial_morecontrast.jpg/220px-BathRoyalCrescentAirial_morecontrast.jpg",
				"previous": "During the English Civil War, the city was garrisoned for Charles I. Seven thousand pounds was spent on fortifications but on the appearance of parliamentary forces, the gates were thrown open and the city surrendered. It became a significant post for the New Model Army under William Waller.[39] It was retaken by royalists following the Battle of Lansdowne fought on the northern outskirts of the city on 5 July 1643.[40] Thomas Guidott, a student of chemistry and medicine at Wadham College, Oxford, set up a practice in the town in 1668. He was interested in the curative properties of the waters and he wrote A discourse of Bathe, and the hot waters there. Also, Some Enquiries into the Nature of the water in 1676. It brought the health-giving properties of the hot mineral waters to the attention of the country and the aristocracy arrived to partake in them.[41]",
				"after": "Several areas of the city were developed in the Stuart period, and more building took place during Georgian times in response to the increasing number of visitors who required accommodation.[42] Architects John Wood the elder and his son laid out the new quarters in streets and squares, the identical façades of which gave an impression of palatial scale and classical decorum.[43] Much of the creamy gold Bath stone, a type of limestone, used for construction in the city was obtained from the Combe Down and Bathampton Down Mines, owned by Ralph Allen (1694–1764).[44] Allen, to advertise the quality of his quarried limestone, commissioned the elder John Wood to build a country house on his Prior Park estate between the city and the mines.[44] Allen was responsible for improving and expanding the postal service in western England, for which he held the contract for more than forty years.[44] Although not fond of politics, Allen was a civic-minded man and member of Bath Corporation for many years. He was elected mayor for a single term in 1742.[44]",
			"color": "dim|0.2323 gray|0.2323 dim|0.2323 grey|0.2323 gray|0.18394 grey|0.18394 dark|0.14783 gray|0.14783 dark|0.14783 grey|0.14783 black|0.099743 silver|0.086847 light|0.054506 gray|0.054506 light|0.054506 grey|0.054506 gainsboro|0.038225 slate|0.023451 gray|0.023451 light|0.015875 slate|0.015875 gray|0.015875 linen|0.012576 sea|0.0094412 shell|0.0094412 white|0.0093542 smoke|0.0093542 antique|0.0085227 white|0.0085227 floral|0.0078055 white|0.0078055 old|0.0070304 lace|0.0070304  "
		}
	}
}
