{
	"add": {
		"doc": {
			"id": "289187d9794067f6dad26d36d634dcf152539a92df7930f5e3230a0094a3a941",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Nieuport28.jpg/220px-Nieuport28.jpg",
			"previous": [],
				"after": "France has used many military aircraft both in its air force, the Armée de l'Air, and other branches of its armed forces. Numerous aircraft were designed and built in France, but many aircraft from elsewhere, or part of joint ventures have been used as well. Lighter-than-air aircraft such as dirigibles and balloons found use starting in the 19th century used mainly for observation. The advent of World War I saw an explosion in the number France's aircraft, though development slowed after. While having many promising designs in development in the 1930s, government wrangling delayed development enough there was little available at the out break of World War II. The armistice in 1940 marked a low point, with Vichy France being allowed only reduced numbers and development halting. Many French aircraft were captured and used by the Third Reich and its allies. Some aircraft that did escape served with the Allies or Free French forces, who also used many other types of allied aircraft. The cold-war saw the continued use of many other Western aircraft, mainly from the U.S., during a period of rebuilding of the aviation industry and under threat of war with the Soviet Union. Many new types would come into service including the very successful Mirage series or the latest design, the Rafale.",
			"color": "black|0.59097 dark|0.037996 sea|0.037996 green|0.037996 dark|0.036948 slate|0.036948 gray|0.036948 dim|0.03549 gray|0.03549 dim|0.03549 grey|0.03549 gray|0.031941 grey|0.031941 dark|0.030325 gray|0.030325 dark|0.030325 grey|0.030325 slate|0.021013 gray|0.021013 light|0.017938 slate|0.017938 gray|0.017938 silver|0.016833 firebrick|0.013205 light|0.011817 gray|0.011817 light|0.011817 grey|0.011817 gainsboro|0.010744 ghost|0.010067 white|0.010067 white|0.010024 smoke|0.010024  "
		}
	}
}
