{
	"add": {
		"doc": {
			"id": "290e027ecb70a308a27def27ba77a88c98b74d536f03ddfa36b97c4843cb8c73",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/NATS_London_Area_Control_Centre%2C_Swanwick_-_geograph.org.uk_-_464744.jpg/220px-NATS_London_Area_Control_Centre%2C_Swanwick_-_geograph.org.uk_-_464744.jpg",
				"previous": "B&Q and Draper Tools are based in Chandler's Ford, also Pips Technology (owned by Federal Signal Corporation) who make ANPR cameras. Prysmian Cables & Systems, who make high-tension electric cables (for offshore windfarms), communication cables and fire-resistant cable, are off the B3037 in Eastleigh, next to a rail servicing plant and the River Itchen. Bacardi-Martini and London Camera Exchange are in Winchester and four miles (6 km) north-west, Arqiva (broadcasting infrastructure) are based in Crawley, Hampshire. IAC UK, an acoustics company, is off junction 9 of the M3 north of Winchester. Garmin Europe is in Hounsdown just west of Southampton. Esso has its main UK refinery at Fawley (the largest refinery, by production, in the UK). Roke Manor Research Limited at Roke Manor at Romsey Extra developed the Hawk-Eye system in 2001. Cannon Technologies next to the railway in the west of New Milton make computer ancillary equipment and data centres.",
				"after": "Chemring Group and the National Air Traffic Services (NATS) are in Fareham (Swanwick) near Zurich Insurance UK. At Locks Heath is Estée Lauder UK, next to the A27. Raymarine Marine Electronics (owned by FLIR Systems) off the A27 at Titchfield is the world's leading leisure marine electronics company. CooperVision make contact lenses, and Gemalto UK make chip and pin cards at Segensworth; GE Aviation, on a site which was formerly Folland Aircraft then BAe Aerostructures, has a factory at Hamble-le-Rice which makes composites for airframes and racing cars, using products such as Bismaleimide resin. Best Buy Europe is in Hedge End. Camper and Nicholsons closed their Gosport boatyard in 2005. Kenwood Limited is in Havant. Lockheed Martin U.K. is at the Langstone Technology Park[30] off the A3023, near the A27, at Brockhampton, near to Apollo Fire Detectors, and Lewmar makes anchors, winches, (Navtec) rigging and (Whitlock) boat steering systems",
			"color": "dark|0.17844 olive|0.17844 green|0.17844 olive|0.12081 tan|0.11961 olive|0.11048 drab|0.11048 dark|0.078767 khaki|0.078767 black|0.060286 dark|0.037917 gray|0.037917 dark|0.037917 grey|0.037917 dim|0.033788 gray|0.033788 dim|0.033788 grey|0.033788 rosy|0.031959 brown|0.031959 silver|0.030385 gray|0.027641 grey|0.027641 light|0.025588 gray|0.025588 light|0.025588 grey|0.025588 gainsboro|0.01699  "
		}
	}
}
