{
	"add": {
		"doc": {
			"id": "2914d96f5b1216d90671eca9b9327b45cb2f4c02967762303d817955095607da",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/PaulowniaTomentosaShell.jpg/220px-PaulowniaTomentosaShell.jpg",
				"previous": "Historically, Chorioactis was considered to be in the family Sarcosomataceae.[9][10] A 1983 monograph on the family included Chorioactis in the tribe Sarcosomateae (along with the genera Desmazierella, Sarcosoma, Korfiella, Plectania, and Urnula), a grouping of fungi characterized by having spores lacking small wartlike projections (verruculae) capable of absorbing blue dye.[11] A 1994 study of the structural features of the asci and the ascospores concluded that Chorioactis was more closely aligned with the Sarcoscyphaceae, although it conceded that the layering of the cells comprising the walls of the ascus differed considerably from the other members of the family.[12] It was not until 1999 that the results of phylogenetic analysis firmly challenged the traditional classification, showing C. geaster to be part of a distinct lineage, or clade, that includes species in the genera Desmazierella, Neournula, and Wolfina, taxa that were distributed among both families.[13] This analysis was later corroborated when it was shown that the grouping of these four genera (by then called the \"Chorioactis clade\") represented a sister clade to the Sarcosomataceae,[14] and a new family, the Chorioactidaceae, was erected to contain them.[15] Although C. geaster shares some characteristics with the other Chorioactidaceae genera, including dark-colored superficial \"hairs\" on the outer surface of the fruit bodies, it is distinguished from them by its tan to orange (rather than black) hymenia.[16]",
				"after": "The specific epithet geaster alludes to members of genus Geastrum, which also open to form star-shaped fruit bodies commonly called 'earthstars'. In the United States, Chorioactis geaster is commonly known as the Texas star, or the devil's cigar.[17] Regarding the origin of the latter name American mycologist Fred Jay Seaver commented: \"Whether the name Devil's Cigar refers to the form of the young specimens which resemble a bloated cigar in form, as well as in color, or to the fact that the fungus appears to 'smoke' at maturity, we cannot say ... At any rate, the name is very appropriate.\"[7] In 1997, Texan state Senator Chris Harris filed a bill to make C. geaster the official state fungus of Texas.[18] The bill passed the Senate but did not succeed in the House.[19] In Japan the mushroom is called kirinomitake (キリノミタケ), because the immature, unopened fruit body bears a superficial resemblance to the seed pods of kiri, the empress tree (Paulownia tomentosa).[20]",
			"color": "black|0.36069 dark|0.17064 sea|0.17064 green|0.17064 dim|0.1673 gray|0.1673 dim|0.1673 grey|0.1673 dark|0.14403 olive|0.14403 green|0.14403 olive|0.043433 drab|0.043433 gray|0.042718 grey|0.042718  "
		}
	}
}
