{
	"add": {
		"doc": {
			"id": "2925fe8f92cc74a896cb7cfbd68dae4932c7b9799173b14c3efc84292166357a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Zuni.gif/220px-Zuni.gif",
				"previous": "A dose of 5.3 Gy to 8.3 Gy is considered lethal but not immediately incapacitating. Personnel exposed to this amount of radiation have their performance degraded in two to three hours, depending on how physically demanding the tasks they must perform are, and remain in this disabled state at least two days. However, at that point they experience a recovery period and can perform non-demanding tasks for about six days, after which they relapse for about four weeks. At this time they begin exhibiting symptoms of radiation poisoning of sufficient severity to render them totally ineffective. Death follows at approximately six weeks after exposure, although outcomes may vary.",
				"after": "Late or delayed effects of radiation occur following a wide range of doses and dose rates. Delayed effects may appear months to years after irradiation and include a wide variety of effects involving almost all tissues or organs. Some of the possible delayed consequences of radiation injury are life shortening, carcinogenesis, cataract formation, chronic radiodermatitis, decreased fertility, and genetic mutations.[3] Presently, the only teratological effect observed in humans following nuclear attacks on highly populated areas is microcephaly which is the only proven malformation, or congenital abnormality, found in the in utero developing human fetuses present during the Hiroshima and Nagasaki bombings. Of all the pregnant women exposed in the two cities, the number of children born with microcephaly was below 50.[4] No statistically demonstrable increase of congenital malformations was found among the later conceived children born to survivors of the nuclear detonations at Hiroshima and Nagasaki.[4][5][6] The surviving women of Hiroshima and Nagasaki who could conceive and were exposed to substantial amounts of radiation went on and had children with no higher incidence of abnormalities than the Japanese average.[7][8]",
			"color": " "
		}
	}
}
