{
	"add": {
		"doc": {
			"id": "2934bc2e813cdccb7e52cabb1381c71a47257dae131664082238d25b23828680",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Banksia_sphaerocarpa_foll.JPG/220px-Banksia_sphaerocarpa_foll.JPG",
				"previous": "Banksia sphaerocarpa is a variable species that differs in plant size, flower size and leaf size across its range. The variability is marked enough that five varieties are recognised. This species is generally a shrub 0.4–2 m (1–7 ft) tall. Plants are smaller in northern parts of the range, and grow larger in the southeast, with var. dolichostyla and rarely var. caesia reaching 4 m (13 ft) in height. All varieties bear a lignotuber, a swollen starchy root crown from which the plant resprouts after bushfire. The new stems are finely hairy but become smooth with maturity. The leaves are stiff, narrow and linear, and measure 2.5–10 cm (1–4 in) in length, on a petiole 2–3 mm (0.1 in) long. Leaves of most varieties are 1–1.5 mm in width, and have a pointed tip,[2] but var. latifolia has wider leaves, 2–2.5 cm (0.8–1 in), and a blunter tip.[3] The foliage is green, or a more pale blue-grey in the case of caesia and dolichostyla.",
				"after": "The inflorescences are generally globular and measure 5 to 8 cm (2–3 in) in diameter,[4] although larger forms, such as var. dolichostyla, are more oval in shape. Flowering from January to July, the blooms are yellow, orange or brownish in colour.[2] They take five to eight weeks to develop from bud to the finish of flowering. Anthesis takes place over two weeks, as the individual flowers open in a wave across the inflorescence. Three weeks before the flowers open, the spikes develop a strong musky smell. The flowers produce unusually large quantities of nectar; indeed some flowers produce so much that it drips to the ground.[5] The old flowers fade to brownish and grey hues and remain curled around the flower spike. Up to 60 follicles develop on the globular spikes. The follicles are finely furred at first before becoming smooth and golden brown in colour, measuring 1.5–3 cm (0.6–1.2 in) long, 0.5–0.8 cm (0.2–0.3 in) high, and 1–2.5 cm (0.4–1 in) wide. The follicles are flat with pronounced 'shoulders', giving a rectangular appearance in cross section.[2] Specimens of var. sphaerocarpa in the Whicher Range, Jarrah Forest and the vicinity of Nannup have larger follicles.[3] The seeds are wedge-shaped (cuneate), and measure 2.0–2.6 cm (0.8–1 in) in length, containing a smaller cuneate seed body measuring 1–1.4 cm (0.4–0.6 in) long by 0.5–1.3 cm (0.2–0.5 in) wide.[2]",
			"color": "dark|0.20617 gray|0.20617 dark|0.20617 grey|0.20617 silver|0.1419 gray|0.12778 grey|0.12778 light|0.080191 gray|0.080191 light|0.080191 grey|0.080191 dim|0.076129 gray|0.076129 dim|0.076129 grey|0.076129 rosy|0.074212 brown|0.074212 gainsboro|0.052831 black|0.042344 misty|0.017237 rose|0.017237 thistle|0.015116 brown|0.014267 lavender|0.01165 blush|0.01165 linen|0.01122 indian|0.010842 red|0.010842 maroon|0.010568 white|0.01019 smoke|0.01019 sea|0.008493 shell|0.008493 snow|0.0068546 ghost|0.0057406 white|0.0057406  "
		}
	}
}
