{
	"add": {
		"doc": {
			"id": "29395f6eb1c278dbbcd7bd7c5ebef5476b1d8203ca66a83c0efc3cc0abd6f12a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Propagation_du_tsunami_en_profondeur_variable.gif/220px-Propagation_du_tsunami_en_profondeur_variable.gif",
				"previous": "Ocean surface waves are oscillations caused by the friction from air moving across the surface of the water. This friction transfers energy and forms surface waves in the water perpendicular to the direction of the wind. The top of a wave is known as its crest and its foot as its trough; the distance between two crests is the wavelength. These waves are mechanical: as they approach, the water molecules at a given point rise up and, as they pass, the water molecules go down, tracing a roughly circular path. The energy is passed across the surface and does not represent a horizontal motion of the water itself. The sea state of the ocean is determined by the size of these waves, which—on the open ocean—depends upon the wind speed and the fetch, the distance over which the wind blows upon the water. The smallest waves are called ripples. As strong and prolonged winds push against ripples' raised crests, larger and more irregular waves form, which known as seas. These waves reach their maximum height when the rate at which they are traveling nearly matches the speed of the wind and, over time, they naturally separate[e] into long, powerful waves with a common direction and wavelength. These swells are particularly common in the Roaring Forties of the Southern Hemisphere where the wind blows continuously.[40][41] When the wind dies down, ripples easily disappear owing to water's surface tension, but seas and swells are only slowly reduced by gravity and destructive interference from other waves.[40] Constructive interference, however, can also cause individual rogue waves much higher than normal.[42] Most waves are less than 3 m (10 ft) high[42] and it is not unusual for strong storms to double or triple that height;[43] offshore construction such as wind farms and oil platforms use these measurements in computing the hundred-year wave they are designed against.[44] Rogue waves, however, have been documented at heights above 25 meters (82 ft).[45][46]",
				"after": "As waves approach land and move into shallow water, they change their behavior. If approaching at an angle, waves may bend or wrap rocks and headlands. When the wave reaches a point where its deepest oscillating molecules contact the seabed, friction begins to slow the wave down. This pulls the crests closer together and increases the waves' height. When the ratio of a wave's height to its wavelength exceeds 1:7, it \"breaks\", toppling over in a mass of foaming water.[42] This rushes in a sheet up the beach before retreating into the sea under the influence of gravity.[40]",
			"color": " "
		}
	}
}
