{
	"add": {
		"doc": {
			"id": "293b09f99a916dcef68b4fbaa3698963b08ae8f15777ce26c2f0c61ebe2ebef2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Aquakultur-Vestmanna.jpg/220px-Aquakultur-Vestmanna.jpg",
				"previous": "Over 3 million vessels are employed in sea fishing.[193] Modern fishing vessels include fishing trawlers with a small crew, stern trawlers, purse seiners, long-line factory vessels, and large factory ships which are designed to stay at sea for weeks, processing and freezing great quantities of fish. The equipment used to capture the fish may be purse seines, other seines, trawls, dredges, gillnets, and long-lines. The Food and Agriculture Organization of the United Nations is encouraging the development of local fisheries to provide food security to coastal communities and help alleviate poverty.[196]",
				"after": "As well as the wild stock, about 79 million metric tons (87 million tons) of food and non-food products were produced by sea farming in 2010, an all-time high. About six hundred species of plants and animals were cultured, some for use in seeding wild populations. The animals raised included finfish, aquatic reptiles, crustaceans, molluscs, sea cucumbers, sea urchins, sea squirts, and jellyfish.[197] Integrated mariculture has the advantage that there is a readily-available supply of planktonic food and waste is removed naturally;[198] in cases where the waste would otherwise be harmful, multi-species techniques can used to, e.g., feed farmed shellfish from the waste being produced by farmed salmon. Various methods are employed. Mesh enclosures for finfish can be suspended in the open seas, cages can be used in more sheltered waters, or ponds can be refreshed with water at each high tide. Shrimps can be reared in shallow ponds connected to the open sea.[199] Ropes can be hung in water to grow algae, oysters, and mussels. Oysters can be reared on trays or in mesh tubes. Sea cucumbers can be ranched on the seabed.[200] Captive breeding programmes have raised lobster larvae for release of juveniles into the wild resulting in an increased lobster harvest in Maine.[201] At least 145 species of seaweed—red, green, and brown algae—are eaten worldwide, some long farmed in Japan and other Asian countries; there is great potential for additional algaculture.[202] Few maritime flowering plants are widely used for food but one example is marsh samphire, which is eaten both raw and cooked.[203] A major difficulty for aquaculture is the tendency towards monoculture and the associated risk of widespread disease. In the 1990s, disease wiped out China's farmed Farrer's scallop and white shrimp and required their replacement by other species.[204] Shrimp farming has also caused the destruction of important mangrove forests throughout southeast Asia.[205]",
			"color": "slate|0.42682 gray|0.42682 light|0.32691 slate|0.32691 gray|0.32691 dark|0.07791 slate|0.07791 gray|0.07791 dark|0.076715 gray|0.076715 dark|0.076715 grey|0.076715 gray|0.036917 grey|0.036917 dim|0.020453 gray|0.020453 dim|0.020453 grey|0.020453 silver|0.016325 black|0.0082615  "
		}
	}
}
