{
	"add": {
		"doc": {
			"id": "2961a1806e9a0417a6360bf8f2ae2d42a48a44c4dd00fc137a4fe6d9c29f460f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Draft_dodger_counseling_office.jpg/170px-Draft_dodger_counseling_office.jpg",
				"previous": "As 1967 began, many American pacifists and radicals did not look favorably on emigration to Canada as a means of resisting the Vietnam War.[30] For some this reflected a core conviction that effective war resistance requires self-sacrifice.[31][32] For others it was a matter of strategy – emigration was said to be less useful than going to jail[33] or deserting the military,[34] or was said to abet the war by siphoning off the opposition.[30] At first, Students for a Democratic Society and many Quaker draft counselors opposed promoting the Canadian alternative,[35] and Canada's largest counseling group, the Anti-Draft Programme of the Student Union for Peace Action (SUPA)[36] – whose board consisted largely of Quakers and radicals[36] – was sympathetic to such calls for prudence.[37] In January 1967 its spokesman warned an American audience that immigration was difficult and that the Programme was not willing to act as \"baby sitters\" for Americans after they arrived. He added that he was tired of talking to the press.[38]",
				"after": "When Mark Satin was hired as director of the Programme in April 1967, he attempted to change its culture. He also tried to change the attitude of the war resistance movement toward emigration. His efforts continued after SUPA collapsed and he co-founded the Toronto Anti-Draft Programme, with largely the same board of directors, in October 1967.[39] Instead of praising self-sacrifice, he emphasized the importance of self-preservation and self-development to social change.[40] Rather than sympathizing with pacifists' and radicals' strategic concerns, he rebutted them, telling The New York Times that massive emigration of draft-age Americans could help end the war,[41] and telling another reporter that going to jail was bad public relations.[20]",
			"color": " "
		}
	}
}
