{
	"add": {
		"doc": {
			"id": "296fa3ece20d33ba252cecc7ff37a1aa32e9b50e178a2ceae5606ed54149b6a6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/US_Gender_pay_gap%2C_1980-2009.001.png/220px-US_Gender_pay_gap%2C_1980-2009.001.png",
				"previous": "Despite women's increasing participation in the work force, a gender division of labor persist. There are a number of constraints in the labor market that contribute to the double burden. \"Women are disproportionately represented in informal work and concentrated among lower-quality jobs within self-employment.\" [26] The informal market is generally precarious and characterized by low wages, few benefits, and a lack of social protections that are offered in the formal market. Even within the formal market, there is occupational segregation and a gender wage gap. Occupational segregation can be either horizontal or vertical: horizontal segregation limits women to certain sectors and occupations, while vertical segregation restricts them to particular positions within occupational hierarchies. Men and women are even found at different levels of the occupational hierarchy. The \"glass ceiling\" refers to the dearth of women in senior or managerial positions due to institutional barriers and norms. Even in female-dominated occupations, men often occupy the more skilled and better paid positions.",
				"after": "The gender wage gap is a possible consequence of occupational segregation. The gender wage gap is the \"difference between wages earned by women and men\".[26] In 2008, globally, men were estimated to earn 16.5 per cent more than women. The gender wage gap is narrowing, but progress remains slow. Additionally, the narrowing of the gender wage gap may be attributed to a decrease in men's wages instead of an increase in women's wages. \"The persistent gender wage gap across regions may reflect a number of factors, including women’s continued disadvantage in terms of education and skills; their lack of an organized voice and bargaining power; gender-specific constraints on their labour market mobility; and their relatively high involvement in part-time or temporary jobs.\" [26] Many characteristics of the labor market constrain the employment opportunities of women and make it easier for them to be responsible for care work.",
			"color": "white|0.09447 smoke|0.09447 alice|0.09156 blue|0.09156 ghost|0.091502 white|0.091502 snow|0.091315 sea|0.091308 shell|0.091308 lavender|0.09056 blush|0.09056 white|0.090462 mint|0.089873 cream|0.089873 floral|0.089286 white|0.089286 azure|0.088149 dark|0.015504 gray|0.015504 dark|0.015504 grey|0.015504 light|0.014853 gray|0.014853 light|0.014853 grey|0.014853 silver|0.014512 gainsboro|0.013625 gray|0.0082436 grey|0.0082436 slate|0.0071425 gray|0.0071425 light|0.0071289 slate|0.0071289 gray|0.0071289 dim|0.004368 gray|0.004368 dim|0.004368 grey|0.004368 linen|0.0043094  "
		}
	}
}
