{
	"add": {
		"doc": {
			"id": "2973318e99f6ae9767593100d37f7cbb4b38a46effdbcc8df32236d1c1c97d7d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Ellipse_sign_17.svg/120px-Ellipse_sign_17.svg.png",
			"previous": [],
				"after": "Prior to 1927, the route was designated as Route 17N, which was to run from Newark to the New York state line. This route had followed various local streets, including the Franklin Turnpike north of Hackensack. In 1927, Route 17N became Route 2, which was designated along the portion of Route 17N between Route 7 in North Arlington to the New York border near Suffern, New York. This route was moved to a multilane divided highway alignment north of Rutherford by 1937. Route 2 became Route 17 in 1942 to match the designation of New York State Route 17 for defense purposes during World War II. The entire Route 17 corridor was once planned to be a freeway until the 1960s and later plans to extend the route south of Route 3 to Interstate 280 in 1972 and to the New Jersey Turnpike in 1987 both failed. Over the years, the portion of Route 17 north of Route 3 has seen many improvements, including the widening of much of the road to six lanes and the removal of most at-grade intersections in the 1950s as well as more recent improvements to the interchanges with Route 4 in Paramus in 1999 and Essex Street on the Lodi/Maywood border in 2008. The route is currently undergoing improvements between Route 3 and U.S. Route 46 and is expected to see improvements from Williams Avenue in Hasbrouck Heights to south of Route 4 in Paramus.",
			"color": "white|0.098503 smoke|0.098503 ghost|0.097888 white|0.097888 snow|0.097881 alice|0.09771 blue|0.09771 sea|0.097552 shell|0.097552 white|0.097324 mint|0.097187 cream|0.097187 floral|0.096598 white|0.096598 azure|0.096477 lavender|0.093308 blush|0.093308 light|0.006183 gray|0.006183 light|0.006183 grey|0.006183 silver|0.0061411 gainsboro|0.0059062 dark|0.0048216 gray|0.0048216 dark|0.0048216 grey|0.0048216 ivory|0.0042044  "
		}
	}
}
