{
	"add": {
		"doc": {
			"id": "297362125cf5fa419740e986ecb3d92cb43bcaf2ec3026f0369b7111848edaf4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Iguanodon_NT.jpg/220px-Iguanodon_NT.jpg",
			"previous": [],
				"after": "Iguanodon gives its name to the unranked clade Iguanodontia, a very populous group of ornithopods with many species known from the Middle Jurassic to the Late Cretaceous. Aside from Iguanodon, the best-known members of the clade include Dryosaurus, Camptosaurus, Ouranosaurus, and the duck-bills, or hadrosaurs. In older sources, Iguanodontidae was shown as a distinct family.[7][8] This family traditionally has been something of a wastebasket taxon, including ornithopods that were neither hypsilophodontids or hadrosaurids. In practice, animals like Callovosaurus, Camptosaurus, Craspedodon, Kangnasaurus, Mochlodon, Muttaburrasaurus, Ouranosaurus, and Probactrosaurus were usually assigned to this family.[8] With the advent of cladistic analyses, Iguanodontidae as traditionally construed was shown to be paraphyletic, and these animals are recognised to fall at different points in relation to hadrosaurs on a cladogram, instead of in a single distinct clade.[2][9] Essentially, the modern concept of Iguanodontidae currently includes only Iguanodon. Groups like Iguanodontoidea are still used as unranked clades in the scientific literature, though many traditional iguanodontids are now included in the superfamily Hadrosauroidea. Iguanodon lies between Camptosaurus and Ouranosaurus in cladograms, and is probably descended from a camptosaur-like animal.[2] At one point, Jack Horner suggested, based mostly on skull features, that hadrosaurids actually formed two more distantly related groups, with Iguanodon on the line to the flat-headed hadrosaurines, and Ouranosaurus on the line to the crested lambeosaurines,[10] but his proposal has been rejected.[2][9]",
			"color": "black|0.26267 gray|0.14202 grey|0.14202 dark|0.13735 gray|0.13735 dark|0.13735 grey|0.13735 dim|0.13427 gray|0.13427 dim|0.13427 grey|0.13427 silver|0.092747 light|0.064753 gray|0.064753 light|0.064753 grey|0.064753 dark|0.051726 olive|0.051726 green|0.051726 gainsboro|0.046327  "
		}
	}
}
