{
	"add": {
		"doc": {
			"id": "29a4a17560718745594de044c08a6cb10b33de2dab11df6a1b9914408522fe5f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Suillus_pungens_123004.jpg/100px-Suillus_pungens_123004.jpg",
			"previous": [],
				"after": "Suillus pungens, commonly known as the pungent slippery Jack, is a species of fungus with a slimy convex cap up to 14 cm (5.5 in) wide. The young cap is typically whitish, later becoming grayish-olive to reddish-brown or a mottled combination of these colors. The mushroom has a dotted stem up to 7 cm (2.8 in) long and 2 cm (0.8 in) thick. On the underside of the cap is the spore-bearing tissue with angular, yellowish pores; milky droplets on the pore surface of young individuals, especially in humid environments, are a characteristic feature of this species. The mushroom is considered edible, but not highly regarded. The fungus—limited in distribution to California—fruits almost exclusively with Monterey and bishop pine, two trees with small and scattered natural ranges concentrated in the West Coast of the United States. Several studies have investigated the role of S. pungens in the coastal Californian forest ecosystem it occupies. Although the species produces more mushrooms (mostly through efficient transfer of nutrients from its host) than similar competing fungi in the same location, it is not a dominant root colonizer, and occupies only a small percentage of root tips. (Full article...)",
			"color": "tan|0.15972 light|0.096189 gray|0.096189 light|0.096189 grey|0.096189 silver|0.084245 gainsboro|0.074527 dark|0.055356 gray|0.055356 dark|0.055356 grey|0.055356 black|0.049032 burly|0.045015 wood|0.045015 wheat|0.044589 antique|0.037877 white|0.037877 linen|0.035022 white|0.026891 smoke|0.026891 sea|0.025983 shell|0.025983 old|0.021317 lace|0.021317 floral|0.020279 white|0.020279 snow|0.01865 blanched|0.015013 almond|0.015013 papaya|0.014941 whip|0.014941 white|0.014402 mint|0.013234 cream|0.013234 beige|0.013169 bisque|0.01245 gray|0.012354 grey|0.012354 ghost|0.011992 white|0.011992 ivory|0.011351 lavender|0.011225 blush|0.011225 moccasin|0.009261 alice|0.0092188 blue|0.0092188  "
		}
	}
}
