{
	"add": {
		"doc": {
			"id": "29abf64880818d3f54dd9919df1c3c8261862d6251ce06b07b7234ee34825a27",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Terminal_A_Warsaw_Chopin_Airport.JPG/220px-Terminal_A_Warsaw_Chopin_Airport.JPG",
				"previous": "It was only in 1990, after the fall of communism, that a new terminal started to be built at Okęcie. The main contractor was the German company Hochtief, and the work involved some 164 subcontractors, of which 121 were Polish companies. After 24 months, the new terminal was completed at the expense of some 300 million German marks. A network of multi-storey car parks and access roads was also built, and with their completion, Warsaw gained a modern terminal with a capacity of 3.5 million passengers a year. The terminal began to operate on 1 July 1992, with the first travellers to use it being those returning from Athens, Bangkok, Dubai and New York. Ten days later, the airport celebrated the first passengers departing from the new Warsaw Okęcie. In the departure hall at that time, there were 26 check-in desks; however, in subsequent years of operation, passenger traffic grew rapidly. In 1993, the airport handled nearly 2.2 million passengers, while six years later, this figure climbed to 4 million. Eventually, the decision was taken to increase the number of available check-in desks to 33, and then to 46, consequently increasing the terminal's capacity to 6 million passengers a year.",
				"after": "In March 2001, Warsaw Airport, in the presence of president Aleksander Kwaśniewski was renamed in honour of the renowned Polish pianist and composer Frédéric Chopin (though this name is almost never used by residents of Warsaw, and most frequent visitors know the airport simply as Okęcie). A year later, a tender for the construction of a new passenger terminal at Warsaw airport was announced, this was then won by the Polish-Spanish consortium of Ferrovial Agromán, Budimex and Estudio Lamela, who joined in 2004 to implement the largest Polish investment in civil aviation history, Chopin Airport's long-awaited 'Terminal 2'. By 2006, the arrivals level of this new terminal had been inaugurated, with the departures level finally, after a long delay due to certification issues, being opened in late 2007. In this same year, the low-cost Etiuda terminal was also opened; this, however, was closed again just two years later in 2009, with all operations being transferred to terminals 1 and 2. The final and most recent developments in the airport's history came in the period covering 2010–2011, when the airport's new central and south piers were finished (left unfinished until the possibility of connecting them with the north pier appeared) and opened along with a redesigned terminal complex which saw the airport's two terminals merged to form a single 'Terminal A' complex. Despite this, work continues on reconstructing taxiways, ramps and access roads, the most important projects of which will see the airport connected to Poland's expressway network via the S79 Airport Expressway and S2 Southern Warsaw Bypass.[10] An underground railway station connected to Warsaw's suburban rail system was opened in June 2012 in time for the UEFA Euro 2012 football championships.",
			"color": "dark|0.26562 gray|0.26562 dark|0.26562 grey|0.26562 gray|0.19097 grey|0.19097 silver|0.12462 dim|0.090205 gray|0.090205 dim|0.090205 grey|0.090205 light|0.061137 gray|0.061137 light|0.061137 grey|0.061137 black|0.048446 light|0.026153 slate|0.026153 gray|0.026153 gainsboro|0.023634 slate|0.019133 gray|0.019133 sienna|0.014899 tan|0.012799 rosy|0.0092986 brown|0.0092986 light|0.0089904 steel|0.0089904 blue|0.0089904 pale|0.0083571 golden|0.0083571 rod|0.0083571 burly|0.0054993 wood|0.0054993 dark|0.0048446 khaki|0.0048446  "
		}
	}
}
