{
	"add": {
		"doc": {
			"id": "29b372f59b4774abb5e4abf42b810035579bd0686e3e1c68788b10d0bc720498",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/2007_Arctic_Sea_Ice.jpg/220px-2007_Arctic_Sea_Ice.jpg",
				"previous": "There have been many proposals to preserve the Arctic over the years. Most recently a group of stars at the Rio Earth Summit, on June 21, 2012, proposed protecting the Arctic, similar to the Antarctic protection. The initial focus of the campaign will be a UN resolution creating a global sanctuary around the pole, and a ban on oil drilling and unsustainable fishing in the Arctic.[27]",
				"after": "The Arctic is especially vulnerable to the effects of any climate change, as has become apparent with the reduction of sea ice in recent years. Climate models predict much greater warming in the Arctic than the global average,[30] resulting in significant international attention to the region. In particular, there are concerns that Arctic shrinkage, a consequence of melting glaciers and other ice in Greenland, could soon contribute to a substantial rise in sea levels worldwide.[31] The climate models on which the IPCC report Nr.4 is based give a range of predictions of Arctic sea ice loss, showing near-complete to complete loss in September anywhere from 2040 to some time well beyond 2100. About half of the analyzed models show near-complete to complete sea ice loss in September by the year 2100.[3] More recently, the Catlin Arctic Survey concluded that summer ice loss would occur around 2029.[32][33] It has been apparent though since 2007, that those models grossly underestimate sea ice loss.[34]",
			"color": "gray|0.077948 grey|0.077948 white|0.064291 smoke|0.064291 alice|0.063374 blue|0.063374 ghost|0.062148 white|0.062148 white|0.060626 snow|0.060344 azure|0.059893 mint|0.059488 cream|0.059488 midnight|0.052062 blue|0.052062 sea|0.051917 shell|0.051917 floral|0.050332 white|0.050332 lavender|0.048859 blush|0.048859 dim|0.040558 gray|0.040558 dim|0.040558 grey|0.040558 dark|0.027642 gray|0.027642 dark|0.027642 grey|0.027642 gainsboro|0.020168 light|0.018571 gray|0.018571 light|0.018571 grey|0.018571 silver|0.018099 lavender|0.017881 dark|0.01392 slate|0.01392 gray|0.01392 slate|0.013434 gray|0.013434 light|0.01022 slate|0.01022 gray|0.01022 ivory|0.0094827 light|0.0089494 cyan|0.0089494 olive|0.0077051 drab|0.0077051 dark|0.007322 olive|0.007322 green|0.007322 linen|0.0067874 light|0.0065947 blue|0.0065947 light|0.0060591 steel|0.0060591 blue|0.0060591  "
		}
	}
}
