{
	"add": {
		"doc": {
			"id": "29c8847763b2e1fe4a590d45d89f6c69b7e57c9f12e800104f3e56a26e5ca3b2",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/92/Late_50s_Aggie_Bonfire.jpg/220px-Late_50s_Aggie_Bonfire.jpg",
				"previous": "During the 1940s, the school paper described Bonfire as \"'the greatest event of the football season'\".[3] The 1947 Corps handbook stated that \"bonfire symbolizes two things: a burning desire to beat the team from the University of Texas, and the undying flame of love that every loyal Aggie carries in his heart for the school;\" this was often shortened to \"the burning desire to beat the hell out of t.u.\"[3][2] The Bonfire design changed in 1942. Universal Studios, filming the movie We've Never Been Licked on the Texas A&M Campus, built a bonfire as a prop for the movie. Their structure used a design similar to a teepee, where all the logs rested against each other in a conical shape.[3] The logs were placed at an angle between 23 and 30 degrees, giving it \"a tremendous vertical and horizontal resistance\".[7] This allowed Bonfire to grow from 25 feet (8 m) tall to over 50 feet (20 m) tall.[6] Subsequent Aggies adopted the new idea, and the teepee design became standard for Bonfires for the next twenty-five years.[3]",
				"after": "Beginning in 1952, the bonfires were constructed entirely from fresh-cut logs.[3] The event suffered its first fatality in 1955, when a student was struck by a swerving car.[5] The same year (for unrelated reasons), Bonfire was moved from Simpson Drill Field in front of the Memorial Student Center to Duncan Field, near the dorms of the Corps of Cadets (whose leaders oversaw construction). In 1957, the structure collapsed two days before Bonfire was to be held, but students worked around-the-clock to rebuild it, and the bonfire burned as scheduled.[8]",
			"color": "saddle|0.23273 brown|0.23273 dark|0.22257 khaki|0.22257 sienna|0.20656 tan|0.11386 black|0.071569 peru|0.025158 dark|0.023529 gray|0.023529 dark|0.023529 grey|0.023529 rosy|0.020685 brown|0.020685 silver|0.020124 burly|0.01775 wood|0.01775  "
		}
	}
}
