{
	"add": {
		"doc": {
			"id": "29c9cb987b731f65cec655041fbecf8b89d33d917b90ef5c31579eef6ef812ae",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Room_49_British_Museum.jpg/220px-Room_49_British_Museum.jpg",
				"previous": "There are groups of drawings by Leonardo da Vinci, Raphael, Michelangelo, (including his only surviving full-scale cartoon), Dürer (a collection of 138 drawings is one of the finest in existence), Peter Paul Rubens, Rembrandt, Claude and Watteau, and largely complete collections of the works of all the great printmakers including Dürer (99 engravings, 6 etchings and most of his 346 woodcuts), Rembrandt and Goya. More than 30,000 British drawings and watercolours include important examples of work by Hogarth, Sandby, Turner, Girtin, Constable, Cotman, Cox, Gillray, Rowlandson and Cruikshank, as well as all the great Victorians. There are about a million British prints including more than 20,000 satires and outstanding collections of works by William Blake and Thomas Bewick.[citation needed]. The great eleven volume Catalogue of Political and Personal Satires Preserved in the Department of Prints and Drawings in the British Museum compiled between 1870 and 1954 is the definitive reference work for the study of British Satirical prints. Over 500,000 objects from the department are now on the online collection database, many with high quality images.[66] A 2011 donation of £1 million enabled the museum to acquire a complete set of Pablo Picasso's Vollard Suite.[67]",
				"after": "The Department of Prehistory and Europe was established in 1969 and is responsible for collections that cover a vast expanse of time and geography. It includes some of the earliest objects made by humans in east Africa over 2 million years ago, as well as Prehistoric and neolithic objects from other parts of the world; and the art and archaeology of Europe from the earliest times to the present day. Archeological excavation of prehistoric material took off and expanded considerably in the twentieth century and the department now has literally millions of objects from the Paleolithic and Mesolithic periods throughout the world, as well as from the Neolithic, Bronze Age and Iron age in Europe. Stone Age material from Africa has been donated by famous archaeologists such as Louis and Mary Leakey, and Gertrude Caton–Thompson. Paleolithic objects from the Sturge, Christy and Lartet collections include some of the earliest works of art from Europe. Many Bronze Age objects from across Europe were added during the nineteenth century, often from large collections built up by excavators and scholars such as Greenwell in Britain, Tobin and Cooke in Ireland, Lukis and de la Grancière in Brittany, Worsaae in Denmark, Siret at El Argar in Spain, and Klemm and Edelmann in Germany. A representative selection of Iron Age artefacts from Hallstatt were acquired as a result of the Evans/Lubbock excavations and from Giubiasco in Ticino through the Swiss National Museum.",
			"color": "gray|0.12296 grey|0.12296 dim|0.10334 gray|0.10334 dim|0.10334 grey|0.10334 dark|0.099436 gray|0.099436 dark|0.099436 grey|0.099436 tan|0.048763 floral|0.041504 white|0.041504 silver|0.040779 sea|0.040537 shell|0.040537 white|0.036007 smoke|0.036007 mint|0.03532 cream|0.03532 snow|0.034516 white|0.033219 black|0.032644 linen|0.028738 ivory|0.028483 ghost|0.024711 white|0.024711 azure|0.024274 light|0.022499 gray|0.022499 light|0.022499 grey|0.022499 old|0.022079 lace|0.022079 alice|0.019546 blue|0.019546 antique|0.016425 white|0.016425 gainsboro|0.016085 wheat|0.01391 beige|0.013478 lavender|0.012342 blush|0.012342 corn|0.011135 silk|0.011135 honeydew|0.010607 papaya|0.0096933 whip|0.0096933 light|0.0085522 yellow|0.0085522 pale|0.0075672 golden|0.0075672 rod|0.0075672 blanched|0.0070527 almond|0.0070527  "
		}
	}
}
