{
	"add": {
		"doc": {
			"id": "2a3f96e680ed91ce8d0ec6dd6552f90acc027715e12628807cdc94944ddc8e37",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Historic_Dovecote_at_Walkden_Gardens%2C_Sale%2C_Cheshire_-_geograph.org.uk_-_526310.jpg/220px-Historic_Dovecote_at_Walkden_Gardens%2C_Sale%2C_Cheshire_-_geograph.org.uk_-_526310.jpg",
				"previous": "Some local field and road names,[5] and the name of Sale itself, are Anglo-Saxon in origin, which indicates the town was founded in the 7th or 8th centuries. The Old English salh, from which \"Sale\" is derived, means \"at the sallow tree\",[6] and Ashton upon Mersey means \"village or farm near the ash trees\".[7] Although the townships of Sale and Ashton upon Mersey were not mentioned in the Domesday Book of 1086, that may be because only a partial survey was taken.[8] The first recorded occurrences of Sale and Ashton upon Mersey are in 1199–1216 and 1260 respectively.[9] The settlements were referred to as townships rather than manors, which suggests further evidence of Anglo-Saxon origins as townships were developed by the Saxons.[10]",
				"after": "The manor of Sale was one of 30 held by William FitzNigel, a powerful 12th-century baron in north Cheshire. He divided it between Thomas de Sale and Adam de Carrington, who acted as Lords of the Manor on FitzNigel's behalf.[11] On de Sale's death, his land passed to his son-in-law, John Holt; de Carrington's land passed into the ownership of Richard de Massey, a member of the Masseys who were Barons of Dunham. Sale descended through the Holt and Massey families until the 17th century, when their respective lands were sold.[11] Sale Old Hall was built in about 1603 for James Massey, probably to replace a medieval manor house, and was one of the first buildings in northwest England to be made of brick.[12][13] It was rebuilt in 1840 and demolished in 1920, but two buildings in its grounds have survived: its dovecote, now in Walkden Gardens, and its lodge, the latter now occupied by Sale Golf Club.[12]",
			"color": "black|0.55107 peach|0.062099 puff|0.062099 dark|0.04384 gray|0.04384 dark|0.04384 grey|0.04384 gray|0.039496 grey|0.039496 dark|0.037418 olive|0.037418 green|0.037418 dim|0.030868 gray|0.030868 dim|0.030868 grey|0.030868 antique|0.027564 white|0.027564 dark|0.027265 salmon|0.027265 bisque|0.026428 misty|0.025522 rose|0.025522 dark|0.018795 slate|0.018795 gray|0.018795 tan|0.018312 rosy|0.014659 brown|0.014659 blanched|0.011468 almond|0.011468 silver|0.010667 papaya|0.0095817 whip|0.0095817 linen|0.0087781  "
		}
	}
}
