{
	"add": {
		"doc": {
			"id": "2a8c9fa615a6c2afb18feda1592990a686294991e26773c504bf4e6942b2fa22",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Morelasci.jpg/220px-Morelasci.jpg",
				"previous": "Most fungi have both a haploid and a diploid stage in their life cycles. In sexually reproducing fungi, compatible individuals may combine by fusing their hyphae together into an interconnected network; this process, anastomosis, is required for the initiation of the sexual cycle. Ascomycetes and basidiomycetes go through a dikaryotic stage, in which the nuclei inherited from the two parents do not combine immediately after cell fusion, but remain separate in the hyphal cells (see heterokaryosis).[83]",
				"after": "In ascomycetes, dikaryotic hyphae of the hymenium (the spore-bearing tissue layer) form a characteristic hook at the hyphal septum. During cell division, formation of the hook ensures proper distribution of the newly divided nuclei into the apical and basal hyphal compartments. An ascus (plural asci) is then formed, in which karyogamy (nuclear fusion) occurs. Asci are embedded in an ascocarp, or fruiting body. Karyogamy in the asci is followed immediately by meiosis and the production of ascospores. After dispersal, the ascospores may germinate and form a new haploid mycelium.[84]",
			"color": "dark|0.10784 gray|0.10784 dark|0.10784 grey|0.10784 dark|0.10294 khaki|0.10294 silver|0.090686 tan|0.073529 pale|0.069853 golden|0.069853 rod|0.069853 light|0.053922 gray|0.053922 light|0.053922 grey|0.053922 antique|0.052591 white|0.052591 dim|0.051471 gray|0.051471 dim|0.051471 grey|0.051471 wheat|0.045133 gray|0.044118 grey|0.044118 gainsboro|0.041667 beige|0.035469 blanched|0.031898 almond|0.031898 khaki|0.029412 bisque|0.027959 papaya|0.027381 whip|0.027381 lemon|0.023442 chiffon|0.023442 light|0.020378 golden|0.020378 rod|0.020378 yellow|0.020378 rosy|0.014706 brown|0.014706 corn|0.01292 silk|0.01292 moccasin|0.012255 light|0.0087185 yellow|0.0087185  "
		}
	}
}
