{
	"add": {
		"doc": {
			"id": "33f84ac3a3701251678542951402e4000a7cea5da88db34bff710b073d23dfac",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Mirage_2000C_in-flight_2_%28cropped%29.jpg/220px-Mirage_2000C_in-flight_2_%28cropped%29.jpg",
				"previous": "Unlike interceptors of the previous eras, most fourth-generation air-superiority fighters were designed to be agile dogfighters (although the Mikoyan MiG-31 and Panavia Tornado ADV are notable exceptions). The continually rising cost of fighters, however, continued to emphasize the value of multirole fighters. The need for both types of fighters led to the \"high/low mix\" concept, which envisioned a high-capability and high-cost core of dedicated air-superiority fighters (like the F-15 and Su-27) supplemented by a larger contingent of lower-cost multi-role fighters (such as the F-16 and MiG-29).",
				"after": "Most fourth-generation fighters, such as the McDonnell Douglas F/A-18 Hornet and Dassault Mirage 2000, are true multirole warplanes, designed as such from the start. This was facilitated by multimode avionics that could switch seamlessly between air and ground modes. The earlier approaches of adding on strike capabilities or designing separate models specialized for different roles generally became passé (with the Panavia Tornado being an exception in this regard). Attack roles were generally assigned to dedicated ground-attack aircraft such as the Sukhoi Su-25 and the A-10 Thunderbolt II.",
			"color": "slate|0.35883 gray|0.35883 light|0.29323 slate|0.29323 gray|0.29323 gray|0.08634 grey|0.08634 dim|0.076242 gray|0.076242 dim|0.076242 grey|0.076242 dark|0.026149 gray|0.026149 dark|0.026149 grey|0.026149 silver|0.020626 light|0.018255 gray|0.018255 light|0.018255 grey|0.018255 black|0.014972 gainsboro|0.014744 white|0.008604 smoke|0.008604 snow|0.007036 ghost|0.0069926 white|0.0069926 sea|0.0068985 shell|0.0068985 white|0.0063893 light|0.0062564 steel|0.0062564 blue|0.0062564 lavender|0.0061805 blush|0.0061805 alice|0.0059393 blue|0.0059393 floral|0.0059277 white|0.0059277 linen|0.0051597 mint|0.0051171 cream|0.0051171 lavender|0.0039083 light|0.0035473 blue|0.0035473 azure|0.0030591 dark|0.0027972 slate|0.0027972 gray|0.0027972  "
		}
	}
}
