{
	"add": {
		"doc": {
			"id": "3438f0e11037ff4632fb3cd4f78d2f43262f3b015af5f005cd8e8d751b5d928a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Flag_of_East_Timor.svg/23px-Flag_of_East_Timor.svg.png",
			"previous": [
				"Heading roughly clockwise, the states and territories (in italics) with a coastline on the Indian Ocean (including the Red Sea and Persian Gulf) are:",
				"The Indian Ocean is known as Ratnakara in the ancient Sanskrit literature. Ratnakara means \"the mine of gems\". It is also called Hind Mahasagar in Hindi and other Indian languages."
			],
				"after": "The Port of Singapore is the busiest port in the Indian Ocean, located in the Strait of Malacca where it meets the Pacific. Mumbai Port is the chief trading port in India on the coast of the Indian Ocean, often known as \"The Gateway of India\". Chennai Port is the second largest port in India and the busiest on the east coast. Mormugao Port, Mundra, Panambur, Hazira, Kochi, Kolkata, Port Blair, Alang, Visakhapatnam, Paradip, Ennore, Tuticorin and Nagapattinam are the other major ports in India. South Asian ports include Chittagong in Bangladesh, Colombo, Hambantota and Galle in Sri Lanka, and ports of Karachi, Sindh province and Gwadar, Balochistan province in Pakistan. Aden is a major port in Yemen and controls ships entering the Red Sea. Major African ports on the shores of the Indian Ocean include: Mombasa (Kenya), Dar es Salaam, Zanzibar (Tanzania), Durban, East London, Richard's Bay (South Africa), Beira (Mozambique), and Port Louis (Mauritius). Zanzibar is especially famous for its spice export. Other major ports in the Indian Ocean include Muscat (Oman), Yangon (Burma), Jakarta, Medan (Indonesia), Fremantle (port servicing Perth, Australia) and Dubai (UAE).",
			"color": "orange|0.17882 golden|0.13719 rod|0.13719 dim|0.12455 gray|0.12455 dim|0.12455 grey|0.12455 gray|0.097625 grey|0.097625 dark|0.081676 gray|0.081676 dark|0.081676 grey|0.081676 gold|0.068075 silver|0.048835  "
		}
	}
}
