{
	"add": {
		"doc": {
			"id": "3438a3cb2db1ec2e6eb74e41bf2b6e54dc93fc8787b28792ae5f0a7719a165ae",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Burial_Site_3.jpg/220px-Burial_Site_3.jpg",
				"previous": "The ceremony is often held weeks, months, or years after the death so that the deceased's family can raise the significant funds needed to cover funeral expenses.[26] Torajans traditionally believe that death is not a sudden, abrupt event, but a gradual process toward Puya (the land of souls, or afterlife). During the waiting period, the body of the deceased is wrapped in several layers of cloth and kept under the tongkonan. The soul of the deceased is thought to linger around the village until the funeral ceremony is completed, after which it begins its journey to Puya.[27]",
				"after": "Another component of the ritual is the slaughter of water buffalo. The more powerful the person who died, the more buffalo are slaughtered at the death feast. Buffalo carcasses, including their heads, are usually lined up on a field waiting for their owner, who is in the \"sleeping stage\". Torajans believe that the deceased will need the buffalo to make the journey and that they will be quicker to arrive at Puya if they have many buffalo. Slaughtering tens of water buffalo and hundreds of pigs using a machete is the climax of the elaborate death feast, with dancing and music and young boys who catch spurting blood in long bamboo tubes. Some of the slaughtered animals are given by guests as \"gifts\", which are carefully noted because they will be considered debts of the deceased's family.[28] However, a cockfight, known as bulangan londong, is an integral part of the ceremony. As with the sacrifice of the buffalo and the pigs, the cockfight is considered sacred because it involves the spilling of blood on the earth. In particular, the tradition requires the sacrifice of at least three chickens. However, it is common for at least 25 pairs of chickens to be set against each other in the context of the ceremony.[29]",
			"color": "black|0.37123 dim|0.18175 gray|0.18175 dim|0.18175 grey|0.18175 gray|0.096462 grey|0.096462 dark|0.091945 gray|0.091945 dark|0.091945 grey|0.091945 silver|0.086798 light|0.046246 gray|0.046246 light|0.046246 grey|0.046246 thistle|0.037973 gainsboro|0.027636 rosy|0.013687 brown|0.013687 slate|0.012137 gray|0.012137 light|0.010183 slate|0.010183 gray|0.010183  "
		}
	}
}
