{
	"add": {
		"doc": {
			"id": "344c5ac2cd5768b79ee701b22f05d56479c0f83762158b59b950a36b5ab1daf4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Lettuce_mix.jpg/220px-Lettuce_mix.jpg",
				"previous": "Lettuce varieties will cross with each other, making spacing of 5 to 20 feet (1.5 to 6.1 m) between varieties necessary to prevent contamination when saving seeds. Lettuce will also cross with Lactuca serriola (wild lettuce), with the resulting seeds often producing a plant with tough, bitter leaves. Celtuce, a lettuce variety grown primarily in Asia for its stems, crosses easily with lettuces grown for their leaves.[17] This propensity for crossing, however, has led to breeding programs using closely related species in Lactuca, such as L. serriola, L. saligna, and L. virosa, to broaden the available gene pool. Starting in the 1990s, such programs began to include more distantly related species such as L. tatarica.[32] Seeds keep best when stored in cool conditions, and, unless stored cryogenically, remain viable the longest when stored at −4 °F (−20 °C); they are relatively short lived in storage.[1] At room temperature, lettuce seeds remain viable for only a few months. However, when newly harvested lettuce seed is stored cryogenically, this life increases to a half-life of 500 years for vaporized nitrogen and 3,400 years for liquid nitrogen; this advantage is lost if seeds are not frozen promptly after harvesting.[33]",
				"after": "There are several types of lettuce, but three (leaf, head and cos or romaine) are the most common.[30] There are seven main cultivar groups of lettuce, each including many varieties:",
			"color": "khaki|0.22933 dark|0.15422 khaki|0.15422 pale|0.15299 golden|0.15299 rod|0.15299 olive|0.10249 drab|0.10249 dark|0.073665 olive|0.073665 green|0.073665 black|0.042677 yellow|0.035931 green|0.035931 lemon|0.024946 chiffon|0.024946 light|0.018543 golden|0.018543 rod|0.018543 yellow|0.018543 dark|0.0095899 gray|0.0095899 dark|0.0095899 grey|0.0095899 light|0.0088028 yellow|0.0088028 wheat|0.0081887 silver|0.0081049 moccasin|0.007815 corn|0.0075129 silk|0.0075129  "
		}
	}
}
