{
	"add": {
		"doc": {
			"id": "344e34fd80916b77aed6c453546bc48564a3c1603b36a27adbd67a4750232cc4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Mosque.jpg/200px-Mosque.jpg",
			"previous": [],
			"after": [
				"",
				"Islam (Arabic: الإسلام‎ al-’islām, pronounced [ʔislæːm] ( listen) is the religion articulated by the Qur’an, a book considered by its adherents to be the verbatim word of the single incomparable God (Arabic: الله‎, Allāh), and by the Islamic prophet Muhammad's demonstrations and real-life examples (called the Sunnah, collected through narration of his companions in collections of Hadith). The word Islam, a triliteral of the word salaam, is a homograph, having multiple meanings, including peace and surrender (to God). Adherents are known as Muslims, which is the active participle of the verb of which Islām is the infinitive. Muslims regard their religion as the completed and universal version of a monotheistic faith revealed at many times and places before, including, notably, to the prophets Abraham, Moses and Jesus. Islamic tradition holds that previous messages and revelations have been changed and distorted over time. Religious practices include the Five Pillars of Islam, which are five duties that unite Muslims into a community. Islamic law (Arabic: شريعة Šarīʿah) touches on virtually every aspect of life and society, encompassing everything from dietary laws and banking to warfare, welfare, and Jihad. Almost all Muslims belong to one of two major denominations, the Sunni (87-90%) and Shi'a (10-13%). Islam is the predominant religion in much of Africa, the Middle East and major parts of Asia. Large communities are also found in China, Russia and the Caribbean. Converts and immigrant communities are found in almost every part of the world. With 1.57 billion Muslims (see Islam by country), Islam is the second-largest religion in the world and arguably the fastest growing religion in the world."
			],
			"color": "black|0.27645 rosy|0.19031 brown|0.19031 tan|0.11243 dim|0.088217 gray|0.088217 dim|0.088217 grey|0.088217 gray|0.057187 grey|0.057187 dark|0.056548 gray|0.056548 dark|0.056548 grey|0.056548 brown|0.054954 silver|0.033814 firebrick|0.027058 indian|0.017414 red|0.017414 light|0.015603 gray|0.015603 light|0.015603 grey|0.015603  "
		}
	}
}
