{
	"add": {
		"doc": {
			"id": "345c0f3d770014b61f21a34077d4a9c7dfd9137b420ad3984457ffb196519de0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Gladys_Bentley.jpg",
				"previous": "Newspaper stories frankly divulged that the book's content includes \"sexual relations between Lesbian women\", and photographs of Hall often accompanied details about lesbians in most major print outlets within a span of six months.[69] Hall reflected the appearance of a \"mannish\" woman in the 1920s: short cropped hair, tailored suits (often with pants), and monocle that became widely recognized as a \"uniform\". When British women participated in World War I, they became familiar with masculine clothing, and were considered patriotic for wearing uniforms and pants. However, postwar masculinization of women's clothing became associated with lesbians.[70]",
				"after": "In the United States, the 1920s was a decade of social experimentation, particularly with sex. This was heavily influenced by the writings of Sigmund Freud, who theorized that sexual desire would be sated unconsciously, despite an individual's wish to ignore it. Freud's theories were much more pervasive in the U.S. than in Europe. With the well-publicized notion that sexual acts were a part of lesbianism and their relationships, sexual experimentation was widespread. Large cities that provided a nightlife were immensely popular, and women began to seek out sexual adventure. Bisexuality became chic, particularly in America's first gay neighborhoods.[71]",
			"color": "dark|0.19854 gray|0.19854 dark|0.19854 grey|0.19854 gray|0.18626 grey|0.18626 dim|0.16076 gray|0.16076 dim|0.16076 grey|0.16076 silver|0.12535 light|0.083402 gray|0.083402 light|0.083402 grey|0.083402 black|0.07932 gainsboro|0.059228 lavender|0.017538 blush|0.017538 white|0.012934 smoke|0.012934 misty|0.010723 rose|0.010723 ghost|0.0099128 white|0.0099128 sea|0.0097104 shell|0.0097104 snow|0.0097104 alice|0.0090809 blue|0.0090809 linen|0.0076937 white|0.0073654 floral|0.0053824 white|0.0053824 mint|0.0043909 cream|0.0043909  "
		}
	}
}
