{
	"add": {
		"doc": {
			"id": "34615f995ea2419ae78d5ecc54556c5d5efefbf489156eb86cbc77d67a22a8de",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Macaw_in_Jamaica.jpg/220px-Macaw_in_Jamaica.jpg",
				"previous": "As many as 13 now-extinct species of macaw have variously been suggested to have lived on the Caribbean islands, but many of these were based on old descriptions or drawings and only represent hypothetical species. Only two endemic Caribbean macaw species are known from physical remains: the Cuban macaw and the Saint Croix macaw (Ara autochthones), which is known only from subfossils.[9] Macaws are known to have been transported between the Caribbean islands and from mainland South America to the Caribbean both in historic times by Europeans and natives, and in prehistoric times by Paleoamericans. Historical records of macaws on these islands, therefore, may not have represented distinct, endemic species; it is also possible that they were escaped or feral foreign macaws that had been transported to the islands.[9] All the endemic Caribbean macaws were likely driven to extinction by humans in historic and prehistoric times.[8] The identity of these macaws is only likely to be further resolved through fossil finds and examination of contemporary reports and artwork.[2]",
				"after": "The Jamaican red macaw (Ara gossei) was named by Walter Rothschild in 1905 on the basis of a description of a specimen shot in 1765. It was described as being similar to the Cuban macaw, mainly differing in having a yellow forehead. Some researchers believe the specimen described may have been a feral Cuban macaw.[2] A stylised 1765 painting of a macaw by Lt. L. J. Robins, published in a volume called The Natural History of Jamaica, matches the Cuban macaw, and may show a specimen that had been imported there; however, it has also been claimed that the painting shows the Jamaican red macaw.[9][10]",
			"color": "chocolate|0.29349 golden|0.080001 rod|0.080001 steel|0.075444 blue|0.075444 light|0.061833 steel|0.061833 blue|0.061833 peru|0.046071 wheat|0.033953 dark|0.030736 khaki|0.030736 light|0.029273 slate|0.029273 gray|0.029273 light|0.025403 sky|0.025403 blue|0.025403 burly|0.018088 wood|0.018088 dark|0.017131 golden|0.017131 rod|0.017131 sky|0.016233 blue|0.016233 slate|0.015784 gray|0.015784 light|0.015316 blue|0.015316 tan|0.013971 dark|0.013533 gray|0.013533 dark|0.013533 grey|0.013533 antique|0.012348 white|0.012348 beige|0.011791 blanched|0.011725 almond|0.011725 silver|0.011399 papaya|0.010583 whip|0.010583 dim|0.010489 gray|0.010489 dim|0.010489 grey|0.010489 pale|0.0081216 golden|0.0081216 rod|0.0081216 corn|0.008076 silk|0.008076 light|0.0076442 gray|0.0076442 light|0.0076442 grey|0.0076442 gray|0.0073238 grey|0.0073238 old|0.0072589 lace|0.0072589 gold|0.0072517 sienna|0.0069689 saddle|0.0069024 brown|0.0069024 bisque|0.0067139 linen|0.0060498  "
		}
	}
}
