{
	"add": {
		"doc": {
			"id": "34645f8e7717b3e08dc29cf38c62fe44567cb3635425e8cd570e068103696181",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/dd/MLHome.jpg/220px-MLHome.jpg",
				"previous": "Manitoba's culture has been influenced by both traditional (Aboriginal and Métis) and modern Canadian artistic values, as well as by the cultures of its immigrant populations and American neighbours. The Minister of Culture, Heritage, Tourism and Sport is responsible for promoting and, to some extent, financing Manitoban culture.[117] Manitoba is the birthplace of the Red River Jig, a combination of aboriginal pow-wows and European reels that was popular among early settlers.[118] Manitoba's traditional music has strong roots in Métis and Aboriginal culture, in particular the old-time fiddling of the Métis.[119] Manitoba's cultural scene also incorporates classical European traditions. The Royal Winnipeg Ballet (RWB), based in Winnipeg, is Canada's oldest ballet and the longest continuously operating ballet company in North America; it was granted its royal title in 1953 under Queen Elizabeth II.[120] The Winnipeg Symphony Orchestra (WSO) performs classical music and new compositions at the Centennial Concert Hall.[121] Manitoba Opera, founded in 1969, also performs out of the Centennial Concert Hall.",
				"after": "Le Cercle Molière (founded 1925) is the oldest French-language theatre in Canada,[122] and Manitoba Theatre Centre (founded 1958) is Canada's oldest English-language regional theatre.[123] Manitoba Theatre for Young People was the first English-language theatre to win the Canadian Institute of the Arts for Young Audiences Award, and offers plays for children and teenagers as well as a theatre school.[124] The Winnipeg Art Gallery (WAG), Manitoba's largest art gallery and the sixth largest in the country, hosts an art school for children; the WAG's permanent collection comprises over twenty thousand works, with a particular emphasis on Manitoban and Canadian art.[125][126]",
			"color": "dim|0.2553 gray|0.2553 dim|0.2553 grey|0.2553 gray|0.23761 grey|0.23761 dark|0.17117 olive|0.17117 green|0.17117 dark|0.11001 gray|0.11001 dark|0.11001 grey|0.11001 silver|0.052212 light|0.029942 gray|0.029942 light|0.029942 grey|0.029942 tan|0.02577 gainsboro|0.018494 black|0.016333 slate|0.0073994 gray|0.0073994  "
		}
	}
}
