{
	"add": {
		"doc": {
			"id": "34769bd0c952f8ce1e741244ec6b960a830a091f9186c76ffc3f15a7f28d883d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/C4004_%28Intel%29.jpg/220px-C4004_%28Intel%29.jpg",
				"previous": "The word \"technology\" can also be used to refer to a collection of techniques. In this context, it is the current state of humanity's knowledge of how to combine resources to produce desired products, to solve problems, fulfill needs, or satisfy wants; it includes technical methods, skills, processes, techniques, tools and raw materials. When combined with another term, such as \"medical technology\" or \"space technology\", it refers to the state of the respective field's knowledge and tools. \"State-of-the-art technology\" refers to the high technology available to humanity in any field.",
				"after": "Technology can be viewed as an activity that forms or changes culture.[15] Additionally, technology is the application of math, science, and the arts for the benefit of life as it is known. A modern example is the rise of communication technology, which has lessened barriers to human interaction and, as a result, has helped spawn new subcultures; the rise of cyberculture has, at its basis, the development of the Internet and the computer.[16] Not all technology enhances culture in a creative way; technology can also help facilitate political oppression and war via tools such as guns. As a cultural activity, technology predates both science and engineering, each of which formalize some aspects of technological endeavor.",
			"color": "dim|0.11408 gray|0.11408 dim|0.11408 grey|0.11408 gray|0.078186 grey|0.078186 dark|0.077292 gray|0.077292 dark|0.077292 grey|0.077292 gainsboro|0.073055 light|0.072231 gray|0.072231 light|0.072231 grey|0.072231 linen|0.059285 white|0.045865 smoke|0.045865 sea|0.043449 shell|0.043449 silver|0.042148 old|0.039617 lace|0.039617 antique|0.037854 white|0.037854 floral|0.037133 white|0.037133 snow|0.024568 beige|0.024054 mint|0.023339 cream|0.023339 black|0.02022 tan|0.018844 ivory|0.017038 papaya|0.014829 whip|0.014829 alice|0.01282 blue|0.01282 corn|0.012773 silk|0.012773 white|0.012315 ghost|0.011334 white|0.011334 wheat|0.010921 blanched|0.010657 almond|0.010657 honeydew|0.0097793  "
		}
	}
}
