{
	"add": {
		"doc": {
			"id": "3476469a8378483f5d7cc7b2498b8355a364964d844be3ff3deaee509192fb43",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Saltwater_crocodile_on_a_beach_in_Darwin%2C_NT.jpg/220px-Saltwater_crocodile_on_a_beach_in_Darwin%2C_NT.jpg",
			"previous": [],
				"after": "No living species of crocodilian can be considered truly marine; although the saltwater crocodile and the American crocodile are able to swim out to sea, their normal habitats are river mouths, estuaries, mangrove swamps, and hypersaline lakes, though several extinct species have had marine habits, including the recently gone \"Gavialis\" papuensis, which occurred in a fully marine habitat in the Solomon Islands coastlines.[63] All crocodilians need to maintain the concentration of salt in body fluids at suitable levels. Osmoregulation is related to the quantity of salts and water exchanged with the environment. Intake of water and salts takes place across the lining of the mouth, when water is drunk, incidentally while feeding, and when present in foods.[64] Water is lost from the body during breathing, and both salts and water are lost in the urine and faeces, through the skin, and via salt-excreting glands on the tongue, though these are only present in crocodiles and gharials.[65][66] The skin is a largely effective barrier to both water and ions. Gaping causes water loss by evaporation from the lining of the mouth, and on land, water is also lost through the skin.[65] Large animals are better able to maintain homeostasis at times of osmotic stress than smaller ones.[67] Newly hatched crocodilians are much less tolerant of exposure to salt water than are older juveniles, presumably because they have a higher surface-area-to-volume ratio.[65]",
			"color": "dark|0.57158 gray|0.57158 dark|0.57158 grey|0.57158 gray|0.17864 grey|0.17864 steel|0.083677 blue|0.083677 light|0.044312 slate|0.044312 gray|0.044312 slate|0.035379 gray|0.035379 dark|0.023965 slate|0.023965 gray|0.023965 silver|0.015531 black|0.013522 cadet|0.010347 blue|0.010347 dim|0.0070537 gray|0.0070537 dim|0.0070537 grey|0.0070537 teal|0.0070268  "
		}
	}
}
