{
	"add": {
		"doc": {
			"id": "347d9696857cb7e5796828e23af9cedef7f7f94a169fa9c0aedb366807034c80",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Maslow%27s_Hierarchy_of_Needs.svg/450px-Maslow%27s_Hierarchy_of_Needs.svg.png",
				"previous": "Maslow used Einstein's writings and accomplishments to exemplify the characteristics of the self-actualized person. But Ruth Benedict and Max Wertheimer were also Maslow's models of self-actualization. In this case, from a scientific perspective there are numerous problems with this particular approach. First, it could be argued that biographical analysis as a method is extremely subjective as it is based entirely on the opinion of the researcher. Personal opinion is always prone to bias, which reduces the validity of any data obtained. Therefore Maslow's operational definition of Self-actualization must not be blindly accepted as scientific fact.[36]",
				"after": "Maslow described human needs as ordered in a prepotent hierarchy—a pressing need would need to be mostly satisfied before someone would give their attention to the next highest need. None of his published works included a visual representation of the hierarchy. The pyramidal diagram illustrating the Maslow needs hierarchy may have been created by a psychology textbook publisher as an illustrative device. This now iconic pyramid frequently depicts the spectrum of human needs, both physical and psychological, as accompaniment to articles describing Maslow's needs theory and may give the impression that the Hierarchy of Needs is a fixed and rigid sequence of progression. Yet, starting with the first publication of his theory in 1943, Maslow described human needs as being relatively fluid—with many needs being present in a person simultaneously.[38]",
			"color": "dark|0.31994 cyan|0.31994 blue|0.288 violet|0.288 black|0.085804 light|0.043342 steel|0.043342 blue|0.043342 light|0.038976 sea|0.038976 green|0.038976 golden|0.038756 rod|0.038756 orange|0.027324 light|0.017054 pink|0.017054 light|0.016897 coral|0.016897 teal|0.015704 pink|0.01228 steel|0.011118 blue|0.011118 medium|0.011118 purple|0.011118 dark|0.0099246 violet|0.0099246 powder|0.0067106 blue|0.0067106 lavender|0.0064721  "
		}
	}
}
