{
	"add": {
		"doc": {
			"id": "347f5e85bceadf6f45aea1093060b11910cc55f1f24f890d3e1cb6b3de07451c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/UST_mainjf22.JPG/240px-UST_mainjf22.JPG",
			"previous": [],
				"after": "Austronesian languages have been spoken in the Philippines for thousands of years. According to a recent study by Mark Donohue of the Australian National University and Tim Denham of Monash University, there is no linguistic evidence for an orderly north-to-south dispersal of the Austronesian languages from Taiwan through the Philippines and into Island Southeast Asia (ISEA).[73] Many adopted words from Sanskrit were incorporated during the Indian cultural influence starting from the 5th century BC, in common with its Southeast Asian neighbours. Starting in the second half of the 16th century, Spanish was the official language of the country for the more than three centuries that the islands were governed through Mexico City on behalf of the Spanish Empire. In the 19th and early 20th centuries, Spanish was the preferred language among Ilustrados and educated Filipinos in general. Significant agreements exist, however, on the extent Spanish use beyond that. It has been argued that the Philippines were less hispanized than Canaries and America, with Spanish only being adopted by the ruling class involved in civil and judicial administration and culture. Spanish was the language of only approximately ten percent of the Philippine population when Spanish rule ended in 1898.[81] As a lingua franca or creole language of Filipinos, major languages of the country like Zamboangueño, Cebuano, Tagalog, Kapampangan, Pangasinan, Bicolano, Hiligaynon, and Ilocano assimilated many different words and expressions from Castilian Spanish.",
			"color": "gray|0.45593 grey|0.45593 dim|0.35838 gray|0.35838 dim|0.35838 grey|0.35838 dark|0.082445 gray|0.082445 dark|0.082445 grey|0.082445 black|0.058836 silver|0.01839 slate|0.0067839 gray|0.0067839 light|0.0059122 slate|0.0059122 gray|0.0059122  "
		}
	}
}
