{
	"add": {
		"doc": {
			"id": "3481e0a4ab542d39f61f263c7d8a437da2fab6d5f967bc8f58f2cf0f2fe2ecb2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Bighorn_Sheep_in_Shoshone_National_Forest.jpg/220px-Bighorn_Sheep_in_Shoshone_National_Forest.jpg",
				"previous": "At least 700 grizzly bears are believed to exist in the Greater Yellowstone Ecosystem, which includes Shoshone National Forest, with approximately 125 grizzlies in the forest.[36][42] The grizzly is listed as a threatened species by the U.S. Fish and Wildlife Service, and the forest is one of their last strongholds. For what are considered to be \"nuisance bears\", non-lethal traps are set to capture them so that they can be relocated to remote areas, away from civilization.[43] In the case of the grizzly, each captured bear is tranquilized and then ear tagged with an identifying number. Each number is registered, and if the bear continues to return to areas where they pose a risk of imminent threat to human safety, they are exterminated.[43] The grizzly recovery efforts implemented by federal agencies have often resulted in major disagreements with local landowners and surrounding municipalities.[42] This situation occurs less frequently with the smaller and less aggressive black bear. An active management program, in conjunction with other National Forests and National Parks within the Greater Yellowstone Ecosystem, works cooperatively to maximize human safety and to ensure habitat protection for both species of endemic bears. Visitors are mandated to store their food in their vehicles or in steel containers found in campgrounds, and bear-proof trash receptacles are located in the front-country zones throughout the forest. In the backcountry, food must be stored some distance from campsites, and other related precautions are enforced to help prevent bad encounters.[37]",
				"after": "The cougar (mountain lion) and the gray wolf are large apex predators that inhabit the forest. Since the 1990s wolf reintroduction program in Yellowstone National Park, wolves have migrated into the forest and established permanent packs.[44] Approximately a dozen wolf packs totaling 70 individual wolves were documented in the forest in 2012.[45] The wolf was delisted as endangered once their population levels had reached management objectives and limited hunting of wolves was permitted in the forest starting in 2012.[46][47] Cougars are generally noctural and rarely seen but hunting of this species is also allowed in highly regulated harvests.[48] Wolverines are rare and elusive so documentation is often only from their tracks.[49] The Canada lynx was native to the forest, but no known populations may still exist due to the rarity of its primary food source, the Snowshoe hare. Shoshone National Forest is considered critical habitat for lynx recovery since the species is listed as threatened under the Endangered Species Act and the forest is in their historical range.[50] Other generally carnivorous mammals include coyote, bobcat, weasel, marten, ferret and badger.[51]",
			"color": "black|0.064259 floral|0.059186 white|0.059186 silver|0.058366 sea|0.055909 shell|0.055909 light|0.052831 steel|0.052831 blue|0.052831 mint|0.052266 cream|0.052266 ivory|0.05047 white|0.04771 smoke|0.04771 white|0.047144 snow|0.047113 dark|0.044262 gray|0.044262 dark|0.044262 grey|0.044262 linen|0.042918 old|0.03653 lace|0.03653 azure|0.032719 ghost|0.02686 white|0.02686 honeydew|0.0241 tan|0.02257 beige|0.02147 alice|0.019105 blue|0.019105 corn|0.01694 silk|0.01694 antique|0.01589 white|0.01589 light|0.013368 yellow|0.013368 light|0.012585 gray|0.012585 light|0.012585 grey|0.012585 papaya|0.011848 whip|0.011848 wheat|0.01007 saddle|0.0094916 brown|0.0094916 light|0.0089209 golden|0.0089209 rod|0.0089209 yellow|0.0089209 lavender|0.0085558 blush|0.0085558 gray|0.0082915 grey|0.0082915 dim|0.008287 gray|0.008287 dim|0.008287 grey|0.008287 pale|0.008045 golden|0.008045 rod|0.008045 gainsboro|0.0079801 lemon|0.007705 chiffon|0.007705 sienna|0.0073369 blanched|0.0072967 almond|0.0072967 dark|0.0058913 khaki|0.0058913 burly|0.005089 wood|0.005089  "
		}
	}
}
