{
	"add": {
		"doc": {
			"id": "3481b5bce9c40f0af6bd8efdad55a0fec7cb05b1c7a768c96deca558e25b672f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Cougar_closeup.jpg/220px-Cougar_closeup.jpg",
			"previous": [],
				"after": "Cougars are the largest of the small cats. They are placed in the subfamily Felinae, although their bulk characteristics are similar to those of the big cats in the subfamily Pantherinae.[1] The family Felidae is believed to have originated in Asia about 11 million years ago. Taxonomic research on felids remains partial, and much of what is known about their evolutionary history is based on mitochondrial DNA analysis,[34] as cats are poorly represented in the fossil record,[35] and there are significant confidence intervals with suggested dates. In the latest genomic study of Felidae, the common ancestor of today's Leopardus, Lynx, Puma, Prionailurus, and Felis lineages migrated across the Bering land bridge into the Americas 8.0 to 8.5 million years ago (Mya). The lineages subsequently diverged in that order.[35] North American felids then invaded South America 3 Mya as part of the Great American Interchange, following formation of the Isthmus of Panama. The cougar was originally thought to belong in Felis (Felis concolor), the genus which includes the domestic cat. As of 1993, it is now placed in Puma along with the jaguarundi, a cat just a little more than a tenth its weight.",
			"color": "dark|0.25288 gray|0.25288 dark|0.25288 grey|0.25288 gray|0.2118 grey|0.2118 dim|0.11743 gray|0.11743 dim|0.11743 grey|0.11743 silver|0.10568 light|0.065747 gray|0.065747 light|0.065747 grey|0.065747 black|0.047733 gainsboro|0.046509 light|0.015283 blue|0.015283 dark|0.014041 slate|0.014041 gray|0.014041 powder|0.013661 blue|0.013661 white|0.012743 smoke|0.012743 linen|0.01157 sea|0.0088449 shell|0.0088449 slate|0.0086031 gray|0.0086031 light|0.0078699 slate|0.0078699 gray|0.0078699 floral|0.0070522 white|0.0070522 old|0.0061183 lace|0.0061183 snow|0.0059901 alice|0.0049515 blue|0.0049515 light|0.0049408 cyan|0.0049408 azure|0.0049039  "
		}
	}
}
