{
	"add": {
		"doc": {
			"id": "3481e59a5f0b113fb04772421878aaad3b5ffa1274d49603d8269a1253140a63",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/US_and_PI_First_Transpacific_Air_Mail_Stamps_1935.jpg/600px-US_and_PI_First_Transpacific_Air_Mail_Stamps_1935.jpg",
				"previous": "Trippe decided to start a service from San Francisco to Honolulu and on to Hong Kong and Auckland following steamship routes. After negotiating traffic rights in 1934 to land at Pearl Harbor, Midway Island, Wake Island, Guam, and Subic Bay (Manila),[22] Pan Am shipped $500,000 worth of aeronautical equipment westward in March 1935 using the North Haven, a 15,000 ton merchant ship it chartered for the purpose of provisioning each island that the clippers would stop at on their 4 to 5-day flight.[23] Pan Am ran its first survey flight to Honolulu in April 1935 with a Sikorsky S-42 flying boat.[24] The airline won the contract for a San Francisco – Canton mail route later that year and operated its first commercial flight carrying mail and express (no passengers) in a Martin M-130 from Alameda to Manila amid media fanfare on November 22, 1935. The five-leg, 8,000-mile (12,875 km) flight arrived in Manila on November 29 and returned to San Francisco on December 6, cutting the time between the two cities via the fastest scheduled steamship by over two weeks.[25] (Both the United States and Philippine Islands issued special stamps for the two flights.) The first passenger flight left Alameda on October 21, 1936.[26] The fare from San Francisco to Manila or Hong Kong in 1937 was $950 one way (about $15580 in 2014) and $1,710 round trip.[27]",
				"after": "On August 6, 1937 Juan Trippe accepted United States aviation's highest annual prize, the Collier Trophy, on behalf of PAA from President Franklin D. Roosevelt for the company's \"establishment of the transpacific airline and the successful execution of extended overwater navigation and the regular operations thereof.\"[28] Later, Pan Am used Boeing 314 flying boats for the Pacific route: in China, passengers could connect to domestic flights on the Pan Am-operated China National Aviation Corporation (CNAC) network, co-owned with the Chinese government. Pan Am flew to Singapore for the first time in 1941, starting a semi-monthly service which reduced San Francisco–Singapore travel times from 25 days to six days.[29] The Boeing 314s were used on transatlantic routes starting in 1939.[10]",
			"color": "salmon|0.058657 dark|0.056286 salmon|0.056286 light|0.054171 coral|0.054171 light|0.053 steel|0.053 blue|0.053 light|0.036654 gray|0.036654 light|0.036654 grey|0.036654 gainsboro|0.035721 misty|0.034947 rose|0.034947 pink|0.032522 silver|0.03023 light|0.029585 pink|0.029585 tomato|0.024531 lavender|0.024233 white|0.022664 smoke|0.022664 light|0.022119 slate|0.022119 gray|0.022119 dark|0.021464 gray|0.021464 dark|0.021464 grey|0.021464 red|0.020753 alice|0.020484 blue|0.020484 light|0.020262 salmon|0.020262 peach|0.018525 puff|0.018525 mint|0.018358 cream|0.018358 lavender|0.018097 blush|0.018097 azure|0.017959 ghost|0.017147 white|0.017147 snow|0.016299 slate|0.015385 gray|0.015385 light|0.015377 blue|0.015377 white|0.01514 sea|0.014365 shell|0.014365 crimson|0.014292 floral|0.014057 white|0.014057 honeydew|0.013627 light|0.013549 cyan|0.013549 indian|0.013045 red|0.013045 linen|0.012254 burly|0.010759 wood|0.010759 powder|0.0099129 blue|0.0099129 thistle|0.0092444 ivory|0.0090567 antique|0.0089893 white|0.0089893 old|0.0082467 lace|0.0082467 bisque|0.007918 tan|0.0075706 wheat|0.0069103 beige|0.0068239 blanched|0.0054037 almond|0.0054037 papaya|0.005203 whip|0.005203 gray|0.0047624 grey|0.0047624 pale|0.0046702 violet|0.0046702 red|0.0046702 navajo|0.0045275 white|0.0045275  "
		}
	}
}
