{
	"add": {
		"doc": {
			"id": "3484e4db4c41d2ecfcc4a9c7a104017d9f55d3764706e4b71e7d40301e77db4a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Water_turbine_grandcoulee.jpg/220px-Water_turbine_grandcoulee.jpg",
				"previous": "Further regulation of the Columbia's flows was necessary to make the new power plant feasible. Water storage and regulation projects in Canada would be needed, as well as a treaty resolving the many economic and political issues involved. The Bureau of Reclamation and Army Corps of Engineers explored alternatives that would not depend on a treaty with Canada, such as raising the level of Flathead Lake or Pend Oreille Lake, but both proposals faced strong local opposition.[58] The Columbia River Treaty, which had been discussed between the U.S. and Canada since 1944, was seen as the answer. Efforts to build the Third Powerplant were also influenced by competition with the Soviet Union, which had constructed power plants on the Volga River that were larger than Grand Coulee.[61] On September 16, 1964, the Columbia River Treaty was ratified and included an agreement by Canada to construct the Duncan, Keenleyside and Mica Dams upstream.[62] Shortly afterward, Washington Senator Henry M. Jackson, who was influential in constructing the new power plant, announced that Reclamation would present the project to Congress for appropriation and funding.[63] To keep up with Soviet competition and increase the generating capacity it was determined that the generators could be upgraded to much larger designs. With the possibility of international companies bidding on the project, the Soviets who had just installed a 500 MW hydroelectric generator on the Yenisei River indicated their interest. To avoid the potential embarrassment of an international rival building a domestic power plant, the Department of the Interior declined international bidding. The Third Powerplant was approved and its appropriation bill was signed by President Lyndon Johnson on June 14, 1966.[64]",
				"after": "Between 1967 and 1974, the dam was expanded to add the Third Powerplant. Beginning in July 1967, this involved demolishing the northeast side of the dam and building a new fore-bay section. The excavation of 22,000,000 cu yd (16,820,207 m3) of dirt and rock had to be accomplished before the new 1,725 ft (526 m) long section of dam was built. The addition made the original 4,300 ft (1,300 m) dam almost a mile long. Original designs for the powerhouse had twelve smaller units but were altered to incorporate six of the largest generators available. To supply them with water, six 40 ft (12 m) diameter penstocks were installed.[65] Of the new turbines and generators, three 600 MW units were built by Westinghouse and three 700 MW units by General Electric. The first new generator was commissioned in 1975 and the final one in 1980.[2] The three 700 MW units were later upgraded to 805 MW by Siemens.[66]",
			"color": "black|0.10328 tan|0.1031 dim|0.099431 gray|0.099431 dim|0.099431 grey|0.099431 dark|0.069568 slate|0.069568 gray|0.069568 gray|0.064154 grey|0.064154 peach|0.050973 puff|0.050973 dark|0.04929 gray|0.04929 dark|0.04929 grey|0.04929 brown|0.03698 silver|0.035635 firebrick|0.035039 bisque|0.026578 burly|0.025711 wood|0.025711 coral|0.025386 wheat|0.024479 cadet|0.023649 blue|0.023649 sandy|0.019001 brown|0.019001 light|0.018362 gray|0.018362 light|0.018362 grey|0.018362 light|0.016089 salmon|0.016089 tomato|0.013076 dark|0.012718 salmon|0.012718 antique|0.012688 white|0.012688 blanched|0.012346 almond|0.012346 gainsboro|0.011187  "
		}
	}
}
