{
	"add": {
		"doc": {
			"id": "348506227a3680794f09b0ea308099a6f6a3c2b670281e60c5d32efa5f7928cb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Tam.a330-200.pt-mvl.arp.jpg/220px-Tam.a330-200.pt-mvl.arp.jpg",
				"previous": "Soon after the war most of the Soviet fleet of airliners consisted of DC-3s or the Lisunov Li-2. These planes were in desperate need of replacement, and in 1946 the Ilyushin Il-12 made its first flight. The Il-12 was very similar in design to American Convair 240, except was unpressurized. In 1953 the Ilyushin Il-14 would make its first flight, and this version was equipped with much more powerful engines.The main contribution that the Soviets made in regards to airliners was the Antonov An-2. This plane is a biplane, unlike most of the other airliners, and sold more units than any other transport plane.[9]",
				"after": "The largest airliners are wide-body jets. These aircraft are frequently called twin-aisle aircraft because they generally have two separate aisles running from the front to the back of the passenger cabin. Aircraft in this category are the Boeing 747, Boeing 767, Boeing 777, Boeing 787, Airbus A300/A310, Airbus A330, Airbus A340, Airbus A380, Lockheed L-1011 TriStar, McDonnell Douglas DC-10, McDonnell Douglas MD-11, Ilyushin Il-86, and Ilyushin Il-96. These aircraft are usually used for long-haul flights between airline hubs and major cities with many passengers. Future wide-body models include the Airbus A350.",
			"color": "dark|0.13029 gray|0.13029 dark|0.13029 grey|0.13029 dim|0.1242 gray|0.1242 dim|0.1242 grey|0.1242 light|0.10802 steel|0.10802 blue|0.10802 black|0.09991 gray|0.060156 grey|0.060156 firebrick|0.050005 light|0.045524 slate|0.045524 gray|0.045524 silver|0.043609 light|0.03992 gray|0.03992 light|0.03992 grey|0.03992 gainsboro|0.035002 slate|0.020735 gray|0.020735 white|0.019955 smoke|0.019955 ghost|0.01513 white|0.01513 snow|0.015066 sea|0.014573 shell|0.014573 alice|0.014548 blue|0.014548  "
		}
	}
}
