{
	"add": {
		"doc": {
			"id": "3487ff3c3776562ec43ee193bafeb8b670444d9a750cf74a6ff7a1b04c767565",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Boeing_727-100_Alaska_Airlines_Gilliand.jpg/220px-Boeing_727-100_Alaska_Airlines_Gilliand.jpg",
				"previous": "In 1961, competitors began introducing jets on routes Alaska Airlines flew. To counter this competition, Willis negotiated with aircraft manufacturer Convair to purchase a jet Convair 880 with no money down for use on routes between Alaska and the contiguous United States. The company introduced the new jet aircraft the same year. In 1966 the company received the first of its Boeing 727 fleet, removing the Convair 880 as a financing condition by Boeing in the sale of the 727's. In the spring of 1967, greatly increased passenger loads required quick addition of fleet aircraft, and Alaska purchased Varig retired Convair 990 PP-JVE, which became Alaska Airlines N987AS. This aircraft remained in service along with an increased fleet size of Boeing 727-100's, then 727-200's, which became Alaska Airlines' signature aircraft for the next 25 years. It also became the first carrier to fly the Lockheed L-382 Hercules, the civil version of the C-130, which hauled oil drilling rigs to Alaska's North Slope and later to Ecuador.[9] Alaska also owned two Lockheed L-1649A Starliners from 1962 to 1968, and three L-1049's which were used for Military Air Transport Service operations.[14][15][16]",
				"after": "During this time, Alaska Air faced some tough competition with other airlines such as Pan Am, Northwest Airlines and a regional carrier called Pacific Northern Airlines (later merged with Western Airlines). To set itself apart from the competition, it turned to some cheap but imaginative gimmicks such as having safety instructions read as rhymes, fashion shows in the aisles, as well as bingo games.[11]",
			"color": "light|0.31353 steel|0.31353 blue|0.31353 gray|0.2554 grey|0.2554 dim|0.13967 gray|0.13967 dim|0.13967 grey|0.13967 slate|0.044307 gray|0.044307 dark|0.043471 gray|0.043471 dark|0.043471 grey|0.043471 light|0.028052 slate|0.028052 gray|0.028052 silver|0.027374 light|0.020237 gray|0.020237 light|0.020237 grey|0.020237 gainsboro|0.015384 lavender|0.012907 white|0.01013 smoke|0.01013 ghost|0.0099159 white|0.0099159 alice|0.0098655 blue|0.0098655 snow|0.0083791 lavender|0.0079307 blush|0.0079307 white|0.0077584 black|0.0075869 azure|0.0070763 mint|0.0067139 cream|0.0067139 sea|0.0066456 shell|0.0066456 floral|0.0055051 white|0.0055051  "
		}
	}
}
