{
	"add": {
		"doc": {
			"id": "34906a574087d313738e08d38b1b91a11addc8fc6127b505d92d61f90caacbb8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Paul_Dini.jpg/100px-Paul_Dini.jpg",
			"previous": [],
				"after": "Batman: Arkham Asylum is a 2009 action-adventure video game based on the DC Comics superhero. Written by veteran Batman comics writer Paul Dini (pictured), it was developed by Rocksteady Studios and published by Eidos Interactive in conjunction with Warner Bros. Interactive Entertainment for the PlayStation 3 and Xbox 360 video game consoles and Microsoft Windows. In the main storyline, Batman's archenemy, the Joker, instigates an elaborate plot to seize control of Arkham Asylum and trap Batman inside with many of his incarcerated foes. Kevin Conroy, Mark Hamill, and Arleen Sorkin reprised their roles as Batman, the Joker, and his sidekick Harley Quinn respectively. The game is presented in third-person perspective with a primary focus on Batman's combat and stealth abilities, detective skills, and gadgets that can be used in combat and exploration. The game received critical acclaim—particularly for its narrative—and won several awards, including Best Action Adventure game, Best Game, and Game of the Year from different media outlets. It held the Guinness World Record for \"Most Critically Acclaimed Superhero Game Ever\". Arkham Asylum‍ '​s success launched a series of Batman: Arkham sequels, beginning in October 2011 with Batman: Arkham City. (Full article...)",
			"color": "black|0.44686 sienna|0.073272 dark|0.0585 salmon|0.0585 silver|0.050877 light|0.041785 gray|0.041785 light|0.041785 grey|0.041785 dark|0.034813 gray|0.034813 dark|0.034813 grey|0.034813 gainsboro|0.025854 white|0.017886 smoke|0.017886 sea|0.017195 shell|0.017195 floral|0.016988 white|0.016988 snow|0.016166 gray|0.015509 grey|0.015509 white|0.015151 mint|0.014854 cream|0.014854 light|0.012155 salmon|0.012155 ghost|0.01213 white|0.01213 azure|0.011713 linen|0.011033 alice|0.010761 blue|0.010761 dim|0.010389 gray|0.010389 dim|0.010389 grey|0.010389 ivory|0.0097097 lavender|0.0087294 blush|0.0087294 old|0.0072866 lace|0.0072866 rosy|0.0071426 brown|0.0071426 misty|0.0065722 rose|0.0065722 saddle|0.0063106 brown|0.0063106 antique|0.0056096 white|0.0056096  "
		}
	}
}
