{
	"add": {
		"doc": {
			"id": "34da4b53faa6844a8c9b797cba3526306c8d79ab473e1d5caae8c003c8958da1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Multipath_propagation_diagram_en.svg/220px-Multipath_propagation_diagram_en.svg.png",
				"previous": "Constant False Alarm Rate, a form of Automatic Gain Control (AGC), is a method that relies on clutter returns far outnumbering echoes from targets of interest. The receiver's gain is automatically adjusted to maintain a constant level of overall visible clutter. While this does not help detect targets masked by stronger surrounding clutter, it does help to distinguish strong target sources. In the past, radar AGC was electronically controlled and affected the gain of the entire radar receiver. As radars evolved, AGC became computer-software controlled and affected the gain with greater granularity in specific detection cells.",
				"after": "Clutter may also originate from multipath echoes from valid targets caused by ground reflection, atmospheric ducting or ionospheric reflection/refraction (e.g., Anomalous propagation). This clutter type is especially bothersome since it appears to move and behave like other normal (point) targets of interest. In a typical scenario, an aircraft echo is reflected from the ground below, appearing to the receiver as an identical target below the correct one. The radar may try to unify the targets, reporting the target at an incorrect height, or eliminating it on the basis of jitter or a physical impossibility. Terrain bounce jamming exploits this response by amplifying the radar signal and directing it downward.[26] These problems can be overcome by incorporating a ground map of the radar's surroundings and eliminating all echoes which appear to originate below ground or above a certain height. Monopulse can be improved by altering the elevation algorithm used at low elevation. In newer air traffic control radar equipment, algorithms are used to identify the false targets by comparing the current pulse returns to those adjacent, as well as calculating return improbabilities.",
			"color": "honeydew|0.24148 pink|0.10111 misty|0.079132 rose|0.079132 light|0.06779 cyan|0.06779 light|0.06765 pink|0.06765 mint|0.061858 cream|0.061858 azure|0.046616 ivory|0.042615 dark|0.036601 gray|0.036601 dark|0.036601 grey|0.036601 gray|0.033095 grey|0.033095 floral|0.026551 white|0.026551 dim|0.025862 gray|0.025862 dim|0.025862 grey|0.025862 white|0.024555 smoke|0.024555 white|0.021553 snow|0.017147 silver|0.016072 alice|0.015019 blue|0.015019  "
		}
	}
}
