{
	"add": {
		"doc": {
			"id": "34de4e12ae660dce8b4749dbeb2929815684f91bd2623cafc9e89161f6b0bb3e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Manchester_Airport_new_control_tower.jpg/220px-Manchester_Airport_new_control_tower.jpg",
				"previous": "Most aircraft arriving into Manchester Airport use the Instrument Landing System, which in line with most other airports has a glide slope of 3 degrees equal to descending 318 feet per nautical mile.[56] The prevailing wind direction is westerly, so normally aircraft fly from northeast to southwest. In practice this means that normally aircraft land from the northeast over Stockport, Cheadle and Heald Green and takeoff towards Knutsford. In dual runway operations aircraft will usually land on to Runway 1 (23R) and depart from Runway 2 (23L). When the wind direction changes, usually affecting 20% of movements per annum,[56] operations are reversed with aircraft landing from the southwest, lining up to the south over Northwich and over Knutsford and taking off towards Stockport.[56] In dual runway operations aircraft will usually land on to Runway 2 (05R) and depart from Runway 1 (05L).[56] Sometimes, aircraft arriving into Manchester Airport are held in stacks, usually in poor weather when the movement rate decreases.[56] The airport has 3 stacks: DAYNE, MIRSI and ROSUN, each located approximately 15/20 miles from the airport.[56] DAYNE serves arrivals from the south, ROSUN from the north and east and MIRSI from the west.[56] If you live within 20 miles of the airport, you will likely see and hear aircraft.[56]",
				"after": "A new control tower was opened on 25 June 2013. At 60 m tall, it is the UK's second tallest control tower, after London Heathrow, and it replaces the old tower on top of Terminal 1.[61]",
			"color": "slate|0.34374 gray|0.34374 light|0.29258 slate|0.29258 gray|0.29258 gray|0.10361 grey|0.10361 dim|0.075604 gray|0.075604 dim|0.075604 grey|0.075604 dark|0.058259 slate|0.058259 gray|0.058259 dark|0.051321 gray|0.051321 dark|0.051321 grey|0.051321 light|0.020018 steel|0.020018 blue|0.020018 silver|0.015719 light|0.0099362 gray|0.0099362 light|0.0099362 grey|0.0099362 gainsboro|0.0074102  "
		}
	}
}
