{
	"add": {
		"doc": {
			"id": "34e15ec51228fedcde2007150b9cc9d5efdc447d6f519196c73d1c62dd96dfe3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Douglas_C-47A_G-AHCU_Channel_Aws_ROCH_08.08.65_edited-2.jpg/220px-Douglas_C-47A_G-AHCU_Channel_Aws_ROCH_08.08.65_edited-2.jpg",
				"previous": "On 29 October 1962, East Anglian Flying Services officially changed its name to Channel Airways. (Although the Channel Airways name had first appeared on the company's aircraft as long ago as 1952, the old name was retained as the officially registered name until the somewhat similarly sounding Channel Air Bridge name became defunct to avoid any confusion.[31][34])[5][6][7][35] By that time, Channel Airways operated frequent scheduled passenger and freight services from Southend, Ipswich and Rochester to the Channel Islands, Rotterdam, Ostend and Paris as well as from Portsmouth to the Channel Islands. The airline also held licences to operate vehicle ferry services from Bristol to Dublin, Cork, Jersey and Bilbao, as well as from Southend to Jersey and Bilbao. It furthermore applied for traffic rights to operate a vehicle ferry service between Liverpool and Dublin. Moreover, the company ran regular, 52-seat luxury express coach services linking Norwich with Ipswich as well as Eastbourne, Brighton, Worthing, London, Reading, Basingstoke and Guildford with Portsmouth. (There were also special coaches linking up with corporate shuttle services the company operated under contract to the Ford Motor Company between Southend and the airports serving the latter's continental plants.[36]) In addition, IT and general passenger and freight charter services, which accounted for a growing share of the firm's business, were operated while rival Southend-based independent airline Tradair equipped with Vickers Vikings became a wholly owned subsidiary of Channel Airways on 31 December 1962.[7][22][31][34][35][37][38]",
				"after": "In 1963, Channel Airways acquired its first turboprop airliner, a Vickers Viscount 700 series inherited from Tradair.[nb 3] That year also marked the beginning of the airline's large-scale expansion into IT charters from Manchester and Southend.[7][31] This saw the operation of 71-seat Viscounts and a Douglas DC-4 in a high-density, 88-seat layout from Manchester and other UK airports to the Mediterranean and Ostend respectively.[31][39]",
			"color": "black|0.60932 dark|0.25465 olive|0.25465 green|0.25465 royal|0.016919 blue|0.016919 light|0.014201 steel|0.014201 blue|0.014201 dark|0.010888 slate|0.010888 blue|0.010888 dim|0.0095507 gray|0.0095507 dim|0.0095507 grey|0.0095507 gray|0.008434 grey|0.008434 light|0.0082724 slate|0.0082724 gray|0.0082724 slate|0.0079271 gray|0.0079271 slate|0.0078169 blue|0.0078169  "
		}
	}
}
