{
	"add": {
		"doc": {
			"id": "34ea6775672583f30a80830dcb54ece70cadbdc5ed5135440826c8ca585d76ee",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Providence_Cathedral%2C_RI_edited.JPG/220px-Providence_Cathedral%2C_RI_edited.JPG",
				"previous": "Providence is home to an 1,200-acre (4.9 km2) park system,[105] notably Waterplace Park and Riverwalk, Roger Williams Park, Roger Williams National Memorial, and Prospect Terrace Park, the latter featuring expansive views of the downtown area. As one of the first cities in the country, Providence contains many historic buildings while the East Side neighborhood in particular includes the largest contiguous area of buildings listed on the National Register of Historic Places in the U.S. with many pre-revolutionary houses.[106] The East Side is also home to the First Baptist Church in America, the oldest Baptist church in the Americas, founded by Roger Williams in 1638, as well as the Old State House, which served as the state's capitol from 1762 to 1904.[107] Nearby is Roger Williams National Memorial. Downcity Providence is home to the fourth-largest unsupported dome in the world (the second-largest marble dome after St. Peter's Basilica in Rome),[108] as well as the Westminster Arcade, which is the oldest enclosed shopping center in the U.S.[109][110]",
				"after": "The main art museum is the Rhode Island School of Design Museum, which has the 20th-largest collection in the country.[111] In addition to the Providence Public Library and the nine branches of the Providence Community Library, the city is home to the Providence Athenæum, the fourth oldest library in the country.[112] Here, on one of his many visits to Providence, Edgar Allan Poe, met and courted a love interest named Sarah Helen Whitman.[113] Poe was a regular fixture there, as was H. P. Lovecraft (who was born in Providence); both of them influential writers of gothic literature.",
			"color": "dark|0.19658 olive|0.19658 green|0.19658 dim|0.17473 gray|0.17473 dim|0.17473 grey|0.17473 gray|0.14479 grey|0.14479 black|0.10136 dark|0.057237 gray|0.057237 dark|0.057237 grey|0.057237 light|0.056382 steel|0.056382 blue|0.056382 silver|0.029768 dark|0.027953 slate|0.027953 gray|0.027953 gainsboro|0.022197 light|0.021408 gray|0.021408 light|0.021408 grey|0.021408 slate|0.020415 gray|0.020415 alice|0.016035 blue|0.016035 lavender|0.015144 light|0.014003 blue|0.014003 light|0.013755 slate|0.013755 gray|0.013755 ghost|0.013317 white|0.013317 white|0.013247 smoke|0.013247 azure|0.010346 snow|0.0096067 white|0.0091085 mint|0.0082849 cream|0.0082849 lavender|0.007461 blush|0.007461 sea|0.0053041 shell|0.0053041  "
		}
	}
}
