{
	"add": {
		"doc": {
			"id": "34f154ae8abb216d934bc0b9a90ae4fd7b3e5e7fc6dbbba96cc587ad386fe79d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/BBCBroadcastingHouse.JPG/220px-BBCBroadcastingHouse.JPG",
			"previous": [],
				"after": "Further cuts were announced on 6 October 2011, so the BBC could reach a total reduction in their budget of 20%, following the licence fee freeze in October 2010, details include cutting staff by 2000 and sending a further 1000 to the MediaCityUK development, with BBC Three moving in 2016, the sharing of more programmes between stations and channels, sharing of radio news bulletins, more repeats in schedules, including the whole of BBC Two daytime and for some original programming to be reduced. BBC HD was closed on 26 March 2013 and replaced with an HD simulcast of BBC Two, however flagship programmes, other channels and full funding for CBBC and CBeebies would be retained.[46][47][48] Numerous BBC facilities have been sold off, including New Broadcasting House on Oxford Road in Manchester. Many major departments have been relocated to Broadcasting House and MediaCityUK, particularly since the closure of BBC Television Centre in March 2013. The continued cuts have inspired campaigns, petitions and protests amongst the viewers and listeners of the BBC who are fiercely loyal to the sections of the BBC that they use. Websites like SaveBBC3 and SaveOurBBC have built a following of hundreds of thousands of individuals concerned about the changes.",
			"color": "corn|0.24877 flower|0.24877 blue|0.24877 royal|0.22752 blue|0.22752 dodger|0.07543 blue|0.07543 deep|0.05321 sky|0.05321 blue|0.05321 tan|0.03907 gray|0.038141 grey|0.038141 light|0.022923 steel|0.022923 blue|0.022923 dark|0.022568 gray|0.022568 dark|0.022568 grey|0.022568 dim|0.017375 gray|0.017375 dim|0.017375 grey|0.017375 midnight|0.016942 blue|0.016942 navy|0.016623 light|0.01597 sky|0.01597 blue|0.01597 light|0.013033 slate|0.013033 gray|0.013033 slate|0.012323 blue|0.012323 dark|0.011685 blue|0.011685 dark|0.011323 slate|0.011323 blue|0.011323 silver|0.010496 slate|0.0098402 gray|0.0098402 aqua|0.0087831 cyan|0.0087831 light|0.0084071 blue|0.0084071  "
		}
	}
}
