{
	"add": {
		"doc": {
			"id": "351e7d0085d10779159766f186d203cf7eccefafa6e3ff33fbc81f7d2dc6c479",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Armillaria_luteobubalina_151150.jpg/220px-Armillaria_luteobubalina_151150.jpg",
			"previous": [],
				"after": "Several studies have shown that the spread of Armillaria root rot in eucalypt forests is associated with infected stumps that remain after an area has been logged.[28][29][30] Armillaria luteobubalina can persist on these stumps, using them as a source of food for up to 25 or more years.[27] In one case reported in Ovens, Victoria, the disease was spread to blueberry plants (Vaccinium species) via buried fragments of infected Eucalyptus that remained following preparation of the previously forested site for planting.[31] In individual forest stands,[32] fungal infection is usually found in discrete disease patches separated by stands of healthy trees—a discontinuous distribution.[27] Large-scale aerial photography can be used to identify regions of forest infected by the species.[33] The species also causes damage to trees and bushes in coastal dune woodlands, shrubland, and heath communities.[34] It can be found on a wide range of hosts, but is most commonly associated with (in order of decreasing frequency) jarrah (Eucalyptus marginata), bull banksia (Banksia grandis), marri (E. calophylla), Lasiopetalum floribundum, and Acacia saligna.[35] It has also infected scattered populations of wandoo (E. wandoo).[36] The fungus has also been reported to infect Nothofagus species in Argentina, and Pinus radiata in Chile.[7] Armillaria luteobubalina uses \"an elaborate, sophisticated aeration system\" that enables it to efficiently deliver oxygen into the rhizomorphs, helping it thrive in low-oxygen environments.[37][38] When grown in culture, the mycelium develops into a continuous region of tissue with a perforated crust. This tissue is hydrophobic and resistant to becoming waterlogged. Rhizomorphs develop beneath clusters of so-called \"air-pores\" near the perforations. These gas spaces connect the atmosphere with the central canal of the rhizomorph, to facilitate diffusion of oxygen and satiate the organism's high oxygen requirement during growth. This aeration system is thought to be an important factor in the organism's pathogenicity, allowing it to grow on wet or waterlogged root surfaces and send hyphae or rhizomorphs into live roots or cut stumps, where conditions may be hypoxic.[38] The rhizomorphs have a dichotomous branching pattern, so that they split or bifurcate at various intervals. Experiments and field observations have shown that this allows the fungus to be a more aggressive and virulent pathogen than Armillaria species whose rhizomorphs branch monopodially (where lateral branches grow from a main stem).[39] Although the structure of A. luteobubalina rhizomorphs is specialised for spread in potentially anaerobic conditions, the soil mycelium is adaptive and can amplify the absorptive surface of peripheral hyphae in response to the presence of nutrient-rich soil.[40]",
			"color": "black|0.61709 dim|0.058478 gray|0.058478 dim|0.058478 grey|0.058478 peru|0.038257 burly|0.034833 wood|0.034833 dark|0.034616 slate|0.034616 gray|0.034616 dark|0.028704 olive|0.028704 green|0.028704 cadet|0.021792 blue|0.021792 dark|0.017179 golden|0.017179 rod|0.017179 tan|0.015817 saddle|0.01538 brown|0.01538 gray|0.011896 grey|0.011896  "
		}
	}
}
