{
	"add": {
		"doc": {
			"id": "353f4d1b3891560da19c1b3d19663edcb846c2b681c3287490177d7a4c3823c6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/JohnsonCreek1.jpg/220px-JohnsonCreek1.jpg",
				"previous": "Turning sharply, Johnson Creek flows swiftly northwest for about 3 miles (5 km), entering Gresham and shortly thereafter passing the United States Geological Survey (USGS) gauge at Regner Road, 16.2 miles (26.1 km) from the mouth. Soon the creek enters Main City Park in Gresham, where it again turns sharply and flows slightly south of west. Here the slope flattens, and the stream runs more slowly for the next third of its course. Slightly west of Main City Park, it passes the Gresham Pioneer Cemetery.[7] Just beyond the cemetery, it receives Butler Creek on the left, enters Portland at about 13 miles (21 km) from the mouth, and receives Kelley Creek on the left shortly thereafter. Mitchell Creek, a major tributary of Kelley Creek, enters Kelley Creek about 0.5 miles (0.8 km) south of Johnson Creek. Shortly thereafter, Johnson Creek passes the USGS gauge station at Sycamore, 10.2 miles (16.4 km) from the mouth.[5][6]",
				"after": "Meandering slowly through the Lents neighborhood of Portland, Johnson Creek receives Veterans Creek, which enters on the left from its headwaters in Happy Valley in Clackamas County. Johnson Creek passes under Interstate 205, and shortly thereafter begins to flow more swiftly again at Southeast 82nd Avenue, about 8 miles (13 km) from the mouth. It then makes its sixth and seventh county-border crossings, dipping briefly into Clackamas County and back north into Multnomah County, and then runs near the border between Portland and Milwaukie along Johnson Creek Boulevard for about 2 miles (3.2 km). After passing under Oregon Route 99E (Southeast McLoughlin Boulevard) in Portland's Sellwood neighborhood, the creek turns sharply south about 1.5 miles (2.4 km) from the mouth.[5][6]",
			"color": "dark|0.34692 gray|0.34692 dark|0.34692 grey|0.34692 gray|0.31738 grey|0.31738 dim|0.15365 gray|0.15365 dim|0.15365 grey|0.15365 silver|0.07636 light|0.026905 gray|0.026905 light|0.026905 grey|0.026905 light|0.018923 slate|0.018923 gray|0.018923 gainsboro|0.01811 slate|0.01482 gray|0.01482 white|0.0037986 smoke|0.0037986 alice|0.0034131 blue|0.0034131  "
		}
	}
}
