{
	"add": {
		"doc": {
			"id": "3542db4032eaee9a8271c53b1d4752ae2efc0e1781860c583219b14f1abd1173",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Sutton.Hoo.ShoulderClasp2.RobRoy.jpg/280px-Sutton.Hoo.ShoulderClasp2.RobRoy.jpg",
				"previous": "Early Anglo-Saxon art, as it survives, is seen mostly in decorated jewellery, like brooches, buckles, beads and wrist-clasps, some of outstanding quality. Characteristic of the 5th century is the quoit brooch with motifs based on crouching animals, as seen on the silver quoit brooch from Sarre, Kent. While the origins of this style are disputed, it is either an offshoot of provincial Roman art, Frank, or Jute art. One style flourished from the late 5th century, and continued throughout the 6th, and is on many square-headed brooches, it is characterised by chip-carved patterns based on animals and masks. A different style, which gradually superseded it is dominated by serpentine beasts with interlacing bodies.[170]",
				"after": "By the later 6th century the best works from the south-east are distinguished by greater use of expensive materials, above all gold and garnets, reflecting the growing prosperity of a more organised society which had greater access to imported precious materials, as seen in the buckle from the Taplow burial and the jewellery from that at Sutton Hoo,[171] c.600 and c.625 respectively. The possible symbolism of the decorative elements like interlace and beast forms that were used in these early works remains unclear, it is clear. These objects were the products of a society that invested its modest surpluses in personal display, who fostered craftsmen and jewellers of a high standard, and a society where the possession of a fine brooch or buckle was a valuable status symbol and possible tribal emblem – in death as much as in life.[172]",
			"color": "black|0.24393 sienna|0.13671 saddle|0.091845 brown|0.091845 dark|0.076326 khaki|0.076326 khaki|0.049802 peru|0.043383 golden|0.043101 rod|0.043101 burly|0.040649 wood|0.040649 dark|0.038586 golden|0.038586 rod|0.038586 tan|0.034488  "
		}
	}
}
