{
	"add": {
		"doc": {
			"id": "3548b8fe521301d0e7fcf1b695ccef1cb64b8c6f55eb9280a9e5f35852c7c4f4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Monument_Avicenna_in_Qakh.JPG/220px-Monument_Avicenna_in_Qakh.JPG",
				"previous": "In modern Iran, he is considered a national icon, and is often regarded as one of the greatest Persians to have ever lived. An monument was erected outside the Bukhara museum[year needed]. The Avicenna Mausoleum and Museum in Hamadan was built in 1952. Bu-Ali Sina University in Hamadan (Iran), the ibn Sīnā Tajik State Medical University in Dushanbe, Ibn Sina Academy of Medieval Medicine and Sciences at Aligarh, India, Avicenna School in Karachi and Avicenna Medical College in Lahore, Pakistan[89] Ibne Sina Balkh Medical School in his native province of Balkh in Afghanistan, Ibni Sina Faculty Of Medicine of Ankara University Ankara, Turkey and Ibn Sina Integrated School in Marawi City (Philippines) are all named in his honour. His portrait hangs in the Hall of the Avicenna Faculty of Medicine in the University of Paris. There is also a crater on the Moon named Avicenna and a plant genus Avicennia.",
				"after": "In 1980, the Soviet Union, which then ruled his birthplace Bukhara, celebrated the thousandth anniversary of Avicenna's birth by circulating various commemorative stamps with artistic illustrations, and by erecting a bust of Avicenna based on anthropological research by Soviet scholars.[citation needed] Near his birthplace in Qishlak Afshona, some 25 km (16 mi) north of Bukhara, a training college for medical staff has been named for him.[year needed] On the grounds is a museum dedicated to his life, times and work.[90]",
			"color": "dark|0.29718 gray|0.29718 dark|0.29718 grey|0.29718 silver|0.15587 gray|0.12493 grey|0.12493 dim|0.099063 gray|0.099063 dim|0.099063 grey|0.099063 light|0.052714 gray|0.052714 light|0.052714 grey|0.052714 burly|0.042479 wood|0.042479 tan|0.036697 dark|0.029792 slate|0.029792 gray|0.029792 gainsboro|0.02932 sienna|0.029227 rosy|0.019185 brown|0.019185 slate|0.010701 gray|0.010701 light|0.010274 slate|0.010274 gray|0.010274  "
		}
	}
}
