{
	"add": {
		"doc": {
			"id": "3548aa9c78961bb84f7ed6dca11591f030750c62690975c30a151b82d39ba63a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Featherstorestkilda.jpg/220px-Featherstorestkilda.jpg",
				"previous": "The Head Wall was built in 1834 when the medieval village was abandoned and a new one planned between Tobar Childa and the sea some 700 feet (200 m) down the slope. This came about as the result of a visit by Sir Thomas Dyke Ackland, the MP for Devon. Appalled by the primitive conditions, he made a donation that led to the construction of a completely new settlement of 30 new blackhouses. These houses were made of dry stone, had thick walls and were roofed with turf. Each typically had only one tiny window and a small aperture for letting out smoke from the peat fire that burnt in the middle of the room. As a result, the interiors were blackened by soot. The cattle occupied one end of the house in winter, and once a year the straw from the floor was stripped out and spread on the ground.[133] Several of the new dwellings were damaged by a severe gale in October 1860, and repairs were sufficient only to make them suitable for use as byres. According to Alasdair MacGregor's analysis of the settlement, the sixteen modern, zinc-roofed cottages amidst the black houses and new Factor's house seen in most photographs of the natives were constructed around 1862.[134]",
				"after": "One of the more poignant ruins on Hirta is the site of 'Lady Grange's House'. Lady Grange had been married to the Jacobite sympathiser James Erskine of Grange for 25 years when he decided that she might have overheard too many of his treasonable plottings. He had her kidnapped and secretly confined in Edinburgh for six months. From there she was sent to the Monach Isles, where she lived in isolation for two years. She was then taken to Hirta from 1734 to 1740, which she described as \"a vile neasty, stinking poor isle\". After a failed rescue attempt, she was removed by Erskine to the Isle of Skye, where she died. The 'house' is a large cleit in the Village meadows.[135][136][137][138]",
			"color": "dim|0.45457 gray|0.45457 dim|0.45457 grey|0.45457 dark|0.31556 olive|0.31556 green|0.31556 gray|0.15592 grey|0.15592 black|0.054182  "
		}
	}
}
