{
	"add": {
		"doc": {
			"id": "35516631ae6526431e62ed84e4d3945c33c8534e787253d5a4a72872e1a1cf62",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Banksia_attenuata_resprouter.jpg/170px-Banksia_attenuata_resprouter.jpg",
			"previous": [],
				"after": "Like many plants in south-west Western Australia, B. attenuata is adapted to an environment in which bushfire events are relatively frequent. Most Banksia species can be placed in one of two broad groups according to their response to fire: reseeders are killed by fire, but fire also triggers the release of their canopy seed bank, thus promoting recruitment of the next generation; resprouters survive fire, resprouting from a lignotuber or, more rarely, epicormic buds protected by thick bark.[21] Bearing epicormic buds and a lignotuber, B. attenuata is one of the latter group, with follicles that may open spontaneously or by fire.[3] It is moderately serotinous, storing only one tenth the number of seeds in its seed bank as the reseeding B. hookeriana which it coexists with on sand dunes in scrub at Eneabba north of Perth. Even then, many of its follicles do not release seed after a fire, but instead after successive autumn rains.[22] An experiment simulating wet weather following a fire saw a series of Banksia attenuata cones with follicles subjected to twice weekly immersions in water after being heated in a ring Bunsen flame to around 500–600 °C (930–1100 °F) for two minutes. Cones that had been exposed to water for more weeks had more seed released from follicles over time; around 40% released at three weeks, increasing steadily to almost 90% at ten weeks, compared with a series of controls (which were kept dry) of which fewer than 10% of seed released. Thus, the seed remains in the follicles until successive rains result in seed dispersal in the wetter winter (instead of dryer summer), increasing the chance of survival. After the follicle is split, the seed and separator are exposed to the elements. The wings of the woody separator are hygroscopic, and move together when wet, and spread and curl apart when dry. The seed is gradually drawn out by the movement with each wetting.[23] Once released, seed germinates at temperatures between 15 and 20 °C (60–70 °F) to optimise timing with autumn and winter rains and hence maximise chance of survival. Still, many seedlings die off in the hot and dry summer months.[24] Seedling survival for the species is lower than for banksias which regenerate by seeding over time. Despite this, the longevity of mature plants allows for maintenance of population until favourable years enable better survival of young plants. As they mature, plants are less likely to perish, and estimated to live for 300 years or more.[25] Analyzing the seed bank and longitudinal results over fifteen years on the Eneabba sandplain showed that B. attenuata would become more abundant over time with fire intervals averaging between 6 and 20 years, peaking with intervals around 10 to 12 years, compared with longer intervals for the reseeders B. hookeriana and B. prionotes. Placed against its rivals, B. attenuata would be dominant between 8 and 10 or 11 years, but at longer intervals is outcompeted by B. hookeriana. Variability in the timing between fires allows all three species to coexist. Exaggerated good and bad weather conditions favours B. attenuata over the reseeding species, which suffer more.[26]",
			"color": "dim|0.20362 gray|0.20362 dim|0.20362 grey|0.20362 gray|0.16482 grey|0.16482 dark|0.12592 gray|0.12592 dark|0.12592 grey|0.12592 black|0.11541 silver|0.05664 light|0.038799 slate|0.038799 gray|0.038799 slate|0.035141 gray|0.035141 light|0.02841 steel|0.02841 blue|0.02841 light|0.02815 gray|0.02815 light|0.02815 grey|0.02815 gainsboro|0.018869 tan|0.017541 dark|0.017001 slate|0.017001 gray|0.017001 alice|0.016826 blue|0.016826 light|0.012841 blue|0.012841 lavender|0.012722 azure|0.011069 antique|0.01104 white|0.01104 light|0.0106 cyan|0.0106 ghost|0.010277 white|0.010277  "
		}
	}
}
