{
	"add": {
		"doc": {
			"id": "355d652ec0987192bfdc5889fb79ec6b98891e69c4b72f429501e6b2c1d9b677",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Yellow-shouldered_Blackbird.jpg/220px-Yellow-shouldered_Blackbird.jpg",
				"previous": "The avifauna of the West Indies is predominantly of tropical North American (southern North America and Central America) origin with aggressive South American species having colonized the area only recently.[24] The South American families occurring in the Greater Antilles are the hummingbirds (Trochilidae), tyrant flycatchers (Tyrannidae), Bananaquit (Coerebidae) and tanagers (Thraupidae), all of which are represented in Puerto Rico. The prevailing theory suggests that bird fauna colonized the West Indies by transoceanic dispersal during the glacial periods of the Pleistocene. The most primitive West Indies birds are the Todies which have an endemic representative in Puerto Rico, the Puerto Rican Tody.[24]",
				"after": "Puerto Rico's avifauna has diminished due to extinction and extirpation, either by natural forces or human intervention. For example, fossil evidence was discovered for a species of swift, Tachornis uranoceles, dated to the late Pleistocene (between 17,000 and 21,000 years ago).[25] The species is believed to have become extinct as a result of habitat alteration after the Wisconsin glaciation.[12] At least six endemic species have become extinct in the last millennia: Puerto Rican barn owl (Tyto cavatica), Puerto Rican caracara (Polyborus latebrosus), Puerto Rican conure (Aratinga chloroptera maugei), Puerto Rican woodcock (Scolopax anthonyi), Puerto Rican quail-dove (Geotrygon larva), and the Antillean cave rail (Nesotrochis debooyi).[26] With a population of 13 individuals in 1975, the Puerto Rican parrot almost became the seventh, but conservation efforts helped save the species from extinction. However, it is still one of the ten most critically endangered birds in the world. Four Puerto Rican birds, the Hispaniolan parakeet, the white-necked crow, the Cuban crow, and the limpkin, became extirpated after Puerto Rico's population expansion in the latter half of the nineteenth century and three more species, the black-bellied whistling duck, the black rail, and the greater flamingo, no longer breed in the archipelago.",
			"color": "black|0.19779 light|0.13031 gray|0.13031 light|0.13031 grey|0.13031 gainsboro|0.11565 silver|0.097209 dark|0.076729 olive|0.076729 green|0.076729 golden|0.06016 rod|0.06016 lavender|0.040718 dark|0.038476 khaki|0.038476 peru|0.03273 khaki|0.031804 tan|0.030994 dark|0.027319 golden|0.027319 rod|0.027319 gold|0.025651 dark|0.022722 gray|0.022722 dark|0.022722 grey|0.022722 burly|0.012572 wood|0.012572 olive|0.011973 drab|0.011973  "
		}
	}
}
