{
	"add": {
		"doc": {
			"id": "35660a99861680e628ca5f8147f8e65b46e824b827e61ae74bf07bba93764e2a",
			"url": "https://upload.wikimedia.org/math/8/d/7/8d7661f1cc67175eb6f653b002656bcf.png",
			"previous": [
				"where V and I represent the voltage and current respectively on the electrical side of the transducer.",
				"It was not enough to just develop a mechanical analogy. This could be applied to problems that were entirely in the mechanical domain, but for mechanical filters with an electrical application it is necessary to include the transducer in the analogy as well. Poincaré in 1907 was the first to describe a transducer as a pair of linear algebraic equations relating electrical variables (voltage and current) to mechanical variables (force and velocity).[13] These equations can be expressed as a matrix relationship in much the same way as the z-parameters of a two-port network in electrical theory, to which this is entirely analogous:"
			],
				"after": "An early application of these new theoretical tools was in phonographic sound reproduction. A recurring problem with early phonograph designs was that mechanical resonances in the pickup and sound transmission mechanism caused excessively large peaks and troughs in the frequency response, resulting in poor sound quality. In 1923, Harrison of the Western Electric Company filed a patent for a phonograph in which the mechanical design was entirely represented as an electrical circuit. The horn of the phonograph is represented as a transmission line, and is a resistive load for the rest of the circuit, while all the mechanical and acoustic parts—from the pickup needle through to the horn—are translated into lumped components according to the impedance analogy. The circuit arrived at is a ladder topology of series resonant circuits coupled by shunt capacitors. This can be viewed as a bandpass filter circuit. Harrison designed the component values of this filter to have a specific passband corresponding to the desired audio passband (in this case 100 Hz to 6 kHz) and a flat response. Translating these electrical element values back into mechanical quantities provided specifications for the mechanical components in terms of mass and stiffness, which in turn could be translated into physical dimensions for their manufacture. The resulting phonograph has a flat frequency response in its passband and is free of the resonances previously experienced.[15] Shortly after this, Harrison filed another patent using the same methodology on telephone transmit and receive transducers.[16]",
			"color": "black|0.4259 dim|0.21796 gray|0.21796 dim|0.21796 grey|0.21796 gray|0.17303 grey|0.17303 dark|0.089557 gray|0.089557 dark|0.089557 grey|0.089557 silver|0.03708 light|0.019874 gray|0.019874 light|0.019874 grey|0.019874 gainsboro|0.015357 white|0.0040347 smoke|0.0040347  "
		}
	}
}
