{
	"add": {
		"doc": {
			"id": "3583a7220516e0605a142ca223ee64827a5c5f1832651e3d588d022cc6466677",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Ubiquitin_cartoon.png/250px-Ubiquitin_cartoon.png",
				"previous": "Only recently, the assembly process of the 19S regulatory particle has been elucidated to considerable extent. The 19S regulatory particle assembles as two distinct subcomponents, the base and the lid. Assembly of the base complex is facilitated by four assembly chaperones, Hsm3/S5b, Nas2/p27, Rpn14/PAAF1, and Nas6/gankyrin (names for yeast/mammals).[34] These assembly chaperones bind to the AAA-ATPase subunits and their main function seems to be to ensure proper assembly of the heterohexameric AAA-ATPase ring. To date it is still under debate whether the base complex assembles separately, whether the assembly is templated by the 20S core particle, or whether alternative assembly pathways exist. In addition to the four assembly chaperones, the deubiquitinating enzyme Ubp6/Usp14 also promotes base assembly, but it is not essential.[35] The lid assembles separately in a specific order and does not require assembly chaperones.[36]",
				"after": "Proteins are targeted for degradation by the proteasome with covalent modification of a lysine residue that requires the coordinated reactions of three enzymes. In the first step, a ubiquitin-activating enzyme (known as E1) hydrolyzes ATP and adenylylates a ubiquitin molecule. This is then transferred to E1's active-site cysteine residue in concert with the adenylylation of a second ubiquitin.[37] This adenylylated ubiquitin is then transferred to a cysteine of a second enzyme, ubiquitin-conjugating enzyme (E2). In the last step, a member of a highly diverse class of enzymes known as ubiquitin ligases (E3) recognizes the specific protein to be ubiquitinated and catalyzes the transfer of ubiquitin from E2 to this target protein. A target protein must be labeled with at least four ubiquitin monomers (in the form of a polyubiquitin chain) before it is recognized by the proteasome lid.[38] It is therefore the E3 that confers substrate specificity to this system.[39] The number of E1, E2, and E3 proteins expressed depends on the organism and cell type, but there are many different E3 enzymes present in humans, indicating that there is a huge number of targets for the ubiquitin proteasome system.",
			"color": "dark|0.42464 green|0.42464 forest|0.23484 green|0.23484 green|0.13048 dark|0.044873 sea|0.044873 green|0.044873 dim|0.041245 gray|0.041245 dim|0.041245 grey|0.041245 gray|0.035771 grey|0.035771 dark|0.034498 gray|0.034498 dark|0.034498 grey|0.034498 silver|0.015912  "
		}
	}
}
