{
	"add": {
		"doc": {
			"id": "3597d815eea8c9f3210dadd8bd5d9b4a6590e96b48c27473adec00708ec93d93",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Princess_diana_bristol_1987_01.jpg/170px-Princess_diana_bristol_1987_01.jpg",
			"previous": [],
				"after": "Sometimes within a catalog there are different names or spellings for only one person or subject.[9][12] This can bring confusion since researchers may miss some information. Authority control is used by cataloguers to collocate materials that logically belong together but which present themselves differently. Records are used to establish uniform titles which collocate all versions of a given work under one unique heading even when such versions are issued under different titles. With authority control, one unique preferred name represents all variations and will include different variations, spellings and misspellings, uppercase versus lowercase variants, differing dates, and so forth. For example, in Wikipedia, the subject of Princess Diana is described by an article Diana, Princess of Wales as well as numerous other descriptors, but both Princess Diana and Diana, Princess of Wales describe the same person; an authority record would choose one title as the preferred one for consistency. In an online library catalog, various entries might look like the following:[2]",
			"color": "light|0.32816 steel|0.32816 blue|0.32816 dim|0.080297 gray|0.080297 dim|0.080297 grey|0.080297 lavender|0.054523 light|0.054019 gray|0.054019 light|0.054019 grey|0.054019 silver|0.050774 gainsboro|0.049944 light|0.042247 slate|0.042247 gray|0.042247 alice|0.034438 blue|0.034438 dark|0.034417 gray|0.034417 dark|0.034417 grey|0.034417 white|0.027718 smoke|0.027718 ghost|0.026554 white|0.026554 gray|0.024483 grey|0.024483 azure|0.022084 slate|0.020641 gray|0.020641 snow|0.018779 light|0.018357 blue|0.018357 white|0.018337 mint|0.01825 cream|0.01825 tan|0.012653 light|0.011213 cyan|0.011213 sea|0.010619 shell|0.010619 floral|0.010033 white|0.010033 rosy|0.0081179 brown|0.0081179 lavender|0.0078977 blush|0.0078977  "
		}
	}
}
