{
	"add": {
		"doc": {
			"id": "359b2e25620662fc8d8985a6db42d5d0c3007c9739379cbf1e9fe37ebcbc239c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Ailanthus_altissima1.jpg/150px-Ailanthus_altissima1.jpg",
			"previous": [],
				"after": "The flowers are small and appear in large panicles up to 50 cm (20 in) in length at the end of new shoots. The individual flowers are yellowish green to reddish in colour, each with five petals and sepals.[4][6] The sepals are cup-shaped, lobed and united while the petals are valvate (i.e. they meet at the edges without overlapping), white and hairy towards the inside.[5][8][9] They appear from mid-April in the south of its range to July in the north. A. altissima is dioecious, with male and female flowers being borne on different individuals. Male trees produce three to four times as many flowers as the females, making the male flowers more conspicuous. Furthermore, the male plants emit a foul-smelling odour while flowering to attract pollinating insects. Female flowers contain ten (or rarely five through abortion) sterile stamens (stamenoides) with heart-shaped anthers. The pistil is made up of five free carpels (i.e. they are not fused), each containing a single ovule. Their styles are united and slender with star-shaped stigmas.[5][8] The male flowers are similar in appearance, but they of course lack a pistil and the stamens do function, each being topped with a globular anther and a glandular green disc.[5] The seeds borne on the female trees are 5 mm in diameter and each is encapsulated in a samara that is 2.5 cm long (1 in) and 1 cm (0.39 in) broad, appearing July though August, but can persist on the tree until the next spring. The samara is large and twisted at the tips, making it spin as it falls, assisting wind dispersal,[4][6] and aiding buoyancy for long-distance dispersal through hydrochory.[10] The females can produce huge amounts of seeds, normally around 30,000 per kilogram (14,000/lb) of tree,[4] and fecundity can be estimated non-destructively through measurements of dbh.[10]",
			"color": "dark|0.25117 sea|0.25117 green|0.25117 olive|0.15388 drab|0.15388 powder|0.050878 blue|0.050878 gainsboro|0.045042 light|0.042263 gray|0.042263 light|0.042263 grey|0.042263 honeydew|0.034562 mint|0.029585 cream|0.029585 white|0.027914 smoke|0.027914 light|0.027816 blue|0.027816 azure|0.027226 beige|0.026986 light|0.026404 golden|0.026404 rod|0.026404 yellow|0.026404 alice|0.024008 blue|0.024008 floral|0.021333 white|0.021333 white|0.020154 silver|0.019443 snow|0.019352 light|0.019002 cyan|0.019002 ghost|0.017673 white|0.017673 sea|0.017531 shell|0.017531 ivory|0.016823 light|0.015162 yellow|0.015162 light|0.0095072 steel|0.0095072 blue|0.0095072 linen|0.0088339  "
		}
	}
}
