{
	"add": {
		"doc": {
			"id": "35a1938ff24f5f009a5f5a25f2df5cbe05718ccc30e23816f02009d7cc9009cc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Aeroflot_Sukhoi_Superjet_100-95_RA-89002_SVO_2012-4-6.png/220px-Aeroflot_Sukhoi_Superjet_100-95_RA-89002_SVO_2012-4-6.png",
				"previous": "In March 2007 (2007-03), Aeroflot signed a memorandum of understanding with Airbus for the acquisition of 22 Airbus A350XWBs,[98] and ten Airbus A330-200s.[85][99] The transaction for the A350XWBs was formalised late that year in a deal worth US$3.1 billion.[100] The handover of the first A350XWB was due to take place in 2015.[nb 2] A contract for the acquisition of 22 Dreamliners was signed in June 2007 (2007-06),[102] reportedly consisting of Boeing 787-8s with deliveries starting in 2014;[103] in September the same year, Boeing officially announced that Aeroflot placed an order for these aircraft in a deal worth US$3.6 billion.[104] The A330 order was split into five A330-200s and five A330-300s, scheduled to arrive on an operating lease starting in late 2008. Despite these aircraft having been initially aimed at providing interim capacity ahead of the arrival of both the Airbus A350s and the Boeing 787s the company had previously ordered, the type has been gradually incorporated into the fleet on a long-term basis. The first of these machines in entering the fleet in late 2008 was an Airbus A330-200, and was initially put into service on the Moscow–St. Petersburg route for testing purposes.[105]",
				"after": "In May 2007 (2007-05), Finnair announced the sale of its last two self-owned MD-11s to Aeroflot which are thus to become part of the Russian airline cargo fleet in 2008 and 2009.[106] On 31 December 2007, Aeroflot retired the last Tupolev Tu-134 after 40 years in service;[107] the last flight flew the Kaliningrad–Moscow route.[108] Aeroflot was forced to withdraw these aircraft from service due to noise restrictions. Fourteen airplanes comprised the type's fleet by that time; they were offered for sale to the sister companies.[109] The retirement of the last Tupolev Tu-154 occurred on 14 January 2010, after 40 years of service; the last flight the type operated was the Yekaterinburg–Moscow, taking place on 31 December 2009.[110]",
			"color": "light|0.47988 steel|0.47988 blue|0.47988 silver|0.18323 dark|0.10719 gray|0.10719 dark|0.10719 grey|0.10719 light|0.041551 gray|0.041551 light|0.041551 grey|0.041551 gray|0.031745 grey|0.031745 light|0.030209 slate|0.030209 gray|0.030209 dim|0.022592 gray|0.022592 dim|0.022592 grey|0.022592 black|0.022206 gainsboro|0.016957 slate|0.016205 gray|0.016205 lavender|0.0069141  "
		}
	}
}
