{
	"add": {
		"doc": {
			"id": "35c12b228c95f0cb20833e3af5a278a38460ed4c06b6760e78b98cb044624cb6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/River_Parrett_north_of_Petherton_Bridge.jpg/220px-River_Parrett_north_of_Petherton_Bridge.jpg",
			"previous": [],
				"after": "The River Parrett, the Bristol Channel and the Severn Estuary are believed to have been used for riverine bulk transportation of people and supplies in Somerset under Roman and later Anglo-Saxon and Norman occupation.[30] Roman Somerset, which lasted for over 250 years until around the beginning of the 5th century,[31] had various settlements, including Bath (Aquae Sulis), Ilchester (Lindinis) and lead mines at Charterhouse;[32] and four roads surrounding the Somerset Levels. There is evidence of two Roman ports on the Parrett. The port at Combwich, on the west bank, was ill-recorded before its destruction by quarrying and erosion. The other at Crandon Bridge on the east bank near where the current King's Sedgemoor Drain enters the Parrett,[33][34] was in use between the first and the fourth centuries.[35] Evidence of an extensive site with storehouses was found in the mid-1970s, during motorway construction works.[33] The Crandon Bridge site may have been linked by a probable Roman road over the Polden Hills to the Fosse Way, at Ilchester.[33][35][36] Ilchester, the largest Roman town in Somerset, was a port with large granaries, sited where the Fosse Way crossed the Ilchester Yeo by means of a paved ford.[37] The Yeo was navigable by small craft all the way to the Parrett allowing military supplies to be brought by boat directly to Ilchester; however, disembarkation at Crandon Bridge and use of the Polden Hills roadway allowed more rapid movement to Ilchester. The Yeo may already have been straightened and canalised before Roman occupation.[36]",
			"color": "dim|0.12718 gray|0.12718 dim|0.12718 grey|0.12718 light|0.11827 golden|0.11827 rod|0.11827 yellow|0.11827 lemon|0.10242 chiffon|0.10242 pale|0.093549 golden|0.093549 rod|0.093549 wheat|0.070645 slate|0.068331 gray|0.068331 light|0.040797 yellow|0.040797 beige|0.040512 corn|0.039088 silk|0.039088 blanched|0.038272 almond|0.038272 light|0.037989 slate|0.037989 gray|0.037989 gray|0.035666 grey|0.035666 papaya|0.032076 whip|0.032076 antique|0.031546 white|0.031546 dark|0.016293 gray|0.016293 dark|0.016293 grey|0.016293 bisque|0.015406 dark|0.011686 slate|0.011686 gray|0.011686 dark|0.01044 khaki|0.01044 old|0.0097967 lace|0.0097967 tan|0.0091252  "
		}
	}
}
