{
	"add": {
		"doc": {
			"id": "35c82c38dbc05aaaf3fd18fef78e32a9f72c5bd0e42de6e11befbee309da0bbe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Charles_De_Gaulle_%28R91%29_underway_2009.jpg/220px-Charles_De_Gaulle_%28R91%29_underway_2009.jpg",
				"previous": "1 STOBAR carrier: Liaoning was originally built as the 57,000 tonne Soviet Kuznetsov-class carrier Varyag[42] and was later purchased as a stripped hulk by China in 1998 on the pretext of use as a floating casino, then partially rebuilt and towed to China for completion.[43][44] The Liaoning was commissioned on 25 September 2012, and began service for testing and training.[45] On 24 or 25 November 2012, Liaoning successfully launched and recovered several Shenyang J-15 jet fighter aircraft.[46][47][48] She is classified as a training ship, intended to allow the Navy to practice with carrier usage. On 26 December 2012, the People's Daily reported that it will take 4 to 5 years for Liaoning to reach full capacity, mainly due to training and coordination which will take significant amount of time for Chinese PLA Navy to complete as this is the first aircraft carrier in their possession.[49] As it is a training ship, Liaoning is not assigned to any of China's operation fleets.[50]",
				"after": "1 CATOBAR carrier: Charles de Gaulle (R91) is a 42,000 tonne nuclear-powered aircraft carrier, commissioned in 2001 and is the flagship of the French Navy (Marine Nationale). The ship carries a complement of Dassault-Breguet Super Étendard, Dassault Rafale M and E‑2C Hawkeye aircraft, EC725 Caracal and AS532 Cougar helicopter for combat search and rescue, as well as modern electronics and Aster missiles. It is a CATOBAR-type carrier that uses two 75 m C13‑3 steam catapults of a shorter version of the catapult system installed on the U.S. Nimitz class carriers, one catapult at the bow and one across the front of the landing area.[51]",
			"color": "dim|0.35727 gray|0.35727 dim|0.35727 grey|0.35727 gray|0.24799 grey|0.24799 dark|0.22326 gray|0.22326 dark|0.22326 grey|0.22326 black|0.12634 silver|0.038468 light|0.0047316 gray|0.0047316 light|0.0047316 grey|0.0047316  "
		}
	}
}
