{
	"add": {
		"doc": {
			"id": "35f382b10bcda7987d40fac864b61996a31ba3587811e7d8218173d3504c22c3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Sunny_Side_Asylum.jpg/200px-Sunny_Side_Asylum.jpg",
				"previous": "Evaluating Mountfort's works today, one has to avoid judging them against a background of similar designs in Europe. In the 1860s, New Zealand was a developing country, where materials and resources freely available in Europe were conspicuous by their absence. When available they were often of inferior quality, as Mountfort discovered with the unseasoned wood in his first disastrous project. His first buildings in his new homeland were often too tall, or steeply pitched, failing to take account of the non-European climate and landscape. However, he soon adapted, and developed his skill in working with crude and unrefined materials.[11]",
				"after": "Christchurch and its surrounding areas are unique in New Zealand for their particular style of Gothic architecture, something that can be directly attributed to Benjamin Mountfort. While Mountfort did accept small private domestic commissions, he is today better known for the designs executed for public, civic bodies, and the church. His monumental Gothic stone civic buildings in Christchurch, which would not be out of place in Oxford or Cambridge, are an amazing achievement over adversity of materials. His hallmark wooden Gothic churches today epitomise the 19th-century province of Canterbury. They are accepted, and indeed appear as part of the landscape. In this way, Benjamin Mountfort's achievement was to make his favoured style of architecture synonymous with the identity of the province of Canterbury.[28] Following his death, one of his seven children, Cyril, continued to work in his father's Gothic style well into the 20th century.[11] Cyril Mountfort was responsible for the church of St Luke's in the City, which was an unexecuted design of his father's.[42] In this way, and through the daily public use of his many buildings, Mountfort's legacy lives on. He ranks today with his contemporary R A Lawson as one of New Zealand's greatest 19th century architects.[4]",
			"color": "dim|0.31562 gray|0.31562 dim|0.31562 grey|0.31562 gray|0.25483 grey|0.25483 dark|0.19603 gray|0.19603 dark|0.19603 grey|0.19603 silver|0.07918 black|0.054392 slate|0.034847 gray|0.034847 light|0.03326 gray|0.03326 light|0.03326 grey|0.03326 gainsboro|0.018691 light|0.006797 slate|0.006797 gray|0.006797  "
		}
	}
}
