{
	"add": {
		"doc": {
			"id": "35f4f0969ceeeae389ec01e8435af88bdb42dcc54397f13d9e459c83cc803a76",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/MINISTRO_CATERIANO_SOSTUVO_REUNIONES_CON_AUTORIDADES_DE_DEFENSA_DE_ITALIA_%2813938033560%29.jpg/220px-MINISTRO_CATERIANO_SOSTUVO_REUNIONES_CON_AUTORIDADES_DE_DEFENSA_DE_ITALIA_%2813938033560%29.jpg",
				"previous": "By 2005, the U.S. Army had identified the need to replace its aging C-23 Sherpa lifter. In lieu of adequate fixed-wing airlift availability, the CH-47 helicopter fleet was being worked hard on the \"last tactical mile\" to supply forward-placed troops; thus the U.S. Army sought the C-27J for its direct support capabilities, and to reduce demands on the CH-47 fleet.[4] In 2006, LMATTS was dissolved when Lockheed Martin offered the C-130J in 2006 as a contender in the same U.S. Army and U.S. Air Force Joint Cargo Aircraft (JCA) competition in which the C-27J was competing.[5] Alenia Aeronautica then paired with L-3 Communications, forming the Global Military Aircraft Systems (GMAS) joint venture to market the C-27J;[6] Boeing also joined GMAS.[7]",
				"after": "GMAS bid the C-27J in the JCA competition against Raytheon and EADS North America's C-295 to replace existing Short C-23 Sherpa, Beechcraft C-12 Huron and Fairchild C-26 Metroliners in the Army National Guard, and as a substitute tactical airlifter for Air National Guard groups or wings losing C-130s to retirement or Base Realignment and Closures.[8][9] By November 2006, the C-27J completed the U.S. Department of Defense's Early User Survey evaluations, having flown a total of 26 hours and surpassed all requirements. GMAS also announced that the C-27J will be assembled at a facility at Cecil Field, Duval County, Florida.[10] The JCA's final selection was expected in March 2007, however it was postponed until 13 June 2007, when the Pentagon announced the award of a US$2.04 billion contract for 78 C-27Js, including training and support, to GMAS.[9][11]",
			"color": "black|0.19729 dim|0.16742 gray|0.16742 dim|0.16742 grey|0.16742 dark|0.15168 gray|0.15168 dark|0.15168 grey|0.15168 gray|0.13644 grey|0.13644 silver|0.1078 light|0.071819 gray|0.071819 light|0.071819 grey|0.071819 gainsboro|0.053465 steel|0.020216 blue|0.020216 linen|0.011561 light|0.011368 slate|0.011368 gray|0.011368 slate|0.011253 gray|0.011253 white|0.0069063 smoke|0.0069063  "
		}
	}
}
