{
	"add": {
		"doc": {
			"id": "3601b5c00483bc491e6cab48ff2b4da63c5b67bc18d9c9e0616628975f5103b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Kahler-Krempling-Paxillus-involutus.jpg/220px-Kahler-Krempling-Paxillus-involutus.jpg",
				"previous": "The presence of Paxillus involutus is related to much reduced numbers of bacteria associated with the roots of Pinus sylvestris. Instead bacteria are found on the external mycelium.[39] The types of bacteria change as well; a Finnish study published in 1997 found that bacterial communities under P. sylvestris without mycorrhizae metabolised organic and amino acids, while communities among P. involutus metabolised the sugar fructose.[40] Paxillus involutus benefits from the presence of some species of bacteria in the soil it grows in. As the fungus grows it excretes polyphenols, waste products that are toxic to itself and impede its growth, but these compounds are metabolised by some bacteria, resulting in increased fungal growth. Bacteria also produce certain compounds such as citric and malic acid, which stimulate P. involutus.[41]",
				"after": "Highly abundant,[29] the brown roll-rim is found across the Northern Hemisphere, Europe and Asia, with records from India,[42] China,[43] Japan, Iran,[44] and Turkey's eastern Anatolia.[45] It is equally widely distributed across northern North America,[28] extending north to Alaska, where it has been collected from tundra near Coldfoot in the interior of the state.[46] In southwestern Greenland, P. involutus has been recorded under the birch species Betula nana, B. pubescens and B. glandulosa.[47] The mushroom is more common in coniferous woods in Europe, but is also closely associated with birch (Betula pendula). Within woodland, it prefers wet places or boggy ground, and avoids calcareous (chalky) soils. It has been noted to grow alongside Boletus badius in Europe,[22] and Leccinum scabrum and Lactarius plumbeus in the Pacific Northwest region of North America.[48] There it is found in both deciduous and coniferous woodland, commonly under plantings of white birch (Betula papyrifera) in urban areas.[28] It is one of a small number of fungal species which thrive in Pinus radiata plantations planted outside their natural range.[49] A study of polluted Scots pine forest around Oulu in northern Finland found that P. involutus became more abundant in more polluted areas while other species declined. Emissions from pulp mills, fertiliser, heating and traffic were responsible for the pollution, which was measured by sulfur levels in the pine needles.[50]",
			"color": "tan|0.24637 black|0.18199 burly|0.16573 wood|0.16573 dark|0.078449 olive|0.078449 green|0.078449 wheat|0.035649 antique|0.022927 white|0.022927 olive|0.019501 drab|0.019501 dark|0.015771 gray|0.015771 dark|0.015771 grey|0.015771 bisque|0.015259 silver|0.015254 peach|0.014055 puff|0.014055 beige|0.013905 blanched|0.01361 almond|0.01361 papaya|0.013237 whip|0.013237 gray|0.010794 grey|0.010794 light|0.010063 gray|0.010063 light|0.010063 grey|0.010063 navajo|0.0099817 white|0.0099817 old|0.009889 lace|0.009889 linen|0.0097845 dim|0.0095291 gray|0.0095291 dim|0.0095291 grey|0.0095291 corn|0.0087227 silk|0.0087227 moccasin|0.008394  "
		}
	}
}
