{
	"add": {
		"doc": {
			"id": "3616df15982c1264052297d1ddbb5f0ba0a16f26aaf0b4b301ce057f36e6fe62",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Wideroe-tossoj-lyngsalpane.jpg/300px-Wideroe-tossoj-lyngsalpane.jpg",
				"previous": "In 1951, the company replaced its Avro Anson V aerial photography plane with four Airspeed Oxford from the Royal Norwegian Air Force. Starting 21 May 1951, the company started its first own scheduled service in Northern Norway, from Narvik via Svolvær to Bodø. In 1952, the company established itself at Trondheim Airport, Lade with a Seabee taxi- and ambulance plane as well as school activity. In 1952, the Northern Norway-route was expanded to also serve Gravdal. The following year, a de Havilland Canada DHC-2 Beaver was bought for use in Finnmark. The company chose to differentiate, and started production of emergency rafts, refrigerated garages in aluminium and thermo elements for the industry. In 1954, the company received a subcontract from Scandinavian Airlines System (SAS), the successor of DNL, to operate a seaplane route from Tromsø via Alta, Hammerfest and Kirkenes to Vadsø. For this route, the company bought its first de Havilland Canada DHC-3 Otter. That year the company had 21 mechanics in Oslo and 14 in Tromsø, and signed a contract to service the Air Force' Norseman aircraft.[10]",
				"after": "In 1956, the company took into use two Lockheed 12As for aerial photography. One of these was that year used in Liberia and Syria. The same year, the company took over SAS' last Junkers Ju-52 and put it into service on the sea route Bodø – Harstad – Tromsø, and thus Widerøe operated all of SAS' sea routes. The next year, SAS granted a loan so the number of Otters could be increased to four, replacing the Ju-52. From 1 July 1958, the company changed its name back to just Widerøe's Flyveselskap A/S. That year, both a Cessna 170 and a Cornell crashed, killing five people between them. The company also took over SAS' aviation school needs at Fornebu. For aerial photography in Svalbard, the company bought a Douglas RB-26C Invader. To purchase the Air Force' last nine Norseman planes in 1959 for NOK  the company cooperated with Solbergfly and bough five for NOK 125,000. This proved to ambitious, and two were sold to Aero Sahara. In 1960, the first land airports in Finnmark were opened, and SAS' demand for sea routes was reduced. Widerøe retired all Norseman planes from service, and were left with only Otters.[11]",
			"color": "tan|0.19846 gray|0.14776 grey|0.14776 dark|0.1393 gray|0.1393 dark|0.1393 grey|0.1393 dim|0.13463 gray|0.13463 dim|0.13463 grey|0.13463 slate|0.097916 gray|0.097916 wheat|0.076158 silver|0.041333 light|0.034638 slate|0.034638 gray|0.034638 bisque|0.022135 dark|0.021639 slate|0.021639 gray|0.021639 antique|0.01849 white|0.01849 blanched|0.018233 almond|0.018233  "
		}
	}
}
