{
	"add": {
		"doc": {
			"id": "36176d3014b70d4f434fd77c750afff8b1ca9dfaa866aeee6e146f0600712309",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Jimi_Hendrix_1967_uncropped.jpg/220px-Jimi_Hendrix_1967_uncropped.jpg",
				"previous": "The origin of the term \"heavy metal\" in a musical context is uncertain. The phrase has been used for centuries in chemistry and metallurgy, where the periodic table organizes elements of both light and heavy metals (e.g., uranium). An early use of the term in modern popular culture was by countercultural writer William S. Burroughs. His 1962 novel The Soft Machine includes a character known as \"Uranian Willy, the Heavy Metal Kid\". Burroughs's next novel, Nova Express (1964), develops the theme, using heavy metal as a metaphor for addictive drugs: \"With their diseases and orgasm drugs and their sexless parasite life forms—Heavy Metal People of Uranus wrapped in cool blue mist of vaporized bank notes—And The Insect People of Minraud with metal music\".[58] The phrase was later lifted by Sandy Pearlman, who used the term to describe The Byrds for their supposed \"aluminium style of context and effect\", particularly on their album The Notorious Byrd Brothers (1968).[59]",
				"after": "Metal historian Ian Christe describes what the components of the term mean in \"hippiespeak\": \"heavy\" is roughly synonymous with \"potent\" or \"profound,\" and \"metal\" designates a certain type of mood, grinding and weighted as with metal.[60] The word \"heavy\" in this sense was a basic element of beatnik and later countercultural slang, and references to \"heavy music\"—typically slower, more amplified variations of standard pop fare—were already common by the mid-1960s. Iron Butterfly's debut album, released in early 1968, was titled Heavy. The first use of \"heavy metal\" in a song lyric is in reference to a motorcycle in the Steppenwolf song \"Born to Be Wild\", also released that year:[61] \"I like smoke and lightning/Heavy metal thunder/Racin' with the wind/And the feelin' that I'm under.\"",
			"color": "black|0.6861 dim|0.09983 gray|0.09983 dim|0.09983 grey|0.09983 gray|0.078428 grey|0.078428 dark|0.049065 gray|0.049065 dark|0.049065 grey|0.049065 silver|0.022842 light|0.013561 gray|0.013561 light|0.013561 grey|0.013561 gainsboro|0.010743 white|0.0054066 smoke|0.0054066 sea|0.0041111 shell|0.0041111 snow|0.0038899 alice|0.0037995 blue|0.0037995 ghost|0.0037442 white|0.0037442 floral|0.0036958 white|0.0036958 mint|0.0036297 cream|0.0036297 linen|0.0034181 white|0.0033642  "
		}
	}
}
