{
	"add": {
		"doc": {
			"id": "3620e978b79ddfff65ca9076052c8460ef2ab1ab67b98acde0dbe13e4ae123d0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/2009_May_28_Scientology_Arbitration_case.png/350px-2009_May_28_Scientology_Arbitration_case.png",
			"previous": [],
				"after": "In January 2009, The Register reported on an ongoing case involving Scientology before Wikipedia's Arbitration Committee, \"According to site administrators, several pro-Scientology accounts have been editing the site using Scientology-owned computers.\"[35] The Arbitration Committee on Wikipedia is composed of a group of volunteers voted upon by other users in order to resolve conflict on the site.[36][37] During the Arbitration case, the page about Scientology was modified by members of the organization.[35][38] Scientology members had doctored entries in order to advertise for their cause.[39] The Register noted that one of the Wikipedia users admitted he had edited from computers operated by the Scientology organization, \"One of these pro-Scientology editors – who once used the handle 'COFS' – has admitted as much. And he vows to continue editing Scientology articles from Scientology computers.\"[35] The Register quoted the \"COFS\" user as saying, \"I am not going to leave voluntarily and I will continue to use a) my own computer, b) public computers, c) my wireless laptop, d) computers in the Church of Scientology and any station I please\".[35] The Guardian cited The Register, and noted, \"The technology news website The Register alleges the church has an organised operation to challenge internet criticism.\"[40]",
			"color": "light|0.093013 steel|0.093013 blue|0.093013 corn|0.079916 flower|0.079916 blue|0.079916 alice|0.064055 blue|0.064055 ghost|0.06238 white|0.06238 white|0.059611 smoke|0.059611 snow|0.05635 white|0.055845 azure|0.055357 mint|0.054221 cream|0.054221 sea|0.053192 shell|0.053192 floral|0.051729 white|0.051729 lavender|0.051405 lavender|0.049533 blush|0.049533 gray|0.049331 grey|0.049331 dim|0.048536 gray|0.048536 dim|0.048536 grey|0.048536 dark|0.032957 gray|0.032957 dark|0.032957 grey|0.032957 black|0.029038 silver|0.017685 light|0.011806 gray|0.011806 light|0.011806 grey|0.011806 gainsboro|0.011479 ivory|0.007236 royal|0.0040167 blue|0.0040167  "
		}
	}
}
