{
	"add": {
		"doc": {
			"id": "3622f0a8cf283ae564b37452709ff5dcbee78ccae083bfaf01785721bc6cfffc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Poole_railway_station_2005-07-16_08.jpg/220px-Poole_railway_station_2005-07-16_08.jpg",
				"previous": "Most local bus services are run by More Bus who are based at the town's bus station and have served Poole since 1983.[124] More Bus operate networks across Poole, Bournemouth, Christchurch and Salisbury, in addition to operations on the Isle of Purbeck and the New Forest.[124] Other services are run by Bournemouth-based Yellow Buses and Damory Coaches.[125] Poole is connected to towns and villages along the Jurassic Coast by the First X53 service, which runs along a route of 142 kilometres (88 mi) to Weymouth, Bridport, Lyme Regis, Seaton and Exeter.[125] Poole is also a calling point for National Express Coaches, which have frequent departures to London Victoria Coach Station. There are also direct services to the Midlands, the North of England and to Heathrow and Gatwick airports.[126]",
				"after": "Poole has four railway stations on the South Western Main Line from London Waterloo to Weymouth. From east to west these are Branksome near the border with Bournemouth, Parkstone, Poole railway station in the town centre and Hamworthy. Services are operated by South West Trains and consist of up to three trains an hour (fast, semi-fast and stopping services) to and from London, and twice an hour to and from Weymouth.[127] Plans for a £50 million redevelopment of Poole railway station have stalled since 2006 due to contractual issues between land owners Network Rail and developers the Kier Group.[128]",
			"color": "black|0.58883 dim|0.11799 gray|0.11799 dim|0.11799 grey|0.11799 gray|0.067597 grey|0.067597 dark|0.030356 slate|0.030356 gray|0.030356 dark|0.029693 gray|0.029693 dark|0.029693 grey|0.029693 slate|0.019545 gray|0.019545 light|0.01751 slate|0.01751 gray|0.01751 dark|0.01291 olive|0.01291 green|0.01291 silver|0.011462 light|0.0080789 gray|0.0080789 light|0.0080789 grey|0.0080789  "
		}
	}
}
