{
	"add": {
		"doc": {
			"id": "3626bc85a46562f0630a8769d14a1e4f507c03340f0820f64834c616b6374a54",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Karen_Carpenter.jpg/170px-Karen_Carpenter.jpg",
			"previous": [],
				"after": "Hugh McIntyre from Forbes considered \"Ghosttown\" as a favorite from the album.[23] Dean Piper from The Daily Telegraph considered the song as Madonna's best chance at achieving a radio hit from the album, comparing the composition to the singer's previous studio album, Ray of Light (1998).[15] This view was shared by Gregory Ellwood of HitFix who considered it to be Madonna's \"most commercially friendly ballad\" of the 2010s,[13] while Jon Lisi from PopMatters called it \"arguably the most haunting love song of [Madonna's] career.[24] The Dallas Morning News‍ '​ Hunter Hauk complimented Madonna's \"natural\" vocal delivery in spite of the vocal effects added, also considering it to be a probable radio hit for Madonna.[25] Daryl Deino from The Inquisitr also praised Madonna's vocals in \"Ghosttown\", along with \"Devil Pray\" and \"Living for Love\".[26] Bernard Zuel from The Sydney Morning Herald found Madonna to be reliving her older ballads like \"Live to Tell\", and found the electronic arrangements to be complimenting her vocals.[27] Amy Pettifer from The Quietus observed that the chorus could have been sung by any other singer, but Madonna, \"despite being a weaker singer, licks it in the emotional truth stakes, particularly on this more melancholy end of the spectrum. Singing with a tremulous tonality, her voice hangs in uncluttered space, the lyrics positioning her as the dark-glowing, guiding light. A brilliant, desperate and rousing anthem.\"[17] Along with comparing Madonna's vocals in Ghosttown to that of Karen Carpenter, Farber also observed that it was her most \"rich sounding\" voice since her Evita soundtrack, comparable to \"Live to Tell\" and also \"Crazy for You\".[28] Digital Spy's Lewis Corner rated it four out of five stars, noting that Madonna sounded \"significantly more subdued and reflective compared to her handbag bangers of recent years, but by doing so it makes the biggest possible impact.\"[29]",
			"color": " "
		}
	}
}
