{
	"add": {
		"doc": {
			"id": "362ba4d1bc7cbf9841b2969cbea8a0f7196eca9eade0986976bceeb2d9ae24a9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Floatation_Screen_Patent.png/220px-Floatation_Screen_Patent.png",
			"previous": [],
				"after": "There were several variants of the Tetrarch design. The first was the Light Tank Mk VIII, Vickers-Armstrong's proposed successor to the Tetrarch.[5] The Mark VIII was also known as the Harry Hopkins, named after President Roosevelt's chief diplomatic advisor, and was given the General Staff design number A25 by the War Office. The Mark VIII was intended to improve upon the design of the Tetrarch in a number of areas. It had thicker armour than the Tetrarch, with the front hull and turret armour increased to a thickness of 38 millimetres (1.5 in) and the side armour to 17 millimetres (0.67 in), and the turret and hull given more sloped surfaces to help deflect shells fired at the tank.[61] The dimensions of the Tetrarch were also changed; the Mark VIII was longer by 6 inches (0.15 m), wider by 1 foot 3 inches (0.38 m) and heavier. The new tank was no longer air-portable, as it was too heavy to be carried by a Hamilcar. The 12-cylinder engine of the Tetrarch was fitted to the Mark VIII, although the increased weight meant that its maximum speed decreased to 30 miles per hour (48 km/h); its armament also remained the same as that of the Tetrarch.[61] The War Office authorised the construction of three prototype models in April 1941. The new design was considered a success, and the Tank Board of the War Office ordered 1,000 to be constructed in September. However, problems were encountered with further tests of the prototypes, and a report issued in December 1942 stated that production of the Mark VIII had been delayed due to developmental problems. These problems continued to persist into 1943, when the War Office decided against using the tank in active service; approximately 100 Mark VIIIs were produced by 1945, when production ended.[62]",
			"color": " "
		}
	}
}
