{
	"add": {
		"doc": {
			"id": "3633cc0568f681589f9c9b5ca842ba68b323984c85c8d2419d9087d2d7a1d883",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Femme_Pepohan_de_Formose_et_son_enfant.jpg/170px-Femme_Pepohan_de_Formose_et_son_enfant.jpg",
				"previous": "For most of their recorded history, Taiwanese aborigines have been defined by the agents of different Confucian, Christian, and Nationalist \"civilizing\" projects, with a variety of aims. Each \"civilizing\" project defined the aborigines based on the \"civilizer\"'s cultural understandings of difference and similarity, behavior, location, appearance and prior contact with other groups of people (Harrell 1996:5–20). Taxonomies imposed by colonizing forces divided the aborigines into named subgroups, referred to as \"tribes\". These divisions did not always correspond to distinctions drawn by the aborigines themselves. However, the categories have become so firmly established in government and popular discourse over time that they have become de facto distinctions, serving to shape in part today's political discourse within the Republic of China (ROC), and affecting Taiwan's policies regarding indigenous peoples.",
				"after": "The Han sailor, Chen Di, in his Record of the Eastern Seas (1603), identifies the indigenous people of Taiwan as simply \"Eastern Savages\" (東番; Dongfan), while the Dutch referred to Taiwan's original inhabitants as \"Indians\" or \"blacks\", based on their prior colonial experience in what is currently Indonesia (Teng 2004:61–5).",
			"color": "dim|0.19261 gray|0.19261 dim|0.19261 grey|0.19261 gray|0.1837 grey|0.1837 dark|0.18296 gray|0.18296 dark|0.18296 grey|0.18296 silver|0.10685 light|0.077187 gray|0.077187 light|0.077187 grey|0.077187 gainsboro|0.060208 lavender|0.028764 blush|0.028764 white|0.021413 smoke|0.021413 misty|0.019048 rose|0.019048 ghost|0.018586 white|0.018586 snow|0.01675 sea|0.015648 shell|0.015648 alice|0.014572 blue|0.014572 white|0.011988 lavender|0.011959 linen|0.010711 black|0.0096481 floral|0.00771 white|0.00771 mint|0.0050795 cream|0.0050795  "
		}
	}
}
