{
	"add": {
		"doc": {
			"id": "365a2d3ba8a2b3492eb84bc3e1dc70eae97805368fe459888900f96eaa4166f7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Wider%C3%B8e_Waco_RNF_LN-EAB_at_Ingierstrand_2.jpeg/220px-Wider%C3%B8e_Waco_RNF_LN-EAB_at_Ingierstrand_2.jpeg",
				"previous": "In 1937, the company made 44 flights along the coast of Antarctica, covering 4,000 kilometres (2,500 mi) of coast at least 50 kilometres (31 mi) inland. These flights were ordered by Lars Christensen for cartography. From July to September, the company also flew a route between Trondheim and Bodø. The base at Bogstad in Bergen was expanded, and the company was granted a monopoly on all aerial photography flights for the mapping authories. During 1938, the Bogstad workshop and Birger Hønningstad started a cooperation where Widerøe built the Hønningstad Norge-planes. The same year, a plane went to Svalbard for cartographic work, and a route was started from Trondheim via Brønnøysund, Sandnessjøen, Bodø, Narvik and Harstad to Tromsø. For three months, the route was expanded to Kirkenes via Hammerfest and Vadsø.[6]",
				"after": "Following the outbreak of World War II on 2 September 1939, all pilots were conscripted and there was a ban on civilian aviation. DNL was worried about the steady losses the company was making, and suggested liquidating the company. On 5 December 1939, DNL's shares were transferred to the other shareholders. In 1940, the company started flying ambulance flights for the military. The planes were rented from the airline while the crew were conscripted. Widerøe was also granted dispensation from the civil aviation ban to continue its school at Bogstad. Following the German invasion of Norway, many pilots and aircraft of Widerøe were flown to Mjøsa were they served as part of the defence. All planes were grounded during the occupation, and German authorities demanded that magnetos and propellers be handed in. The workshop at Bogstad was kept busy with production of ambulance sleds for the German military. In secret, the company also started building a Hønningstad C-5 Polar ambulance plane at Bogstad. The German authorities sealed the company's archives, so only people with German permission had access to aerial photos.[7]",
			"color": " "
		}
	}
}
