{
	"add": {
		"doc": {
			"id": "367039f35e890ffd1b3e52681ea196cabad7dc3b28352ab97428c143e6c1ad62",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Basire_Embarkation_of_Henry_VIII.jpg/220px-Basire_Embarkation_of_Henry_VIII.jpg",
			"previous": [],
				"after": "The \"ship portrait\" had a long history in maritime art, from medieval seals and coins to early engravings in the 15th century, and the plain side-on view of a ship under sail, often with no crew shown, was well established as the most effective way of recording the build of vessels.[6] The Anthony Roll belongs to a genre of works that was intended to serve a dual role for the king and the military leadership: as reasonably informative overviews listing details of ships or strategic areas of coastlines they could be studied to determine strengths and weaknesses, and as boastful and lively depictions of Tudor military might they could be used to flatter the king, impress courtiers and impose martial authority on foreign ambassadors. Contemporary maps, or \"plats\", were routinely decorated with detailed pictures of ships, to mark bodies of water as much as to liven up the scenes. Such maps were common at the time, and were even embellished by artists if deemed too simple or drab. The navy was expanded during King Henry's reign, and he was known to take an interest in warships, as can be seen by the epic painting Embarkation of Henry VIII at Dover which portrayed, if rather unrealistically, the ships that took the 29-year-old king to the summit meeting with Francis I at the Field of the Cloth of Gold in 1520. This painting, recently dated to around 1545, has also been suggested as a likely source of inspiration to Anthony for his illustrations.[1]",
			"color": "black|0.26148 dim|0.18876 gray|0.18876 dim|0.18876 grey|0.18876 gray|0.12509 grey|0.12509 dark|0.12104 slate|0.12104 gray|0.12104 slate|0.082641 gray|0.082641 light|0.067811 slate|0.067811 gray|0.067811 dark|0.066129 gray|0.066129 dark|0.066129 grey|0.066129 tan|0.027739 silver|0.017932 cadet|0.017366 blue|0.017366  "
		}
	}
}
