{
	"add": {
		"doc": {
			"id": "367646de799d008c9bbfbe731c65409908aa13bab478b4a5346b4dff97777569",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Bayeuxtapestrydeathofharold.jpg/220px-Bayeuxtapestrydeathofharold.jpg",
			"previous": [],
				"after": "The battle began at about 9 am on 14 October 1066 and lasted all day, but while a broad outline is known, the exact events are obscured by contradictory accounts in the sources.[51] Although the numbers on each side were probably about equal, William had both cavalry and infantry, including many archers, while Harold had only foot soldiers and few archers.[52] The English soldiers formed up as a shield wall along the ridge, and were at first so effective that William's army was thrown back with heavy casualties. Some of William's Breton troops panicked and fled, and some of the English troops appear to have pursued the fleeing Bretons. Norman cavalry then attacked and killed the pursuing troops. While the Bretons were fleeing, rumours swept the Norman forces that the duke had been killed, but William rallied his troops. Twice more the Normans made feigned withdrawals, tempting the English into pursuit, and allowing the Norman cavalry to attack them repeatedly.[53] The available sources are more confused about events in the afternoon, but it appears that the decisive event was the death of Harold, about which differing stories are told. William of Jumieges claimed that Harold was killed by the duke. The Bayeux Tapestry has been claimed to show Harold's death by an arrow to the eye, but this may be a later reworking of the tapestry to conform to 12th-century stories that Harold had died from an arrow wound to the head.[54] Other sources stated that no one knew how Harold died because the press of battle was so tight around the king that the soldiers could not see who struck the fatal blow.[55] William of Poitiers gives no details at all about Harold's death.[56]",
			"color": "antique|0.12981 white|0.12981 misty|0.09432 rose|0.09432 linen|0.079384 light|0.063666 gray|0.063666 light|0.063666 grey|0.063666 gainsboro|0.058546 old|0.053249 lace|0.053249 sea|0.046652 shell|0.046652 papaya|0.036111 whip|0.036111 black|0.036061 silver|0.03591 sienna|0.034117 floral|0.031879 white|0.031879 dark|0.028708 gray|0.028708 dark|0.028708 grey|0.028708 tan|0.022546 dim|0.021736 gray|0.021736 dim|0.021736 grey|0.021736 gray|0.021402 grey|0.021402 rosy|0.017937 brown|0.017937 white|0.017689 smoke|0.017689 blanched|0.016631 almond|0.016631 ivory|0.016256 beige|0.016179 snow|0.014148 lavender|0.01343 blush|0.01343 bisque|0.011252 peach|0.010386 puff|0.010386 corn|0.009178 silk|0.009178 burly|0.0078044 wood|0.0078044 dark|0.0062716 slate|0.0062716 gray|0.0062716 white|0.005512 wheat|0.0052019  "
		}
	}
}
