{
	"add": {
		"doc": {
			"id": "3676fdb82613a503a2735f9f87a2d800573bb178c0442ed08f8f340453553045",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Castle_Street_in_Cork_City_Centre.jpg/170px-Castle_Street_in_Cork_City_Centre.jpg",
			"previous": [],
				"after": "The retail trade in Cork city includes a mix of both modern, state of the art shopping centres and family owned local shops. Department stores cater for all budgets, with expensive boutiques for one end of the market and high street stores also available. Shopping centres can be found in many of Cork's suburbs, including Blackpool, Ballincollig, Douglas, Ballyvolane, Wilton and Mahon. Others are available in the city centre. These include the recently[when?] completed development of two large malls The Cornmarket Centre on Cornmarket Street, and new the retail street called \"Opera Lane\" off St. Patrick's Street/Academy Street. The planned Grand Parade scheme for the site of the former Capitol Cineplex has been approved by the planning authorities but for now at least financing hasn't been made available.[citation needed] Cork's main shopping street is St. Patrick's Street and is the most expensive street in the country per sq. metre after Dublin's Grafton Street. Other shopping areas in the city centre include Oliver Plunkett St. and Grand Parade. Cork is also home to some of the country's leading department stores with the foundations of shops such as Dunnes Stores and the former Roches Stores being laid in the city. Outside the city centre is Mahon Point Shopping Centre.",
			"color": "dark|0.30392 gray|0.30392 dark|0.30392 grey|0.30392 gray|0.22873 grey|0.22873 dim|0.095441 gray|0.095441 dim|0.095441 grey|0.095441 black|0.081155 silver|0.072822 light|0.035527 gray|0.035527 light|0.035527 grey|0.035527 light|0.029608 slate|0.029608 gray|0.029608 gainsboro|0.028593 slate|0.024021 gray|0.024021 dark|0.021752 slate|0.021752 gray|0.021752 rosy|0.0093727 brown|0.0093727 light|0.0080398 steel|0.0080398 blue|0.0080398 white|0.007555 smoke|0.007555 linen|0.0055056 sea|0.0043008 shell|0.0043008  "
		}
	}
}
