{
	"add": {
		"doc": {
			"id": "367bfeb6ba7872238f8957a0e9cfada02b2a607d34becb22a91b9cfe7ee0e19f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/ClementHill.jpg/220px-ClementHill.jpg",
				"previous": "The next Ashes series was held in 1897–98 with Stoddart again assembling an English team to tour Australia. The team included players such as K.S. Ranjitsinhji and George Hirst. The touring team's first match on arrival was against South Australia and Hill batted well, scoring exactly 200.[16] The First Test was played in Sydney and a minor controversy ensued when officials abandoned the first day's play due to earlier heavy rain without consulting the two captains.[17] The delay did not seem to affect the English who batted first and scored 551, including centuries by Ranjitsinhji and Archie MacLaren. The Australians were forced to follow-on after making 237. Batting again, Hill scored 96 but England managed to win the match by nine wickets.[18] The Second Test was played in Melbourne and Australia fought back, winning by an innings and 55 runs with Hill scoring 58.[19] Another innings victory in the Third Test in Adelaide saw Australia leading the series two Tests to one.[16]",
				"after": "The teams returned to Melbourne for the Fourth Test. England started the match brilliantly, reducing Australia to 6/58[20] on a pitch that assisted the bowlers.[4] Hill, aged just 20, was watching at the non-striker's end as the wickets fell. Hugh Trumble came to join him and together they began to rescue the Australian innings. When Hill reached his maiden Test century, he had scored all but 42 of his side's runs.[4] Hill played balls pitched outside leg stump particularly well and drove beautifully throughout the innings.[21] At the tea interval, Hill, feeling refreshed, mentioned to Trumble that he thought he would \"have a go at them now\". The experienced Trumble cautioned Hill, replying \"You young devil, you have to stop there. Go along as you have been doing.\"[4] Hill and Trumble made 165 runs batting together, still a record for a seventh wicket partnership in Ashes Tests.[21] Hill was 182 not out at the end of the day's play, the highest first-day innings against England in Australia, and leaving the ground was greeted by a barrage of photographers. After a rest day, Hill added only six more runs before being dismissed at last by Hearne. His innings remains the highest in Ashes Tests by a player under 21.[4] Batting for 294 minutes he gave only the one chance at dismissal.[21] The journalist and former Test player Tom Horan wrote \"Hill's innings will be talked of when the smallest boy who saw it will be white with the snows of time.\"[4] Australia won the Test by 8 wickets to recover the Ashes.[22] That summer, Hill scored 1,196 runs in 19 innings including five centuries, the first Australian to score 1,000 runs in a home season.[4]",
			"color": "light|0.15329 gray|0.15329 light|0.15329 grey|0.15329 silver|0.1511 dark|0.12455 gray|0.12455 dark|0.12455 grey|0.12455 gainsboro|0.12258 gray|0.084934 grey|0.084934 linen|0.055619 old|0.037976 lace|0.037976 sea|0.035297 shell|0.035297 white|0.034974 smoke|0.034974 floral|0.031849 white|0.031849 dim|0.030133 gray|0.030133 dim|0.030133 grey|0.030133 mint|0.023091 cream|0.023091 ivory|0.023068 antique|0.02095 white|0.02095 snow|0.020155 white|0.014585 honeydew|0.013205 beige|0.012121  "
		}
	}
}
