{
	"add": {
		"doc": {
			"id": "36986e13ecd3fb4686a4c26e94daa89598c448a6b2f8418e4399a1013db452eb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Miley_Wants_To_Play_Too%21.jpg/170px-Miley_Wants_To_Play_Too%21.jpg",
				"previous": "The second season of Hannah Montana premiered on April 23, 2007, and ran until October 12, 2008.[49] Shortly afterwards, Cyrus signed a four-album deal with Disney-owned Hollywood Records.[50] The double-disc record Hannah Montana 2: Meet Miley Cyrus was released on June 26, 2007;[51] the first disc served as the soundtrack to the second season of Hannah Montana, while the second acted as Cyrus's debut studio album. It debuted at number one on the Billboard 200 with first-week sales of 326,000 copies.[52] It was later certified triple-platinum by the Recording Industry Association of America.[53] The project spawned Cyrus's debut single as herself, \"See You Again\", which became her first Top 10 hit on the Billboard Hot 100 chart.[54] It was eventually certified Platinum in the country, making it her first single to be RIAA certified.[55] The track also had success in countries such as Australia and Canada, where it also peaked inside of the Top 10.[56][57] The follow-up single \"Start All Over\" was released in early 2008; it failed to match the success of its predecessor, debuting and peaking at number 68 on the Hot 100.[58][59] Numerous songs from the Hannah Montana portion of the album charted worldwide following its release.[60]",
				"after": "During the fall of 2007, the Best of Both Worlds Tour was launched to promote the joint album. With the Jonas Brothers, Aly & AJ, and Everlife as her opening acts, Cyrus toured from October 17, 2007, to January 31, 2008, with stops in the United States and Canada.[61] Tickets sold out in minutes and were scalped for up to $2,500 and an average of $214, well above their $26–$65 face value.[62] A Ticketmaster official commented that \"there [hadn't] been a demand of this level or intensity since The Beatles or Elvis.\"[63] Upon the conclusion of the tour in January 2008, Walt Disney Pictures released Hannah Montana & Miley Cyrus: Best of Both Worlds Concert, a 3D concert film of the tour, on February 1, 2008, for what was expected to be a one-week run. The film earned over $31 million[64] at the box office and an average of $42,000 per theater, twice the expected total, convincing Disney executives to extend the release for an indefinite run.[65] The film's soundtrack was released by Walt Disney Records and Hollywood Records on April 15, 2008.[66]",
			"color": "black|0.071659 rosy|0.061667 brown|0.061667 burly|0.057682 wood|0.057682 tan|0.044743 antique|0.044555 white|0.044555 light|0.044229 gray|0.044229 light|0.044229 grey|0.044229 dark|0.044106 salmon|0.044106 silver|0.041212 peach|0.039295 puff|0.039295 misty|0.038331 rose|0.038331 gainsboro|0.032192 linen|0.028696 dim|0.028125 gray|0.028125 dim|0.028125 grey|0.028125 dark|0.026426 gray|0.026426 dark|0.026426 grey|0.026426 indian|0.023348 red|0.023348 sea|0.022313 shell|0.022313 gray|0.02133 grey|0.02133 light|0.021077 coral|0.021077 papaya|0.019028 whip|0.019028 old|0.018889 lace|0.018889 floral|0.018881 white|0.018881 bisque|0.018068 blanched|0.016827 almond|0.016827 sienna|0.015846 white|0.015701 smoke|0.015701 snow|0.014855 pink|0.013625  "
		}
	}
}
