{
	"add": {
		"doc": {
			"id": "369c9b4dac630b95dbb1e7a83c4ea401fed86b29fa92aa84c82be2624e06f384",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Amazona_vittata_range.PNG/300px-Amazona_vittata_range.PNG",
				"previous": "At first, human activity had not posed a significant threat to the Puerto Rican amazon. The Taíno hunted the parrot but without much effect on its population.[21] In the past two hundred years, however, many factors have led to a drastic decrease in the birds' numbers: agricultural development, the construction of roads, hydroelectric development, and the adoption of young chicks as pets.[22] Especially during the latter half of the 19th century, most of Puerto Rico's virgin forests, a historical habitat of the species, were cleared for agricultural development, primarily for the production of sugar, cotton, corn and rice. The amazon quickly came to rely on these crops as its main food source and so became seen as a pest; local farmers repelled or hunted the bird if possible.[23] As agriculture expanded, the amazon's habitat disappeared further and its population declined.",
				"after": "The species was historically found in mature or old-growth forests in Puerto Rico at all elevations, and in holes, cliffs, and other diverse habitats at lower elevations. The species could be found at medium elevations in the Guajataca State Forest (until 1910) and the Rio Abajo State Forest (until the 1920s), and at high elevations in the Carite State Forest (until the 1930s).[24] Accounts from the early 1900s describe the parrots traveling away from the Luquillo forest and the Sierra de Cayey towards the main island's coast to find food.[14] At the same time, the species was extirpated from Puerto Rico's smaller islands—Culebra, Vieques and Mona—and became restricted to five locations: two in karst-limestone areas, two in high montane rainforests and one in mangrove forest at the foot of the El Yunque National Forest. One of these karst regions, located in the northwestern part of Puerto Rico, was identified as a haven for the species. In particular, a region named Valle de las Cotorras (Valley of the Parrots), located between San Sebastián and Morovis, was home to a sizable population. Some amazons survived in small pockets of degraded forest but these proved insufficient to support large colonies. Eventually their natural habitat was reduced to the Cordillera Central and undisturbed forest areas, and by 1940 they were only to be found in primary forest at the Luquillo Mountains in El Yunque National Forest. The species is currently found at elevations between 396 and 823 m (1,299 and 2,700 ft). Since the species requires mature forests with open-cavity trees for reproduction, it does not occur in dwarf and secondary forests.",
			"color": "red|0.099679 white|0.084875 smoke|0.084875 white|0.084634 snow|0.084621 mint|0.084556 cream|0.084556 sea|0.084288 shell|0.084288 ghost|0.084279 white|0.084279 floral|0.083994 white|0.083994 azure|0.08332 alice|0.082248 blue|0.082248 lavender|0.07839 blush|0.07839 dodger|0.011869 blue|0.011869 green|0.011122 forest|0.010932 green|0.010932 ivory|0.0060888 crimson|0.0045193 slate|0.0034423 blue|0.0034423 dark|0.0030411 sea|0.0030411 green|0.0030411 linen|0.0029485  "
		}
	}
}
