{
	"add": {
		"doc": {
			"id": "36a6f179e9caa2b77d4656e7e26b722650960ed4395b6f57c0aa311a198346df",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Beagles_Puppies.png/220px-Beagles_Puppies.png",
				"previous": "Beagles are excellent with children and this is one of the reasons they have become popular family pets, but they are pack animals, and can be prone to separation anxiety.[43] Not all Beagles will howl, but most will bark when confronted with strange situations, and some will bay (also referred to as \"speaking\", \"giving tongue\", or \"opening\") when they catch the scent of potential quarry.[44] They also generally get along well with other dogs. They are not too demanding with regard to exercise; their inbred stamina means they do not easily tire when exercised, but they also do not need to be worked to exhaustion before they will rest. Regular exercise helps ward off the weight gain to which the breed is prone.[45]",
			"after": [
				"The typical longevity of Beagles is 12–15 years,[46] which is a common lifespan for dogs of their size.[47]",
				"Beagles may be prone to epilepsy, but this can often be controlled with medication. Hypothyroidism and a number of types of dwarfism occur in Beagles. Two conditions in particular are unique to the breed: \"Funny Puppy\", in which the puppy is slow to develop and eventually develops weak legs, a crooked back and although normally healthy, is prone to a range of illnesses;[48] Hip dysplasia, common in Harriers and in some larger breeds, is rarely considered a problem in Beagles.[49] Beagles are considered a chondrodystrophic breed, meaning that they are prone to types of disk diseases.[50]"
			],
			"color": "black|0.30047 silver|0.14367 dark|0.12819 gray|0.12819 dark|0.12819 grey|0.12819 light|0.10068 gray|0.10068 light|0.10068 grey|0.10068 rosy|0.067514 brown|0.067514 gainsboro|0.05822 misty|0.047504 rose|0.047504 gray|0.046686 grey|0.046686 dim|0.02539 gray|0.02539 dim|0.02539 grey|0.02539 antique|0.023926 white|0.023926 linen|0.022608 sea|0.009546 shell|0.009546 old|0.0065547 lace|0.0065547 lavender|0.0054532 blush|0.0054532  "
		}
	}
}
