{
	"add": {
		"doc": {
			"id": "36b0f1f1b13e46e4a491e9888cd55344081d595d974f9e16052ed01df87c6988",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Beckham_zidane.jpg/170px-Beckham_zidane.jpg",
				"previous": "As the summer 2003 transfer window approached, Manchester United appeared keen to sell Beckham to Barcelona[63] and the two clubs even announced that they reached a deal for Beckham's transfer,[64] but instead he joined reigning Spanish champions Real Madrid for €35 million[65] on a four-year contract as the latest of the galáctico signings by club president Florentino Pérez. The news came as a bitter pill to the newly elected Barça president Joan Laporta, who based much of his presidential campaign precisely on signing Beckham.[66] Though announced in mid-June, the transfer was completed on 1 July 2003, making him the third Englishman to play for the club after Laurie Cunningham and Steve McManaman. Following a successful medical on 2 July, Beckham was unveiled in front of 500 accredited journalists from 25 countries at Real's basketball facility, where he was handed the famous white shirt by club legend Alfredo di Stéfano.[67] Although Beckham had worn the number seven shirt for Manchester United and England, he was unable to wear it at Madrid as it was currently assigned to club captain Raúl. He decided to wear number 23 instead, citing his admiration of basketball player Michael Jordan, who also wore the number 23 shirt, as the reason behind his decision.[68]",
				"after": "In the week before Beckham presentation, Real named Carlos Queiroz as their new head coach, meaning that Beckham got reunited with a familiar face upon arriving to Madrid since Queiroz spent the previous season as Alex Ferguson's assistant at Manchester United. In late July 2003, the club went on a tour of the Far East as part of the pre-season training, but also to cash in on Beckham's huge marketing appeal in Asia where he enjoyed tremendous following. Real's brand recognition in that part of the globe was already well established as the club made financially successful trips to Asia during previous off-seasons; however, the presence of global marketing icon such as Beckham made this particular tour a financial smash for los Merengues.[69]",
			"color": "silver|0.16556 light|0.14525 gray|0.14525 light|0.14525 grey|0.14525 dark|0.1119 gray|0.1119 dark|0.1119 grey|0.1119 lavender|0.10196 gainsboro|0.10004 gray|0.03956 grey|0.03956 thistle|0.035014 ghost|0.026363 white|0.026363 lavender|0.026203 blush|0.026203 white|0.023896 smoke|0.023896 alice|0.023885 blue|0.023885 dim|0.021098 gray|0.021098 dim|0.021098 grey|0.021098 snow|0.018897 light|0.017196 steel|0.017196 blue|0.017196 white|0.016408 dark|0.015746 olive|0.015746 green|0.015746 sea|0.015087 shell|0.015087 mint|0.011989 cream|0.011989 light|0.011867 slate|0.011867 gray|0.011867 azure|0.011415 floral|0.011349 white|0.011349 tan|0.010981 slate|0.0091045 gray|0.0091045  "
		}
	}
}
