{
	"add": {
		"doc": {
			"id": "36bdcfa55b71414e750c760b1e12d36affa93fdfbd9f531c8abe11ec558a725f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Walter_T._Varney%2C_founder_of_United_and_Continental_Airlines%2C_1921.jpg/220px-Walter_T._Varney%2C_founder_of_United_and_Continental_Airlines%2C_1921.jpg",
			"previous": [],
				"after": "Varney Speed Lines (named after one of its initial owners, Walter T. Varney, who was also a founder of United Airlines) was formed in 1934, operating airmail and passenger services in the American Southwest over a route originating from El Paso and extending through Albuquerque, Santa Fe, and Las Vegas, NM to Pueblo, CO. The airline commenced operations with the Lockheed Vega, a single-engine plane that carried four passengers. The airline later flew other Lockheed planes, including the Lockheed Model 9 Orion, the Lockheed Electra Junior, and the Lockheed Lodestar.[5][page needed] Following cancellation of all domestic airmail contracts by the Roosevelt administration in 1934, Robert F. Six learned of an opportunity to buy into the Southwest Division of Varney Speed Lines which needed money to handle its newly won Pueblo-El Paso route. Six was introduced to Louis Mueller (who would serve as Chairman of the Board of Continental until February 28, 1966). Mueller had helped found the Southwest Division of Varney in 1934 with Walter T. Varney. As an upshot of all this, Six bought into the airline with US$90,000 and became general manager on July 5, 1936. Varney was awarded a 17-cent-rate airmail contract between Pueblo and El Paso; it carried passengers as a sideline. The carrier was renamed Continental Air Lines (later changed to \"Airlines\") on July 8, 1937. Six relocated the airline's headquarters to Denver Union (later Stapleton) Airport in Denver in October 1937.[5][6][page needed] Six changed the name to \"Continental\" because he wanted the airline name to reflect his desire to have the airline fly all directions throughout the United States.[7]",
			"color": "antique|0.23693 white|0.23693 blanched|0.16025 almond|0.16025 papaya|0.14761 whip|0.14761 beige|0.1346  "
		}
	}
}
