{
	"add": {
		"doc": {
			"id": "36be63d58c2bbc1e779900dd3fb5e88a70b0b230224cc2fba9f8c0cc5000dcbd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/George_Caleb_Bingham_-_Daniel_Boone_escorting_settlers_through_the_Cumberland_Gap.jpg/220px-George_Caleb_Bingham_-_Daniel_Boone_escorting_settlers_through_the_Cumberland_Gap.jpg",
				"previous": "On September 25, 1773, Boone packed up his family and, with a group of about 50 immigrants, began the first attempt by British colonists to establish a settlement in Kentucky. Boone was still an obscure hunter and trapper at the time; the most prominent member of the expedition was William Russell, a well-known Virginian and future brother-in-law of Patrick Henry. On October 9, Boone's eldest son James and a small group of men and boys who had left the main party to retrieve supplies were attacked by a band of Delawares, Shawnees, and Cherokees. Following the Treaty of Fort Stanwix, American Indians in the region had been debating what to do about the influx of settlers. This group had decided, in the words of historian John Mack Faragher, \"to send a message of their opposition to settlement….\" James Boone and William Russell's son Henry were captured and gruesomely tortured to death. The brutality of the killings sent shock waves along the frontier, and Boone's party abandoned its expedition.[21]",
				"after": "The massacre was one of the first events in what became known as Dunmore's War, a struggle between Virginia and, primarily, Shawnees of the Ohio Country for control of what is now West Virginia and Kentucky. In the summer of 1774, Boone volunteered to travel with a companion to Kentucky to notify surveyors there about the outbreak of war. The two men journeyed more than 800 miles (1,300 km) in two months to warn those who had not already fled the region. Upon his return to Virginia, Boone helped defend colonial settlements along the Clinch River, earning a promotion to captain in the militia as well as acclaim from fellow citizens. After the brief war, which ended soon after Virginia's victory in the Battle of Point Pleasant in October 1774, the Shawnees relinquished their claims to Kentucky.[22]",
			"color": "black|0.34434 saddle|0.27836 brown|0.27836 sienna|0.11322 peru|0.098684 burly|0.052173 wood|0.052173 tan|0.025533  "
		}
	}
}
