{
	"add": {
		"doc": {
			"id": "36dbfd6aa9d0d7a8515e9bb41b993334abcba493ae31014aa6add7d89a65788b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/LindisfarneFol27rIncipitMatt.jpg/220px-LindisfarneFol27rIncipitMatt.jpg",
			"previous": [],
				"after": "The Book of Kells is one of the finest and most famous of a group of manuscripts in what is known as the Insular style, produced from the late 6th through the early 9th centuries in monasteries in Ireland, Scotland and England and in continental monasteries with Hiberno-Scottish or Anglo-Saxon foundations.[1] These manuscripts include the Cathach of St. Columba, the Ambrosiana Orosius, fragmentary Gospel in the Durham Dean and Chapter Library (all from the early 7th century), and the Book of Durrow (from the second half of the 7th century). From the early 8th century come the Durham Gospels, the Echternach Gospels, the Lindisfarne Gospels (see illustration at right), and the Lichfield Gospels. Among others, the St. Gall Gospel Book belongs to the late 8th century and the Book of Armagh (dated to 807–809) to the early 9th century.[2] Scholars place these manuscripts together based on similarities in artistic style, script, and textual traditions. The fully developed style of the ornamentation of the Book of Kells places it late in this series, either from the late 8th or early 9th century. The Book of Kells follows many of the iconographic and stylistic traditions found in these earlier manuscripts. For example, the form of the decorated letters found in the incipit pages for the Gospels is surprisingly consistent in Insular Gospels. Compare, for example, the incipit pages of the Gospel of Matthew in the Lindisfarne Gospels and in the Book of Kells, both of which feature intricate decorative knot work patterns inside the outlines formed by the enlarged initial letters of the text. (For a more complete list of related manuscripts, see: List of Hiberno-Saxon illustrated manuscripts).[3]",
			"color": "tan|0.3926 wheat|0.16192 burly|0.081984 wood|0.081984 bisque|0.061861 blanched|0.047103 almond|0.047103 peach|0.044407 puff|0.044407 moccasin|0.034564 papaya|0.025325 whip|0.025325 navajo|0.02089 white|0.02089 black|0.019592 antique|0.019087 white|0.019087 dim|0.01644 gray|0.01644 dim|0.01644 grey|0.01644 corn|0.0095629 silk|0.0095629 gray|0.0093671 grey|0.0093671 beige|0.0092861 light|0.0076105 golden|0.0076105 rod|0.0076105 yellow|0.0076105 sienna|0.0070348 lemon|0.0064498 chiffon|0.0064498  "
		}
	}
}
