{
	"add": {
		"doc": {
			"id": "36df05fdf7baa846ee37cb53087a0544ec29d0281b73b987d9bacff096f042e3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Jagvstapir.jpg/220px-Jagvstapir.jpg",
				"previous": "While the jaguar often employs the deep throat-bite and suffocation technique typical among Panthera, it sometimes uses a killing method unique amongst cats: it pierces directly through the temporal bones of the skull between the ears of prey (especially the capybara) with its canine teeth, piercing the brain.[55] This may be an adaptation to \"cracking open\" turtle shells; following the late Pleistocene extinctions, armored reptiles such as turtles would have formed an abundant prey base for the jaguar.[34][50] The skull bite is employed with mammals in particular; with reptiles such as the caiman, the jaguar may leap onto the back of the prey and sever the cervical vertebrae, immobilizing the target. When attacking sea turtles, including the huge Leatherback sea turtle which weighs about 385 kg (849 lb) on average, as they try to nest on beaches, the jaguar will bite at the head, often beheading the prey, before dragging it off to eat.[56] Reportedly, while hunting horses, a jaguar may leap onto their back, place one paw on the muzzle and another on the nape and then twist, dislocating the neck. Local people have anecdotally reported that when hunting a pair of horses bound together, the jaguar will kill one horse and then drag it while the other horse, still living, is dragged in their wake.[57] With prey such as smaller dogs, a paw swipe to the skull may be sufficient to kill it.",
				"after": "The jaguar is a stalk-and-ambush rather than a chase predator. The cat will walk slowly down forest paths, listening for and stalking prey before rushing or ambushing. The jaguar attacks from cover and usually from a target's blind spot with a quick pounce; the species' ambushing abilities are considered nearly peerless in the animal kingdom by both indigenous people and field researchers, and are probably a product of its role as an apex predator in several different environments. The ambush may include leaping into water after prey, as a jaguar is quite capable of carrying a large kill while swimming; its strength is such that carcasses as large as a heifer can be hauled up a tree to avoid flood levels.[43]",
			"color": "black|0.64885 tan|0.10455  "
		}
	}
}
