{
	"add": {
		"doc": {
			"id": "36eebc1f02a2bd51a1febb459fc045405babe0c86929f49f545f11d382620c07",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Russian_Air_Force_Kamov_Ka-50.jpg/220px-Russian_Air_Force_Kamov_Ka-50.jpg",
				"previous": "Tandem rotors are two horizontal main rotor assemblies mounted one behind the other. Tandem rotors achieve pitch attitude changes to accelerate and decelerate the helicopter through a process called differential collective pitch. To pitch forward and accelerate, the rear rotor increases collective pitch, raising the tail, and the front rotor decreases collective pitch, simultaneously dipping the nose. To pitch upward while decelerating (or moving rearward), the front rotor increases collective pitch to raise the nose and the rear rotor decreases collective pitch to lower the tail. Yaw control develops through opposing cyclic pitch in each rotor. To pivot right, the front rotor tilts right and the rear rotor tilts left. To pivot left, the front rotor tilts left and the rear rotor tilts right. All rotor power contributes to lift, and it is simpler to handle changes in the center of gravity fore-aft. However, it requires the expense of two large rotors rather than the more common one large main rotor and a much smaller tail rotor. The Boeing CH-47 Chinook is the most common tandem rotor helicopter.",
				"after": "Coaxial rotors are a pair of rotors mounted one above the other on the same shaft and turning in opposite directions. The advantage of the coaxial rotor is that, in forward flight, the lift provided by the advancing halves of each rotor compensates for the retreating half of the other, eliminating one of the key effects of dissymmetry of lift: retreating blade stall. However, other design considerations plague coaxial rotors. There is an increased mechanical complexity of the rotor system because it requires linkages and swashplates for two rotor systems. Also, because the rotors must rotate in opposite directions, the mast is more complex, and control linkages for pitch changes to the upper rotor system must pass through the lower rotor system.",
			"color": "lavender|0.23151 black|0.098914 alice|0.098765 blue|0.098765 gainsboro|0.083754 ghost|0.076515 white|0.076515 light|0.066145 steel|0.066145 blue|0.066145 white|0.06079 smoke|0.06079 azure|0.041908 dim|0.040223 gray|0.040223 dim|0.040223 grey|0.040223 gray|0.035632 grey|0.035632 dark|0.033215 gray|0.033215 dark|0.033215 grey|0.033215 dark|0.021245 slate|0.021245 gray|0.021245 snow|0.01953 white|0.014618 light|0.014288 blue|0.014288 silver|0.013612 light|0.011921 gray|0.011921 light|0.011921 grey|0.011921 mint|0.0088893 cream|0.0088893 slate|0.0077305 gray|0.0077305 light|0.0074702 slate|0.0074702 gray|0.0074702 lavender|0.0070096 blush|0.0070096  "
		}
	}
}
