{
	"add": {
		"doc": {
			"id": "36fc14db918a8d93d9c47fdba73a66cd96f97c9428ccf7559c365978c1fd4771",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/B_telmatiaea_06_gnangarra_cropped.jpg/220px-B_telmatiaea_06_gnangarra_cropped.jpg",
				"previous": "The fruiting structure is a stout woody \"cone\", with a hairy appearance caused by the persistence of old withered flower parts.[1] Up to 70 woody follicles, each of which contains a single seed, may be embedded in the cone. As with other Banksia species, only a small proportion of flowers go on to form follicles; in the case of B. telmatiaea, the proportion is around 4% for those \"cones\" that set some fruit. However, about 80% of fruiting structures set no fruit at all. According to John K. Scott, \"there [is] no obvious reason on the basis of morphology of pollination for this lack of seed set\".[3]",
				"after": "B. telmatiaea was first collected around 1840 by Ludwig Preiss and James Drummond. For many years it was included in B. sphaerocarpa, but by 1980 it was recognised as a distinct species. In recognition of its distinctness from, yet affinity with, B. sphaerocarpa, it was for a time informally referred to as Banksia aff. Sphaerocarpa.[5] It was eventually published by Alex George in his 1981 monograph The genus Banksia L.f. (Proteaceae), based on a specimen collected by him on the Brand Highway about 45 km (28 mi) north of Regans Ford on 14 May 1969, and labelled \"A. S. George 9309\". He found it most closely resembled B. leptophylla, but regarded its preference for swampy rather than sandy soils and winter flowering as worthy of warranting species status.[2] George gave it the specific name telmatiaea from the Greek stem telmat-/τελματ- (\"the mud of a pond\"),[6] in reference to its swampy habitat.[2] Thus the full name for the species is Banksia telmatiaea A.S.George.[7] Common names for B. telmatiaea include swamp fox banksia and marsh banksia.[8]",
			"color": "dim|0.38069 gray|0.38069 dim|0.38069 grey|0.38069 gray|0.20525 grey|0.20525 dark|0.11659 olive|0.11659 green|0.11659 dark|0.096062 gray|0.096062 dark|0.096062 grey|0.096062 black|0.052713 silver|0.039733 olive|0.029285 drab|0.029285 light|0.017424 gray|0.017424 light|0.017424 grey|0.017424 rosy|0.012629 brown|0.012629 gainsboro|0.010674  "
		}
	}
}
