{
	"add": {
		"doc": {
			"id": "37027044fa3585ae2538f975451e0598514c0bc97e25f33d5d92573ab3e677a7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Pietro_Lorenzetti_001.jpg/170px-Pietro_Lorenzetti_001.jpg",
			"previous": [],
				"after": "While animal products were to be avoided during times of penance, pragmatic compromises often prevailed. The definition of \"fish\" was often extended to marine and semi-aquatic animals such as whales, barnacle geese, puffins and even beavers. The choice of ingredients may have been limited, but that did not mean that meals were smaller. Neither were there any restrictions against (moderate) drinking or eating sweets. Banquets held on fish days could be splendid, and were popular occasions for serving illusion food that imitated meat, cheese and eggs in various ingenious ways; fish could be molded to look like venison and fake eggs could be made by stuffing empty egg shells with fish roe and almond milk and cooking it in coals. While Byzantine church officials took a hard-line approach, and discouraged any culinary refinement for the clergy, their Western counterparts were far more lenient.[3] There was also no lack of grumbling about the rigors of fasting among the laity. During Lent, kings and schoolboys, commoners and nobility, all complained about being deprived of meat for the long, hard weeks of solemn contemplation of their sins. At Lent, owners of livestock were even warned to keep an eye out for hungry dogs frustrated by a \"hard siege by Lent and fish bones\".[4]",
			"color": "tan|0.29052 burly|0.14691 wood|0.14691 dark|0.11528 salmon|0.11528 wheat|0.10803 pale|0.073584 golden|0.073584 rod|0.073584 moccasin|0.044875 lemon|0.027815 chiffon|0.027815 navajo|0.027089 white|0.027089 light|0.021307 golden|0.021307 rod|0.021307 yellow|0.021307 bisque|0.019214 blanched|0.018873 almond|0.018873 khaki|0.017772 papaya|0.010918 whip|0.010918 dark|0.010285 khaki|0.010285 corn|0.0095902 silk|0.0095902 light|0.0081905 yellow|0.0081905 light|0.0081092 salmon|0.0081092 antique|0.0079914 white|0.0079914 beige|0.0079544  "
		}
	}
}
