{
	"add": {
		"doc": {
			"id": "37038ae591692d53281cd2b412939174abd455f4dd1c673875dd01276ed6e745",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Orcinus_orca_%28Vestfjord%29.jpg/220px-Orcinus_orca_%28Vestfjord%29.jpg",
				"previous": "Killer whales are apex predators, meaning that they themselves have no natural predators. They are sometimes called the wolves of the sea, because they hunt in groups like wolf packs.[109] Killer whales hunt varied prey including fish, cephalopods, mammals, sea birds and sea turtles.[110] However, different populations or species tend to specialize and some can have a dramatic impact on certain prey species.[111] Those that feed on mammals may not even recognize fish as food. This specialization in diet and hunting, combined with small differences in markings, suggest that they might be different species, rather than populations. Advanced methods that sequenced the entire mitochondrial genome revealed systematic differences in DNA between different populations.[59]",
				"after": "Fish-eating killer whales prey on around 30 species of fish. Some populations in the Norwegian and Greenland sea specialize in herring and follow that fish's autumnal migration to the Norwegian coast. Salmon account for 96% of northeast Pacific residents' diet. About 65% of them are large, fatty Chinook.[112] Chum salmon are also eaten, but smaller sockeye and pink salmon are not a significant food item.[113] Depletion of specific prey species in an area is, therefore, cause for concern for local populations, despite the high diversity of prey. On average, a killer whale eats 227 kilograms (500 lb) each day.[114] While salmon are usually hunted by an individual or a small group of individuals, herring are often caught using carousel feeding; the killer whales force the herring into a tight ball by releasing bursts of bubbles or flashing their white undersides. They then slap the ball with their tail flukes, either stunning or killing up to 10–15 fish at a time. The herring are then eaten one at a time. Carousel feeding has only been documented in the Norwegian killer whale population and with some oceanic dolphin species.[115]",
			"color": "black|0.53695 slate|0.11628 gray|0.11628 light|0.098659 steel|0.098659 blue|0.098659 dim|0.081901 gray|0.081901 dim|0.081901 grey|0.081901 light|0.078292 slate|0.078292 gray|0.078292 steel|0.051564 blue|0.051564  "
		}
	}
}
