{
	"add": {
		"doc": {
			"id": "371710bdd52d14cfec212543a8c77aa04951aac9e914983e7dcb3d833df63abd",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/b/bb/William_Travis_famousletterplaque.jpg/220px-William_Travis_famousletterplaque.jpg",
				"previous": "Travis was commissioned as a lieutenant colonel of the Legion of Cavalry; and, he became the chief recruiting officer for a new regular Texan army.[18] Governor Henry Smith ordered Travis to raise a company of professional soldiers to reinforce the Texans who were then under the command of James C. Neill at the Alamo Mission in San Antonio.[21] Travis considered disobeying his orders, writing to Smith: \"I am willing, nay anxious, to go to the defense of Bexar, but sir, I am unwilling to risk my reputation ... by going off into the enemy's country with such little means, so few men, and with them so badly equipped.\"[22] James Bowie arrived at the Alamo with 30 men on January 19, 1836.[21] On February 3, Travis arrived in San Antonio with eighteen regulars as reinforcements. A compromise was reached between Bowie and Travis for command of the Alamo, with Bowie in command of the volunteers and Travis in command of the regulars.[20] When Bowie's health began to fail, it became irrelevant; and, Travis then became the official commander of the Alamo garrison.[21] On March 6, 1836, following a thirteen-day siege, Santa Anna ordered the assault on the Alamo during the predawn hours. Travis died fighting to the end; and, his remains were burned along with all the other Alamo defenders.[21]",
			"after": [
				"On February 24, 1836, during Santa Anna's siege of the Alamo, Travis wrote a letter addressed \"To the People of Texas and All Americans in the World\":",
				"He gave this letter to courier John William Smith to deliver. The envelope that contained the letter was labeled \"VICTORY or DEATH\".[22] The letter, while unable to bring aid to the garrison at the Alamo, did much to motivate the Texian army and helped to rally support in America for the cause of Texan independence. It also cemented Travis's status as a hero of the Texas Revolution."
			],
			"color": "gray|0.23382 grey|0.23382 dark|0.17082 gray|0.17082 dark|0.17082 grey|0.17082 dim|0.14972 gray|0.14972 dim|0.14972 grey|0.14972 slate|0.12975 gray|0.12975 light|0.092991 slate|0.092991 gray|0.092991 silver|0.074051 light|0.030946 gray|0.030946 light|0.030946 grey|0.030946 gainsboro|0.016528 antique|0.015972 white|0.015972 misty|0.0093321 rose|0.0093321 papaya|0.0080026 whip|0.0080026 blanched|0.0078837 almond|0.0078837 linen|0.007881 bisque|0.0076771 old|0.0056564 lace|0.0056564 peach|0.0049354 puff|0.0049354 sea|0.0042437 shell|0.0042437  "
		}
	}
}
