{
	"add": {
		"doc": {
			"id": "37255145190178607187f7be5e670fe0da3475e9964e1b2b9e5856cb18fd2735",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Benzopyrene_DNA_adduct_1JDG.png/220px-Benzopyrene_DNA_adduct_1JDG.png",
			"previous": [],
				"after": "DNA can be damaged by many sorts of mutagens, which change the DNA sequence. Mutagens include oxidizing agents, alkylating agents and also high-energy electromagnetic radiation such as ultraviolet light and X-rays. The type of DNA damage produced depends on the type of mutagen. For example, UV light can damage DNA by producing thymine dimers, which are cross-links between pyrimidine bases.[73] On the other hand, oxidants such as free radicals or hydrogen peroxide produce multiple forms of damage, including base modifications, particularly of guanosine, and double-strand breaks.[74] A typical human cell contains about 150,000 bases that have suffered oxidative damage.[75] Of these oxidative lesions, the most dangerous are double-strand breaks, as these are difficult to repair and can produce point mutations, insertions and deletions from the DNA sequence, as well as chromosomal translocations.[76] These mutations can cause cancer. Because of inherent limitations in the DNA repair mechanisms, if humans lived long enough, they would all eventually develop cancer.[77][78] DNA damages that are naturally occurring, due to normal cellular processes that produce reactive oxygen species, the hydrolytic activities of cellular water, etc., also occur frequently. Although most of these damages are repaired, in any cell some DNA damage may remain despite the action of repair processes. These remaining DNA damages accumulate with age in mammalian postmitotic tissues. This accumulation appears to be an important underlying cause of aging.[79][80][81]",
			"color": "chocolate|0.12167 lime|0.091831 green|0.091831 forest|0.0675 green|0.0675 saddle|0.058014 brown|0.058014 dark|0.053347 gray|0.053347 dark|0.053347 grey|0.053347 gray|0.045109 grey|0.045109 dark|0.033529 sea|0.033529 green|0.033529 dark|0.033107 green|0.033107 silver|0.031935 dark|0.030361 orange|0.030361 brown|0.029554 dim|0.028536 gray|0.028536 dim|0.028536 grey|0.028536 green|0.023831 tan|0.022625 light|0.02156 gray|0.02156 light|0.02156 grey|0.02156 light|0.018666 green|0.018666 gainsboro|0.017684 indian|0.015401 red|0.015401 rosy|0.015324 brown|0.015324 dark|0.011983 slate|0.011983 gray|0.011983 dark|0.011004 slate|0.011004 blue|0.011004 white|0.011003 smoke|0.011003 light|0.010178 slate|0.010178 gray|0.010178 sea|0.010139 green|0.010139 burly|0.0095287 wood|0.0095287 sea|0.0094087 shell|0.0094087 midnight|0.00916 blue|0.00916 slate|0.0090448 gray|0.0090448 snow|0.008892 ghost|0.0087036 white|0.0087036 alice|0.0085247 blue|0.0085247 white|0.0082076 mint|0.0081603 cream|0.0081603 floral|0.0079964 white|0.0079964 lavender|0.0077805 blush|0.0077805 firebrick|0.0072013 azure|0.0071537  "
		}
	}
}
