{
	"add": {
		"doc": {
			"id": "372604bc0c45404bbb881048998e74fb80cef057bf30cc2075dd9958653c31ea",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Walters_500.png/220px-Walters_500.png",
				"previous": "Early experiments using rockets to boost gliders into the air were conducted in Germany in the 1920s (Lippisch Ente), and later both the Royal Air Force and the Luftwaffe introduced such systems in World War II.[1] The British system used fairly large solid fuel rockets to shoot planes (typically the Hawker Hurricane) off a small ramp fitted to the fronts of merchant ships, known in service as Catapult armed merchantmen (or CAM Ships), in order to provide some cover against German maritime patrol planes. After firing, the rocket was released from the back of the plane to fall into the water and sink. The task done, the pilot would fly to friendly territory if possible or parachute from the plane, hopefully to be picked up by one of the escort vessels. Over two years the system was only employed nine times to attack German aircraft with eight kills recorded for the loss of a single pilot.",
				"after": "The Luftwaffe also used the technique with both liquid-fueled and solid fuel, often jettisonable rocket motors in order to help their small bombers, and the enormous Gigant, Messerschmitt Me 321 glider, conceived in 1940 for the invasion of Britain, and used to supply the Russian front which also had air tow assistance from up to three Messerschmitt Bf 110 heavy fighters in a so-called Troika-Schlepp arrangement, into the air with loads that would have made the takeoff run too long otherwise. This became especially important late in the war when the lengths of usable runways were severely curtailed due to the results of Allied bombing. Their system typically used Walter HWK 109-500 or -501 Starthilfe (\"start-help\") liquid-fuel monopropellant rocket engines driven by chemical decomposition of \"T-Stoff\", essentially almost pure hydrogen peroxide. A parachute pack at the blunt-contour front of the motor's exterior housing was used to slow its fall after being released from the plane, so the system could be re-used. First experiments were held in 1937 on an Heinkel He 111, piloted by test-pilot Erich Warsitz at Neuhardenberg, a large field about 70 kilometres east of Berlin, listed as a reserve airfield in the event of war.[2] Other German experiments with JATO were aimed at assisting the launch of interceptor aircraft such as the Messerschmitt Me 262C, as the Heimatschützer special versions, usually fitted with either a version of the Walter HWK 109-509 liquid fuelled rocket engine from the Me 163 Komet program either in the extreme rear of the fuselage or semi-\"podded\" beneath it just behind the wing's trailing edge, to assist its Junkers Jumo 004 turbojets, or a pair of specially rocket-boosted BMW 003R combination jet-rocket powerplants in place of the Jumo 004s, so that the Me 262C Heimatschützer interceptors could reach enemy bomber formations sooner. Two prototypes of the Heimatschützer versions of the Me 262 were built and test flown, of the three designs proposed.",
			"color": "dark|0.17793 gray|0.17793 dark|0.17793 grey|0.17793 silver|0.16203 light|0.11365 gray|0.11365 light|0.11365 grey|0.11365 gainsboro|0.080073 gray|0.077029 grey|0.077029 dim|0.049163 gray|0.049163 dim|0.049163 grey|0.049163 linen|0.033609 misty|0.031712 rose|0.031712 light|0.027891 slate|0.027891 gray|0.027891 sea|0.026894 shell|0.026894 white|0.023876 smoke|0.023876 old|0.02355 lace|0.02355 slate|0.022349 gray|0.022349 lavender|0.021686 blush|0.021686 floral|0.021675 white|0.021675 snow|0.019789 antique|0.013824 white|0.013824 white|0.013246 light|0.013161 steel|0.013161 blue|0.013161 ivory|0.0086324 ghost|0.0085206 white|0.0085206 black|0.0070762 dark|0.0069757 slate|0.0069757 gray|0.0069757 mint|0.0042518 cream|0.0042518  "
		}
	}
}
