{
	"add": {
		"doc": {
			"id": "372c5f3635cf889e9e7d15da0ed061ab10f70dfb0078b82c8ef2b409f2a65498",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Medal-Viki.jpg/220px-Medal-Viki.jpg",
				"previous": "The Constitution of Canada is the supreme law of the country, and consists of written text and unwritten conventions. The Constitution Act, 1867 (known as the British North America Act prior to 1982), affirmed governance based on parliamentary precedent and divided powers between the federal and provincial governments. The Statute of Westminster 1931 granted full autonomy and the Constitution Act, 1982, ended all legislative ties to the UK, as well as adding a constitutional amending formula and the Canadian Charter of Rights and Freedoms. The Charter guarantees basic rights and freedoms that usually cannot be over-ridden by any government—though a notwithstanding clause allows the federal parliament and provincial legislatures to override certain sections of the Charter for a period of five years.[118]",
				"after": "The Indian Act, various treaties and case laws were established to mediate relations between Europeans and native peoples.[119] Most notably, a series of eleven treaties known as the Numbered Treaties were signed between Aboriginals in Canada and the reigning Monarch of Canada between 1871 and 1921.[120] These treaties are agreements with the Canadian Crown-in-Council, administered by Canadian Aboriginal law, and overseen by the Minister of Aboriginal Affairs and Northern Development. The role of the treaties and the rights they support were reaffirmed by Section Thirty-five of the Constitution Act, 1982.[119] These rights may include provision of services such as health care, and exemption from taxation.[121] The legal and policy framework within which Canada and First Nations operate was further formalized in 2005, through the First Nations–Federal Crown Political Accord.[119]",
			"color": "dark|0.5687 gray|0.5687 dark|0.5687 grey|0.5687 silver|0.18555 gray|0.10517 grey|0.10517 light|0.045235 gray|0.045235 light|0.045235 grey|0.045235 dim|0.043854 gray|0.043854 dim|0.043854 grey|0.043854 gainsboro|0.015481 tan|0.014161 antique|0.0089099 white|0.0089099  "
		}
	}
}
