{
	"add": {
		"doc": {
			"id": "3739dbea23329684448c04d8d4ec0e9e3c3d0c6c42481c007a97ae1a63faa833",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Wooden_hourglass_3.jpg/170px-Wooden_hourglass_3.jpg",
			"previous": [],
				"after": "For thousands of years, devices have been used to measure and keep track of time. The current sexagesimal system of time measurement dates to approximately 2000 BC, in Sumer. The Ancient Egyptians divided the day into two 12-hour periods, and used large obelisks to track the movement of the Sun. They also developed water clocks, which were probably first used in the Precinct of Amun-Re, and later outside Egypt as well; they were employed frequently by the Ancient Greeks, who called them clepsydrae. The Cho Dynasty is believed to have used the outflow water clock around the same time, devices which were introduced from Mesopotamia as early as 2000 BC. Other ancient timekeeping devices include the candle clock, used in China, Japan, England and Iraq; the timestick, widely used in India and Tibet, as well as some parts of Europe; and the hourglass, which functioned similarly to a water clock. The sundial, an early clock, relies on shadows to provide a good estimate of the hour on a sunny day. It is not so useful in cloudy weather or at night and requires recalibration as the seasons change (if the gnomon was not aligned with the Earth's axis). The earliest known clock with a water-powered escapement mechanism, which transferred rotational energy into intermittent motions,[1] dates back to 3rd century BC ancient Greece;[2] Chinese engineers later invented clocks incorporating mercury-powered escapement mechanisms in the 10th century,[3] followed by Arabic engineers inventing water clocks driven by gears and weights in the 11th century.[4]",
			"color": "light|0.13512 gray|0.13512 light|0.13512 grey|0.13512 tan|0.12866 silver|0.12516 gainsboro|0.11407 gray|0.098645 grey|0.098645 dim|0.070348 gray|0.070348 dim|0.070348 grey|0.070348 dark|0.069169 gray|0.069169 dark|0.069169 grey|0.069169 linen|0.037124 white|0.022674 smoke|0.022674 sea|0.022414 shell|0.022414 light|0.015791 slate|0.015791 gray|0.015791 floral|0.015757 white|0.015757 snow|0.015371 slate|0.015015 gray|0.015015 old|0.013171 lace|0.013171 misty|0.012412 rose|0.012412 lavender|0.011983 blush|0.011983 antique|0.01177 white|0.01177 ghost|0.011006 white|0.011006 white|0.01066 mint|0.0090675 cream|0.0090675 alice|0.0078594 blue|0.0078594  "
		}
	}
}
