{
	"add": {
		"doc": {
			"id": "373d1c56ca2dea544efaaeaf606785c6b649437e7c28bfd157d9e27ab816fdec",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/3/36/Cary_Hardee.jpg/170px-Cary_Hardee.jpg",
				"previous": "White men began surrounding houses, pouring kerosene on and lighting them, then shooting at those who emerged. Lexie Gordon, a light-skinned 50-year-old woman who was ill with typhoid fever, had sent her children into the woods. She was killed by a shotgun blast to the face when she fled from hiding underneath her home, which had been set on fire by the mob. Fannie Taylor's brother-in-law claimed to be her killer.[1] On January 5, more whites converged on the area, forming a mob of between 200 to 300 people. Some came from out of state. Mingo Williams, who was 20 miles (32 km) away near Bronson, was collecting turpentine sap by the side of the road when a car full of whites stopped and asked his name. As was custom among many residents of Levy County, both black and white, Williams used a nickname that was more prominent than his given name; when he gave his nickname of \"Lord God\", they shot him dead.[17]",
				"after": "Sheriff Walker pleaded with news reporters covering the violence to send a message to the Alachua County Sheriff P. G. Ramsey to send assistance. Carloads of men came from Gainesville to assist Walker; many of them had probably participated in the Klan rally earlier in the week. W. H. Pillsbury tried desperately to keep black workers in the Sumner mill, and worked with his assistant, a man named Johnson, to dissuade the white workers from joining others using extra-legal violence. Armed guards sent by Sheriff Walker turned away blacks who emerged from the swamps and tried to go home.[30] W. H. Pillsbury's wife secretly helped smuggle people out of the area. Several white men declined to join the mobs, including the town barber who also refused to lend his gun to anyone. He said he did not want his \"hands wet with blood\".[17]",
			"color": " "
		}
	}
}
