{
	"add": {
		"doc": {
			"id": "37482cc37840a9f29cab83928e3a6efbd1e87cfcaa995ac93e3da3bb2bee82f6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Poole_Bay.jpg/220px-Poole_Bay.jpg",
				"previous": "Poole's Guildhall has played a varied part in the history of the town. A Grade II* listed building, the Guildhall was built in 1761 at a cost of £2,250.[81][82] The new building included an open market house on the ground floor and a courtroom and offices for the town council on the first floor and has also been used as a Court of Record, Magistrates' Court, Court of Admiralty and a venue for Quarter Sessions. Between 1819 and 1821 the building was consecrated as a Parish Church while the old St. James Church was pulled down and replaced with the present church.[81] During the Second World War the building was used as a canteen and meeting room for American soldiers prior to the invasion of France. The showers and washing facilities installed at this time were later converted into public baths which were used until the 1960s. The building was converted for use as the town museum between 1971 and 1991 but stood empty for the next 16 years. After a renovation project funded by Poole Borough Council, the restored Guildhall opened in June 2007 as a Register Office for weddings, civil partnerships and other civic ceremonies.[81][83]",
				"after": "Poole has several urban parks – the largest is Poole Park adjacent to Poole Harbour and the town centre. It opened in 1890 and is one of two Victorian parks in Poole. Designated a Conservation Area in 1995 and awarded a Green Flag in 2008, the park comprises 44.3 hectares (109 acres) of which 24 hectares (59 acres) include the park's man-made lake and ponds.[84] The park contains two children's play areas, a miniature railway, tennis courts, a bowling green, a miniature golf course, an Italian restaurant and an indoor ice rink for children.[85][86] A cricket field and pavilion at the eastern end are home to Poole Town Cricket Club and water sport activities such as sailing, windsurfing, kayaking and rowing take place on the large lake.[87] A war memorial stands in the centre of the park as a monument to Poole citizens killed during the First and Second World Wars. The park hosts several road races such as the Race for Life and the annual Poole Festival of Running.[88]",
			"color": "dark|0.68269 olive|0.68269 green|0.68269 tan|0.20843 gray|0.039167 grey|0.039167 dark|0.019084 gray|0.019084 dark|0.019084 grey|0.019084 wheat|0.01539 dim|0.0098083 gray|0.0098083 dim|0.0098083 grey|0.0098083  "
		}
	}
}
