{
	"add": {
		"doc": {
			"id": "3759890f7138172bfd346557e5278da30ec9bda0cfe0deebf55071600d91bae5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Whitfield_Hall.jpg/220px-Whitfield_Hall.jpg",
				"previous": "In 616 Æthelfrith of Bernicia, an Anglo-Saxon King, crossed the Pennines with an army and passed through Manchester to defeat the Britons in the Battle of Chester.[4] A wave of Anglian colonists followed this military conquest and their settlements are identified by the Old English suffix ton in local place names.[4] Royton, Middleton, Moston, Clayton, Ashton and Crompton are localities northeast of Manchester which may have been founded during that colonisation,[4] suggesting that Crompton as a settlement could date from the 7th century.[4]",
				"after": "During Anglo-Saxon England, it is assumed from toponymic evidence that the township of Crompton formed around a predominantly Anglian community with a few Norse settlers, and within the extensive Hundred of Salfordshire.[4] Following the Norman conquest of England, Crompton was part of a vast estate given to Roger the Poitevin, the maternal nephew of William the Conqueror.[5] It was unmentioned in the Domesday Book of 1086; the first recorded use of the name Crompton for the township was discovered in legal documents relating to Cockersand Abbey near Lancaster, dating from the early 13th century. The document outlines that Gilbert de Notton, a Norman who had acquired the land from Roger de Montbegon, granted his estate to Cockersand Abbey.[14] The Knights Hospitaller and Whalley Abbey held small estates in the township. In 1234, about 80 acres (32 ha) of land at Whitfield in Crompton were given to the Hospitallers,[15] a religious order that provided care for poor, sick or injured pilgrims to the Holy Land. A medieval cross has been discovered in the ruins of a house at Whitfield.[16]",
			"color": "light|0.24809 blue|0.24809 light|0.18106 steel|0.18106 blue|0.18106 sky|0.15741 blue|0.15741 black|0.091259 dim|0.068651 gray|0.068651 dim|0.068651 grey|0.068651 light|0.064882 sky|0.064882 blue|0.064882 dark|0.029418 slate|0.029418 gray|0.029418 dark|0.029206 olive|0.029206 green|0.029206 slate|0.023445 gray|0.023445 light|0.022449 slate|0.022449 gray|0.022449 powder|0.017208 blue|0.017208 gray|0.012956 grey|0.012956 tan|0.012658 dark|0.011698 gray|0.011698 dark|0.011698 grey|0.011698 burly|0.0093075 wood|0.0093075  "
		}
	}
}
