{
	"add": {
		"doc": {
			"id": "3760b6388be4234d51559afb47a3645abb979fe4dcb97de0389ab698f3c78a63",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Israeli_supreme_court_building_nightshot.JPG/220px-Israeli_supreme_court_building_nightshot.JPG",
				"previous": "While the international community regards East Jerusalem, including the entire Old City, as part of the occupied Palestinian territories, neither part, West or East Jerusalem, is recognized as part of the territory of Israel or the State of Palestine. Under the United Nations Partition Plan for Palestine adopted by the General Assembly of the United Nations in 1947, Jerusalem was envisaged to become a corpus separatum administered by the United Nations. In the war of 1948, the western part of the city was occupied by forces of the nascent state of Israel, while the eastern part was occupied by Jordan. The international community largely considers the legal status of Jerusalem to derive from the partition plan, and correspondingly refuses to recognize Israeli sovereignty over the city.",
			"after": [
				"Following the 1967 Six-Day War, Israel extended its jurisdiction and administration over East Jerusalem, establishing new municipal borders.",
				"In 2010, Israel approved legislation giving Jerusalem the highest national priority status in Israel. The law prioritized construction throughout the city, and offered grants and tax benefits to residents to make housing, infrastructure, education, employment, business, tourism, and cultural events more affordable. Communications Minister Moshe Kahlon said that the bill sent \"a clear, unequivocal political message that Jerusalem will not be divided\", and that \"all those within the Palestinian and international community who expect the current Israeli government to accept any demands regarding Israel's sovereignty over its capital are mistaken and misleading\".[201]"
			],
			"color": "dark|0.2029 golden|0.2029 rod|0.2029 peru|0.14002 black|0.10414 sandy|0.090361 brown|0.090361 burly|0.088603 wood|0.088603 navajo|0.060449 white|0.060449 golden|0.051126 rod|0.051126 tan|0.047911 moccasin|0.031775 pale|0.028774 golden|0.028774 rod|0.028774 wheat|0.025367 saddle|0.018832 brown|0.018832  "
		}
	}
}
