{
	"add": {
		"doc": {
			"id": "37646f11a069febfe7878c87b683b59f5dcda424657582c38e495741719c9262",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Table_Rock_Airstrip.jpg/100px-Table_Rock_Airstrip.jpg",
				"previous": "Humans have lived in the Table Rock area for at least 15,000 years, based on the age of Clovis points that were discovered nearby.[14] The region surrounding the Table Rocks was home to the Takelma people. They gathered food such as acorns and tarweed seeds, and caught salmon in the nearby Rogue River. The Takelma also used deer hides for clothing.[15] They had several names for the rocks, including Di'tani (\"rock above\"), Titanakh (\"little Indian plums\"), and possibly Kwenphunkh.[16][17] The first use of the names Upper Table Rock and Lower Table Rock is unknown, however the first recorded use was by mountain man James Clyman in 1845.[16][18]",
				"after": "Some of the first European Americans to visit the area were fur trappers led by Peter Skene Ogden in 1827.[9][16] In 1841 the United States Exploring Expedition passed through the Rogue Valley. Neither Ogden nor the expedition mentioned the Table Rocks.[16] The gold rush of the early 1850s brought many emigrants to the area, and Table Rock City (later renamed Jacksonville) was established several miles south of the rocks.[19][20] The sudden increase of settlers created conflicts with the Rogue River Indians. These conflicts turned into warfare, and several treaties were signed in an attempt to end the hostilities.[21][22] In June 1851, soldiers of the United States Army led by Major Philip Kearny attacked the Takelma near Lower Table Rock, but the Takelma were prepared. One soldier died, and three others were injured. Major Kearny returned with volunteers from Yreka soon after, accompanied by Oregon Territory delegate Joseph Lane. The ensuing Battle of Table Rock lasted 10 days, and 30 Takelma were imprisoned.[23]",
			"color": "gray|0.37537 grey|0.37537 dim|0.3188 gray|0.3188 dim|0.3188 grey|0.3188 dark|0.22065 gray|0.22065 dark|0.22065 grey|0.22065  "
		}
	}
}
