{
	"add": {
		"doc": {
			"id": "377099618f822b45e2751c1f9b6ce297d66f7d937bcb33aa860802ad687dae87",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Icelandic_ponies.jpg/220px-Icelandic_ponies.jpg",
			"previous": [],
				"after": "Today, the Icelandic horse is represented by associations in 19 countries, with the International Federation of Icelandic Horse Associations (FEIF) serving as a governing international parent organization.[32] The FEIF was founded on May 25, 1969, with six countries as original members: Austria, Denmark, Germany, Iceland, the Netherlands, and Switzerland. France and Norway joined in 1971, and Belgium and Sweden in 1975. Later, Finland, Canada, Great Britain, USA, Faroe Islands, Luxembourg, Italy, Slovenia and Ireland became members, but Ireland subsequently left because of a lack of members. New Zealand has been given the status of \"associate member\" as its membership base is small.[33] In 2000, WorldFengur was established as the official FEIF registry for Icelandic horses.[34] The registry is a web database program that is used as a studbook to track the history and bloodlines of the Icelandic breed.[35] The registry contains information on the pedigree, breeder, owner, offspring, photo, breeding evaluations and assessments, and unique identification of each horse registered. The database was established by the Icelandic government in cooperation with the FEIF.[34] Since its inception, around 300,000 Icelandic horses, living and dead, have been registered worldwide.[35] The Islandpferde-Reiter- und Züchterverband is an organization of German riders and breeders of Icelandic horses and the association of all Icelandic horse clubs in Germany.[36]",
			"color": "dark|0.44696 khaki|0.44696 black|0.12612 silver|0.082078 light|0.069569 steel|0.069569 blue|0.069569 dark|0.058707 gray|0.058707 dark|0.058707 grey|0.058707 light|0.0538 gray|0.0538 light|0.0538 grey|0.0538 tan|0.033813 gray|0.033413 grey|0.033413 gainsboro|0.029429 burly|0.013725 wood|0.013725  "
		}
	}
}
