{
	"add": {
		"doc": {
			"id": "377dbd303cc812ea0f2c2b984a76fbff2178a49ea273b7f09ada6cf55307d870",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Tower_of_London_main_entrance%2C_2009.jpg/220px-Tower_of_London_main_entrance%2C_2009.jpg",
				"previous": "Public interest was partly fuelled by contemporary writers, of whom the work of William Harrison Ainsworth was particularly influential. In The Tower of London: A Historical Romance he created a vivid image of underground torture chambers and devices for extracting confessions that stuck in the public imagination.[109] Harrison also played another role in the Tower's history, as he suggested that Beauchamp Tower should be opened to the public so they could see the inscriptions of 16th- and 17th-century prisoners. Working on the suggestion, Anthony Salvin refurbished the tower and led a further programme for a comprehensive restoration at the behest of Prince Albert. Salvin was succeeded in the work by John Taylor. When a feature did not meet his expectations of medieval architecture Taylor would ruthlessly remove it; as a result, several important buildings within the castle were pulled down and in some cases post-medieval internal decoration removed.[133]",
				"after": "Although only one bomb fell on the Tower of London in the First World War (it landed harmlessly in the moat), the Second World War left a greater mark. On 23 September 1940, during the Blitz, high-explosive bombs damaged the castle, destroying several buildings and narrowly missing the White Tower. After the war, the damage was repaired and the Tower of London was reopened to the public.[134]",
			"color": "dim|0.31547 gray|0.31547 dim|0.31547 grey|0.31547 gray|0.17193 grey|0.17193 black|0.17119 dark|0.052956 gray|0.052956 dark|0.052956 grey|0.052956 tan|0.038823 silver|0.029739 antique|0.024003 white|0.024003 light|0.021785 gray|0.021785 light|0.021785 grey|0.021785 gainsboro|0.016241 bisque|0.015571 slate|0.014092 gray|0.014092 blanched|0.012394 almond|0.012394 papaya|0.011826 whip|0.011826 linen|0.010493 light|0.010166 slate|0.010166 gray|0.010166 dark|0.0080772 olive|0.0080772 green|0.0080772 peach|0.007812 puff|0.007812 old|0.0077833 lace|0.0077833 wheat|0.0070248 dark|0.0057694 slate|0.0057694 gray|0.0057694  "
		}
	}
}
