{
	"add": {
		"doc": {
			"id": "3781c16887d8c4939eecad1c88d7f91c740af57e1efa44c242ac2e9c8a597e0f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Goatglider.jpg/220px-Goatglider.jpg",
				"previous": "Initially training was done by short 'hops' in primary gliders which are very basic aircraft with no cockpit and minimal instruments.[21] Since shortly after World War II training has always been done in two-seat dual control gliders, but high performance two-seaters are also used to share the workload and the enjoyment of long flights. Originally skids were used for landing, but the majority now land on wheels, often retractable. Some gliders, known as motor gliders, are designed for unpowered flight, but can deploy piston, rotary, jet or electric engines.[22] Gliders are classified by the FAI for competitions into glider competition classes mainly on the basis of span and flaps.",
				"after": "A class of ultralight sailplanes, including some known as microlift gliders and some as 'airchairs', has been defined by the FAI based on a maximum weight. They are light enough to be transported easily, and can be flown without licensing in some countries. Ultralight gliders have performance similar to hang gliders, but offer some additional crash safety as the pilot can be strapped in an upright seat within a deformable structure. Landing is usually on one or two wheels which distinguishes these craft from hang gliders. Several commercial ultralight gliders have come and gone, but most current development is done by individual designers and home builders.",
			"color": "dim|0.15063 gray|0.15063 dim|0.15063 grey|0.15063 gray|0.12878 grey|0.12878 dark|0.11597 gray|0.11597 dark|0.11597 grey|0.11597 silver|0.093991 light|0.071987 gray|0.071987 light|0.071987 grey|0.071987 gainsboro|0.056416 light|0.047139 steel|0.047139 blue|0.047139 tan|0.030439 light|0.029905 slate|0.029905 gray|0.029905 slate|0.0256 gray|0.0256 white|0.024395 smoke|0.024395 antique|0.022475 white|0.022475 linen|0.021989 sea|0.014393 shell|0.014393 alice|0.012854 blue|0.012854 snow|0.012582 ghost|0.01245 white|0.01245 lavender|0.011848 blush|0.011848 lavender|0.010638 floral|0.0082138 white|0.0082138 sienna|0.0082081 old|0.0075027 lace|0.0075027 dark|0.0074763 slate|0.0074763 gray|0.0074763  "
		}
	}
}
