{
	"add": {
		"doc": {
			"id": "378e33712beeb66bad949d9898543b869e119ad1e057c1d585b2db9285cae8b7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Headless_buddha.jpg/170px-Headless_buddha.jpg",
				"previous": "The Buddha statues are in niches at the Rupadhatu level, arranged in rows on the outer sides of the balustrades, the number of statues decreasing as platforms progressively diminish to the upper level. The first balustrades have 104 niches, the second 104, the third 88, the fourth 72 and the fifth 64. In total, there are 432 Buddha statues at the Rupadhatu level.[1] At the Arupadhatu level (or the three circular platforms), Buddha statues are placed inside perforated stupas. The first circular platform has 32 stupas, the second 24 and the third 16, which adds up to 72 stupas.[1] Of the original 504 Buddha statues, over 300 are damaged (mostly headless), and 43 are missing. Since the monument's discovery, heads have been stolen as collector's items, mostly by Western museums.[86] Some of these Buddha heads are now displayed in numbers of museums, such as the Tropenmuseum in Amsterdam and The British Museum in London.[87]",
				"after": "At first glance, all the Buddha statues appear similar, but there is a subtle difference between them in the mudras, or the position of the hands. There are five groups of mudra: North, East, South, West and Zenith, which represent the five cardinal compass points according to Mahayana. The first four balustrades have the first four mudras: North, East, South and West, of which the Buddha statues that face one compass direction have the corresponding mudra. Buddha statues at the fifth balustrades and inside the 72 stupas on the top platform have the same mudra: Zenith. Each mudra represents one of the Five Dhyani Buddhas; each has its own symbolism.[88]",
			"color": "slate|0.35261 gray|0.35261 black|0.17281 dim|0.1711 gray|0.1711 dim|0.1711 grey|0.1711 light|0.14646 slate|0.14646 gray|0.14646 dark|0.081286 slate|0.081286 gray|0.081286 gray|0.052994 grey|0.052994 dark|0.015506 gray|0.015506 dark|0.015506 grey|0.015506  "
		}
	}
}
