{
	"add": {
		"doc": {
			"id": "37914c95aabeafad4db112c445b7fdcaa8ba7e40d1e26e91d8cee2fa2dc528ce",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/PAN_stabilization.PNG/250px-PAN_stabilization.PNG",
				"previous": "Each carbon filament is produced from a polymer such as polyacrylonitrile (PAN), rayon, or petroleum pitch, known as a precursor. For synthetic polymers such as PAN or rayon, the precursor is first spun into filament yarns, using chemical and mechanical processes to initially align the polymer atoms in a way to enhance the final physical properties of the completed carbon fiber. Precursor compositions and mechanical processes used during spinning filament yarns may vary among manufacturers. After drawing or spinning, the polymer filament yarns are then heated to drive off non-carbon atoms (carbonization), producing the final carbon fiber. The carbon fibers filament yarns may be further treated to improve handling qualities, then wound on to bobbins.[14]",
				"after": "A common method of manufacture involves heating the spun PAN filaments to approximately 300 °C in air, which breaks many of the hydrogen bonds and oxidizes the material. The oxidized PAN is then placed into a furnace having an inert atmosphere of a gas such as argon, and heated to approximately 2000 °C, which induces graphitization of the material, changing the molecular bond structure. When heated in the correct conditions, these chains bond side-to-side (ladder polymers), forming narrow graphene sheets which eventually merge to form a single, columnar filament. The result is usually 93–95% carbon. Lower-quality fiber can be manufactured using pitch or rayon as the precursor instead of PAN. The carbon can become further enhanced, as high modulus, or high strength carbon, by heat treatment processes. Carbon heated in the range of 1500–2000 °C (carbonization) exhibits the highest tensile strength (820,000 psi, 5,650 MPa or N/mm²), while carbon fiber heated from 2500 to 3000 °C (graphitizing) exhibits a higher modulus of elasticity (77,000,000 psi or 531 GPa or 531 kN/mm²).",
			"color": "white|0.092987 smoke|0.092987 sea|0.091939 shell|0.091939 snow|0.091874 ghost|0.091766 white|0.091766 alice|0.091627 blue|0.091627 white|0.091497 mint|0.090969 cream|0.090969 floral|0.090781 white|0.090781 azure|0.090175 lavender|0.089943 blush|0.089943 dark|0.014738 gray|0.014738 dark|0.014738 grey|0.014738 gray|0.013917 grey|0.013917 silver|0.0094997 light|0.0072432 gray|0.0072432 light|0.0072432 grey|0.0072432 gainsboro|0.0064286 black|0.005793 dim|0.0053935 gray|0.0053935 dim|0.0053935 grey|0.0053935 light|0.0041617 coral|0.0041617 ivory|0.0027829  "
		}
	}
}
