{
	"add": {
		"doc": {
			"id": "37950a7348f639f59f35bd72434dc85013d68783406f978e23880eb5124542c3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/SportHaflingerKutsche.jpg/220px-SportHaflingerKutsche.jpg",
				"previous": "World War I resulted in many Haflingers being taken into military service and the interruption of breeding programs. After the war, under the terms of the Treaty of Saint Germain, South Tyrol (including Hafling) was ceded to Italy, while North Tyrol remained in Austria. This split was extremely detrimental to the Haflinger breed, as most of the brood mares were in South Tyrol in what was now Italy, while the high-quality breeding stallions had been kept at studs in North Tyrol and so were still in Austria. Little effort at cooperation was made between breeders in North and South Tyrol, and in the 1920s a new Horse Breeders' Commission was established in Bolzano in Italy, which was given governmental authority to inspect state-owned breeding stallions, register privately owned stallions belonging to Commission members, and give prize money for horse show competition. The Commission governed the breeding of the Italian population of both the Haflinger and the Noriker horse. In 1921, because of the lack of breeding stallions in Italy, a crossbred Sardinian-Arabian stallion was used for the Haflinger breeding program, as well as many lower-quality purebred Haflingers.[25]",
				"after": "If not for the presence of Haflinger stallions at a stud farm in Stadl-Paura in Upper Austria after World War I, the Haflinger might well not exist in Austria today. Despite these stallions, the Haflinger breeding programs were not on solid footing in Austria, with governmental focus on other Austrian breeds and private breeding programs not large enough to influence national breeding practices.[26] During this time, the breed was kept alive through crosses to the Hucul, Bosnian, Konik and Noriker breeds.[19] In 1919 and 1920, the remaining stallions were assigned throughout Austria, many to areas that had hosted private breeding farms before the war. In 1921, the North Tyrolean Horse Breeders' Cooperative was formed in Zams, and in 1922, the first Haflinger Breeders' Show was held in the same location. Many extant Austrian Haflinger mares were considered to be of too low quality to be used as brood mares, and every effort was made to import higher-quality brood mares from the South Tyrol herds now in Italy. In 1926, the first studbook was established in North Tyrol.[26] In the late 1920s, other cooperatives were established for Haflinger breeders in Weer and Wildschönau, and were able to gain government permission to purchase 100 Haflinger mares from South Tyrol and split them between North Tyrol, Upper Austria and Styria. This single transaction represented one third of all registered mares in South Tyrol, and many others were sold through private treaty, leaving the two regions comparable in terms of breeding-stock populations. In 1931, another breeders' cooperative was established in East Tyrol in Austria, and Haflinger breeding spread throughout the entire Tyrolean province.[27]",
			"color": "black|0.36659 dim|0.26925 gray|0.26925 dim|0.26925 grey|0.26925 gray|0.14925 grey|0.14925 dark|0.058956 gray|0.058956 dark|0.058956 grey|0.058956 slate|0.03614 gray|0.03614 dark|0.034707 olive|0.034707 green|0.034707  "
		}
	}
}
