{
	"add": {
		"doc": {
			"id": "37b5c321038be7a96ba7f8ccc216d8fcedd48acd8252c4b52937d392e039927f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Warkworth_1945_OS_map.png/300px-Warkworth_1945_OS_map.png",
			"previous": [],
				"after": "Although the settlement of Warkworth in Northumberland dates back to at least the 8th century, the first castle was not built until after the Norman Conquest.[1] The town and its castle occupied a loop of the River Coquet. The castle was built at the south end of the town, guarding the narrow neck of the loop. A fortified bridge also defended the approach to the town.[2] The surrounding lowland countryside was favourable for agriculture.[3] When the castle was founded and by whom is uncertain, though traditionally Prince Henry of Scotland has been thought responsible.[4] With civil war in south-west England, King Stephen of England needed to ensure northern England was secure. To this end, the Treaty of Durham in 1139 between Scotland and England ensured peace. Under the treaty Henry of Scotland became Earl of Northumbria in exchange for ceding control of the castles at Bamburgh and Newcastle to the English.[5] Without them Henry would have needed a new seat from which to exercise his authority, and a new castle at Warkworth may have met the requirement. However, charters show that Henry still controlled Bamburgh Castle after the treaty, and as Warkworth was a modest castle by contemporary standards it may be have been founded by someone else.[4] Henry died in 1152 and his son, Malcolm (crowned King of Scotland in 1153), inherited his lands. In 1157 Malcolm travelled to Peveril Castle in Derbyshire, where he paid homage to the new King of England, Henry II.[6] Malcolm surrendered England's northern counties to Henry, including the castles of Bamburgh, Carlisle, and Newcastle, and probably Appleby, Brough, Wark, and Warkworth,[7] though it is possible that Henry II founded Warkworth Castle in 1157 to secure his lands in Northumberland; other contemporary castles in the area were built for this purpose, for instance the one at Harbottle.[8]",
			"color": " "
		}
	}
}
