{
	"add": {
		"doc": {
			"id": "37b5d666676215fa87f359cb9f1effbabb6be83223329947383c62c34f60b396",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Andew_Johnson_impeachment_trial.jpg/220px-Andew_Johnson_impeachment_trial.jpg",
				"previous": "The Constitution provides several unique functions for the Senate that form its ability to \"check and balance\" the powers of other elements of the Federal Government. These include the requirement that the Senate may advise and must consent to some of the president's government appointments; also the Senate must consent to all treaties with foreign governments; it tries all impeachments, and it elects the vice president in the event no person gets a majority of the electoral votes.",
				"after": "The president can make certain appointments only with the advice and consent of the Senate. Officials whose appointments require the Senate's approval include members of the Cabinet, heads of most federal executive agencies, ambassadors, Justices of the Supreme Court, and other federal judges. Under Article II, Section 2 of the Constitution, a large number of government appointments are subject to potential confirmation; however, Congress has passed legislation to authorize the appointment of many officials without the Senate's consent (usually, confirmation requirements are reserved for those officials with the most significant final decision-making authority). Typically, a nominee is first subject to a hearing before a Senate committee. Thereafter, the nomination is considered by the full Senate. The majority of nominees are confirmed, but in a small number of cases each year, Senate committees will purposely fail to act on a nomination to block it. In addition, the president sometimes withdraws nominations when they appear unlikely to be confirmed. Because of this, outright rejections of nominees on the Senate floor are infrequent (there have been only nine Cabinet nominees rejected outright in the history of the United States).",
			"color": " "
		}
	}
}
