{
	"add": {
		"doc": {
			"id": "37c190f83941061cceec83e66b989efae9f5d4cd6b1fea302d282c9905993f81",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Harp_seal_mother_and_pup.jpg/220px-Harp_seal_mother_and_pup.jpg",
				"previous": "With the exception of the walrus, which has five- to six-year-long inter-birth intervals, female pinnipeds enter estrous shortly after they give birth.[119] All species go through delayed implantation, wherein the embryo remains in suspended development for weeks or months before it is implanted in the uterus. Delayed implantation postpones the birth of young until the female hauls-out on land or until conditions for birthing are favorable.[119][120] Gestation in seals (including delayed implantation) typically lasts a year.[119] For most species, birthing takes place in the spring and summer months.[121] Typically, single pups are born;[119] twins are uncommon and have high mortality rates.[120] Pups of most species are born precocial.[119]",
				"after": "Mother pinnipeds have different strategies for maternal care and lactation. Phocids such as elephant seals, grey seals and hooded seals remain on land or ice and fast during their relatively short lactation period–four days for the hooded seal and five weeks for elephant seals. The milk of these species consist of up to 60% fat, allowing the young to grow fairly quickly. In particular, northern elephant seal pups gain 4 kg (9 lb) each day before they are weaned. Some pups may try to steal extra milk from other nursing mothers and gain weight more quickly than others. Alloparenting occurs in these fasting species;[119] while most northern elephant seal mothers nurse their own pups and reject nursings from alien pups, some do accept alien pups with their own.[122]",
			"color": "slate|0.46781 gray|0.46781 light|0.46181 slate|0.46181 gray|0.46181 dim|0.052794 gray|0.052794 dim|0.052794 grey|0.052794 dark|0.010616 slate|0.010616 gray|0.010616 gray|0.0052096 grey|0.0052096  "
		}
	}
}
