{
	"add": {
		"doc": {
			"id": "37c7de095e7884291ad8d1c1968c7346d135dba33409d251b3780ba1ef206ae6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Big_Salmon_Lake.jpg/220px-Big_Salmon_Lake.jpg",
				"previous": "In the same year as the Wilderness Act became law, the Bob Marshall Wilderness, located in Flathead and Lewis and Clark National Forests in Montana, was created. It had previously been set aside in 1941 as the South Fork, Pentagon, and Sun River Primitive Areas.[76] The area encompasses a million acres (4,000 km2) and is one of the best preserved ecosystems in the world. Known as \"The Bob,\" it is the fifth largest wilderness in the contiguous 48 states. In compliance with the 1964 Wilderness Act, there is no motorized or mechanical equipment (including bicycles or hang gliders) permitted. Although camping and fishing are allowed with proper permit, no roads or buildings exist in the area, and logging and mining are prohibited. The Bob Marshall Wilderness Complex (which encompasses Bob Marshall, Scapegoat, and Great Bear Wildernesses) is a habitat for the grizzly bear, lynx, cougar, wolf, black bear, moose, elk and a variety of other birds, mammals, and plants.[76]",
				"after": "Mount Marshall (previously called Mount Herbert), which stands 4,360 feet (1,330 m) high in the Adirondack Mountains, Camp Bob Marshall in the Black Hills, and Marshall Lake in the Brooks Range of Alaska, north of the Arctic Circle, are also named for him.[3] In 2008, the Adirondack Council was encouraging the state of New York to create the Bob Marshall Great Wilderness near Cranberry Lake in the western Adirondacks; if successful, it would be the largest wilderness area in the Adirondack Park at 409,000 acres (639 sq mi; 1,655 km2).[77]",
			"color": "dark|0.35471 slate|0.35471 gray|0.35471 steel|0.23867 blue|0.23867 slate|0.17179 gray|0.17179 light|0.14469 slate|0.14469 gray|0.14469 dim|0.05278 gray|0.05278 dim|0.05278 grey|0.05278 gray|0.020352 grey|0.020352  "
		}
	}
}
