{
	"add": {
		"doc": {
			"id": "37d002d70b82edfcc4156917e8e98008deabc2eed0870c5a5390277029c5cf0c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Galileo_telescope_replica.jpg/220px-Galileo_telescope_replica.jpg",
				"previous": "In about 1593, Galileo constructed a thermometer, using the expansion and contraction of air in a bulb to move water in an attached tube.",
				"after": "In 1609, Galileo was, along with Englishman Thomas Harriot and others, among the first to use a refracting telescope as an instrument to observe stars, planets or moons. The name \"telescope\" was coined for Galileo's instrument by a Greek mathematician, Giovanni Demisiani,[113] at a banquet held in 1611 by Prince Federico Cesi to make Galileo a member of his Accademia dei Lincei.[114] The name was derived from the Greek tele = 'far' and skopein = 'to look or see'. In 1610, he used a telescope at close range to magnify the parts of insects.[115] By 1624 Galileo had used[116] a compound microscope. He gave one of these instruments to Cardinal Zollern in May of that year for presentation to the Duke of Bavaria,[117] and in September he sent another to Prince Cesi.[118] The Linceans played a role again in naming the \"microscope\" a year later when fellow academy member Giovanni Faber coined the word for Galileo's invention from the Greek words μικρόν (micron) meaning \"small\", and σκοπεῖν (skopein) meaning \"to look at\". The word was meant to be analogous with \"telescope\".[119][120] Illustrations of insects made using one of Galileo's microscopes, and published in 1625, appear to have been the first clear documentation of the use of a compound microscope.[121]",
			"color": "black|0.37491 dim|0.098592 gray|0.098592 dim|0.098592 grey|0.098592 corn|0.076473 flower|0.076473 blue|0.076473 gray|0.04568 grey|0.04568 tan|0.042257 wheat|0.041413 navajo|0.034242 white|0.034242 pale|0.032776 golden|0.032776 rod|0.032776 burly|0.031174 wood|0.031174 slate|0.029494 gray|0.029494 moccasin|0.027806 light|0.025787 slate|0.025787 gray|0.025787  "
		}
	}
}
