{
	"add": {
		"doc": {
			"id": "37d376a366736edde8dfdf75cb715de6929c8d81623c375dafb930d8783c3cac",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Georges_Cuvier_-_Elephant_jaw.png/220px-Georges_Cuvier_-_Elephant_jaw.png",
				"previous": "In later editions of the book, Darwin traced evolutionary ideas as far back as Aristotle;[5] the text he cites is a summary by Aristotle of the ideas of the earlier Greek philosopher Empedocles.[6] Early Christian Church Fathers and Medieval European scholars interpreted the Genesis creation narrative allegorically rather than as a literal historical account;[7] organisms were described by their mythological and heraldic significance as well as by their physical form. Nature was widely believed to be unstable and capricious, with monstrous births from union between species, and spontaneous generation of life.[8]",
				"after": "The Protestant Reformation inspired a literal interpretation of the Bible, with concepts of creation that conflicted with the findings of an emerging science seeking explanations congruent with the mechanical philosophy of René Descartes and the empiricism of the Baconian method. After the turmoil of the English Civil War, the Royal Society wanted to show that science did not threaten religious and political stability. John Ray developed an influential natural theology of rational order; in his taxonomy, species were static and fixed, their adaptation and complexity designed by God, and varieties showed minor differences caused by local conditions. In God's benevolent design, carnivores caused mercifully swift death, but the suffering caused by parasitism was a puzzling problem. The biological classification introduced by Carolus Linnaeus in 1735 also viewed species as fixed according to the divine plan. In 1766, Georges Buffon suggested that some similar species, such as horses and asses, or lions, tigers, and leopards, might be varieties descended from a common ancestor. The Ussher chronology of the 1650s had calculated creation at 4004 BC, but by the 1780s geologists assumed a much older world. Wernerians thought strata were deposits from shrinking seas, but James Hutton proposed a self-maintaining infinite cycle, anticipating uniformitarianism.[9]",
			"color": "dim|0.23976 gray|0.23976 dim|0.23976 grey|0.23976 black|0.20274 gray|0.20015 grey|0.20015 dark|0.13679 gray|0.13679 dark|0.13679 grey|0.13679 silver|0.064705 light|0.03983 gray|0.03983 light|0.03983 grey|0.03983 gainsboro|0.030029 white|0.012597 smoke|0.012597 alice|0.0087358 blue|0.0087358 ghost|0.0086803 white|0.0086803 sea|0.0084783 shell|0.0084783 snow|0.0084055 lavender|0.0083407 blush|0.0083407 white|0.0077355 mint|0.0068829 cream|0.0068829 floral|0.0058224 white|0.0058224 azure|0.0054273 linen|0.0044105  "
		}
	}
}
