{
	"add": {
		"doc": {
			"id": "37d518add5f9d98e946beb7e232ca879e55c13522306ff65a3d49083f077fdc7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Fault_tree.png/280px-Fault_tree.png",
				"previous": "The most important fundamental initiating causes and failure mechanisms are to be identified and analyzed with engineering tools. A diverse set of practical guidance and practical performance and reliability requirements should be provided to designers so they can generate low-stressed designs and products that protect or are protected against damage and excessive wear. Proper Validation of input loads (requirements) may be needed and verification for reliability \"performance\" by testing may be needed.",
				"after": "One of the most important design techniques is redundancy. This means that if one part of the system fails, there is an alternate success path, such as a backup system. The reason why this is the ultimate design choice is related to the fact that high confidence reliability evidence for new parts / items is often not available or extremely expensive to obtain. By creating redundancy, together with a high level of failure monitoring and the avoidance of common cause failures, even a system with relative bad single channel (part) reliability, can be made highly reliable (mission reliability) on system level. No testing of reliability has to be required for this. Furthermore, by using redundancy and the use of dissimilar design and manufacturing processes (different suppliers) for the single independent channels, less sensitivity for quality issues (early childhood failures) is created and very high levels of reliability can be achieved at all moments of the development cycles (early life times and long term). Redundancy can also be applied in systems engineering by double checking requirements, data, designs, calculations, software and tests to overcome systematic failures.",
			"color": "dim|0.12159 gray|0.12159 dim|0.12159 grey|0.12159 gray|0.087379 grey|0.087379 white|0.06821 smoke|0.06821 alice|0.065853 blue|0.065853 ghost|0.065814 white|0.065814 sea|0.065798 shell|0.065798 snow|0.065783 white|0.065603 mint|0.065314 cream|0.065314 floral|0.06476 white|0.06476 azure|0.064517 lavender|0.063495 blush|0.063495 black|0.062529 dark|0.035483 gray|0.035483 dark|0.035483 grey|0.035483 silver|0.015738 light|0.00933 gray|0.00933 light|0.00933 grey|0.00933 gainsboro|0.0085556  "
		}
	}
}
