{
	"add": {
		"doc": {
			"id": "37fb80595932ff0bf68534dc9f53469da3d5c2a9dc2c8a83da7cd36cdab50e17",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/MainStreetbanner.jpg/220px-MainStreetbanner.jpg",
				"previous": "The city of Columbia has recently accomplished a number of urban redevelopment projects and has several more planned.[45] The historic Congaree Vista, a 1,200-acre (5 km2) district running from the central business district toward the Congaree river, features a number of historic buildings that have been rehabilitated since its revitalization begun in the late 1980s. Of note is the adaptive reuse of the Confederate Printing Plant on Gervais and Huger, used to print Confederate bills during the American Civil War. The city cooperated with Publix grocery stores to preserve the look. This won Columbia an award from the International Downtown Association.[46] The Vista district is also where the region's convention center and anchor Hilton hotel with a Ruth's Chris Steakhouse restaurant are located. Other notable developments under construction and recently completed include high-end condos and townhomes, hotels, and mixed-use structures.",
				"after": "The older buildings lining the Vista's main drag, Gervais, now house art galleries, restaurants, unique shops, and professional office space. Near the end of Gervais is the South Carolina State Museum and the EdVenture Children's Museum. Private student housing and some residential projects are going up nearby; the CanalSide development[47] at the site of the old Central Correctional Institution, is the most high profile. At full build-out, the development will have 750 residential units and provides access to Columbia's waterfront. Lady Street between Huger and Assembly streets in the Vista and the Five Points neighborhood have undergone beautification projects, which mainly consisted of replacing curbs and gutters, and adding brick-paved sidewalks and angled parking.",
			"color": "black|0.37151 dark|0.11599 olive|0.11599 green|0.11599 dim|0.10254 gray|0.10254 dim|0.10254 grey|0.10254 gray|0.095583 grey|0.095583 light|0.045551 slate|0.045551 gray|0.045551 dark|0.044816 gray|0.044816 dark|0.044816 grey|0.044816 slate|0.042224 gray|0.042224 olive|0.035998 drab|0.035998 dark|0.022965 slate|0.022965 gray|0.022965 light|0.01355 steel|0.01355 blue|0.01355 silver|0.013421  "
		}
	}
}
