{
	"add": {
		"doc": {
			"id": "3801371d91c69a220c69512c577414ec4532efbfcc691d0a7d7d72d63ea20196",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Glad_to_See_You_Together.png/170px-Glad_to_See_You_Together.png",
				"previous": "Utopia, Limited (1893), their penultimate opera, was a very modest success, and their last, The Grand Duke (1896) was an outright failure.[83] Neither work entered the canon of regularly performed Gilbert and Sullivan works until the D'Oyly Carte Opera Company made the first complete professional recordings of the two operas in the 1970s. Gilbert had also offered Sullivan another libretto, His Excellency (1894), but Gilbert's insistence on casting Nancy McIntosh, his protege from Utopia, led to Sullivan's refusal, and His Excellency was instead composed by F. Osmond Carr.[84] Meanwhile, the Savoy Theatre continued to revive the Gilbert and Sullivan operas, in between new pieces, and D'Oyly Carte touring companies also played them in repertory.",
				"after": "After The Grand Duke, the partners saw no reason to work together again. A last unpleasant misunderstanding occurred in 1898. At the premiere of Sullivan’s opera The Beauty Stone on 28 May, Gilbert arrived at the Savoy Theatre with friends, assuming that Sullivan had reserved some seats for him. Instead, he was informed that Sullivan objected to his presence. The composer later denied that this was true.[78] The last time they met was at the Savoy Theatre on 17 November 1898 at the celebration of the 21st anniversary of the first performance of The Sorcerer. They did not speak to each other.[85] Sullivan, by this time in exceedingly poor health, died in 1900, although to the end he continued to write new comic operas for the Savoy with other librettists, most successfully with Basil Hood in The Rose of Persia (1899). Gilbert also wrote several works, some with other collaborators, in the 1890s. By the time of Sullivan's death in 1900, Gilbert wrote that any memory of their rift had been \"completely bridged over,\" and \"the most cordial relations existed between us.\"[78][86] He stated that Sullivan was \"A composer of the rarest genius – who, because he was a composer of the rarest genius, was as modest and as unassuming as a neophyte should be, but seldom is.... I remember all that he has done for me in allowing his genius to shed some of its lustre upon my humble name.\"[86]",
			"color": "dim|0.29593 gray|0.29593 dim|0.29593 grey|0.29593 gray|0.278 grey|0.278 dark|0.18947 gray|0.18947 dark|0.18947 grey|0.18947 silver|0.08234 light|0.043077 gray|0.043077 light|0.043077 grey|0.043077 black|0.041554 gainsboro|0.031421 white|0.0074419 smoke|0.0074419 lavender|0.0039108 blush|0.0039108 alice|0.0039108 blue|0.0039108 ghost|0.0037888 white|0.0037888 sea|0.0036843 shell|0.0036843 snow|0.0035929 linen|0.003267  "
		}
	}
}
