{
	"add": {
		"doc": {
			"id": "3804dd776ee23a0c429b70c313765817297cee92d58339603d784d54b8318f44",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Rubha_an_D%C3%B9nain_5.jpg/220px-Rubha_an_D%C3%B9nain_5.jpg",
				"previous": "A Mesolithic hunter-gatherer site dating to the 7th millennium BC at An Corran in Staffin is one of the oldest archaeological sites in Scotland. Its occupation is probably linked to that of the rock shelter at Sand, Applecross, on the mainland coast of Wester Ross where tools made of a mudstone from An Corran have been found. Surveys of the area between the two shores of the Inner Sound and Sound of Raasay have revealed 33 sites with potentially Mesolithic deposits.[42][43] Finds of bloodstone microliths on the foreshore at Orbost on the west coast of the island near Dunvegan also suggest Mesolithic occupation. These tools probably originate from the nearby island of Rum.[44]",
				"after": "Rubha an Dùnain, an uninhabited peninsula to the south of the Cuillin, has a variety of archaeological sites dating from the Neolithic onwards. There is a 2nd or 3rd millennium BC chambered cairn, an Iron Age promontory fort and the remains of other prehistoric settlement dating from the Bronze Age nearby. Loch na h-Airde on the peninsula is linked to the sea by an artificial \"Viking\" canal that may date from the later period of Norse settlement.[45][46] Dun Ringill is a ruined Iron Age hill fort on the Strathaird peninsula, which was further fortified in the Middle Ages and may have become the seat of Clan MacKinnon.[47]",
			"color": "tan|0.27168 burly|0.23571 wood|0.23571 peach|0.078437 puff|0.078437 bisque|0.039156 black|0.037106 navajo|0.033313 white|0.033313 antique|0.030406 white|0.030406 wheat|0.029548 rosy|0.028875 brown|0.028875 misty|0.022101 rose|0.022101 blanched|0.021971 almond|0.021971 papaya|0.017835 whip|0.017835 moccasin|0.017728 linen|0.012295 dim|0.011111 gray|0.011111 dim|0.011111 grey|0.011111 dark|0.010219 gray|0.010219 dark|0.010219 grey|0.010219 old|0.010207 lace|0.010207  "
		}
	}
}
