{
	"add": {
		"doc": {
			"id": "380e6a8f021bc028f1f7b74429de014985e31de805be08a7c1605e59a283017a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Kinross_House_01.jpg/200px-Kinross_House_01.jpg",
				"previous": "His first commission for a new building was for the construction of Dunkeld House, and came from the Earl of Atholl in 1676.[1] The house had been badly damaged in 1654, during the civil war, and Bruce was given the task of building its replacement. (The house was later demolished). Another early full-scale commission was for Moncrieffe House (1679), which burned down in 1957.[35]",
				"after": "In 1675, Bruce bought the estate of Loch Leven from the Earl of Morton. The estate included an old manor near Kinross, as well as the ruins of Loch Leven Castle, famous as the jail of Mary, Queen of Scots. After carrying out repairs on the old manor, and beginning to lay out the gardens, Bruce began work on his new home, Kinross House, in 1686, employing master mason Thomas Bauchop. The Palladian building bears some resemblance to Roger Pratt's Coleshill House of 1660 (demolished), but with features Bruce derived from French sources. These features, ultimately classical and Italian in origin, include the rusticated basement stonework, and the giant order of corinthian pilasters, the latter possibly deriving from Bernini's first designs for the Louvre.[36] Following Bruce's fall from favour, he found himself increasingly in debt, which delayed the completion of the house until 1693.[37] Kinross was one of the earliest Palladian-style country houses in Scotland, and was recognised as one of the finest buildings in the country; Daniel Defoe described it as \"the most beautiful and regular piece of Architecture in Scotland\", and Thomas Pennant called Kinross \"the first good house of regular architecture in North Britain\".[38]",
			"color": "black|0.16032 dim|0.11957 gray|0.11957 dim|0.11957 grey|0.11957 dark|0.099018 gray|0.099018 dark|0.099018 grey|0.099018 gray|0.086973 grey|0.086973 dark|0.07525 olive|0.07525 green|0.07525 silver|0.047828 light|0.034399 gray|0.034399 light|0.034399 grey|0.034399 white|0.033276 smoke|0.033276 sea|0.033033 shell|0.033033 floral|0.031738 white|0.031738 snow|0.029592 mint|0.028919 cream|0.028919 gainsboro|0.028036 white|0.027793 linen|0.022803 ghost|0.020601 white|0.020601 azure|0.020495 ivory|0.018017 alice|0.016678 blue|0.016678 old|0.014676 lace|0.014676 lavender|0.011282 blush|0.011282  "
		}
	}
}
