{
	"add": {
		"doc": {
			"id": "380e98576e4f25c1d7ecc78b4f766aed07fde1cb8bb3e786129d9a0788c400c1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Leif_Erickson_and_Springville_Rd._Forest_Park.jpg/220px-Leif_Erickson_and_Springville_Rd._Forest_Park.jpg",
			"previous": [],
				"after": "Forest Park has twice in its history been involved in murder, though has been more frequently involved with various other crimes. In 2001, a man who preyed on heroin addicts and prostitutes pleaded guilty to the 1999 murder of three women whose bodies were found in Forest Park near Northwest Saltzman Road, though forensic analysis showed the murders took place elsewhere and the bodies were brought to Forest Park.[48] In 2003, jurors convicted another man of the 1996 murder of his ex-girlfriend on a Forest Park trail.[49] Less serious crimes have included assault (rarely), car break-ins and petty theft (frequently at trail heads), rare arsons,[50] rare indecent exposure,[51] and marijuana cultivation. Multnomah County Sheriff's deputies in 2007 seized 114 mature marijuana plants found growing in the park on a hillside near Portland's Linnton neighborhood. Deputies had seized another small grow operation in the park in 2005.[52] More common has been illegal camping by homeless transients and others.[53] An illegal bicycling trail, about 1 mile (1.6 km) long, was discovered in a remote part of the park in February 2010.[54] In 2014, hikers found a booby trap meant to fire a shotgun shell across a path leading to the park. Portland police removed the device.[55]",
			"color": "dim|0.23772 gray|0.23772 dim|0.23772 grey|0.23772 gray|0.18328 grey|0.18328 antique|0.1105 white|0.1105 dark|0.08911 gray|0.08911 dark|0.08911 grey|0.08911 silver|0.063138 linen|0.037119 papaya|0.033271 whip|0.033271 light|0.031745 gray|0.031745 light|0.031745 grey|0.031745 black|0.029607 old|0.027035 lace|0.027035 blanched|0.02329 almond|0.02329 sea|0.017979 shell|0.017979 gainsboro|0.016477 beige|0.015935 misty|0.014853 rose|0.014853 floral|0.014345 white|0.014345 bisque|0.011965 corn|0.011431 silk|0.011431  "
		}
	}
}
