{
	"add": {
		"doc": {
			"id": "3816df137273b9f5ebe1f227ea565d67028307abd3351a4bfa704acbbb63bde8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Venezia_-_Chiesa_dei_SS._Giovanni_e_Paolo_%28S._Zanipolo%29_-_Foto_G._Dall%27Orto_2_lug_2006_-_08.jpg/220px-Venezia_-_Chiesa_dei_SS._Giovanni_e_Paolo_%28S._Zanipolo%29_-_Foto_G._Dall%27Orto_2_lug_2006_-_08.jpg",
				"previous": "The Catacombs of Rome contain most of the surviving Christian art of the Early Christian period, mainly in the form of frescos and sculpted sarcophagi. They show a Christian iconography emerging, initially from Roman popular decorative art, but later borrowing from official imperial and pagan motifs. Initially, Christians avoided iconic images of religious figures, and sarcophagi were decorated with ornaments, Christian symbols like the Chi Rho monogram and, later, narrative religious scenes.[99] The Early Christians' habit, after the end of their persecution, of building churches (most famously St Peter's, Rome) over the burial places of martyrs who had originally been buried discreetly or in a mass grave perhaps led to the most distinctive feature of Christian funerary art, the church monument, or tomb inside a church.[100] The beliefs of many cultures, including Judaism and Hinduism as well as classical paganism, consider the dead ritually impure and avoid mixing temples and cemeteries (though see above for Moche, and below for Islamic culture).[101]",
				"after": "Christians believed in a bodily resurrection of the dead at the Second Coming of Christ, and the Catholic Church only relaxed its opposition to cremation in 1963.[102] Although mass ossuaries have also been used, burial has always been the preferred Christian tradition, at least until recent times. Burial was, for as long as there was room, usually in a graveyard adjacent to the church, with a gravestone or horizontal slab, or for the wealthy or important clergy, inside it. Wall tombs in churches strictly include the body itself, often in a sarcophagus, while often the body is buried in a crypt or under the church floor, with a monument on the wall. Persons of importance, especially monarchs, might be buried in a free-standing sarcophagus, perhaps surrounded by an elaborate enclosure using metalwork and sculpture; grandest of all were the shrines of saints, which became the destinations of pilgrimages. The monument to Maximilian I, Holy Roman Emperor in the Hofkirche, Innsbruck took decades to complete,[103] while the tomb of Saint Dominic in Bologna took several centuries to reach its final form.[104]",
			"color": "black|0.2891 gray|0.10574 grey|0.10574 dim|0.095429 gray|0.095429 dim|0.095429 grey|0.095429 dark|0.090487 gray|0.090487 dark|0.090487 grey|0.090487 silver|0.057858 tan|0.038247 light|0.036447 gray|0.036447 light|0.036447 grey|0.036447 antique|0.030726 white|0.030726 gainsboro|0.02396 linen|0.019221 old|0.015169 lace|0.015169 papaya|0.014829 whip|0.014829 sea|0.013751 shell|0.013751 floral|0.01314 white|0.01314 blanched|0.012633 almond|0.012633 bisque|0.011008 beige|0.010539 white|0.010351 smoke|0.010351 ivory|0.0092812 corn|0.0090284 silk|0.0090284 snow|0.0085051 rosy|0.0081542 brown|0.0081542 wheat|0.0080653 peach|0.0075273 puff|0.0075273 white|0.0067408 mint|0.0066919 cream|0.0066919  "
		}
	}
}
