{
	"add": {
		"doc": {
			"id": "3818720522c6a004045f49fac3770d42ec2001e2a089feb2cd0aaa5c05e8988a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Herodotus_world_map-en.svg/400px-Herodotus_world_map-en.svg.png",
				"previous": "The accuracy of the works of Herodotus has been controversial since his own era.[59] Cicero,[60][61] Aristotle, Josephus, Duris of Samos[62][63] Harpocration[64][65] and Plutarch all commented on this controversy.[66][67] Generally, though, he was then, and especially is now, regarded as reliable. Many scholars (Aubin, A. H. L. Heeren, Davidson, Cheikh Anta Diop, Poe, Welsby, Celenko, Volney, Pierre Montet, Bernal, Jackson, DuBois, Strabo), ancient and modern, routinely cite Herodotus. Many of these scholars (Welsby, Heeren, Aubin, Diop, etc.) explicitly mention the reliability of Herodotus's work[68] and demonstrate corroboration of Herodotus's writings by modern scholars.[69][70] A.H.L. Heeren quoted Herodotus throughout his work and provided corroboration by scholars regarding several passages (source of the Nile, location of Meroe, etc.).[71] To further his work on the Egyptians and Assyrians, Aubin uses Herodotus's accounts in various passages and defends Herodotus's position. Aubin said Herodotus was \"the author of the first important narrative history of the world\".[72] Diop provides several examples (the inundations of the Nile) that he argues support his view that Herodotus was \"quite scrupulous, objective, scientific for his time.\" Diop argues that Herodotus \"always distinguishes carefully between what he has seen and what he has been told.\" Diop also notes that Strabo corroborated Herodotus's ideas about the Black Egyptians, Ethiopians, and Colchians.[73][74]",
				"after": "The reliability of Herodotus is sometimes criticized when writing about Egypt.[57][75] Alan B. Lloyd argues that as a historical document, the writings of Herodotus are seriously defective, and that he was working from \"inadequate sources\".[76] Nielsen writes that: \"Though we cannot entirely rule out the possibility of Herodotus having been in Egypt, it must be said that his narrative bears little witness to it.\"[77] German historian Detlev Fehling questions whether Herodotus ever traveled up the Nile River, and considers almost everything he says about Egypt and Ethiopia doubtful.[78][79] About the claim of Herodotus that the Pharaoh Sesostris campaigned in Europe, and that he left a colony in Colchia, Fehling states that \"there is not the slightest bit of history behind the whole story\".[54][80][81]",
			"color": "dark|0.3768 khaki|0.3768 white|0.044561 smoke|0.044561 alice|0.043796 blue|0.043796 ghost|0.043171 white|0.043171 snow|0.042209 white|0.041627 sea|0.041389 shell|0.041389 mint|0.041076 cream|0.041076 azure|0.040623 floral|0.04051 white|0.04051 lavender|0.033708 blush|0.033708 light|0.033552 steel|0.033552 blue|0.033552 wheat|0.023531 lavender|0.017739 dark|0.016267 gray|0.016267 dark|0.016267 grey|0.016267 gainsboro|0.014121 light|0.011498 gray|0.011498 light|0.011498 grey|0.011498 silver|0.011391 gray|0.0096266 grey|0.0096266 ivory|0.009029 light|0.0088316 blue|0.0088316 dim|0.0079688 gray|0.0079688 dim|0.0079688 grey|0.0079688 dark|0.0047697 slate|0.0047697 blue|0.0047697 linen|0.0046662 midnight|0.0044207 blue|0.0044207 blanched|0.0040304 almond|0.0040304  "
		}
	}
}
