{
	"add": {
		"doc": {
			"id": "381bde7928feb07c356b845636100cc86f68fa4375f7c6f3e8b14ab10346f810",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/860808-Saffronfarm-05-IMG_7845-2.jpg/220px-860808-Saffronfarm-05-IMG_7845-2.jpg",
				"previous": "Crocus sativus thrives in the Mediterranean maquis, an ecotype superficially resembling the North American chaparral, and similar climates where hot and dry summer breezes sweep semi-arid lands. It can nonetheless survive cold winters, tolerating frosts as low as −10 °C (14 °F) and short periods of snow cover.[17][21] Irrigation is required if grown outside of moist environments such as Kashmir, where annual rainfall averages 1,000–1,500 mm (39–59 in); saffron-growing regions in Greece (500 mm or 20 in annually) and Spain (400 mm or 16 in) are far drier than the main cultivating Iranian regions. What makes this possible is the timing of the local wet seasons; generous spring rains and drier summers are optimal. Rain immediately preceding flowering boosts saffron yields; rainy or cold weather during flowering promotes disease and reduces yields. Persistently damp and hot conditions harm the crops,[22] and rabbits, rats, and birds cause damage by digging up corms. Nematodes, leaf rusts, and corm rot pose other threats. Yet Bacillus subtilis inoculation may provide some benefit to growers by speeding corm growth and increasing stigma biomass yield.[23]",
				"after": "The plants fare poorly in shady conditions; they grow best in full sunlight. Fields that slope towards the sunlight are optimal (i.e., south-sloping in the Northern Hemisphere). Planting is mostly done in June in the Northern Hemisphere, where corms are lodged 7–15 cm (2.8–5.9 in) deep; its roots, stems, and leaves can develop between October and February.[2] Planting depth and corm spacing, in concert with climate, are critical factors in determining yields. Mother corms planted deeper yield higher-quality saffron, though form fewer flower buds and daughter corms. Italian growers optimise thread yield by planting 15 cm (5.9 in) deep and in rows 2–3 cm (0.79–1.18 in) apart; depths of 8–10 cm (3.1–3.9 in) optimise flower and corm production. Greek, Moroccan, and Spanish growers employ distinct depths and spacings that suit their locales.",
			"color": "burly|0.11302 wood|0.11302 sienna|0.051582 navajo|0.050721 white|0.050721 dim|0.04956 gray|0.04956 dim|0.04956 grey|0.04956 black|0.047929 tan|0.04673 rosy|0.045448 brown|0.045448 gray|0.036111 grey|0.036111 saddle|0.035938 brown|0.035938 dark|0.035772 gray|0.035772 dark|0.035772 grey|0.035772 pale|0.034193 golden|0.034193 rod|0.034193 silver|0.027471 linen|0.027322 misty|0.025296 rose|0.025296 antique|0.024877 white|0.024877 sea|0.023525 shell|0.023525 light|0.02246 gray|0.02246 light|0.02246 grey|0.02246 old|0.021773 lace|0.021773 moccasin|0.021099 floral|0.020846 white|0.020846 gainsboro|0.018189 white|0.017552 smoke|0.017552 snow|0.01665 peru|0.016453 lavender|0.015002 blush|0.015002 wheat|0.012942 ivory|0.012794 papaya|0.01138 whip|0.01138 khaki|0.011043 white|0.01096 peach|0.010761 puff|0.010761 bisque|0.0097391 blanched|0.0093758 almond|0.0093758  "
		}
	}
}
