{
	"add": {
		"doc": {
			"id": "38207f6259f1b81dad618db49fce1c4c69aa7e8dbf5f3f337fe3ac02701d51a8",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/0/06/1930-election.jpg/220px-1930-election.jpg",
				"previous": "The party's nominal Deputy Leader was Rudolf Hess, but he had no real power in the party. By the early 1930s the senior leaders of the party after Hitler were Himmler, Goebbels and Göring. Beneath the Leadership Corps were the party's regional leaders, the Gauleiters, each of whom commanded the party in his Gau (\"region\"). Joseph Goebbels began his ascent through the party hierarchy as Gauleiter of Berlin-Brandenburg in 1926. Streicher was Gauleiter of Franconia, where he published his antisemitic newspaper Der Stürmer. Beneath the Gauleiter were lower-level officials, the Kreisleiter (\"county leaders\"), Zellenleiter (\"cell leaders\") and Blockleiter (\"block leaders\"). This was a strictly hierarchical structure in which orders flowed from the top, and unquestioning loyalty was given to superiors. Only the SA retained some autonomy. Being composed largely of unemployed workers, many SA men took the Nazis' socialist rhetoric seriously. At this time, the Hitler salute (borrowed from the Italian fascists) and the greeting \"Heil Hitler!\" were adopted throughout the party.",
				"after": "The Nazis contested elections to the national parliament, the Reichstag, and to the state legislatures, the Landtags, from 1924, although at first with little success. The \"National-Socialist Freedom Movement\" polled 3% of the vote in the December 1924 Reichstag elections, and this fell to 2.6% in 1928. State elections produced similar results. Despite these poor results, and despite Germany's relative political stability and prosperity during the later 1920s, the Nazi Party continued to grow. This was partly because Hitler, who had no administrative ability, left the party organization to the head of the secretariat, Philipp Bouhler, the party treasurer Franz Xaver Schwarz, and business manager Max Amann. The party had a capable propaganda head in Gregor Strasser, who was promoted to national organizational leader in January 1928. These men gave the party efficient recruitment and organizational structures. The party also owed its growth to the gradual fading away of competitor nationalist groups, such as the German National People's Party (DNVP). As Hitler became the recognized head of the German nationalists, other groups declined or were absorbed.",
			"color": "gainsboro|0.083252 white|0.076179 smoke|0.076179 light|0.075187 gray|0.075187 light|0.075187 grey|0.075187 sea|0.05655 shell|0.05655 snow|0.055699 ghost|0.053332 white|0.053332 linen|0.050512 alice|0.050395 blue|0.050395 white|0.046354 lavender|0.044914 blush|0.044914 dark|0.044306 gray|0.044306 dark|0.044306 grey|0.044306 mint|0.041862 cream|0.041862 silver|0.040239 gray|0.037289 grey|0.037289 floral|0.035892 white|0.035892 black|0.035427 dim|0.027986 gray|0.027986 dim|0.027986 grey|0.027986 azure|0.02757 dark|0.015216 red|0.015216 ivory|0.011828 maroon|0.011592 lavender|0.010591 old|0.010336 lace|0.010336 honeydew|0.0083926 misty|0.0049359 rose|0.0049359 light|0.0048936 cyan|0.0048936 beige|0.0036436 sienna|0.0034866 rosy|0.0033048 brown|0.0033048 antique|0.0030023 white|0.0030023  "
		}
	}
}
