{
	"add": {
		"doc": {
			"id": "383e71cb409e1b6ac1302b002eacce5ea035235dd6f2d177848633e36a8c983c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Mary_Rose_iron_gun_watercolor.jpg/220px-Mary_Rose_iron_gun_watercolor.jpg",
				"previous": "In the summer of 1836, a group of five fishermen caught their nets on timbers protruding from the bottom of the Solent. They contacted a diver to help them remove the hindrance, and on 10 June, Henry Abbinett became the first person to see the Mary Rose in almost 300 years. Later, two other professional divers, John Deane and William Edwards, were employed. Using a recently invented rubber suit and metal diving helmet, Deane and Edwards began to examine the wreck and salvage items from it. Along with an assortment of timbers and wooden objects, including several longbows, they brought up several bronze and iron guns, which were sold to the Board of Ordnance for over £220. Initially, this caused a dispute between Deane (who had also brought in his brother Charles into the project), Abbinett and the fishermen who had hired them. The matter was eventually settled by allowing the fishermen a share of the proceeds from the sale of the first salvaged guns, while Deane received exclusive salvage rights at the expense of Abbinett. The wreck was soon identified as the Mary Rose from the inscriptions of one of the bronze guns manufactured in 1537.[94]",
				"after": "The identification of the ship led to significant public interest in the salvage operation, and caused a great demand for the objects which were brought up. Though many of the objects could not be properly conserved at the time and subsequently deteriorated, many were documented with pencil sketches and watercolour drawings which survive to this day. John Deane ceased working on the wreck in 1836, but returned in 1840 with new, more destructive methods. With the help of condemned bomb shells filled with gunpowder acquired from the Ordnance Board he blasted his way into parts of the wreck. Fragments of bombs and traces of blasting craters were found during the modern excavations, but there was no evidence that Deane managed to penetrate the hard layer that had sealed off the Tudor levels. Deane reported retrieving a bilge pump and the lower part of the main mast, both of which would have been located inside the ship. The recovery of small wooden objects like longbows, suggest that Deane did manage to penetrate the Tudor levels at some point, though this has been disputed by the excavation project leader Margaret Rule. Newspaper reports on Deane's diving operations in October 1840 report that the ship was clinker built, but since the sterncastle is the only part of the ship with this feature, an alternative explanation has been suggested: Deane did not penetrate the hard shelly layer that covered most of the ship, but only managed to get into remains of the sterncastle that today no longer exist. Despite the rough handling by Deane the Mary Rose escaped the wholesale destruction by giant rakes and explosives that was the fate of other wrecks in the Solent.[95]",
			"color": "wheat|0.19081 peach|0.17947 puff|0.17947 bisque|0.12834 tan|0.10896 navajo|0.10301 white|0.10301 moccasin|0.10056 blanched|0.047836 almond|0.047836 sienna|0.033332 peru|0.017569 burly|0.011195 wood|0.011195 saddle|0.011071 brown|0.011071 chocolate|0.0097688 sandy|0.0088215 brown|0.0088215 black|0.0083479 papaya|0.008342 whip|0.008342 lemon|0.0055868 chiffon|0.0055868  "
		}
	}
}
