{
	"add": {
		"doc": {
			"id": "38606fd8a0501bd955ca3efeae4737976704aca65d3dcf5efefff3863976d41f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/London_Kings_Theatre_Haymarket.jpg/220px-London_Kings_Theatre_Haymarket.jpg",
				"previous": "Vanbrugh and Congreve received Queen Anne's authority to form a Company of Comedians on 14 December 1704, and the theatre opened as The Queen's Theatre on 9 April 1705 with imported Italian singers in Gli amori d'Ergasto (The Loves of Ergasto), an opera by Jakob Greber, with an epilogue by Congreve. This was the first Italian opera performed in London.[8] The opera failed, and the season struggled on through May, with revivals of plays and operas.[9] The first new play performed was The Conquest of Spain by Mary Pix.[10] The theatre proved too large for actors' voices to carry across the auditorium, and the first season was a failure. Congreve departed, Vanbrugh bought out his other partners, and the actors reopened the Lincoln's Inn Fields' theatre in the summer. Although early productions combined spoken dialogue with incidental music, a taste was growing amongst the nobility for Italian opera, which was completely sung, and the theatre became devoted to opera. As he became progressively more involved in the construction of Blenheim Palace, Vanbrugh's management of the theatre became increasingly chaotic, showing \"numerous signs of confusion, inefficiency, missed opportunities, and bad judgement\".[11] On 7 May 1707, experiencing mounting losses and running costs, Vanbrugh was forced to sell a lease on the theatre for fourteen years to Owen Swiny at a considerable loss. In December of that year, the Lord Chamberlain's Office ordered that \"all Operas and other Musicall presentments be performed for the future only at Her Majesty's Theatre in the Hay Market\"[5] and forbade the performance of further non-musical plays there.[5]",
				"after": "After 1709, the theatre was devoted to Italian opera and was sometimes known informally as The Haymarket Opera House.[12] Young George Frederick Handel was produced his English début, Rinaldo, on 24 February 1711 at the theatre, featuring the two leading castrati of the era, Nicolo Grimaldi and Valentino Urbani. This was the first Italian opera composed specifically for the London stage. The work was well received,[13] and Handel was appointed resident composer for the theatre, but losses continued, and Swiney fled abroad to escape his creditors. John James Heidegger took over the management of the theatre and, from 1719, began to extend the stage through arches into the houses to the south of the theatre.[5] A \"Royal Academy of Music\" was formed by subscription from wealthy sponsors, including the Prince of Wales, to support Handel's productions at the theatre.[14] Under this sponsorship, Handel conducted a series of more than 25 of his original operas, continuing until 1739[15] Handel was also a partner in the management with Heidegger from 1729 to 1734, and he contributed to incidental music for theatre, including for a revival of Ben Jonson's The Alchemist, opening on 14 January 1710.[16]",
			"color": "black|0.107 dark|0.099849 khaki|0.099849 pale|0.092606 golden|0.092606 rod|0.092606 tan|0.090106 wheat|0.057557 dark|0.053088 olive|0.053088 green|0.053088 khaki|0.046899 dark|0.035587 golden|0.035587 rod|0.035587 burly|0.033043 wood|0.033043 lemon|0.030184 chiffon|0.030184 light|0.024686 golden|0.024686 rod|0.024686 yellow|0.024686 moccasin|0.023803 golden|0.018533 rod|0.018533 blanched|0.017912 almond|0.017912 antique|0.016672 white|0.016672 navajo|0.016536 white|0.016536 dark|0.015667 gray|0.015667 dark|0.015667 grey|0.015667 papaya|0.015403 whip|0.015403 bisque|0.014856 beige|0.014788 corn|0.014558 silk|0.014558  "
		}
	}
}
