{
	"add": {
		"doc": {
			"id": "388a45a7d138b444cc3c72ee68173843f5f74af7b1974cb67e0398f813f8e1f7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Grand_Forks_County_Office_Building.JPG/200px-Grand_Forks_County_Office_Building.JPG",
			"previous": [],
				"after": "Grand Forks has an active sister city program designed to encourage cultural and economic exchanges.[101] Grand Forks' first sister city was Ishim in the Soviet Union. The relationship with the Siberian city formally began in 1984 during the Cold War. Sometime in the late 1990s, however, political and economic turmoil in Russia ended the relationship.[102] While the relationship with Ishim faded, Grand Forks found a new sister in Awano, Japan. An informal relationship began in 1994 when the school districts of both cities began exchanging students. In 1998, the two formally proclaimed themselves sister cities. The most concrete evidence of the relationship between the two is a Japanese rock garden in Grand Forks' Sertoma Park and a sculpture of an American bison in an Awano park.[103] However, the annexation of Awano by the larger city of Kanuma has led to the end of the sister city relationship.[104] Grand Forks' relationship with Dickinson, North Dakota, began in 2002, when delegations from each city visited the other.[105] Grand Forks Mayor Michael Brown has said he thinks having friends in western North Dakota, which typically has diverging interests from eastern cities, could help at the state legislature.[106] Sarpsborg, Norway, became a sister city in 2005 following several exchanges among leaders from both cities. The city became interested in building a relationship with Sarpsborg because many Grand Forks residents have Norwegian heritage.[107]",
			"color": "dim|0.22014 gray|0.22014 dim|0.22014 grey|0.22014 gray|0.18257 grey|0.18257 dark|0.11194 gray|0.11194 dark|0.11194 grey|0.11194 silver|0.078628 light|0.044572 gray|0.044572 light|0.044572 grey|0.044572 antique|0.042092 white|0.042092 gainsboro|0.028653 linen|0.025113 tan|0.02464 dark|0.02136 olive|0.02136 green|0.02136 old|0.020649 lace|0.020649 black|0.017939 sea|0.015986 shell|0.015986 beige|0.015771 floral|0.015721 white|0.015721 papaya|0.014424 whip|0.014424 ivory|0.013265 wheat|0.012029 white|0.010995 smoke|0.010995 blanched|0.010011 almond|0.010011 mint|0.0088362 cream|0.0088362 corn|0.008815 silk|0.008815 snow|0.0086845 white|0.006906  "
		}
	}
}
