{
	"add": {
		"doc": {
			"id": "388d9bf859032eca12f443f849c4454fd9fd108243ca09c1fd6daa38f99c736c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/AnthonyRoll-27_Salamander.jpg/220px-AnthonyRoll-27_Salamander.jpg",
				"previous": "The lettering, framing lines and floral pattern decorations are painted in red or black with the exception of the first three ships of the first roll, which also feature gold. Most of the illustrations were first sketched with plummet outlines and were then painted over in washes. Ship timbers are a light brown that are shaded in the bow and stern to achieve depth, decorations and anchors are highlighted with red, and green is used for guns. Contours are in black and the sea is in shades varying from \"greyish green\" to \"a richer blue\".[17]",
				"after": "The first two rolls were done with roughly the same amount of detail while the lesser rowbarges (essentially small galleys) were done more hastily. The first two ships of the first roll, the Henry Grace à Dieu and the Mary Rose, have traces of a grid pattern, indicating that they were transferred from a different drawing while the rest are done in freehand. Overall, the ships follow a formula depending on the type of ship. The exceptions are stern galleries of some of the galleasses and the figureheads of the Mary Rose, Salamander and the Unicorn, the latter both captured from the Scots in 1544.[18] The prominent exception is the Galley Subtle placed in the middle of the second roll. It is more consistent in type with Mediterranean-type galleys than the galleasses and small rowbarges, and features a considerable amount of detail not present in the other ships.[19] It is the only ship where any crew is visible, in this case rowers behind pavisades as protection from enemy arrows and an overseer wearing \"a bonnet, full skirted armorial doublet and baggy breeches\" holding a stick or baton, as if beating the time of the strokes of the rowers.[20]",
			"color": "light|0.13594 gray|0.13594 light|0.13594 grey|0.13594 silver|0.11528 gainsboro|0.11522 misty|0.087262 rose|0.087262 dark|0.052161 gray|0.052161 dark|0.052161 grey|0.052161 peru|0.049284 antique|0.047502 white|0.047502 linen|0.041652 sandy|0.040697 brown|0.040697 black|0.028771 tan|0.022944 gray|0.017039 grey|0.017039 sienna|0.016252 sea|0.015297 shell|0.015297 old|0.012521 lace|0.012521 dim|0.011754 gray|0.011754 dim|0.011754 grey|0.011754 lavender|0.011035 blush|0.011035 burly|0.010287 wood|0.010287 rosy|0.0098832 brown|0.0098832 chocolate|0.0089827 papaya|0.008623 whip|0.008623 peach|0.0081296 puff|0.0081296 white|0.0077639 smoke|0.0077639 bisque|0.0072821 dark|0.0068084 sea|0.0068084 green|0.0068084 blanched|0.0064741 almond|0.0064741 floral|0.0063557 white|0.0063557 beige|0.0062085 dark|0.0058201 salmon|0.0058201 wheat|0.0051374 dark|0.0049196 olive|0.0049196 green|0.0049196 coral|0.0046341  "
		}
	}
}
