{
	"add": {
		"doc": {
			"id": "3894899ea8218ae4bbafa85ef41a3ea070054824db80fe0db7d953587ed99fd8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Liberty_Bell_Pavilion_Exterior_HABS_213789pv.jpg/220px-Liberty_Bell_Pavilion_Exterior_HABS_213789pv.jpg",
				"previous": "Almost from the start of its stewardship, the Park Service sought to move the bell from Independence Hall to a structure where it would be easier to care for the bell and accommodate visitors. The first such proposal was withdrawn in 1958, after considerable public protest.[69] The Park Service tried again as part of the planning for the 1976 United States Bicentennial. The Independence National Historical Park Advisory Committee proposed in 1969 that the bell be moved out of Independence Hall, as the building could not accommodate the millions expected to visit Philadelphia for the Bicentennial.[70] In 1972, the Park Service announced plans to build a large glass tower for the bell at the new visitors center at South Third Street and Chestnut Street, two blocks east of Independence Hall, at a cost of $5 million, but citizens again protested the move. Instead, in 1973, the Park Service proposed to build a smaller glass pavilion for the bell at the north end of Independence Mall, between Arch and Race Streets. Philadelphia Mayor Frank Rizzo agreed with the pavilion idea, but proposed that the pavilion be built across Chestnut Street from Independence Hall, which the state feared would destroy the view of the historic building from the mall area.[71] Rizzo's view prevailed, and the bell was moved to a glass-and-steel Liberty Bell Pavilion, about 200 yards (180 m) from its old home at Independence Hall, as the Bicentennial year began.[72]",
				"after": "During the Bicentennial, members of the Procrastinator's Club of America jokingly picketed the Whitechapel Bell Foundry with signs \"We got a lemon\" and \"What about the warranty?\" The foundry told the protesters that it would be glad to replace the bell—so long as it was returned in the original packaging.[10] In 1958, the foundry (then trading under the name Mears and Stainbank Foundry) had offered to recast the bell, and was told by the Park Service that neither it nor the public wanted the crack removed.[69] The foundry was called upon, in 1976, to cast a full-size replica of the Liberty Bell (known as the Bicentennial Bell), which was presented to the United States by the British monarch, Queen Elizabeth II,[73] and was housed in the tower once intended for the Liberty Bell, at the former visitor center on South Third Street.[74] The bell was removed and placed in storage in January 2013[75] in preparation for the demolition of the visitor center, future location of the Museum of the American Revolution.[76]",
			"color": " "
		}
	}
}
