{
	"add": {
		"doc": {
			"id": "38ae8d41a270a4ad941cc9fd3aee7476d5b1edcbad4c8a292f7b34b50687488c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/South_Africa-Xenophobia-001.jpg/220px-South_Africa-Xenophobia-001.jpg",
			"previous": [],
				"after": "Treatment of migrants in host countries, both by governments, employers, and original population, is a topic of continual debate and criticism, as many cases of abuse and violation of rights are being reported frequently.[citation needed] Some countries have developed a particularly notorious reputation regarding treatment of migrants. The United Nations Convention on the Protection of the Rights of All Migrant Workers and Members of Their Families, has been ratified but by 20 states, all of which are heavy exporters of cheap labor. With the sole exception of Serbia, none of the signatories are western countries, but all are from Asia, South America, and North Africa. Arab states of the Persian Gulf, which are known for receiving millions of migrant workers, have not signed the treaty as well.[citation needed] Although freedom of movement is often recognized as a civil right in many documents such as the Universal Declaration of Human Rights (1948) and the International Covenant on Civil and Political Rights (1966), the freedom only applies to movement within national borders: it may be guaranteed by the constitution or by human rights legislation. Additionally, this freedom is often limited to citizens and excludes others.[citation needed]",
			"color": "tan|0.28746 light|0.20444 steel|0.20444 blue|0.20444 dim|0.098201 gray|0.098201 dim|0.098201 grey|0.098201 steel|0.0882 blue|0.0882 dark|0.076857 gray|0.076857 dark|0.076857 grey|0.076857 burly|0.047179 wood|0.047179 gray|0.043821 grey|0.043821 silver|0.027776 white|0.010597 smoke|0.010597 light|0.0094239 gray|0.0094239 light|0.0094239 grey|0.0094239 snow|0.0094033 sea|0.0090999 shell|0.0090999 ghost|0.0087684 white|0.0087684 gainsboro|0.008765 white|0.0086425 alice|0.0083088 blue|0.0083088 mint|0.0075239 cream|0.0075239 lavender|0.0074518 blush|0.0074518 floral|0.0069697 white|0.0069697 azure|0.0065647 light|0.0064789 slate|0.0064789 gray|0.0064789 slate|0.0064458 gray|0.0064458  "
		}
	}
}
