{
	"add": {
		"doc": {
			"id": "38bacd014f3d392ff7a08a497ba8ff1d173fc079ed905c094cd07328f518a557",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Hexon.svg/200px-Hexon.svg.png",
				"previous": "Opinions differ on whether viruses are a form of life, or organic structures that interact with living organisms. They have been described as \"organisms at the edge of life\",[8] since they resemble organisms in that they possess genes and evolve by natural selection,[59] and reproduce by creating multiple copies of themselves through self-assembly. Although they have genes, they do not have a cellular structure, which is often seen as the basic unit of life. Viruses do not have their own metabolism, and require a host cell to make new products. They therefore cannot naturally reproduce outside a host cell[60] – although bacterial species such as rickettsia and chlamydia are considered living organisms despite the same limitation.[61][62] Accepted forms of life use cell division to reproduce, whereas viruses spontaneously assemble within cells. They differ from autonomous growth of crystals as they inherit genetic mutations while being subject to natural selection. Virus self-assembly within host cells has implications for the study of the origin of life, as it lends further credence to the hypothesis that life could have started as self-assembling organic molecules.[1]",
				"after": "Viruses display a wide diversity of shapes and sizes, called morphologies. In general, viruses are much smaller than bacteria. Most viruses that have been studied have a diameter between 20 and 300 nanometres. Some filoviruses have a total length of up to 1400 nm; their diameters are only about 80 nm.[63] Most viruses cannot be seen with an optical microscope so scanning and transmission electron microscopes are used to visualise virions.[64] To increase the contrast between viruses and the background, electron-dense \"stains\" are used. These are solutions of salts of heavy metals, such as tungsten, that scatter the electrons from regions covered with the stain. When virions are coated with stain (positive staining), fine detail is obscured. Negative staining overcomes this problem by staining the background only.[65]",
			"color": "dark|0.23674 olive|0.23674 green|0.23674 silver|0.20108 light|0.12484 gray|0.12484 light|0.12484 grey|0.12484 dark|0.11446 gray|0.11446 dark|0.11446 grey|0.11446 olive|0.088733 drab|0.088733 gainsboro|0.088338 white|0.014497 smoke|0.014497 sea|0.011927 shell|0.011927 snow|0.011737 mint|0.011224 cream|0.011224 white|0.011092 floral|0.011061 white|0.011061 ghost|0.010503 white|0.010503 alice|0.010334 blue|0.010334 azure|0.0093665 lavender|0.0084036 blush|0.0084036 linen|0.0074469  "
		}
	}
}
