{
	"add": {
		"doc": {
			"id": "38bae9d08556dd55dc574b6113435fe4d1a7fd4a01208a16e24a8aebe658147b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/National_eagle_repository_017.JPG/220px-National_eagle_repository_017.JPG",
				"previous": "The bald eagle is a sacred bird in some North American cultures, and its feathers, like those of the golden eagle, are central to many religious and spiritual customs among Native Americans. Eagles are considered spiritual messengers between gods and humans by some cultures.[123] Many pow wow dancers use the eagle claw as part of their regalia as well. Eagle feathers are often used in traditional ceremonies, particularly in the construction of regalia worn and as a part of fans, bustles and head dresses. In the Navajo Tradition an Eagle feather is represented to be a Protector, along with the Feather Navajo Medicine Man use the leg and wing bones for ceremonial whistles. [124] The Lakota, for instance, give an eagle feather as a symbol of honor to person who achieves a task. In modern times, it may be given on an event such as a graduation from college.[125] The Pawnee considered eagles as symbols of fertility because their nests are built high off the ground and because they fiercely protect their young.[126] The Choctaw considered the bald eagle, who has direct contact with the upper world of the sun, as a symbol of peace.[127]",
				"after": "During the Sun Dance, which is practiced by many Plains Indian tribes, the eagle is represented in several ways. The eagle nest is represented by the fork of the lodge where the dance is held. A whistle made from the wing bone of an eagle is used during the course of the dance. Also during the dance, a medicine man may direct his fan, which is made of eagle feathers, to people who seek to be healed. The medicine man touches the fan to the center pole and then to the patient, in order to transmit power from the pole to the patient. The fan is then held up toward the sky, so that the eagle may carry the prayers for the sick to the Creator.[128]",
			"color": "black|0.2347 dark|0.14093 gray|0.14093 dark|0.14093 grey|0.14093 silver|0.10942 gray|0.064153 grey|0.064153 antique|0.055115 white|0.055115 light|0.053249 gray|0.053249 light|0.053249 grey|0.053249 beige|0.045315 gainsboro|0.033755 old|0.030527 lace|0.030527 papaya|0.028877 whip|0.028877 linen|0.028835 corn|0.024919 silk|0.024919 ivory|0.020547 floral|0.01934 white|0.01934 blanched|0.015394 almond|0.015394 honeydew|0.014782 dim|0.014635 gray|0.014635 dim|0.014635 grey|0.014635 light|0.013429 yellow|0.013429 sea|0.012269 shell|0.012269 mint|0.0077834 cream|0.0077834 white|0.0067014 smoke|0.0067014  "
		}
	}
}
