{
	"add": {
		"doc": {
			"id": "38e0e1d57045ab510418400181241dd971f2b540d9b19c1f7e620f925f972c34",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Madonna_%C3%A0_Nice_8.jpg/170px-Madonna_%C3%A0_Nice_8.jpg",
				"previous": "Various music journalists, critical theorists, and authors have deemed Madonna the most influential female recording artist of all time.[108][319][320] Author Carol Clerk wrote that \"during her career, Madonna has transcended the term 'pop star' to become a global cultural icon.\"[321] Rolling Stone of Spain wrote that \"She became the first viral Master of Pop in history, years before the Internet was massively used. Madonna was everywhere; in the almighty music television channels, 'radio formulas', magazine covers and even in bookshops. A pop dialectic, never seen since The Beatles's reign, which allowed her to keep on the edge of tendency and commerciality.\"[322] Laura Barcella in her book Madonna and Me: Women Writers on the Queen of Pop (2012) wrote that \"really, Madonna changed everything the musical landscape, the '80s look du jour, and most significantly, what a mainstream female pop star could (and couldn't) say, do, or accomplish in the public eye.\"[323] William Langley from The Daily Telegraph felt that \"Madonna has changed the world's social history, has done more things as more different people than anyone else is ever likely to.\"[324] Alan McGee from The Guardian felt that Madonna is a post-modern art, the likes of which we will never see again. He further asserted that Madonna and Michael Jackson invented the terms Queen and King of Pop.[325]",
				"after": "According to Tony Sclafani from MSNBC, \"It's worth noting that before Madonna, most music mega-stars were guy rockers; after her, almost all would be female singers ... When The Beatles hit America, they changed the paradigm of performer from solo act to band. Madonna changed it back—with an emphasis on the female.\"[326] Howard Kramer, curatorial director of the Rock and Roll Hall of Fame and Museum, asserted that \"Madonna and the career she carved out for herself made possible virtually every other female pop singer to follow ... She certainly raised the standards of all of them ... She redefined what the parameters were for female performers.\"[327] According to Fouz-Hernández, subsequent female singers such as Britney Spears, Christina Aguilera, Kylie Minogue, Spice Girls, Destiny's Child, Jennifer Lopez, and Pink were like her \"daughters in the very direct sense that they grew up listening to and admiring Madonna, and decided they wanted to be like her.\"[328] Time magazine included her in the list of the \"25 Most Powerful Women of the Past Century\", where she became one of only two singers to be included, alongside Aretha Franklin.[329] She also topped VH1's countdowns of \"100 Greatest Women in Music\" and \"50 Greatest Women of the Video Era\".[330][331]",
			"color": "firebrick|0.41204 crimson|0.10127 maroon|0.079438 dark|0.073041 red|0.073041 brown|0.062876 dim|0.036291 gray|0.036291 dim|0.036291 grey|0.036291 dark|0.034138 gray|0.034138 dark|0.034138 grey|0.034138 gray|0.027424 grey|0.027424 silver|0.023149 light|0.018396 gray|0.018396 light|0.018396 grey|0.018396 gainsboro|0.014688 white|0.008731 smoke|0.008731 black|0.0085503 ghost|0.0067321 white|0.0067321 snow|0.00665 white|0.0066453 alice|0.0065431 blue|0.0065431 sea|0.005928 shell|0.005928 mint|0.0053588 cream|0.0053588 lavender|0.0053073 blush|0.0053073 floral|0.0050137 white|0.0050137 light|0.0049085 slate|0.0049085 gray|0.0049085 slate|0.0049085 gray|0.0049085 azure|0.004669 lavender|0.0044163 linen|0.0035965  "
		}
	}
}
