{
	"add": {
		"doc": {
			"id": "38f39e91a7873ad224f772b36b42b32f8aac205362f68b992e86a6ba8a0d5e57",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/US_Navy_030321-N-4928M-005_A_Marine_AV-8B_Harrier_prepares_to_launch_from_the_amphibious_assault_ship_USS_Bonhomme_Richard_%28LHD_6%29.jpg/220px-US_Navy_030321-N-4928M-005_A_Marine_AV-8B_Harrier_prepares_to_launch_from_the_amphibious_assault_ship_USS_Bonhomme_Richard_%28LHD_6%29.jpg",
				"previous": "The trainer version of the AV-8B is the TAV-8B, seating two pilots in tandem. Among other changes, the forward fuselage features a 3 ft 11 in (1.19 m) extension to accommodate the second cockpit.[36] To compensate for the slight loss of directional stability, the vertical stabilizer's area was enlarged through increases in chord (length of the stabilizer's root) and height.[35][36] USMC TAV-8Bs feature the AV-8B's digital cockpit and new systems, but have only two hardpoints and are not combat capable.[36] Initial TAV-8Bs were powered by a 21,450 lbf (95.4 kN) F402-RR-406A engine, while later examples were fitted with the 23,000 lbf (105.8 kN) F402-RR-408A.[36] In the early 2000s, 17 TAV-8Bs were upgraded to include a night-attack capability, the F402-RR-408 engine, and software and structural changes.[83]",
				"after": "Fielded in 1991, the Night Attack Harrier was the first upgrade of the AV-8B. It differed from the original aircraft in having a forward looking infrared (FLIR) camera added to the top of the nose cone, a wide Smiths Industries head-up display (HUD), provisions for night vision goggles, and a Honeywell digital moving map system. The FLIR uses thermal imaging to identify objects by their heat signatures.[39][84] The variant was powered by the F402-RR-408 engine, which featured an electronic control system and was more powerful and reliable.[85] The flare and chaff dispensers were moved, and the ram air intake was lengthened at the fin's base. Initially known as the AV-8D, the night-attack variant was designated the AV-8B(NA).[86][87]",
			"color": "dark|0.56143 green|0.56143 forest|0.26064 green|0.26064 black|0.10871 green|0.035564 light|0.0073053 green|0.0073053  "
		}
	}
}
