{
	"add": {
		"doc": {
			"id": "39119e4bcd9480ad51878cd21df29c6ac488c7ae0cc27f7b09eadda7cee31b7f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Brassey%27s_HMS_Canada_Plan_%281915%29.jpg/220px-Brassey%27s_HMS_Canada_Plan_%281915%29.jpg",
				"previous": "The Director of Naval Construction began preliminary design work even before the ship was purchased and submitted an outline design on 8 February 1918. This design had a full-length flight deck and its most distinctive features were the two islands separated by the flight deck. Each island was to be 110 feet (33.5 m) long, containing two funnels and a tripod mast. Although they were staggered to make it more difficult for an enemy ship to estimate the ship's course, they were to be connected to each other with heavy bracing. The bridge was to be mounted on top of this bracing which left a clear height of 20 feet (6.1 m) for the aircraft on the flight deck. There was to be a 68-foot (20.7 m) wide space between the islands where the aircraft were to be assembled before taking off. Aircraft would be transported between the hangar and the flight deck by two aircraft lifts (elevators). A crane was to be located at the aft end of each island to lift aircraft aboard and to recover seaplanes. Bulk petrol storage consisted of 15,000 imperial gallons (68,000 l; 18,000 US gal) in 2-imperial-gallon (9.1 l; 2.4 US gal) tins stowed on the forecastle deck and protected by 1-inch (25 mm) plating. Two ready-use tanks near the islands would allow aircraft on the flight deck to refuel. The ship's planned armament consisted of nine 6-inch guns and four 4-inch (102 mm) anti-aircraft guns mounted on the platform between the islands.[4] Eagle retained the battleship's mixture of coal and fuel oil, but the quantities were increased to 3,200 long tons (3,300 t) of coal and 1,750 long tons (1,780 t) of oil, as the forward and rear 14-inch magazines and shell rooms were converted to be used as oil tanks.[5]",
				"after": "Based on trials with HMS Furious, in which pilots were found generally to turn to port when recovering from an aborted landing, the design was revised to eliminate the port island in April 1918. The starboard island was lengthened to 130 feet (39.6 m) and its width was reduced to 15 feet (4.6 m) to minimise air turbulence. The island contained the bridge, both funnels and the tripod mast that carried the fire-control directors for the armament. At the request of Admiral David Beatty, commander of the Grand Fleet, the main armament was increased to 12 six-inch guns, including one mounted on the island, and eighteen torpedo tubes were added, three triple fixed mounts on each broadside, in case the ship met German light cruisers at night. The anti-aircraft armament was reduced to a single 4-inch gun mounted on the island between the funnels as Beatty believed that the ship's own fighters would be her best defence against enemy aircraft. This design was approved in June, although work had begun earlier.[6]",
			"color": " "
		}
	}
}
