{
	"add": {
		"doc": {
			"id": "391faea062aa3dfe2cf04ff7fd09d65d93a952e8c18a82aa7818fed7f485d5a7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Companion_to_Rokeby.png/220px-Companion_to_Rokeby.png",
				"previous": "Paintings of nudes and of Venus by Italian, and especially Venetian, artists were influences on Velázquez. However, Velázquez's version is, according to the art historian Andreas Prater, \"a highly independent visual concept that has many precursors, but no direct model; scholars have sought them in vain\".[23] Forerunners include Titian's various depictions of Venus, such as Venus and Cupid with a Partridge, Venus and Cupid with an Organist and notably the Venus of Urbino; Palma il Vecchio's Reclining Nude; and Giorgione's Sleeping Venus,[24] all of which show the deity reclining on luxurious textiles, although in landscape settings in the latter two works.[23] The use of a centrally placed mirror was inspired by the painters of the Italian High Renaissance, including Titian, Girolamo Savoldo and Lorenzo Lotto, who used mirrors as an active protagonist, as opposed to more than merely a prop or accessory in the pictorial space.[23] Both Titian and Peter Paul Rubens had already painted Venus looking into a mirror, and as both had had close ties to the Spanish court, their examples would have been familiar to Velázquez. However, \"this girl with her small waist and jutting hip, does not resemble the fuller more rounded Italian nudes inspired by ancient sculpture\".[25]",
				"after": "One innovation of the Rokeby Venus, when compared to other large single nude paintings, lies in the fact that Velázquez depicts a back view of its subject who is turned away from the viewer.[23] There were precedents for this in prints by Giulio Campagnola,[26] Agostino Veneziano, Hans Sebald Beham and Theodor de Bry,[27] as well as classical sculptures known to Velázquez, of which casts were made for Madrid. These were the Sleeping Ariadne now in the Pitti Palace, but then in Rome, of which Velázquez ordered a cast for the Royal collection in 1650–51, and the Borghese Hermaphroditus, a sleeping hermaphrodite (picture to the right above), now in the Louvre, of which a cast was sent to Madrid,[28] and which also emphasises the curve from hip to waist. However, the combination of elements in Velázquez's composition was original.",
			"color": " "
		}
	}
}
