{
	"add": {
		"doc": {
			"id": "392362ed116ede882645b77df4d09d33d0fc52826736c7748260ccc68e2a5351",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/AC_MacLaren.jpg/170px-AC_MacLaren.jpg",
				"previous": "Controversy emerged during the 1880s; Kent and Nottinghamshire objected to the bowling actions of John Crossland and George Nash. Nottinghamshire even went as far as refusing to play against Lancashire. Although the 1880s was a period of controversy and modest results for the club, it was also a time in which some club records were established. In 1885 George Kemp (later 1st Baron Rochdale) scored Lancashire’s first century in a Roses Match. In that same year Johnny Briggs and Dick Pilling set a first-class record partnership for the tenth wicket of 173 that stood until 1899 and has not been bettered by Lancashire.[8] The club shared the title of champions with Surrey in 1889.[5]",
				"after": "The County Championship was founded in 1890, and champions were decided by points rather than the press as had happened previously. Lancashire was one of the eight founding teams of the championship along with Gloucestershire, Kent, Middlesex, Nottinghamshire, Surrey, Sussex and Yorkshire.[10] The team was runner up in 1890 and 1891. Archie MacLaren was appointed captain in 1894, four years after making his debut whilst still captain of Harrow. In 1895 MacLaren made his record breaking innings of 424 against Somerset at Taunton; his innings remained the highest first-class score for an Englishman, was the first first-class quadruple century, and was the highest score in first-class cricket until Bill Ponsford scored 429 in February 1923. Again, Lancashire was runner up in 1895, despite Arthur Mold taking 192 wickets in the season, a feat bettered only twice for the club. The current pavilion was constructed in 1895 and cost £10,000 (£1,010,000 in 2015);[11] it replaced the earlier pavilion, dating from 1857 when Old Trafford was originally built.[8]",
			"color": "floral|0.078144 white|0.078144 sea|0.077265 shell|0.077265 white|0.077014 smoke|0.077014 mint|0.076783 cream|0.076783 white|0.075676 snow|0.075513 linen|0.073362 ivory|0.072979 old|0.068106 lace|0.068106 honeydew|0.050737 black|0.044208 azure|0.024851 ghost|0.016607 white|0.016607 burly|0.016589 wood|0.016589 tan|0.014556 sienna|0.013071 dark|0.012135 gray|0.012135 dark|0.012135 grey|0.012135 silver|0.011254 light|0.010463 gray|0.010463 light|0.010463 grey|0.010463 dark|0.010145 slate|0.010145 gray|0.010145 gainsboro|0.009382 peach|0.0090058 puff|0.0090058 gray|0.007472 grey|0.007472 alice|0.0072807 blue|0.0072807 dim|0.0067177 gray|0.0067177 dim|0.0067177 grey|0.0067177 dark|0.0063795 salmon|0.0063795 beige|0.0049223 lavender|0.0045262 blush|0.0045262 slate|0.00437 gray|0.00437 antique|0.0041008 white|0.0041008 saddle|0.0040579 brown|0.0040579  "
		}
	}
}
