{
	"add": {
		"doc": {
			"id": "3928e65b769703b3beaeed19ac1bb09b12e881cf24e188178d089a909b07345e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Glendalough.jpg/220px-Glendalough.jpg",
				"previous": "Before the arrival of the first settlers in Ireland about 9,000 years ago, the land was largely covered by forests of oak, ash, elm, hazel, yew, and other native trees.[33] The growth of blanket bog and the extensive clearing of woodland to facilitate farming are believed to be the main causes of deforestation during the following centuries. Today, about 12% of Ireland is forested, of which a significant majority is composed of mainly non-native coniferous plantations for commercial use.[34] Ideal soil conditions, high rainfall and a mild climate give Ireland the highest growth rates for forests in Europe. Hedgerows, which are traditionally used to define land boundaries, are an important substitute for woodland habitat, providing refuge for native wild flora and a wide range of insect, bird and mammal species.[35]",
				"after": "Agriculture accounts for about 64% of the total land area.[36] This has resulted in limited land to preserve natural habitats, in particular for larger wild mammals with greater territorial requirements.[37] The long history of agricultural production coupled with modern agricultural methods, such as pesticide and fertiliser use, has placed pressure on biodiversity.[2]",
			"color": "dark|0.18207 slate|0.18207 gray|0.18207 light|0.1093 steel|0.1093 blue|0.1093 light|0.086659 blue|0.086659 black|0.082614 light|0.070579 cyan|0.070579 light|0.067725 slate|0.067725 gray|0.067725 slate|0.066093 gray|0.066093 pale|0.055753 turquoise|0.055753 powder|0.050885 blue|0.050885 sky|0.038448 blue|0.038448 dim|0.031239 gray|0.031239 dim|0.031239 grey|0.031239 azure|0.029415 alice|0.020467 blue|0.020467 mint|0.017223 cream|0.017223 light|0.014439 sky|0.014439 blue|0.014439 white|0.0096175 smoke|0.0096175 steel|0.0089435 blue|0.0089435 white|0.0087695 honeydew|0.0087013 ghost|0.0082716 white|0.0082716 gray|0.0069647 grey|0.0069647 snow|0.0063719  "
		}
	}
}
