{
	"add": {
		"doc": {
			"id": "3942bf77d03c2dcc23998df79e7da8cd36ffa2efc607c0e9264e2bfb3aa0a6f2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Noah_Webster_The_Schoolmaster_of_the_Republic.jpg/260px-Noah_Webster_The_Schoolmaster_of_the_Republic.jpg",
				"previous": "Webster's Speller was entirely secular by design.[36] It ended with two pages of important dates in American history, beginning with Columbus's in 1492 and ending with the battle of Yorktown in 1781. There was no mention of God, the Bible, or sacred events. \"Let sacred things be appropriated for sacred purposes,\" wrote Webster. As Ellis explains, \"Webster began to construct a secular catechism to the nation-state. Here was the first appearance of 'civics' in American schoolbooks. In this sense, Webster's speller becoming what was to be the secular successor to The New England Primer with its explicitly biblical injunctions.\"[37] Later in life Webster became intensely religious and added religious themes. However after 1840 Webster's books lost market share to the McGuffey Eclectic Readers of William Holmes McGuffey, which sold over 120 million copies.[38]",
				"after": "Vincent P. Bynack (1984) examines Webster in relation to his commitment to the idea of a unified American national culture that would stave off the decline of republican virtues and solidarity. Webster acquired his perspective on language from such theorists as Maupertuis, Michaelis, and Herder. There he found the belief that a nation's linguistic forms and the thoughts correlated with them shaped individuals' behavior. Thus the etymological clarification and reform of American English promised to improve citizens' manners and thereby preserve republican purity and social stability. This presupposition animated Webster's Speller and Grammar.[39]",
			"color": "tan|0.51459 burly|0.10821 wood|0.10821 dark|0.098951 slate|0.098951 gray|0.098951 antique|0.04114 white|0.04114 wheat|0.031585 bisque|0.024846 peach|0.024102 puff|0.024102 blanched|0.022743 almond|0.022743 papaya|0.019843 whip|0.019843 dim|0.019098 gray|0.019098 dim|0.019098 grey|0.019098 beige|0.012756 rosy|0.012617 brown|0.012617  "
		}
	}
}
