{
	"add": {
		"doc": {
			"id": "39481fea7329803b0114e678b207632b4906daafd8e68510b064325186fd7690",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Everglades_-_Blue_Heron.jpg/220px-Everglades_-_Blue_Heron.jpg",
				"previous": "Freshwater sloughs are perhaps the most common ecosystem associated with Everglades National Park. These drainage channels are characterized by low-lying areas covered in fresh water, flowing at an almost imperceptible 100 feet (30 m) per day.[22] Shark River Slough and Taylor Slough are significant features of the park. Sawgrass growing to a length of 6 feet (1.8 m) or more, and broad-leafed marsh plants, are so prominent in this region that they gave the Everglades its nickname \"River of Grass\", cemented in the public imagination in the title for Marjory Stoneman Douglas's book (1947), which culminated years of her advocacy for considering the Everglades ecosystem as more than a \"swamp\". Excellent feeding locations for birds, sloughs in the Everglades attract a great variety of waders such as herons, egrets, roseate spoonbills (Platalea ajaja), ibises and brown pelicans (Pelecanus occidentalis), as well as limpkins (Aramus guarauna) and snail kites that eat apple snails, which in turn feed on the sawgrass. The sloughs' availability of fish, amphibians, and young birds attract a variety of freshwater turtles, alligators (Alligator mississippiensis), water moccasins (Agkistrodon piscivorus conanti), and eastern diamondback rattlesnakes (Crotalus adamanteus).[23]",
				"after": "Freshwater marl prairies are similar to sloughs, but lack the slow movement of surface water; instead, water seeps through a calcitic mud called marl. Algae and other microscopic organisms form periphyton, which attaches to limestone. When it dries it turns into a gray mud.[24] Sawgrass and other water plants grow shorter in freshwater marl than they do in peat, the other type of soil in the Everglades which is found where water remains present longer throughout the year. Marl prairies are usually under water from three to seven months of the year, whereas sloughs may remain submerged for longer than nine months and sometimes remain under water from one year to the next. Sawgrass may dominate sloughs, creating a monoculture. Other grasses, such as muhly grass (Muhlenbergia filipes) and broad-leafed water plants can be found in marl prairies.[25] Animals living in the freshwater sloughs also inhabit in marl prairies. Marl prairies may go dry in some parts of the year; alligators play a vital role in maintaining life in remote parts of the Everglades by burrowing in the mud during the dry season, creating pools of water where fish and amphibians survive from one year to the next. Alligator holes also attract other animals who congregate to feed on smaller prey. When the region floods again during the wet season, the fish and amphibians who were sustained in the alligator holes then repopulate freshwater marl prairies.[26]",
			"color": "gray|0.44392 grey|0.44392 dim|0.14986 gray|0.14986 dim|0.14986 grey|0.14986 dark|0.13492 gray|0.13492 dark|0.13492 grey|0.13492 silver|0.047308 black|0.033205 light|0.030144 gray|0.030144 light|0.030144 grey|0.030144 gainsboro|0.021888 linen|0.01395 antique|0.012394 white|0.012394 old|0.010101 lace|0.010101 sea|0.010041 shell|0.010041 floral|0.0089513 white|0.0089513 white|0.0079727 smoke|0.0079727 tan|0.0066479 ivory|0.0061459 beige|0.0056865 snow|0.0052776 slate|0.0048999 gray|0.0048999 burly|0.0047901 wood|0.0047901 light|0.0046791 slate|0.0046791 gray|0.0046791 papaya|0.0045702 whip|0.0045702 wheat|0.0043641  "
		}
	}
}
