{
	"add": {
		"doc": {
			"id": "395590b7d0cbb91a585a1a966eb27a15d203b3609313223499ffc64d53e7c175",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/HMS_captainWilliam_Frederick_Mitchell.jpg/220px-HMS_captainWilliam_Frederick_Mitchell.jpg",
				"previous": "During the Crimean War, Captain Cowper Phipps Coles constructed a raft with guns protected by a 'cupola' and used the raft,[a] named the Lady Nancy, to shell the Russian town of Taganrog in the Black Sea. The Lady Nancy \"proved a great success\",[1] and Coles patented his rotating turret after the war. Following Coles' patenting, the British Admiralty ordered a prototype of Coles' design in 1859, which was installed in the floating battery vessel, HMS Trusty, for trials in 1861, becoming the first warship to be fitted with a revolving gun turret. Coles' design aim was to create a ship with the greatest possible all round arc of fire, as low in the water as possible to minimise the target.[2]",
				"after": "The Admiralty accepted the principle of the turret gun as a useful innovation, and incorporated it into other new designs. Coles submitted a design for a ship having ten domed turrets each housing two large guns. The design was rejected as impractical, although the Admiralty remained interested in turret ships and instructed its own designers to create better designs. Coles enlisted the support of Prince Albert, who wrote to the first Lord of the Admiralty, the Duke of Somerset, supporting the construction of a turret ship. In January 1862, the Admiralty agreed to construct a ship, the HMS Prince Albert, which had four turrets and a low freeboard, intended only for coastal defence. Coles was allowed to design the turrets, but the ship was the responsibility of the chief Constructor Isaac Watts.[2]",
			"color": "gray|0.22849 grey|0.22849 dim|0.18026 gray|0.18026 dim|0.18026 grey|0.18026 dark|0.15137 gray|0.15137 dark|0.15137 grey|0.15137 antique|0.12528 white|0.12528 silver|0.07092 light|0.053781 gray|0.053781 light|0.053781 grey|0.053781 linen|0.041722 gainsboro|0.03781 old|0.02061 lace|0.02061 papaya|0.018939 whip|0.018939 misty|0.018529 rose|0.018529 sea|0.010986 shell|0.010986 beige|0.0094206 blanched|0.0075232 almond|0.0075232 floral|0.0074244 white|0.0074244 corn|0.0053096 silk|0.0053096 ivory|0.0043041  "
		}
	}
}
