{
	"add": {
		"doc": {
			"id": "39586e621410ac92bbca251d64addbcf888fea7de2810b64612b03eaf5b67645",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/JustinTimberlake.jpg/170px-JustinTimberlake.jpg",
				"previous": "The New York Times' editor Sia Michel wrote in 2007 \"since his last tour, for 2002’s multiplatinum Justified, he has learned how to project sex-symbol edge\" adding \"he's a rock star who can commit.\"[118] Napster's founder Sean Parker, portrayed by Timberlake in The Social Network, stated \"I don’t think I look anything like Timberlake, but it's not so bad being played by a sex symbol.\"[119] Timberlake's fashion and style evolution, from \"boy-band synchronized wardrobe days\" to \"a notable source of fashion inspiration to men all over,\" has been noticed by the media.[120][121] According to American fashion designer Tom Ford, who has dressed Timberlake since 2011 and created more than 600 exclusive pieces for The 20/20 Experience World Tour, Timberlake \"has a kind of effortless cool that makes classic menswear tailoring modern.\"[122]",
				"after": "Near the end of 2002, Timberlake was the first celebrity to appear on Punk'd, a \"candid camera\" type show created by Ashton Kutcher to trick celebrities.[123] Timberlake, who cried during the episode, later admitted to being under the influence of cannabis when he was pranked. Three episodes later, he set up Kelly Osbourne to be \"punk'd\", thus making him the first celebrity to appear on the show more than once.[124] Timberlake later spoofed Ashton Kutcher and Punk'd in a 2003 episode of NBC's Saturday Night Live.[125] Timberlake hosted many music events, including the European MTV Music Awards in 2006. On December 16, 2006, Timberlake hosted Saturday Night Live, doing double duty as both host and musical guest for the second time. During this appearance, he and Andy Samberg performed an R&B song for a skit titled \"Dick in a Box\", which some radio stations have aired as an unofficial single from Timberlake and has become one of the most viewed videos on YouTube. The song was later featured on The Lonely Island's debut album Incredibad. His fifth Saturday Night Live episode, as host and musical guest, was the most-watched episode since January 7, 2012, with Charles Barkley as host and Kelly Clarkson as musical guest.[126] Timberlake is the executive producer on the MTV reality series The Phone, which premiered on April 21, 2009. Timberlake appeared on Jimmy Fallon's debut as host of Late Night with Jimmy Fallon on March 2, 2009 as well as the fifth episode of Fallon's Tonight Show debut week on February 21, 2014.[127]",
			"color": "dim|0.24114 gray|0.24114 dim|0.24114 grey|0.24114 gray|0.16945 grey|0.16945 dark|0.11945 slate|0.11945 gray|0.11945 black|0.096438 light|0.06347 steel|0.06347 blue|0.06347 dark|0.052146 gray|0.052146 dark|0.052146 grey|0.052146 dark|0.039452 olive|0.039452 green|0.039452 light|0.031461 slate|0.031461 gray|0.031461 silver|0.029178 slate|0.026438 gray|0.026438 dark|0.02411 khaki|0.02411  "
		}
	}
}
