{
	"add": {
		"doc": {
			"id": "395f5100711a3a5cdd532f11329798c1d80369bb8c52420f5dd175a7e2bdb9a4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Republic_detail.jpg/170px-Republic_detail.jpg",
			"previous": [],
				"after": "All three denominations of the Barber coinage depict a head of Liberty, facing right. She wears a pileus, a crown fashioned from an olive branch, and a small headband inscribed \"Liberty\". On the quarter and half dollar, the motto \"In God We Trust\" appears above her head; she is otherwise surrounded with 13 six-pointed stars and the date. On the dime, her head is surrounded with \"United States of America\" and the year. The reverse of the quarter and half dollar depicts a heraldic eagle, based on the Great Seal. The bird holds in its mouth a scroll inscribed \"E Pluribus Unum\" and in its right claws an olive branch; in its left it holds 13 arrows. Above the eagle are 13 five-pointed stars; it is surrounded by the name of the country and by the coin's denomination.[31] The reverse of the dime depicts a wreath of corn, wheat, maple and oak leaves surrounding the words \"One Dime\".[29] Barber's monogram \"B\" is on the cutoff of Liberty's neck; the mint mark, on the dime, is placed beneath the wreath on the reverse[32] and beneath the eagle on the larger denominations.[33]",
			"color": "light|0.27472 steel|0.27472 blue|0.27472 lavender|0.19373 alice|0.066933 blue|0.066933 ghost|0.046622 white|0.046622 azure|0.042481 white|0.042163 smoke|0.042163 mint|0.037318 cream|0.037318 white|0.036507 snow|0.035525 floral|0.029581 white|0.029581 sea|0.02814 shell|0.02814 lavender|0.017708 blush|0.017708 light|0.015939 cyan|0.015939 light|0.014017 blue|0.014017 black|0.012559 gainsboro|0.012013 ivory|0.010668 dark|0.0086919 gray|0.0086919 dark|0.0086919 grey|0.0086919 light|0.0081559 gray|0.0081559 light|0.0081559 grey|0.0081559 silver|0.0063718 gray|0.0060692 grey|0.0060692 dim|0.0057077 gray|0.0057077 dim|0.0057077 grey|0.0057077  "
		}
	}
}
