{
	"add": {
		"doc": {
			"id": "3961459642bc06ce2b317e805e374309befceea13d52c7fe0d5cd2cbf311ecf7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Paradise_cove.JPG/220px-Paradise_cove.JPG",
			"previous": [],
				"after": "\"Cherish\" was accompanied by a black-and-white music video that was directed by Herb Ritts and was filmed on July 22, 1989 at Paradise Cove Beach in Malibu, California. Its world-premiere took place on MTV on August 28, 1989.[47] Ritts was one of Madonna's preferred photographers at that time and so she asked him to direct the \"Cherish\" video. Ritts reportedly tried to talk her out of it saying, \"But I'm a still photographer. I don't know anything about film.\" Undaunted, Madonna replied simply, \"Well you have a few weeks to learn.\"[47] The video was conceptualized by Ritts, who wanted to portray Mermen in their natural habitat, but Madonna baulked at the idea since she wanted to be portrayed as herself, but keep the Mermen also.[47] Four male performers were signed for this, one of them being Tony Ward, who would become Madonna's boyfriend later, with the other three being water polo players from nearby Pepperdine University.[47] There were four Merman tails created by Global Effects in North Hollywood, California, for the video.[47] Three full size tails for the mermen were cast in a solid highly flexible rubber, each weighing around 40 lbs. This was necessary to make them neutrally buoyant in water as lighter tails would have floated, causing the swimmers to be head down in the sea.[47] Once in these tails, the polo players needed to be carried to and from the water and once inside, they had tremendous swimming power and agility. This was partly due to a plastic spring like armature cast into the flipper of each tail.[47] One of the reasons that this video was shot in black and white was because the water was very cold, causing Madonna's already pale complexion to look even whiter.[48]",
			"color": "gray|0.1934 grey|0.1934 dark|0.15597 gray|0.15597 dark|0.15597 grey|0.15597 dim|0.11108 gray|0.11108 dim|0.11108 grey|0.11108 light|0.10051 gray|0.10051 light|0.10051 grey|0.10051 gainsboro|0.087092 slate|0.07831 gray|0.07831 light|0.076924 blue|0.076924 light|0.073367 slate|0.073367 gray|0.073367 powder|0.060106 blue|0.060106 silver|0.036241 lavender|0.019644  "
		}
	}
}
