{
	"add": {
		"doc": {
			"id": "396e510ddf5ed2e6784f9c0c1a996b7f01760e35418757c30151f04d18dbd9c0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/New_Orleans_postcard_Moissant_Airport_1960s.jpg/220px-New_Orleans_postcard_Moissant_Airport_1960s.jpg",
				"previous": "The title of \"world's oldest airport\" is disputed, but College Park Airport in Maryland, US, established in 1909 by Wilbur Wright, is generally agreed to be the world's oldest continually operating airfield,[12] although it serves only general aviation traffic. Bisbee-Douglas International Airport in Arizona was declared \"the first international airport of the Americas\" by US president Franklin D. Roosevelt in 1943. Pearson Field Airport in Vancouver, Washington had a dirigible land in 1905 and planes in 1911 and is still in use. Bremen Airport opened in 1913 and remains in use, although it served as an American military field between 1945 and 1949. Amsterdam Airport Schiphol opened on September 16, 1916 as a military airfield, but only accepted civil aircraft from December 17, 1920, allowing Sydney Airport in Sydney, Australia—which started operations in January 1920—to claim to be one of the world's oldest continually operating commercial airports.[13] Minneapolis-Saint Paul International Airport in Minneapolis-Saint Paul, Minnesota, opened in 1920 and has been in continuous commercial service since. It serves about 35,000,000 passengers each year and continues to expand, recently opening a new 11,000 foot (3,355 meter) runway. Of the airports constructed during this early period in aviation, it is one of the largest and busiest that is still currently operating. Rome Ciampino Airport, opened 1916, is also a contender, as well as the Don Mueang International Airport near Bangkok,Thailand, which opened in 1914.[14] Increased aircraft traffic during World War I led to the construction of landing fields. Aircraft had to approach these from certain directions and this led to the development of aids for directing the approach and landing slope.",
				"after": "Following the war, some of these military airfields added civil facilities for handling passenger traffic. One of the earliest such fields was Paris – Le Bourget Airport at Le Bourget, near Paris. The first airport to operate scheduled international commercial services was Hounslow Heath Aerodrome in August 1919, but it was closed and supplanted by Croydon Airport in March 1920.[15] In 1922, the first permanent airport and commercial terminal solely for commercial aviation was opened at Flughafen Devau near what was then Königsberg, East Prussia. The airports of this era used a paved \"apron\", which permitted night flying as well as landing heavier aircraft.",
			"color": "black|0.39822 tan|0.26568 dim|0.11323 gray|0.11323 dim|0.11323 grey|0.11323 rosy|0.0474 brown|0.0474 gray|0.036226 grey|0.036226 peach|0.035037 puff|0.035037 bisque|0.019024  "
		}
	}
}
