{
	"add": {
		"doc": {
			"id": "398c81a29493a2eb19667208b5011b3e4d54c7454ceedba5e7856fb3cae1cb63",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Cyathus_stercoreus_Fruchtk%C3%B6rper.JPG/220px-Cyathus_stercoreus_Fruchtk%C3%B6rper.JPG",
				"previous": "After a period of time and under the appropriate environmental conditions, the dikaryotic mycelia may enter the reproductive stage of the life cycle. Fruit body formation is influenced by external factors such as season (which affects temperature and air humidity), nutrients and light. As fruit bodies develop they produce peridioles containing the basidia upon which new basidiospores are made. Young basidia contain a pair of haploid sexually compatible nuclei which fuse, and the resulting diploid fusion nucleus undergoes meiosis to produce basidiospores, each containing a single haploid nucleus.[30] The dikaryotic mycelia from which the fruit bodies are produced is long lasting, and will continue to produce successive generations of fruit bodies as long as the environmental conditions are favorable.",
				"after": "The development of Cyathus fruit bodies has been studied in laboratory culture; Cyathus stercoreus has been used most often for these studies due to the ease with which it may be grown experimentally.[31] In 1958, E. Garnett first demonstrated that the development and form of the fruit bodies is at least partially dependent on the intensity of light it receives during development. For example, exposure of the heterokaryotic mycelium to light is required for fruit to occur, and furthermore, this light needs to be at a wavelength of less than 530 nm. Continuous light is not required for fruit body development; after the mycelium has reached a certain stage of maturity, only a brief exposure to light is necessary, and fruit bodies will form if even subsequently kept in the dark.[32] Lu suggested in 1965 that certain growing conditions—such as a shortage in available nutrients—shifts the fungus' metabolism to produce a hypothetical \"photoreceptive precursor\" that enables the growth of the fruit bodies to be stimulated and affected by light.[33] The fungi is also positively phototrophic, that is, it will orient its fruit bodies in the direction of the light source.[34] The time required to develop fruit bodies depends on a number of factors, such as the temperature, or the availability and type of nutrients, but in general \"most species that do fruit in laboratory culture do so best at about 25 °C, in from 18 to 40 days.\"[35]",
			"color": "black|0.65406 saddle|0.27081 brown|0.27081 sienna|0.036891 peru|0.012619  "
		}
	}
}
