{
	"add": {
		"doc": {
			"id": "399a7ea2093df82df0183b0e8cfc72572a8ef3599dde9348166470a16705f0fc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Liverpool_Kathedrale_3.JPG/220px-Liverpool_Kathedrale_3.JPG",
				"previous": "While the majority of Liverpool's architecture dates from the mid-18th century onwards, there are several buildings that pre-date this time. One of the oldest surviving buildings is Speke Hall, a Tudor manor house located in the south of the city, which was completed in 1598.[163] The building is one of the few remaining timber framed Tudor houses left in the north of England and is particularly noted for its Victorian interior, which was added in the mid-19th century.[164] In addition to Speke Hall, many of the city's other oldest surviving buildings are also former manor houses including Croxteth Hall and Woolton Hall, which were completed in 1702 and 1704 respectively.[165] The oldest building within the city centre is the Grade I listed Bluecoat Chambers,[166] which was built between 1717 and 1718. Constructed in British Queen Anne style,[167][168] the building was influenced in part by the work of Christopher Wren[169] and was originally the home of the Bluecoat School (who later moved to larger site in the south of the city). Since 1908 it has acted as a centre for arts in Liverpool.[167]",
				"after": "Liverpool is noted for having two Cathedrals, each of which imposes over the landscape around it.[170] The Anglican Cathedral, which was constructed between 1904 and 1978, is the largest Cathedral in Britain[171] and the fifth largest in the world. Designed and built in Gothic style, it is regarded as one of the greatest buildings to have been constructed during the 20th century[172] and was described by former British Poet Laureate, John Betjeman, as 'one of the great buildings of the world’.[173] The Roman Catholic Metropolitan Cathedral was constructed between 1962 and 1967 and is noted as one of the first Cathedrals to break the traditional longitudinal design.[174]",
			"color": "light|0.15306 steel|0.15306 blue|0.15306 dark|0.15266 gray|0.15266 dark|0.15266 grey|0.15266 silver|0.13463 tan|0.12653 burly|0.10908 wood|0.10908 black|0.075318 dim|0.054598 gray|0.054598 dim|0.054598 grey|0.054598 light|0.033647 gray|0.033647 light|0.033647 grey|0.033647 gray|0.032414 grey|0.032414 peach|0.030608 puff|0.030608 light|0.018063 slate|0.018063 gray|0.018063 rosy|0.013092 brown|0.013092 gainsboro|0.013049 navajo|0.010401 white|0.010401  "
		}
	}
}
