{
	"add": {
		"doc": {
			"id": "39b46fd390053aabda1d7b469bad5e08c9875b0cda38efa9cd59c56b5c9e9053",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Xerocomus_badius_2008.JPG/170px-Xerocomus_badius_2008.JPG",
				"previous": "The bay bolete was first named as Boletus castaneus ß badius (i.e. a subspecies of Boletus castaneus) by Elias Magnus Fries in 1818.[nb 1] Fries later renamed it as a variety of Boletus castaneus in 1828,[2] before assigning it distinct species status in his 1832 work Elenchus Fungorum.[3] The fungus has been transferred to several genera in its taxonomic history: Rostkovites by Petter Karsten in 1881;[4] Viscipellis and Ixocomus by Lucien Quélet in 1886 and 1888, respectively;[5][6] and Suillus by Otto Kuntze in 1898.[7] In 1931, Edouard-Jean Gilbert reclassified it in the genus Xerocomus,[8] and many sources still list it thus.[9] Review of Xerocomus strongly suggested it was polyphyletic, and the genus was not accepted by some mycologists. The stickiness of its wet cap distinguishes the species from others classified in Xerocomus, and hence it has been left in Boletus pending further research.[10] Genetic analysis published in 2013 shows that Boletus badius is related to B. pallidus and B. glabellus; the three species form a clade known informally as the badius clade within a larger group (informally called anaxoboletus) in the suborder Boletineae. Other clades within the group include the Tylopilus, porcini (= Boletus sensu stricto) and Strobilomyces clades, as well as two other groups composed of members of various genera including Xerocomus (the taxa designated as Xerocomus species in this clade are not Xerocomus species and require new taxonomic designations) and Xerocomellus.[11]",
				"after": "The species Boletus limatulus, originally published by Charles Christopher Frost in 1874,[12] was later redescribed, \"with a slight tinge of irritation at the time, energy and gasoline spent\", as a variety of B. badius by Wally Snell in 1945 (as Xerocomus badius var. limatulus).[13] The taxon name comes from the Latin limatulus, \"rather polished\" or \"refined\".[14] Varieties glaber and macrostipitatus were described from Nova Scotia, Canada, in 1976.[15]",
			"color": "dark|0.13517 gray|0.13517 dark|0.13517 grey|0.13517 gray|0.090724 grey|0.090724 light|0.083758 steel|0.083758 blue|0.083758 dim|0.079896 gray|0.079896 dim|0.079896 grey|0.079896 light|0.073795 blue|0.073795 light|0.073161 slate|0.073161 gray|0.073161 slate|0.062033 gray|0.062033 silver|0.0562 black|0.048337 powder|0.044121 blue|0.044121 dark|0.037187 olive|0.037187 green|0.037187 dark|0.035576 slate|0.035576 gray|0.035576 dark|0.029131 sea|0.029131 green|0.029131 light|0.022312 gray|0.022312 light|0.022312 grey|0.022312 rosy|0.021591 brown|0.021591 cadet|0.016564 blue|0.016564 olive|0.01637 drab|0.01637 gainsboro|0.013301 light|0.0093299 cyan|0.0093299 lavender|0.0082973  "
		}
	}
}
