{
	"add": {
		"doc": {
			"id": "39b57e750b791d1fa2a2833a5c33ffb84530e4411e860213308169b789f7e800",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/EarlsBartonChurch.JPG/220px-EarlsBartonChurch.JPG",
				"previous": "The major rural buildings were sunken-floor (Grubenhäuser) or post-hole buildings, although Helena Hamerow suggest this distinction is less clear.[166] Even the elite had simple buildings, with a central fire and a hole in the roof to let the smoke escape and the largest of which rarely had more than one floor, and one room. Buildings vary widely in size, most were square or rectangular, though some round houses have been found. Frequently these buildings have sunken floors; a shallow pit over which a plank floor was suspended. The pit may have been used for storage, but more likely was filled with straw for winter insulation. A variation on the sunken floor design is found in towns, where the \"basement\" may be as deep as 9 feet, suggesting a storage or work area below a suspended floor. Another common design was simple post framing, with heavy posts set directly into the ground, supporting the roof. The space between the posts was filled in with wattle and daub, or occasionally, planks. The floors were generally packed earth, though planks were sometimes used. Roofing materials varied, with thatch being the most common, though turf and even wooden shingles were also used.[149]",
				"after": "Stone could be was used, and it was used to build churches. Bede makes it clear in both his Ecclesiastical History and his Historiam Abbatum that the masonry construction of churches, including his own at Jarrow, was undertaken morem Romanorum, 'in the manner of the Romans,' in explicit contrast to existing traditions of timber construction. Even at Canterbury, Bede believed that St Augustine's first cathedral had been 'repaired' or 'recovered' (recuperavit) from an existing Roman church, when in fact it had been newly constructed from Roman materials.85 The belief was \"the Christian Church was Roman therefore a masonry church was a Roman building\".",
			"color": "black|0.45424 tan|0.25436 burly|0.12163 wood|0.12163 dim|0.030428 gray|0.030428 dim|0.030428 grey|0.030428 peach|0.026277 puff|0.026277 navajo|0.020421 white|0.020421 gray|0.016476 grey|0.016476 wheat|0.014799 dark|0.012041 olive|0.012041 green|0.012041  "
		}
	}
}
