{
	"add": {
		"doc": {
			"id": "39bd360e0cc7a749a87d94adfb4c0f348a671c288d97e0f6dd377423e4c27b98",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/August_1%2C_2012_-_Majungasaurus_crenatissimus_Fossil_Skull_and_Neck_on_Display_at_the_Royal_Ontario_Museum_%28FMNH_PR_2836%29.jpg/220px-August_1%2C_2012_-_Majungasaurus_crenatissimus_Fossil_Skull_and_Neck_on_Display_at_the_Royal_Ontario_Museum_%28FMNH_PR_2836%29.jpg",
				"previous": "In 1993, scientists from the State University of New York at Stony Brook and the University of Antananarivo began the Mahajanga Basin Project, a series of expeditions to examine the fossils and geology of the Late Cretaceous sediments near the village of Berivotra, in Mahajanga Province.[1] Among these scientists was paleontologist David W. Krause of Stony Brook. The first expedition turned up hundreds of theropod teeth identical to those of Majungasaurus, some of which were attached to an isolated premaxilla that was described in 1996.[18] The following seven expeditions would turn up tens of thousands of fossils, many of which belonged to species new to science. The Mahajanga Basin Project claims credit for quintupling the known diversity of fossil taxa in the region.[1]",
				"after": "Fieldwork in 1996 turned up a spectacularly complete theropod skull preserved in exquisite detail (FMNH PR 2100). On top of this skull was a dome-shaped swelling nearly identical to the one described by Sues and Taquet as Majungatholus atopus. Majungatholus was redescribed as an abelisaurid rather than a pachycephalosaur in 1998. Although the name Majungasaurus crenatissimus was older than Majungatholus atopus, the authors judged the type dentary of Majungasaurus too fragmentary to confidently assign to the same species as the skull.[19] Further fieldwork over the next decade turned up a series of less complete skulls, as well as dozens of partial skeletons of individuals ranging from juveniles to adults. Project members also collected hundreds of isolated bones and thousands of shed Majungasaurus teeth. Taken together, these remains represent nearly all the bones of the skeleton, although most of the forelimbs, most of the pelvis and the tip of the tail are still unknown.[1] This fieldwork culminated in a 2007 monograph consisting of seven scientific papers on all aspects of the animal's biology, published in the Society of Vertebrate Paleontology Memoirs. The papers are in English, although each has an abstract written in Malagasy.[20] In this volume, the dentary described by Lavocat was re-evaluated and determined to be diagnostic for this species. Therefore, the name Majungatholus was replaced by the older name Majungasaurus. Although the monograph is comprehensive, the editors noted that it describes only material recovered from 1993 through 2001. A significant quantity of specimens, some very complete, were excavated in 2003 and 2005 and await preparation and description in future publications.[1] The dentary was made the neotype specimen after a 2009 petition to the ICZN.[21][22]",
			"color": "tan|0.52449 burly|0.31197 wood|0.31197 peach|0.025162 puff|0.025162 dim|0.018737 gray|0.018737 dim|0.018737 grey|0.018737 black|0.018457 wheat|0.018394 antique|0.014088 white|0.014088 bisque|0.013831  "
		}
	}
}
