{
	"add": {
		"doc": {
			"id": "39cc242c19ea4df0387c661ef61f4d8062bcd31f8f822905a4b350c220eaec61",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Mao_Women.jpg/250px-Mao_Women.jpg",
				"previous": "Chad's currency is the CFA franc. In the 1960s, the Mining industry of Chad produced sodium carbonate, or natron. There have also been reports of gold-bearing quartz in the Biltine Prefecture. However, years of civil war have scared away foreign investors; those who left Chad between 1979 and 1982 have only recently begun to regain confidence in the country's future. In 2000 major direct foreign investment in the oil sector began, boosting the country's economic prospects.[1][52]",
				"after": "Over 80% of Chad's population relies on subsistence farming and livestock raising for its livelihood.[1] The crops grown and the locations of herds are determined by the local climate. In the southernmost 10% of the territory lies the nation's most fertile cropland, with rich yields of sorghum and millet. In the Sahel only the hardier varieties of millet grow, and these with much lower yields than in the south. On the other hand, the Sahel is ideal pastureland for large herds of commercial cattle and for goats, sheep, donkeys and horses. The Sahara's scattered oases support only some dates and legumes.[5] Chad's cities face serious difficulties of municipal infrastructure; only 48% of urban residents have access to potable water and only 2% to basic sanitation.[32][73]",
			"color": "tan|0.35565 burly|0.29676 wood|0.29676 black|0.037943 wheat|0.036022 peach|0.029074 puff|0.029074 navajo|0.025869 white|0.025869 firebrick|0.017264 dark|0.015814 olive|0.015814 green|0.015814 brown|0.014291 dim|0.013932 gray|0.013932 dim|0.013932 grey|0.013932 dark|0.012764 khaki|0.012764 moccasin|0.012472 bisque|0.011457 gray|0.010149 grey|0.010149 silver|0.0071941 dark|0.0064947 gray|0.0064947 dark|0.0064947 grey|0.0064947 light|0.0060719 steel|0.0060719 blue|0.0060719 blanched|0.0050006 almond|0.0050006  "
		}
	}
}
