{
	"add": {
		"doc": {
			"id": "39dc65438028e2717fb20989a0ff425be3c0a0e90588a587ae8cf5405fcc3608",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Precision_Air_ATR_42-600_%285H-PWH%29_at_Toulouse-Blagnac_Airport_%28LFBO%29.jpg/220px-Precision_Air_ATR_42-600_%285H-PWH%29_at_Toulouse-Blagnac_Airport_%28LFBO%29.jpg",
				"previous": "The ATR 42-500 is the current production version. The first delivery was in October 1995. It is a completely new design with many new improvements for performance and passenger comfort. It has new engines, new propellers, a newly designed cabin and increased weight capacity. It has six-bladed propellers turned by PW127E engines rated at 2,400 shp (1,800 kW) for improved hot and high performance and greatly increased cruise speed. The engines are flat rated for +45C. Propellers are electrically controlled and are made from composite. It has an increased maximum takeoff weight, allowing for more cargo and greater range (up to 1,500 nm). Due to the six-bladed propellers and better insulation, it has a much reduced noise level inside the cabin. The newest version have CATII capability and dual Honeywell HT1000 FMS installation.[4][6]",
			"after": [
				"On 2 October 2007, ATR CEO Stéphane Mayer announced the launch of the new −600 series aircraft at a press conference held in Washington, D.C.",
				"The new ATR 42–600 and ATR 72–600 will feature technological enhancements to the current aircraft to increase its efficiency, dispatch reliability, low fuel burn and operating cost. It will include the new PW127M as standard engine (new engines provide 5% additional thermodynamic power at takeoff, thus improving performance on short runways, in hot weather and on high altitude; the incorporation of the \"boost function\" enables use of this additional power as needed, only when called for by the takeoff conditions), Glass Cockpit flight deck featuring five wide LCD screens that will replace the current EFIS (Electronic Flight Instrument System). In addition, a Multi-Purpose Computer (MPC) will further enhance flight safety and operational capabilities. The new avionics, to be supplied by Thales, will also provide CAT III and RNP capabilities. It will also include the new lighter and more comfortable seats and larger overhead baggage bins."
			],
			"color": "dark|0.51075 gray|0.51075 dark|0.51075 grey|0.51075 gray|0.23202 grey|0.23202 silver|0.12301 light|0.023073 gray|0.023073 light|0.023073 grey|0.023073 black|0.022777 dim|0.020126 gray|0.020126 dim|0.020126 grey|0.020126 gainsboro|0.018889 orange|0.0059623 white|0.0043743 smoke|0.0043743 dark|0.003889 sea|0.003889 green|0.003889 linen|0.0034513 dark|0.0032027 olive|0.0032027 green|0.0032027  "
		}
	}
}
