{
	"add": {
		"doc": {
			"id": "39de9f9ce2cdfde3c87f5f92e22e10d3931733cbdabf2831269d7626f917a244",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Lock_Haven_Hospital_Front.jpg/250px-Lock_Haven_Hospital_Front.jpg",
				"previous": "The City of Lock Haven owns the reservoirs and water distribution system for Wayne Township, Castanea Township, and the city. Water is treated at the Central Clinton County Water Filtration Authority Plant in Wayne Township before distribution. The city also provides water to the Suburban Lock Haven Water Authority, which distributes it to surrounding communities. Lock Haven operates a sewage treatment plant for waste water, industrial waste, and trucked sewage from the city and eight upstream municipalities: Bald Eagle Township, Castanea, Flemington, Lamar, Mill Hall, Porter Township, Woodward Township, and Walker Township in Centre County. Storm water runoff from within the city is transported by city-owned storm sewers. Curbside pickup of household garbage is provided by a variety of local haulers licensed by the city; recyclables are picked up once every two weeks. The Clinton County Solid Waste Authority owns and operates the Wayne Township Landfill, which serves Lock Haven.[27]",
				"after": "Lock Haven Hospital is a 77-bed hospital with a 120-bed extended-care unit. It offers inpatient, outpatient, and 24-hour emergency services with heliport access. Susque-View Home, next to the hospital, offers long-term care to the elderly and other services including speech, physical, and occupational therapy for people of all ages. A 10-physician community-practice clinic based in the city provides primary care and specialty services. A behavioral health clinic offers programs for children and adolescents and psychiatric outpatient care for all ages.[27]",
			"color": "dim|0.37371 gray|0.37371 dim|0.37371 grey|0.37371 dark|0.24383 olive|0.24383 green|0.24383 tan|0.086004 gray|0.070269 grey|0.070269 black|0.043066 rosy|0.029743 brown|0.029743 dark|0.028701 gray|0.028701 dark|0.028701 grey|0.028701 burly|0.024704 wood|0.024704 dark|0.018575 salmon|0.018575 peach|0.01421 puff|0.01421  "
		}
	}
}
