{
	"add": {
		"doc": {
			"id": "3a0c7578eb3a823644a560806605243757622e698c548fe80c00023a9afe4ade",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/McDonnell_Douglas_F-15_arrives_RIAT_Fairford_10thJuly2014_arp.jpg/220px-McDonnell_Douglas_F-15_arrives_RIAT_Fairford_10thJuly2014_arp.jpg",
				"previous": "The single-seat F-15C and two-seat F-15D models entered production in 1978 and conducted their first flights in February and June of that year.[30] These models were fitted with the Production Eagle Package (PEP 2000), which included 2,000 lb (900 kg) of additional internal fuel, provisions for exterior conformal fuel tanks, and an increased maximum takeoff weight of up to 68,000 lb (30,700 kg).[31] The increased takeoff weight allows internal fuel, a full weapons load, conformal fuel tanks, and three external fuel tanks to be carried. The APG-63 radar uses a programmable signal processor (PSP), enabling the radar to be reprogrammable for additional purposes such as the addition of new armaments and equipment. The PSP was the first of its kind in the world, and the upgraded APG-63 radar was the first radar to use it. Other improvements included strengthened landing gear, a new digital central computer,[32] and an overload warning system, which allows the pilot to fly up to 9 g at all weights.[30]",
				"after": "The F-15 Multistage Improvement Program (MSIP) was initiated in February 1983 with the first production MSIP F-15C produced in 1985. Improvements included an upgraded central computer; a Programmable Armament Control Set, allowing for advanced versions of the AIM-7, AIM-9, and AIM-120A missiles; and an expanded Tactical Electronic Warfare System that provides improvements to the ALR-56C radar warning receiver and ALQ-135 countermeasure set. The final 43 F-15Cs included the Hughes APG-70 radar developed for the F-15E; these are sometimes referred as Enhanced Eagles. Earlier MSIP F-15Cs with the APG-63 were upgraded to the APG-63(V)1 to improve maintainability and to perform similar to the APG-70. Existing F-15s were retrofitted with these improvements.[33]",
			"color": "black|0.22347 dark|0.17236 gray|0.17236 dark|0.17236 grey|0.17236 slate|0.15118 gray|0.15118 light|0.12235 slate|0.12235 gray|0.12235 light|0.12032 steel|0.12032 blue|0.12032 dim|0.07299 gray|0.07299 dim|0.07299 grey|0.07299 silver|0.048043 gray|0.035305 grey|0.035305 dark|0.025376 slate|0.025376 gray|0.025376 light|0.014588 blue|0.014588  "
		}
	}
}
