{
	"add": {
		"doc": {
			"id": "3a0f70899565543bf968c4f3920215c60791ce5739be95107b7b31f43767820b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Barber_sketch.jpg/325px-Barber_sketch.jpg",
				"previous": "By May 1892, it was apparent that additional funds were needed to complete the fair's buildings. The Company had sold stock, and the City of Chicago had issued bonds to pay for the exposition, but the construction budgets had been greatly underestimated. The Company sought a subsidy of $5 million from the federal government to complete the work. When a direct appropriation met congressional opposition, supporters proposed that the $5 million be in the form of special half dollars which could be sold as souvenirs. The United States had never struck a commemorative,[a] and it was anticipated by organizers that the coins could be sold to the public at double their face value. The bullion would come from the melting of underweight and obsolete silver coins already held by the Treasury, so there would be no expense to the government beyond the costs of production.[7] During the debate over the bill in the Senate, Iowa Senator William B. Allison foresaw, \"they would not only be souvenirs for this day and generation but would be transmitted ... to the 200 millions that were to dwell here in the future. Children would cry for them and the old men would demand them.\"[8] But Ohio Senator John Sherman warned, \"the enormous number of [such] half dollars would destroy their value as souvenirs\".[8] With Congress anxious to escape the summer Washington heat, the matter was compromised and the amount cut to $2.5 million, thus five million half dollars.[7] Congress passed authorizing legislation on August 5, 1892.[9]",
				"after": "In July 1892, Curtis sent a photograph of the Lotto painting to Leech, who consulted with Barber and replied that the engraver could not work from a painting in which the subject faces forward. So Barber could depict Columbus in profile, Curtis arranged for a little-known Washington, D.C. sculptor, Ulric Stonewall Jackson Dunbar, to create a bust based on the painting at the Company's expense; when complete it was forwarded to Barber in Philadelphia. Barber prepared sketches based on the bust on August 15, and presented them to Acting Mint Director Robert E. Preston (Leech was on vacation), who forwarded them to fair authorities in Chicago. Ellsworth showed them to artists working on the exposition, and to the press. The artistic reaction was negative, and the newspapers suggested that the sketches resembled more a long-haired professor than the celebrated mariner. This controversy, coupled with his anger from public debate over whether the painting actually was of Columbus, caused Ellsworth to refuse permission for his painting to be used.[10]",
			"color": " "
		}
	}
}
