{
	"add": {
		"doc": {
			"id": "3a0f4408981c995b07f226a765ff1baf43495fd9501f0228472f45039e4e0719",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/1760_Cambridge_Edition_King_James_Bible.png/220px-1760_Cambridge_Edition_King_James_Bible.png",
			"previous": [],
				"after": "By the mid-18th century the wide variation in the various modernized printed texts of the Authorized Version, combined with the notorious accumulation of misprints, had reached the proportion of a scandal, and the Universities of Oxford and Cambridge both sought to produce an updated standard text. First of the two was the Cambridge edition of 1760, the culmination of twenty-years work by Francis Sawyer Parris,[92] who died in May of that year. This 1760 edition was reprinted without change in 1762 [93] and in John Baskerville's fine folio edition of 1763.[94] This was effectively superseded by the 1769 Oxford edition, edited by Benjamin Blayney ,[95] though with comparatively few changes from Parris's edition; but which became the Oxford standard text, and is reproduced almost unchanged in most current printings.[96] Parris and Blayney sought consistently to remove those elements of the 1611 and subsequent editions that they believed were due to the vagaries of printers, while incorporating most of the revised readings of the Cambridge editions of 1629 and 1638, and each also introducing a few improved readings of their own. They undertook the mammoth task of standardizing the wide variation in punctuation and spelling of the original, making many thousands of minor changes to the text; although some of these updates appear to alter the ostensible sense – as when the original text of Genesis 2:21 \"in stead\" (\"in that place\") was standardized to read \"instead\" (\"as an alternative\"). In addition, Blayney and Parris thoroughly revised and greatly extended the italicization of \"supplied\" words not found in the original languages by cross-checking against the presumed source texts. Blayney seems to have worked from the 1550 Stephanus edition of the Textus Receptus, rather than the later editions of Beza that the translators of the 1611 New Testament had favoured; accordingly the current Oxford standard text alters around a dozen italicizations where Beza and Stephanus differ.[97] Like the 1611 edition, the 1769 Oxford edition included the Apocrypha, although Blayney tended to remove cross-references to the Books of the Apocrypha from the margins of their Old and New Testaments wherever these had been provided by the original translators. Altogether, Blayney's 1769 text differed from the 1611 text in around 24,000 places.[98] Since that date, a few further changes have been introduced to the Oxford standard text. The Oxford University Press paperback edition of the \"Authorized King James Version\" provides Oxford's standard text, and also includes the prefatory section \"The Translators to the Reader\".[99]",
			"color": "dark|0.98311 khaki|0.98311  "
		}
	}
}
