{
	"add": {
		"doc": {
			"id": "3a1d21eb846c142049ec0f1187f66c0ac71e24fcdb078c3741ee2f12369d6660",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Deinonychus_antirrhopus_-_AMNH_-_DSC06297.JPG/220px-Deinonychus_antirrhopus_-_AMNH_-_DSC06297.JPG",
				"previous": "In 1974, Ostrom published another monograph on the shoulder of Deinonychus in which he realized that the pubis that he had described was actually a coracoid – a shoulder element.[26] In that same year, another specimen of Deinonychus, MCZ 4371, was discovered and excavated in Montana by Steven Orzack during a Harvard University expedition headed by Farish Jenkins. This discovery added several new elements: well preserved femurs, pubes, a sacrum, and better ilia, as well as elements of the pes and metatarsus. Ostrom described this specimen and revised his skeletal restoration of Deinonychus. This time it showed the very long pubis, and Ostrom began to suspect that they may have even been a little retroverted like those of birds.[27]",
				"after": "A skeleton of Deinonychus, including bones from the original (and most complete) AMNH 3015 specimen, can be seen on display at the American Museum of Natural History,[28] with another specimen (MCZ 4371) on display at the Museum of Comparative Zoology at Harvard University. The American Museum and Harvard specimens are from a different locality than the Yale specimens. Even these two skeletal mounts are lacking elements, including the sterna, sternal ribs, furcula, and gastralia.[29]",
			"color": "dim|0.19929 gray|0.19929 dim|0.19929 grey|0.19929 tan|0.15535 gray|0.060801 grey|0.060801 black|0.052295 old|0.042475 lace|0.042475 ivory|0.040521 floral|0.037402 white|0.037402 linen|0.03506 beige|0.032387 honeydew|0.031741 sea|0.029262 shell|0.029262 corn|0.028636 silk|0.028636 antique|0.027984 white|0.027984 mint|0.023916 cream|0.023916 light|0.023386 yellow|0.023386 papaya|0.022122 whip|0.022122 wheat|0.019704 white|0.017685 snow|0.017052 white|0.015054 smoke|0.015054 blanched|0.01333 almond|0.01333 bisque|0.010802 dark|0.010505 gray|0.010505 dark|0.010505 grey|0.010505 light|0.010191 golden|0.010191 rod|0.010191 yellow|0.010191  "
		}
	}
}
