{
	"add": {
		"doc": {
			"id": "3a33a51deb47fc4d7b97ccb5c05f5482fdb64c670bd64b906c4dfcedb0c68d54",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/University_of_Salamanca_Fray_Luis_de_Leon.jpg/220px-University_of_Salamanca_Fray_Luis_de_Leon.jpg",
				"previous": "In this period literature and philosophy started to flourish again in the Christian peninsular kingdoms, based on Roman and Gothic traditions. An important philosopher from this time is Ramon Llull. Abraham Cresques was a prominent Jewish cartographer. Roman law and its institutions were the model for the legislators. The king Alfonso X of Castile focused on strengthening this Roman and Gothic past, and also on linking the Iberian Christian kingdoms with the rest of medieval European Christendom. He worked for being elected emperor of the Holy Roman Empire and published the Siete Partidas code. The Toledo School of Translators is the name that commonly describes the group of scholars who worked together in the city of Toledo during the 12th and 13th centuries, to translate many of the philosophical and scientific works from Classical Arabic, Ancient Greek, and Ancient Hebrew. The Islamic transmission of the classics is the main Islamic contributions to Medieval Europe. The Castilian language—more commonly known (especially later in history and at present) as \"Spanish\" after becoming the national language and lingua franca of Spain—evolved from Vulgar Latin, as did other Romance languages of Spain like the Catalan, Asturian and Galician languages, as well as other Romance languages in Latin Europe. Basque, the only non-Romance language in Spain, continued evolving from Early Basque to Medieval. The Glosas Emilianenses founded in the monasteries of San Millán de la Cogolla contain the first written words in both Basque and Spanish, having the first one an influence in the formation of the second as an evolution of Latin.[26]",
				"after": "In the 13th and 14th centuries, the Marinid Muslim sect based in North Africa invaded and established some enclaves on the southern coast but failed in their attempt to re-establish Muslim rule in Iberia and were soon driven out. The 13th century also witnessed the Crown of Aragon, centred in Spain's north east, expand its reach across islands in the Mediterranean, to Sicily and even Athens.[27] Around this time the universities of Palencia (1212/1263) and Salamanca (1218/1254) were established. The Black Death of 1348 and 1349 devastated Spain.[28] In 1469, the crowns of the Christian kingdoms of Castile and Aragon were united by the marriage of Isabella I of Castile and Ferdinand II of Aragon. 1478 commenced the completion of the conquest of the Canary Islands and in 1492, the combined forces of Castile and Aragon captured the Emirate of Granada, ending the last remnant of a 781-year presence of Islamic rule in Iberia. That same year, Spain's Jews were ordered to convert to Catholicism or face expulsion from Spanish territories during the Spanish Inquisition.[29] The Treaty of Granada guaranteed religious tolerance toward Muslims,[30] and although the toleration was only partial, it was not until the beginning of the 17th century, following the Revolt of the Alpujarras, that Muslims were finally expelled.[k][31]",
			"color": "dark|0.35396 gray|0.35396 dark|0.35396 grey|0.35396 gray|0.21039 grey|0.21039 rosy|0.15267 brown|0.15267 dim|0.11254 gray|0.11254 dim|0.11254 grey|0.11254 silver|0.074878 light|0.021602 gray|0.021602 light|0.021602 grey|0.021602 light|0.020367 slate|0.020367 gray|0.020367 gainsboro|0.015614 black|0.014136 slate|0.010565 gray|0.010565  "
		}
	}
}
