{
	"add": {
		"doc": {
			"id": "3a38683a66927aa77f55f0d8743b500e406a043c77f1090067303d6c35d367ee",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/MiG-23_Flogger_G.jpg/220px-MiG-23_Flogger_G.jpg",
				"previous": "Growth in air combat capability focused on the introduction of improved air-to-air missiles, radar systems, and other avionics. While guns remained standard equipment (early models of F-4 being a notable exception), air-to-air missiles became the primary weapons for air superiority fighters, which employed more sophisticated radars and medium-range RF AAMs to achieve greater \"stand-off\" ranges, however, kill probabilities proved unexpectedly low for RF missiles due to poor reliability and improved electronic countermeasures (ECM) for spoofing radar seekers. Infrared-homing AAMs saw their fields of view expand to 45°, which strengthened their tactical usability. Nevertheless, the low dogfight loss-exchange ratios experienced by American fighters in the skies over Vietnam led the U.S. Navy to establish its famous \"TOPGUN\" fighter weapons school, which provided a graduate-level curriculum to train fleet fighter pilots in advanced Air Combat Maneuvering (ACM) and Dissimilar Air Combat Training (DACT) tactics and techniques.",
				"after": "This era also saw an expansion in ground-attack capabilities, principally in guided missiles, and witnessed the introduction of the first truly effective avionics for enhanced ground attack, including terrain-avoidance systems. Air-to-surface missiles (ASM) equipped with electro-optical (E-O) contrast seekers – such as the initial model of the widely used AGM-65 Maverick – became standard weapons, and laser-guided bombs (LGBs) became widespread in effort to improve precision-attack capabilities. Guidance for such precision-guided munitions (PGM) was provided by externally mounted targeting pods, which were introduced in the mid-1960s.",
			"color": "dim|0.23664 gray|0.23664 dim|0.23664 grey|0.23664 gray|0.16592 grey|0.16592 dark|0.14012 gray|0.14012 dark|0.14012 grey|0.14012 silver|0.087497 light|0.057799 gray|0.057799 light|0.057799 grey|0.057799 gainsboro|0.042244 black|0.038669 white|0.025928 smoke|0.025928 sea|0.023858 shell|0.023858 snow|0.022783 floral|0.021794 white|0.021794 linen|0.021171 white|0.020048 ghost|0.018262 white|0.018262 mint|0.018149 cream|0.018149 lavender|0.013172 blush|0.013172 alice|0.012199 blue|0.012199 azure|0.010322 ivory|0.0091514 old|0.008675 lace|0.008675  "
		}
	}
}
