{
	"add": {
		"doc": {
			"id": "3a3d8d50c681bbfcc1de27071fa5a7fbb242810c13cb2b2a1b4724bd44d71f08",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Tyrannosaur_fossil.jpg/220px-Tyrannosaur_fossil.jpg",
				"previous": "Most specimens of Gorgosaurus libratus have been recovered from the Dinosaur Park Formation in Alberta.[5] This formation dates to the middle of the Campanian, between 76.5 and 74.8 million years ago,[39] and Gorgosaurus libratus fossils are known specifically from the lower to middle section of the formation, between 76.6 and 75.1 million years ago.[40] The Two Medicine Formation and Judith River Formation of Montana have also yielded possible Gorgosaurus remains. At this time, the area was a coastal plain along the western edge of the Western Interior Seaway, which divided North America in half. The Laramide Orogeny had begun uplifting the Rocky Mountains to the west, from which flowed great rivers that deposited eroded sediment in vast floodplains along the coast.[41][42] The climate was subtropical with marked seasonality, and periodic droughts sometimes resulted in massive mortality among the great herds of dinosaurs, as represented in the numerous bonebed deposits preserved in the Dinosaur Park Formation. Conifers formed the forest canopy, while the understory plants consisted of ferns, tree ferns and angiosperms.[43] Around 73 million years ago, the seaway began to expand, transgressing into areas formerly above sea level and drowning the Dinosaur Park ecosystem. This transgression, called the Bearpaw Sea, is recorded by the marine sediments of the massive Bearpaw Shale.[42]",
				"after": "The Dinosaur Park Formation preserves a great wealth of vertebrate fossils. A wide variety of fish swam the rivers and estuaries, including gars, sturgeons, sharks and rays, among others. Frogs, salamanders, turtles, crocodilians and champsosaurs also dwelled in the aquatic habitats. Azhdarchid pterosaurs and neornithine birds like Apatornis flew overhead, while the enantiornithine bird Avisaurus lived on the ground alongside multituberculate, marsupial and placental mammals. A number of species of terrestrial lizards were also present, including whiptails, skinks, monitors and alligator lizards. Dinosaur fossils in particular are found with unrivaled abundance and diversity. Huge herds of ceratopsids roamed the floodplains alongside equally large groups of hadrosaurine and lambeosaurine hadrosaurs. Other herbivorous groups like ornithomimids, therizinosaurs, pachycephalosaurs, small ornithopods, nodosaurids and ankylosaurids were also represented. Small predatory dinosaurs like oviraptorosaurs, troodonts and dromaeosaurs hunted smaller prey than the huge tyrannosaurids; Daspletosaurus and Gorgosaurus, which were two orders of magnitude larger in mass.[42] Intervening predatory niches may have been filled by young tyrannosaurids.[1][2][44] A Saurornitholestes dentary has been discovered in the Dinosaur Park Formation that bore tooth marks left by the bite of a young tyrannosaur, possibly Gorgosaurus.[45]",
			"color": "tan|0.66606 peach|0.096895 puff|0.096895 burly|0.082348 wood|0.082348 bisque|0.040963 wheat|0.027397 black|0.021281  "
		}
	}
}
