{
	"add": {
		"doc": {
			"id": "3a3f8e1af6f24c790fe5008f2a8410eddaf2b5fe587b88f411c43e1bc6a9c1a6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/MadinahAirport.JPG/220px-MadinahAirport.JPG",
				"previous": "Some services opened during the 1980s for the airline, such as Saudia Catering. Flights were started to Athens, Bangkok, Dhaka, Mogadishu, Nairobi, New York City, Madrid, Singapore, Manila, Delhi, Islamabad, Seoul, Baghdad, Amsterdam, Colombo, Nice, Lahore, Brussels, Dakar, Kuala Lumpur and Taipei. Horizon Class, a business class service, was established to offer enhanced service to passengers. Cargo hubs were built at Brussels and Taipei. Airbus A300s, Boeing 747s, and Cessna Citations were also added to the fleet, the Citations for the SFS service. To conclude the decade, services were introduced in 1989 to Larnaca and Addis Ababa. On July 1, 1982, the first nonstop service was inaugurated from Jeddah to New York with the airline's Boeing 747SP aircraft. This service, along with the Riyadh-New York service introduced later.",
				"after": "In the 1990s, services were introduced to Orlando, Chennai, Asmara, Washington, D.C., Johannesburg, Alexandria, Milan, Málaga (seasonal), and Sanaa (resumption). Boeing 777s, MD-90s and MD-11s were introduced. New female flight attendant uniforms designed by Adnan Akbar were introduced. A new corporate identity was launched on 16 July 1996, featuring a sand colored fuselage with contrasting dark blue tailfin, the center of which featured a stylized representation of the House of Saud crest. The Saudia name was dropped in the identity revamp, with Saudi Arabian Airlines name used.",
			"color": "slate|0.20584 gray|0.20584 light|0.19704 slate|0.19704 gray|0.19704 gray|0.16717 grey|0.16717 black|0.073795 dim|0.061804 gray|0.061804 dim|0.061804 grey|0.061804 dark|0.04997 gray|0.04997 dark|0.04997 grey|0.04997 silver|0.043556 light|0.03342 gray|0.03342 light|0.03342 grey|0.03342 gainsboro|0.025651 white|0.011238 smoke|0.011238 linen|0.010255 sea|0.01011 shell|0.01011 floral|0.0087824 white|0.0087824 snow|0.008416 mint|0.0074171 cream|0.0074171 white|0.007082 antique|0.0068814 white|0.0068814 ghost|0.0067161 white|0.0067161 alice|0.0063169 blue|0.0063169 old|0.0058162 lace|0.0058162 azure|0.0052237 lavender|0.0050291 blush|0.0050291 ivory|0.0040865  "
		}
	}
}
