{
	"add": {
		"doc": {
			"id": "3a4deba642462779a7b1f878700c78864bb845d73e002afb1d86390b48403317",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/1946_stgeorge.jpg/300px-1946_stgeorge.jpg",
				"previous": "Lindwall resumed his first-class cricket career steadily against Queensland and South Australia.[14] Lindwall gave his first indications of cricketing potential on a 38 degree day in the second innings of a match against Victoria. A day after suffering a mild malaria attack, Lindwall gave a spell of four overs which netted him three wickets, bowling at speeds not seen in Australia since Larwood.[16] An innings of 134 not out in just 180 minutes against Queensland at the SCG underlined by cutting and driving exhibited his batting skill, and with a haul of 9/77 against South Australia further underlining his allround credential.[15] Lindwall gained further attention when he turned out for New South Wales against the feted Australian Services team of Lindsay Hassett that had played in the 1945 Victory Tests in England. Lindwall's hostile bowling delivered three wickets in each innings, finishing with match figures of 6/95, leading Hassett to rate him as the best fast-bowling prospect in a decade.[16][17] With 33 wickets for the season,[18] Lindwall as selected for an Australian team tour of New Zealand under Bill Brown.[15] He played in a Test against New Zealand, which was not awarded Test status until 1948.[13] In a match in which Australia fielded seven Test debutants,[19] Lindwall opened the bowling with state team-mate Ernie Toshack. Lindwall had limited opportunities on a sticky wicket which favoured the slower bowling of O’Reilly and Toshack, who took eight and seven wickets respectively.[19] He took 1/13 and 1/16 as Australia won by an innings and 103 runs.[20] Lindwall made a duck in Australia's only innings.[21]",
				"after": "Lindwall returned to Australia and resumed his rugby league career with St. George in the 1946 season after a four-year absence, starting in reserve grade.[22] His strong performances saw him promoted to first grade and that season St. George qualified for the grand final against the Balmain Tigers. Lindwall's goalkicking abilities were not on display that day, as Balmain won the game 13–12, scoring three tries to St George's four, with Lindwall missing every kick at goal. He retired from competitive rugby on the advice of O`Reilly to concentrate on cricket.[13] Lindwall played 31 first-grade rugby league games for St George, scoring seven tries (then worth three points) and kicking 123 goals for a total of 267 career points. The narrow losses in the 1942 and 1946 grand finals prevented him from emulating Herbie Collins' unique feat of following a New South Wales Rugby League premiership victory with captaining the Australian cricket team. Lindwall's brother Jack was, at the time of his retirement, the club's leading try-scorer with 110.[13]",
			"color": " "
		}
	}
}
