{
	"add": {
		"doc": {
			"id": "3a54a5873b8d7f2ac980e55af4e78978b730089c985af32ba5e18d534feff793",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Ray_Lindwall_graph.png/250px-Ray_Lindwall_graph.png",
				"previous": "Lindwall performed steadily during the 1955–56, which was purely domestic. Lindwall was appointed the Queensland captain,[6] and he took 30 wickets at 28.97 and made 383 runs at 32.55.[81] Lindwall was duly selected for the 1956 Ashes tour. Like the rest of the team, Lindwall had a poor tour on a series of dry and underprepared pitches designed to favour the Surrey spin twins of Laker and Lock.[82] Lindwall's tour was further compounded by a recurrence of his groin injury. He took 0/43 in the first innings of the opening Test at Trent Bridge and broke down, being unable to bowl in the second innings.[21] This forced him to miss the Second Test at Lord's,[21] and he returned for a disastrous Third Test at Headingley. Although Lindwall took 3/67 in the first innings, Australia was forced to follow on and fell to its first innings loss since 1938,[83] as Laker and Lock ravaged the Australians.[21][82] Lindwall took two wickets in the Fourth Test at Old Trafford but the results were the same;[21] Australia suffered another innings defeat in what was known as \"Laker's Test\" – the off-spinner took 19 of the Australian wickets to fall.[82] Lindwall bade farewell to Test cricket in England at The Oval, taking two wickets. Overall, it had been a disappointing tour; Lindwall had been fit for three and a half Tests and managed only seven wickets at 34.14[21][84] Lindwall's performance reignited calls for the aging paceman to be axed from the team. Lindwall however, had other ideas.[84]",
				"after": "Following the England tour, the Australians returned home via a tour to the Indian subcontinent. The first stop was Karachi, where Australia played its first ever Test against Pakistan.[84] Lindwall's poor run continued, scoring two and a duck and taking match figures of 1/64 as Australia fell to a nine wicket defeat.[21][84] The team travelled to Madras for the first of three Tests in India. Lindwall briefly bowled on the first morning without success before succumbing to a severe stomach bug. He took no further part in the first innings and spent the next two days in bed. Lindwall briefly got out of his bed on day three to bat, making only eight as Australia took a 158 run first innings lead. He hauled himself out of bed on the fourth day, and cut through the Indians in three spells, taking 7/43 in an innings victory.[84]",
			"color": "white|0.073868 smoke|0.073868 snow|0.071794 ghost|0.071524 white|0.071524 white|0.07038 alice|0.069872 blue|0.069872 sea|0.068987 shell|0.068987 mint|0.06856 cream|0.06856 floral|0.068054 white|0.068054 azure|0.065957 lavender|0.064391 blush|0.064391 silver|0.032167 pink|0.029926 light|0.027305 gray|0.027305 light|0.027305 grey|0.027305 salmon|0.02683 light|0.025757 coral|0.025757 gainsboro|0.025496 misty|0.02395 rose|0.02395 light|0.023011 pink|0.023011 dark|0.019745 gray|0.019745 dark|0.019745 grey|0.019745 red|0.014485 ivory|0.0092915 linen|0.0087068 light|0.0058498 steel|0.0058498 blue|0.0058498 gray|0.0054089 grey|0.0054089 lavender|0.0053608 rosy|0.0046886 brown|0.0046886 light|0.0036212 cyan|0.0036212 indian|0.0030995 red|0.0030995 dim|0.0030646 gray|0.0030646 dim|0.0030646 grey|0.0030646  "
		}
	}
}
