{
	"add": {
		"doc": {
			"id": "3a58533d71bb77cf6db2f198a10682ed27cc204b63bdd09e807b78ab9699b514",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Telopea_speciosissima_RNP.JPG/220px-Telopea_speciosissima_RNP.JPG",
				"previous": "Telopea speciosissima is a pyrogenic-flowering species, relying on post-fire flowering followed by production and dispersal of non-dormant seeds to take advantage of favourable growing conditions in the altered environment following a fire. Of the woody resprouter species of southeastern Australia, it is one of the slowest to produce seedlings after bushfires, taking at least two years.[19] The species resprouts from a lignotuber, a swollen woody base largely under the soil, that stores energy and nutrients as a resource for rapid growth of new shoots after a bushfire. Waratahs dominate the understorey around two years after a fire, but are later overtaken by the slower-growing banksias (Banksia) and wattles (Acacia). Fire also serves to strip away diseases and pests.[20] Flowering may be prolific at this time.[21]",
				"after": "The prominent position and striking colour of Telopea speciosissima and many of its relatives within the subtribe Embothriinae both in Australia and South America strongly suggest it is adapted to pollination by birds, and has been for over 60 million years.[15] Honeyeaters, in particular the New Holland honeyeater (Phylidonyris novaehollandiae)[22] and the crescent honeyeater (P. pyrrhopterus),[23] are frequent visitors. However, a field study conducted at Barren Grounds showed New Holland honeyeaters to carry relatively little pollen. The eastern pygmy possum (Cercartetus nanus) also forages among the flowerheads.[22]",
			"color": "firebrick|0.18411 crimson|0.1643 dark|0.12418 olive|0.12418 green|0.12418 maroon|0.121 dark|0.11561 red|0.11561 black|0.10223 brown|0.064588 light|0.020533 coral|0.020533 indian|0.019237 red|0.019237 gray|0.012177 grey|0.012177 dim|0.011162 gray|0.011162 dim|0.011162 grey|0.011162 dark|0.0085316 khaki|0.0085316 dark|0.0083625 gray|0.0083625 dark|0.0083625 grey|0.0083625  "
		}
	}
}
