{
	"add": {
		"doc": {
			"id": "3a6a7d6c8cd03e2d83be6c67ef840d74ee2e3b59f5e93e8cfca29d0646370f4b",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a5/Mykhalovsky_Zlatoverkhy_Cathedral_1930s.jpg/275px-Mykhalovsky_Zlatoverkhy_Cathedral_1930s.jpg",
				"previous": "In 1870, about 100,000 pilgrims paid tribute to St. Barbara at St. Michael's Monastery.[9] Before the Russian Revolution in 1917, rings manufactured and blessed at St. Michael's Monastery, known as St. Barbara's rings, were very popular among the citizens of Kiev. They usually served as good luck charms and, according to popular beliefs, occasionally protected against witchcraft but were also effective against serious illnesses and sudden death.[9] These beliefs reference the facts that the Monastery was not affected by the plague epidemics in 1710 and 1770 and cholera epidemics of the nineteenth century.",
				"after": "During the first half of the 1930s, various Soviet publications questioned the known historical facts regarding the age of the Cathedral. The publications stressed that the medieval building had undergone major reconstructions and that little of the original Byzantine-style cathedral was preserved. This wave of questioning led to the demolition of the monastery and its replacement with a new administrative centre for the Ukrainian Soviet Socialist Republic (previously located in the city of Kharkiv). Before its demolition (June 8–July 9, 1934), the structure was carefully studied by T.M. Movchanivskyi and K. Honcharev from the recently purged and re-organized Institute of Material Culture of the Ukrainian Academy of Sciences. On the basis of their survey, the cathedral was declared to belong primarily to the Ukrainian Baroque style, rather than to the twelfth century as was previously thought, and thus did not merit preservation due to its lack of historical and artistic value. This conclusion backed up the Soviet authorities' plans to demolish the entire monastery. Local historians, archaeologists, and architects agreed to the monastery's demolition, although reluctantly. Only one professor, Mykola Makarenko, refused to sign the demolition act; he later died in a Soviet prison.[1][nb 4]",
			"color": " "
		}
	}
}
