{
	"add": {
		"doc": {
			"id": "3a9b119740711cb37165489dfa78e4f9d703ffd837d06961f6448a4a84a7c577",
			"url": "https://upload.wikimedia.org/wikipedia/en/timeline/13fdc7ef298fc646f30c6216778665cf.png",
			"previous": [
				"",
				"In late 2014, JP Morgan estimated \"iPhone percentage of the worldwide smartphone install base has been around 15% since late 2012\"[23] being far behind the dominant Android-based smartphones. In a few mature markets countries such as; Japan, the iPhone has a majority, an exception to Android's dominance,[24] and Australia where Android is rapidly approaching parity. In March 2014, sales of the iPhone brand had reached 500 million devices.[25] In the last quarter of 2014, there were 74.5 million iPhones sold, a record, compared to 51.0 million in the last quarter of 2013.[26] Tim Cook revealed at the Apple Watch conference on March 9, 2015 that Apple had sold a total of 700 million iPhones to date.[1]"
			],
				"after": "Development of what was to become the iPhone began in 2004, when Apple started to gather a team of 1000 employees to work on the highly confidential \"Project Purple\",[27] including Jonathan Ive, the designer behind the iMac and iPod.[28] Apple CEO Steve Jobs steered the original focus away from a tablet, like the iPad, and towards a phone.[29] Apple created the device during a secretive collaboration with AT&T Mobility—Cingular Wireless at the time—at an estimated development cost of US$150 million over thirty months.[30]",
			"color": "light|0.20074 gray|0.20074 light|0.20074 grey|0.20074 misty|0.18652 rose|0.18652 gainsboro|0.16491 dim|0.084102 gray|0.084102 dim|0.084102 grey|0.084102 gray|0.080114 grey|0.080114 dark|0.063352 gray|0.063352 dark|0.063352 grey|0.063352 silver|0.06047 antique|0.036896 white|0.036896 linen|0.03331 sea|0.020009 shell|0.020009 old|0.01261 lace|0.01261 white|0.0086521 smoke|0.0086521 snow|0.0079071 floral|0.0078842 white|0.0078842 lavender|0.0072865 blush|0.0072865 white|0.0069139 ghost|0.0067456 white|0.0067456 mint|0.0041382 cream|0.0041382 alice|0.0031023 blue|0.0031023  "
		}
	}
}
