{
	"add": {
		"doc": {
			"id": "3aa240d703352e0ab1e71f05453d8809fb524e93170835d86cbe31c98f0eac88",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wikipedia_video_tutorial-1-Editing-en.ogv/170px--Wikipedia_video_tutorial-1-Editing-en.ogv.jpg",
				"previous": "The ease of editing Wikipedia results in many people editing. That makes the updating of the encyclopedia very quick, almost as fast as news websites.",
			"after": [
				"Wikipedia uses a simple yet powerful page layout to allow editors to concentrate on adding material rather than page design. Page aspects facilitated include:",
				"Normally editing is chosen by clicking the Edit tab at the top of a Wikipedia page (or on a section-edit link). This will take you to a new page with a text box containing the editable text of the page you were viewing. In this box, you can type in the text that you want to add, using wiki markup to format the text and add other elements like images and tables. You should then press the Show preview button to review your contributions for any errors. When you have finished editing, you should write a short edit summary in the small field below the edit-box describing your changes before you press the Save page button. This will help others to understand the intention of your edit. To avoid accidentally leaving edit summaries blank, you can select \"Prompt me when entering a blank edit summary\" on the Editing tab of your personal preferences."
			],
			"color": "white|0.090033 smoke|0.090033 snow|0.084893 sea|0.084098 shell|0.084098 ghost|0.083935 white|0.083935 white|0.083756 alice|0.083711 blue|0.083711 mint|0.082545 cream|0.082545 floral|0.079847 white|0.079847 azure|0.078492 lavender|0.075759 blush|0.075759 light|0.03446 gray|0.03446 light|0.03446 grey|0.03446 silver|0.031095 gainsboro|0.030889 dark|0.022284 gray|0.022284 dark|0.022284 grey|0.022284 linen|0.012135 ivory|0.0076771 light|0.0065876 steel|0.0065876 blue|0.0065876 pale|0.0034241 turquoise|0.0034241 light|0.0026896 cyan|0.0026896 old|0.0025736 lace|0.0025736 honeydew|0.002552  "
		}
	}
}
