{
	"add": {
		"doc": {
			"id": "3abb7acd3b863059dd8b61569afc7ab4ed2ffa67c32f68eea59052d1b6a3494e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/USS_Menard_%28APA-201%29.jpg/220px-USS_Menard_%28APA-201%29.jpg",
				"previous": "The first US vessel to participate in the mass evacuation was the Menard, which left Haiphong on August 17. It carried 1,924 refugees for a 1,600 kilometre, three-day journey to the southern capital.[22] By this time, there were already 132,000 people registered at the waiting areas, although very few had any identification.[19] As a result, there would be more work to be done in identifying their needs once they arrived in the south.[19] The Montrose followed on the next day, with 2,100 passengers. Both were originally built as attack transport vessels. In August, the US policy was liberalised so that Vietnamese and French military personnel could also be evacuated at the discretion of CTF-90 and the Chief Military Assistance Advisory Group (CHMAAG).[22] To cope with the rising volume of southbound sea transport, CHMAAG established a refugee debarkation site at Vũng Tàu, a coastal port at the entrance of the Saigon River. This site relieved congestion in the Saigon refugee camps and decreased the traffic bottlenecks along the river. A setback occurred when a typhoon struck the Haiphong area, destroying almost half of the refugee staging area. Despite the problems, by September 3, the US Navy had evacuated 47,000 northerners after only two weeks of operations.[23] The high rate of evacuation caused the South Vietnamese government to order that only one shipment of at most 2,500 passengers was to arrive in Saigon or Vũng Tàu per day, until September 25. The population pressure in the south was eased as incoming numbers fell due to Viet Minh propaganda campaigns and forcible detention, combined with the rice harvesting season, which had prompted some to delay their departure.[24] Some were even waiting to finish all their business deals before moving in the Lunar New Year. On October 10, the Viet Minh were given full control of Hanoi, closing off one point of evacuation for those who wanted out.[25] Some also decided to stay behind and see how the Viet Minh would treat the inhabitants of Hanoi before making a decision on whether to leave their ancestral lands.[25] On October 20, the French authorities that were still in control of the ports decided to waive docking fees on US vessels engaged in the evacuation.[24] Because of the high demand, the naval vessels had to travel quickly; one ship completed one round trip in a record of only six days.[26] The record for the most passengers taken in one journey was set by the USS General Black, which sailed on October 29 with 5,224 Vietnamese aboard.[27] In November, the evacuation was further hampered by another typhoon, while the entire crew of one American vessel were struck down by a scabies outbreak.[28] In December, because of Viet Minh obstruction, which prevented people from rural and regional areas from travelling to Hanoi and Haiphong to emigrate, the French Navy sent ships to hover just off the coast near the regional town of Vinh to evacuate refugees.[29]",
				"after": "According to COMIGAL,[30] the South Vietnamese government agency responsible for the migration, French aircraft made 4,280 trips, carrying a total of 213,635 refugees. A total of 555,037 passengers were recorded on 505 sea trips. The French Navy accounted for the vast majority of the naval evacuees, with 388 voyages, while the US Navy made 109. British, Taiwanese and Polish ships made two, two and four journeys respectively. The official figures reported that a total of 768,672 people had migrated under military supervision. Of this number around 190,000 were French and Saigon soldiers and returned prisoners; some 43,000 were military dependents, \"15,000–25,000 Nung tribesmen who were military auxiliaries, between 25,000 and 40,000 French citizens, and about 45,000 Chinese residents.\"[2] It also included several thousand people who had worked for the French and Vietnamese administrations in the North. The official figures recorded that more than 109,000 people journeyed into the south by their own means, some arriving outside the 300-day period. These people typically crossed the river that divided the zones on makeshift rafts, sailed on improvised watercraft into a southern port, or trekked through Laos. As of 1957, the South Vietnamese government claimed a total of 928,152 refugees, of whom 98.3% were ethnic Vietnamese. The 1957 report said that 85% were engaged in farming or fishing for their livelihood and 85% were Catholics, while the remainder were Buddhists or Protestants.[31] However, an October 1955 government report claimed that 76.3% were Catholics, 23.5% were Buddhists and 0.2% Protestants.[32] In 1959, however, the head of COMIGAL, Bui Van Luong, admitted that the actual number of refugees could have been as low as 600,000. The official data excluded approximately 120,000 anti-communist military personnel and claimed that only 4,358 people moved north, though no historians consider this number credible. The northward migration was attributed to itinerant workers from rubber plantations who returned north for family reasons.[31]",
			"color": "dark|0.18945 gray|0.18945 dark|0.18945 grey|0.18945 silver|0.18105 antique|0.14042 white|0.14042 light|0.12591 gray|0.12591 light|0.12591 grey|0.12591 misty|0.082281 rose|0.082281 dim|0.075708 gray|0.075708 dim|0.075708 grey|0.075708 gray|0.046966 grey|0.046966 gainsboro|0.040563 linen|0.027843 rosy|0.024215 brown|0.024215  "
		}
	}
}
