{
	"add": {
		"doc": {
			"id": "3ace185855b451bd185f3e2af89cf733e0a30fb47aaa06130378c6509999726d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Abrams_in_formation.jpg/220px-Abrams_in_formation.jpg",
				"previous": "During the 1960s the Department of Defense continued to scrutinize the reserve forces and to question the number of divisions and brigades as well as the redundancy of maintaining two reserve components, the Army National Guard and the Army Reserve.[17] In 1967 Secretary of Defense Robert McNamara decided that 15 combat divisions in the Army National Guard were unnecessary and cut the number to 8 divisions (1 mechanized infantry, 2 armored, and 5 infantry), but increased the number of brigades from 7 to 18 (1 airborne, 1 armored, 2 mechanized infantry, and 14 infantry). The loss of the divisions did not set well with the states. Their objections included the inadequate maneuver element mix for those that remained and the end to the practice of rotating divisional commands among the states that supported them. Under the proposal, the remaining division commanders were to reside in the state of the division base. No reduction, however, in total Army National Guard strength was to take place, which convinced the governors to accept the plan. The states reorganized their forces accordingly between 1 December 1967 and 1 May 1968.",
				"after": "The Total Force Policy was adopted by Chief of Staff of the Army General Creighton Abrams in the aftermath of the Vietnam War and involves treating the three components of the army – the Regular Army, the Army National Guard and the Army Reserve as a single force.[18] Believing that no U.S. president should be able to take the United States (and more specifically the U.S. Army) to war without the support of the American people, General Abrams intertwined the structure of the three components of the army in such a way as to make extended operations impossible, without the involvement of both the Army National Guard and the Army Reserve.[19]",
			"color": "tan|0.32859 wheat|0.2482 peach|0.10175 puff|0.10175 bisque|0.081073 black|0.077089 antique|0.044213 white|0.044213 blanched|0.032564 almond|0.032564 papaya|0.017953 whip|0.017953 light|0.013738 gray|0.013738 light|0.013738 grey|0.013738 moccasin|0.011127 beige|0.009904 silver|0.0093353 gainsboro|0.005294  "
		}
	}
}
