{
	"add": {
		"doc": {
			"id": "3ad5e56438d8e2d393b8c4a529f45a108a26915166cdb9c21a909dcda36b5488",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/EncycBrit1913.jpg/256px-EncycBrit1913.jpg",
				"previous": "The eleventh edition's articles are still of value and interest to modern readers and scholars, especially as a cultural artifact: the British Empire was at its maximum, imperialism was largely unchallenged, much of the world was still ruled by monarchs, and the tragedy of the modern world wars were still in the future. They are an invaluable resource for topics omitted from modern encyclopedias, particularly for biography and the history of science and technology. As a literary text, the encyclopedia has value as an example of early 20th-century prose. For example, it employs literary devices, such as pathetic fallacy (attribution of human-like traits to impersonal forces or inanimate objects), which are not as common in modern reference texts.[3]",
				"after": "In 1917, using the pseudonym of S. S. Van Dine, the US art critic and author Willard Huntington Wright published Misinforming a Nation, a 200+ page criticism of inaccuracies and biases of the Encyclopædia Britannica eleventh edition. Wright claimed that Britannica was \"characterized by misstatement, inexcusable omissions, rabid and patriotic prejudices, personal animosities, blatant errors of fact, scholastic ignorance, gross neglect of non-British culture, an astounding egotism, and an undisguised contempt for American progress.\"[4]",
			"color": "black|0.078975 old|0.073307 lace|0.073307 ivory|0.07169 beige|0.069446 antique|0.068307 white|0.068307 corn|0.064432 silk|0.064432 dim|0.064373 gray|0.064373 dim|0.064373 grey|0.064373 floral|0.059578 white|0.059578 light|0.057973 yellow|0.057973 papaya|0.05441 whip|0.05441 gray|0.05124 grey|0.05124 linen|0.048806 honeydew|0.042182 dark|0.028031 gray|0.028031 dark|0.028031 grey|0.028031 sea|0.027888 shell|0.027888 light|0.026263 golden|0.026263 rod|0.026263 yellow|0.026263 blanched|0.024613 almond|0.024613 silver|0.017419 mint|0.013853 cream|0.013853 light|0.01242 gray|0.01242 light|0.01242 grey|0.01242 lemon|0.009873 chiffon|0.009873 gainsboro|0.0087476 snow|0.0081288 white|0.0079969 white|0.0076183 smoke|0.0076183  "
		}
	}
}
