{
	"add": {
		"doc": {
			"id": "3af4b148992490bfd2a62776118fe9c462c705bee0f7ca17bef1f898e407d33e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Jedlik_motor.jpg/200px-Jedlik_motor.jpg",
				"previous": "Perhaps the first electric motors were simple electrostatic devices created by the Scottish monk Andrew Gordon in the 1740s.[2] The theoretical principle behind production of mechanical force by the interactions of an electric current and a magnetic field, Ampère's force law, was discovered later by André-Marie Ampère in 1820. The conversion of electrical energy into mechanical energy by electromagnetic means was demonstrated by the British scientist Michael Faraday in 1821. A free-hanging wire was dipped into a pool of mercury, on which a permanent magnet (PM) was placed. When a current was passed through the wire, the wire rotated around the magnet, showing that the current gave rise to a close circular magnetic field around the wire.[3] This motor is often demonstrated in physics experiments, brine substituting for toxic mercury. Though Barlow's wheel was an early refinement to this Faraday demonstration, these and similar homopolar motors were to remain unsuited to practical application until late in the century.",
				"after": "In 1827, Hungarian physicist Ányos Jedlik started experimenting with electromagnetic coils. After Jedlik solved the technical problems of the continuous rotation with the invention of commutator, he called his early devices \"electromagnetic self-rotors\". Although they were used only for instructional purposes, in 1828 Jedlik demonstrated the first device to contain the three main components of practical DC motors: the stator, rotor and commutator. The device employed no permanent magnets, as the magnetic fields of both the stationary and revolving components were produced solely by the currents flowing through their windings.[5][6][7][8][9][10][11]",
			"color": "saddle|0.16687 brown|0.16687 sienna|0.10015 mint|0.067458 cream|0.067458 white|0.066518 smoke|0.066518 azure|0.062326 honeydew|0.061871 gainsboro|0.055045 floral|0.053727 white|0.053727 linen|0.05101 sea|0.036478 shell|0.036478 alice|0.034617 blue|0.034617 black|0.033583 ivory|0.03265 white|0.027364 old|0.027073 lace|0.027073 snow|0.026335 light|0.018185 cyan|0.018185 light|0.014188 gray|0.014188 light|0.014188 grey|0.014188 dim|0.012669 gray|0.012669 dim|0.012669 grey|0.012669 gray|0.011269 grey|0.011269  "
		}
	}
}
