{
	"add": {
		"doc": {
			"id": "3afe6cf2097c346430ead8026655cc1a77bb52bbbdf702cd7b96e16fc401338c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Brown_Ike.jpg/170px-Brown_Ike.jpg",
				"previous": "Two prototype dollars were struck at the Philadelphia Mint on January 25, 1971; they were subsequently destroyed.[31] Striking such large pieces of tough copper-nickel proved destructive to the Mint's dies, and Gasparro repeatedly used the Janvier reducing lathe to lower the relief to be used on the circulation strikes and the uncirculated silver clad coins. The chief engraver altered the resulting master die directly to restore at least some of the detail which was lost as the relief was lowered. The proof coins struck at San Francisco, nevertheless, remained in high relief.[32] This meant that in 1971 and for much of 1972 (until better-quality steel was used in the dies), the uncirculated strikes had a lower relief, less detailed surface, compared with the proof coins. Proof coins are struck slowly, and generally multiple times, to bring out the full detail.[33] Striking of Eisenhower dollars for circulation began at Denver on February 3, apparently without any ceremony; minting at Philadelphia also began early in the year, although Bowers, in his comprehensive encyclopedia of silver and clad dollar coins, does not record a specific date.[34] The first Eisenhower dollars in 40% silver, with an uncirculated finish, were struck at the San Francisco Assay Office (today the San Francisco Mint) on March 31, 1971; Brooks ceremoniously operated the presses. The first coin struck was for presentation to Mamie Eisenhower; the second to David Eisenhower (grandson of Dwight and Mamie Eisenhower) and the third to David Eisenhower's father-in-law, President Nixon.[35]",
				"after": "On January 29, 1971, the Mint announced the prices for the 40% silver pieces which would be struck at San Francisco: $3 for uncirculated specimens and $10 for mirror-surfaced proof pieces, with orders to be taken by mail beginning on July 1, with a limit of five of each per customer. Order forms for the public were shipped to 44,000 post offices and 33,000 banks, with instructions not to hand them out until June 18. The Mint returned some orders for being sent in too early.[36] Mint sets of the circulating coinage for 1971 did not include the Eisenhower dollar.[16]",
			"color": "maroon|0.55144 dark|0.22084 red|0.22084 dark|0.057345 gray|0.057345 dark|0.057345 grey|0.057345 brown|0.041537 tan|0.029919 silver|0.026421  "
		}
	}
}
