{
	"add": {
		"doc": {
			"id": "3b0168937232514b554a95c1e306ccbdd9e26de64603cd1f9cb390ac3b43ff96",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/The_Katoomba_Colliery_Scenic_Railway.jpg/220px-The_Katoomba_Colliery_Scenic_Railway.jpg",
				"previous": "After leaving PN Russell, Selfe went into partnership with his former employer James Dunlop. They designed and built major installations for the Australasian Mineral Oil Company, the Western Kerosene Oil Company and the Australian Gas Light Company.[13] In 1869 Selfe was appointed to the senior post of \"chief draftsman and scientific engineer\" at Mort's Dock and Engineering Company in Balmain.[1][14] In this role he oversaw the design and construction of the mail ship SS Governor Blackall, personally commissioned for the Queensland government by the Premier Charles Lilley in 1869.[15] The Sydney-built but Queensland-owned ship was an attempt to break what was later described as the \"capricious monopoly\" of the Australasian Steam Navigation Company on coastal trade and mail delivery from England. However, it ultimately caused the political downfall of Lilley as he had undertaken the contract without consulting his colleagues.[16]",
				"after": "Selfe left Mort's in 1877 to practice as a consulting engineer at 141 Pitt Street, gaining a reputation for versatility and originality. Upon his return from an overseas trip through America, Britain and continental Europe in 1884–85, where he visited engineering works and technical education facilities in search of new ideas to take back to Sydney, Selfe set up a new office in Lloyd's Chambers at 348 George Street.[11] He would later move to No. 279 where he operated the consultancy until his death in 1911. In the late 1890s he employed William Dixson as an engineer, who would later make a major donation of Australiana to the State Library of New South Wales.[17] The collection of Selfe's own papers and drawings have since been donated to the same library that his former employee greatly augmented.[18]",
			"color": "black|0.36469 tan|0.15215 wheat|0.09643 dim|0.069686 gray|0.069686 dim|0.069686 grey|0.069686  "
		}
	}
}
