{
	"add": {
		"doc": {
			"id": "3b0a538e0623b707b2441b83afcaf72c259dbd530798e54a323375134d5a0bd1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Ph_Territorial_Map.png/300px-Ph_Territorial_Map.png",
				"previous": "Normally, the baseline from which the territorial sea is measured is the low-water line along the coast as marked on large-scale charts officially recognized by the coastal state. This is either the low-water mark closest to the shore, or alternatively it may be an unlimited distance from permanently exposed land, provided that some portion of elevations exposed at low tide but covered at high tide (like mud flats) is within 12 nautical miles (22 km; 14 mi) of permanently exposed land. Straight baselines can alternatively be defined connecting fringing islands along a coast, across the mouths of rivers, or with certain restrictions across the mouths of bays. In this case, a bay is defined as \"a well-marked indentation whose penetration is in such proportion to the width of its mouth as to contain land-locked waters and constitute more than a mere curvature of the coast. An indentation shall not, however, be regarded as a bay unless its area is as large as, or larger than, that of the semi-circle whose diameter is a line drawn across the mouth of that indentation\". The baseline across the bay must also be no more than 24 nautical miles (44 km; 28 mi) in length.",
				"after": "Waters landward of the baseline are defined as internal waters, over which the state has complete sovereignty: not even innocent passage is allowed. Lakes and rivers are considered internal waters. All \"archipelagic waters\" within the outermost islands of an archipelagic state such as Indonesia or the Philippines are also considered internal waters, and are treated the same with the exception that innocent passage through them must be allowed. However, archipelagic states may designate certain sea lanes through these waters.",
			"color": "dodger|0.37184 blue|0.37184 peach|0.092487 puff|0.092487 steel|0.087558 blue|0.087558 wheat|0.086155 navajo|0.078653 white|0.078653 moccasin|0.076822 bisque|0.071331 dark|0.03475 gray|0.03475 dark|0.03475 grey|0.03475 tan|0.026895 light|0.025926 slate|0.025926 gray|0.025926 silver|0.023229 light|0.01275 sky|0.01275 blue|0.01275  "
		}
	}
}
