{
	"add": {
		"doc": {
			"id": "3b0e4391e7504bf03a98449b0f33aae9690d5c710b9fed22c81efcf455c4467a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Insidestkildachurch.jpg/220px-Insidestkildachurch.jpg",
				"previous": "Mackenzie left in 1844,[84] and although he had achieved a great deal, the weakness of the St Kildans' dependence on external authority was exposed in 1865 with the arrival of Rev. John Mackay. Despite their fondness for Mackenzie, who stayed in the Church of Scotland, the St Kildans \"came out\" in favour of the new Free Church during the Disruption. Mackay, the new Free Church minister, placed an uncommon emphasis on religious observance. He introduced a routine of three two-to-three-hour services on Sunday at which attendance was effectively compulsory. One visitor noted in 1875 that: \"The Sabbath was a day of intolerable gloom. At the clink of the bell the whole flock hurry to Church with sorrowful looks and eyes bent upon the ground. It is considered sinful to look to the right or to the left.\"[85]",
				"after": "Time spent in religious gatherings interfered seriously with the practical routines of the island. Old ladies and children who made noise in church were lectured at length and warned of dire punishments in the afterworld. During a period of food shortages on the island, a relief vessel arrived on a Saturday, but the minister said that the islanders had to spend the day preparing for church on the Sabbath, and it was Monday before supplies were landed. Children were forbidden to play games and required to carry a Bible wherever they went. Mackay remained minister on St Kilda for 24 years.[86]",
			"color": "black|0.77708 white|0.020518 smoke|0.020518 ghost|0.019987 white|0.019987 alice|0.019536 blue|0.019536 snow|0.019472 white|0.019065 azure|0.019038 mint|0.018988 cream|0.018988 sea|0.017374 shell|0.017374 floral|0.017264 white|0.017264 lavender|0.0096366 blush|0.0096366 gainsboro|0.0069432 saddle|0.0065732 brown|0.0065732  "
		}
	}
}
