{
	"add": {
		"doc": {
			"id": "3b111cbb6d1ae820601b0851dc70200565fd95f6de5ba8ed6930dae4f7c15fa8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Carl_Ransom_Rogers.jpg/170px-Carl_Ransom_Rogers.jpg",
				"previous": "As the 1970s began, the New Left faded away,[69] and many movements arose in its wake – among them the feminist, men's liberation, spiritual, human potential, ecology, appropriate technology, intentional community, and holistic health movements.[70][71] After graduating from the University of British Columbia in 1972,[11] Satin immersed himself in all these movements, either directly[72] or as a reporter for Canada's underground press.[6] He also took up residence in a free-love commune.[15] \"One fierce winter's day\", he says, \"... it dawned on me that the ideas and energies from the various 'fringe' movements [were] beginning to generate a coherent new politics. But I looked in vain for the people and groups that were expressing that new politics (instead of merely bits and pieces of it)\".[73] Satin set out to write a book that would express the new politics in all its dimensions.[73] He wrote, designed, typeset, and printed the first edition of New Age Politics himself, in 1976.[74] A 240-page edition was published by Vancouver's Whitecap Books in 1978,[75] and a 349-page edition by Dell Publishing Company in New York in 1979. It is now widely regarded as the \"first\",[76] \"most ambitious\",[77] or \"most adequate\"[78] attempt to offer a systemic overview of the new post-socialist politics arising in the wake of the New Left. Some academics say it offers a new ideology.[3][79]",
				"after": "At the heart of New Age Politics is a critique of the consciousness we all supposedly share, a \"six-sided prison\" that has kept us all trapped for hundreds of years. The six sides of the \"prison\" are said to be: patriarchal attitudes, egocentricity, scientific single vision, the bureaucratic mentality, nationalism (xenophobia), and the \"big city outlook\" (fear of nature). Since consciousness, according to Satin, ultimately determines our institutions, prison consciousness is said to be ultimately responsible for \"monolithic\" institutions that offer us little in the way of freedom of choice or connection with others. Some representative monolithic institutions are: bureaucratic government, automobile-centered transportation systems, attorney-centered law, doctor-centered health care, and church-centered spirituality.[81]",
			"color": " "
		}
	}
}
