{
	"add": {
		"doc": {
			"id": "3b156f5dc6e29e4d6a5eb2cb7e115d827d6d23c96f7d5d57d12ac826bffee997",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Anonymous_Protest.jpg/220px-Anonymous_Protest.jpg",
				"previous": "In January 1995, church lawyer Helena Kobrin attempted to shut down the newsgroup alt.religion.scientology by sending a control message instructing Usenet servers to delete the group.[297] In practice, this rmgroup message had little effect, since most Usenet servers are configured to disregard such messages when sent to groups that receive substantial traffic, and newgroup messages were quickly issued to recreate the group on those servers that did not do so. However, the issuance of the message led to a great deal of public criticism by free-speech advocates.[298][299] Among the criticisms raised, one suggestion is that Scientology's true motive is to suppress the free speech of its critics.[300][301]",
				"after": "The Church also began filing lawsuits against those who posted copyrighted texts on the newsgroup and the World Wide Web, and lobbied for tighter restrictions on copyrights in general. The Church supported the controversial Sonny Bono Copyright Term Extension Act as well as the even more controversial Digital Millennium Copyright Act (DMCA). Some of the DMCA's provisions (notably the Online Copyright Infringement Liability Limitation Act) were heavily influenced by Church litigation against US Internet service providers over copyrighted Scientology materials that had been posted or uploaded through their servers.",
			"color": "black|0.36852 dim|0.099517 gray|0.099517 dim|0.099517 grey|0.099517 dark|0.08751 gray|0.08751 dark|0.08751 grey|0.08751 gray|0.069135 grey|0.069135 light|0.062689 steel|0.062689 blue|0.062689 light|0.047522 slate|0.047522 gray|0.047522 slate|0.039405 gray|0.039405 silver|0.039169 dark|0.035336 olive|0.035336 green|0.035336 lavender|0.03407 light|0.016657 gray|0.016657 light|0.016657 grey|0.016657 rosy|0.014153 brown|0.014153 dark|0.01264 slate|0.01264 gray|0.01264 gainsboro|0.012078 thistle|0.0085372  "
		}
	}
}
