{
	"add": {
		"doc": {
			"id": "3b19b75eee9f3b10b7c23b647a87fcc82e92464a68a7660c5770c440463d5dd2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/SolidRocketMotor.svg/300px-SolidRocketMotor.svg.png",
				"previous": "Chemical rocket propellants are most commonly used, which undergo exothermic chemical reactions which produce hot gas which is used by a rocket for propulsive purposes. Alternatively, a chemically inert reaction mass can be heated using a high-energy power source via a heat exchanger, and then no combustion chamber is used.",
				"after": "Solid rocket propellants are prepared as a mixture of fuel and oxidising components called 'grain' and the propellant storage casing effectively becomes the combustion chamber. Liquid-fuelled rockets typically pump separate fuel and oxidiser components into the combustion chamber, where they mix and burn. Hybrid rocket engines use a combination of solid and liquid or gaseous propellants. Both liquid and hybrid rockets use injectors to introduce the propellant into the chamber. These are often an array of simple jets - holes through which the propellant escapes under pressure; but sometimes may be more complex spray nozzles. When two or more propellants are injected, the jets usually deliberately cause the propellants to collide as this breaks up the flow into smaller droplets that burn more easily.",
			"color": "dark|0.12871 gray|0.12871 dark|0.12871 grey|0.12871 silver|0.11758 gray|0.097898 grey|0.097898 light|0.095802 gray|0.095802 light|0.095802 grey|0.095802 gainsboro|0.080463 sandy|0.069525 brown|0.069525 dim|0.049216 gray|0.049216 dim|0.049216 grey|0.049216 khaki|0.03776 white|0.030692 smoke|0.030692 sea|0.022506 shell|0.022506 ghost|0.022118 white|0.022118 alice|0.022075 blue|0.022075 snow|0.02207 lavender|0.021969 blush|0.021969 white|0.020277 mint|0.017725 cream|0.017725 sienna|0.017194 floral|0.015099 white|0.015099 peru|0.014363 linen|0.012749 azure|0.012574 black|0.010575 magenta|0.010158 fuchsia|0.010158 saddle|0.0098668 brown|0.0098668 dark|0.0061615 khaki|0.0061615  "
		}
	}
}
