{
	"add": {
		"doc": {
			"id": "3b360e005a03dd425af3c337a90305a3e9a552b423d545239d2db098217a7209",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Hillside_deforestation_in_Rio_de_Janeiro.jpg/300px-Hillside_deforestation_in_Rio_de_Janeiro.jpg",
				"previous": "A different proposed solution to partially decouple economic growth from environmental degradation is the restore approach.[157] This approach views \"restore\" as a fourth component to the common reduce, reuse, recycle motto. Participants in such efforts are encouraged to voluntarily donate towards nature conservation a small fraction of the financial savings they experience through a more frugal use of resources. These financial savings would normally lead to rebound effects, but a theoretical analysis suggests that donating even a small fraction of the experienced savings can potentially more than eliminate rebound effects.[157]",
				"after": "The economic importance of nature is indicated by the use of the expression ecosystem services to highlight the market relevance of an increasingly scarce natural world that can no longer be regarded as both unlimited and free.[158] In general, as a commodity or service becomes more scarce the price increases and this acts as a restraint that encourages frugality, technical innovation and alternative products. However, this only applies when the product or service falls within the market system.[159] As ecosystem services are generally treated as economic externalities they are unpriced and therefore overused and degraded, a situation sometimes referred to as the Tragedy of the Commons.[158]",
			"color": "dark|0.30333 slate|0.30333 gray|0.30333 dark|0.21603 gray|0.21603 dark|0.21603 grey|0.21603 silver|0.11701 black|0.069608 gray|0.04907 grey|0.04907 light|0.048986 gray|0.048986 light|0.048986 grey|0.048986 dim|0.047377 gray|0.047377 dim|0.047377 grey|0.047377 gainsboro|0.031845 rosy|0.0288 brown|0.0288 linen|0.0083119 white|0.008127 smoke|0.008127 sea|0.0080201 shell|0.0080201 misty|0.0079315 rose|0.0079315 floral|0.0078444 white|0.0078444 old|0.0076608 lace|0.0076608 snow|0.007563 lavender|0.0074583 blush|0.0074583 antique|0.0061926 white|0.0061926  "
		}
	}
}
