{
	"add": {
		"doc": {
			"id": "3b4093d6d37ca48f424ec55691a632da5d1bfd91c5e098a75cf78b672e14bb89",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Md-12-2.png/220px-Md-12-2.png",
				"previous": "In 1991, MD-11 was not quite a success, ongoing tests of the MD-11 revealed a significant shortfall in the aircraft's performance. An important prospective carrier, Singapore Airlines (SIA), required a fully laden aircraft that could fly from Singapore to Paris, against strong headwinds during mid-winter; the MD-11 did not have sufficient range for this at the time.[59] Due to the less-than-expected performance figures, SIA cancelled its 20-aircraft MD-11 order on 2 August 1991, and ordered 20 A340-300s instead.[60]",
				"after": "In 1992, McDonnell Douglas unveiled a study of a double deck jumbo-sized aircraft designated MD-12.[35][61] Despite briefly leaving the market, the study was perceived as merely a public relations exercise to disguise the fact that MDC was struggling under intense pressure from Boeing and Airbus. It was clear to most in the industry that MDC had neither the resources nor the money to develop such a large aircraft,[62] and the study quickly sank without a trace. A similar double deck concept was used in Boeing's later Ultra-Large Aircraft study intended to replace the 747,[63][64] but ultimately the double deck concept would not see the light of day until the Airbus A380 in the 2000s.[65][66]",
			"color": "silver|0.30662 light|0.19142 gray|0.19142 light|0.19142 grey|0.19142 dark|0.11263 gray|0.11263 dark|0.11263 grey|0.11263 gainsboro|0.11079 light|0.060349 steel|0.060349 blue|0.060349 gray|0.05318 grey|0.05318 steel|0.02649 blue|0.02649 dim|0.022458 gray|0.022458 dim|0.022458 grey|0.022458 white|0.012726 smoke|0.012726 light|0.010174 slate|0.010174 gray|0.010174 alice|0.0098161 blue|0.0098161 ghost|0.009526 white|0.009526 snow|0.0089577 sea|0.0087219 shell|0.0087219 lavender|0.0087148 blush|0.0087148 white|0.0080585 mint|0.0070667 cream|0.0070667 linen|0.0056932 light|0.0056126 blue|0.0056126 floral|0.0054384 white|0.0054384 azure|0.0048696 light|0.0032582 sky|0.0032582 blue|0.0032582  "
		}
	}
}
