{
	"add": {
		"doc": {
			"id": "3b59cbea9b2fbec2fc1912cfd6f22486f296768ff04e08332480616437655914",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/5_French_francs_Semeuse_silver_1960_F340-4_obverse.jpg/170px-5_French_francs_Semeuse_silver_1960_F340-4_obverse.jpg",
				"previous": "With the new pieces, all American coins would have had a recent change of design (the Morgan dollar was not then being struck.)[21] According to a column in The Art World magazine later in 1916,",
			"after": [
				"According to Secretary McAdoo in his 1916 annual report,",
				"Weinman's obverse bears a resemblance to Oscar Roty's \"Sower\" design for French coins; according to numismatic historian Roger Burdette, \"Weinman has taken the ideal of a nineteenth century provincial figure and turned it into an American icon.\"[a] [24] Burdette ties both the appearance of the head of Liberty and of the branches which she carries to Baltimore's Union Soldiers and Sailors' Monument, designed by Weinman.[25] The sculptor may also have drawn inspiration from a 1913 bust he did of his tenant, Elsie Stevens, wife of lawyer and poet Wallace Stevens. Elsie Stevens is generally believed to have been a model for Weinman's Mercury dime; her daughter Holly wrote in 1966 that her mother had been the model for both coins.[26] The reverse is similar to Weinman's medal for the American Institute of Architects, although the sculptor replaced the laurel on the medal with a pine sapling. Weinman's work on the medal had been widely admired for the power of the depicted eagle.[25]"
			],
			"color": "light|0.12827 gray|0.12827 light|0.12827 grey|0.12827 dark|0.12719 gray|0.12719 dark|0.12719 grey|0.12719 gainsboro|0.11604 silver|0.11549 gray|0.08011 grey|0.08011 linen|0.060265 dim|0.05968 gray|0.05968 dim|0.05968 grey|0.05968 white|0.048121 smoke|0.048121 sea|0.044201 shell|0.044201 snow|0.032106 floral|0.03194 white|0.03194 lavender|0.030137 blush|0.030137 old|0.026941 lace|0.026941 ghost|0.020649 white|0.020649 white|0.020048 misty|0.018663 rose|0.018663 mint|0.014515 cream|0.014515 alice|0.007178 blue|0.007178 antique|0.0069059 white|0.0069059 ivory|0.0051366 azure|0.0032622  "
		}
	}
}
