{
	"add": {
		"doc": {
			"id": "3b7d818117c65083d83fc5792b8dbbbb955dc97032df53779f37901516b5f401",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Beat_goes_on_madonna_day.jpg/220px-Beat_goes_on_madonna_day.jpg",
			"previous": [],
				"after": "\"Beat Goes On\" was performed during the Sticky & Sweet Tour (2008–09) as the second song of the opening segment, \"Pimp\". After descending the throne during the first song, \"Candy Shop\", Madonna and her dancers are featured on a 1935 Auburn Speedster to the performance of the song. Pharrell Williams and Kanye West appeared on the backdrops.[29] Sarah Liss of CBC News called the performance \"pulsating,\" noting that \"her studio collaborators—Pharrell Williams and Kanye West—present in spirit and countenance (their virtual likenesses grimaced from those massive screens) if not in body.\"[30] Michael Roffman of Consequence of Sound praised the performance, writing that \"by the second song, 'Beat Goes On', it was clear that this was going to be one hell of an innovative show.\" Roffman also pointed out that \"a digital Kanye West joined Madonna on stage, rapping along as the singer flipped and bounced on the floor.\"[31] During a Chicago concert, Paul Schrodt of Slant Magazine wrote that \"a song about the freedom to dance (\"Beat Goes On\") becomes an anthem for political frustration, and it's the only moment that's generated any real controversy, but she doesn't say anything about either the Republican or the Democratic candidate that she hasn't said before. The power of any great Madonna song is implicit: 'Say what you like/Do what you feel/You know exactly who you are'.\"[15] The live performance of the song at River Plate Stadium of Buenos Aires, Argentina, was recorded and released on the live CD-DVD album, Sticky & Sweet Tour (2010).[32]",
			"color": "black|0.47512 midnight|0.11176 blue|0.11176 dark|0.064494 slate|0.064494 blue|0.064494 lavender|0.058599 thistle|0.036191 royal|0.02922 blue|0.02922 lavender|0.018068 blush|0.018068 ghost|0.012133 white|0.012133 alice|0.010812 blue|0.010812 corn|0.0090882 flower|0.0090882 blue|0.0090882 light|0.009063 steel|0.009063 blue|0.009063 medium|0.0089974 slate|0.0089974 blue|0.0089974 slate|0.0089823 blue|0.0089823 navy|0.0083926 white|0.0080299 smoke|0.0080299 snow|0.0069246 azure|0.0066511 light|0.006273 blue|0.006273 white|0.0061652  "
		}
	}
}
