{
	"add": {
		"doc": {
			"id": "3b9215e13740fbb540c76b49f59933eb64ed06ad620afaa38e75adf145a33309",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/First_YF-18A_Hornet_on_display_in_1978.JPG/220px-First_YF-18A_Hornet_on_display_in_1978.JPG",
				"previous": "The F-18, initially known as McDonnell Douglas Model 267, was drastically modified from the YF-17. For carrier operations, the airframe, undercarriage, and tailhook were strengthened, folding wings and catapult attachments were added, and the landing gear widened.[7] To meet Navy range and reserves requirements, McDonnell increased fuel capacity by 4,460 pounds (2,020 kg), by enlarging the dorsal spine and adding a 96 gallon fuel tank to each wing. A \"snag\" was added to the wing's leading edge and stabilators to prevent an Aeroelastic flutter discovered in the F-15 stabilator. The wings and stabilators were enlarged, the aft fuselage widened by 4 inches (102 mm), and the engines canted outward at the front. These changes added 10,000 lb (4,540 kg) to the gross weight, bringing it to 37,000 lb (16,800 kg). The YF-17's control system was replaced with a fully digital fly-by-wire system with quadruple-redundancy, the first to be installed in a production fighter.[7]",
				"after": "Originally, it was planned to acquire a total of 780 aircraft of three variants: the single seat F-18A fighter and A-18A attack aircraft, differing only in avionics; and the dual-seat TF-18A, which retained full mission capability of the F-18 with a reduced fuel load.[8] Following improvements in avionics and multifunction displays, and a redesign of external stores stations, the A-18A and F-18A were able to be combined into one aircraft.[4] Starting in 1980, the aircraft began to be referred to as the F/A-18A, and the designation was officially announced on 1 April 1984. The TF-18A was redesignated F/A-18B.[4]",
			"color": "silver|0.12405 black|0.11822 dark|0.11101 gray|0.11101 dark|0.11101 grey|0.11101 light|0.097334 gray|0.097334 light|0.097334 grey|0.097334 gainsboro|0.072991 gray|0.062744 grey|0.062744 dim|0.053472 gray|0.053472 dim|0.053472 grey|0.053472 white|0.040641 smoke|0.040641 sea|0.034775 shell|0.034775 snow|0.031304 linen|0.030486 floral|0.027687 white|0.027687 white|0.02673 mint|0.026447 cream|0.026447 ghost|0.02564 white|0.02564 alice|0.023559 blue|0.023559 azure|0.019322 lavender|0.017231 blush|0.017231 tan|0.015771 ivory|0.010747  "
		}
	}
}
