{
	"add": {
		"doc": {
			"id": "3b989d30b4b984204ff268b741187d144628e06f933410a07cd20fa634e304a6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Pinkfloyd.png/100px-Pinkfloyd.png",
			"previous": [],
				"after": "Wish You Were Here (1975) is the ninth studio album by the English progressive rock group Pink Floyd (pictured), recorded at London's Abbey Road Studios. Some of its songs critique the music business; others express alienation. \"Shine On You Crazy Diamond\" is a tribute to Syd Barrett, whose mental breakdown had forced him to leave the group several years earlier; it was lead writer Roger Waters' idea to split the song into two parts and use it to bookend the other songs on the album. As on their previous album, The Dark Side of the Moon, the band made use of studio effects and synthesizers, and brought in guest singers for some tracks, including Roy Harper for the lead vocals on \"Have a Cigar\". The album became an instant commercial success, and record company EMI was unable to print enough copies to satisfy demand. Although it initially received mixed reviews, the album has since been acclaimed by critics and appears on Rolling Stone‍ '​s list of \"The 500 Greatest Albums of All Time\". Band members Richard Wright and David Gilmour have each cited Wish You Were Here as their favourite Pink Floyd album. (Full article...)",
			"color": "black|0.32432 dim|0.19772 gray|0.19772 dim|0.19772 grey|0.19772 lavender|0.080263 light|0.070406 steel|0.070406 blue|0.070406 slate|0.035701 gray|0.035701 gainsboro|0.029685 dark|0.02746 slate|0.02746 gray|0.02746 alice|0.026412 blue|0.026412 light|0.026133 slate|0.026133 gray|0.026133 ghost|0.022402 white|0.022402 gray|0.021157 grey|0.021157 white|0.016246 smoke|0.016246 burly|0.01546 wood|0.01546 light|0.012281 gray|0.012281 light|0.012281 grey|0.012281 rosy|0.0096811 brown|0.0096811 lavender|0.0088467 blush|0.0088467 dark|0.008241 gray|0.008241 dark|0.008241 grey|0.008241 snow|0.007195 tan|0.0070836 azure|0.0066743  "
		}
	}
}
