{
	"add": {
		"doc": {
			"id": "3b99fb2eabf0be6d268735ba96c0ae12b9da1e5596cdca09b1246aa10e136566",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Earth_%26_Mir_%28STS-71%29.jpg/220px-Earth_%26_Mir_%28STS-71%29.jpg",
				"previous": "Phase One of the Shuttle–Mir Program began on February 3, 1994, with the launch of Space Shuttle Discovery on its 18th mission, STS-60. The eight-day mission was the first shuttle flight of that year, the first flight of a Russian Cosmonaut, Sergei Krikalev, aboard the American shuttle, and marked the start of increased cooperation in space for the two nations, 37 years after the Space Race began.[15] Part of an international agreement on human space flight, the mission was the second flight of the Spacehab pressurized module and marked the hundredth \"Getaway Special\" payload to fly in space. The primary payload for the mission was the Wake Shield Facility (or WSF), a device designed to generate new semiconductor films for advanced electronics. The WSF was flown at the end of Discovery's robotic arm over the course of the flight. During the mission, the astronauts aboard Discovery also carried out various experiments aboard the Spacehab module in the Orbiter's payload bay, and took part in a live bi-directional audio and downlink video hookup between themselves and the three Cosmonauts on board Mir, Valeri Polyakov, Viktor Afanasyev and Yury Usachev (flying Mir expeditions LD-4 and EO-15).[12][16][17]",
			"after": [],
			"color": "steel|0.26531 blue|0.26531 light|0.22253 steel|0.22253 blue|0.22253 lavender|0.081378 white|0.037084 smoke|0.037084 alice|0.031543 blue|0.031543 snow|0.031223 white|0.030033 ghost|0.028976 white|0.028976 gainsboro|0.028369 mint|0.02824 cream|0.02824 sea|0.027024 shell|0.027024 floral|0.024888 white|0.024888 azure|0.023798 light|0.023216 gray|0.023216 light|0.023216 grey|0.023216 linen|0.018463 ivory|0.016399 light|0.01568 blue|0.01568 lavender|0.013611 blush|0.013611 old|0.012423 lace|0.012423 silver|0.0084443 light|0.0072835 slate|0.0072835 gray|0.0072835 honeydew|0.0071472  "
		}
	}
}
