{
	"add": {
		"doc": {
			"id": "3b9f3e9d84c668d040cd9020d5ed91b8426d98d7e4ee47e16b783167969f1249",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Bute_House%2C_Charlotte_Square_Edinburgh.JPG/220px-Bute_House%2C_Charlotte_Square_Edinburgh.JPG",
				"previous": "The Scottish Parliament can give legislative consent over devolved matters back to the UK Parliament by passing a Legislative Consent Motion if United Kingdom-wide legislation is considered more appropriate for a certain issue. The programmes of legislation enacted by the Scottish Parliament have seen a divergence in the provision of public services compared to the rest of the UK. For instance, university education and care services for the elderly are free at point of use in Scotland, while fees are paid in the rest of the UK. Scotland was the first country in the UK to ban smoking in enclosed public places.[122]",
				"after": "The Scottish Parliament is a unicameral legislature with 129 members (MSPs): 73 of them represent individual constituencies and are elected on a first past the post system; the other 56 are elected in eight different electoral regions by the additional member system. MSPs serve for a four-year period (exceptionally five years from 2011–16). The Queen appoints one Member of the Scottish Parliament, nominated by the Parliament, to be First Minister. Other ministers are appointed by the First Minister and serve at his/her discretion. Together they make up the Scottish Government, the executive arm of the devolved government.[123]",
			"color": "dim|0.31894 gray|0.31894 dim|0.31894 grey|0.31894 gray|0.22616 grey|0.22616 dark|0.11174 gray|0.11174 dark|0.11174 grey|0.11174 black|0.056845 slate|0.047624 gray|0.047624 light|0.044474 slate|0.044474 gray|0.044474 silver|0.034648 light|0.016395 gray|0.016395 light|0.016395 grey|0.016395 antique|0.011891 white|0.011891 dark|0.011409 slate|0.011409 gray|0.011409 gainsboro|0.011016 linen|0.010309 old|0.0094668 lace|0.0094668 floral|0.0085823 white|0.0085823 beige|0.0082797 sea|0.008128 shell|0.008128 ivory|0.0075177 light|0.0070765 steel|0.0070765 blue|0.0070765 papaya|0.0054577 whip|0.0054577 white|0.0053636 smoke|0.0053636 mint|0.005187 cream|0.005187  "
		}
	}
}
