{
	"add": {
		"doc": {
			"id": "3bb6c8548ce7d6503124ba999b023740d4dd82ad4144dc75529af714c4e9b6a3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Don_Carter.jpg/200px-Don_Carter.jpg",
				"previous": "Kiki Vandeweghe of UCLA was drafted by the Mavs with the 11th pick of the 1980 NBA draft, but Vandeweghe refused to play for the expansion Mavericks and staged a holdout that lasted a month into the team's inaugural season. Vandeweghe was traded to the Denver Nuggets, along with a first-round pick, in 1981, in exchange for two future first-round picks that eventually materialized into Rolando Blackman in 1981 and Sam Perkins in 1984.",
				"after": "In the Mavericks' debut game, taking place in the brand-new Reunion Arena, the Mavericks defeated the Spurs, 103–92. But the Mavs started the season with a 6–40 record on their way to finishing 15–67. However, the Mavericks did make a player acquisition that, while it seemed minor at the time, turned out to play a very important role in the early years of their franchise. Journeyman 6 ft 3 in guard Brad Davis, who played for the Anchorage Northern Knights of the Continental Basketball Association, was tracked down and signed by the Mavs in December. At the time, there was absolutely no reason to expect that Davis would be any better than the expansion-level talent the Mavs had.[citation needed] But he started the Mavs' final 26 games, led the team in assists, and his career soared. He spent the next twelve years with the Mavericks, and eventually his number 15 jersey was retired. The Mavericks also marked the first NBA team to have a profitable debut season, with an average of 7,789 spectators.[7]",
			"color": "black|0.55623 dark|0.081814 slate|0.081814 gray|0.081814 dim|0.028977 gray|0.028977 dim|0.028977 grey|0.028977 gray|0.025106 grey|0.025106 dark|0.017737 gray|0.017737 dark|0.017737 grey|0.017737 teal|0.013977 white|0.012755 smoke|0.012755 floral|0.01259 white|0.01259 sea|0.012388 shell|0.012388 silver|0.012367 snow|0.01165 mint|0.011409 cream|0.011409 white|0.011192 dark|0.010621 cyan|0.010621 cadet|0.010098 blue|0.010098 light|0.009478 gray|0.009478 light|0.009478 grey|0.009478 linen|0.0094659 ghost|0.0084312 white|0.0084312 ivory|0.0084137 azure|0.0084102 old|0.0073784 lace|0.0073784 gainsboro|0.0071619 alice|0.007101 blue|0.007101 tan|0.0070757 slate|0.0068536 gray|0.0068536 antique|0.0056951 white|0.0056951 lavender|0.0054389 blush|0.0054389 light|0.0051481 slate|0.0051481 gray|0.0051481 rosy|0.0051402 brown|0.0051402 honeydew|0.0049729 papaya|0.0046146 whip|0.0046146 beige|0.004397 blanched|0.0043482 almond|0.0043482 corn|0.0041939 silk|0.0041939 light|0.004109 sea|0.004109 green|0.004109  "
		}
	}
}
