{
	"add": {
		"doc": {
			"id": "3bc645e803f809f1afd08a67792a12a6d5a6f2256735ae9b3f98044b2f58c19c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Deinocheirus_hands.jpg/220px-Deinocheirus_hands.jpg",
				"previous": "The first known fossil remains of Deinocheirus were discovered by Polish palaeontologist Zofia Kielan-Jaworowska on July 9, 1965, at the Altan Ula III site (coordinates: 43°33.987′N 100°28.959′E﻿ / ﻿43.566450°N 100.482650°E﻿ / 43.566450; 100.482650) in the Nemegt Basin of the Gobi Desert. She was part of a Polish group accompanied by Mongolian palaeontologist Rinchen Barsbold during the 1963–1965 Polish-Mongolian palaeontological expeditions, which were organised by the Polish Academy of Sciences and the Mongolian Academy of Sciences. The crew spent July 9–11 excavating the specimen and loading it onto a vehicle. A 1968 report by Kielan-Jaworowska and Naydin Dovchin, which summarised the accomplishments of the expeditions, announced that the remains represented a new family of theropod dinosaur.[1][10] The specimen was discovered on a small hill in sandstone, and consists of a partial, disarticulated skeleton, most parts of which had probably eroded away at the time of discovery. The specimen consisted of both forelimbs, excluding the claws of the right hand, the complete shoulder girdle, centra of three dorsal vertebrae, five ribs, gastralia (belly ribs), and two ceratobranchialia. The specimen was made the holotype of Deinocheirus mirificus, named by Halszka Osmólska and Ewa Roniewicz in 1970. The generic name is derived from Greek deinos (δεινός), meaning \"horrible\", and cheir (χείρ), meaning \"hand\", due to the size and strong claws of the forelimbs. The specific name comes from Latin and means \"unusual\" or \"peculiar\", chosen for the unusual structure of the forelimbs.[6] The Polish-Mongolian expeditions were notable for being led by women, among the first to name new dinosaurs.[11] The original specimen number of the holotype was ZPal MgD-I/6, but it has since been re-catalogued as MPC-D 100/18.[1]",
				"after": "The paucity of known Deinocheirus remains inhibited a thorough understanding of the animal for almost half a century onwards, and the scientific literature often described it as among the most \"enigmatic\", \"mysterious\", and \"bizarre\" of dinosaurs.[1][12][13] The holotype arms went on to become part of a traveling exhibit of Mongolian dinosaur fossils, touring various countries.[14] In 2012, Phil R. Bell, Philip J. Currie, and Yuong-Nam Lee announced the discovery of additional elements of the holotype specimen, including fragments of gastralia, found by a Korean-Mongolian team which re-located the original quarry in 2008. Bite marks on two gastralia were identified as belonging to Tarbosaurus, and it was proposed that this accounted for the scattered, disassociated state of the holotype specimen.[13]",
			"color": "black|0.80517 gainsboro|0.013387 tan|0.012367 light|0.012136 gray|0.012136 light|0.012136 grey|0.012136 wheat|0.011725 burly|0.011468 wood|0.011468 pale|0.010832 golden|0.010832 rod|0.010832 antique|0.0084392 white|0.0084392 linen|0.0081417 white|0.0071403 smoke|0.0071403 dark|0.0063003 khaki|0.0063003 lavender|0.0061693  "
		}
	}
}
