{
	"add": {
		"doc": {
			"id": "3bd0b30087d750c0020ce3863d8a61902908789484d6c28e2008603c1854e770",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Drawing_of_William_de_Marisco.jpg/300px-Drawing_of_William_de_Marisco.jpg",
			"previous": [],
				"after": "During the High Middle Ages those in England guilty of treason were punished in a variety of ways, including drawing and hanging. In the 13th century other, more brutal penalties were introduced, such as disembowelling, burning, beheading and quartering. The 13th-century English chronicler Matthew Paris described how in 1238 \"a certain man at arms, a man of some education (armiger literatus)\"[1] attempted to kill King Henry III. His account records in gruesome detail how the would-be assassin was executed: \"dragged asunder, then beheaded, and his body divided into three parts; each part was then dragged through one of the principal cities of England, and was afterwards hung on a gibbet used for robbers.\"[2][nb 1] He was apparently sent by William de Marisco, an outlaw who some years earlier had killed a man under royal protection before fleeing to Lundy Island. De Marisco was captured in 1242 and on Henry's order dragged from Westminster to the Tower of London to be executed. There he was hanged from a gibbet until dead. His corpse was disembowelled, his entrails burned, his body quartered and the parts distributed to cities across the country.[4] The punishment is more frequently recorded during Edward I's reign.[5] Welshman Dafydd ap Gruffydd became the first nobleman in England to be hanged, drawn and quartered after he turned against the king and proclaimed himself Prince of Wales and Lord of Snowdon.[6] Dafydd's rebellion infuriated Edward so much that he demanded a novel punishment. Therefore, following his capture and trial in 1283, for his betrayal he was drawn by horse to his place of execution. For killing English nobles he was hanged alive. For killing those nobles at Easter he was eviscerated and his entrails burned. For conspiring to kill the king in various parts of the realm, his body was quartered and the parts sent across the country; his head was placed on top of the Tower of London.[7] A similar fate was suffered by the Scottish leader Sir William Wallace. Captured and tried in 1305, he was forced to wear a crown of laurel leaves and was drawn to Smithfield, where he was hanged and beheaded. His entrails were then burned and his corpse quartered. His head was set on London Bridge and the quarters sent to Newcastle, Berwick, Stirling and Perth.[8]",
			"color": "light|0.20316 gray|0.20316 light|0.20316 grey|0.20316 gainsboro|0.1776 silver|0.15499 linen|0.056562 dark|0.055465 gray|0.055465 dark|0.055465 grey|0.055465 white|0.043291 smoke|0.043291 gray|0.037555 grey|0.037555 sea|0.037182 shell|0.037182 dim|0.035154 gray|0.035154 dim|0.035154 grey|0.035154 old|0.032685 lace|0.032685 floral|0.03176 white|0.03176 mint|0.024836 cream|0.024836 snow|0.023861 ivory|0.019614 white|0.018612 black|0.012221 antique|0.0079426 white|0.0079426 azure|0.0070829 honeydew|0.0067045 beige|0.0046431 ghost|0.0043818 white|0.0043818  "
		}
	}
}
