{
	"add": {
		"doc": {
			"id": "3bed3de768eadc773a532bc50cff29b63e937c172842b496c12722e5084e8bc9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/RHP_Cote_d%27ivoire_2003.jpg/170px-RHP_Cote_d%27ivoire_2003.jpg",
				"previous": "In the late 1970s an attempt was made to form 14 reserve light infantry divisions, but this plan, which included the recreation of the 109th Infantry Division, was too ambitious. The planned divisions included the 102nd, 104e, 107e, 108e, 109e, 110e, 111e, 112e, 114e, 115th, and 127th Infantry Divisions. From June 1984, the French Army reserve consisted of 22 military divisions, administering all reserve units in a certain area, seven brigades de zone de defence, 22 regiments interarmees divisionnaires, and the 152nd Infantry Division, defending the ICBM launch sites.[11] The plan was put into action from 1985, and brigades de zone, such as the 107th Brigade de Zone, were created. But with the putting-in-place of the \"Réserves 2000\" plan, the brigades de zone were finally disbanded by mid-1993.[12]",
			"after": [
				"1st Army Corps was disbanded on 1 July 1990.",
				"In February 1996 the President of the Republic decided on a transition to a professional service force, and as part of the resulting changes, ten regiments were dissolved in 1997.[13] The specialized support brigades were transferred on 1 July 1997 to Lunéville for the signals, Haguenau (the artillery brigade) and Strasbourg (engineers). The 2nd Armoured Division left Versailles on 1 September 1997 and was installed at Châlons-en-Champagne in place of the disbanding 10th Armoured Division. On 5 March 1998, in view of the ongoing structural adoptions of the French Army, the Minister of Defence decided to disband III Corps, and the dissolution became effective 1 July 1998. The headquarters transitioned to become Headquarters Commandement de la force d'action terrestre (CFAT) (the Land Forces Action Command)."
			],
			"color": "black|0.40045 dark|0.16697 gray|0.16697 dark|0.16697 grey|0.16697 dim|0.14504 gray|0.14504 dim|0.14504 grey|0.14504 gray|0.13786 grey|0.13786 silver|0.060648 dark|0.026816 slate|0.026816 gray|0.026816 light|0.011032 gray|0.011032 light|0.011032 grey|0.011032 slate|0.0085915 gray|0.0085915 light|0.0079356 slate|0.0079356 gray|0.0079356 dark|0.0071844 sea|0.0071844 green|0.0071844 gainsboro|0.0061955  "
		}
	}
}
