{
	"add": {
		"doc": {
			"id": "3bf72851e45d369898e6d4731affc53986708f934602203c0c9dd64e3e2fae5c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/U.S._23_Country_Music_Highway_Museum.jpg/250px-U.S._23_Country_Music_Highway_Museum.jpg",
				"previous": "Renfro Valley, Kentucky is home to Renfro Valley Entertainment Center and the Kentucky Music Hall of Fame and is known as \"Kentucky's Country Music Capital\", a designation given it by the Kentucky State Legislature in the late 1980s. The Renfro Valley Barn Dance was where Renfro Valley's musical heritage began, in 1939, and influential country music luminaries like Red Foley, Homer & Jethro, Lily May Ledford & the Original Coon Creek Girls, Martha Carson, and many others have performed as regular members of the shows there over the years. The Renfro Valley Gatherin' is today America's second oldest continually broadcast radio program of any kind. It is broadcast on local radio station WRVK and a syndicated network of nearly 200 other stations across the United States and Canada every week.",
				"after": "Contemporary Christian music star Steven Curtis Chapman is a Paducah native, and Rock and Roll Hall of Famers The Everly Brothers are closely connected with Muhlenberg County, where older brother Don was born. Merle Travis, Country & Western artist known for both his signature \"Travis picking\" guitar playing style, as well as his hit song \"Sixteen Tons\", was also born in Muhlenberg County. Kentucky was also home to Mildred and Patty Hill, the Louisville sisters credited with composing the tune to the ditty Happy Birthday to You in 1893; Loretta Lynn (Johnson County), Brian Littrell and Kevin Richardson of the Backstreet Boys, and Billy Ray Cyrus (Flatwoods).",
			"color": "dim|0.30523 gray|0.30523 dim|0.30523 grey|0.30523 light|0.10347 gray|0.10347 light|0.10347 grey|0.10347 gainsboro|0.10089 gray|0.076612 grey|0.076612 silver|0.061308 dark|0.045514 gray|0.045514 dark|0.045514 grey|0.045514 dark|0.036244 olive|0.036244 green|0.036244 white|0.029501 smoke|0.029501 slate|0.025893 gray|0.025893 light|0.024992 slate|0.024992 gray|0.024992 dark|0.018801 slate|0.018801 gray|0.018801 alice|0.016772 blue|0.016772 black|0.015145 lavender|0.014629 ghost|0.013661 white|0.013661 snow|0.010696 azure|0.010571 mint|0.0098901 cream|0.0098901 linen|0.0098098 white|0.0091742 sea|0.0087252 shell|0.0087252 lavender|0.007211 blush|0.007211 floral|0.0064845 white|0.0064845  "
		}
	}
}
