{
	"add": {
		"doc": {
			"id": "3bf8c9ea592d273710b5060c16c1c631019ff355ef0643ef0decb52b53ea11c0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Chetwynd_BC_Crime.png/220px-Chetwynd_BC_Crime.png",
				"previous": "According to the 2006 Canadian census, Chetwynd had 2,633 residents living in 1,025 households.[3] With a median age four years lower than the province's, the population of Chetwynd is young. About 6% more people were single (and never married) and 4% less lived in lone-parent households than the province's proportion. According to the 2001 and 2006 census, while Chetwynd had an increase of 35 families, it had a decrease of 85 lone-parent families and an increase of the same number of common-law families. During the same period, the portion of dwellings being owned shifted from 50% to 62%, while the provincial proportion rose from 67% to 70%.[3][24] The last complete census, the 2001 Canadian census, found that less than 5% of Chetwynd residents were foreign-born, and 90% of residents had an English-only mother tongue. While not counted as visible minorities during the census, 670 people considered themselves to have an Aboriginal identity, much higher than the provincial 4% average.[24]",
				"after": "The nine officer Chetwynd Royal Canadian Mounted Police detachment, which covered the municipality and nearby rural communities, reported 981 Criminal Code of Canada offenses in 2005. This translated into a crime rate of 158 Criminal Code offenses per 1,000 people, higher than both the previous year's rate of 142 and the 2005 provincial average of 125. In 2004, compared to the provincial average, Chetwynd had tripled the rates of reported impaired driving and cocaine-related offenses. Conversely, Chetwynd had much lower rates of robbery, bicycle theft, and theft from motor vehicle.[25]",
			"color": "lavender|0.092715 ghost|0.088238 white|0.088238 lavender|0.08785 blush|0.08785 white|0.081731 smoke|0.081731 alice|0.081086 blue|0.081086 snow|0.080096 white|0.07639 sea|0.075895 shell|0.075895 floral|0.068469 white|0.068469 mint|0.063542 cream|0.063542 azure|0.06172 misty|0.061455 rose|0.061455 pink|0.019244 linen|0.01839 ivory|0.0095 light|0.0070349 pink|0.0070349 light|0.0064535 coral|0.0064535 old|0.0064075 lace|0.0064075 medium|0.0052326 slate|0.0052326 blue|0.0052326  "
		}
	}
}
