{
	"add": {
		"doc": {
			"id": "3bfe1f793cb9fcbdc4be28cf593ffccea75f57870eecbf7ac3e7c06fe1b42d8d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Boltunov_mammoth.jpg/220px-Boltunov_mammoth.jpg",
				"previous": "Remains of various extinct elephants were known by Europeans for centuries, but were generally interpreted, based on biblical accounts, as the remains of legendary creatures such as behemoths or giants. It was also theorised that they were remains of modern elephants that had been brought to Europe during the Roman Republic, for example the war elephants of Hannibal and Pyrrhus of Epirus, or animals that had wandered north.[1] The first woolly mammoth remains studied by European scientists were examined by Hans Sloane in 1728 and consisted of fossilised teeth and tusks from Siberia. Sloane was the first to recognise that the remains belonged to elephants.[2] Sloane turned to another biblical explanation for the presence of elephants in the Arctic, asserting that they had been buried during the Great Flood, and that Siberia had previously been tropical prior to a drastic climate change.[3] Others interpreted Sloane's conclusion slightly differently, arguing the flood had carried elephants from the Tropics to the Arctic. Sloane's paper was based on travellers' descriptions and a few scattered bones collected in Siberia and Britain. He discussed the question of whether or not the remains were from elephants, but drew no conclusions.[4] In 1738, Johann Philipp Breyne argued that mammoth fossils represented some kind of elephant. He could not explain why a tropical animal would be found in such a cold area as Siberia, and suggested that they might have been transported there by the Great Flood.[5] In 1796, French anatomist Georges Cuvier was the first to identify the woolly mammoth remains not as modern elephants transported to the Arctic, but as an entirely new species. He argued this species had gone extinct and no longer existed, a concept that was not widely accepted at the time.[1][6]",
				"after": "Following Cuvier's identification, Johann Friedrich Blumenbach gave the woolly mammoth its scientific name, Elephas primigenius, in 1799, placing it in the same genus as the Asian elephant. This name is Latin for \"first elephant\". Cuvier coined the name Elephas mammonteus a few months later, but the former name was subsequently used.[7] In 1828, Joshua Brookes used the name Mammuthus borealis for woolly mammoth fossils in his collection that he put up for sale, thereby coining a new genus name.[8] It is unclear where and how the word \"mammoth\" originated. According to the Oxford English Dictionary, it comes from an old Vogul word mēmoŋt 'earth-horn'.[9] It may be a version of mehemot, the Arabic version of the biblical word \"behemoth\". Another possible origin is Estonian, where maa means earth, and mutt means mole. The word was first used in Europe during the early 17th century, when referring to maimanto tusks discovered in Siberia.[10] Thomas Jefferson, who had a keen interest in palaeontology, is partially responsible for transforming the word mammoth from a noun describing the prehistoric elephant to an adjective describing anything of surprisingly large size. The first recorded use of the word as an adjective was in a description of a wheel of cheese (the \"Cheshire Mammoth Cheese\") given to Jefferson in 1802.[11]",
			"color": "dim|0.52387 gray|0.52387 dim|0.52387 grey|0.52387 gray|0.32808 grey|0.32808 dark|0.058127 gray|0.058127 dark|0.058127 grey|0.058127 black|0.021335 silver|0.018358 slate|0.016503 gray|0.016503 light|0.011186 gray|0.011186 light|0.011186 grey|0.011186 gainsboro|0.0070444 dark|0.0037817 slate|0.0037817 gray|0.0037817  "
		}
	}
}
