{
	"add": {
		"doc": {
			"id": "3c035accacb1d90baf662ea34669b2fc48e7bf5d2e1e6ff3706734c790408897",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Scots_speakers_in_the_2011_census.png/300px-Scots_speakers_in_the_2011_census.png",
				"previous": "The use of Scots in the media is scant and is usually reserved for niches where local dialect is deemed acceptable, e.g. comedy, Burns Night, or representations of traditions and times gone by. Serious use for news, encyclopaedias, documentaries, etc. rarely occurs in Scots, although the Scottish Parliament website offered some information in it.[55]",
				"after": "It has been difficult to determine the number of speakers of Scots via census, because many respondents might interpret the question \"Do you speak Scots?\" in different ways. Campaigners for Scots pressed for this question to be included in the 2001 UK National Census. The results from a 1996 trial before the Census, by the General Register Office for Scotland,[56] suggested that there were around 1.5 million speakers of Scots, with 30% of Scots responding \"Yes\" to the question \"Can you speak the Scots language?\", but only 17% responding \"Aye\" to the question \"Can you speak Scots?\".[citation needed] (It was also found that older, working-class people were more likely to answer in the affirmative.) The University of Aberdeen Scots Leid Quorum performed its own research in 1995, cautiously suggesting that there were 2.7 million speakers, though with clarification as to why these figures required context.[57]",
			"color": "lavender|0.24251 light|0.14737 steel|0.14737 blue|0.14737 steel|0.12181 blue|0.12181 light|0.10604 blue|0.10604 sky|0.072238 blue|0.072238 dark|0.047523 gray|0.047523 dark|0.047523 grey|0.047523 alice|0.035962 blue|0.035962 silver|0.032941 gainsboro|0.020277 light|0.019851 slate|0.019851 gray|0.019851 light|0.018598 gray|0.018598 light|0.018598 grey|0.018598 ghost|0.01753 white|0.01753 white|0.015542 smoke|0.015542 azure|0.013113 snow|0.012155 white|0.011792 lavender|0.011397 blush|0.011397 mint|0.010931 cream|0.010931 slate|0.010654 gray|0.010654 sea|0.0092787 shell|0.0092787 gray|0.0083766 grey|0.0083766 floral|0.0082618 white|0.0082618  "
		}
	}
}
