{
	"add": {
		"doc": {
			"id": "3c22bca3e775b4136f8d82cd68b2f48c53cf9ef9abc134d333e05bc7aef5830b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Contemporary_wife_selling_print_georgian_scrapbook_1949.jpg/220px-Contemporary_wife_selling_print_georgian_scrapbook_1949.jpg",
				"previous": "Lord Chief Justice William Murray, 1st Earl of Mansfield, considered wife sales to be a conspiracy to commit adultery, but few of those reported in the newspapers led to prosecutions in court.[4] The Times reported one such case in 1818, in which a man was indicted for selling his wife at Leominster market, for 2s. 6d.[56] In 1825 a man named Johnson was charged with \"having sung a song in the streets describing the merits of his wife, for the purpose of selling her to the highest bidder at Smithfield.\" Such songs were not unique; in about 1842 John Ashton wrote \"Sale of a Wife\".[nb 6][58] The arresting officer claimed that the man had gathered a \"crowd of all sorts of vagabonds together, who appeared to listen to his ditty, but were in fact, collected to pick pockets.\" The defendant, however, replied that he had \"not the most distant idea of selling his wife, who was, poor creature, at home with her hungry children, while he was endeavouring to earn a bit of bread for them by the strength of his lungs.\" He had also printed copies of the song, and the story of a wife sale, to earn money. Before releasing him, the Lord Mayor, judging the case, cautioned Johnson that the practice could not be allowed, and must not be repeated.[59] In 1833 the sale of a woman was reported at Epping. She was sold for 2s. 6d., with a duty of 6d. Once sober, and placed before the Justices of the Peace, the husband claimed that he had been forced into marriage by the parish authorities, and had \"never since lived with her, and that she had lived in open adultery with the man Bradley, by whom she had been purchased\". He was imprisoned for \"having deserted his wife\".[60]",
				"after": "The return of a wife after 18 years results in Michael Henchard's downfall in Thomas Hardy's novel Mayor of Casterbridge. A bad-tempered, impulsive and cruel husband, feeling burdened by his wife, Henchard sells her to a stranger for five guineas. He becomes a successful businessman and rises to the position of mayor, but the return of his wife many years later prompts his fall back into penury.[61] The custom was also referred to in the 19th-century French play, Le Marché de Londres.[62] Commenting on the drama and contemporary French attitudes on the custom, in 1846 the writer Angus B. Reach complained: \"They reckon up a long and visionary list of our failings [... They] would as readily give up their belief in the geographical and physical existence of London, as in the astounding fact that in England a husband sells his wife exactly as he sells his horse or his dog.\"[63] Such complaints were still commonplace nearly 20 years later; in The Book of Days (1864), author Robert Chambers wrote about a case of wife selling in 1832, and noted that \"the occasional instances of wife-sale, while remarked by ourselves with little beyond a passing smile, have made a deep impression on our continental neighbours, [who] constantly cite it as an evidence of our low civilisation.\"[64] Embarrassed by the practice, a legal handbook of 1853 enabled English judges to dismiss wife selling as a myth: \"It is a vulgar error that a husband can get rid of his wife by selling her in the open market with a halter round her neck. Such an act on his part would be severely punished by the local magistrate.\"[65] Originally published in 1869, Burn's Justice of the Peace and Parish Officer states that \"publicly selling or buying a wife is clearly an indictable offence ... And many prosecutions against husbands for selling, and others for buying, have recently been sustained, and imprisonment for six months inflicted\".[66]",
			"color": " "
		}
	}
}
