{
	"add": {
		"doc": {
			"id": "3c24357158ecbb4165f74a8e5c59b235ef3ae72a9f3e0ebc988d443f1008329e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/PriestleyGrammar.png/170px-PriestleyGrammar.png",
				"previous": "Priestley later wrote that the book that influenced him the most, save the Bible, was David Hartley's Observations on Man (1749). Hartley's psychological, philosophical, and theological treatise postulated a material theory of mind. Hartley aimed to construct a Christian philosophy in which both religious and moral \"facts\" could be scientifically proven, a goal that would occupy Priestley for his entire life. In his third year at Daventry, Priestley committed himself to the ministry, which he described as \"the noblest of all professions\".[14]",
				"after": "Robert Schofield, Priestley's major modern biographer, describes his first \"call\" in 1755 to the Dissenting parish in Needham Market, Suffolk, as a \"mistake\" for both Priestley and the congregation.[15] Priestley yearned for urban life and theological debate, whereas Needham Market was a small, rural town with a congregation wedded to tradition. Attendance and donations dropped sharply when they discovered the extent of his heterodoxy. Although Priestley's aunt had promised her support if he became a minister, she refused any further assistance when she realised he was no longer a Calvinist. To earn extra money, Priestley proposed opening a school, but local families informed him that they would refuse to send their children. He also presented a series of scientific lectures titled \"Use of the Globes\" that was more successful.[16]",
			"color": "dim|0.27586 gray|0.27586 dim|0.27586 grey|0.27586 gray|0.25369 grey|0.25369 dark|0.25369 gray|0.25369 dark|0.25369 grey|0.25369 silver|0.081163 black|0.027445 light|0.019351 gray|0.019351 light|0.019351 grey|0.019351 white|0.0094758 smoke|0.0094758 gainsboro|0.0090066 alice|0.0080683 blue|0.0080683 ghost|0.0080683 white|0.0080683 lavender|0.0079979 blush|0.0079979 sea|0.0079678 shell|0.0079678 snow|0.0079678 white|0.0078114 mint|0.0076003 cream|0.0076003 floral|0.0066854 white|0.0066854 azure|0.0061224  "
		}
	}
}
