{
	"add": {
		"doc": {
			"id": "3c3586f890b2ab7377745171bea7a84ee4a939752159771fe1968ebcb52d54b2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Bayeux_Tapestry_scene57_Harold_death.jpg/220px-Bayeux_Tapestry_scene57_Harold_death.jpg",
				"previous": "Knighthood as known in Europe was characterized by the combination of two elements, feudalism and service as a mounted warrior. Both arose under the reign of the Frankish emperor Charlemagne, from which the knighthood of the Middle Ages can be seen to have had its genesis.",
				"after": "Some portions of the armies of Germanic peoples who occupied Europe from the 3rd century AD, had always been mounted, and some armies, such as those of the Ostrogoths, comprised mainly cavalry. However it was the Franks who came to dominate Western and Central Europe after the fall of Rome, and they generally fielded armies composed of large masses of infantry, with an infantry elite, the comitatus, which often rode to battle on horseback rather than marching on foot. Riding to battle had two key advantages: it reduced fatigue, particularly when the elite soldiers wore armour (as was increasingly the case in the centuries after the fall of the Western Roman empire); and it gave the soldiers more mobility to react to the raids of the enemy, particularly the Muslim invasions which reached Europe in 711. So it was that the armies of the Frankish ruler and warlord Charles Martel, which defeated the Umayyad Arab invasion at the Battle of Tours in 732, were still largely infantry armies, the elites riding to battle but dismounting to fight, providing a hard core for the levy of the infantry warbands.",
			"color": "light|0.10286 gray|0.10286 light|0.10286 grey|0.10286 gainsboro|0.096565 antique|0.079381 white|0.079381 linen|0.075578 silver|0.059645 misty|0.057691 rose|0.057691 dark|0.0571 gray|0.0571 dark|0.0571 grey|0.0571 sea|0.049503 shell|0.049503 old|0.048572 lace|0.048572 gray|0.037141 grey|0.037141 floral|0.036027 white|0.036027 white|0.03514 smoke|0.03514 dim|0.031365 gray|0.031365 dim|0.031365 grey|0.031365 tan|0.026441 snow|0.021827 lavender|0.020214 blush|0.020214 papaya|0.01612 whip|0.01612 ivory|0.016107 beige|0.014473 rosy|0.011669 brown|0.011669 mint|0.010165 cream|0.010165 white|0.010091 blanched|0.0092703 almond|0.0092703 dark|0.0079448 slate|0.0079448 gray|0.0079448 bisque|0.0063098 corn|0.0062738 silk|0.0062738 honeydew|0.0060082 ghost|0.005817 white|0.005817 burly|0.0052209 wood|0.0052209 black|0.0051783 peach|0.0043922 puff|0.0043922  "
		}
	}
}
