{
	"add": {
		"doc": {
			"id": "3c3d7872ac54044086b7fe04df64bb3ab485584f1062da990de044c5cab1154e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Sidensvans_Bombycilla_garrulus_03.jpg/220px-Sidensvans_Bombycilla_garrulus_03.jpg",
			"previous": [],
				"after": "The Bohemian waxwing is a starling-sized bird 19–23 cm (7.5–9 in) in length with a 32–35.5 cm (12.6–14 in) wingspan, and an average weight of 55 g (1.9 oz).[14] It is short-tailed, mainly brownish-grey, and has a conspicuous crest on its head. The male of the nominate subspecies has a black mask through the eye and a black throat. There is a white streak behind the bill and a white curve below the eye. The lower belly is a rich chestnut colour and there are cinnamon-coloured areas around the mask. The rump is grey and the tail ends in a bright yellow band with a broad black border above it. The wings are very distinctive; the flight feathers are black and the primaries have markings that produce a yellow stripe and white \"fishhooks\" on the closed wing. The adult's secondaries end in long red appendages with the sealing wax appearance that gives the bird its English name. The eyes are dark brown, the bill is mainly black, and the legs are dark grey or black.[14] In flight, the waxwing's large flocks, long wings and short tail give some resemblance to the common starling, and its flight is similarly fast and direct.[2] It clambers easily through bushes and trees but only shuffles on the ground.[19]",
			"color": "dim|0.30198 gray|0.30198 dim|0.30198 grey|0.30198 gray|0.24979 grey|0.24979 dark|0.10316 gray|0.10316 dark|0.10316 grey|0.10316 light|0.065457 gray|0.065457 light|0.065457 grey|0.065457 gainsboro|0.060144 silver|0.056175 black|0.024501 white|0.02327 smoke|0.02327 alice|0.020507 blue|0.020507 lavender|0.018125 ghost|0.017773 white|0.017773 lavender|0.013562 blush|0.013562 snow|0.011508 azure|0.0081528 white|0.0075564 dark|0.0044752 khaki|0.0044752 mint|0.0042571 cream|0.0042571  "
		}
	}
}
