{
	"add": {
		"doc": {
			"id": "3c4624332cbbce4842f4387e0532cac732ca4ed35b419c316685ad4ef8d40b5e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/BMW_003_Riedelanlasser.jpg/220px-BMW_003_Riedelanlasser.jpg",
				"previous": "Some models of the B-24 Liberator had a putt–putt fitted at the front of the aircraft, inside the nose-wheel compartment.[8] Some models of the Douglas C-47 Skytrain transport aircraft carried a putt-putt under the cockpit floor.[9]",
				"after": "The first German jet engines built during the Second World War used a mechanical APU starting system designed by the German engineer Norbert Riedel. It consisted of a 10 hp (7.5 kW) two-stroke flat engine, hidden in the intake, essentially functioning as a pioneering example of an auxiliary power unit for starting a jet engine. A hole in the extreme nose of the centrebody contained a manual pull-handle which started the piston engine, which in turn rotated the compressor. Two small petrol tanks were fitted in the annular intake. The engine was considered an extreme short stroke (bore / stroke: 70 mm / 35 mm = 2:1) design so it could fit in the hub of the turbine compressor. For reduction it had an integrated planetary gear. It was produced in Victoria in Nuremberg and served as a starter for the jet engines Junkers Jumo 004 and BMW 003.[10]",
			"color": "dark|0.19022 gray|0.19022 dark|0.19022 grey|0.19022 gray|0.14684 grey|0.14684 dim|0.08415 gray|0.08415 dim|0.08415 grey|0.08415 silver|0.075697 light|0.050567 gray|0.050567 light|0.050567 grey|0.050567 linen|0.042067 gainsboro|0.041431 sea|0.03832 shell|0.03832 floral|0.036826 white|0.036826 old|0.036626 lace|0.036626 white|0.035656 smoke|0.035656 mint|0.032754 cream|0.032754 ivory|0.031786 antique|0.02703 white|0.02703 honeydew|0.027009 beige|0.020702 snow|0.018459 slate|0.010007 gray|0.010007 rosy|0.0083508 brown|0.0083508 light|0.0070464 slate|0.0070464 gray|0.0070464 white|0.0062921 corn|0.0060589 silk|0.0060589  "
		}
	}
}
