{
	"add": {
		"doc": {
			"id": "3c7a27d9ca96b6ba8dbd039e36b003c463e59e1e55958fc4bcd7006fade9282d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Courier_simple_sample.png/220px-Courier_simple_sample.png",
				"previous": "Gaelic fonts were first used for the Irish language in 1571, and were used regularly for Irish until the early 1960s, though they continue to be used in display type and type for signage. Their use was effectively confined to Ireland, though Gaelic typefaces were designed and produced in France, Belgium, and Italy. Gaelic typefaces make use of insular letterforms, and early fonts made use of a variety of abbreviations deriving from the manuscript tradition. Early fonts used for the Anglo-Saxon language, also using insular letterforms, can be classified as Gaelic typefaces, distinct from Roman or Antiqua typefaces.[20][21] Various forms exist, including manuscript, traditional, and modern styles, chiefly distinguished as having angular or uncial features.[22]",
				"after": "Monospaced fonts are typefaces in which every glyph is the same width (as opposed to variable-width fonts, where the w and m are wider than most letters, and the i is narrower). The first monospaced typefaces were designed for typewriters, which could only move the same distance forward with each letter typed. Their use continued with early computers, which could only display a single font. Although modern computers can display any desired typeface, monospaced fonts are still important for computer programming, terminal emulation, and for laying out tabulated data in plain text documents. Examples of monospaced typefaces are Courier, Prestige Elite, Fixedsys, and Monaco. Most monospaced fonts are sans-serif or slab-serif as these designs are easiest to read printed small, though many exceptions exist.",
			"color": "black|0.34599 dark|0.069846 gray|0.069846 dark|0.069846 grey|0.069846 dim|0.069419 gray|0.069419 dim|0.069419 grey|0.069419 gray|0.060423 grey|0.060423 silver|0.048272 light|0.041245 gray|0.041245 light|0.041245 grey|0.041245 white|0.038285 smoke|0.038285 gainsboro|0.034628 alice|0.033819 blue|0.033819 ghost|0.033644 white|0.033644 sea|0.033157 shell|0.033157 snow|0.033104 white|0.031014 lavender|0.030047 blush|0.030047 mint|0.02897 cream|0.02897 floral|0.027693 white|0.027693 azure|0.025973 linen|0.0093369 ivory|0.0033531  "
		}
	}
}
