{
	"add": {
		"doc": {
			"id": "3caaf603a4d9583d55926ed8a70fe5c0c7352da4ed2f08d514539dfe616dfa53",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Doppelsonne_Halo_Echzell_Hessen_12-08-2012.jpg/220px-Doppelsonne_Halo_Echzell_Hessen_12-08-2012.jpg",
				"previous": "Viewing the Sun through light-concentrating optics such as binoculars may result in permanent damage to the retina without an appropriate filter that blocks UV and substantially dims the sunlight. When using an attenuating filter to view the Sun, the viewer is cautioned to use a filter specifically designed for that use. Some improvised filters that pass UV or IR rays, can actually harm the eye at high brightness levels.[182] Herschel wedges, also called Solar Diagonals, are effective and inexpensive for small telescopes. The sunlight that is destined for the eyepiece is reflected from an unsilvered surface of a piece of glass. Only a very small fraction of the incident light is reflected. The rest passes through the glass and leaves the instrument. If the glass breaks because of the heat, no light at all is reflected, making the device fail-safe. Simple filters made of darkened glass allow the full intensity of sunlight to pass through if they break, endangering the observer's eyesight. Unfiltered binoculars can deliver hundreds of times as much energy as using the naked eye, possibly causing immediate damage. It is claimed that even brief glances at the midday Sun through an unfiltered telescope can cause permanent damage.[183]",
				"after": "Partial solar eclipses are hazardous to view because the eye's pupil is not adapted to the unusually high visual contrast: the pupil dilates according to the total amount of light in the field of view, not by the brightest object in the field. During partial eclipses most sunlight is blocked by the Moon passing in front of the Sun, but the uncovered parts of the photosphere have the same surface brightness as during a normal day. In the overall gloom, the pupil expands from ~2 mm to ~6 mm, and each retinal cell exposed to the solar image receives up to ten times more light than it would looking at the non-eclipsed Sun. This can damage or kill those cells, resulting in small permanent blind spots for the viewer.[184] The hazard is insidious for inexperienced observers and for children, because there is no perception of pain: it is not immediately obvious that one's vision is being destroyed.",
			"color": "black|0.80347 dim|0.1035 gray|0.1035 dim|0.1035 grey|0.1035 dark|0.014782 slate|0.014782 gray|0.014782 gray|0.012007 grey|0.012007  "
		}
	}
}
