{
	"add": {
		"doc": {
			"id": "3cba23d0282ede48a899c2eb36e83561670ec2fcb880cc9de26ca643509b4a8d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/SMAW_weld_area.svg/300px-SMAW_weld_area.svg.png",
			"previous": [],
				"after": "To strike the electric arc, the electrode is brought into contact with the workpiece by a very light touch with the electrode to the base metal then is pulled back slightly. This initiates the arc and thus the melting of the workpiece and the consumable electrode, and causes droplets of the electrode to be passed from the electrode to the weld pool. As the electrode melts, the flux covering disintegrates, giving off shielding gases that protect the weld area from oxygen and other atmospheric gases. In addition, the flux provides molten slag which covers the filler metal as it travels from the electrode to the weld pool. Once part of the weld pool, the slag floats to the surface and protects the weld from contamination as it solidifies. Once hardened, it must be chipped away to reveal the finished weld. As welding progresses and the electrode melts, the welder must periodically stop welding to remove the remaining electrode stub and insert a new electrode into the electrode holder. This activity, combined with chipping away the slag, reduces the amount of time that the welder can spend laying the weld, making SMAW one of the least efficient welding processes. In general, the operator factor, or the percentage of operator's time spent laying weld, is approximately 25%.[11]",
			"color": "black|0.11832 white|0.067271 smoke|0.067271 snow|0.065135 ghost|0.064961 white|0.064961 white|0.064595 alice|0.064167 blue|0.064167 sea|0.063234 shell|0.063234 mint|0.062744 cream|0.062744 floral|0.061058 white|0.061058 azure|0.060705 lavender|0.055276 blush|0.055276 dim|0.052042 gray|0.052042 dim|0.052042 grey|0.052042 gray|0.048534 grey|0.048534 dark|0.045749 gray|0.045749 dark|0.045749 grey|0.045749 silver|0.026458 light|0.021164 gray|0.021164 light|0.021164 grey|0.021164 gainsboro|0.017865 ivory|0.0096228 lavender|0.0087168 medium|0.0079192 slate|0.0079192 blue|0.0079192 blue|0.0059976 linen|0.0049055  "
		}
	}
}
