{
	"add": {
		"doc": {
			"id": "3cc83df44fc2b84777ac8a9061f40246243f22bbb5579a7d82a167cf9342ea8e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Blue_plaque_-_Joseph_Priestley_-_New_Meeting_Street_Birmingham_-_Andy_Mabbett.png/220px-Blue_plaque_-_Joseph_Priestley_-_New_Meeting_Street_Birmingham_-_Andy_Mabbett.png",
				"previous": "Considering the extent of Priestley's influence, relatively little scholarship has been devoted to him. In the early 20th century, Priestley was most often described as a conservative and dogmatic scientist who was nevertheless a political and religious reformer.[186] In a historiographic review essay, historian of science Simon Schaffer describes the two dominant portraits of Priestley: the first depicts him as \"a playful innocent\" who stumbled across his discoveries; the second portrays him as innocent as well as \"warped\" for not understanding their implications better. Assessing Priestley's works as a totality has been difficult for scholars because of his wide-ranging interests. His scientific discoveries have usually been divorced from his theological and metaphysical publications to make an analysis of his life and writings easier, but this approach has been challenged recently by scholars such as John McEvoy and Robert Schofield. Although early Priestley scholarship claimed that his theological and metaphysical works were \"distractions\" and \"obstacles\" to his scientific work, scholarship published in the 1960s, 1970s, and 1980s maintained that Priestley's works constituted a unified theory. However, as Schaffer explains, no convincing synthesis of his work has yet been expounded.[187] More recently, in 2001, historian of science Dan Eshet has argued that efforts to create a \"synoptic view\" have resulted only in a rationalisation of the contradictions in Priestley's thought, because they have been \"organized around philosophical categories\" and have \"separate[d] the producers of scientific ideas from any social conflict\".[188]",
			"after": [],
			"color": "slate|0.40492 gray|0.40492 light|0.31007 slate|0.31007 gray|0.31007 gray|0.11569 grey|0.11569 dark|0.10538 gray|0.10538 dark|0.10538 grey|0.10538 dim|0.052768 gray|0.052768 dim|0.052768 grey|0.052768  "
		}
	}
}
