{
	"add": {
		"doc": {
			"id": "3ccbfcc2a19eb6934b35ff896ae619283a2618b0913ca23a44037a5c23745da8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/MusicFresno.jpg/220px-MusicFresno.jpg",
			"previous": [],
				"after": "After the critical and commercial success of her album Ray of Light (1998), Madonna intended to embark on a new concert tour in September 1999, but due to the delay of her film The Next Best Thing, the tour was canceled.[1] By the year 2000, Madonna was dating director Guy Ritchie, and was pregnant with their child. Wanting to distract herself from the media frenzy surrounding this news, Madonna concentrated on the development of her eighth studio album, Music, instead of embarking on a tour.[2] Buoyed up by the commercial success of 1998's Ray of Light album, she was keen on getting back to the studio and start recording. Madonna was well disposed towards William Orbit, producer of Ray of Light, but by 2000, his production and sound had become ubiquitous. Also, the music scene was being dominated by younger generation of singers like Britney Spears and Christina Aguilera, prompting Madonna to look for a distinctive sound in this market.[2] It was then that she was introduced to French DJ and producer Mirwais Ahmadzaï, through some common friends. Madonna instantly liked his pitch-shifting, pulverizing rhythms and his utilization of acid bass in his songs.[3]",
			"color": "dark|0.1439 gray|0.1439 dark|0.1439 grey|0.1439 silver|0.12811 light|0.12238 gray|0.12238 light|0.12238 grey|0.12238 gainsboro|0.10583 gray|0.080731 grey|0.080731 dim|0.049879 gray|0.049879 dim|0.049879 grey|0.049879 white|0.041793 smoke|0.041793 sea|0.028798 shell|0.028798 linen|0.028738 slate|0.027771 gray|0.027771 snow|0.027264 ghost|0.026075 white|0.026075 alice|0.022134 blue|0.022134 floral|0.021421 white|0.021421 white|0.021187 lavender|0.0201 blush|0.0201 mint|0.019608 cream|0.019608 light|0.018253 slate|0.018253 gray|0.018253 azure|0.014043 black|0.010158 old|0.0089135 lace|0.0089135 misty|0.0053982 rose|0.0053982 ivory|0.0053428 lavender|0.0046611 honeydew|0.0028106  "
		}
	}
}
