{
	"add": {
		"doc": {
			"id": "3cd7da176bf1688107785a380344e0ed0f691802eb699ce04fc25afeb6b51d8c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Miley_Cyrus_at_Kids%27_Inaugural_2_cropped_filtered.jpg/170px-Miley_Cyrus_at_Kids%27_Inaugural_2_cropped_filtered.jpg",
			"previous": [],
				"after": "In his review of the Best of Both Worlds tour, J. Freedom du Lac of The Washington Post described the concert as \"a nearly 90-minute blast of pop in which the charismatic Cyrus – who complained that she wasn't feeling well – commanded the stage with confidence, performing with a particular swagger.\"[214] When performing a cover of \"I Love Rock & Roll\" on the tour, Cyrus performed the song suspended in the air atop of a Harley-Davidson Dyna Fat Bob FXDF 2010 that traveled through the air.[215] Beginning with the release of The Time of Our Lives, Cyrus's performances became somewhat more explicit and controversial in nature. Cyrus's performance of \"Party in the U.S.A.\" at the 2009 Teen Choice Awards incited a media uproar, with some viewers criticizing Cyrus's provocative outfit and inclusion of a brief pole dance as inappropriate for her age, then sixteen, and for her young fans.[216] Conversely, Newsday reported that her sexualization \"has been coming for some time.\"[217] Ian Drew, senior editor of US Weekly, said, \"She already has this risque image, so it really wasn't much of a stretch. That's how Britney [Spears] took off. She was the good girl gone bad, and it looks to be working for Miley as well.\"[217] Her performance of Can't Be Tamed on Britain's Got Talent garnered much controversy. Midway through the performance, Cyrus grabbed a female backup dancer, dipping her low, and simulated a kiss.[218] The performance was met with negative reactions from the media and caused her to release a statement in which Cyrus promised she did not kiss the backup dancer. Cyrus wrote, \"It is ridiculous that two entertainers can't even rock out with each other without the media making it some type of story. I really hope my fans are not disappointed in me because the truth is I did nothing wrong. I got up there and did my job which is to perform to the best of my ability.\"[219]",
			"color": "black|0.37174 dark|0.16731 gray|0.16731 dark|0.16731 grey|0.16731 gray|0.11353 grey|0.11353 silver|0.081995 dim|0.077252 gray|0.077252 dim|0.077252 grey|0.077252 light|0.028393 gray|0.028393 light|0.028393 grey|0.028393 gainsboro|0.015513 dark|0.012896 slate|0.012896 gray|0.012896 sienna|0.010425 peru|0.0083784 dark|0.0073359 khaki|0.0073359 white|0.0068683 smoke|0.0068683 lavender|0.0065879 blush|0.0065879 dark|0.0060618 salmon|0.0060618 sea|0.0059391 shell|0.0059391 snow|0.0057781 saddle|0.0055598 brown|0.0055598  "
		}
	}
}
