{
	"add": {
		"doc": {
			"id": "3cdb859dae320978183f726a7087b77c369fd5b5ea2084ee8eb0766c8b101eed",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/7/7d/Pine_Creek_Log_Raft.jpg/220px-Pine_Creek_Log_Raft.jpg",
				"previous": "Prior to the arrival of William Penn and his Quaker colonists in 1682, up to 90 percent of what is now Pennsylvania was covered with woods: more than 31,000 square miles (80,000 km2) of eastern white pine, eastern hemlock, and a mix of hardwoods.[13] The forests near the three original counties, Philadelphia, Bucks, and Chester, were the first to be harvested, as the early settlers used the readily available timber to build homes, barns, and ships, and cleared the land for agriculture. The demand for wood products slowly increased and by the time of the American Revolution the lumber industry had reached the interior and mountainous regions of Pennsylvania.[13][14] Lumber thus became one of the leading industries in Pennsylvania.[13] Trees were used to furnish fuel to heat homes, tannin for the many tanneries that were spread throughout the state, and wood for construction, furniture, and barrel making. Large areas of forest were harvested by colliers to fire iron furnaces. Rifle stocks and shingles were made from Pennsylvania timber, as were a wide variety of household utensils, and the first Conestoga wagons.[13]",
				"after": "By the early 19th century the demand for lumber reached the Pine Creek Gorge, where the surrounding mountainsides were covered with eastern white pine 3 to 6 feet (0.9 to 1.8 m) in diameter and 150 feet (46 m) or more tall, eastern hemlock 9 feet (2.7 m) in circumference, and huge hardwoods.[7] Each acre (0.4 ha) of these virgin forests produced 100,000 board feet (236 m3) of white pine and 200,000 board feet (472 m3) of hemlock and hardwoods. For comparison, the same area of forest today produces a total of only 5,000 board feet (11.8 m3) on average. According to Steven E. Owlett, environmental lawyer and author, shipbuilders considered pine from Pine Creek the \"best timber in the world for making fine ship masts\",[15] so it was the first lumber to be harvested on a large scale. Pine Creek was declared a public highway by the Pennsylvania General Assembly on March 16, 1798,[7] and rafts of spars were floated down the creek to the Susquehanna River, then to the Chesapeake Bay and the shipbuilders at Baltimore.[15] The lumbermen would then walk home, following the old Pine Creek Path at the end of their journey.[11] A spar sold for one dollar and three spars up to 90 feet (27 m) long were lashed together to make a ship's mast. The largest spar produced on Pine Creek was 43 inches (110 cm) in diameter 12 feet (3.7 m) above the base, 93 feet (28 m) long, and 33 inches (84 cm) in diameter at the top. By 1840, Tioga County alone produced over 452 such spar rafts with more than 22,000,000 board feet (52,000 m3) of lumber.[15]",
			"color": "silver|0.21888 light|0.18534 gray|0.18534 light|0.18534 grey|0.18534 dark|0.18045 gray|0.18045 dark|0.18045 grey|0.18045 gainsboro|0.15422 gray|0.10746 grey|0.10746 dim|0.091209 gray|0.091209 dim|0.091209 grey|0.091209 black|0.025481 white|0.012786 smoke|0.012786 lavender|0.0047642 blush|0.0047642 linen|0.0043311 lavender|0.0032935  "
		}
	}
}
