{
	"add": {
		"doc": {
			"id": "3ce05cf8f460ee2328c9a338b9f02c678cb6c8f03975cd62489e08cf47908c9c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Kenya_Airways_A310-300_5Y-BFT_FCO_March_1999.png/220px-Kenya_Airways_A310-300_5Y-BFT_FCO_March_1999.png",
				"previous": "At July 1980 (1980-07), the airline had 2,100 employees and a fleet of three Boeing 707-320Bs, one Boeing 720B, one DC-9-30 and three Fokker F-27-200s. At this time, Addis Ababa, Athens, Bombay, Cairo, Copenhagen, Frankfurt, Jeddah, Kampala, Karachi, Khartoum, London, Lusaka, Mauritius, Mogadishu, Rome, Salisbury, Seychelles and Zurich were part of the airline's list of international destinations, whereas domestic services radiating from Nairobi to Kisumu, Malindi, Mombasa and Mumias were also operated.[13] A Nairobi–Bombay nonstop route was launched in 1982 using Boeing 707-320B equipment.[21] A year later, the company commenced serving Tanzania. Flights to Burundi, Malawi and Rwanda were launched in 1984. Capacity on the European routes was boosted in November 1985 (1985-11) with the incorporation of an Airbus A310-200 leased from Condor. Kilimanjaro was first served in March 1986 (1986-03).[22] That year, the airline ordered two Airbus A310-300s. Kenya Airways became the first African carrier in acquiring the type, and they were the first wide-bodies ordered by the company.[23] Funded with a US$20,000,000 ($43,029,751 in 2015) loan,[24] the delivery of these two aircraft took place in May and September 1986 (1986-09).[22][25] They were put on service on the Kenya–Europe corridor, and permitted Kenya Airways to return the A310-200 to the lessor.[22] In early 1988, the carrier ordered two Fokker 50s;[26] aimed at operating domestic routes, the airline received the first of these aircraft at the end of the year.[27] Also in 1988, the lease of a third A310-300 was arranged with the International Lease Finance for a ten-year period;[28] the aircraft joined the fleet in November 1989 (1989-11).[29] Leased from Ansett Worldwide, the first Boeing 757-200 was handed over to the company in January 1990 (1990-01), whereas a third Fokker 50 was incorporated in October the same year. By late 1991, two Boeing 737-200s had been leased from Guiness Peat Aviation.[29]",
				"after": "In 1986, Sessional Paper Number 1 was published by the Government of Kenya, outlining the country's need for economic development and growth. The document stressed the government opinion that the airline would be better off if owned by private interests, thus resulting in the first attempt to privatise the airline. The government named Philip Ndegwa as Chairman of the Board in 1991, with specific orders to make the airline a privately owned company. In 1992, the Public Enterprise Reform paper was published, giving Kenya Airways priority among national companies in Kenya to be privatised.[10] Ndegwa was succeeded by Isaac Omolo Okero. In September 1992 (1992-09), Brian Davies, was appointed as the new managing director of the company.[29] Davies had been previously hired to carry out a study of viability on privatisation,[29] working for British Airways' Speedwing consulting arm.[30] Swissair was the first company that provided Kenya Airways with privatisation advice.[29] In the fiscal year 1993 to 1994, the airline produced its first profit since the start of commercialisation.[31] In 1994, the International Finance Corporation was appointed to provide assistance in the privatisation process, which effectively began in 1995.[32] A large aviation industry partner was sought to acquire 40% of the shares, with another 40% reserved for private investors and the government keeping the remaining stake. The government would absorb almost US$90 million in debts and would convert another US$31 million it provided in loans into equity; after reorganisation, the company would have a debt of approximate US$78 million.[29] British Airways, KLM, Lufthansa and South African Airways were among the airlines that expressed interest in taking a stake in Kenya Airways.[31][32][33]",
			"color": "dim|0.16296 gray|0.16296 dim|0.16296 grey|0.16296 slate|0.088518 gray|0.088518 dark|0.083764 gray|0.083764 dark|0.083764 grey|0.083764 silver|0.074572 light|0.073383 gray|0.073383 light|0.073383 grey|0.073383 gainsboro|0.065895 gray|0.052197 grey|0.052197 light|0.04982 slate|0.04982 gray|0.04982 linen|0.041806 misty|0.040287 rose|0.040287 antique|0.032725 white|0.032725 sea|0.031472 shell|0.031472 old|0.028662 lace|0.028662 floral|0.022656 white|0.022656 white|0.021609 smoke|0.021609 rosy|0.020999 brown|0.020999 dark|0.019476 slate|0.019476 gray|0.019476 lavender|0.017933 blush|0.017933 brown|0.015176 snow|0.013951 indian|0.0090456 red|0.0090456  "
		}
	}
}
