{
	"add": {
		"doc": {
			"id": "3cf28479fb292635a883e62f5bb0adc6797fa00713536a4f196ccf349d127061",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Tower_of_London_EN.png/300px-Tower_of_London_EN.png",
			"previous": [],
				"after": "The Tower was oriented with its strongest and most impressive defences overlooking Saxon London, which archaeologist Alan Vince suggests was deliberate.[4] It would have visually dominated the surrounding area and stood out to traffic on the River Thames.[5] The castle is made up of three \"wards\", or enclosures. The innermost ward contains the White Tower and is the earliest phase of the castle. Encircling it to the north, east, and west is the inner ward, built during the reign of Richard the Lionheart (1189–1199). Finally, there is the outer ward which encompasses the castle and was built under Edward I. Although there were several phases of expansion after William the Conqueror founded the Tower of London, the general layout has remained the same since Edward I completed his rebuild in 1285. The castle encloses an area of almost 12 acres (4.9 ha) with a further 6 acres (2.4 ha) around the Tower of London constituting the Tower Liberties – land under the direct influence of the castle and cleared for military reasons.[6] The precursor of the Liberties was laid out in the 13th century when Henry III ordered that a strip of land adjacent to the castle be kept clear.[7] Despite popular fiction, the Tower of London never had a permanent torture chamber, although the basement of the White Tower housed a rack in later periods.[8] Tower Wharf was built on the bank of the Thames under Edward I and was expanded to its current size during the reign of Richard II (1377–1399).[9]",
			"color": "light|0.097642 steel|0.097642 blue|0.097642 light|0.091008 blue|0.091008 burly|0.086604 wood|0.086604 gainsboro|0.079306 light|0.075285 gray|0.075285 light|0.075285 grey|0.075285 tan|0.063729 white|0.057633 smoke|0.057633 alice|0.05732 blue|0.05732 ghost|0.052799 white|0.052799 lavender|0.048356 blush|0.048356 snow|0.047673 sea|0.045519 shell|0.045519 linen|0.040421 silver|0.035017 white|0.030161 lavender|0.024056 dark|0.017316 gray|0.017316 dark|0.017316 grey|0.017316 mint|0.013236 cream|0.013236 azure|0.011727 floral|0.0072093 white|0.0072093 peach|0.0063546 puff|0.0063546  "
		}
	}
}
