{
	"add": {
		"doc": {
			"id": "3d02e4fb7713dcf65a37418143b4e93f624d1d7b650c47599f747dbd99ff6bc5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Pongsona_gas_tank_fire.jpg/220px-Pongsona_gas_tank_fire.jpg",
				"previous": "On Saipan, two houses were destroyed and fifteen were damaged, seven severely. Sustained winds on the island peaked at 71 km/h (44 mph), which caused scattered power outages. Six minor injuries were reported, and damage totaled about $100,000 (2002 USD, $131 thousand 2015 USD).[7]",
				"after": "On the same day that Typhoon Pongsona struck Guam, President George W. Bush declared the island a major disaster area.[11] Around the time of the cyclone passing over the island, 2,271 residents were in shelters, and by the next day it increased to 3,467 after people discovered their homes were uninhabitable.[7] With thirteen Red Cross shelters across Guam,[12] most remained in shelters for about three weeks before disaster tents were distributed.[7] The American Red Cross worked with the United States Department of Agriculture to provide meals for shelter attendees for a two-week period following the typhoon.[12] Through the collaboration of federal and other agencies, disaster assistance on Guam totaled over $300 million (2003 USD, $335 million 2007 USD) by 100 days after the typhoon struck, including $60 million (2002 USD, $78.7 million 2015 USD) in initial disaster response. Nearly 29,000 individuals registered for disaster assistance, with the first assistance check arrived ten days after the disaster declaration. By three months after the storm, the United States Small Business Administration approved $130 million (2003 USD, $167 million 2015 USD) in low-interest loans.[1]",
			"color": "gray|0.26033 grey|0.26033 dim|0.23854 gray|0.23854 dim|0.23854 grey|0.23854 dark|0.18095 gray|0.18095 dark|0.18095 grey|0.18095 black|0.10599 slate|0.064004 gray|0.064004 light|0.051158 slate|0.051158 gray|0.051158 silver|0.033652 dark|0.029772 slate|0.029772 gray|0.029772 light|0.01433 steel|0.01433 blue|0.01433  "
		}
	}
}
