{
	"add": {
		"doc": {
			"id": "3d064e92c405b219caea17aaec46e2bae5f51b5ea263b171bf75c18b10c418bc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Sept_04_wilderness.jpg/220px-Sept_04_wilderness.jpg",
				"previous": "Marshall's posthumously published book Alaska Wilderness, Exploring the Central Brooks Range (1956), edited by his brother George, became a seminal work, inspiring the establishment of the Gates of the Arctic National Park. His Adirondack writings were published by Lost Pond Press in 2006, as an anthology titled Bob Marshall in the Adirondacks: Writings of a Pioneering Peak-Bagger, Pond-Hopper and Wilderness Preservationist. It was edited by Phil Brown, editor of the Adirondack Explorer news magazine. According to the publisher, the book includes \"numerous accounts of his hikes in the High Peaks and the vast wild region south of Cranberry Lake, spirited defenses of the state's forever-wild Forest Preserve, a charming portrait of Herb Clark, and excerpts from an unpublished novel set partly in the Adirondacks\".[71]",
				"after": "Since its conception, The Wilderness Society has helped pass many bills and has contributed a total of 109 million acres (421,000 km2) to the National Wilderness Preservation System.[72] Marshall's dream of permanent wilderness protection became a reality 25 years after his death when President Lyndon B. Johnson signed the Wilderness Act into law on September 3, 1964 in the Rose Garden of the White House.[73] The ceremony was attended by Alice Zahniser and Mardy Murie, the widows of two prominent members of The Wilderness Society. Written by Howard Zahniser, the bill enabled the United States Congress to set aside selected areas in the national forests, national parks, national wildlife refuges and other federal lands as units to be kept permanently unchanged by humans.[72] In defining wilderness, Zahniser invoked Marshall and his contemporaries, stating that \"in contrast with those areas where man and his own works dominate the landscape, [wilderness] is hereby recognized as an area where the earth and its community of life are untrammeled by man, where man himself is a visitor who does not remain.\"[74] The act's signing was the most important event in the history of The Wilderness Society; members Mardy Murie and Alice Zahniser stood beside Johnson as he signed the legislation. With The Wilderness Act, the United States guaranteed permanent protection of wild and scenic natural areas for future generations.[75] The Society's most prestigious honor, the Robert Marshall Award, is named in Marshall's honor; its first recipient was Sigurd F. Olson in 1981.",
			"color": "gray|0.23088 grey|0.23088 dark|0.18366 gray|0.18366 dark|0.18366 grey|0.18366 dim|0.1797 gray|0.1797 dim|0.1797 grey|0.1797 black|0.090931 silver|0.089653 light|0.06526 gray|0.06526 light|0.06526 grey|0.06526 gainsboro|0.053438 white|0.01835 smoke|0.01835 alice|0.011756 blue|0.011756 ghost|0.011522 white|0.011522 linen|0.011469 lavender|0.011344 blush|0.011344 sea|0.011237 shell|0.011237 snow|0.010922 white|0.0085719  "
		}
	}
}
