{
	"add": {
		"doc": {
			"id": "3d18bf70f080fda9c50a6861ba0fbfd936e899777e61424145de2a92cec1b54b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/VH-1N_HMX-1_in_northern_Italy_1987.JPEG/220px-VH-1N_HMX-1_in_northern_Italy_1987.JPEG",
			"previous": [],
				"after": "In 1946 General Roy S. Geiger observed the atomic bomb tests at Bikini Atoll and instantly recognized that atomic bombs could render amphibious landings difficult because of the dense concentrations of troops, ships and material at the beachhead. The Commandant of the Marine Corps convened a special board, the Hogaboom Board, that recommended that the Marine Corps develop transport helicopters in order to allow a more diffuse attack on enemy shores. It also recommended that they stand up an experimental helicopter squadron. HMX-1 was commissioned on December 1, 1947 and based in MCAS Quantico, Virginia because of its relative proximity to the Sikorsky and Piasecki plants in Connecticut, and to the Marine Corps schools where most of the original personnel would come. They operated the Sikorsky HO3S-1 and the Piasecki HRP-1 and saw their first test of capabilities in May of that year when five squadron aircraft transported 66 Marines from the deck of the USS Palau (CVE-122) to Marine Corps Base Camp Lejeune, North Carolina. While the test aircraft could only carry three Marines each and required multiple trips, it did indicate the possibilities of the concept.[1] In 1948 the Marine Corps Schools came out with Amphibious Operations - Employment of Helicopters (Tentative) or Phib-31 which was the first manual for airmobile operations. The Marines used the term \"vertical envelopment\" instead of \"air mobility\" or \"air assault\". HMX-1 performed the first ship-to-shore movement of troops from the deck of an aircraft carrier in an exercise in May 1948.[2]",
			"color": "black|0.17137 dim|0.15766 gray|0.15766 dim|0.15766 grey|0.15766 gray|0.12813 grey|0.12813 dark|0.12204 gray|0.12204 dark|0.12204 grey|0.12204 silver|0.082467 light|0.065781 gray|0.065781 light|0.065781 grey|0.065781 gainsboro|0.055739 white|0.02234 smoke|0.02234 dark|0.021237 slate|0.021237 gray|0.021237 linen|0.018896 sea|0.017397 shell|0.017397 snow|0.016065 floral|0.014355 white|0.014355 mint|0.013341 cream|0.013341 white|0.012169 slate|0.010713 gray|0.010713 old|0.0098908 lace|0.0098908 ghost|0.0095358 white|0.0095358 ivory|0.008647 light|0.0084404 slate|0.0084404 gray|0.0084404 alice|0.0082525 blue|0.0082525  "
		}
	}
}
