{
	"add": {
		"doc": {
			"id": "3d3ba4224af4f92f47ea572c65335aab2f760e57d4e96be2b8f21463715beb87",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/145th_Airlift_Wing.png/70px-145th_Airlift_Wing.png",
			"previous": [],
				"after": "As a joint civil-military facility, the airport is home to Charlotte Air National Guard Base (Charlotte ANGB) and its host unit, the 145th Airlift Wing (145 AW) of the North Carolina Air National Guard, located in a military cantonment area on the east side of the airport. As an Air National Guard organization within the U.S. Air Force, the federal mission of the 145 AW is theater airlift and it is operationally-gained by the Air Mobility Command (AMC). The 145 AW is composed of over 300 full-time and over 1000 traditional part-time military personnel, operating and maintaining C-130 Hercules aircraft in support of combatant commanders world-wide or as otherwise directed by higher authority. Its state mission is to respond to requirements, typically of a humanitarian or disaster-relief nature, as identified by the Governor of North Carolina.[28] The 145 AW's C-130H aircraft can also be equipped with the Modular Airborne Fire Fighting System (MAFFS), making them able to discharge large quantities of Phos-Chek, a water-based fire retardant slurry, at low altitude. In this capacity, the 145 AW is one of a select group of Air National Guard and Air Force Reserve Command C-130 units that, under the direction of U.S. Northern Command (USNORTHCOM), can deploy and provide military support to civilian authorities across the United States in combatting wild fires and forest fires.",
			"color": "crimson|0.16834 sky|0.13717 blue|0.13717 light|0.099524 sky|0.099524 blue|0.099524 light|0.091608 blue|0.091608 silver|0.083437 light|0.078938 gray|0.078938 light|0.078938 grey|0.078938 gainsboro|0.064417 light|0.057455 steel|0.057455 blue|0.057455 steel|0.045581 blue|0.045581 olive|0.031217 powder|0.02145 blue|0.02145 chocolate|0.018481 pale|0.014555 violet|0.014555 red|0.014555 peru|0.014076 firebrick|0.011635  "
		}
	}
}
