{
	"add": {
		"doc": {
			"id": "3d651ff6c3455bca8dd2974eef073bda029cdf8197221840fb4081f16c4a64c4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Joel_Palmer.jpg/170px-Joel_Palmer.jpg",
				"previous": "In 1847, the Whitman massacre and the Cayuse War in what became southeastern Washington raised fears among white settlers throughout the region and led to the formation of large volunteer militias organized to fight Indians.[39] Along the Rogue, tensions intensified in 1848 at the start of the California Gold Rush, when hundreds of men from the Oregon Territory passed through the Rogue Valley on their way to the Sacramento River basin.[40] After Indians attacked a group of returning miners along the Rogue in 1850, former territorial governor Joseph Lane negotiated a peace treaty with Apserkahar, a leader of the Takelma Indians. It promised protection of Indian rights and safe passage through the Rogue Valley for white miners and settlers.[41]",
				"after": "The peace did not last. Miners began prospecting for gold in the watershed, including a Bear Creek tributary called Jackson Creek, where they established a mining camp in 1851 at the site of what later became Jacksonville.[42] Indian attacks on miners that year led to U.S. Army intervention and fighting near Table Rock between Indians and the combined forces of professional soldiers and volunteer miner militias.[43] John P. Gaines, the new territorial governor, negotiated a new treaty with some but not all of the Indian bands, removing them from Bear Creek and other tributaries on the south side of the main stem.[43] At about the same time, more white emigrants, including women and children, were settling in the region. By 1852, about 28 donation land claims had been filed in the Rogue Valley.[44] Further clashes in 1853 led to the Treaty with the Rogue River (1853) that established the Table Rock Indian Reservation across the river from the federal Fort Lane.[45] As the white population increased and Indian losses of land, food sources, and personal safety mounted, bouts of violence upstream and down continued through 1854–55, culminating in the Rogue River War of 1855–56.[46]",
			"color": " "
		}
	}
}
