{
	"add": {
		"doc": {
			"id": "3d6af5541519290b8116d88e10674a907893bc48177332861b5460326218b210",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Eulemur_rubriventer_001.jpg/220px-Eulemur_rubriventer_001.jpg",
				"previous": "Lemur communication can be transmitted through sound, sight, and smell (olfaction). The ring-tailed lemur, for instance, uses complex though highly stereotyped behaviors such as scent-marking and vocalizations.[90] Visual signals are probably the least used by lemurs, since they lack many of the muscles used in common primate facial expressions.[88] Given their poor vision, whole-body postures are probably more noticeable. However, the ring-tailed lemur has demonstrated distinct facial expressions including a threat stare, pulled back lips for submission, and pulled back ears along with flared nostrils during scent-marking.[90] This species has also been observed using yawns as threats.[115][116] Their ringed tails also communicate distance, warn off neighboring troops, and help locate troop members.[90] Sifakas are known to exhibit an open-mouth play face[117] as well as a submissive teeth-baring grimace used in agonistic interactions.[70]",
				"after": "Olfaction is particularly important to lemurs,[2] except for the indri, which lacks most common lemur scent glands and has a greatly reduced olfactory region in the brain.[79] Olfaction can communicate information about age, sex, reproductive status, as well as demarcate the boundaries of a territory. It is most useful for communication between animals that rarely encounter each other.[52] Small, nocturnal lemurs mark their territories with urine, while the larger, diurnal species use scent glands located on various parts of their anatomy. The ring-tailed lemur engages in \"stink fights\" by rubbing its tail across scent glands on its wrists, and then flicking its tail at other male opponents. Some lemurs defecate in specific areas, otherwise known as latrine behavior. Although many animals exhibit this behavior, it is a rare trait among primates. Latrine behavior can represent territorial marking and aid in interspecies signaling.[18]",
			"color": "black|0.33311 dark|0.169 olive|0.169 green|0.169 dim|0.082035 gray|0.082035 dim|0.082035 grey|0.082035 gray|0.071966 grey|0.071966 dark|0.058058 gray|0.058058 dark|0.058058 grey|0.058058 silver|0.038463 light|0.023139 gray|0.023139 light|0.023139 grey|0.023139 beige|0.021639 gainsboro|0.016766 antique|0.014158 white|0.014158 linen|0.012221 old|0.01217 lace|0.01217  "
		}
	}
}
