{
	"add": {
		"doc": {
			"id": "3d6e93ed872d117a81d47b02cb965244d37b52f80ff650871d4b16144c98fc1f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/RwandaParliament.jpg/220px-RwandaParliament.jpg",
				"previous": "The Parliament consists of two chambers. It makes legislation and is empowered by the constitution to oversee the activities of the President and the Cabinet.[73] The lower chamber is the Chamber of Deputies, which has 80 members serving five-year terms. Twenty-four of these seats are reserved for women, elected through a joint assembly of local government officials; another three seats are reserved for youth and disabled members; the remaining 53 are elected by universal suffrage under a proportional representation system.[74] Following the 2008 election, there are 45 female deputies, making Rwanda the only country with a female majority in the national parliament.[75] The upper chamber is the 26-seat Senate, whose members are selected by a variety of bodies. A mandatory minimum of 30% of the senators are women. Senators serve eight-year terms.[76]",
				"after": "Rwanda's legal system is largely based on German and Belgian civil law systems and customary law.[77] The judiciary is independent of the executive branch,[78] although the President and the Senate are involved in the appointment of Supreme Court judges.[79] Human Rights Watch have praised the Rwandan government for progress made in the delivery of justice including the abolition of the death penalty,[80] but also allege interference in the judicial system by members of the government, such as the politically motivated appointment of judges, misuse of prosecutorial power, and pressure on judges to make particular decisions.[81] The constitution provides for two types of courts: ordinary and specialised.[82] Ordinary courts are the Supreme Court, the High Court, and regional courts, while specialised courts are military courts and the traditional Gacaca courts, which have been revived to expedite the trials of genocide suspects.[83]",
			"color": "gray|0.18892 grey|0.18892 dim|0.15202 gray|0.15202 dim|0.15202 grey|0.15202 dark|0.14884 gray|0.14884 dark|0.14884 grey|0.14884 silver|0.068409 light|0.03544 gray|0.03544 light|0.03544 grey|0.03544 white|0.032566 smoke|0.032566 black|0.031986 lavender|0.031657 blush|0.031657 ghost|0.031016 white|0.031016 snow|0.030545 alice|0.030543 blue|0.030543 white|0.029196 sea|0.027539 shell|0.027539 azure|0.025169 gainsboro|0.023926 mint|0.022484 cream|0.022484 lavender|0.020549 tan|0.018671 floral|0.014659 white|0.014659 antique|0.0097767 white|0.0097767  "
		}
	}
}
