{
	"add": {
		"doc": {
			"id": "3d80b4d6df5be00992396f3e787bec6f6d2fd664038d4ff608d871b02d1cb306",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/USAF_B-52_Stratofortress_Engines.jpg/220px-USAF_B-52_Stratofortress_Engines.jpg",
				"previous": "Starting in 2016, Boeing is to upgrade the internal rotary launchers to the MIL-STD-1760 interface to enable the internal carriage of smart bombs, which can currently only be carried on the wings.[103]",
				"after": "For a study for the U.S. Air Force in the mid-1970s, Boeing investigated replacing the engines, changing to a new wing, and other improvements to upgrade B-52G/H aircraft as an alternative to the B-1A, then in development.[104] Boeing later suggested re-engining the B-52H fleet with the Rolls-Royce RB211 535E-4.[105] This would involve replacing the eight Pratt & Whitney TF33s (total thrust 8 × 17,000 lb) with four RB211s (total thrust 4 × 37,400 lb)—which would increase range and reduce fuel consumption, at a cost of approximately US$2.56 billion for the whole fleet (71 aircraft at $36 million each). A Government Accountability Office study concluded that Boeing's estimated savings of US$4.7 billion would not be realized and that it would cost US$1.3 billion over keeping the existing engines, citing significant up-front procurement and re-tooling expenditure, as well as the RB211's higher maintenance cost. The GAO report was subsequently disputed in a Defense Sciences Board report in 2003; the Air Force was urged to re-engine the aircraft without delay.[106] Further, the DSB report stated the program would have significant savings, reduce greenhouse gas emissions, and increase aircraft range and endurance, in line with the conclusions of a separate Congress-funded study conducted in 2003.[107] In 2014, the U.S. Air Force was reviewing industry studies of engine replacement.[108] The re-engining has not been approved as of 2014[update]. In late 2014, it was reported that the DOD and unnamed private companies were exploring a leasing program where private lease companies would purchase new engines and lease them to the USAF. DOD costs would be determined by depreciation and actual usage with no up-front lump payments.[109]",
			"color": "gray|0.25513 grey|0.25513 black|0.16519 dim|0.15418 gray|0.15418 dim|0.15418 grey|0.15418 dark|0.14377 gray|0.14377 dark|0.14377 grey|0.14377 silver|0.039528 light|0.028345 gray|0.028345 light|0.028345 grey|0.028345 gainsboro|0.023497 slate|0.019155 gray|0.019155 white|0.017057 smoke|0.017057 light|0.014718 slate|0.014718 gray|0.014718 ghost|0.013992 white|0.013992 snow|0.013978 alice|0.013661 blue|0.013661 sea|0.013259 shell|0.013259 white|0.012791 mint|0.011784 cream|0.011784 floral|0.01124 white|0.01124 azure|0.010986 lavender|0.010413 blush|0.010413 lavender|0.0065457 linen|0.0053307  "
		}
	}
}
