{
	"add": {
		"doc": {
			"id": "3d820ac76456ffc47b814a3f8005b5c8237964544a93a00d2b3f3eda64aa319f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Boursecommerce.jpg/220px-Boursecommerce.jpg",
				"previous": "The new palace was known in Catherine's time as the Hôtel de la Reine and later as the Hôtel de Soissons. The original design was based on the Uffizi palace in Florence, but Catherine dropped that idea for a less costly plan after 1576.[10] Engravings made by Israël Silvestre in about 1650 and a plan from about 1700 show that the Hôtel de la Reine possessed a central wing, a courtyard, and gardens.[72] The central wing consisted of three large pavilions with tall, pitched roofs. In the middle, two tall projections decorated with pilasters flanked an arch. The walled gardens of the hôtel included an aviary, a lake with a water jet, and long avenues of trees. Catherine also installed an orangery that could be dismantled in winter.[63] The actual construction work was carried out after Bullant's death in 1582.[73] The building was demolished in the 1760s.",
				"after": "All that remains of the Hôtel de la Reine today is a single Doric column, known as the Colonne de l'Horoscope, which stood in the courtyard.[74] It can be seen next to the domed Bourse de Commerce. Catherine's biographer Leonie Frieda has called it \"a poignant reminder of the fleeting nature of power\".[75] The staircase inside leads to a platform that can hold three persons and is topped by an iron cage. A balcony is thought to have once encircled the top.[76] The purpose of the column is not clear, but it would have served as a useful observation post. Catherine's astrologers may have used it to look at the stars.[20] The column also seems to have had a memorial significance.[77] Carvings of shattered mirrors, torn love-knots, and the intertwined letters \"C\" and \"H\"—all symbols of Catherine's grief at the loss of her husband—are embedded in the fluting.[20]",
			"color": "dim|0.30767 gray|0.30767 dim|0.30767 grey|0.30767 gray|0.18107 grey|0.18107 dark|0.15121 gray|0.15121 dark|0.15121 grey|0.15121 slate|0.096747 gray|0.096747 light|0.092661 slate|0.092661 gray|0.092661 silver|0.058246 light|0.02981 steel|0.02981 blue|0.02981 light|0.024228 gray|0.024228 light|0.024228 grey|0.024228 dark|0.018257 slate|0.018257 gray|0.018257 gainsboro|0.014043 lavender|0.0093703  "
		}
	}
}
