{
	"add": {
		"doc": {
			"id": "3d85c862b517c95a6291bcc521362bab32d64bbbafc0088b25b0f98bc3d6efa1",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/29/Dash_7_Flight_Deck.jpg/220px-Dash_7_Flight_Deck.jpg",
				"previous": "With new noise restrictions coming into effect throughout the 1970s, an aircraft tailored for this role would also have to be very quiet. Propeller thrust is a factor of its blade length and cord and the speed at which it rotates (RPM). To meet these new regulations the new design used much larger (oversized) propellers geared to rotate at a slower speed than is normally designed. Much of the problem sound from a typical propeller is generated at the tips of the blades which are rotating just beneath the speed of sound. By using overlarge propeller blades there is no need to have the blade tip reach near the speed of sound, and the RPM can therefore be reduced without sacrificing thrust. In reducing the RPM this noise is reduced substantially. The Dash 7 often landed with only 900 RPM, and took off at only 1,210 RPM. The propellers on the Dash-7 allow for feathering, a change in the blade angle to push more or less air as needed. This can be used to increase airspeed and climb rate while maintaining a constant (and lower) RPM.",
				"after": "In other respects, the new DHC-7 was essentially a larger, four-engine version of the Twin Otter: the general layout remained similar, with a high aspect ratio high-mounted wing, most details of the cockpit and nose profile. Changes included the addition of cabin pressurization (requiring a switch to a fuselage with a circular cross-section), landing gear that folded forward into the inner engine nacelles and a large T-tail intended to keep the elevator clear of the propwash during takeoff (the Twin Otter's empennage was a cruciform arrangement).",
			"color": "dark|0.19842 slate|0.19842 gray|0.19842 dim|0.13417 gray|0.13417 dim|0.13417 grey|0.13417 black|0.10964 light|0.065775 steel|0.065775 blue|0.065775 light|0.048383 slate|0.048383 gray|0.048383 gray|0.047593 grey|0.047593 dark|0.047577 gray|0.047577 dark|0.047577 grey|0.047577 slate|0.037717 gray|0.037717 light|0.032811 blue|0.032811 silver|0.026907 powder|0.024633 blue|0.024633 light|0.021898 cyan|0.021898 alice|0.019179 blue|0.019179 light|0.018661 gray|0.018661 light|0.018661 grey|0.018661 azure|0.017977 gainsboro|0.015387 mint|0.01267 cream|0.01267 light|0.011968 sky|0.011968 blue|0.011968 white|0.011462 smoke|0.011462 rosy|0.011097 brown|0.011097 sky|0.0094775 blue|0.0094775 ghost|0.0092198 white|0.0092198 white|0.0086583 snow|0.0079386 floral|0.0068966 white|0.0068966 sea|0.0057713 shell|0.0057713  "
		}
	}
}
