{
	"add": {
		"doc": {
			"id": "3d879d1b22dcee2a3cb4c600d11aeed0cbd10388aca635c7aab2e91ef61caa54",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Apodemus_sylvaticus_bosmuis.jpg/220px-Apodemus_sylvaticus_bosmuis.jpg",
				"previous": "While the largest species, the capybara, can weigh as much as 66 kg (146 lb), most rodents weigh less than 100 g (3.5 oz). The smallest rodent is the Baluchistan pygmy jerboa, which averages only 4.4 cm (1.7 in) in head and body length, with adult females weighing only 3.75 g (0.132 oz). Rodents have wide-ranging morphologies, but typically have squat bodies and short limbs.[1] The forelimbs usually have five digits, including an opposable thumb, while the hind-limbs have three to five digits. The elbow gives the fore-arms great flexibility.[3][7] The majority of species are plantigrade, walking on both the palms and soles of their feet, and have claw-like nails. The nails of burrowing species tend to be long and strong, while arboreal rodents have shorter, sharper nails.[7] Rodent species use a wide variety of methods of locomotion including quadrupedal walking, running, burrowing and climbing, bipedal hopping (kangaroo rat and hopping mouse), swimming and even gliding. Scaly-tailed squirrels and flying squirrels, although not closely related, can both glide from tree to tree using parachute-like membranes that stretch from the fore-limbs to the hind-limbs.[8] The agouti is fleet-footed and antelope-like, being digitigrade and having hoof-like nails. The majority of rodents have tails, which can be of many shapes and sizes. Some tails are prehensile, as in the Eurasian harvest mouse, and the fur on the tails can vary from bushy to completely bald. The tail is sometimes used for communication, as when beavers slap their tails on the water surface or house mice rattle their tails to indicate alarm. Some species have vestigial tails or no tails at all.[1] In some species, the tail is capable of regeneration if a part is broken off.[3]",
				"after": "Rodents generally have well-developed senses of smell, hearing and vision. Nocturnal species often have enlarged eyes and some are sensitive to ultraviolet light. Many species have long, sensitive whiskers or vibrissae for touch or \"whisking\". Some rodents have cheek pouches, which may be lined with fur. These can be turned inside out for cleaning. In many species, the tongue cannot reach past the incisors. Rodents have efficient digestive systems, absorbing nearly 80 percent of ingested energy. When eating cellulose, the food is softened in the stomach and passed to the cecum, where bacteria reduce it to its carbohydrate elements. The rodent then practices coprophagy, eating its own fecal pellets, so that the nutrients can be absorbed by the gut. Rodents therefore often produce a hard and dry fecal pellet.[1] In many species, the penis contains a bone, the baculum; the testes can be located either abdominally or at the groin.[3]",
			"color": "gray|0.21467 grey|0.21467 dim|0.21037 gray|0.21037 dim|0.21037 grey|0.21037 dark|0.20698 gray|0.20698 dark|0.20698 grey|0.20698 silver|0.08501 light|0.048074 gray|0.048074 light|0.048074 grey|0.048074 light|0.038892 steel|0.038892 blue|0.038892 gainsboro|0.034746 light|0.033519 slate|0.033519 gray|0.033519 slate|0.027792 gray|0.027792 white|0.0093423 smoke|0.0093423 linen|0.0070082 alice|0.0065232 blue|0.0065232 lavender|0.0062895 rosy|0.0055279 brown|0.0055279 antique|0.0054889 white|0.0054889 sea|0.0053707 shell|0.0053707 ghost|0.0051772 white|0.0051772 black|0.0050921 snow|0.005012 mint|0.0043443 cream|0.0043443 floral|0.00412 white|0.00412 white|0.0038909 azure|0.0038326  "
		}
	}
}
