{
	"add": {
		"doc": {
			"id": "3d8f95a04cf12ed964f075ca14e9a8b8dd4d150d3fa297f6450a018a486e18a5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Congress_london_1913.jpg/220px-Congress_london_1913.jpg",
				"previous": "Following the split from the SPD, the FVdG was increasingly influenced by French syndicalism and anarchism. In 1908, Kater called the Charter of Amiens, the platform of the French General Confederation of Labor (CGT), the earliest and largest syndicalist union worldwide, \"a new revelation\".[29] Although there was no contact between German \"intellectual anarchists\" (like Gustav Landauer and Erich Mühsam) and the FVdG, it did have influential anarchist members, most notably Andreas Kleinlein and Fritz Köster. Kleinlein and Köster increasingly influenced the federation from 1908 on,[30] and this led to the founding of Der Pionier in 1911. This newspaper, which was edited by Köster, had a much more aggressive tone than Die Einigkeit.[31] Despite these developments, the influence of the anarchists in the pre-World War I FVdG remained quantitatively minute, especially as leading members like Kater were at the time very skeptical of the anarchist ideology.[32]",
				"after": "After both the British Industrial Syndicalist Education League (ISEL), a short-lived syndicalist organization heavily involved in the strike wave in Britain from 1910, and the Dutch syndicalist union National Labor Secretariat (NAS) published proposals for an international syndicalist congress in 1913, the FVdG was the first to express support. There were difficulties in organizing the congress, and the largest syndicalist union worldwide — the CGT — refused to participate because it was already affiliated with the social democratic International Federation of Trade Unions. Despite these challenges, the First International Syndicalist Congress took place at Holborn Town Hall in London from September 27 to October 2. British, Swedish, Danish, Dutch, Belgian, French, Spanish, Italian, Cuban, Brazilian, and Argentine organizations—both labor unions and political groups — had delegates in London in addition to the FVdG, which was represented by Karl Roche, Carl Windhoff, and Fritz Kater. There were also links with Norwegian, Polish, and American groups. Kater was elected co-president of the congress alongside Jack Wills. After Wills was forced to resign, Kater served as co-president with Jack Tanner. The congress had difficulty agreeing on many issues, the main source of conflict being whether further schisms in the European labor movement (as had occurred in Germany and the Netherlands) should be risked. The FVdG generally agreed with their Dutch comrades in calling on other unions to decide between syndicalism and socialism, while their Italian, French, and Spanish counterparts, most notably Alceste De Ambris of the Italian USI, were more intent on preventing further division. Accordingly, the congress was divided on the question of whether its purpose was to simply pave the way for deeper relations between the syndicalist unions or whether a Syndicalist International was to be founded. The opponents of a new organization prevailed, but the congress agreed to establish an Information Bureau. The Information Bureau was based in Amsterdam and published the Bulletin international du mouvement syndicaliste. The congress was considered a success by most who attended, with the notable exception of De Ambris. A second congress was scheduled to take place in two years' time in Amsterdam. Due to the outbreak of World War I, the congress did not take place. The Bulletin only published for eighteen issues before the war caused it to cease publication.[33]",
			"color": " "
		}
	}
}
