{
	"add": {
		"doc": {
			"id": "3da3ac5a0bcc45ad2dc9fbb55bf43f8d4150f5a5db7c9def9f7b3585430bf3d2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Tyntesfield_1.jpg/220px-Tyntesfield_1.jpg",
				"previous": "In Arthurian legend, Avalon became associated with Glastonbury Tor when monks at Glastonbury Abbey claimed to have discovered the bones of King Arthur and his queen.[106] What is more certain is that Glastonbury was an important religious centre by 700 and claims to be \"the oldest above-ground Christian church in the World\"[107] situated \"in the mystical land of Avalon.\" The claim is based on dating the founding of the community of monks at AD 63, the year of the legendary visit of Joseph of Arimathea, who was supposed to have brought the Holy Grail.[107] During the Middle Ages there were also important religious sites at Woodspring Priory and Muchelney Abbey. The present Diocese of Bath and Wells covers Somerset – with the exception of the Parish of Abbots Leigh with Leigh Woods in North Somerset – and a small area of Dorset. The Episcopal seat of the Bishop of Bath and Wells is now in the Cathedral Church of Saint Andrew in the city of Wells, having previously been at Bath Abbey. Before the English Reformation, it was a Roman Catholic diocese; the county now falls within the Roman Catholic Diocese of Clifton. The Benedictine monastery Saint Gregory's Abbey, commonly known as Downside Abbey, is at Stratton-on-the-Fosse, and the ruins of the former Cistercian Cleeve Abbey are near the village of Washford.",
				"after": "The county has several museums; those at Bath include the American Museum in Britain, the Building of Bath Collection, the Herschel Museum of Astronomy, the Jane Austen Centre, and the Roman Baths. Other visitor attractions which reflect the cultural heritage of the county include: Claverton Pumping Station, Dunster Working Watermill, the Fleet Air Arm Museum at Yeovilton, Nunney Castle, The Helicopter Museum in Weston-super-Mare, King John's Hunting Lodge in Axbridge, Blake Museum Bridgwater, Radstock Museum, Museum of Somerset in Taunton, the Somerset Rural Life Museum in Glastonbury, and Westonzoyland Pumping Station Museum.",
			"color": "black|0.23249 olive|0.18798 drab|0.18798 tan|0.075774 wheat|0.062199 dark|0.05557 olive|0.05557 green|0.05557 pale|0.047823 golden|0.047823 rod|0.047823 dim|0.046606 gray|0.046606 dim|0.046606 grey|0.046606 dark|0.03455 khaki|0.03455 gray|0.027856 grey|0.027856 moccasin|0.027081 dark|0.020069 gray|0.020069 dark|0.020069 grey|0.020069 navajo|0.019981 white|0.019981 lemon|0.016911 chiffon|0.016911 light|0.012833 golden|0.012833 rod|0.012833 yellow|0.012833 burly|0.010311 wood|0.010311  "
		}
	}
}
