{
	"add": {
		"doc": {
			"id": "3da5ce4a351195e934022fac70bc91ce5fa5376fd43e80fc57bc0fdf9eac84da",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Joseph_Wright_of_Derby._An_Experiment_on_a_Bird_in_the_Air_Pump._Detail.child.jpg/220px-Joseph_Wright_of_Derby._An_Experiment_on_a_Bird_in_the_Air_Pump._Detail.child.jpg",
				"previous": "The scientific subjects of Wright's paintings from this time were meant to appeal to the wealthy scientific circles in which he moved. While never a member himself, he had strong connections with the Lunar Society: he was friends with members John Whitehurst and Erasmus Darwin, as well as Josiah Wedgwood, who later commissioned paintings from him.[36] The inclusion of the moon in the painting was a nod to their monthly meetings, which were held when the moon was full. Like The Orrery, Wright apparently painted Air Pump without a commission, and the picture was purchased by Dr Benjamin Bates, who already owned Wright's Gladiator. An Aylesbury physician, patron of the arts and hedonist, Bates was a diehard member of the Hellfire Club who, despite his excesses, lived to be over 90. Wright's account book shows a number of prices for the painting: Pd£200 is shown in one place and £210 in another, but Wright had written to Bates asking for £130, stating that the low price \"might much injure me in the future sale of my pictures, and when I send you a receipt for the money I shall acknowledge a greater sum.\"[37] Whether Bates ever paid the full amount is not recorded; Wright only notes in his account book that he received £30 in part payment.[38]",
				"after": "Wright exhibited the painting at the Society of Artists exhibition in 1768 and it was re-exhibited before Christian VII of Denmark in September the same year. Viewers remarked that it was \"clever and vigorous\",[27] while Gustave Flaubert, who saw it on a visit to England in 1865–66, considered it \"charmant de naïveté et profondeur\".[26] It was popular enough that a mezzotint was engraved from it by Valentine Green which was published by John Boydell on 24 June 1769,[38] and initially sold for 15 shillings. This was reprinted throughout the 18th and 19th centuries, in increasingly weak impressions.[39] Ellis Waterhouse called it \"one of the wholly original masterpieces of British art\".[40]",
			"color": "black|0.498 tan|0.1234 burly|0.062797 wood|0.062797 wheat|0.048097 pale|0.026791 golden|0.026791 rod|0.026791 moccasin|0.024067 blanched|0.023263 almond|0.023263 bisque|0.021991 lemon|0.019854 chiffon|0.019854 light|0.019125 golden|0.019125 rod|0.019125 yellow|0.019125 navajo|0.018633 white|0.018633 papaya|0.016785 whip|0.016785 corn|0.016577 silk|0.016577 light|0.014223 yellow|0.014223 beige|0.012728 peach|0.010731 puff|0.010731 khaki|0.01064 antique|0.0097338 white|0.0097338  "
		}
	}
}
