{
	"add": {
		"doc": {
			"id": "3db23ead97d8b0a6dac7292dfc39320bf9464ade8d55073b0c23821a85e50bf6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Jack_Parsons.jpg/220px-Jack_Parsons.jpg",
				"previous": "Crowley and Germer wanted to see Smith removed as head of the Agape Lodge, believing that he had become a bad influence on other lodge members. Parsons and Helen wrote to them to defend their mentor but Germer nevertheless ordered him to stand down and Parsons was appointed as temporary head of the Lodge.[92] Some veteran Lodge members disliked Parsons' influence, concerned that it encouraged excessive sexual polyandry detrimental to the focused practice of Thelema, but his charismatic orations at Lodge meetings—compared to those of President Roosevelt—assured his popularity among the majority of followers. Parsons soon created the Thelemite journal Oriflamme, in which he published his own poetry, but Crowley was unimpressed—particularly due to Parsons' descriptions of his prolific drug use—and the project was soon shelved.[93] Helen gave birth to Smith's son in April; the child was named Kwen Lanval Parsons.[94] Smith and Helen left with Kwen for a two-room cabin in Rainbow Valley in May.[95] Concurrently in England, Crowley undertook an astrological analysis of Smith's birth chart and came to the conclusion that Smith was the incarnation of a god, greatly altering his estimation of him; Smith however remained skeptical—Crowley's analysis was seemingly deliberately devised in Parsons' favor, encouraging Smith to step down from his role in the Agape Lodge and instructing him to take a meditative retreat.[96] Refusing to take orders from Germer anymore, Smith resigned from the OTO. Parsons—who remained sympathetic and friendly to Smith during the conflict and was weary of Crowley's \"appalling egotism, bad taste, bad judgement, and pedanticism\"—ceased lodge activities and resigned as its head, but withdrew his resignation after receiving a pacifying letter from Crowley.[97]",
				"after": "By the summer of 1943 Aerojet was operating on a budget of $650,000. The same year Parsons and von Kármán traveled to Norfolk, Virginia to consult on a new JATO contract for the U.S. Navy on the invitation of Secretary of the Navy Frank Knox. Though JATOs were being mass-produced for military applications, JATO-propelled aircraft could not \"keep up\" with larger, bomber planes taking off from long aircraft carrier runways—which made Aerojet's industry at risk of becoming defunct.[98] Parsons demonstrated the efficacy of the newer JATOs to solve this issue by equipping a Grumman plane with solid-fuel units; its assisted takeoff from the USS Charger was successful, but produced smoke containing a noxious, yellow-colored residue. The Navy guaranteed Parsons a contract on the condition that this residue was removed; this led to the invention of Aeroplex, a technology for smokeless vapor trails developed at Aerojet under Parsons' command.[99]",
			"color": " "
		}
	}
}
