{
	"add": {
		"doc": {
			"id": "3dcdd918fd049d923ab443daff3e2b7d9a33b2aa069a99f29bfb5c98d63c681d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Edward_Gibbon_by_Henry_Walton_cleaned.jpg/170px-Edward_Gibbon_by_Henry_Walton_cleaned.jpg",
				"previous": "French philosophe Voltaire (1694–1778) had an enormous influence on the art of history writing. His best-known histories are The Age of Louis XIV (1751), and Essay on the Customs and the Spirit of the Nations (1756). \"My chief object,\" he wrote in 1739, \"is not political or military history, it is the history of the arts, of commerce, of civilization – in a word, – of the human mind.\"[12] He broke from the tradition of narrating diplomatic and military events, and emphasized customs, social history and achievements in the arts and sciences. He was the first scholar to make a serious attempt to write the history of the world, eliminating theological frameworks, and emphasizing economics, culture and political history.",
				"after": "At the same time, philosopher David Hume was having a similar impact on history in Great Britain. In 1754 he published the History of England, a 6-volume work which extended \"From the Invasion of Julius Caesar to the Revolution in 1688\". Hume adopted a similar scope to Voltaire in his history; as well as the history of Kings, Parliaments, and armies, he examined the history of culture, including literature and science, as well.[13] William Robertson, a Scottish historian, and the Historiographer Royal[14] published the History of Scotland 1542 - 1603, in 1759 and his most famous work, The history of the reign of Charles V in 1769.[15] His scholarship was painstaking for the time and he was able to access a large number of documentary sources that had previously been unstudied. He was also one of the first historians who understood the importance of general and universally applicable ideas in the shaping of historical events.[16]",
			"color": "black|0.4223 dark|0.223 salmon|0.223 peach|0.083079 puff|0.083079 sienna|0.061672 burly|0.057898 wood|0.057898  "
		}
	}
}
