{
	"add": {
		"doc": {
			"id": "3dcfac1e97a03c58fa4449d2dadec69d12b338bcc39b8c08049db79a65d7272f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Livre_du_c%C5%93ur_d%27amour_%C3%A9pris_-_vindobo2597_-_f25v.jpg/320px-Livre_du_c%C5%93ur_d%27amour_%C3%A9pris_-_vindobo2597_-_f25v.jpg",
				"previous": "The Limbourg brothers's ornate Très Riches Heures du Duc de Berry perhaps marks both the beginning and a highpoint of Netherlandish illumination. Later the Master of the Legend of Saint Lucy explored the same mix of illusionism and realism.[22] The Limbourgs' career ended just as van Eyck's began – by 1416 all the brothers (none of whom had reached 30) and their patron Jean, Duke of Berry were dead, most likely from plague.[22] Van Eyck is thought to have contributed several of the more acclaimed miniatures of the Turin-Milan Hours as the anonymous artist known as Hand G.[107] A number of illustrations from the period show a strong stylistic resemblance to Gerard David, though it is unclear whether they are from his hands or those of followers.[108]",
				"after": "A number of factors led to the popularity of Netherlandish illuminators. Primary was the tradition and expertise that developed in the region in the centuries following the monastic reform of the 14th century, building on the growth in number and prominence of monasteries, abbeys and churches from the 12th century that had already produced significant numbers of liturgical texts.[105] There was a strong political aspect; the form had many influential patrons such as Jean, Duke of Berry and Philip the Good, the latter of whom collected more than a thousand illuminated books before his death.[109] According to Thomas Kren, Philip's \"library was an expression of the man as a Christian prince, and an embodiment of the state – his politics and authority, his learning and piety\".[110] Because of his patronage the manuscript industry in the Lowlands grew so that it dominated Europe for several generations. The Burgundian book-collecting tradition passed to Philip's son and his wife, Charles the Bold and Margaret of York; his granddaughter Mary of Burgundy and her husband Maximilian I; and to his son-in-law, Edward IV, who was an avid collector of Flemish manuscripts. The libraries left by Philip and Edward IV formed the nucleus from which sprang the Royal Library of Belgium and the English Royal Library.[111]",
			"color": "dark|0.1855 gray|0.1855 dark|0.1855 grey|0.1855 silver|0.16094 light|0.074888 gray|0.074888 light|0.074888 grey|0.074888 gray|0.07301 grey|0.07301 dim|0.055506 gray|0.055506 dim|0.055506 grey|0.055506 gainsboro|0.044952 antique|0.036593 white|0.036593 linen|0.02965 black|0.02539 papaya|0.024025 whip|0.024025 old|0.023209 lace|0.023209 lavender|0.020136 blanched|0.018709 almond|0.018709 misty|0.017749 rose|0.017749 sea|0.016404 shell|0.016404 light|0.016069 slate|0.016069 gray|0.016069 slate|0.013272 gray|0.013272 dark|0.013017 olive|0.013017 green|0.013017 beige|0.012189 bisque|0.011709 floral|0.010996 white|0.010996 white|0.010575 smoke|0.010575 light|0.010088 steel|0.010088 blue|0.010088 rosy|0.0079188 brown|0.0079188 alice|0.0074287 blue|0.0074287 snow|0.0069566 corn|0.0065457 silk|0.0065457 thistle|0.0063351 ivory|0.0058254 ghost|0.0058062 white|0.0058062  "
		}
	}
}
