{
	"add": {
		"doc": {
			"id": "3dd8a2aa96a34a4dab4e129fb68bb2cff867fd03c7ffced85711b95f33681a02",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f4/NNS_41809.JPG/300px-NNS_41809.JPG",
			"previous": [],
				"after": "In the early years, leaders of the Newport News community and those of the shipyard were virtually interchangeable. Shipyard president Walter A. Post served from March 9, 1911 to Feb. 12, 1912, when he died. Earlier, he had come to the area as one of the builders of the C&O Railway's terminals, and had served as the first mayor of Newport News after it became an independent city in 1896. It was on March 14, 1914 that Albert L. Hopkins, a young New Yorker trained in engineering, succeeded Post as President of the company. In May 1915 while traveling to England on shipyard business, aboard RMS Lusitania, Albert L. Hopkins tenure and life ended prematurely when that ship was torpedoed and sunk by a German U-boat[4] off Queenstown on the Irish coast. His assistant Fred Gauntlett, was also on board, but was able to swim to safety.[5] Homer Lenoir Ferguson was a manager when Hopkins died, and assumed the presidency the following July. He saw the company through both world wars, became a noted community leader, and was a co-founder of the Mariners' Museum with Archer Huntington. He served until July 31, 1946, after the second World War had ended on both the European and Pacific fronts.",
			"color": "gray|0.26631 grey|0.26631 dark|0.26082 gray|0.26082 dark|0.26082 grey|0.26082 dim|0.16363 gray|0.16363 dim|0.16363 grey|0.16363 black|0.082857 silver|0.040319 light|0.037725 gray|0.037725 light|0.037725 grey|0.037725 gainsboro|0.031019 slate|0.014803 gray|0.014803 tan|0.013782 lavender|0.012959 burly|0.0095076 wood|0.0095076 light|0.0094895 slate|0.0094895 gray|0.0094895 white|0.0067349 smoke|0.0067349 light|0.0065546 steel|0.0065546 blue|0.0065546 alice|0.0061672 blue|0.0061672 ghost|0.0055201 white|0.0055201 lavender|0.0047465 blush|0.0047465  "
		}
	}
}
