{
	"add": {
		"doc": {
			"id": "3ddab9f85631714df821aa3739ef5b1398ae0f3e936d7cb8d030583022a9592e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Cold_War_alliances_mid-1975.svg/120px-Cold_War_alliances_mid-1975.svg.png",
				"previous": "Portal:Society/Featured article/38",
				"after": "The concept of the First World first originated during the Cold War, where it was used to describe countries that the United States was aligned with. These countries were democratic and capitalistic. After the fall of the Soviet Union and the end of the Cold War, the term \"First World\" took on a new meaning that was more applicable to the times. Since its original definition, the term First World has come to be largely synonymous with developed countries or highly developed countries (depending on which definition is being used). First World countries in general have very advanced economies and very high Human Development Indexes. On the other hand, the United Nations defined the First World on the wealth of the nation's gross national product (GNP). The definition of First World is now less concrete than during the Cold War. Global dynamics between the First World and the other Worlds were essentially split into two. Relationships with the Second World were competitive, ideological and hostile. Relationships with Third World countries were normally positive in theory, while some were quite negative in practice (such as with the practice of proxy war). Present inter-world relationships are not so rigid, although there is a disparity in terms of the First World having more influence, wealth, information and advancements than the other worlds. Globalization is an increasingly important phenomenon which has been fueled largely by the First World and its connections with the other worlds. An example of globalization within the First World is the European Union which has brought much cooperation and integration to the region. Multinational corporations also provide examples of the First World's impact on globalization, as they have brought economic, political and social integration in many countries. With the rise of the multinational corporation, the problem of outsourcing has risen in many First World countries.",
			"color": "steel|0.28493 blue|0.28493 light|0.11435 steel|0.11435 blue|0.11435 misty|0.050505 rose|0.050505 light|0.049708 golden|0.049708 rod|0.049708 yellow|0.049708 light|0.048663 coral|0.048663 pink|0.042902 indian|0.040105 red|0.040105 light|0.032274 pink|0.032274 light|0.021524 yellow|0.021524 beige|0.020793 lavender|0.018929 blush|0.018929 dark|0.018682 sea|0.018682 green|0.018682 cadet|0.018235 blue|0.018235 sea|0.014646 shell|0.014646 lavender|0.014377 yellow|0.013984 green|0.013984 white|0.013365 smoke|0.013365 honeydew|0.013343  "
		}
	}
}
