{
	"add": {
		"doc": {
			"id": "3de75ab8bdf59a4aec400b0fab538ee7e3c5aafc05664aad25f20b02139407a2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Cayman_Islands_%28detail%29.jpg/300px-Cayman_Islands_%28detail%29.jpg",
				"previous": "Blue iguanas have evolved a white photosensory organ on the top of their heads called the parietal eye (also known as the third eye, pineal eye or pineal gland).[20] This \"eye\" does not work the same way as a normal eye as it has only a rudimentary retina and lens and thus, cannot form images.[20] It is however sensitive to changes in light and dark and can detect movement.[20]",
				"after": "The blue iguana is found only on the island of Grand Cayman. Comparison with other Cyclura species in the region strongly suggests that there was once a coastal population of blue iguanas which was gradually displaced or extirpated by human settlements and the construction of roads.The blue iguana now only occurs inland in natural xerophytic shrubland and along the interfaces between farm clearings, roads, and gardens and closed-canopy dry forest or shrubland.The interior population is believed to have been attracted to agricultural clearings and fruit farms which provide thermoregulatory opportunities, herbaceous browse, fallen fruit, and nesting soil, but this also brought the blue iguana into contact with humans and feral animals. Females often migrate to coastal areas to nest.[21] Blue iguanas released into the Queen Elizabeth II Botanic Park on Grand Cayman were radiotracked in 2004 to determine ranges for each animal.[22] Females were found to occupy territories of 0.6 acres (2,400 m2) and males an average of 1.4 acres (5,700 m2) with overlap in common territories, indicating that they choose to maintain a population density of four to five animals per hectare. The blue iguanas occupy rock holes and tree cavities, and as adults are primarily terrestrial. Younger individuals tend to be more arboreal. Hatchlings are preyed upon by the native snake Alsophis cantherigerus. The adults have no natural predators but can fall victim to feral dogs. They typically reach sexual maturity at three to four years of age.",
			"color": "gainsboro|0.43749 light|0.42091 gray|0.42091 light|0.42091 grey|0.42091 powder|0.041106 blue|0.041106 light|0.018027 cyan|0.018027 azure|0.0086368 alice|0.0075528 blue|0.0075528 light|0.0065985 blue|0.0065985 white|0.0061487 smoke|0.0061487 dark|0.0057294 gray|0.0057294 dark|0.0057294 grey|0.0057294 mint|0.0052509 cream|0.0052509 silver|0.0052477 white|0.0037236 ghost|0.0037062 white|0.0037062 snow|0.0036838 cadet|0.0035695 blue|0.0035695 gray|0.003019 grey|0.003019 dim|0.0029324 gray|0.0029324 dim|0.0029324 grey|0.0029324 floral|0.0027983 white|0.0027983  "
		}
	}
}
