{
	"add": {
		"doc": {
			"id": "3df4a969309dbaf11b55a0dd2679638783f4bc6ca0efb52f70f32e00fd7c2c2f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Malaga_densidad_poblacion.svg/250px-Malaga_densidad_poblacion.svg.png",
				"previous": "Málaga, together with the following adjacent towns and municipalities: Rincón de la Victoria, Torremolinos, Benalmádena, Fuengirola, Alhaurín de la Torre, Mijas, Marbella and San Pedro Alcántara form the urban area with a population of 1,066,532 on 827.33 square kilometres (319.43 sq mi) (density 1,289 hab / km²) – 2012 data. The urban area stretches mostly along a narrow strip of coastline. The Málaga metropolitan area includes additional municipalities located mostly in the mountains area north of the coast and also some on the coast: Cártama, Pizarra, Coín, Monda, Ojén, Alhaurín el Grande and Estepona on west; Casabermeja on north; Totalán, Algarrobo, Torrox and Vélez-Málaga eastward from Málaga.",
				"after": "Municipalities of the metropolitan area are connected by the road network (including motorways) with the urban area and Málaga city (the urban area can be reached by car from the farthest reaches in 20 minutes and Málaga city in 45 minutes). In some usages the metropolitan area includes other municipalities to which Málaga's public transportation network extends, at least since the establishment of the Consorcio de Transporte Metropolitano del Área de Málaga (en: Consortium of Transportation of Málaga Metropolitan Area). Together about 1.3 million (max. 1.6 million[9]) people live in the Málaga metropolitan area and the number grows every year as all the municipalities and cities of the area record an annual increase in population.",
			"color": "misty|0.16428 rose|0.16428 light|0.16302 coral|0.16302 salmon|0.13068 rosy|0.041508 brown|0.041508 maroon|0.038085 red|0.034087 dark|0.032832 red|0.032832 silver|0.030614 dark|0.030358 gray|0.030358 dark|0.030358 grey|0.030358 light|0.028372 gray|0.028372 light|0.028372 grey|0.028372 white|0.024439 smoke|0.024439 gainsboro|0.024097 sea|0.021613 shell|0.021613 ghost|0.021566 white|0.021566 snow|0.021472 alice|0.021285 blue|0.021285 white|0.02037 indian|0.019891 red|0.019891 lavender|0.019423 blush|0.019423 mint|0.019111 cream|0.019111 floral|0.018715 white|0.018715 azure|0.016915 light|0.015372 pink|0.015372 gray|0.015177 grey|0.015177 firebrick|0.0083168 linen|0.0062553 brown|0.005789  "
		}
	}
}
