{
	"add": {
		"doc": {
			"id": "3df98182f41d636bd05a38b949e415b06daba09000b4eca249f6ce288cc36940",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Pedro_II_of_Brazil_and_Count_of_Eu_1886.jpg/320px-Pedro_II_of_Brazil_and_Count_of_Eu_1886.jpg",
				"previous": "A serious problem began to become evident during the 1880s. This was a weakening of discipline within Brazil's military.[86] The older generation of officers were loyal to the monarchy, believed the military should be under civilian control, and had a great aversion to the militaristic caudillism against which they had earlier fought.[87] But these elders were no longer in control and many had since died, including the Duke of Caxias, the Count of Porto Alegre, the Marquis of Erval, and others.[88][89] It was accepted that military officers could participate in politics while staying on active duty. However, most did so as members of the Conservative Party and Liberal Party. This meant that their political careers were apt to come into conflict with their duty as officers to act in subordination to the civilian government, which could be in the hands of their political opponents. Earlier involvement in politics by members of the military had not threatened the stability of Brazil's institutions, due to pervasive loyalty to the monarchy and constitution. The conflict of interest in mixing military and political spheres became more obvious and threatening as support for the constitutional establishment eroded among some elements within the military, although neither the Emperor or government seem to have grasped the extent and implications of the increasing involvement of members of the military as political dissidents.[90] Until this point Brazilians, both civilians and military, shared a sense of pride in the nation's political stability and for having avoided the caudillos, coups, military dictatorships and rebellions that characterized neighboring countries.[90][91] Their perception of the superiority of the Brazilian political system was attributed to an established tradition of civilian control over the military. And the ministers who held the War and Navy portfolios in the cabinet were, with rare exceptions, civilians.[90]",
				"after": "1882 saw the first signs of insubordination among the army corps when a group of officers assassinated a journalist in broad daylight. He had published an article which they considered an offence to their honor. However, the participants were not subjected to punishment for this act.[92] Records from 1884 show that, out of a peacetime army of 13,500 men, more than 7,526 had been jailed for insubordination.[89][93][94] The military were badly paid, inadequately equipped, ill-instructed, and thinly spread across the vast Empire, often in small \"garrisons of 20, 10, 5 and even 2 men.\"[95] Most of the non-officer corps consisted of men recruited from the poor sertão (hinterland) in the northeast, and later from former slaves. These were volunteers seeking some means of subsistence, as there was no conscription. They were completely unprepared for the military life, had little education or concept of civic responsibility and government. A poor Brazilian from the northeast viewed his military commanders in the same light as he viewed the henchmen of the political bosses at home. An ex-slave would saw his harsh superior officer as differing little from his former owner and taskmasters. They had no means of understanding that they were being used to effect a coup, that their orders put them in rebellion against the Emperor, or that their actions would lead to a dictatorship. The average recruit blindly followed orders and hoped to avoid punishment by his superiors for any mistake.[96]",
			"color": "tan|0.10311 wheat|0.081484 old|0.053598 lace|0.053598 ivory|0.049648 linen|0.046723 beige|0.04626 floral|0.046193 white|0.046193 corn|0.044037 silk|0.044037 papaya|0.041245 whip|0.041245 antique|0.039438 white|0.039438 blanched|0.038611 almond|0.038611 sea|0.03776 shell|0.03776 burly|0.034638 wood|0.034638 light|0.034507 yellow|0.034507 moccasin|0.03153 mint|0.030948 cream|0.030948 bisque|0.030625 honeydew|0.030158 light|0.02804 golden|0.02804 rod|0.02804 yellow|0.02804 snow|0.026114 white|0.025826 lemon|0.023909 chiffon|0.023909 white|0.023314 smoke|0.023314 navajo|0.017977 white|0.017977 pale|0.0118 golden|0.0118 rod|0.0118 azure|0.0075664 peach|0.0044433 puff|0.0044433  "
		}
	}
}
