{
	"add": {
		"doc": {
			"id": "3e05724d71ea3fdd5b5b0ba4f95cff70b99baeab74800faa5bb3efdefd40d26c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Keplers_supernova.jpg/220px-Keplers_supernova.jpg",
			"previous": [],
				"after": "In October 1604, a bright new evening star (SN 1604) appeared, but Kepler did not believe the rumors until he saw it himself. Kepler began systematically observing the nova. Astrologically, the end of 1603 marked the beginning of a fiery trigon, the start of the ca. 800-year cycle of great conjunctions; astrologers associated the two previous such periods with the rise of Charlemagne (ca. 800 years earlier) and the birth of Christ (ca. 1600 years earlier), and thus expected events of great portent, especially regarding the emperor. It was in this context, as the imperial mathematician and astrologer to the emperor, that Kepler described the new star two years later in his De Stella Nova. In it, Kepler addressed the star's astronomical properties while taking a skeptical approach to the many astrological interpretations then circulating. He noted its fading luminosity, speculated about its origin, and used the lack of observed parallax to argue that it was in the sphere of fixed stars, further undermining the doctrine of the immutability of the heavens (the idea accepted since Aristotle that the celestial spheres were perfect and unchanging). The birth of a new star implied the variability of the heavens. In an appendix, Kepler also discussed the recent chronology work of the Polish historian Laurentius Suslyga; he calculated that, if Suslyga was correct that accepted timelines were four years behind, then the Star of Bethlehem—analogous to the present new star—would have coincided with the first great conjunction of the earlier 800-year cycle.[33]",
			"color": "black|0.55265 midnight|0.053382 blue|0.053382 dark|0.036818 slate|0.036818 gray|0.036818 dark|0.031786 slate|0.031786 blue|0.031786 navy|0.029004 dim|0.027355 gray|0.027355 dim|0.027355 grey|0.027355 dark|0.027243 blue|0.027243 steel|0.021806 blue|0.021806 plum|0.01757 brown|0.017256 slate|0.016641 gray|0.016641 light|0.015991 steel|0.015991 blue|0.015991 light|0.015257 slate|0.015257 gray|0.015257 indian|0.013272 red|0.013272 rosy|0.013251 brown|0.013251 gray|0.012371 grey|0.012371 thistle|0.0087153  "
		}
	}
}
