{
	"add": {
		"doc": {
			"id": "3e1808d85e1aed4f58fd4ebaeba456ee8e6f1e127561de527ec1167ec32b3e73",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/K2_black_panther3.jpg/220px-K2_black_panther3.jpg",
				"previous": "In addition to male conscription in South Korea's sovereign military, 1,800 Korean males are selected every year to serve 21 months in the KATUSA Program to further augment the United States Forces Korea (USFK).[138] In 2010, South Korea was spending ₩1.68 trillion in a cost-sharing agreement with the US to provide budgetary support to the US forces in Korea, on top of the ₩29.6 trillion budget for its own military.",
				"after": "The South Korean army has 2,500 tanks in operation, including the K1A1 and K2 Black Panther, which form the backbone of the South Korean army's mechanized armor and infantry forces. A sizable arsenal of many artillery systems, including 1,700 self-propelled K55 and K9 Thunder howitzers and 680 helicopters and UAVs of numerous types, are assembled to provide additional fire, reconnaissance, and logistics support. South Korea's smaller but more advanced artillery force and wide range of airborne reconnaissance platforms are pivotal in the counter-battery suppression of North Korea's large artillery force, which operates more than 13,000 artillery systems deployed in various state of fortification and mobility.[134][139]",
			"color": "dim|0.2196 gray|0.2196 dim|0.2196 grey|0.2196 black|0.2104 gray|0.12644 grey|0.12644 dark|0.059122 gray|0.059122 dark|0.059122 grey|0.059122 dark|0.048465 slate|0.048465 gray|0.048465 light|0.036218 steel|0.036218 blue|0.036218 light|0.032147 gray|0.032147 light|0.032147 grey|0.032147 gainsboro|0.030097 silver|0.029205 slate|0.027571 gray|0.027571 light|0.026741 slate|0.026741 gray|0.026741 light|0.021572 blue|0.021572 lavender|0.021025 alice|0.014788 blue|0.014788 white|0.011154 smoke|0.011154 ghost|0.010741 white|0.010741 azure|0.008992 mint|0.0073284 cream|0.0073284 white|0.0070356 snow|0.0070346  "
		}
	}
}
