{
	"add": {
		"doc": {
			"id": "3e308edd6153ff01f5dfccd1127a4a36df61b798e055371669ac8899c35be0f4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/AT_THE_JOHN_F._KENNEDY_AIRPORT_-_NARA_-_547951_-_color_adjusted.jpg/220px-AT_THE_JOHN_F._KENNEDY_AIRPORT_-_NARA_-_547951_-_color_adjusted.jpg",
				"previous": "In August 1953 PAA scheduled passenger flights to 106 airports; in May 1968 to 122 airports; in November 1978 to 65 airports (plus a few freight-only airports); in November 1985 to 98 airports; in November 1991 to 46 airports (plus 14 more that just got \"Pan Am Express\" prop flights).",
				"after": "Pan Am had invested in a large fleet of new Boeing 747s in the expectation that demand for air travel would continue to rise. This was not the case as the simultaneous introduction of a large number of these high-capacity aircraft by Pan Am and its principal competitors coincided with an economic slowdown. Reduced demand for air travel following the 1973 oil crisis made the airline industry's overcapacity problem worse, leaving Pan Am with its high overheads and fixed costs as a result of a large decentralized infrastructure in a vulnerable position. In addition, high jet fuel prices and the large number of older, less fuel-efficient narrowbodied airplanes in its fleet significantly increased the airline's operating costs. Federal route awards to other airlines, such as the Transpacific Route Case, further reduced the number of passengers Pan Am carried, as well as its profit margins.[10][58]",
			"color": "gray|0.22102 grey|0.22102 dim|0.16381 gray|0.16381 dim|0.16381 grey|0.16381 black|0.14625 dark|0.14304 gray|0.14304 dark|0.14304 grey|0.14304 silver|0.065838 light|0.045779 gray|0.045779 light|0.045779 grey|0.045779 gainsboro|0.035381 white|0.018249 smoke|0.018249 slate|0.016928 gray|0.016928 light|0.016552 slate|0.016552 gray|0.016552 sea|0.013868 shell|0.013868 snow|0.013133 mint|0.012552 cream|0.012552 white|0.011777 floral|0.011733 white|0.011733 alice|0.011424 blue|0.011424 ghost|0.011404 white|0.011404 azure|0.010666 linen|0.010425 lavender|0.0056643 blush|0.0056643 ivory|0.0044868  "
		}
	}
}
