{
	"add": {
		"doc": {
			"id": "3e3ae9c79bac7588beb4e1ebde83035b097368ce405c3fceed5c67fdcd124875",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Yanomami_Woman_%26_Child.jpg/220px-Yanomami_Woman_%26_Child.jpg",
			"previous": [],
				"after": "Within the human species, the greatest degree of genetic variation exists between males and females. While the nucleotide genetic variation of individuals of the same sex across global populations is no greater than 0.1%, the genetic difference between males and females is between 1% and 2%. Although different in nature[clarification needed], this approaches the genetic differentiation between men and male chimpanzees or women and female chimpanzees. The genetic difference between sexes contributes to anatomical, hormonal, neural, and physiological differences between men and women, although the exact degree and nature of social and environmental influences on sexes are not completely understood. Males on average are 15% heavier and 15 cm taller than females. There is a difference between body types, body organs and systems, hormonal levels, sensory systems, and muscle mass between sexes. On average, there is a difference of about 40–50% in upper body strength and 20–30% in lower body strength between men and women. Women generally have a higher body fat percentage than men. Women have lighter skin than men of the same population; this has been explained by a higher need for vitamin D (which is synthesized by sunlight) in females during pregnancy and lactation. As there are chromosomal differences between females and males, some X and Y chromosome related conditions and disorders only affect either men or women. Other conditional differences between males and females are not related to sex chromosomes. Even after allowing for body weight and volume, the male voice is usually an octave deeper than females'. Women have a longer life span in almost every population around the world.[141][142][143][144][145][146][147][148][149]",
			"color": "dark|0.2448 salmon|0.2448 rosy|0.22523 brown|0.22523 gray|0.053361 grey|0.053361 dark|0.050839 gray|0.050839 dark|0.050839 grey|0.050839 light|0.048317 coral|0.048317 indian|0.042117 red|0.042117 dim|0.034561 gray|0.034561 dim|0.034561 grey|0.034561 salmon|0.026832 misty|0.024176 rose|0.024176 silver|0.022538 sienna|0.0196 light|0.015315 pink|0.015315 cadet|0.013887 blue|0.013887 pink|0.012641  "
		}
	}
}
