{
	"add": {
		"doc": {
			"id": "3e5e1404fc435567a501f132f313f93bf3dcd755163bfdd5f752dd0b19cecc73",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Philharmonic_Hall_Liverpool.jpg/220px-Philharmonic_Hall_Liverpool.jpg",
				"previous": "Liverpool is internationally known for music and is recognised by Guinness World Records as the World Capital City of Pop.[192] Musicians from the city have produced 56 number one singles, more than any other city in the world.[193][194] Both the most successful male band and girl group in global music history have contained Liverpudlian members. Liverpool is most famous as the birthplace of The Beatles and during the 1960s was at the forefront of the Beat Music movement, which would eventually lead to the British Invasion. Many notable musicians of the time originated in the city including Billy J Kramer, Cilla Black, Gerry and the Pacemakers and The Searchers. The influence of musicians from Liverpool, coupled with other cultural exploits of the time, such as the Liverpool poets, prompted American poet Allen Ginsberg to proclaim that the city was \"the centre of consciousness of the human universe\".[195] Other musicians from Liverpool include Billy Fury, A Flock of Seagulls, Echo and the Bunnymen, Frankie Goes to Hollywood, Frankie Vaughan and more recently Anathema, Ladytron, The Zutons, Atomic Kitten, Heidi Range and Rebecca Ferguson. Elvis Costello, whose mother is from Liverpool, moved to Birkenhead aged 17 and formed his first band.",
				"after": "The city is also home to the oldest surviving professional symphony orchestra in the UK, the Royal Liverpool Philharmonic Orchestra, which is based in the Philharmonic Hall.[196] The chief conductor of the orchestra is Vasily Petrenko.[197] Sir Edward Elgar dedicated his famous Pomp and Circumstance March No. 1 to the Liverpool Orchestral Society, and the piece had its first performance in the city in 1901.[198] Among Liverpool's curiosities, the Austrian émigré Fritz Spiegl is notable. He not only became a world expert on the etymology of Scouse, but composed the music to Z-cars and the Radio 4 UK Theme.",
			"color": "black|0.29543 dim|0.25843 gray|0.25843 dim|0.25843 grey|0.25843 gray|0.18259 grey|0.18259 dark|0.068603 gray|0.068603 dark|0.068603 grey|0.068603 silver|0.056938 slate|0.03761 gray|0.03761 light|0.031254 gray|0.031254 light|0.031254 grey|0.031254 light|0.02411 slate|0.02411 gray|0.02411 gainsboro|0.020373  "
		}
	}
}
