{
	"add": {
		"doc": {
			"id": "3e69f4d63a2ec5448972f82cdf5f1b9f080d698ab9f75479c9a9118fd083852a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Attack_on_carrier_USS_Franklin_19_March_1945.jpg/220px-Attack_on_carrier_USS_Franklin_19_March_1945.jpg",
				"previous": "The development of flattop vessels produced the first large fleet ships. In 1918, HMS Argus became the world's first carrier capable of launching and recovering naval aircraft.[13] As a result of the Washington Naval Treaty of 1922, which limited the construction of new heavy surface combat ships, most early aircraft carriers were conversions of ships that were laid down (or had served) as different ship types: cargo ships, cruisers, battle cruisers, or battleships. These conversions gave rise to Lexington-class aircraft carriers (1927), Akagi and Courageous-class. Specialist carrier evolution was well underway, with several navies ordering and building warships that were purposefully designed to function as aircraft carriers by the mid-1920s, resulting in the commissioning of ships such as Hōshō (1922), HMS Hermes (1924), and Béarn (1927). During World War II, these ships would become the backbone of the carrier forces of the United States, British, and Japanese navies, known as fleet carriers.",
				"after": "The aircraft carrier dramatically changed naval combat in World War II, because air power was becoming a significant factor in warfare. The advent of aircraft as focal weapons was driven by the superior range, flexibility and effectiveness of carrier-launched aircraft. They had higher range and precision than naval guns, making them highly effective. The versatility of the carrier was demonstrated in November 1940 when HMS Illustrious launched a long-range strike on the Italian fleet at their base in Taranto, signalling the beginning of the effective and highly mobile aircraft strikes. This operation incapacitated three of the six battleships at a cost of two torpedo bombers. World War II in the Pacific Ocean involved clashes between aircraft carrier fleets. The 1941 Japanese surprise attack on Pearl Harbor was a clear illustration of the power projection capability afforded by a large force of modern carriers. Concentrating six carriers in a single unit turned naval history about, as no other nation had fielded anything comparable. However, the vulnerability of carriers compared to traditional battleships when forced into a gun-range encounter was quickly illustrated by the sinking of HMS Glorious by German battle cruisers during the Norwegian campaign in 1940.",
			"color": " "
		}
	}
}
