{
	"add": {
		"doc": {
			"id": "3e6b849bcfd641345a0d0c604d5705463244f8b7d84c34d10bd550f9c7174f4e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/ObamaYouTubers307.png/250px-ObamaYouTubers307.png",
				"previous": "YouTube has enabled people to more directly engage with government, such as in the CNN/YouTube presidential debates (2007) in which ordinary people submitted questions to U.S. presidential candidates via YouTube video, with a techPresident co-founder saying that Internet video was changing the political landscape.[196] Describing the Arab Spring (2010- ), sociologist Philip N. Howard quoted an activist's succinct description that organizing the political unrest involved using \"Facebook to schedule the protests, Twitter to coordinate, and YouTube to tell the world.\"[197] In 2012, more than a third of the U.S. Senate introduced a resolution condemning Joseph Kony 16 days after the \"Kony 2012\" video was posted to YouTube, with resolution co-sponsor Senator Lindsey Graham remarking that the video \"will do more to lead to (Kony's) demise than all other action combined.\"[198]",
				"after": "Conversely, YouTube has also allowed government to more easily engage with citizens, the White House's official YouTube channel being the seventh top news organization producer on YouTube in 2012[201] and in 2013 a healthcare exchange commissioned Obama impersonator Iman Crosson's YouTube music video spoof to encourage young Americans to enroll in the Affordable Care Act (Obamacare)-compliant health insurance.[202] In February 2014, U.S. President Obama held a meeting at the White House with leading YouTube content creators to not only promote awareness of Obamacare[203] but more generally to develop ways for government to better connect with the \"YouTube Generation\".[199] Whereas YouTube's inherent ability to allow presidents to directly connect with average citizens was noted, the YouTube content creators' new media savvy was perceived necessary to better cope with the website's distracting content and fickle audience.[199]",
			"color": "black|0.63558 dim|0.087508 gray|0.087508 dim|0.087508 grey|0.087508 gray|0.043388 grey|0.043388 dark|0.031493 gray|0.031493 dark|0.031493 grey|0.031493 tan|0.030304 brown|0.024941 burly|0.019872 wood|0.019872 dark|0.019343 salmon|0.019343 silver|0.015938 dark|0.0098731 khaki|0.0098731 wheat|0.0093827  "
		}
	}
}
