{
	"add": {
		"doc": {
			"id": "3e8339362a190497aec47177a7f816751e85c46d4727a57714871b90702c12b6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/STS-135_Atlantis_rollout_1.jpg/220px-STS-135_Atlantis_rollout_1.jpg",
				"previous": "Xenon is used in light-emitting devices called xenon flash lamps, which are used in photographic flashes and stroboscopic lamps;[16] to excite the active medium in lasers which then generate coherent light;[120] and, occasionally, in bactericidal lamps.[121] The first solid-state laser, invented in 1960, was pumped by a xenon flash lamp,[20] and lasers used to power inertial confinement fusion are also pumped by xenon flash lamps.[122]",
				"after": "Continuous, short-arc, high pressure xenon arc lamps have a color temperature closely approximating noon sunlight and are used in solar simulators. That is, the chromaticity of these lamps closely approximates a heated black body radiator that has a temperature close to that observed from the Sun. After they were first introduced during the 1940s, these lamps began replacing the shorter-lived carbon arc lamps in movie projectors.[17] They are employed in typical 35mm, IMAX and the new digital projectors film projection systems, automotive HID headlights, high-end \"tactical\" flashlights and other specialized uses. These arc lamps are an excellent source of short wavelength ultraviolet radiation and they have intense emissions in the near infrared, which is used in some night vision systems.",
			"color": "black|0.70522 dim|0.037315 gray|0.037315 dim|0.037315 grey|0.037315 gray|0.028562 grey|0.028562 dark|0.027383 gray|0.027383 dark|0.027383 grey|0.027383 silver|0.019667 light|0.019103 gray|0.019103 light|0.019103 grey|0.019103 gainsboro|0.017077 white|0.01332 smoke|0.01332 sea|0.012534 shell|0.012534 linen|0.011667 snow|0.011246 floral|0.010988 white|0.010988 white|0.0095591 mint|0.0089451 cream|0.0089451 ghost|0.0086182 white|0.0086182 lavender|0.0065458 blush|0.0065458 saddle|0.0060578 brown|0.0060578 alice|0.0058367 blue|0.0058367 old|0.0055198 lace|0.0055198 azure|0.0054549 ivory|0.0054158  "
		}
	}
}
