{
	"add": {
		"doc": {
			"id": "3e83a285d53d7f56b4eec760c91c06ac399333d11819a4b5fa2de8ce787e5150",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Government_Buildings_Llanishen_Cardiff.JPG/220px-Government_Buildings_Llanishen_Cardiff.JPG",
				"previous": "\"Inner Cardiff\" consists of the following wards: Plasnewydd, Gabalfa, Roath, Cathays, Adamsdown and Splott ward on the north and east of the city centre, and Butetown, Grangetown, Riverside and Canton to the south and west.[64] The inner-city areas to the south of the A4161 road (known as the \"Southern Arc\") are, with the exception of Cardiff Bay, some of the poorest districts of Wales with low levels of economic activity.[65] On the other hand Gabalfa, Plasnewydd and Cathays north of the 'arc' have very large student populations,[66] and Pontcanna (situated north of Riverside and alongside Canton) is a favourite for students and young professionals. Penylan, which lies to the north east side of Roath Park, is an affluent area popular with those with older children and the retired.",
				"after": "To the west lie Ely, Caerau and Fairwater which contain some of the largest housing estates in the United Kingdom. With the exception of some of the outlying privately built estates at Michaelston Super Ely and 1930s developments near Waun-Gron Road, this is an economically disadvantaged area with high numbers of unemployed households. Culverhouse Cross is a more affluent western area of the city. Heath, Birchgrove, Gabalfa, Mynachdy, Llandaff North, Llandaff, Llanishen, Radyr, Whitchurch & Tongwynlais, Rhiwbina, Thornhill, Lisvane and Cyncoed lie in an arc from the north west to the north east of the centre. In particular, Lisvane, Cyncoed, Radyr and Rhiwbina contain some of the most expensive housing in Wales. Further to the east lie the wards of Pontprennau & Old St Mellons, Rumney, Pentwyn, Llanrumney and Trowbridge. The latter three are again largely of public housing stock, although new private housing is being built in Trowbridge in considerable number. Pontprennau is the newest 'suburb' of Cardiff, whilst Old St Mellons has a history going back to the Norman Conquest in the 11th century.[67] To the north west of the city lies a region that may be called \"Rural Cardiff\" containing the villages of St. Fagans, Creigiau, Pentyrch, Tongwynlais and Gwaelod-y-garth.[68] St. Fagans, home to the Museum of Welsh Life, is protected from further development.[69]",
			"color": "dim|0.21977 gray|0.21977 dim|0.21977 grey|0.21977 dark|0.21939 gray|0.21939 dark|0.21939 grey|0.21939 gray|0.1883 grey|0.1883 silver|0.11959 slate|0.070594 gray|0.070594 light|0.049556 slate|0.049556 gray|0.049556 light|0.042996 gray|0.042996 light|0.042996 grey|0.042996 gainsboro|0.024708 white|0.0075305 smoke|0.0075305 snow|0.0049237 ghost|0.0049025 white|0.0049025 sea|0.0048829 shell|0.0048829 alice|0.0048614 blue|0.0048614 dark|0.0047206 slate|0.0047206 gray|0.0047206 mint|0.0044226 cream|0.0044226 white|0.0042431 linen|0.0041788  "
		}
	}
}
