{
	"add": {
		"doc": {
			"id": "3e8b572a03ec2512db3278e5d91f1a59c86081774903b4906a957fc2afa64ec1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/GodfreyKneller-IsaacNewton-1689.jpg/220px-GodfreyKneller-IsaacNewton-1689.jpg",
				"previous": "The scientific method seeks to explain the events of nature in a reproducible way.[57] An explanatory thought experiment or hypothesis is put forward, as explanation, using principles such as parsimony (also known as \"Occam's Razor\") and are generally expected to seek consilience—fitting well with other accepted facts related to the phenomena.[58] This new explanation is used to make falsifiable predictions that are testable by experiment or observation. The predictions are to be posted before a confirming experiment or observation is sought, as proof that no tampering has occurred. Disproof of a prediction is evidence of progress.[59][60] This is done partly through observation of natural phenomena, but also through experimentation, that tries to simulate natural events under controlled conditions, as appropriate to the discipline (in the observational sciences, such as astronomy or geology, a predicted observation might take the place of a controlled experiment). Experimentation is especially important in science to help establish causal relationships (to avoid the correlation fallacy).",
				"after": "When a hypothesis proves unsatisfactory, it is either modified or discarded.[61] If the hypothesis survived testing, it may become adopted into the framework of a scientific theory. This is a logically reasoned, self-consistent model or framework for describing the behavior of certain natural phenomena. A theory typically describes the behavior of much broader sets of phenomena than a hypothesis; commonly, a large number of hypotheses can be logically bound together by a single theory. Thus a theory is a hypothesis explaining various other hypotheses. In that vein, theories are formulated according to most of the same scientific principles as hypotheses. In addition to testing hypotheses, scientists may also generate a model based on observed phenomena. This is an attempt to describe or depict the phenomenon in terms of a logical, physical or mathematical representation and to generate new hypotheses that can be tested.[62]",
			"color": "black|0.73675 sandy|0.10296 brown|0.10296 burly|0.049668 wood|0.049668 peru|0.029572 sienna|0.028968 tan|0.022742  "
		}
	}
}
