{
	"add": {
		"doc": {
			"id": "3ead0e85832700c6468af67bf874896c2bc559574f8693e9f6572b4c0d12a0fd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Reliefmap_of_Australia.png/220px-Reliefmap_of_Australia.png",
				"previous": "Eastern Australia is marked by the Great Dividing Range, which runs parallel to the coast of Queensland, New South Wales and much of Victoria. The name is not strictly accurate, because parts of the range consist of low hills, and the highlands are typically no more than 1,600 metres (5,249 ft) in height.[149] The coastal uplands and a belt of Brigalow grasslands lie between the coast and the mountains, while inland of the dividing range are large areas of grassland.[149][150] These include the western plains of New South Wales, and the Einasleigh Uplands, Barkly Tableland, and Mulga Lands of inland Queensland. The northernmost point of the east coast is the tropical-rainforested Cape York Peninsula.[151][152][153][154]",
				"after": "The landscapes of the Top End and the Gulf Country—with their tropical climate—include forest, woodland, wetland, grassland, rainforest and desert.[155][156][157] At the north-west corner of the continent are the sandstone cliffs and gorges of The Kimberley, and below that the Pilbara. To the south of these and inland, lie more areas of grassland: the Ord Victoria Plain and the Western Australian Mulga shrublands.[158][159][160] At the heart of the country are the uplands of central Australia. Prominent features of the centre and south include Uluru (also known as Ayers Rock), the famous sandstone monolith, and the inland Simpson, Tirari and Sturt Stony, Gibson, Great Sandy, Tanami, and Great Victoria deserts, with the famous Nullarbor Plain on the southern coast.[161][162][163][164]",
			"color": "khaki|0.45515 dark|0.32448 khaki|0.32448 sea|0.089693 green|0.089693 dark|0.038553 sea|0.038553 green|0.038553 pale|0.022098 golden|0.022098 rod|0.022098 cadet|0.020687 blue|0.020687 peru|0.016492  "
		}
	}
}
