{
	"add": {
		"doc": {
			"id": "3ec19086c621f67549e6dc8ac11e64f4b7399d417b4ce2742838e5645cff3d79",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Lanpher_Furs_Auto_Coat_Raccoon_S71.jpg/170px-Lanpher_Furs_Auto_Coat_Raccoon_S71.jpg",
				"previous": "The fur of raccoons is used for clothing, especially for coats and coonskin caps. At present, it is the material used for the inaccurately named \"sealskin\" cap worn by the Royal Fusiliers of Great Britain.[238] Historically, Native American tribes not only used the fur for winter clothing, but also used the tails for ornament.[239] The famous Sioux leader Spotted Tail took his name from a raccoon skin hat with the tail attached he acquired from a fur trader. Since the late 18th century, various types of scent hounds, called \"coonhounds\", which are able to tree animals have been bred in the United States.[240] In the 19th century, when coonskins occasionally even served as means of payment, several thousand raccoons were killed each year in the United States.[241] This number rose quickly when automobile coats became popular after the turn of the 20th century. In the 1920s, wearing a raccoon coat was regarded as status symbol among college students.[242] Attempts to breed raccoons in fur farms in the 1920s and 1930s in North America and Europe turned out not to be profitable, and farming was abandoned after prices for long-haired pelts dropped in the 1940s.[243][244] Although raccoons had become rare in the 1930s, at least 388,000 were killed during the hunting season of 1934/35.[245]",
				"after": "After persistent population increases began in the 1940s, the seasonal hunt reached about one million animals in 1946/47 and two million in 1962/63.[246] The broadcast of three television episodes about the frontiersman Davy Crockett and the film Davy Crockett, King of the Wild Frontier in 1954 and 1955 led to a high demand for coonskin caps in the United States, although it is unlikely either Crockett or the actor who played him, Fess Parker, actually wore a cap made from raccoon fur.[247] The seasonal hunt reached an all-time high with 5.2 million animals in 1976/77 and ranged between 3.2 and 4.7 million for most of the 1980s. In 1982, the average pelt price was $20.[248] As of 1987, the raccoon was identified as the most important wild furbearer in North America in terms of revenue.[249] In the first half of the 1990s, the seasonal hunt dropped to 0.9 from 1.9 million due to decreasing pelt prices.[250]",
			"color": "gray|0.32565 grey|0.32565 dim|0.28168 gray|0.28168 dim|0.28168 grey|0.28168 dark|0.22679 gray|0.22679 dark|0.22679 grey|0.22679 silver|0.11347 light|0.023389 gray|0.023389 light|0.023389 grey|0.023389 black|0.017658 gainsboro|0.0078141  "
		}
	}
}
