{
	"add": {
		"doc": {
			"id": "3eecfe299d6854a4ece28b87521807726aaf212c78435eeeb1d494b12387c796",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Shishkin_na_severe_dikom1.jpg/170px-Shishkin_na_severe_dikom1.jpg",
				"previous": "During the 1930s, Friedrich's work was used in the promotion of Nazi ideology,[90] which attempted to fit the Romantic artist within the nationalistic Blut und Boden.[7] It took decades for Friedrich's reputation to recover from this association with Nazism. His reliance on symbolism and the fact that his work fell outside the narrow definitions of modernism contributed to his fall from favour. In 1949, art historian Kenneth Clark wrote that Friedrich \"worked in the frigid technique of his time, which could hardly inspire a school of modern painting\", and suggested that the artist was trying to express in painting what is best left to poetry.[88][91] Clark's dismissal of Friedrich reflected the damage the artist's reputation sustained during the late 1930s.[88]",
				"after": "Friedrich's reputation suffered further damage when his imagery was adopted by a number of Hollywood directors, such as Walt Disney, built on the work of such German cinema masters as Fritz Lang and F. W. Murnau, within the horror and fantasy genres.[92] His rehabilitation was slow, but enhanced through the writings of such critics and scholars as Werner Hofmann, Helmut Börsch-Supan and Sigrid Hinz, who successfully rejected and rebutted the political associations ascribed to his work, and placed it within a purely art-historical context.[92] By the 1970s, he was again being exhibited in major galleries across the world, as he found favour with a new generation of critics and art historians.",
			"color": "black|0.42956 dark|0.22555 slate|0.22555 gray|0.22555 cadet|0.10836 blue|0.10836 dark|0.059596 sea|0.059596 green|0.059596 honeydew|0.03399 beige|0.024404 ivory|0.015316 light|0.012131 yellow|0.012131 mint|0.01093 cream|0.01093 old|0.010914 lace|0.010914 floral|0.010104 white|0.010104 corn|0.0082154 silk|0.0082154  "
		}
	}
}
