{
	"add": {
		"doc": {
			"id": "3eec1f745a8e8cdfa03074d429ff5b5752512ddc0a2e0a41889def0dbabf394f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Quehanna_Wild_Area_Still.jpg/220px-Quehanna_Wild_Area_Still.jpg",
				"previous": "Other animals became locally extinct through overhunting. The last elk in Pennsylvania was killed in Elk County in 1867. The Pennsylvania Game Commission brought 177 animals from the Rocky Mountains to the state from 1913 to 1926; today the elk herd of over 600 animals can often be seen in Quehanna Wild Area.[67] Between 1906 and 1925, Pennsylvania became so concerned about declining numbers of white-tailed deer that it imported nearly 1,200 animals from Michigan to re-establish the species, and made it the official state animal in 1959.[101] In the early 21st century, over-grazing by deer threatens plant diversity.[72] By the early 20th century, the fisher, a small mammal similar to the European polecat or American marten, was hunted to extinction in Pennsylvania. Between 1994 and 1998, 190 animals were released in five sites in the northern part of the state, including 23 animals along Quehanna's Wykoff Run in 1995. Breeding populations of fisher appear to have been reestablished.[102]",
				"after": "Still other animals seem to thrive regardless of the maturity of the forest or the presence of the understory. Common animals found in Quehanna include chipmunks, porcupine, and beaver, omnivores such as the black bear and raccoon, and predators like bobcat, red fox, and coyote (which has been in Pennsylvania since the 1930s). Many of the streams in Quehanna Wild Area are known for trout (brook, brown and rainbow); some populations are wild and others are stocked by the Pennsylvania Fish and Boat Commission and Mosquito Creek Sportsmen's Association. The wild area is also home to timber rattlesnake, eastern garter snake, and spring peeper (a type of frog), as well as butterflies like great spangled fritillary, monarch, red-spotted purple, and black, eastern tiger, and spicebush swallowtails. Any of these mammals, especially the white-tailed deer, can carry ticks, and such tick-born diseases as Lyme disease are a health concern for hikers.[67][100][103][104][105]",
			"color": "steel|0.31957 blue|0.31957 black|0.0965 light|0.076596 steel|0.076596 blue|0.076596 saddle|0.065881 brown|0.065881 light|0.060312 blue|0.060312 sienna|0.048737 light|0.03399 slate|0.03399 gray|0.03399 dim|0.029185 gray|0.029185 dim|0.029185 grey|0.029185 peru|0.028541 slate|0.025635 gray|0.025635 dark|0.025164 gray|0.025164 dark|0.025164 grey|0.025164 light|0.025118 gray|0.025118 light|0.025118 grey|0.025118 gray|0.023373 grey|0.023373 silver|0.020126 chocolate|0.019871 gainsboro|0.019121 powder|0.018053 blue|0.018053  "
		}
	}
}
