{
	"add": {
		"doc": {
			"id": "3f1db0353bdff8bf61b4e32d84bdd37f3dab60dcc8c37666ffcd1ded513dd66c",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/2e/Castle_on_the_Hill%2C_Baltimore_City_College_%28July_2007%29.jpg/220px-Castle_on_the_Hill%2C_Baltimore_City_College_%28July_2007%29.jpg",
				"previous": "In addition to the academic resurgence of the school, the building was recognized for its historical and architectural interest. The Castle on the Hill was honored in 2003 by being placed on the National Register of Historic Places.[60][61][62] This designation coincided with the 75th anniversary of the structure and campus as well as City College's 165th year of existence. On April 24, 2007 it earned the additional distinction of being listed as a Baltimore City Landmark. Mayor Sheila Dixon stated that: \"The castle on the hill, as City College is known, is truly a historic landmark. It is worthy of preservation and acknowledgment.\"[62]",
				"after": "The landmark status bill was passed by the city council in accordance with a recommendation made by the council's staff, which found that the building dates from a historic and architecturally significant period. This new status prevents the building's exterior from being altered without the approval of the city's Commission for Historical and Architectural Preservation.[62] However, the previous year City College was a victim of vandalism at the hands of a group of children ranging in age from 8 to 15, as a renovation of the school neared completion.[63] In the summer of 2007, scenes from the 2008 sequel Step Up 2 were filmed at City College.[64] Interior and campus shots were used to form the fictional Maryland School for the Arts.",
			"color": "black|0.52488 dim|0.12555 gray|0.12555 dim|0.12555 grey|0.12555 dark|0.1158 slate|0.1158 gray|0.1158 slate|0.098841 gray|0.098841 light|0.070588 slate|0.070588 gray|0.070588 gray|0.04767 grey|0.04767 dark|0.014356 gray|0.014356 dark|0.014356 grey|0.014356  "
		}
	}
}
