{
	"add": {
		"doc": {
			"id": "3f3ee195878ee2ab70058b071c741d9e38cbc0a72fccd35b205ea52a6c003597",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Lion_dancers_at_the_Auckland_lantern_festival_2010.jpg/220px-Lion_dancers_at_the_Auckland_lantern_festival_2010.jpg",
				"previous": "While the demonym for a New Zealand citizen is New Zealander, the informal \"Kiwi\" is commonly used both internationally[240] and by locals.[241] The Māori loanword Pākehā has been used to refer to New Zealanders of European descent, although others reject this appellation.[242][243] The word Pākehā today is increasingly used to refer to all non-Polynesian New Zealanders.[244]",
				"after": "The Māori were the first people to reach New Zealand, followed by the early European settlers. Following colonisation, immigrants were predominantly from Britain, Ireland and Australia because of restrictive policies similar to the white Australian policies.[245] There was also significant Dutch, Dalmatian,[246] Italian, and German immigration, together with indirect European immigration through Australia, North America, South America and South Africa.[247] Following the Great Depression policies were relaxed and migrant diversity increased. In 2009–10, an annual target of 45,000–50,000 permanent residence approvals was set by the New Zealand Immigration Service—more than one new migrant for every 100 New Zealand residents.[248] Just over 25% of New Zealand's population was born overseas, with the majority (52%) living in the Auckland region. In the late 2000s, Asia overtook the UK and Ireland as the largest source of overseas migrants; at the 2013 census, 31.6% of overseas-born New Zealand residents were born in Asia (mainly China, India, the Philippines and South Korea), while 26.5% were born in the UK and Ireland. Australia, the Pacific Islands, and South Africa are also significant sources of migrants.[249] The number of fee-paying international students increased sharply in the late 1990s, with more than 20,000 studying in public tertiary institutions in 2002.[250]",
			"color": "black|0.30274 pale|0.072514 violet|0.072514 red|0.072514 brown|0.063326 tan|0.063015 dim|0.050392 gray|0.050392 dim|0.050392 grey|0.050392 thistle|0.041556 gray|0.03486 grey|0.03486 rosy|0.030854 brown|0.030854 burly|0.021394 wood|0.021394 dark|0.021117 gray|0.021117 dark|0.021117 grey|0.021117  "
		}
	}
}
