{
	"add": {
		"doc": {
			"id": "3f4b869e673e0e8a2d919eea212a2ffdf432ff07d12d6b7d3a3c3bb24cbb7447",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Ngo_Dinh_Diem_-_Thumbnail_-_ARC_542189.png/220px-Ngo_Dinh_Diem_-_Thumbnail_-_ARC_542189.png",
			"previous": [],
				"after": "The program had some loose ends that manifested themselves later. Many refugees were not economically integrated and lived from government handouts. Critics noted that the refugees had become a special interest group that fostered resentment. The COMIGAL officials often decided not to split up refugees belonging to the same village, hoping to maintain social continuity.[83] In some cases, Catholic priests refused to obey government directives to settle in certain areas.[84] Many of the refugees also refused to relocate from the camps on the outskirts of the capital, wanting to live an urban lifestyle,[85] and objecting to Diem's desire that they help developed inhospitable frontier territory where disease was more common and the economy less developed.[86] On occasions, the reluctance to disperse away from Saigon resulted in protests outside Diem's residence.[87] Many Catholic villages were effectively transplanted into southern territory. This was efficient in the short run but meant that they would never assimilate into southern society. They had little contact with the Buddhist majority and often held them in contempt, sometimes flying the Vatican flag instead of the national flag.[88] Peter Hansen, an Australian Catholic priest and academic scholar of religion, has added that tensions between northern and southern Catholics were also present, due to issues of regionalism and local traditions. Hansen also said that northern Catholics took a more defensive attitude towards other religions than their southern co-religionists, and were more likely to see non-Catholics as a threat. He further noted that northern Catholics had a more theocratic outlook in that they were more willing to listen to the advice of priests on a wide range of issues, not only spiritual and ecclesiastical matters.[89] These differences and the sense of segregation persist to the current day.[90]",
			"color": " "
		}
	}
}
