{
	"add": {
		"doc": {
			"id": "3f4fb5814ee5950b326341c48c76dd4376b72870aa65e44822e4fe266c4e0211",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/I-5_South_Sign_San_Diego.jpg/220px-I-5_South_Sign_San_Diego.jpg",
				"previous": "Interstate 5 begins at the San Ysidro Port of Entry from Mexico in the San Ysidro neighborhood of San Diego. Immediately after the border, I-805 splits off to the northeast and serves as a bypass of I-5 that avoids the downtown San Diego area. I-5 itself continues northwest and intersects with the western end of the SR 905 freeway, a route that connects with the Otay Mesa border crossing. I-5 then continues northward and joins the southern end of SR 75, a highway connecting to Coronado via the Silver Strand. I-5 then enters Chula Vista, briefly leaving the San Diego city limits. It continues along the east side of San Diego Bay where it intersects with SR 54 and enters National City. From there, I-5 veers around the San Diego Naval Base and reenters the city limits of San Diego. I-5 subsequently interchanges with four state routes — SR 15 (the southern end of the extension of I-15), SR 75 and the Coronado Bay Bridge, the western end of SR 94, and the southern end of SR 163. In addition to serving downtown San Diego, I-5 also provides access to Balboa Park from the Pershing Drive exit.[8][9] The portion of I-5 from the border to downtown San Diego is named the \"Montgomery Freeway\" in honor of John J. Montgomery, a pioneer aviator who flew a glider from a location near Chula Vista in 1884.[10]",
				"after": "After leaving downtown, I-5 continues northwest until it reaches its junction with I-8, then turns slightly to the north while passing near SeaWorld and Mission Bay. Thereafter, I-5 interchanges with the western end of SR 52 before passing through the UC San Diego campus in University City near La Jolla. At Nobel Drive (exit 28A), the San Diego LDS Temple towers over I-5.[11] Shortly afterward, I-5 interchanges with the northern terminus of I-805 before continuing north and interchanging with the western end of SR 56. At this interchange, there is a recently completed local bypass that provides the only access to Carmel Mountain Road from both directions and provides the only access to SR 56 going northbound.[8]",
			"color": "dim|0.28464 gray|0.28464 dim|0.28464 grey|0.28464 teal|0.14736 gray|0.077647 grey|0.077647 gainsboro|0.058816 light|0.044315 gray|0.044315 light|0.044315 grey|0.044315 dark|0.042865 slate|0.042865 gray|0.042865 black|0.040965 white|0.038715 smoke|0.038715 mint|0.03208 cream|0.03208 dark|0.030122 gray|0.030122 dark|0.030122 grey|0.030122 azure|0.028832 honeydew|0.027707 silver|0.020726 light|0.019263 cyan|0.019263 alice|0.01686 blue|0.01686 linen|0.013346 slate|0.012574 gray|0.012574 cadet|0.011236 blue|0.011236 light|0.0076622 slate|0.0076622 gray|0.0076622 floral|0.0065785 white|0.0065785  "
		}
	}
}
