{
	"add": {
		"doc": {
			"id": "3f55e208d9e5e3ff78329065193d86bbc1a7c06cecdad50b34b7d6b4bcb4fb82",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Jared_Leto%2C_2013_SXSW.jpg/170px-Jared_Leto%2C_2013_SXSW.jpg",
				"previous": "Leto described the concept of his next short film, \"Do or Die\" (2013), as a companion piece to \"Closer to the Edge\" (2010).[91] It was filmed during the Love, Lust, Faith and Dreams Tour and features live footage of Thirty Seconds to Mars onstage as well as fan commentary. The same year, Leto directed the critically praised short film for \"City of Angels\", which premiered on October 12, 2013 at the Hollywood Bowl. The music video features a number of celebrities who join the three members of Thirty Seconds to Mars in sharing their visions about Los Angeles.[92] Multiple monoliths and murals, including Michael Jackson and Marilyn Monroe impersonators, also appear, as well as homeless people hired by Leto himself for the video.[93]",
				"after": "After a five years hiatus from filming, Leto returned to act in the drama Dallas Buyers Club (2013), directed by Jean-Marc Vallée and co-starring Matthew McConaughey. Leto portrayed Rayon, a drug-addicted transgender woman with AIDS who befriends McConaughey's character Ron Woodroof. In order to accurately portray his role, Leto lost 30 pounds, shaved his eyebrows and waxed his entire body.[94] He stated the portrayal was grounded in his meeting transgender people while researching the role.[95] During filming, Leto refused to break character.[94] Dallas Buyers Club received widespread critical acclaim and became a financial success, resulting in various accolades for Leto, who was awarded the Academy Award for Best Supporting Actor, Golden Globe Award for Best Supporting Actor – Motion Picture, Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role and a variety of film critics' circle awards for the role.[96]",
			"color": "black|0.39924 silver|0.071574 light|0.068676 gray|0.068676 light|0.068676 grey|0.068676 dark|0.063513 gray|0.063513 dark|0.063513 grey|0.063513 gainsboro|0.057754 dim|0.044663 gray|0.044663 dim|0.044663 grey|0.044663 lavender|0.034807 gray|0.029183 grey|0.029183 rosy|0.024625 brown|0.024625 indian|0.021375 red|0.021375 white|0.01644 smoke|0.01644 misty|0.016052 rose|0.016052 alice|0.013753 blue|0.013753 ghost|0.012946 white|0.012946 lavender|0.012866 blush|0.012866 pink|0.012617 light|0.010082 steel|0.010082 blue|0.010082 light|0.0097437 coral|0.0097437 snow|0.008251 light|0.0080538 pink|0.0080538 light|0.0070157 slate|0.0070157 gray|0.0070157 white|0.0060207 slate|0.0056299 gray|0.0056299 sea|0.005523 shell|0.005523  "
		}
	}
}
