{
	"add": {
		"doc": {
			"id": "3f5a6dda4b0245752b0e43679f443983a505b49cb0ebfda2ba1c2a221d343879",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Woman-power_emblem.svg/100px-Woman-power_emblem.svg.png",
				"previous": "This was paralleled in the 1970s by French feminists, who developed the concept of écriture féminine (which translates as 'female or feminine writing').[70] Helene Cixous argues that writing and philosophy are phallocentric and along with other French feminists such as Luce Irigaray emphasize \"writing from the body\" as a subversive exercise.[70] The work of Julia Kristeva, a feminist psychoanalyst and philosopher, and Bracha Ettinger,[81] artist and psychoanalyst, has influenced feminist theory in general and feminist literary criticism in particular. However, as the scholar Elizabeth Wright points out, \"none of these French feminists align themselves with the feminist movement as it appeared in the Anglophone world\".[70][82] More recent feminist theory, such as that of Lisa Lucile Owens, has concentrated on characterizing feminism as a universal emancipatory movement.",
			"after": [
				"Many overlapping feminist movements and ideologies have developed over the years.",
				"Some branches of feminism closely track the political leanings of the larger society, such as liberalism and conservatism, or focus on the environment. Liberal feminism seeks individualistic equality of men and women through political and legal reform without altering the structure of society. Radical feminism considers the male-controlled capitalist hierarchy as the defining feature of women's oppression and the total uprooting and reconstruction of society as necessary.[4] Conservative feminism is conservative relative to the society in which it resides. Libertarian feminism conceives of people as self-owners and therefore as entitled to freedom from coercive interference.[83] Separatist feminism does not support heterosexual relationships. Lesbian feminism is thus closely related. Other feminists criticize separatist feminism as sexist.[6] Ecofeminists see men's control of land as responsible for the oppression of women and destruction of the natural environment; ecofeminism has been criticised for focusing too much on a mystical connection between women and nature.[84]"
			],
			"color": "pale|0.8945 violet|0.8945 red|0.8945  "
		}
	}
}
