{
	"add": {
		"doc": {
			"id": "3f8bba05cba4e9621a6ff3b4fe0bac140e25b482f5bc8971459e5010aa957c55",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Union_of_the_Crowns_Royal_Badge.svg/170px-Union_of_the_Crowns_Royal_Badge.svg.png",
			"previous": [],
				"after": "As Elizabeth I was the last of Henry VIII's descendants, James was seen as the most likely heir to the English throne through his great-grandmother Margaret Tudor, who was Henry VIII's oldest sister. From 1601, in the last years of Elizabeth I's life, certain English politicians, notably her chief minister Sir Robert Cecil,[71] maintained a secret correspondence with James to prepare in advance for a smooth succession.[72] In March 1603, with the Queen clearly dying, Cecil sent James a draft proclamation of his accession to the English throne. Elizabeth died in the early hours of 24 March, and James was proclaimed king in London later the same day.[73] On 5 April, James left Edinburgh for London, promising to return every three years (a promise he did not keep), and progressed slowly southwards. Local lords received him with lavish hospitality along the route and James was amazed by the wealth of his new land and subjects. James said he was 'swapping a stony couch for a deep feather bed'. At Cecil's house, Theobalds, Hertfordshire, James was so in awe, he bought it there and then, arriving in the capital after Elizabeth's funeral.[74] His new subjects flocked to see him, relieved that the succession had triggered neither unrest nor invasion.[75] When he entered London on 7 May, he was mobbed by a crowd of spectators.[76]",
			"color": "sea|0.25397 green|0.25397 medium|0.25306 sea|0.25306 green|0.25306 dark|0.04299 olive|0.04299 green|0.04299 firebrick|0.041062 khaki|0.038623 dark|0.031496 gray|0.031496 dark|0.031496 grey|0.031496 dark|0.024936 red|0.024936 silver|0.022837 light|0.021608 coral|0.021608 brown|0.020682 maroon|0.019718 light|0.019009 gray|0.019009 light|0.019009 grey|0.019009 dark|0.018829 khaki|0.018829 gainsboro|0.016873 white|0.014034 smoke|0.014034 alice|0.012379 blue|0.012379 sea|0.012344 shell|0.012344 snow|0.012247 ghost|0.012218 white|0.012218 lavender|0.011915 blush|0.011915 white|0.011613 rosy|0.011116 brown|0.011116 mint|0.0093736 cream|0.0093736 salmon|0.0078267 floral|0.0076404 white|0.0076404  "
		}
	}
}
