{
	"add": {
		"doc": {
			"id": "3f8d9674d0c08d0e43278d25290888e52c3d1fda55c96ad280140f632911cd4e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Airboating_1%2C_Everglades%2C_FL%2C_jjron_31.03.2012.jpg/220px-Airboating_1%2C_Everglades%2C_FL%2C_jjron_31.03.2012.jpg",
				"previous": "Since its signing, the State of Florida reports that it has spent more than $2 billion on the various projects. More than 36,000 acres (150 km2) of Stormwater Treatment Areas have been constructed to filter 2,500 short tons (2,300 t) of phosphorus from Everglades waters. An STA spanning 17,000 acres (69 km2) was constructed in 2004, making it the largest manmade wetland in the world. Fifty-five percent of the land necessary to acquire for restoration has been purchased by the State of Florida, totaling 210,167 acres (850.52 km2). A plan to hasten the construction and funding of projects was put into place, named \"Acceler8\", spurring the start of six of eight large construction projects, including that of three large reservoirs.[165] However, federal funds have not been forthcoming; CERP was signed when the U.S. government had a budget surplus, but since then deficits have renewed, and two of CERP's major supporters in Congress retired. According to a story in The New York Times, state officials say the restoration is lost in a maze of \"federal bureaucracy, a victim of 'analysis paralysis'\".[166] CERP still remains controversial as the projects slated for Acceler8, environmental activists note, are those that benefit urban areas, and regions in the Everglades in desperate need of water are still being neglected, suggesting that water is being diverted to make room for more people in an already overtaxed environment.[167]",
				"after": "A series of biennial reports from the U.S. National Research Council have reviewed the progress of CERP. The fourth report in the series, released in 2012, found that little progress has been made in restoring the core of the remaining Everglades ecosystem; instead, most project construction so far has occurred along its periphery.[168] The report noted that to reverse ongoing ecosystem declines, it will be necessary to expedite restoration projects that target the central Everglades, and to improve both the quality and quantity of the water in the ecosystem.[169] To better understand the potential implications of the current slow pace of progress, the report assessed the current status of ten Everglades ecosystem attributes, including phosphorus loads, peat depth, and populations of snail kites, birds of prey that are endangered in South Florida. Most attributes received grades ranging from C (degraded) to D (significantly degraded), but the snail kite received a grade of F (near irreversible damage). The report also assessed the future trajectory of each ecosystem attribute under three restoration scenarios: improved water quality, improved hydrology, and improvements to both water quality and hydrology, which helped highlight the urgency of restoration actions to benefit a wide range of ecosystem attributes and demonstrate the cost of inaction.[169] Overall, the report concluded that substantial near-term progress to address both water quality and hydrology in the central Everglades is needed to reverse ongoing degradation before it is too late.",
			"color": "silver|0.21029 dark|0.17541 gray|0.17541 dark|0.17541 grey|0.17541 light|0.15481 gray|0.15481 light|0.15481 grey|0.15481 gray|0.10857 grey|0.10857 gainsboro|0.090087 dim|0.086358 gray|0.086358 dim|0.086358 grey|0.086358 black|0.049102 light|0.040246 steel|0.040246 blue|0.040246 lavender|0.040141 light|0.014766 slate|0.014766 gray|0.014766 slate|0.011447 gray|0.011447  "
		}
	}
}
