{
	"add": {
		"doc": {
			"id": "3f97b22547168decf80f1bf3f4a942e57ef2f7fb03a302844b7c7d5633e59b04",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/WNBR_London_2012.jpg/220px-WNBR_London_2012.jpg",
				"previous": "Others practice casual public nudity. Topfree sunbathing is considered acceptable by many on the beaches of Finland, France, Spain, Italy and most of the rest of Europe (and even in some outdoor swimming pools); however, exposure of the genitals is restricted to nudist areas in most regions. In the United States, topfree sunbathing and wearing thongs are not common in many areas, but are limited to nude beaches in various locations. It is normally acceptable for men in the U.S. to be barechested or shirtless when engaged in outdoor recreational activities.",
				"after": "Where the social acceptability of nudity in certain places may be well understood, the legal position is often less clear cut. In England, for example, the law does not actually prohibit simple public nudity, but does forbid indecent exposure[citation needed]. In practice, this means that successful prosecution hangs on whether there is a demonstrable intention to shock others, rather than simply a desire to be nude in a public place. Specifically, using nudity to \"harass, alarm or distress\" others is an offence against the Public Order Act of 1986. Occasional attempts to prove this point by walking naked around the country therefore often result in periods of arrest, followed by release without charge, and inconsistencies in the approach between different police jurisdictions. Differences in the law between England and Scotland appear to make the position harder for naked ramblers once they reach Scotland.",
			"color": "dim|0.49547 gray|0.49547 dim|0.49547 grey|0.49547 gray|0.084836 grey|0.084836 black|0.067032 dark|0.056001 gray|0.056001 dark|0.056001 grey|0.056001 silver|0.039583 light|0.030034 gray|0.030034 light|0.030034 grey|0.030034 rosy|0.025025 brown|0.025025 gainsboro|0.024063 antique|0.012994 white|0.012994 slate|0.012618 gray|0.012618 white|0.010055 smoke|0.010055 linen|0.0095738 sea|0.0085888 shell|0.0085888 light|0.0081615 slate|0.0081615 gray|0.0081615 snow|0.007085 misty|0.0067657 rose|0.0067657 lavender|0.0066774 blush|0.0066774 ghost|0.0064954 white|0.0064954 floral|0.0062568 white|0.0062568 alice|0.0061858 blue|0.0061858 white|0.0055395  "
		}
	}
}
