{
	"add": {
		"doc": {
			"id": "3fa4dc08866d5cb17520902ae462d6b0a1e1c5ed83548f7fcefab9802b2ecc8a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Venezia-DSCF9752.JPG/220px-Venezia-DSCF9752.JPG",
				"previous": "There is also a historic Jewish Community in Venice. The Venetian Ghetto was the area in which Jews were compelled to live under the Venetian Republic. It is from its name, in the Venetian language, that the word \"ghetto\", used in many languages, is derived. William Shakespeare's play The Merchant of Venice, probably written in the late 16th century, features Shylock, a Venetian Jew and his family. First complete, and uncensored edition of Talmud was printed in Venice by Daniel Bomberg in 1523. Venice also has an eruv,[64] built for and still used by the Jewish community.",
				"after": "Venice has been the setting or chosen location of numerous films, novels, poems and other cultural references. The city was a particularly popular setting for novels, essays, and other works of fictional or non-fictional literature. Examples of these include Shakespeare's Merchant of Venice and Othello, Ben Jonson's Volpone, Voltaire's Candide, Casanova's autobiographical History of My Life, Anne Rice's Cry to Heaven, and Philippe Sollers' Watteau in Venice. Thomas Mann's 1912 novella, Death in Venice, has served as the basis for an opera (Benjamin Britten's Death in Venice), a film (Visconti's Death in Venice) and a cocktail (Death in Venice). The city has also been a setting for numerous other films, including three entries in the James Bond series: From Russia with Love, Moonraker and Casino Royale, and many others such as: 2010's The Tourist, Summertime starring Katharine Hepburn, Fellini's Casanova, Nicolas Roeg's Don't Look Now, The Wings of the Dove, Indiana Jones and the Last Crusade, A Little Romance, Lara Croft: Tomb Raider, and The Talented Mr. Ripley. The city has also been the setting for music videos such as Siouxsie and the Banshees' Dear Prudence and Madonna's Like a Virgin, as well as in the video games Tomb Raider II and Assassin's Creed II.",
			"color": "black|0.16989 dark|0.16282 gray|0.16282 dark|0.16282 grey|0.16282 gray|0.1057 grey|0.1057 dim|0.10043 gray|0.10043 dim|0.10043 grey|0.10043 silver|0.080424 tan|0.058224 light|0.031521 gray|0.031521 light|0.031521 grey|0.031521 light|0.030948 slate|0.030948 gray|0.030948 slate|0.024996 gray|0.024996 light|0.02401 steel|0.02401 blue|0.02401 burly|0.020829 wood|0.020829 gainsboro|0.015289 dark|0.012455 khaki|0.012455 wheat|0.011906  "
		}
	}
}
