{
	"add": {
		"doc": {
			"id": "3fe4856b0094e8dcf88e0af7bee471573da168672fabcab751ddd36e96442107",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Pan_Am_Boeing_747-100_Manteufel.jpg/220px-Pan_Am_Boeing_747-100_Manteufel.jpg",
				"previous": "In October 1991 former Douglas Aircraft executive Russell Ray, Jr. was hired as Pan Am's new president and CEO.[114] As part of this restructuring, Pan Am relocated its headquarters from the Pan Am Building in New York City to new offices in the Miami area in preparation for the airline's relaunch from both Miami and New York on November 1, 1991.[115] The new airline would have operated approximately 60 aircraft and generate about $1.2 billion in annual revenues with 7,500 employees.[108] Following the relaunch, Pan Am continued to sustain heavy losses. Revenue throughout October and November 1991 fell short of what had been anticipated in the reorganization plan, with Delta claiming that Pan Am was losing $3 million a day. This undermined Delta's, Wall Street's and the traveling public's confidence in the viability of the reorganized Pan Am.[109][112]",
				"after": "Pan Am's senior executives outlined a projected shortfall of between $100 million and possibly $200 million, with the airline requiring a $25 million installment just to fly through the following week. On the evening of December 3, Pan Am's Creditors Committee advised U.S. Bankruptcy Judge Cornelius Blackshear that it was close to convincing an airline (TWA) to invest $15 million to keep Pan Am operating. A deal with TWA owner Carl Icahn could not be struck. Pan Am opened for business at 9:00 am and within the hour, Ray was forced to withdraw Pan Am's plan of reorganization and execute an immediate shutdown plan for Pan Am. Over 9,000 employees lost their jobs. As a result of this action, Delta was sued for more than $2.5 billion on December 9, 1991 by the Pan Am Creditors Committee.[116] Shortly thereafter, a large group of former Pan Am employees sued Delta.[112] In December 1994 a federal judge ruled in favor of Delta, concluding that it was not liable for Pan Am's demise.[117]",
			"color": "black|0.31163 dim|0.15987 gray|0.15987 dim|0.15987 grey|0.15987 light|0.10837 steel|0.10837 blue|0.10837 gray|0.066842 grey|0.066842 light|0.064007 slate|0.064007 gray|0.064007 slate|0.059128 gray|0.059128 lavender|0.029735 dark|0.025342 gray|0.025342 dark|0.025342 grey|0.025342 alice|0.020592 blue|0.020592 azure|0.013957  "
		}
	}
}
