{
	"add": {
		"doc": {
			"id": "3feaf8c3abf3707154e49faf324a5ba536d9135ce012b7285233f82781758498",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Cessna172Skyhawk1957model01.jpg/220px-Cessna172Skyhawk1957model01.jpg",
				"previous": "Engine oil was added by means of a tube from the cabin that was fitted to pass through the firewall. Only the pilot's seat was installed. The remaining space was used for a pad on which the relief pilot slept. The right cabin door was replaced with an easy-opening, accordion-type door to allow supplies and fuel to be hoisted aboard. Early in the flight, the engine-driven electric generator failed. A Champion wind-driven generator (turned by a small propeller) was hoisted aboard, taped to the wing support strut, and plugged into the cigarette lighter socket; it served as the aircraft's source of electricity for the rest of the flight. The pilots decided to end the marathon flight because with 1,558 hours of continuously running the engine during the record-setting flight, plus several hundred hours already on the engine beforehand (considerably in excess of its normal overhaul interval), the engine's power output had deteriorated to the point where they were barely able to climb away after refueling. The aircraft is on display in the passenger terminal at McCarran International Airport. Photos and details of the record flight can be seen in a small museum on the upper level of the baggage claim area.[12] After the flight, Cook said: “Next time I feel in the mood to fly endurance, I'm going to lock myself in our garbage can with the vacuum cleaner running. That is, until my psychiatrist opens up for business in the morning.”[13]",
				"after": "The basic 172 appeared in November 1955 as the 1956 model and remained in production until replaced by the 172A in early 1960. It was equipped with a Continental O-300 145 hp (108 kW) six-cylinder, air-cooled engine and had a maximum gross weight of 2,200 lb (998 kg). Introductory base price was US$8,995 and a total of 4,195 were constructed over the five years.[14]",
			"color": "dim|0.074375 gray|0.074375 dim|0.074375 grey|0.074375 black|0.062359 slate|0.053821 gray|0.053821 light|0.051132 slate|0.051132 gray|0.051132 dark|0.050208 gray|0.050208 dark|0.050208 grey|0.050208 gray|0.046375 grey|0.046375 dark|0.042814 slate|0.042814 gray|0.042814 white|0.036334 smoke|0.036334 snow|0.033695 sea|0.032628 shell|0.032628 white|0.032553 floral|0.031373 white|0.031373 mint|0.030804 cream|0.030804 ghost|0.030125 white|0.030125 silver|0.029428 alice|0.028915 blue|0.028915 lavender|0.027785 blush|0.027785 azure|0.026267 light|0.023877 gray|0.023877 light|0.023877 grey|0.023877 firebrick|0.022622 gainsboro|0.020987 misty|0.01835 rose|0.01835 indian|0.015474 red|0.015474 pink|0.015357 linen|0.014183 crimson|0.013922 brown|0.013703 rosy|0.013108 brown|0.013108 ivory|0.011606 dark|0.011014 olive|0.011014 green|0.011014 light|0.0098503 coral|0.0098503 light|0.0098503 pink|0.0098503 honeydew|0.0081677 old|0.0080326 lace|0.0080326 lavender|0.0077778 light|0.007252 steel|0.007252 blue|0.007252  "
		}
	}
}
