{
	"add": {
		"doc": {
			"id": "3fefd5aa56ccb687d604a4db6b74458edadb29894c3821d36efff64139acdf41",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Location_of_the_Los_Angeles_Basin.pdf/page1-400px-Location_of_the_Los_Angeles_Basin.pdf.jpg",
			"previous": [],
				"after": "The Los Angeles Basin is located in southern California, in a region known as the Peninsular Ranges. The basin is also connected to an anomalous group of east-west trending chain of basin collectively known as the California Transverse Ranges. The present basin is a coastal lowland area, whose floor is marked by elongate low ridges and groups of hills that is located on the edge of the Pacific plate.[1] Along with the Los Angeles Basin, the Santa Barbara Channel, the Ventura Basin, the San Fernando Valley, and the San Gabriel Basin lie within the greater southern California region.[2] On the north, northeast, and east, the lowland basin is bound by the Santa Monica Mountains mountains and Puente, Elysian, Repetto hills.[3] To the southeast, the basin is bordered by the Santa Ana mountains and the San Joaquin Hills.[3] The western boundary of the basin is marked by the Continental Borderland and is part of the onshore portion. The California borderland is characterized by north-west trending offshore ridges and basins.[4] The Los Angeles Basin is notable for its great structural relief and complexity in relation to its geologic youth and small size for its prolific oil production.[3] Yerkes et al. identify 5 major stages of the basin's evolution that begins in the Upper Cretaceous and ends in the Pleistocene. This basin can be classified as an irregular pull-apart basin accompanied by rotational tectonics during the post-early Miocene.[5][6]",
			"color": "silver|0.27402 light|0.2014 gray|0.2014 light|0.2014 grey|0.2014 dark|0.18766 gray|0.18766 dark|0.18766 grey|0.18766 gainsboro|0.14665 gray|0.059111 grey|0.059111 dim|0.037325 gray|0.037325 dim|0.037325 grey|0.037325 rosy|0.023016 brown|0.023016 black|0.012042 white|0.0073134 smoke|0.0073134 alice|0.0042746 blue|0.0042746 indian|0.0042245 red|0.0042245 ghost|0.0042191 white|0.0042191 sea|0.0042131 shell|0.0042131 snow|0.0041085 lavender|0.0037846 blush|0.0037846 white|0.0036216 mint|0.0032915 cream|0.0032915 floral|0.0032466 white|0.0032466 azure|0.0030173  "
		}
	}
}
