{
	"add": {
		"doc": {
			"id": "4023efa7228f48e92f914d8b89191b25857e6b3165d4234112331aa08a6f64dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/NOR_flash_layout.svg/220px-NOR_flash_layout.svg.png",
				"previous": "In flash memory, each memory cell resembles a standard MOSFET, except the transistor has two gates instead of one. On top is the control gate (CG), as in other MOS transistors, but below this there is a floating gate (FG) insulated all around by an oxide layer. The FG is interposed between the CG and the MOSFET channel. Because the FG is electrically isolated by its insulating layer, electrons placed on it are trapped until they are removed by another application of electric field (e.g. Applied voltage or UV as in EPROM). Counter-intuitively, placing electrons on the FG sets the transistor to the logical \"0\" state. Once the FG is charged, the electrons in it screen (partially cancel) the electric field from the CG, thus, increasing the threshold voltage (VT1) of the cell with no charged FG to a higher threshold voltage (VT2). This means that a higher voltage must be applied to the CG to make the channel conductive. In order to read a value from the transistor, an intermediate voltage between the threshold voltages (VT1 & VT2) is applied to the CG. If the channel conducts at this intermediate voltage, the FG must not be charged (if it were, we would not get conduction because the intermediate voltage is less than VT2), and hence, a logical \"1\" is stored in the gate. If the channel does not conduct at the intermediate voltage, it indicates that the FG is charged, and hence, a logical \"0\" is stored in the gate. The presence of a logical \"0\" or \"1\" is sensed by determining whether there is current flowing across the transistor when the intermediate voltage is asserted on the CG. In a multi-level cell device, which stores more than one bit per cell, the amount of current flow is sensed (rather than simply its presence or absence), in order to determine more precisely the level of charge on the FG.",
			"after": [],
			"color": "white|0.076009 smoke|0.076009 snow|0.074552 ghost|0.073938 white|0.073938 white|0.073681 alice|0.073639 blue|0.073639 mint|0.072726 cream|0.072726 azure|0.07184 sea|0.071444 shell|0.071444 floral|0.070226 white|0.070226 lavender|0.067521 blush|0.067521 dark|0.049771 gray|0.049771 dark|0.049771 grey|0.049771 dark|0.043573 orange|0.043573 silver|0.025401 gray|0.024968 grey|0.024968 light|0.021917 gray|0.021917 light|0.021917 grey|0.021917 gainsboro|0.01956 dim|0.016764 gray|0.016764 dim|0.016764 grey|0.016764 peru|0.016722 aqua|0.010579 cyan|0.010579 antique|0.0066565 white|0.0066565 ivory|0.005803 dark|0.0038941 turquoise|0.0038941  "
		}
	}
}
