{
	"add": {
		"doc": {
			"id": "402336d97708689560f9c8224a011a6304e8fcedac1006c550c186ed7e70ce40",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Charlemagne_Agostino_Cornacchini_Vatican_2.jpg/220px-Charlemagne_Agostino_Cornacchini_Vatican_2.jpg",
				"previous": "The Anglo-Saxon historian the Venerable Bede, who was familiar with the work of Dionysius Exiguus, used Anno Domini dating in his Ecclesiastical History of the English People, completed in 731. In this same history, he also used another Latin term, ante vero incarnationis dominicae tempus anno sexagesimo (\"in fact in the 60th year before the time of the Lord's incarnation\"), equivalent to the English \"before Christ\", to identify years before the first year of this era,[17] thus establishing the standard of not using a year zero,[18] even though he used zero in his computus. Both Dionysius and Bede regarded Anno Domini as beginning at the incarnation of Jesus, but \"the distinction between Incarnation and Nativity was not drawn until the late 9th century, when in some places the Incarnation epoch was identified with Christ's conception, i.e., the Annunciation on March 25\" (Annunciation style).[11]:881",
				"after": "On the continent of Europe, Anno Domini was introduced as the era of choice of the Carolingian Renaissance by Alcuin. Its endorsement by Emperor Charlemagne and his successors popularizing the use of the epoch and spreading it throughout the Carolingian Empire ultimately lies at the core of the system's prevalence. According to the Catholic Encyclopedia, popes continued to date documents according to regnal years for some time, but usage of AD gradually became more common in Roman Catholic countries from the 11th to the 14th centuries.[19] In 1422, Portugal became the last Western European country to switch to the system begun by Dionysius.[20] Eastern Orthodox countries only began to adopt AD instead of the Byzantine calendar in 1700 when Russia did so, with others adopting it in the 19th and 20th centuries.",
			"color": "tan|0.19543 dark|0.18 gray|0.18 dark|0.18 grey|0.18 silver|0.15293 light|0.093125 gray|0.093125 light|0.093125 grey|0.093125 gray|0.071001 grey|0.071001 gainsboro|0.060562 dim|0.042073 gray|0.042073 dim|0.042073 grey|0.042073 linen|0.025493 antique|0.025092 white|0.025092 black|0.01756 sea|0.01661 shell|0.01661 white|0.014151 smoke|0.014151 misty|0.013324 rose|0.013324 lavender|0.010549 blush|0.010549 snow|0.010392 floral|0.0096911 white|0.0096911 old|0.009419 lace|0.009419  "
		}
	}
}
