{
	"add": {
		"doc": {
			"id": "4047ed84921b5cc0da3e39ef7dee8799554dfe4524b5e0bae57147595eb5214a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/CMB_Timeline300_no_WMAP.jpg/350px-CMB_Timeline300_no_WMAP.jpg",
				"previous": "The term outer space was used as early as 1842 by the English poet Lady Emmeline Stuart-Wortley in her poem \"The Maiden of Moscow\".[28] The expression outer space was used as an astronomical term by Alexander von Humboldt in 1845.[29] It was later popularized in the writings of H. G. Wells in 1901.[30] The shorter term space is actually older, first used to mean the region beyond Earth's sky in John Milton's Paradise Lost in 1667.[31]",
				"after": "According to the Big Bang theory, the Universe originated in an extremely hot and dense state about 13.8 billion years ago[32] and began expanding rapidly. About 380,000 years later the Universe had cooled sufficiently to allow protons and electrons to combine and form hydrogen—the so-called recombination epoch. When this happened, matter and energy became decoupled, allowing photons to travel freely through space.[33] The matter that remained following the initial expansion has since undergone gravitational collapse to create stars, galaxies and other astronomical objects, leaving behind a deep vacuum that forms what is now called outer space.[34] As light has a finite velocity, this theory also constrains the size of the directly observable Universe.[33] This leaves open the question as to whether the Universe is finite or infinite.",
			"color": "dim|0.17885 gray|0.17885 dim|0.17885 grey|0.17885 black|0.16007 gray|0.13918 grey|0.13918 dark|0.1232 gray|0.1232 dark|0.1232 grey|0.1232 slate|0.077249 gray|0.077249 light|0.071036 slate|0.071036 gray|0.071036 silver|0.053735 light|0.032691 steel|0.032691 blue|0.032691 light|0.030466 gray|0.030466 light|0.030466 grey|0.030466 gainsboro|0.021446 lavender|0.015622 alice|0.0088471 blue|0.0088471 white|0.0088273 smoke|0.0088273 ghost|0.0073876 white|0.0073876 azure|0.0058576 snow|0.0056131 white|0.0053771 mint|0.0053285 cream|0.0053285 steel|0.0051347 blue|0.0051347  "
		}
	}
}
