{
	"add": {
		"doc": {
			"id": "405987b697882b1728e6292c9f707dd0dc89034eb93f3d581f09e5fd4ba51526",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/EUROPE_1929-1938_POLITICAL_MAP.svg/300px-EUROPE_1929-1938_POLITICAL_MAP.svg.png",
				"previous": "In North America, especially the first half of this period, people experienced considerable prosperity in the Roaring Twenties. The social and societal upheaval known as the Roaring Twenties began in North America and spread to Europe in the aftermath of World War I. The Roaring Twenties, often called \"The Jazz Age\", saw an exposition of social, artistic, and cultural dynamism. 'Normalcy' returned to politics, jazz music blossomed, the flapper redefined modern womanhood, Art Deco peaked. The spirit of the Roaring Twenties was marked by a general feeling of discontinuity associated with modernity, a break with traditions. Everything seemed to be feasible through modern technology. New technologies, especially automobiles, movies and radio proliferated 'modernity' to a large part of the population. The 1920s saw the general favor of practicality, in architecture as well as in daily life. The 1920s was further distinguished by several inventions and discoveries, extensive industrial growth and the rise in consumer demand and aspirations, and significant changes in lifestyle.",
				"after": "Europe spent these years rebuilding and coming to terms with the vast human cost of the conflict. The economy of the United States became increasingly intertwined with that of Europe. In Germany, the Weimar Republic gave way to episodes of political and economic turmoil, which culminated with the German hyperinflation of 1923 and the failed Beer Hall Putsch of that same year. When Germany could no longer afford war payments, Wall Street invested heavily in European debts to keep the European economy afloat as a large consumer market for American mass-produced goods. By the middle of the decade, economic development soared in Europe, and the Roaring Twenties broke out in Germany, Britain and France, the second half of the decade becoming known as the \"Golden Twenties\". In France and francophone Canada, they were also called the \"années folles\" (\"Crazy Years\").[103]",
			"color": "yellow|0.26409 green|0.26409 peach|0.065735 puff|0.065735 wheat|0.063472 bisque|0.063074 navajo|0.060444 white|0.060444 moccasin|0.060232 dim|0.041479 gray|0.041479 dim|0.041479 grey|0.041479 gray|0.032651 grey|0.032651 sea|0.027799 green|0.027799 light|0.027423 steel|0.027423 blue|0.027423 dark|0.027329 gray|0.027329 dark|0.027329 grey|0.027329 light|0.020223 slate|0.020223 gray|0.020223 tan|0.019879 corn|0.019159 flower|0.019159 blue|0.019159 slate|0.018908 gray|0.018908 silver|0.017562 dark|0.014838 khaki|0.014838 honeydew|0.014404 black|0.011458 light|0.010839 gray|0.010839 light|0.010839 grey|0.010839 dark|0.010268 cyan|0.010268 teal|0.010174 gainsboro|0.0080296 olive|0.0077949 drab|0.0077949  "
		}
	}
}
