{
	"add": {
		"doc": {
			"id": "406d94f7a0447bedd183b8e8e3ea3ea98808a7ca238271b8ac924c785be12b7c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/YF-22_and_YF-23.jpg/220px-YF-22_and_YF-23.jpg",
				"previous": "The flight control surfaces were controlled by a central management computer system. Raising the wing flaps and ailerons on one side and lowering them on the other provided roll. The V-tail fins were angled 50 degrees from the vertical. Pitch was mainly provided by rotating these V-tail fins in opposite directions so their front edges moved together or apart. Yaw was primarily supplied by rotating the tail fins in the same direction. Test pilot Paul Metz stated that the YF-23 had superior high angle of attack (AoA) performance compared to legacy aircraft.[23] Deflecting the wing flaps down and ailerons up on both sides simultaneously provided for aerodynamic braking.[24] To keep costs low despite the novel design, a number of \"commercial off-the-shelf\" components were used, including an F-15 nose wheel, F/A-18 main landing gear parts, and the forward cockpit components of the F-15E Strike Eagle.[11][16]",
				"after": "The first YF-23, with Pratt & Whitney engines, supercruised at Mach 1.43 on 18 September 1990, while the second, with General Electric engines, reached Mach 1.6 on 29 November 1990. By comparison, the YF-22 achieved Mach 1.58 in supercruise.[25] The YF-23 was tested to a top speed of Mach 1.8 with afterburners and achieved a maximum angle-of-attack of 25°.[26] The maximum speed is classified, though sources state a maximum speed greater than Mach 2 at altitude and a supercruise speed greater than Mach 1.6.[27] The aircraft's weapons bay was configured for weapons launch, and used for testing weapons bay acoustics, but no missiles were fired; Lockheed fired AIM-9 Sidewinder and AIM-120 AMRAAM missiles successfully from its YF-22 demonstration aircraft. PAV-1 performed a fast-paced combat demonstration with six flights over a 10-hour period on 30 November 1990. Flight testing continued into December.[28] The two YF-23s flew 50 times for a total of 65.2 hours.[29] The tests demonstrated Northrop's predicted performance values for the YF-23.[30] The YF-23 was stealthier and faster, but the YF-22 was more agile.[31][32]",
			"color": "tan|0.2679 dark|0.086336 gray|0.086336 dark|0.086336 grey|0.086336 silver|0.079675 light|0.079515 gray|0.079515 light|0.079515 grey|0.079515 black|0.066185 dim|0.057804 gray|0.057804 dim|0.057804 grey|0.057804 gray|0.048761 grey|0.048761 wheat|0.048186 gainsboro|0.043313 antique|0.040133 white|0.040133 bisque|0.03959 slate|0.035827 gray|0.035827 peach|0.029076 puff|0.029076 light|0.020976 slate|0.020976 gray|0.020976 blanched|0.01823 almond|0.01823 papaya|0.0085063 whip|0.0085063  "
		}
	}
}
