{
	"add": {
		"doc": {
			"id": "4072414d17ae5f76f74c21fbf715c162a055ed9da2a6a5aec709d59be7054acc",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/a/aa/Dialects_of_English_in_UK_and_Ireland.svg/300px-Dialects_of_English_in_UK_and_Ireland.svg.png",
			"previous": [],
				"after": "As the place where English first evolved, the British Isles, and particularly England, are home to the most variegated pattern of dialects. Within the United Kingdom, the Received Pronunciation (RP), an educated dialect of South East England, traditionally used as the broadcast standard, and is considered the most prestigious of the British dialects. The spread of RP (also known as BBC English) through the media has caused many traditional dialects of rural England to recede, as youths adopt the traits of the prestige variety instead of traits from local dialects. At the time of the Survey of English Dialects, grammar and vocabulary differed across the country, but a process of lexical attrition has led most of this variation to disappear.[216] Nonetheless this attrition has mostly affected dialectal variation in grammar and vocabulary, and in fact only 3 percent of the English population actually speak RP, the remainder speaking regional accents and dialects with varying degrees of RP influence.[217] There is also variability within RP, particularly along class lines between Upper and Middle class RP speakers and between native RP speakers and speakers who adopt RP later in life.[218] Within Britain there is also considerable variation along lines of social class, and some traits though exceedingly common are considered \"non-standard\" and are associated with lower class speakers and identities. An example of this is aitch-dropping, which historically was a feature of lower class London English, particularly Cockney, but which today is the standard in all major English cities—yet it remains largely absent in broadcasting and among the upper crust of British society.[219]",
			"color": "misty|0.14288 rose|0.14288 lavender|0.11609 blush|0.11609 linen|0.10354 sea|0.099883 shell|0.099883 snow|0.089667 white|0.082943 smoke|0.082943 silver|0.063286 light|0.052206 gray|0.052206 light|0.052206 grey|0.052206 dark|0.05075 gray|0.05075 dark|0.05075 grey|0.05075 gainsboro|0.042694 dim|0.027682 gray|0.027682 dim|0.027682 grey|0.027682 gray|0.026199 grey|0.026199 thistle|0.01682 floral|0.014849 white|0.014849 rosy|0.011864 brown|0.011864 light|0.0086917 steel|0.0086917 blue|0.0086917 light|0.0068243 blue|0.0068243 black|0.0067556 powder|0.0060691 blue|0.0060691 light|0.0056022 slate|0.0056022 gray|0.0056022 dark|0.0050255 slate|0.0050255 gray|0.0050255 slate|0.0039957 gray|0.0039957  "
		}
	}
}
