{
	"add": {
		"doc": {
			"id": "4075a6da30f0415027e9195eb24542e35bee2897d8c9e7d984963ff2712882ac",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Official_portrait_of_President_Reagan_and_Vice_President_Bush_1981.jpg/220px-Official_portrait_of_President_Reagan_and_Vice_President_Bush_1981.jpg",
				"previous": "As Vice President, Bush generally took on a low profile while recognizing the constitutional limits of the office; he avoided decision-making or criticizing Reagan in any way. As had become customary, he and his wife moved into the Vice President's residence at Number One Observatory Circle, about two miles from the White House. After selling the house in the Tanglewood, the Bushes declared a room in The Houstonian Hotel in Houston as their official voting address.[23] The Bushes attended a large number of public and ceremonial events in their positions, including many state funerals, which became a common joke for comedians. Mrs. Bush found the funerals largely beneficial, saying, \"George met with many current or future heads of state at the funerals he attended, enabling him to forge personal relationships that were important to President Reagan.\" As the President of the Senate, Bush stayed in contact with members of Congress, and kept the president informed on occurrences on Capitol Hill.[31]",
				"after": "On March 30, 1981, early into the administration, Reagan was shot and seriously wounded in Washington, D.C. Bush, second in command by the presidential line of succession, was in Fort Worth, Texas, and flew back to Washington immediately. Reagan's cabinet convened in the White House Situation Room, where they discussed various issues, including the availability of the Nuclear Football. When Bush's plane landed, his aides advised him to proceed directly to the White House by helicopter, as an image of the government still functioning despite the attack. Bush rejected the idea, responding, \"Only the President lands on the South Lawn.\"[31] This made a positive impression on Reagan,[31] who recovered and returned to work within two weeks. From then on, the two men would have regular Thursday lunches in the Oval Office.",
			"color": "black|0.89711 dark|0.030312 slate|0.030312 gray|0.030312 tan|0.0094907 silver|0.0093574 dark|0.0070714 gray|0.0070714 dark|0.0070714 grey|0.0070714 light|0.0068653 gray|0.0068653 light|0.0068653 grey|0.0068653 dim|0.0063249 gray|0.0063249 dim|0.0063249 grey|0.0063249 gainsboro|0.0046058  "
		}
	}
}
