{
	"add": {
		"doc": {
			"id": "408d1dcb6807e18a81b496cdfe89f68f92b2a0e37917dec73b05de89177e6118",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/South_Hall--UC_Berkeley--Panoramic.jpg/220px-South_Hall--UC_Berkeley--Panoramic.jpg",
			"previous": [],
				"after": "What is considered the historic campus today was the result of the 1898 \"International Competition for the Phoebe Hearst Architectural Plan for the University of California,\" funded by William Randolph Hearst's mother and initially held in the Belgian city of Antwerp; eleven finalists were judged again in San Francisco in 1899.[86] The winner was Frenchman Émile Bénard, however he refused to personally supervise the implementation of his plan and the task was subsequently given to architecture professor John Galen Howard. Howard designed over twenty buildings, which set the tone for the campus up until its expansion in the 1950s and 1960s. The structures forming the \"classical core\" of the campus were built in the Beaux-Arts Classical style, and include Hearst Greek Theatre, Hearst Memorial Mining Building, Doe Memorial Library, California Hall, Wheeler Hall, (Old) Le Conte Hall, Gilman Hall, Haviland Hall, Wellman Hall, Sather Gate, and the 307-foot (94 m) Sather Tower (nicknamed \"the Campanile\" after its architectural inspiration, St Mark's Campanile in Venice). Buildings he regarded as temporary, nonacademic, or not particularly \"serious\" were designed in shingle or Collegiate Gothic styles; examples of these are North Gate Hall, Dwinelle Annex, and Stephens Hall. Many of Howard's designs are recognized California Historical Landmarks[87] and are listed on the National Register of Historic Places.",
			"color": "dark|0.26203 gray|0.26203 dark|0.26203 grey|0.26203 dim|0.17361 gray|0.17361 dim|0.17361 grey|0.17361 black|0.16356 gray|0.14995 grey|0.14995 silver|0.093202 light|0.038075 gray|0.038075 light|0.038075 grey|0.038075 gainsboro|0.020621 dark|0.019561 olive|0.019561 green|0.019561 rosy|0.015221 brown|0.015221 antique|0.0090393 white|0.0090393  "
		}
	}
}
