{
	"add": {
		"doc": {
			"id": "4092f6cdd29b7504a7ee7b77eb184e51306904c8dc1ce795fe2809ba371b6597",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Jean_Nicolet.jpg/220px-Jean_Nicolet.jpg",
				"previous": "Wisconsin has been home to a wide variety of cultures over the past 12,000 years. The first people arrived around 10,000 BCE during the Wisconsin Glaciation. These early inhabitants, called Paleo-Indians, hunted now-extinct ice age animals exemplified by the Boaz mastodon, a prehistoric mastodon skeleton unearthed along with spear points in southwest Wisconsin.[9] After the ice age ended around 8000 BCE, people in the subsequent Archaic period lived by hunting, fishing, and gathering food from wild plants. Agricultural societies emerged gradually over the Woodland period between 1000 BCE to 1000 CE. Toward the end of this period, Wisconsin was the heartland of the \"Effigy Mound culture\", which built thousands of animal-shaped mounds across the landscape.[10] Later, between 1000 and 1500 CE, the Mississippian and Oneota cultures built substantial settlements including the fortified village at Aztalan in southeast Wisconsin.[11] The Oneota may be the ancestors of the modern Ioway and Ho-Chunk tribes who shared the Wisconsin region with the Menominee at the time of European contact.[12] Other American Indian groups living in Wisconsin when Europeans first settled included the Ojibwa, Sauk, Fox, Kickapoo, and Pottawatomie, who migrated to Wisconsin from the east between 1500 and 1700.[13]",
				"after": "The first European to visit what became Wisconsin was probably the French explorer Jean Nicolet. He canoed west from Georgian Bay through the Great Lakes in 1634, and it is traditionally assumed that he came ashore near Green Bay at Red Banks.[14] Pierre Radisson and Médard des Groseilliers visited Green Bay again in 1654–1666 and Chequamegon Bay in 1659–1660, where they traded for fur with local American Indians.[15] In 1673, Jacques Marquette and Louis Jolliet became the first to record a journey on the Fox-Wisconsin Waterway all the way to the Mississippi River near Prairie du Chien.[16] Frenchmen like Nicholas Perrot continued to ply the fur trade across Wisconsin through the 17th and 18th centuries, but the French made no permanent settlements in Wisconsin before Great Britain won control of the region following the French and Indian War in 1763. Even so, French traders continued to work in the region after the war, and some, beginning with Charles de Langlade in 1764, now settled in Wisconsin permanently rather than returning to British-controlled Canada.[17]",
			"color": "dim|0.16185 gray|0.16185 dim|0.16185 grey|0.16185 gray|0.1409 grey|0.1409 dark|0.12783 gray|0.12783 dark|0.12783 grey|0.12783 light|0.094776 steel|0.094776 blue|0.094776 black|0.092899 light|0.091714 blue|0.091714 powder|0.051422 blue|0.051422 light|0.037619 slate|0.037619 gray|0.037619 slate|0.032686 gray|0.032686 pale|0.028144 turquoise|0.028144 silver|0.026108 sienna|0.024093 sky|0.015886 blue|0.015886 light|0.012867 gray|0.012867 light|0.012867 grey|0.012867 dark|0.01227 slate|0.01227 gray|0.01227 saddle|0.010831 brown|0.010831  "
		}
	}
}
