{
	"add": {
		"doc": {
			"id": "4099d0abe9132cbdc8a9a0eb70a347af55db54fa214b22562c8105164b6f7589",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/French_Urban_Search_and_Rescue.jpg/220px-French_Urban_Search_and_Rescue.jpg",
				"previous": "In the South Tower, one stairwell, Stairwell A, was left intact after Flight 175 hit, allowing 14 people located on the floors of impact (including one man who saw the plane coming at him) and four more from the floors above to escape. 911 operators who received calls from individuals inside the tower were not well informed of the situation as it rapidly unfolded and as a result, told callers not to descend the tower on their own.[117] 630 people died in that tower, fewer than half the number killed in the North Tower.[116] Casualties in the South Tower were significantly reduced by some occupants deciding to start evacuating as soon as the North Tower was struck.[118]",
				"after": "At least 200 people fell or jumped to their deaths from the burning towers (as exemplified in the photograph The Falling Man), landing on the streets and rooftops of adjacent buildings hundreds of feet below.[119] Some occupants of each tower above the point of impact made their way toward the roof in hope of helicopter rescue, but the roof access doors were locked. No plan existed for helicopter rescues, and the combination of roof equipment and thick smoke and intense heat prevented helicopters from approaching.[120] A total of 414 emergency workers died as they tried to rescue people and fight fires. The New York City Fire Department (FDNY) lost 340 firefighters, a chaplain, and two paramedics.[121] The New York City Police Department (NYPD) lost 23 officers.[122] The Port Authority Police Department (PAPD) lost 37 officers.[123] Three New York State Court Officers were killed.[124] Eight emergency medical technicians (EMTs) and paramedics from private emergency medical services units were killed.[125][126]",
			"color": "black|0.14865 firebrick|0.13229 sienna|0.12296 dark|0.072828 red|0.072828 maroon|0.072484 brown|0.054976 tan|0.050435 peru|0.024661 saddle|0.022456 brown|0.022456 dark|0.022146 gray|0.022146 dark|0.022146 grey|0.022146 silver|0.020987 antique|0.0204 white|0.0204  "
		}
	}
}
