{
	"add": {
		"doc": {
			"id": "40a27e0d9d100cfe5a1d21272c8a66abf38a16525290d0d3af90a2fd41c2b3dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Flickr_-_DVIDSHUB_-_2012_MCAS_Miramar_AirShow_%28Image_3_of_15%29.jpg/220px-Flickr_-_DVIDSHUB_-_2012_MCAS_Miramar_AirShow_%28Image_3_of_15%29.jpg",
				"previous": "The second phase of OPEVAL, which took place at MCAS Yuma from 25 February to 8 March, required the AV-8B to perform fighter escort, combat air patrol, and deck-launched intercept missions. Although the evaluation identified shortfalls in the design (subsequently rectified), OPEVAL was deemed successful.[92] The AV-8B Harrier II reached initial operating capability (IOC) in January 1985 with USMC squadron VMA-331.[93][94][N 4]",
				"after": "The AV-8B saw extensive action in the Gulf War of 1990–91. Aircraft based on USS Nassau and Tarawa, and at on-shore bases, initially flew training and support sorties, as well as practicing with coalition forces. The AV-8Bs were to be held in reserve during the initial phase of the preparatory air assault of Operation Desert Storm. The AV-8B was first used in the war on the morning of 17 January 1991, when a call for air support from an OV-10 Bronco forward air controller against Iraqi artillery that was shelling Khafji and an adjacent oil refinery, brought the AV-8B into combat.[95] The following day, USMC AV-8Bs attacked Iraqi positions in southern Kuwait. Throughout the war, AV-8Bs performed armed reconnaissance and worked in concert with coalition forces to destroy targets.[95]",
			"color": "light|0.2386 gray|0.2386 light|0.2386 grey|0.2386 gainsboro|0.21184 silver|0.15464 linen|0.062315 black|0.062134 dark|0.052551 gray|0.052551 dark|0.052551 grey|0.052551 tan|0.030994 white|0.029116 smoke|0.029116 gray|0.022836 grey|0.022836 sea|0.019646 shell|0.019646 dim|0.01418 gray|0.01418 dim|0.01418 grey|0.01418 old|0.012509 lace|0.012509 burly|0.012121 wood|0.012121 antique|0.011043 white|0.011043 floral|0.0079895 white|0.0079895 peach|0.006014 puff|0.006014 rosy|0.0047266 brown|0.0047266 snow|0.0043  "
		}
	}
}
