{
	"add": {
		"doc": {
			"id": "40b5f6b5629f9cb147785a7578742d9d5dcb9714aab264246d6b9329ec37df75",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Tasmanian_Devil_markings.jpg/220px-Tasmanian_Devil_markings.jpg",
				"previous": "One strand conformation polymorphism analysis (OSCP) on the major histocompatibility complex (MHC) class I domain taken from various locations across Tasmania showed 25 different types, and showed a different pattern of MHC types in north-western Tasmania to eastern Tasmania. Those devils in the east of the state have less MHC diversity; 30% are of the same type as the tumour (type 1), and 24% are of type A.[36] Seven of every ten devils in the east are of type A, D, G or 1, which are linked to DFTD; whereas only 55% of the western devils fall into these MHC categories. Of the 25 MHC types, 40% are exclusive to the western devils. Although the north-west population is less genetically diverse overall, it has higher MHC gene diversity, which allows them to mount an immune response to DFTD. According to this research, mixing the devils may increase the chance of disease.[36] Of the fifteen different regions in Tasmania surveyed in this research, six were in the eastern half of the island. In the eastern half, Epping Forest had only two different types, 75% being type O. In the Buckland-Nugent area, only three types were present, and there were an average of 5.33 different types per location. In contrast, in the west, Cape Sorell yielded three types, and Togari North-Christmas Hills yielded six, but the other seven sites all had at least eight MHC types, and West Pencil Pine had 15 types. There was an average of 10.11 MHC types per site in the west.[36]",
			"after": [],
			"color": "dark|0.18987 gray|0.18987 dark|0.18987 grey|0.18987 gray|0.18117 grey|0.18117 dim|0.16021 gray|0.16021 dim|0.16021 grey|0.16021 black|0.13337 silver|0.11913 light|0.051768 gray|0.051768 light|0.051768 grey|0.051768 gainsboro|0.028594 rosy|0.02677 brown|0.02677 slate|0.017625 gray|0.017625 light|0.012219 slate|0.012219 gray|0.012219 misty|0.011931 rose|0.011931 antique|0.010732 white|0.010732  "
		}
	}
}
