{
	"add": {
		"doc": {
			"id": "40b5972ac676fc11745decd2261c609c141cc35ac9ef8626700e94fa66d68e9d",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f5/Leaving_on_a_jet_plane_45.jpg/200px-Leaving_on_a_jet_plane_45.jpg",
				"previous": "The newly merged group was renamed Warner Bros.-Seven Arts (often referred to in the trade press by the abbreviation it adopted for its new logo, \"W7\"). Although Warner Bros. Pictures was faltering, the purchase coincided with a period of tremendous growth in the music industry and Warner-Reprise was now on its way to becoming a major player in the industry. Hyman's investment banker Alan Hirshfeld, of Charles Allen and Company, urged him to expand the company's record holdings and arranged a meeting with Jerry Wexler and Ahmet and Nesuhi Ertegun, co-owners of leading independent label Atlantic Records, which eventually resulted in the purchase of Atlantic in 1968.",
				"after": "In June 1967 Mo Ostin attended the historic Monterey International Pop Festival, where The Association performed the opening set. Ostin had already acquired the US rights to the Jimi Hendrix Experience recordings, sight unseen, but he was reportedly unimpressed by Hendrix's now-famous performance. During his visit he met Andy Wickham, who had come to Monterey as an assistant to festival promoter Lou Adler. Wickham had worked as a commercial artist in London, followed by a stint with Andrew Loog Oldham's Immediate Records before moving to Los Angeles to work for Adler's Dunhill label. Ostin initially hired Wickham as Warner's \"house hippie\" on a generous retainer of $200 per week. Hanging out around Laurel Canyon, Wickham scouted for new talent and established a rapport with the young musicians WBR was seeking to sign. Like Lenny Waronker, Wickham's youth, intelligence and hip attitude allowed him to bridge the 'generation gap between these young performers and the older Warner 'establishment'.[33] He played a major role in signing Eric Andersen, Jethro Tull and Van Morrison and Joni Mitchell (who signed to Reprise), whom Wickham successfully recommended to Ostin in his first week with the company.[34] Over the next thirty years Wickham became one of WBR's most influential A&R managers, signing such notable acts as Emmylou Harris, Buck Owens and Norwegian pop trio a-ha.",
			"color": "white|0.080297 smoke|0.080297 ghost|0.076961 white|0.076961 alice|0.076476 blue|0.076476 lavender|0.075519 blush|0.075519 snow|0.075274 white|0.071257 sea|0.066423 shell|0.066423 gainsboro|0.06438 azure|0.057285 mint|0.043258 cream|0.043258 lavender|0.039997 olive|0.039869 drab|0.039869 dark|0.036024 khaki|0.036024 dark|0.035953 olive|0.035953 green|0.035953 linen|0.028164 olive|0.022142 light|0.018906 gray|0.018906 light|0.018906 grey|0.018906 floral|0.014056 white|0.014056  "
		}
	}
}
