{
	"add": {
		"doc": {
			"id": "40b931987f713d2f97a0bb6008ff5506db3099e7d102ff0003e0a8b13e399c9b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Port-Lockroy.jpg/220px-Port-Lockroy.jpg",
				"previous": "Several governments maintain permanent manned research stations on the continent. The number of people conducting and supporting scientific research and other work on the continent and its nearby islands varies from about 1,000 in winter to about 5,000 in the summer, giving it a population density between 70 and 350 inhabitants per million square kilometres (180 and 900 per million square miles) at these times. Many of the stations are staffed year-round, the winter-over personnel typically arriving from their home countries for a one-year assignment. An Orthodox church, Trinity Church, opened in 2004 at the Russian Bellingshausen Station is also manned year-round by one or two priests, who are similarly rotated every year.[50][51]",
				"after": "The first semi-permanent inhabitants of regions near Antarctica (areas situated south of the Antarctic Convergence) were British and American sealers who used to spend a year or more on South Georgia, from 1786 onward. During the whaling era, which lasted until 1966, the population of that island varied from over 1,000 in the summer (over 2,000 in some years) to some 200 in the winter. Most of the whalers were Norwegian, with an increasing proportion of Britons. The settlements included Grytviken, Leith Harbour, King Edward Point, Stromness, Husvik, Prince Olav Harbour, Ocean Harbour and Godthul. Managers and other senior officers of the whaling stations often lived together with their families. Among them was the founder of Grytviken, Captain Carl Anton Larsen, a prominent Norwegian whaler and explorer who, along with his family, adopted British citizenship in 1910.",
			"color": "dim|0.31475 gray|0.31475 dim|0.31475 grey|0.31475 black|0.18206 gray|0.14976 grey|0.14976 light|0.10149 slate|0.10149 gray|0.10149 slate|0.08883 gray|0.08883 dark|0.059211 gray|0.059211 dark|0.059211 grey|0.059211 silver|0.021411 dark|0.018178 slate|0.018178 gray|0.018178 light|0.014304 gray|0.014304 light|0.014304 grey|0.014304 gainsboro|0.0098877 brown|0.0052812 rosy|0.0052377 brown|0.0052377  "
		}
	}
}
