{
	"add": {
		"doc": {
			"id": "40bbd423b1c9b86b33a03b80a9c2e1f9a2e94ff9625f69385a25d95e1464c85c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/McKinley_medal_1901_obverse.jpg/170px-McKinley_medal_1901_obverse.jpg",
				"previous": "On August 12, 1902, Treasury Secretary Leslie M. Shaw wrote to former Missouri governor David R. Francis, one of the promoters of the exposition, enquiring what design exposition officials would like to see on the reverse of the coins. Although Francis's response is not extant, Mint authorities originally determined upon an olive branch surrounding a numeral \"1\". This was apparently disliked by the Director of the Mint, George E. Roberts, for on October 2, 1902, Philadelphia Mint Superintendent John Landis wrote to him, enclosing cardboard impressions of the original and revised proposed reverses. The new design had the value spelled out and the letter stated that the changes were being made at Roberts's suggestion. On October 13, Barber went to Washington (where the director's office was located) to confer with Roberts about the design. Roberts considered the olive branch \"too conspicuous\", given the size of the coin and the lettering, and asked that the branch be reduced in size.[8] This apparently was done.[8] By September 1902, work upon the dies for the obverses, showing the heads of McKinley and Jefferson, being worked upon by Mint Chief Engraver Charles E. Barber, was well-advanced.[8]",
				"after": "In December 1902, the Philadelphia Mint struck 75,080 gold dollars. These were dated 1903, a violation of normal Mint practice to have the date of striking on the coin. This was not unprecedented; the 1900-dated Lafayette dollar had been struck in December 1899. It is not known which gold dollar was first struck. In January 1903, an additional 175,178 pieces were coined; the excess of 258 over the authorized mintage was set aside for testing by the annual Assay Commission.[9] There is no difference between those pieces struck in 1902 and those minted in 1903.[3] Fifty thousand pieces were sent to the St. Louis sub-treasury on December 22, 1902, to await the organizing committee's compliance with other parts of the law, most likely relating to the required posting of a bond.[3][4]",
			"color": "burly|0.52028 wood|0.52028 tan|0.27048 pale|0.059369 golden|0.059369 rod|0.059369 navajo|0.057429 white|0.057429 moccasin|0.028944 wheat|0.019905 lemon|0.018181 chiffon|0.018181 light|0.0096456 golden|0.0096456 rod|0.0096456 yellow|0.0096456  "
		}
	}
}
