{
	"add": {
		"doc": {
			"id": "40bed2a3e1053bb7eab7b3a0be7c0d6ddfcabc720a47fca1857a975e74b7dac1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Laocoon_Pio-Clementino_Inv1059-1064-1067.jpg/240px-Laocoon_Pio-Clementino_Inv1059-1064-1067.jpg",
				"previous": "The encyclopedia uses some material from his memories of earlier times and from his prior works, such as the book on Germany. There is no evidence that he had planned to use this material in an encyclopedia later in his career. Most of the references in the encyclopedia must have come from his extracts, which he kept on an ongoing basis, using a slave as reader and a separate slave for a secretary to document them. Pliny even furnished that secretary with gloves and long sleeves in winter so that his writing hand would not stiffen with cold, and he subsequently would be unable to take notes (as is detailed by Pliny the Younger in 'avunculus meus'). The extracts collected for this purpose filled rather less than 160 volumes, which Larcius Licinius, the Praetorian legate of Hispania Tarraconensis, vainly offered to purchase for 400,000 sesterces.[16] That would have been in 73/74 (see above). At his death Pliny left the 160 volumes to his nephew. When composition began is unknown. Since he was preoccupied with his other works under Nero and then had to finish the history of his times, it is unlikely he began before 70. The procuratorships offered the ideal opportunity for an encyclopedic frame of mind. The date of an overall composition cannot be assigned to any one year. The dates of different parts must be determined, if they can, by philological analysis (the \"post-mortem\" of the scholars).",
				"after": "The closest known event to a single publication date; that is, when the manuscript was probably released to the public for borrowing and copying, and was probably sent to the Flavians, is the date of the Dedication in the first of the 37 books. It is to the imperator Titus. As Titus and Vespasian had the same name, Titus Flavius Vespasianus, earlier writers hypothesized a dedication to Vespasian. Pliny's mention of a brother (Domitian) and joint offices with a father, calling that father \"great\", points certainly to Titus.[45]",
			"color": "light|0.18599 gray|0.18599 light|0.18599 grey|0.18599 silver|0.15628 gainsboro|0.1513 dark|0.081883 gray|0.081883 dark|0.081883 grey|0.081883 linen|0.067982 antique|0.045262 white|0.045262 dim|0.043517 gray|0.043517 dim|0.043517 grey|0.043517 sea|0.037685 shell|0.037685 white|0.035298 smoke|0.035298 old|0.032935 lace|0.032935 floral|0.025783 white|0.025783 gray|0.023335 grey|0.023335 snow|0.020582 lavender|0.013265 blush|0.013265 ghost|0.011499 white|0.011499 mint|0.010629 cream|0.010629 white|0.010535 misty|0.0085122 rose|0.0085122 ivory|0.0068208 alice|0.0068063 blue|0.0068063 papaya|0.0064147 whip|0.0064147 beige|0.0060867 black|0.004017  "
		}
	}
}
