{
	"add": {
		"doc": {
			"id": "40bf1b768c67b2c624618335e87f9bd8812f2b3deedee57fb3ab1457a3b5db6b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Northcliffe_House_2008_06_21.jpg/220px-Northcliffe_House_2008_06_21.jpg",
				"previous": "The borough council is pushing for an additional Crossrail station in the north of the borough, at Kensal[10] off Ladbroke Grove & Canal Way. A turn-back facility will have to be built not too far west of Paddington, and siting the turn-back at Kensal rather than next to Paddington would provide a frequent service, helping to regenerate the area.[11][12][13] London Mayor Boris Johnson stated that a station would be added if it met three tests: it must not delay construction of Crossrail; it must not compromise performance of Crossrail or any other railway; and it must not increase Crossrail's overall cost. In response, the borough council agreed to underwrite the projected £33 million cost of the station to the extent that section 106 payments from the promoters of property developments expected near the station do not reach this sum.[14] The Council funded a consultancy study, which concluded that in many scenarios a Kensal station would not compromise Crossrail performance. TfL is conducting a feasibility study on the station. The project is supported by local MPs, the residents of the Borough, National Grid, retailers Sainsbury's and Cath Kidston, and Jenny Jones (Green Party member of the London Assembly).[15] It is also supported by the adjoining London Borough of Brent.[16]",
			"after": [
				"The head office of Daily Mail and General Trust is in the Northcliffe House in Kensington.[17][18] Round Hill Capital has its headquarters in Chelsea.[19]",
				"Sonangol Limited, a subsidiary of the Sonangol Group, has its head office in Merevale House in Kensington.[20] KCPlanning has its head office at 96 Kensington High Street in the Drylands Building."
			],
			"color": "slate|0.32458 gray|0.32458 black|0.16896 light|0.12519 slate|0.12519 gray|0.12519 dark|0.08596 gray|0.08596 dark|0.08596 grey|0.08596 dim|0.052124 gray|0.052124 dim|0.052124 grey|0.052124 gray|0.039805 grey|0.039805 dark|0.028981 khaki|0.028981 silver|0.0188 pale|0.012868 golden|0.012868 rod|0.012868 tan|0.011394 light|0.0097336 steel|0.0097336 blue|0.0097336 saddle|0.0093921 brown|0.0093921  "
		}
	}
}
