{
	"add": {
		"doc": {
			"id": "40db39d3eb04873f43874e2ea22a39d676c3d4a6bb1f2ccfd9b490a63c6de3d4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/TWA_Lockheed_L-1011_Tristar_coach_cabin.jpg/220px-TWA_Lockheed_L-1011_Tristar_coach_cabin.jpg",
				"previous": "The L-1011 featured a highly advanced autopilot system and was the first widebody to receive FAA certification for Cat-IIIc autolanding, which approved the TriStar for completely blind landings in zero-visibility weather performed by the aircraft's autopilot.[23] The L-1011 used an Inertial Navigation System (INS) to navigate;[24][25] this included aligning the navigation system by entering current coordinates of longitude and latitude.",
				"after": "It also had a unique Direct Lift Control (DLC) system, which allowed for smooth approaches when landing, without having to use significant pitch changes while on the approach path.[26][27] DLC helps maintain the descending glideslope on final approach by automatically deploying spoiler panels on the wings. Thus, rather than maintaining the descent by adjusting pitch, DLC helps control the descent while maintaining a more consistent pitch angle, using four redundant hydraulic systems. Production also utilized a unique \"autoclave\" system for bonding fuselage panels together; this made the L-1011 extremely resistant to corrosion.",
			"color": "dim|0.11933 gray|0.11933 dim|0.11933 grey|0.11933 gray|0.07596 grey|0.07596 dark|0.074008 gray|0.074008 dark|0.074008 grey|0.074008 light|0.068409 steel|0.068409 blue|0.068409 silver|0.067925 tan|0.056793 firebrick|0.050128 light|0.047466 gray|0.047466 light|0.047466 grey|0.047466 light|0.045572 blue|0.045572 burly|0.034214 wood|0.034214 gainsboro|0.031527 black|0.030315 brown|0.027437 light|0.023083 slate|0.023083 gray|0.023083 dark|0.021997 slate|0.021997 gray|0.021997 wheat|0.020325 navajo|0.016389 white|0.016389 slate|0.015166 gray|0.015166 pale|0.014535 golden|0.014535 rod|0.014535 powder|0.012996 blue|0.012996 moccasin|0.012406  "
		}
	}
}
