{
	"add": {
		"doc": {
			"id": "40df30f1be16f252dedacdbc65db41206646db2310c0b5e4306f5b37c98d2873",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Haverfordwest_Main_Street_South_Wales.jpg/220px-Haverfordwest_Main_Street_South_Wales.jpg",
				"previous": "Those who knew Manning said that even as a child, she always had a mind of her own. She was an atheist who was openly opposed to religion, for example, remaining silent during the part of the Pledge of Allegiance that refers to God.[19] In a 2011 interview Manning's father said, \"People need to understand that he's a young man that had a happy life growing up.\" He also said that Manning excelled at the saxophone, science, and computers, creating her first website at the age of ten. Manning taught herself how to use PowerPoint, won the grand prize three years in a row at the local science fair, and in sixth grade, took top prize at a statewide quiz bowl.[20]",
				"after": "A childhood friend of Manning's, speaking about a conversation they had when Manning was 13, said \"he told me he was gay.\" The friend also stated that Manning's home life was not good and that her father was very controlling. Around this time, Manning's parents divorced, and she and her mother Susan moved out of the house to a rented apartment in Crescent, Oklahoma.[21] Susan's instability continued and in 1998 she attempted suicide; Manning's sister had to drive them to the hospital, with Manning sitting in the back of the car trying to make sure their mother was still breathing.[22]",
			"color": "dark|0.24948 slate|0.24948 gray|0.24948 black|0.11744 dim|0.10789 gray|0.10789 dim|0.10789 grey|0.10789 dark|0.066251 gray|0.066251 dark|0.066251 grey|0.066251 light|0.061893 gray|0.061893 light|0.061893 grey|0.061893 silver|0.05999 gray|0.056906 grey|0.056906 gainsboro|0.052275 white|0.018784 smoke|0.018784 alice|0.015977 blue|0.015977 azure|0.015466 mint|0.014668 cream|0.014668 ghost|0.011862 white|0.011862 light|0.011585 cyan|0.011585 light|0.011563 slate|0.011563 gray|0.011563 snow|0.011076 white|0.011065 slate|0.0098718 gray|0.0098718 floral|0.0093764 white|0.0093764 powder|0.0092747 blue|0.0092747 sea|0.0088862 shell|0.0088862 light|0.0080593 steel|0.0080593 blue|0.0080593 light|0.0075474 blue|0.0075474 honeydew|0.0075447 linen|0.0066197 lavender|0.0050253 blush|0.0050253  "
		}
	}
}
