{
	"add": {
		"doc": {
			"id": "40e0ffc4d5e9a2a85dadfbefcad336beea316e16fe69965d4c568bc89880c81c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Kissing_Prairie_dog_edit_3.jpg/220px-Kissing_Prairie_dog_edit_3.jpg",
				"previous": "Highly social, prairie dogs live in large colonies or \"towns\", and collections of prairie dog families that can span hundreds of acres. The prairie dog family groups are the most basic units of its society.[7] Members of a family group inhabit the same territory.[4] Family groups of black-tailed and Mexican prairie dogs are called \"coteries\", while \"clans\" are used to describe family groups of white-tailed, Gunnison’s, and Utah prairie dogs.[4] Although these two family groups are similar, coteries tend to be more closely knit than clans.[8] Members of a family group interact through oral contact or \"kissing\" and grooming one another.[6][7] They do not perform these behaviors with prairie dogs from other family groups.[7]",
				"after": "A prairie dog town may contain 15–26 family groups.[7] There may also be subgroups within a town, called \"wards\", which are separated by a physical barrier. Family groups exist within these wards. Most prairie dog family groups are made up of one adult breeding male, two to three adult females and one to two male offspring and one to two female offspring. Females remain in their natal groups for life and are thus the source of stability in the groups.[7] Males leave their natal groups when they mature to find another family group to defend and breed in. Some family groups contain more breeding females than one male can control, so have more than one breeding adult male in them. Among these multiple-male groups, some may contain males that have friendly relationships, but the majority contain males that have largely antagonistic relationships. In the former, the males tend to be related, while in the latter, they tend not to be related. Two to three groups of females may be controlled by one male. However, among these female groups, there are no friendly relations.[7]",
			"color": "saddle|0.28855 brown|0.28855 sienna|0.2353 tan|0.16061 burly|0.10852 wood|0.10852 black|0.10285 peru|0.04865  "
		}
	}
}
