{
	"add": {
		"doc": {
			"id": "40f9404fdcf5694bd14c47da70b4f32ab109aaf9f6587ed33633128c2cfb73df",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/River_Crossing_NGM-v31-p338.jpg/220px-River_Crossing_NGM-v31-p338.jpg",
			"previous": [],
				"after": "In December 1916, after ten brutal months of the Battle of Verdun and a successful offensive against Romania, the Germans attempted to negotiate a peace with the Allies. Soon after, the US president, Woodrow Wilson, attempted to intervene as a peacemaker, asking in a note for both sides to state their demands. Lloyd George's War Cabinet considered the German offer to be a ploy to create divisions amongst the Allies. After initial outrage and much deliberation, they took Wilson's note as a separate effort, signalling that the United States was on the verge of entering the war against Germany following the \"submarine outrages\". While the Allies debated a response to Wilson's offer, the Germans chose to rebuff it in favour of \"a direct exchange of views\". Learning of the German response, the Allied governments were free to make clear demands in their response of 14 January. They sought restoration of damages, the evacuation of occupied territories, reparations for France, Russia and Romania, and a recognition of the principle of nationalities. This included the liberation of Italians, Slavs, Romanians, Czecho-Slovaks, and the creation of a \"free and united Poland\". On the question of security, the Allies sought guarantees that would prevent or limit future wars, complete with sanctions, as a condition of any peace settlement.[125] The negotiations failed and the Entente powers rejected the German offer, because Germany did not state any specific proposals. To Wilson, the Entente powers stated that they would not start peace negotiations until the Central powers evacuated all occupied Allied territories and provided indemnities for all damage which had been done.[126]",
			"color": " "
		}
	}
}
