{
	"add": {
		"doc": {
			"id": "410148dda021249f7cde152bba8af6788207de823b2ae1b7b9a79450b0716c2d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/The_organ%2C_St._Helen%27s_Church%2C_Ashby-de-la-Zouch.jpg/170px-The_organ%2C_St._Helen%27s_Church%2C_Ashby-de-la-Zouch.jpg",
				"previous": "The church had much stained glass in 1622 that disappeared during the Reformation. The current eleven coloured glass windows on the north, west and south sides of the church were erected in 1879 by Lavers, Barraud and Westlake, each being named for its donor; the scenes depicted tell the story of Jesus from the Annunciation to the Last Supper.[6][20] The stained glass in the chancel and the Hasting Chapel was erected in 1924, and most was once in the castle,[21] although the earliest glass is a German, Swiss and Flemish work possibly originally from Farleigh Hungerford.[17] The chancel's east window contains arms of Richard I and Edward I and the south window includes \"The Magi bearing gifts\" and the arms of Catherine Parr. The Hastings Chapel south window has several panels from the fifteenth and sixteenth centuries, and one which could possibly be as old as the thirteenth century. The chapel's east window also has some high quality work, including \"The Last Supper\". The large west window in the tower is plain glass, as is the clerestory.[21]",
				"after": "The rare finger pillory at the west end immobilised offenders without exposing them to the public degradation associated with the stocks.[13][22] In the centre aisle hangs a large brass candelabrum donated by Leonard Piddocke, High Bailiff of Leicester, in 1733. It is surmounted by a brass dove and was made by William Parsons of London. Some of the branches were stolen in 1776, but soon recovered.[21][23]",
			"color": "black|0.34615 dim|0.21812 gray|0.21812 dim|0.21812 grey|0.21812 gray|0.16011 grey|0.16011 dark|0.11724 gray|0.11724 dark|0.11724 grey|0.11724 silver|0.053067 light|0.023593 gray|0.023593 light|0.023593 grey|0.023593  "
		}
	}
}
