{
	"add": {
		"doc": {
			"id": "4107407f0e14e044f7db58f4cde7f93ab9e71232f1063511e2b24b3ba35062e7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Grosswojwod.jpg/70px-Grosswojwod.jpg",
			"previous": [],
				"after": "During the Middle Ages, the Vojvoda was a military commander rank and a noble title. In 1691, the Serbs who lived in the Habsburg Monarchy (now Vojvodina province in northern Serbia) gained from the Habsburg emperor the right to territorial autonomy within one separate voivodeship in the Habsburg Monarchy, as well as right to be ruled by a Serb voivode - a civil and military administrator. However, the voivodeship was not formed at that time, nor was a voivode appointed, only a vice-voivode. Jovan Monasterlija was the vice-viovode of the Serbs between 1691 and 1706. After him, no other vice-voivodes were appointed. At the May Assembly in Sremski Karlovci (May 13–15, 1848), recalling the privilege from 1691, the Serbs proclaimed the creation of the Serbian Vojvodina and elected Stevan Šupljikac as voivode. These actions were later recognized by the Austrian emperor, and Šupljikac was recognized as a voivode. By a decision of the Austrian emperor, in November 1849, a new province was formed as the political successor of the Serbian voivodeship. It was known as the Serbian Voivodship and Tamiš Banat. The new voivodeship existed between 1849 and 1860 and the title of great voivode (Grosswojwod) belonged to Emperor Franz Joseph I of Austria himself, though it was ruled by an appointed governor. After the voivodeship was abolished in 1860, Franz Joseph I kept the title of great voivode of the Voivodship of Serbia until his death in 1916. His successor, Karl I of Austria, also retained the title until the end of the monarchy in 1918.",
			"color": "dark|0.18104 gray|0.18104 dark|0.18104 grey|0.18104 silver|0.13843 light|0.12004 gray|0.12004 light|0.12004 grey|0.12004 gainsboro|0.10489 gray|0.088503 grey|0.088503 white|0.046326 smoke|0.046326 lavender|0.034251 blush|0.034251 alice|0.033451 blue|0.033451 ghost|0.033044 white|0.033044 snow|0.030308 sea|0.028905 shell|0.028905 white|0.025853 dim|0.022662 gray|0.022662 dim|0.022662 grey|0.022662 linen|0.021999 mint|0.019155 cream|0.019155 floral|0.017667 white|0.017667 azure|0.013223 lavender|0.007997 salmon|0.0056276 light|0.0038819 coral|0.0038819 rosy|0.0029174 brown|0.0029174 thistle|0.0028218  "
		}
	}
}
