{
	"add": {
		"doc": {
			"id": "4113eaec748790137ce32a75b509154148a072a87a43702ff6cbbcb3499a13d7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/MenziesHassettLindwallWorrell.jpg/270px-MenziesHassettLindwallWorrell.jpg",
				"previous": "The end of the tour represented a changing of the guard in Australian cricket. In their late 30s, Johnson[88] and Miller retired from first-class cricket.[89] In the 1956–57 season, Lindwall took 27 wickets at 23.74 and made 243 runs at 27.00. Having had a successful series in the most recent international fixtures, Lindwall had no reason to expect anything but a continuation of his senior role in the team.[87] Furthermore, having captained the team in the absence of Johnson and Miller, Lindwall was the now the player with the most seniority in terms of leadership. However, when the team for the 1957–58 South African tour was announced, Lindwall's name was omitted altogether.[90] Lindwall heard the news on the radio while he was working, having not being given prior notice.[87] After three consecutive Ashes defeats during Australia's decline in the mid-1950s, the selectors had turned to a radical youth policy in an attempt to reverse the slide. Ian Craig was made youngest Australia's captain at the age of 22, having played only six Tests without securing a regular place in the team.[91] The pacemen selected were Davidson, Ian Meckiff, Ron Gaunt and John Drennan.[87][90] Davidson had managed only 16 wickets at 34.06 in 12 Tests, while the remaining three had yet to play a Test.[92][93][94] While Craig's men defeated South Africa 3–0, Lindwall continued his consistent performances for Queensland in the Sheffield Shield, with 26 wickets at 25.77 and 274 runs at 34.25.[95] During the seasons, Lindwall broke Ernie Jones' record of 209 wickets in Shield competitions in his 54th match in the competition.[96]",
				"after": "During the winter of 1958, nearing his 37th birthday, Lindwall stepped up his bid to reclaim his Test place. He committed him to an intense fitness program that included a 5 km daily run followed by vigorous exercises to increase his abdominal and back strength. He set up equipment in his garage. Lindwall was determined to add to his Test tally of 212 wickets, which was just four behind the Australian record of Clarrie Grimmett. He was unmoved by a 6000 pound offer from an English newspaper to cover the 1958–59 Ashes series as a journalist, instead wanting to play in the series.[95]",
			"color": " "
		}
	}
}
