{
	"add": {
		"doc": {
			"id": "411e9f6020a9f2ca0bf11d941185fbbaf89e4c0421cd3b9087b7a3d92e53ee0f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Ashs-teacher-and-students.jpg/220px-Ashs-teacher-and-students.jpg",
				"previous": "In India, for example, compulsory education spans over twelve years, with eight years of elementary education, five years of primary schooling and three years of upper primary schooling. Various states in the republic of India provide 12 years of compulsory school education based on a national curriculum framework designed by the National Council of Educational Research and Training.",
				"after": "In most contemporary educational systems of the world, secondary education comprises the formal education that occurs during adolescence. It is characterized by transition from the typically compulsory, comprehensive primary education for minors, to the optional, selective tertiary, \"postsecondary\", or \"higher\" education (e.g. university, vocational school) for adults. Depending on the system, schools for this period, or a part of it, may be called secondary or high schools, gymnasiums, lyceums, middle schools, colleges, or vocational schools. The exact meaning of any of these terms varies from one system to another. The exact boundary between primary and secondary education also varies from country to country and even within them, but is generally around the seventh to the tenth year of schooling. Secondary education occurs mainly during the teenage years. In the United States, Canada and Australia, primary and secondary education together are sometimes referred to as K-12 education, and in New Zealand Year 1–13 is used. The purpose of secondary education can be to give common knowledge, to prepare for higher education, or to train directly in a profession.",
			"color": "black|0.42203 brown|0.12018 tan|0.058879 misty|0.027804 rose|0.027804 sea|0.022357 shell|0.022357 floral|0.021382 white|0.021382 white|0.019056 smoke|0.019056 snow|0.018501 firebrick|0.017337 white|0.016476 mint|0.016422 cream|0.016422 rosy|0.016398 brown|0.016398 linen|0.015962 antique|0.015095 white|0.015095 peach|0.015041 puff|0.015041 ghost|0.012248 white|0.012248 old|0.012101 lace|0.012101 ivory|0.011986 azure|0.011906 lavender|0.010526 blush|0.010526 alice|0.010388 blue|0.010388 light|0.007824 coral|0.007824 indian|0.0075312 red|0.0075312 maroon|0.007459 bisque|0.0064686 silver|0.0063385 light|0.0063227 gray|0.0063227 light|0.0063227 grey|0.0063227 papaya|0.0062605 whip|0.0062605 salmon|0.0059266 dark|0.0058563 salmon|0.0058563 gainsboro|0.0055965 dim|0.0052707 gray|0.0052707 dim|0.0052707 grey|0.0052707  "
		}
	}
}
