{
	"add": {
		"doc": {
			"id": "4176c71bacf676d93a8ef61b9a3a842b5e7658fd4f2888e3040288a82747145e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/GardenED.jpg/120px-GardenED.jpg",
				"previous": "Portal:Arts/Featured article/16",
				"after": "The Garden of Earthly Delights is a triptych painted by the early Netherlandish master Hieronymus Bosch (c. 1450–1516), housed in the Museo del Prado in Madrid since 1939. Dating from 1503 and 1504, when Bosch was about 50 years old, it is his best-known and most ambitious work. Bosch's masterpiece reveals the artist at the height of his powers. The triptych comprises three sections, a square inner panel with rectangular panels on either side which close as shutters. The panels are painted in oil, the exterior panels of the shutters being in grisaille. The outer wings, when folded shut, show the earth during the Creation. The three scenes of the inner triptych are probably intended to be read chronologically from left to right. The left panel depicts God presenting to Adam the newly created Eve. The central panel is a broad panorama of sexually engaged nude figures, fantastical animals, oversized and gorged fruit, and hybrid stone formations. The right panel is a hellscape and portrays the torments of damnation. Art historians and critics frequently interpret the painting as a didactic warning on the perils of life's temptations. American writer Peter S. Beagle describes it as an \"erotic derangement that turns us all into voyeurs, a place filled with the intoxicating air of perfect liberty\".",
			"color": "dark|0.11286 gray|0.11286 dark|0.11286 grey|0.11286 dark|0.096368 khaki|0.096368 dim|0.095881 gray|0.095881 dim|0.095881 grey|0.095881 gray|0.091866 grey|0.091866 light|0.076552 slate|0.076552 gray|0.076552 silver|0.072577 slate|0.041895 gray|0.041895 tan|0.041059 light|0.037594 steel|0.037594 blue|0.037594 rosy|0.036861 brown|0.036861 light|0.03489 gray|0.03489 light|0.03489 grey|0.03489 dark|0.030808 olive|0.030808 green|0.030808 gainsboro|0.021274 burly|0.020368 wood|0.020368 light|0.018804 blue|0.018804 black|0.016232 dark|0.01313 slate|0.01313 gray|0.01313 sienna|0.011067  "
		}
	}
}
