{
	"add": {
		"doc": {
			"id": "4190116619330670ef26217c76f7d1243643c2fac260c6f447cb70268a12042f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Palace_of_Westminster%2C_London_-_Feb_2007.jpg/220px-Palace_of_Westminster%2C_London_-_Feb_2007.jpg",
				"previous": "The position of prime minister,[nb 8] the UK's head of government,[155] belongs to the person most likely to command the confidence of the House of Commons; this individual is typically the leader of the political party or coalition of parties that holds the largest number of seats in that chamber. The prime minister chooses a cabinet and its members are formally appointed by the monarch to form Her Majesty's Government. By convention, the Queen respects the prime minister's decisions of government.[156]",
				"after": "The cabinet is traditionally drawn from members of the prime minister's party or coalition and mostly from the House of Commons but always from both legislative houses, the cabinet being responsible to both. Executive power is exercised by the prime minister and cabinet, all of whom are sworn into the Privy Council of the United Kingdom, and become Ministers of the Crown. The current Prime Minister is David Cameron, who has been in office since 11 May 2010.[157] Cameron is the leader of the Conservative Party and heads a coalition with the Liberal Democrats. For elections to the House of Commons, the UK is currently divided into 650 constituencies,[158] each electing a single member of parliament (MP) by simple plurality. General elections are called by the monarch when the prime minister so advises. The Parliament Acts 1911 and 1949 require that a new election must be called no later than five years after the previous general election.[159]",
			"color": "black|0.51891 saddle|0.13381 brown|0.13381 chocolate|0.080345 sienna|0.075545 dim|0.061966 gray|0.061966 dim|0.061966 grey|0.061966 slate|0.035592 gray|0.035592 peru|0.028975 gray|0.027206 grey|0.027206 light|0.0094147 slate|0.0094147 gray|0.0094147  "
		}
	}
}
