{
	"add": {
		"doc": {
			"id": "41a2efb5f41893cb9ca09a1eddd4a10196e06c762aadb762dcc0cc88adba891b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Royal_Air_Maroc_Boeing_727-200Adv_CN-CCH_DUS_1993-4-14.png/220px-Royal_Air_Maroc_Boeing_727-200Adv_CN-CCH_DUS_1993-4-14.png",
				"previous": "A single Caravelle was part of the fleet of four L-749 Constellations, four DC-4s and three DC-3s by April 1960 (1960-04), making the Caravelle the first jet aircraft operated by the company; another Caravelle was yet to be delivered.[7] The type began serving the Rabat–Bamako route in July 1961 (1961-07). By 1964, there were three Caravelles in the fleet.[9] A fourth was ordered in late 1964.[12] At April 1965 (1965-04), the company had 758 employees and chairmanship was held by Mohammed Al Fassi. The route network included services within North Africa, and also linked North Africa with France, Germany, Italy, Spain and Switzerland; the Casablanca–Dakar and Casablanca–Las Palmas sectors were also flown. Shareholding at the time was split between the government of Morocco (64%), Air France (21%), Compagnie Generale Transatlantique (7.6%), Aviacion y Comercio (5%) and others (2.4%).[13] An order for a fifth Caravelle was placed in early 1968.[14] By 1969, all routes to Europe and North Africa were flown using solely these aircraft.[15] In 1969, the carrier placed its first order with Boeing.[16]",
				"after": "Royal Air Maroc took delivery of the first Boeing aircraft, a Boeing 727-200, in 1970,[17] with the carrier deploying it on revenue service on 15 May.[9] Subsidiary airline Royal Air Inter was formed early in the year to undertake domestic routes using Fokker F-27 Friendship equipment; this sister company started operations on 2 April 1970, and by May 1971 (1971-05), it was serving Agadir, Al Hoceima, Casablanca, Fez, Marrakesh, Oujda, Rabat, Tangier and Tetouan.[18] The RAM's fleet at May 1971 (1971-05) comprised two Boeing 727-200s, along with four Caravelles and two SIAI Marchetti SF.260s.[19] At a cost of US$8.85 million, a third Boeing 727-200 was ordered in 1972.[20] In 1974, the carrier ordered a single Boeing 727-200 Advanced,[21] followed by an order for a fourth Boeing 727-200.[22] Also that year, negotiations with Air France for the lease of a Boeing 707-320B started.[9] By March 1975 (1975-03), the Boeing 707 was part of an 11-strong fleet, along with four Boeing 727-200s, four Caravelles, and two SIAI Marchetti SF.260s.[23] RAM flew the leased Boeing 707 to New York for the first time in April 1975 (1975-04), becoming the first Arab airline in serving this destination.[9] During the year, the company acquired three Boeing 737-200s to replace the Caravelles.[24] Also in 1975, a weekly non-stop service to Rio de Janeiro was started.[25] An order for three more Boeing 727-200s was placed in early 1976.[26] That year, the four Caravelles were withdrawn from service and sold. A Boeing 747-200B entered the fleet in September 1978 (1978-09).[25]",
			"color": "dark|0.34202 gray|0.34202 dark|0.34202 grey|0.34202 silver|0.23765 slate|0.093019 gray|0.093019 light|0.086533 slate|0.086533 gray|0.086533 light|0.072426 gray|0.072426 light|0.072426 grey|0.072426 dim|0.036704 gray|0.036704 dim|0.036704 grey|0.036704 gainsboro|0.033397 gray|0.027319 grey|0.027319 light|0.014067 blue|0.014067 powder|0.011072 blue|0.011072 cadet|0.0091228 blue|0.0091228 dark|0.005185 slate|0.005185 gray|0.005185 light|0.0045604 cyan|0.0045604  "
		}
	}
}
