{
	"add": {
		"doc": {
			"id": "41a63db798439fd449c283140dce504298667ed781efafb06138bb0ee8decff9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/A_Bonobo_at_the_San_Diego_Zoo_%22fishing%22_for_termites.jpg/250px-A_Bonobo_at_the_San_Diego_Zoo_%22fishing%22_for_termites.jpg",
				"previous": "A multi-tool is a hand tool that incorporates several tools into a single, portable device; the Swiss army knife represents one of the earliest examples. Other tools have a primary purpose but also incorporate other functionality - for example, lineman's pliers incorporate a gripper and cutter, and are often used as a hammer; and some hand saws incorporate a carpenter's square in the right-angle between the blade's dull edge and the saw's handle. This would also be the category in which the \"multi-purpose\" tools since they are also multiple tools in one (multi-use and multi-purpose can be used interchangeably). These types of tools were specifically made to catch the eye of many different craftsman who traveled to do their work. To these workers these types of tools were revolutionary because they were one tool or one device that could do several different things. With this new revolution of tools the traveling craftsman would not have to carry so many tools with them to job sites, being that their space would be limited to the vehicle they were driving. The problem of having to deal with so many different tools was solved with the overtaking of multi-use tools.",
				"after": "Observation has confirmed that a number of species can use tools including monkeys, apes, elephants, several birds, and sea otters. Philosophers originally thought that only humans had the ability to make tools, until zoologists observed birds[10] and monkeys[11][12][13] making tools. Now the unique relationship of humans with tools is considered to be that we are the only species that uses tools to make other tools.[14]",
			"color": "dim|0.23983 gray|0.23983 dim|0.23983 grey|0.23983 dark|0.20083 gray|0.20083 dark|0.20083 grey|0.20083 gray|0.15724 grey|0.15724 silver|0.15054 light|0.078391 gray|0.078391 light|0.078391 grey|0.078391 black|0.050005 gainsboro|0.046883 linen|0.014766 antique|0.01168 white|0.01168 old|0.0084705 lace|0.0084705 sea|0.0079288 shell|0.0079288  "
		}
	}
}
