{
	"add": {
		"doc": {
			"id": "41abc88d7a10271d931aeb144074812685d815c62b590849a1ae7e502f41ab17",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Queensway_Quay.jpg/220px-Queensway_Quay.jpg",
				"previous": "Tourism is also a significant industry. Gibraltar is a popular port for cruise ships and attracts day visitors from resorts in Spain. The Rock is a popular tourist attraction, particularly among British tourists and residents in the southern coast of Spain. It is also a popular shopping destination, and all goods and services are VAT free, but may be subject to Gibraltar taxes. Many of the large British high street chains have branches or franchises in Gibraltar including Morrisons, Marks & Spencer and Mothercare. Branches and franchises of international retailers such as Tommy Hilfiger and Sunglass Hut are also present in Gibraltar, as is the Spanish clothing company Mango.",
				"after": "A number of British and international banks have operations based in Gibraltar. Jyske Bank claims to be the oldest bank in the country, based on Jyske's acquisition in 1987 of Banco Galliano, which began operations in Gibraltar in 1855. An ancestor of Barclays, the Anglo-Egyptian Bank, entered in 1888, and Credit Foncier (now Crédit Agricole) entered in 1920.",
			"color": "black|0.33192 tan|0.10234 burly|0.046716 wood|0.046716 wheat|0.041257 bisque|0.037258 peach|0.03623 puff|0.03623 dim|0.030662 gray|0.030662 dim|0.030662 grey|0.030662 gray|0.03014 grey|0.03014 blanched|0.028834 almond|0.028834 dark|0.024857 gray|0.024857 dark|0.024857 grey|0.024857 moccasin|0.024728 antique|0.021748 white|0.021748 navajo|0.021726 white|0.021726 papaya|0.020247 whip|0.020247 silver|0.013484 corn|0.010608 silk|0.010608 linen|0.009271 light|0.0092455 gray|0.0092455 light|0.0092455 grey|0.0092455 old|0.009227 lace|0.009227 sea|0.0089424 shell|0.0089424 beige|0.0088762 floral|0.0087173 white|0.0087173 gainsboro|0.0073281 white|0.0070335 smoke|0.0070335 snow|0.0067198 ivory|0.0061694 mint|0.0060453 cream|0.0060453 white|0.0060297  "
		}
	}
}
