{
	"add": {
		"doc": {
			"id": "41ac3e7265edacc459a1c6db9c808af941accb3c0e0f8b00bc3bfeb15e7f23a1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/SB2U-3_VMSB-231_Ewa_7Dec1941.jpg/220px-SB2U-3_VMSB-231_Ewa_7Dec1941.jpg",
				"previous": "The air portion of the attack began at 7:48 a.m. Hawaiian Time[13] (3:18 a.m. December 8 Japanese Standard Time, as kept by ships of the Kido Butai),[85][nb 14] with the attack on Kaneohe. A total of 353[14] Japanese planes in two waves reached Oahu. Slow, vulnerable torpedo bombers led the first wave, exploiting the first moments of surprise to attack the most important ships present (the battleships), while dive bombers attacked U.S. air bases across Oahu, starting with Hickam Field, the largest, and Wheeler Field, the main U.S. Army Air Forces fighter base. The 171 planes in the second wave attacked the Army Air Forces' Bellows Field near Kaneohe on the windward side of the island, and Ford Island. The only aerial opposition came from a handful of P-36 Hawks, P-40 Warhawks, and some SBD Dauntless dive bombers from the carrier USS Enterprise.[nb 15]",
				"after": "Men aboard U.S. ships awoke to the sounds of alarms, bombs exploding, and gunfire, prompting bleary-eyed men to dress as they ran to General Quarters stations. (The famous message, \"Air raid Pearl Harbor. This is not drill.\",[nb 16] was sent from the headquarters of Patrol Wing Two, the first senior Hawaiian command to respond.) The defenders were very unprepared. Ammunition lockers were locked, aircraft parked wingtip to wingtip in the open to deter sabotage,[86] guns unmanned (none of the Navy's 5\"/38s, only a quarter of its machine guns, and only four of 31 Army batteries got in action).[86] Despite this low alert status, many American military personnel responded effectively during the attack.[nb 17] Ensign Joe Taussig Jr., aboard USS Nevada, commanded the ship's antiaircraft guns and was severely wounded, but continued to be on post. Lt. Commander F.J. Thomas commanded USS Nevada in the captain's absence and got her under way until the ship was grounded at 9:10 a.m.[87] One of the destroyers, USS Aylwin, got underway with only four officers aboard, all ensigns, none with more than a year's sea duty; she operated at sea for 36 hours before her commanding officer managed to get back aboard.[88] Captain Mervyn Bennion, commanding USS West Virginia, led his men until he was cut down by fragments from a bomb which hit USS Tennessee, moored alongside.",
			"color": " "
		}
	}
}
