{
	"add": {
		"doc": {
			"id": "41c761139bc46df4094c2b29e97902eeb11c50ff2d0a4b27e95acc37456a87fb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Portrait_of_Barbara_D%C3%BCrer_detail.jpg/200px-Portrait_of_Barbara_D%C3%BCrer_detail.jpg",
				"previous": "Barbara Holper was the daughter of Hieronymus Holper, under whom Albrecht the Elder served his apprenticeship as a goldsmith.[16] The two men became friends, and when she came of age Holper gave his daughter into marriage when Dürer senior was 40 and she was 15.[14] The couple were compatible, well-matched and fond of each other. Yet their son's writings detail their difficult lives and many setbacks; three of their 18 children survived into adulthood – 17 of whom had been born by the time of this portrait.[17] After her husband died Barbara was destitute and went to live with her son.[18] After she in turn died in 1514, her son wrote \"This my pious Mother ... often had the plague and many other severe and strange illnesses, and she suffered great poverty, scorn, contempt, mocking words, terrors, and great adversities. Yet she bore no malice. Also she died hard ... I felt so grieved for her that I cannot express it.\"[19]",
				"after": "Barbara is shown wearing a red dress and a matte white bonnet which fully covers her hair, indicating her marital status.[10] Her headdress is draped with a long scarf or train which stretches down her neck and across her left shoulder, contrasting in colour and shape against the black head-wear of her husband. The lines of her face contain touches of white paint to give a highlighting and enlivening effect; they are especially evident around her eyes, the bridge of her nose and around her upper lip.[13] Barbara was attractive in her youth; her son described her as having been \"comely and of erect bearing\".[20][D] However by the time of this portrait the effects of time and losing so many children weigh heavily on her face.[9] The panel was grounded with white paint, while the composition seems to have changed significantly from the imprimatura. Faint traces of the original figuration are visible in parts of the background and in the darkened areas of her hood.[4] At some point the panel was cut down at the left side, shifting the compositional balance and removing a portion of her shoulder and headdress.[9]",
			"color": "dim|0.20692 gray|0.20692 dim|0.20692 grey|0.20692 dark|0.13305 slate|0.13305 gray|0.13305 peach|0.099294 puff|0.099294 gray|0.085885 grey|0.085885 dark|0.079805 gray|0.079805 dark|0.079805 grey|0.079805 tan|0.073959 slate|0.059976 gray|0.059976 rosy|0.052069 brown|0.052069 light|0.04455 slate|0.04455 gray|0.04455 silver|0.039805 light|0.028101 gray|0.028101 light|0.028101 grey|0.028101 gainsboro|0.020915 bisque|0.014815  "
		}
	}
}
