{
	"add": {
		"doc": {
			"id": "41c802ca24e294158a387dbe1dd01e58f5628f9868c9c86569548f194b58d86e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/KelleyPointPark_tug.jpg/220px-KelleyPointPark_tug.jpg",
				"previous": "The Vanport flood induced changes to the slough's system of levees, which were rebuilt and in some cases fortified to withstand a 100-year flood. Instead of repairing the levee along the Peninsula Canal, the city plugged it at both ends. The disaster also affected Oregon's system of higher education. After floodwaters destroyed the Vanport Extension Center, set up in 1946, the Oregon Board of Higher Education reestablished the school in downtown Portland, where it eventually became Portland State University.[45]",
				"after": "Debate about how to use the slough and its watershed continued through the rest of the century. In 1964, the Port of Portland, interested in industrial development, began to fill Smith, Bybee, and Ramsey lakes with dredge sands from the Columbia.[45] In the 1970s, the Oregon Legislature passed a law against filling Smith or Bybee lakes below a contour line 11 feet (3.4 m) above mean sea level except to enhance fish and wildlife habitat.[45] Plans for a Willamette River Greenway project proposed by Oregon Governor Tom McCall in the late 1960s called for park and recreation areas along the Willamette and many of its tributaries but ignored the slough.[55] Some planners argued that the slough was so filthy that more industry was all it was good for. They portrayed cleanup as a lofty but impractical goal.[55]",
			"color": "light|0.23173 blue|0.23173 powder|0.11395 blue|0.11395 light|0.10023 slate|0.10023 gray|0.10023 light|0.097467 sky|0.097467 blue|0.097467 dark|0.083838 gray|0.083838 dark|0.083838 grey|0.083838 slate|0.078307 gray|0.078307 sky|0.073387 blue|0.073387 gray|0.052515 grey|0.052515 light|0.041851 steel|0.041851 blue|0.041851 silver|0.037306 dim|0.035901 gray|0.035901 dim|0.035901 grey|0.035901 dark|0.011353 slate|0.011353 gray|0.011353 black|0.0091227 light|0.0087056 gray|0.0087056 light|0.0087056 grey|0.0087056 gainsboro|0.004398  "
		}
	}
}
