{
	"add": {
		"doc": {
			"id": "41d34a171425a50937ddac59f9ad3a3b83ea341a56765532208c889a5e94d1bc",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f8/Anachronox_Characters.png/220px-Anachronox_Characters.png",
			"previous": [],
				"after": "The protagonist of Anachronox is Sylvester \"Sly Boots\" Bucelli, a human and former private detective on Anachronox. Twenty-nine years old and described as \"bold, brash, and overconfident\", Boots has gotten himself into trouble and now runs his agency out of rented storage space above a seedy bar.[11] His only friends are PAL-18, his spirited, sarcastic robot assistant since childhood, and Fatima Doohan, his secretary. Fatima was fatally injured and digitized by Boots onto a PDA-analogue \"LifeCursor\", where she bitterly lives to render assistance.[11][12] Several allies join Boots over the course of the game; first is 71-year-old Grumpos Matavastros, a \"scholar, outdoorsman, eccentric recluse, and renaissance man\"—and a very grumpy person.[13] A former curator of the MysTech museum on Anachronox, Grumpos devotes his life to studying the artifacts. Dr. Rho Bowman joins the party on Sunder; she is a brilliant scientist who's been branded a heretic after publication of her book, MysTech Awake![14] The team then gains support from Democratus, an eccentric planet boasting a planetary ring and brilliant technology. Said technology includes having the planet shrink to human height to be part of the team. Two further allies are the femme fatale Stiletto Anyway—a 25-year-old former companion of Boots known for being stealthy and aloof[15]—and Paco \"El Puño\" Estrella, a washed up superhero who's turned to alcoholism after his comic book series was canceled.[16] Their foes include Detta, a heavyset crime boss/kingpin on planet Anachronox,[17] and several other monsters and shady characters.",
			"color": "dim|0.33166 gray|0.33166 dim|0.33166 grey|0.33166 gray|0.27211 grey|0.27211 black|0.093239 dark|0.072451 olive|0.072451 green|0.072451 dark|0.044113 gray|0.044113 dark|0.044113 grey|0.044113 dark|0.041746 slate|0.041746 gray|0.041746 olive|0.028789 drab|0.028789  "
		}
	}
}
