{
	"add": {
		"doc": {
			"id": "41e3d01747a91481c9f884cfb0ef73059d9f5b65b5684af96bcf8cb13f77cc5c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Battle_of_Omdurman-1.JPG/220px-Battle_of_Omdurman-1.JPG",
				"previous": "Regional relations remained tense throughout much of the Mahdiyah period, largely because of the Khalifa's brutal methods to extend his rule throughout the country. In 1887, a 60,000-man Ansar army invaded Ethiopia, penetrating as far as Gondar. In March 1889, king Yohannes IV of Ethiopia, marched on Metemma; however, after Yohannes fell in battle, the Ethiopian forces withdrew. Abd ar Rahman an Nujumi, the Khalifa's general, attempted an invasion of Egypt in 1889, but British-led Egyptian troops defeated the Ansar at Tushkah. The failure of the Egyptian invasion broke the spell of the Ansar's invincibility. The Belgians prevented the Mahdi's men from conquering Equatoria, and in 1893, the Italians repelled an Ansar attack at Akordat (in Eritrea) and forced the Ansar to withdraw from Ethiopia.",
				"after": "In the 1890s, the British sought to re-establish their control over Sudan, once more officially in the name of the Egyptian Khedive, but in actuality treating the country as a British colony. By the early 1890s, British, French and Belgian claims had converged at the Nile headwaters. Britain feared that the other powers would take advantage of Sudan's instability to acquire territory previously annexed to Egypt. Apart from these political considerations, Britain wanted to establish control over the Nile to safeguard a planned irrigation dam at Aswan.",
			"color": "tan|0.39347 wheat|0.09004 gray|0.085855 grey|0.085855 dim|0.078447 gray|0.078447 dim|0.078447 grey|0.078447 dark|0.063398 gray|0.063398 dark|0.063398 grey|0.063398 burly|0.050046 wood|0.050046 peach|0.043174 puff|0.043174 black|0.038846 silver|0.028796 bisque|0.025524 moccasin|0.011848 rosy|0.0099198 brown|0.0099198 light|0.0095683 gray|0.0095683 light|0.0095683 grey|0.0095683 navajo|0.0092738 white|0.0092738 blanched|0.0090113 almond|0.0090113 antique|0.0070556 white|0.0070556 slate|0.0049859 gray|0.0049859  "
		}
	}
}
