{
	"add": {
		"doc": {
			"id": "41f17dc3fb5860d501b93596aae1dc355ab8bddbfb06875753a8146dc67bb4b7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Hamilton_Project2.jpg/900px-Hamilton_Project2.jpg",
				"previous": "Hamilton Harbour is a natural harbour with a large sandbar called the Beachstrip. This sandbar was deposited during a period of higher lake levels during the last ice age, and extends southeast through the central lower city to the escarpment. Hamilton's deep sea port is accessed by ship canal through the beach strip into the harbour and is traversed by two bridges, the QEW's Burlington Bay James N. Allan Skyway and the lower Canal Lift Bridge.[30]",
				"after": "Between 1788 and 1793, the townships at the Head-of-the-Lake were surveyed and named. The area was first known as The Head-of-the-Lake for its location at the western end of Lake Ontario.[19] John Ryckman, born in Barton township (where present day downtown Hamilton is), described the area in 1803 as he remembered it: \"The city in 1803 was all forest. The shores of the bay were difficult to reach or see because they were hidden by a thick, almost impenetrable mass of trees and undergrowth ... Bears ate pigs, so settlers warred on bears. Wolves gobbled sheep and geese, so they hunted and trapped wolves. They also held organized raids on rattlesnakes on the mountainside. There was plenty of game. Many a time have I seen (sic) a deer jump the fence into my back yard, and there were millions of pigeons which we clubbed as they flew low.\"[31]",
			"color": "dim|0.25336 gray|0.25336 dim|0.25336 grey|0.25336 black|0.22211 tan|0.10833 gray|0.10238 grey|0.10238 slate|0.087655 gray|0.087655 light|0.036879 slate|0.036879 gray|0.036879 wheat|0.026243 burly|0.025674 wood|0.025674 moccasin|0.022805 navajo|0.019035 white|0.019035 pale|0.016151 golden|0.016151 rod|0.016151 lemon|0.012075 chiffon|0.012075 peach|0.011428 puff|0.011428 dark|0.010613 gray|0.010613 dark|0.010613 grey|0.010613 bisque|0.010032 light|0.0065378 golden|0.0065378 rod|0.0065378 yellow|0.0065378 blanched|0.0062172 almond|0.0062172  "
		}
	}
}
