{
	"add": {
		"doc": {
			"id": "41fe4efa97f9b458379218839f6abfd8893e11c3c7a9233576259a1bad7c7dbe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Tanks_and_Afvs_of_the_British_Army_1939-45_KID1325A.jpg/220px-Tanks_and_Afvs_of_the_British_Army_1939-45_KID1325A.jpg",
				"previous": "Because of a lack of equipment training facilities in mid-1940, when the British airborne establishment was formed, the War Office was able to accept only 500 volunteers for training as airborne troops.[37] Progress in setting up proper training facilities and acquiring suitable transport aircraft was so slow that the first British airborne operation, Operation Colossus, was conducted by a retrained Commando unit.[38] By 1942, there existed specifically trained airborne units, including the 1st Airborne Division, and on 19 January 1942 the War Office decided that a light tank unit would be one of the support units attached to the division. This unit, designated the Light Tank Squadron, was to be formed of nineteen light tanks and would operate to the fore of the division, using their tanks' speed to capture objectives and then holding them until relieved by other units.[39] The obvious unit for conversion was 'C' Special Services Squadron, as it was trained to act as an independent tank unit and, more importantly, was the only unit that was still using Tetrarchs; it had been re-designated as an airborne tank by the War Office. 'C' Squadron was officially transferred to the 1st Airborne Division on 24 June 1942, bringing with it seven Tetrarchs among its other vehicles.[40] The unit immediately began training, but was not attached to the 1st Airborne Division for long; during mid-1943, the division was transported to the Middle East so it could participate in the Allied invasion of Sicily. 'C' Squadron remained in Britain, as not enough Hamilcar gliders had been built by the time the division departed to transport its Tetrarchs;[41] the squadron was transferred to the 6th Airborne Division, which had been raised in April 1943, and 'C' Squadron remained with it for the rest of the conflict. The squadron continued to train as an air-portable unit, and participated in a number of exercises to prepare for its new duties, including reconnaissance of enemy positions and counter-attacking enemy infantry and armour.[42]",
				"after": "On 13 December 1943, the War Office decided to expand the squadron into a regiment equipped with a combination of light tanks and conventional reconnaissance vehicles such as scout cars, and on 1 April 1944, it was re-designated as the 6th Airborne Armoured Reconnaissance Regiment.[43] The regiment consisted of a Headquarters Squadron, a Light Tank Squadron and a Reconnaissance Squadron; two Tetrarchs, the Mark 1 CS variation, were attached to the Headquarters Squadron, but the Light Tank Squadron, also known as 'A' Squadron, received the majority of the Tetrarchs. 'A' Squadron had approximately nineteen Tetrarchs split between six troops, two of which were of the CS variation and the rest were armed with 2 pounders fitted with Littlejohn adaptors.[44] On 24 May 1944, after participating in a further series of exercises and manoeuvres, 'A' Squadron moved from their training area to a transit camp at Tarrant Rushton airfield, while the rest of the regiment moved to RAF Brize Norton airfield the next day; from these two airfields, the regiment would be transported from to participate in the British airborne landings in Normandy.[45] The operation began on the night of 5 June, with the deployment of 6th Airborne Division to eastern Normandy. It was tasked with protecting the eastern flank of the Allied seaborne landings, securing strategically important areas east of Caen, capturing several important bridges over the Caen Canal and River Dives, and destroying a coastal artillery battery.[46] Insufficient transport aircraft were available to land all three of the division's brigades simultaneously; one would have to be landed in a second lift later in the day. Maj. Gen. Gale had initially intended for the 6th Airlanding Brigade, to which the 6th Airborne Armoured Reconnaissance Regiment was attached, to be landed first; however, aerial photography revealed that anti-glider poles had been erected in the landing zone selected for the brigade. Therefore, Gale decided that the 3rd Parachute Brigade and 5th Parachute Brigade (which did not utilise gliders) should land in the first lift to clear the landing zones, allowing the 6th Airlanding Brigade to land in the second lift.[47]",
			"color": " "
		}
	}
}
