{
	"add": {
		"doc": {
			"id": "41ffa65cfa3ecd262876611fe69e0164d464a5f09ec423375b312ab4538adca6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/SJC_Terminal_A%2BB.jpg/220px-SJC_Terminal_A%2BB.jpg",
				"previous": "In August 2004 the city broke ground on the North Concourse, the first phase in a three-phase, nine-year expansion plan. The plan, designed by Gensler and The Steinberg Group, called for a single consolidated terminal with 40 gates (eight more than present), an international concourse, and expanded security areas. The terminal would be named after James Nissen. The sail-shaped facade would greet up to 17.6 million passengers a year. A people mover system would link the new terminal with VTA light rail and the planned BART station next to the Santa Clara Caltrain station. Cargo facilities would be moved to the east side of the airport. A long term parking garage would be built where the rental car operations are now. A short term parking lot was built on the site of Terminal C.",
				"after": "In November 2005 a scaled-back plan was approved and announced.[29][30] The new two-phase plan called for a simplified Terminal B, rather than the initially proposed James Nissen Central Terminal, with a North Concourse to replace the aging Terminal C. In addition, Terminal A would be expanded for additional check-in counters, security checkpoints, and drop-off/pick-up curbside space. The new plan cost $1.3 billion, less than half of the original plan's cost of $3 billion. The first phase was completed in June 2010, when Terminal B and the North Concourse officially opened for service.[31][32] The second phase, adding a South Concourse to Terminal B, is to be built when demand is sufficient.",
			"color": "dark|0.34931 gray|0.34931 dark|0.34931 grey|0.34931 gray|0.22911 grey|0.22911 dim|0.18212 gray|0.18212 dim|0.18212 grey|0.18212 silver|0.14784 light|0.034766 gray|0.034766 light|0.034766 grey|0.034766 gainsboro|0.018282 slate|0.012775 gray|0.012775 light|0.0089426 slate|0.0089426 gray|0.0089426  "
		}
	}
}
