{
	"add": {
		"doc": {
			"id": "41ff36966f54d8c0c624467e6f257a0fa9cec3c0424760e6b68630d094809eac",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Meninas_detail_Don_Jos%C3%A9_Nieto_Vel%C3%A1zquez.jpg/170px-Meninas_detail_Don_Jos%C3%A9_Nieto_Vel%C3%A1zquez.jpg",
				"previous": "Las Meninas is set in Velázquez's studio in Philip IV's Alcázar palace in Madrid.[20] The high-ceilinged room is presented, in the words of Silvio Gaggi, as \"a simple box that could be divided into a perspective grid with a single vanishing point\".[21] In the centre of the foreground stands the Infanta Margaret Theresa (1). The five-year-old infanta, who later married Holy Roman Emperor Leopold I, was at this point Philip and Mariana's only surviving child.[22] She is attended by two ladies-in-waiting, or meninas: doña Isabel de Velasco (2), who is poised to curtsy to the princess, and doña María Agustina Sarmiento de Sotomayor (3), who kneels before Margaret Theresa, offering her a drink from a red cup, or bucaro, that she holds on a golden tray.[23] To the right of the Infanta are two dwarfs: the achondroplastic German, Maribarbola (4)[23] (Maria Barbola), and the Italian, Nicolas Pertusato (5), who playfully tries to rouse a sleepy mastiff with his foot. Behind them stands doña Marcela de Ulloa (6), the princess's chaperone, dressed in mourning and talking to an unidentified bodyguard (or guardadamas) (7).[23]",
				"after": "To the rear and at right stands Don José Nieto Velázquez (8)—the queen's chamberlain during the 1650s, and head of the royal tapestry works—who may have been a relative of the artist. Nieto is shown pausing, with his right knee bent and his feet on different steps. As the art critic Harriet Stone observes, it is uncertain whether he is \"coming or going\".[24] He is rendered in silhouette and appears to hold open a curtain on a short flight of stairs, with an unclear wall or space behind. Both this backlight and the open doorway reveal space behind: in the words of the art historian Analisa Leppanen, they lure \"our eyes inescapably into the depths\".[25] The royal couple's reflection pushes in the opposite direction, forward into the picture space. The vanishing point of the perspective is in the doorway, as can be shown by extending the line of the meeting of wall and ceiling on the right. Nieto is seen only by the king and queen, who share the viewer's point of view, and not by the figures in the foreground. In the footnotes of Joel Snyder's article, the author recognizes that Nieto is the queen's attendant and was required to be at hand to open and close doors for her. Snyder suggests that Nieto appears in the doorway so that the king and queen might depart. In the context of the painting, Snyder argues that the scene is the end of the royal couple's sitting for Velázquez and they are preparing to exit, explaining that is \"why the menina to the right of the Infanta begins to curtsy\".[26]",
			"color": "dim|0.48717 gray|0.48717 dim|0.48717 grey|0.48717 black|0.2971 gray|0.1131 grey|0.1131 tan|0.04524  "
		}
	}
}
