{
	"add": {
		"doc": {
			"id": "420603a6baed2e2bcace4650af2089e823377f2b1bb7e6e455439e8588595c31",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/China_linguistic_map.jpg/220px-China_linguistic_map.jpg",
			"previous": [],
				"after": "There are as many as 292 living languages in China.[378] The languages most commonly spoken belong to the Sinitic branch of the Sino-Tibetan language family, which contains Mandarin (spoken natively by 70% of the population),[379] and other Chinese languages: Wu (including Shanghainese), Yue (including Cantonese and Taishanese), Min (including Hokkien and Teochew), Xiang, Gan, and Hakka. Languages of the Tibeto-Burman branch, including Tibetan, Qiang, Naxi and Yi, are spoken are spoken across the Tibetan and Yunnan–Guizhou Plateau. Other ethnic minority languages in southwest China include Zhuang, Thai, Dong and Sui of the Tai-Kadai family, Miao and Yao of the Hmong–Mien family, and Wa of the Austroasiatic family. Across northeastern and northwestern China, minority ethnic groups speak Altaic languages including Manchu, Mongolian and several Turkic languages: Uyghur, Kazakh, Kyrgyz, Salar and Western Yugur. Korean is spoken natively along the border with North Korea. Sarikoli, the language of Tajiks in western Xinjiang, is an Indo-European language. Taiwanese aborigines, including a small population on the mainland, speak Austronesian languages.[380]",
			"color": "pale|0.48068 golden|0.48068 rod|0.48068 tan|0.076084 lemon|0.056028 chiffon|0.056028 dark|0.039656 khaki|0.039656 khaki|0.035719 silver|0.033855 rosy|0.03346 brown|0.03346 wheat|0.028568 light|0.026283 gray|0.026283 light|0.026283 grey|0.026283 moccasin|0.025581 dark|0.025344 gray|0.025344 dark|0.025344 grey|0.025344 gainsboro|0.021737 light|0.019927 golden|0.019927 rod|0.019927 yellow|0.019927 burly|0.012525 wood|0.012525 gray|0.012131 grey|0.012131 navajo|0.0086628 white|0.0086628 dim|0.0080126 gray|0.0080126 dim|0.0080126 grey|0.0080126  "
		}
	}
}
