{
	"add": {
		"doc": {
			"id": "42077b7a43c1f1d2d4a0d7fb5899ba77aaa2131fa5ed1183a88fc42e097b758e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/James_VI_unite_1609_662019.jpg/220px-James_VI_unite_1609_662019.jpg",
				"previous": "The forcible dissolution of the Lordship of the Isles by James IV in 1493 had led to troubled times for the western seaboard. Although the king had subdued the organised military might of the Hebrides, he and his immediate successors lacked the will or ability to provide an alternative form of governance. As a result the 16th century became known as linn nan creach – the time of raids.[48] Furthermore, the effects of the Reformation were slow to impact the Gàidhealtachd, driving a religious wedge between this area and centres of political control in the Central Belt.[49] In 1540 James V had toured the Hebrides, forcing the clan chiefs to accompany him. There followed a period of peace, but the clans were soon at loggerheads with one another again.[50] During James VI's reign the transformation of the 15th century image of the Hebrides as the cradle of Scottish Christianity and nationhood into one in which its citizens were regarded as lawless barbarians was complete. Official documents describe the peoples of the Highlands as \"void of the knawledge and feir of God\" who were prone to \"all kynd of barbarous and bestile cruelteis\".[51] The Gaelic language, spoken fluently by James IV and probably by James V, became known in the time of James VI as \"Erse\" or Irish, implying that it was foreign in nature. The Scottish Parliament decided it had become a principal cause of the Highlanders' shortcomings and sought to abolish it.[50][51]",
				"after": "It was against this background that in 1598 James VI authorised the \"Gentleman Adventurers of Fife\" to civilise the \"most barbarous Isle of Lewis\". James wrote that the colonists were to act \"not by agreement\" with the local inhabitants, but \"by extirpation of thame\". Their landing at Stornoway was initially successful, but the colonists were driven out by local forces commanded by Murdoch and Neil MacLeod. The colonists tried again in 1605 with the same result although a third attempt in 1607 was more successful.[51][52] The Statutes of Iona were enacted in 1609, which required clan chiefs to: send their heirs to Lowland Scotland to be educated in English-speaking Protestant schools; provide support for Protestant ministers to Highland parishes; outlaw bards; and regularly report to Edinburgh to answer for their actions.[53] So began a process \"specifically aimed at the extirpation of the Gaelic language, the destruction of its traditional culture and the suppression of its bearers.\"[54]",
			"color": "peru|0.21686 dark|0.18928 golden|0.18928 rod|0.18928 saddle|0.17214 brown|0.17214 golden|0.13274 rod|0.13274 khaki|0.078282 sienna|0.077661 sandy|0.032651 brown|0.032651 burly|0.023992 wood|0.023992 pale|0.011326 golden|0.011326 rod|0.011326 dark|0.011308 khaki|0.011308 tan|0.010347  "
		}
	}
}
