{
	"add": {
		"doc": {
			"id": "421b9722f84831cb9bacb26edb3b6dc634400408a2d4e28a59a48355504a8bb3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Old_Trafford_3rd_Test_June_2007_-_geograph.org.uk_-_1398421.jpg/300px-Old_Trafford_3rd_Test_June_2007_-_geograph.org.uk_-_1398421.jpg",
				"previous": "In 2004, Lancashire were relegated to the second division of the County Championship for the first time since the competition was restructured into two divisions.[22] This was despite starting the season as the bookmarkers' favourite to win the competition. At one point in the season, the team was without eight bowlers, with James Anderson, Andrew Flintoff, and Sajid Mahmood on international duty, while Glen Chapple, Dominic Cork, Kyle Hogg, Peter Martin, and all-rounder Carl Hooper were all injured. Their problems were not blamed solely on the injuries, Watkinson said \"quite simply the opposition have done the basics better than us. In addition we've one or two who are out of form on top of the injury list which ripped us to pieces\".[23] Despite being relegated in the County Championship, the team managed finish as runners up in the National League and were expected to be promoted back to the first division of first-class cricket in the 2005 season.[24] While Watkinson expected backlash from the fans, he said that \"they were tremendously understanding about the injury situation\".[22] The squad underwent changes, with six players leaving – including Martin and Chris Schofield – and six joining, as well as a change of captain from wicket-keeper Warren Hegg to batsman Mark Chilton;[24] Chilton was the club's first Yorkshire-born captain.[25] Between 1864 and 2004, Lancashire played 2,790 matches, winning 1,034, losing 583, drawing 1,170, with three tied matches. In this period, no other team had drawn more matches. The team's percentage of wins was 37.06%, third behind Yorkshire (44.05%) and Surrey (39.74%).[26]",
				"after": "Lancashire were promoted back to the first division of the county championship in 2005, winning the second division title in the process. They stayed up in the National League, progressed to the finals' day of the Twenty20 Cup and were knocked out in the semi-final of the C&G Trophy.[27] Despite winning the second division title, there were concerns that the squad may have been getting too old and that there were limited opportunities for the younger players. Of Lancashire's performance over the season, Watkinson said \"I was not happy about our batting and, although we have achieved what we set out to do – get promoted – our performance left a lot to be desired\".[28] Lancashire are one of three teams, along with Middlesex and Surrey, never to have finished bottom in the County Championship.[10] On their return to the first division in the 2006 season, Lancashire finished second in the Championship. They also finished as runners-up in the NatWest Trohpy.[29]",
			"color": "dark|0.49984 olive|0.49984 green|0.49984 dim|0.092626 gray|0.092626 dim|0.092626 grey|0.092626 dark|0.084193 gray|0.084193 dark|0.084193 grey|0.084193 gray|0.07962 grey|0.07962 black|0.072697 silver|0.067306 light|0.02088 gray|0.02088 light|0.02088 grey|0.02088 dark|0.019756 slate|0.019756 gray|0.019756 gainsboro|0.0096201 slate|0.0085685 gray|0.0085685 light|0.0083085 slate|0.0083085 gray|0.0083085 rosy|0.0071051 brown|0.0071051  "
		}
	}
}
