{
	"add": {
		"doc": {
			"id": "421f199e2dd36c8f92368f7394e641fb5a85cd22549fa9f889ae5eaeb305fbfc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/BushmenSan.jpg/220px-BushmenSan.jpg",
			"previous": [],
				"after": "The main form of food production in such societies is the daily collection of wild plants and the hunting of wild animals. Hunter-gatherers move around constantly in search of food. As a result, they do not build permanent villages or create a wide variety of artifacts, and usually only form small groups such as bands and tribes. However, some hunting and gathering societies in areas with abundant resources (such as the Tlingit) lived in larger groups and formed complex hierarchical social structures such as chiefdoms. The need for mobility also limits the size of these societies. They generally consist of fewer than 60 people and rarely exceed 100. Statuses within the tribe are relatively equal, and decisions are reached through general agreement. The ties that bind the tribe are more complex than those of the bands. Leadership is personal—charismatic—and used for special purposes only in tribal society. There are no political offices containing real power, and a chief is merely a person of influence, a sort of adviser; therefore, tribal consolidations for collective action are not governmental. The family forms the main social unit, with most societal members being related by birth or marriage. This type of organization requires the family to carry out most social functions, including production and education.",
			"color": "black|0.40473 dim|0.091059 gray|0.091059 dim|0.091059 grey|0.091059 slate|0.080208 gray|0.080208 dark|0.067265 gray|0.067265 dark|0.067265 grey|0.067265 light|0.061325 slate|0.061325 gray|0.061325 gray|0.060476 grey|0.060476 dark|0.041419 slate|0.041419 gray|0.041419 silver|0.032864 rosy|0.019959 brown|0.019959 light|0.017236 gray|0.017236 light|0.017236 grey|0.017236 dark|0.015435 salmon|0.015435 sienna|0.012344 gainsboro|0.01051 light|0.0097522 steel|0.0097522 blue|0.0097522 indian|0.0089793 red|0.0089793  "
		}
	}
}
