{
	"add": {
		"doc": {
			"id": "4224091765bddfcdc748c4ee7976c2a2145718983ab72149d237cb0605beff6b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Water_carriers_in_Iloilo%2C_1899.jpg/220px-Water_carriers_in_Iloilo%2C_1899.jpg",
				"previous": "The term negrito was coined by the Spaniards based on their appearance. The word 'negrito' would be misinterpreted and used by future European scholars as an ethnoracial term in and of itself. Both Christianized Negritos who lived in the colony and un-Christianized Negritos who lived in tribes outside of the colony were classified as 'negritos'. Christianized Negritos who lived in Manila were not allowed to enter Intramuros and lived in areas designated for Indios. A person of mixed Negrito and Austronesian ancestry were classified based on patrilineal descent; the father's ancestry determined a child's legal classification. If the father was 'negrito' and the mother was 'India' (Austronesian), the child was classified as 'negrito'. If the father was 'indio' and the mother was 'negrita', the child was classified as 'indio'. Persons of Negrito descent were viewed as being outside of the social order as they usually lived in tribes outside of the colony and resisted conversion to Christianity.",
				"after": "This legal system of racial classification based on patrilineal descent had no parallel anywhere in the Spanish-ruled colonies in the Americas. In general, a son born of a sangley male and an indio or mestizo de sangley female was classified as mestizo de sangley; all subsequent male descendants were mestizos de sangley regardless of whether they married an India or a mestiza de sangley. A daughter born in such a manner, however, acquired the legal classification of her husband, i.e., she became an India if she married an indio but remained a mestiza de sangley if she married a mestizo de sangley or a sangley. In this way, a chino mestizo male descendant of a paternal sangley ancestor never lost his legal status as a mestizo de sangley no matter how little percentage of Chinese blood he had in his veins or how many generations had passed since his first Chinese ancestor; he was thus a mestizo de sangley in perpetuity.",
			"color": "dark|0.19729 gray|0.19729 dark|0.19729 grey|0.19729 gray|0.16287 grey|0.16287 silver|0.16145 dim|0.15133 gray|0.15133 dim|0.15133 grey|0.15133 light|0.10683 gray|0.10683 light|0.10683 grey|0.10683 gainsboro|0.06963 linen|0.024094 black|0.016409 antique|0.015828 white|0.015828 sea|0.014542 shell|0.014542 old|0.013899 lace|0.013899 white|0.011382 smoke|0.011382 misty|0.011048 rose|0.011048 floral|0.011036 white|0.011036 snow|0.007184 ivory|0.0061922 lavender|0.0044193 blush|0.0044193 mint|0.0036487 cream|0.0036487 beige|0.0035956 white|0.0033578  "
		}
	}
}
