{
	"add": {
		"doc": {
			"id": "423fd181c94048ad2277c913cd5b890c1dbf32f511807ec8fa3d750958e24a1e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Shree_Swaminarayan_Temple_-_Cardiff_-_geograph.org.uk_-_1605788.jpg/220px-Shree_Swaminarayan_Temple_-_Cardiff_-_geograph.org.uk_-_1605788.jpg",
				"previous": "Since 1922 Cardiff has included the suburban cathedral 'village' of Llandaff, whose bishop is also Archbishop of Wales since 2002. There is also a Roman Catholic cathedral in the city. Since 1916 Cardiff has been the seat of a Catholic archbishop, but there appears to have been a fall in the estimated Catholic population, with estimated numbers in 2006 being around 25,000 less than in 1980.[98] Likewise, the Jewish population of the city also appears to have fallen—there are two synagogues in Cardiff, one in Cyncoed and one in Moira Terrace, as opposed to seven at the turn of the 20th century.[99] There are a significant number of nonconformist chapels, an early-20th century Greek Orthodox church and 11 mosques.[100][101][102] In the 2001 census 66.9% of Cardiff's population described itself as Christian, a percentage point below the Welsh and UK averages.",
				"after": "The oldest of the non-Christian communities in Wales is Judaism. Jews were not permitted to live in Wales between the 1290 Edict of Expulsion—given by Edward I of England—and the 17th century. A Welsh Jewish community was re-established in the 18th century.[103] There was once a fairly substantial Jewish population in South Wales, most of which has disappeared. The Cardiff Jewish community congregations are consolidated in the present, modern building in Cyncoed Gardens, dedicated by Chief Rabbi Jonathan Sacks in 2003.[104]",
			"color": "dim|0.35443 gray|0.35443 dim|0.35443 grey|0.35443 gray|0.1353 grey|0.1353 black|0.086237 slate|0.055437 gray|0.055437 light|0.052232 steel|0.052232 blue|0.052232 light|0.022255 slate|0.022255 gray|0.022255 antique|0.021776 white|0.021776 blanched|0.021502 almond|0.021502 papaya|0.021061 whip|0.021061 corn|0.017728 silk|0.017728 beige|0.017116 tan|0.016614 bisque|0.016508 wheat|0.014713 light|0.012278 yellow|0.012278 light|0.012008 golden|0.012008 rod|0.012008 yellow|0.012008 sky|0.011466 blue|0.011466 old|0.010915 lace|0.010915 dark|0.010812 gray|0.010812 dark|0.010812 grey|0.010812 dark|0.010623 slate|0.010623 gray|0.010623 light|0.0094992 blue|0.0094992 lemon|0.0090796 chiffon|0.0090796 linen|0.0066101 ivory|0.0061431 moccasin|0.0059292 silver|0.0055205  "
		}
	}
}
