{
	"add": {
		"doc": {
			"id": "4240afc9896276cd7fc88757c22fceee9845802761cc9bb7e392004cd63e95ed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Towrlndn.JPG/100px-Towrlndn.JPG",
			"previous": [],
				"after": "The Peasants' Revolt was an uprising in England in 1381, brought on by economic and social upheaval that had been growing since the Black Death thirty years earlier. The rebels, coming from a wide spectrum of rural society, sought a reduction in the high taxes financing the Hundred Years' War, an end to the system of unfree labour known as serfdom and the removal of the King's senior officials and law courts. Inspired by the radical cleric John Ball and led by Wat Tyler, Kentish rebels entered London on 13 June. They destroyed the Savoy Palace and set fire to law books and buildings in the Temple. The following day, the fourteen-year-old King Richard acceded to most of the rebels' demands, including the abolition of serfdom; meanwhile, the Lord Chancellor and the Lord High Treasurer were killed in the Tower of London (pictured). On 15 June Richard met Tyler and the rebels at Smithfield, but violence broke out and Tyler was killed by the king's party. A London militia then dispersed the rebel forces and Richard rescinded his previous grants to the rebels. Troubles extended as far as East Anglia, Yorkshire and Somerset, but most of the rebel leaders were tracked down and executed, and at least 1,500 rebels were killed. (Full article...)",
			"color": "dark|0.1547 gray|0.1547 dark|0.1547 grey|0.1547 gray|0.091773 grey|0.091773 tan|0.066673 light|0.058929 slate|0.058929 gray|0.058929 antique|0.052512 white|0.052512 dim|0.045343 gray|0.045343 dim|0.045343 grey|0.045343 light|0.042975 steel|0.042975 blue|0.042975 blanched|0.036205 almond|0.036205 papaya|0.036016 whip|0.036016 silver|0.03595 slate|0.034416 gray|0.034416 dark|0.032877 olive|0.032877 green|0.032877 dark|0.029777 golden|0.029777 rod|0.029777 beige|0.028583 peru|0.027742 bisque|0.025978 corn|0.0239 silk|0.0239 wheat|0.020189 old|0.019573 lace|0.019573 linen|0.014982  "
		}
	}
}
