{
	"add": {
		"doc": {
			"id": "4240ae83f579693841e0c1393b19a264feeac529b0b919a5c830fea3f026e7f8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Harlow_still.jpg/160px-Harlow_still.jpg",
			"previous": [],
				"after": "In 1992, Madonna released her controversial Sex book and her fifth studio album Erotica, both featuring a highly sexual image of her. She also starred in the erotic thriller Body of Evidence. The three were critically panned by critics and fans alike,[3] who questioned Madonna as a sexual renegade and claimed that \"she had gone too far\" and that her career was over. In early 1994, after finishing the Girlie Show World Tour in support of Erotica, she recorded the song \"I'll Remember\", which was released as the theme from the movie With Honors. The song was well received by critics, who hailed it as some of her best work. However, her appearance on the Late Show with David Letterman was noted by her constant use of profanity and references to sex that needed to be censored on television, and caused a large public controversy.[4] During 1994, Madonna started recording her sixth studio album. At first, it started as a collaboration with Shep Pettibone and was to be stylistically similar to Erotica, but due to Madonna's wish to soften her public image at the time, she decided to move towards an R&B sound collaborating with well-known R&B producers and took a more appropriate image for the general public. She had the idea for \"Secret\" before recording the album.[5] In September 1994, the song was announced as the lead single from Bedtime Stories. The song was written by Madonna, Dallas Austin and Shep Pettibone. It was later included in the compilation albums GHV2 and Celebration in its deluxe edition. The cover art of the single, as well as the song's music video, showed a change in appearance for Madonna since her previous single \"I'll Remember\" (1994) - in which she sported short cropped dark hair - with her newly longer blonde hair and style drawing comparisons to the look of 1930s American actress Jean Harlow.[6] Unusual for the mid-1990s, Madonna talked about the new single on the Internet, with a 30-second sample of \"Secret\" and the cover image of the then-unreleased Bedtime Stories. She also left a message with the following words:[7]",
			"color": " "
		}
	}
}
