{
	"add": {
		"doc": {
			"id": "425dc146c449a990d1cd17b137fe77da0b6807d7ef192c72c7da75b72b254655",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/2012-06-09_Tylopilus_felleus_%28Bull.%29_P._Karst_226782_crop.jpg/220px-2012-06-09_Tylopilus_felleus_%28Bull.%29_P._Karst_226782_crop.jpg",
				"previous": "The cap of this species grows up to 15 cm (6 in) in diameter,[5] though some North American specimens reach 30 cm (12 in) across.[2] Grey-yellow to pale- or walnut-brown, it is slightly downy at first and later becomes smooth with a matte lustre. It is initially convex before flattening out with maturity.[5] The cap skin does not peel away from the flesh.[18] The pores underneath are white at first and become pinkish with maturity. They are adnate to the stalk and bulge downwards as the mushroom ages.[19] The pores bruise carmine or brownish,[20] often developing rusty-brown spots with age,[21] and number about one or two per millimetre.[16] The tubes are long relative to the size of the cap, measuring 2–3 cm (0.8–1.2 in) deep in the middle part of the cap.[21] The stalk is initially bulbous before stretching and thinning in the upper part; the lower part of the stalk remains swollen, sometimes shrinking at the base where it attaches to the substrate.[21] It measures 7–10 cm (2.8–3.9 in)—rarely to 20 cm (7.9 in)[2]—tall, and 2–3 cm (0.8–1.2 in) wide, and can bulge out to 6 cm (2.4 in) across at the base.[19] It is lighter in colour than the cap, and covered with a coarse brown network of markings,[19] which have been likened to fishnet stockings in appearance.[20] Described as \"very appetising\" in appearance,[22] the flesh is white or creamy, and pink beneath the cap cuticle; the flesh can also develop pinkish tones where it has been cut.[23] It has a slight smell,[18] which has been described as pleasant,[5][24] as well as faintly unpleasant.[19][20] The flesh is softer than that of other boletes,[20] and tends to become more spongy as the mushroom matures.[21] Insects rarely infest this species.[18]",
				"after": "The colour of the spore print is brownish, with pink, reddish, or rosy tints. Spores are somewhat fuse-shaped, smooth, and measure 11–17 by 3–5 µm.[16] The basidia (spore-bearing cells) are club-shaped, four-spored, and measure 18–25.6 by 7.0–10.2 µm. Cystidia on the walls of the tubes (pleurocystidia) are fuse-shaped with a central swelling, thin-walled, and have granular contents. They possess sharp to tapered tips, and have overall dimensions of 36–44 by 8.0–11.0 µm. On the pore edges, the cheilocystidia are similar in shape to the pleurocystidia, measuring 24.8–44.0 by 7.3–11.0 µm.[17] The hymenium of Smith and Thiers's variety uliginosus, when mounted in Melzer's reagent, shows reddish globules of pigment measuring 2–8 µm that appear in the hyphae and throughout the hymenium, and a large (8–12 µm) globule in the pleurocystidia.[2]",
			"color": "dark|0.2899 gray|0.2899 dark|0.2899 grey|0.2899 silver|0.2502 light|0.11993 gray|0.11993 light|0.11993 grey|0.11993 gainsboro|0.065103 thistle|0.050634 gray|0.036698 grey|0.036698 light|0.030279 steel|0.030279 blue|0.030279 lavender|0.027535 dark|0.017777 slate|0.017777 blue|0.017777 dim|0.014031 gray|0.014031 dim|0.014031 grey|0.014031 light|0.012225 slate|0.012225 gray|0.012225 slate|0.0080816 gray|0.0080816 white|0.0069383 smoke|0.0069383 lavender|0.0069192 blush|0.0069192 linen|0.0064622 slate|0.0052753 blue|0.0052753 ghost|0.0047489 white|0.0047489 misty|0.0045666 rose|0.0045666 alice|0.0043898 blue|0.0043898  "
		}
	}
}
