{
	"add": {
		"doc": {
			"id": "4261e468073686e957b12f560f0a42342354ef8632e9ced97364d47b6d692049",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Muhammad_Yunus_2.jpg/160px-Muhammad_Yunus_2.jpg",
				"previous": "Vanderbilt has approximately 114,000 living alumni, with 31 alumni clubs established worldwide.[7] Many Vanderbilt alumni have gone on to make significant contributions in politics. Lamar Alexander (B.A. 1962) is a current U.S. Senator, former Governor of Tennessee, former U.S. Secretary of Education, and former U.S. presidential candidate; he filled the Senate seat left vacant by the retirement of Fred Thompson (J.D. 1971).[130] Two U.S. vice presidents, John Nance Garner and Al Gore, attended the university, but did not graduate.[131][132] However, Gore's ex-wife, Tipper, is herself an alumna, receiving a master's degree from Peabody in 1975.[133] Other alumni who are or have been involved in politics include former United States Supreme Court Associate Justice and former U.S. Attorney General James Clark McReynolds (B.S. 1882), Executive Vice President of the Cato Institute David Boaz (B.A. 1975),[130][134] and former White House Chief of Staff John R. Steelman (M.A. 1924). Bill Frist, a cardiothoracic surgeon and former U.S. Senate Majority Leader, is a faculty member at Vanderbilt University Medical Center. The President of Puntland and former Prime Minister of Somalia, Abdiweli Mohamed Ali (M.A. 1988), is also an alumnus of Peabody College.",
				"after": "Within the business world, Vanderbilt alumni have gone on to serve in a number of key leadership roles; alumni include Ann S. Moore (B.A. 1971), former Chairman and CEO of Time, Inc.; Doug Parker (M.B.A. 1986), President and CEO of US Airways; and Matthew J. Hart (B.A. 1974), former President/COO of Hilton Hotels.[135] Vanderbilt also has an intimate connection to the contemporary management consulting industry. In particular, the founders of two of the three most prominent management consulting firms graduated with undergraduate degrees from the university.[136] Bruce Henderson, founder of The Boston Consulting Group, graduated with a degree in mechanical engineering in 1937,[137] while Bill Bain, founder of Bain and Company, graduated in 1959 with Phi Beta Kappa honors in history, and currently serves on the Vanderbilt University Board of Trust.[138] Jane Silber, the current CEO of Canonical, Ltd., received a graduate degree from Vanderbilt.",
			"color": "light|0.13744 slate|0.13744 gray|0.13744 slate|0.11488 gray|0.11488 dark|0.11217 gray|0.11217 dark|0.11217 grey|0.11217 dim|0.10477 gray|0.10477 dim|0.10477 grey|0.10477 light|0.10057 steel|0.10057 blue|0.10057 gray|0.079458 grey|0.079458 peach|0.066929 puff|0.066929 silver|0.055629 tan|0.054016 burly|0.032834 wood|0.032834 light|0.025953 gray|0.025953 light|0.025953 grey|0.025953 black|0.024609 lavender|0.019466 gainsboro|0.015739 rosy|0.0084773 brown|0.0084773 bisque|0.0080849  "
		}
	}
}
