{
	"add": {
		"doc": {
			"id": "42724e1e873ce163bbd1f57617e777245c3161e1f7e4924e74c79cfe31a4ee9e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Periodic_trends.svg/300px-Periodic_trends.svg.png",
				"previous": "The electron configuration or organisation of electrons orbiting neutral atoms shows a recurring pattern or periodicity. The electrons occupy a series of electron shells (numbered shell 1, shell 2, and so on). Each shell consists of one or more subshells (named s, p, d, f and g). As atomic number increases, electrons progressively fill these shells and subshells more or less according to the Madelung rule or energy ordering rule, as shown in the diagram. The electron configuration for neon, for example, is 1s2 2s2 2p6. With an atomic number of ten, neon has two electrons in the first shell, and eight electrons in the second shell—two in the s subshell and six in the p subshell. In periodic table terms, the first time an electron occupies a new shell corresponds to the start of each new period, these positions being occupied by hydrogen and the alkali metals.[26][27]",
				"after": "Since the properties of an element are mostly determined by its electron configuration, the properties of the elements likewise show recurring patterns or periodic behaviour, some examples of which are shown in the diagrams below for atomic radii, ionization energy and electron affinity. It is this periodicity of properties, manifestations of which were noticed well before the underlying theory was developed, that led to the establishment of the periodic law (the properties of the elements recur at varying intervals) and the formulation of the first periodic tables.[26][27]",
			"color": "dark|0.092276 gray|0.092276 dark|0.092276 grey|0.092276 silver|0.065128 gainsboro|0.063281 tan|0.056877 light|0.049637 gray|0.049637 light|0.049637 grey|0.049637 white|0.045397 smoke|0.045397 linen|0.044781 gray|0.044577 grey|0.044577 sea|0.040721 shell|0.040721 blanched|0.040606 almond|0.040606 snow|0.039269 ghost|0.039061 white|0.039061 alice|0.039037 blue|0.039037 floral|0.038772 white|0.038772 white|0.036912 mint|0.035321 cream|0.035321 dim|0.033046 gray|0.033046 dim|0.033046 grey|0.033046 bisque|0.032289 wheat|0.03206 peach|0.031232 puff|0.031232 navajo|0.027937 white|0.027937 moccasin|0.027911 antique|0.019563 white|0.019563 lavender|0.0093447 blush|0.0093447 azure|0.0082439  "
		}
	}
}
