{
	"add": {
		"doc": {
			"id": "4276645d20ab718f9b2360be17858aecb332a37c7970a457682280dd6ff88689",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Campo_del_Moro_%28Madrid%29_04.jpg/220px-Campo_del_Moro_%28Madrid%29_04.jpg",
				"previous": "The Royal Botanical Garden of Madrid (Real Jardín Botánico de Madrid) is an 8-hectare botanical garden located in the Plaza de Murillo, next to the Prado Museum. It was an 18th-century creation by Carlos III and it was used as a base for the plant species being collected across the globe. There is an important research facility that started life as a base to develop herbal remedies and to house the species collected from the new-world trips, today it is dedicated to maintaining Europe's ecosystem.",
				"after": "The Royal Palace (Palacio Real) is surrounded by three green areas. In front of the palace, are the gardens of the Plaza de Oriente; to the north, the gardens of Sabatini and to the west up to the Manzanares River, the famous Campo del Moro. Campo del Moro gardens has a surface area of 20 hectares and is a scenic garden with an unusual layout filled with foliage and an air of English romanticism. The Sabatini Gardens have a formal Neoclassic style, consisting of well-trimmed hedges, in symmetric geometrical patterns, adorned with a pool, statues and fountains, with trees also planted in a symmetrical geometric shape. Plaza de Oriente can distinguish three main plots: the Central Gardens, the Cabo Noval Gardens and the Lepanto Gardens. The Central Gardens are arranged around the central monument to Philip IV, in a grid, following the barroque model garden. They consist of seven flowerbeds, each packed with box hedges, forms of cypress, yew and magnolia of small size, and flower plantations, temporary. These are bounded on either side by rows of statues paths, popularly known as the Gothic kings, and mark the dividing line between the main body of the plaza and the Cabo Noval Gardens at north, and the Lepanto Gardens at south.",
			"color": "black|0.81825 dark|0.026758 olive|0.026758 green|0.026758 dark|0.015839 khaki|0.015839 dim|0.011082 gray|0.011082 dim|0.011082 grey|0.011082 beige|0.010016 light|0.0085484 golden|0.0085484 rod|0.0085484 yellow|0.0085484 olive|0.0084725 drab|0.0084725 corn|0.0082661 silk|0.0082661 light|0.0079909 yellow|0.0079909 lemon|0.0068017 chiffon|0.0068017 gray|0.0066734 grey|0.0066734 papaya|0.0062056 whip|0.0062056 antique|0.006123 white|0.006123 pale|0.0058906 golden|0.0058906 rod|0.0058906 old|0.005754 lace|0.005754 ivory|0.0054642  "
		}
	}
}
