{
	"add": {
		"doc": {
			"id": "429236216ae61a89b38519e000da9004e825c225035e27a6cc00dbedaef46e4e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Tower_of_London_%28Foto_Hilarmont%29.jpg/400px-Tower_of_London_%28Foto_Hilarmont%29.jpg",
				"previous": "The castle probably retained its form as established by 1100 until the reign of Richard the Lionheart (1189–1199).[71] The castle was extended under William Longchamp, Richard's Lord Chancellor and the man in charge of England while he was on crusade. The Pipe Rolls record £2,881 1s 10d spent at the Tower of London between 3 December 1189 and 11 November 1190,[72] from an estimated £7,000 spent by Richard on castle building in England.[73] According to the contemporary chronicler Roger of Howden, Longchamp dug a moat around the castle and tried in vain to fill it from the Thames.[28] Longchamp was also Constable of the Tower, and undertook its expansion while preparing for war with Richard's younger brother, Prince John, who in Richard's absence arrived in England to try to seize power. As Longchamp's main fortress, he made the Tower as strong as possible. The new fortifications were first tested in October 1191, when the Tower was besieged for the first time in its history. Longchamp capitulated to John after just three days, deciding he had more to gain from surrender than prolonging the siege.[74]",
				"after": "John succeeded Richard as king in 1199, but his rule proved unpopular with many of his barons, who in response moved against him. In 1214, while the king was at Windsor Castle, Robert Fitzwalter led an army into London and laid siege to the Tower. Although under-garrisoned, the Tower resisted and the siege was lifted once John signed the Magna Carta.[75] The king reneged on his promises of reform, leading to the outbreak of the First Barons' War. Even after the Magna Carta was signed, Fitzwalter maintained his control of London. During the war, the Tower's garrison joined forces with the barons. John was deposed in 1216 and the barons offered the English throne to Prince Louis, the eldest son of the French king. However, after John's death in October 1216, many began to support the claim of his eldest son, Prince Henry. War continued between the factions supporting Louis and Henry, with Fitzwalter supporting Louis. Fitzwalter was still in control of London and the Tower, both of which held out until it was clear that Henry's supporters would prevail.[75]",
			"color": "dim|0.38851 gray|0.38851 dim|0.38851 grey|0.38851 gray|0.12101 grey|0.12101 dark|0.11983 gray|0.11983 dark|0.11983 grey|0.11983 black|0.087564 silver|0.077628 light|0.034296 gray|0.034296 light|0.034296 grey|0.034296 dark|0.01995 olive|0.01995 green|0.01995 gainsboro|0.018663 antique|0.01612 white|0.01612 maroon|0.014104 light|0.011673 slate|0.011673 gray|0.011673 slate|0.011638 gray|0.011638 linen|0.0075288 brown|0.0069049 dark|0.0062697 red|0.0062697  "
		}
	}
}
