{
	"add": {
		"doc": {
			"id": "42a6c9197b407ed5ca96a999409e6126117d8f3c63202b9ba94fdfe8ddb06121",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Statue-Augustus.jpg/200px-Statue-Augustus.jpg",
				"previous": "Rome had begun expanding shortly after the founding of the Republic in the 6th century BC, though it didn't expand outside Italy until the 3rd century BC. In a sense then, it was an \"empire\" long before it had an Emperor.[9] The Roman Republic was not a nation-state in the modern sense, but a network of towns left to rule themselves (though with varying degrees of independence from the Roman Senate) and provinces administered by military commanders. It was ruled, not by Emperors, but by annually elected magistrates (Roman Consuls above all) in conjunction with the Senate.[10] For various reasons, the 1st century BC was a time of political and military upheaval, which ultimately led to rule by Emperors.[11] The consuls' military power rested in the Roman legal concept of imperium, which literally means \"command\" (though typically in a military sense).[12] Occasionally, successful consuls were given the honorary title Imperator (commander), and this is the origin of the word \"Emperor\" (and \"Empire\") since this title (among others) was always bestowed to the early Emperors upon their accession.[13]",
				"after": "Rome suffered a long series of internal conflicts, conspiracies and civil wars from the late second century BC onwards, while greatly extending its power beyond Italy. Towards the end of this period, in 44 BC, Julius Caesar was briefly perpetual dictator before being assassinated. The faction of his assassins was driven from Rome and defeated at the Battle of Phillipi in 42 BC by an army led by Mark Antony and Caesar's adopted son Octavian. Antony and Octavian's division of the Roman world between themselves did not last and Octavian's forces defeated those of Antony and Cleopatra at the Battle of Actium in 31 BC. In 27 BC the Senate and People of Rome made Octavian princeps (\"first citizen\") with proconsular imperium, thus beginning the Principate (the first epoch of Roman imperial history, usually dated from 27 BC to AD 284), and gave him the name Augustus (\"the venerated\"). Though the old constitutional machinery remained in place, Augustus came to predominate it. Although the Republic stood in name, contemporaries of Augustus knew it was just a veil and that Augustus had all meaningful authority in Rome.[14] Since his rule ended a century of civil wars, and began an unprecedented period of peace and prosperity, he was so loved that he came to hold the power of a monarch de facto if not de jure. During the years of his rule, a new constitutional order emerged (in part organically and in part by design), so that, upon his death, this new constitutional order operated as before when Tiberius was accepted as the new Emperor. The 200 years that began with Augustus' rule is traditionally regarded as the Pax Romana (\"Roman Peace\"). During this period, the cohesion of the Empire was furthered by a degree of social stability and economic prosperity that Rome had never before experienced. Uprisings in the provinces were infrequent, but put down \"mercilessly and swiftly\" when they occurred.[15] The sixty years of Jewish–Roman wars in the second half of the first century and the first half of the 2nd century were exceptional in their duration and violence.[16]",
			"color": "silver|0.20181 light|0.15411 gray|0.15411 light|0.15411 grey|0.15411 dark|0.14781 gray|0.14781 dark|0.14781 grey|0.14781 gainsboro|0.10778 gray|0.054565 grey|0.054565 dim|0.038022 gray|0.038022 dim|0.038022 grey|0.038022 black|0.024563 linen|0.022851 antique|0.022681 white|0.022681 tan|0.021871 white|0.021631 smoke|0.021631 dark|0.018618 slate|0.018618 gray|0.018618 sea|0.017042 shell|0.017042 snow|0.012961 floral|0.012583 white|0.012583 old|0.012461 lace|0.012461 lavender|0.011733 ghost|0.010894 white|0.010894 alice|0.01078 blue|0.01078 white|0.009625 lavender|0.0092035 blush|0.0092035 mint|0.0091746 cream|0.0091746  "
		}
	}
}
