{
	"add": {
		"doc": {
			"id": "42b0572b68e22e546ff540d88a62e28e9f4f7835a0af01fdd186f0530a962715",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Wedgetail_AWEC_being_refuelled_at_RIMPAC_2012.jpg/220px-Wedgetail_AWEC_being_refuelled_at_RIMPAC_2012.jpg",
				"previous": "In the 1990s, Australia began forming a need for an airborne early warning and control (AEW&C) aircraft. In 1996, Australia issued a request for proposal (RFP) for the aircraft for the RAAF under Project Wedgetail.[2] In 2000, Australia awarded Boeing Integrated Defense Systems a contract to supply four AEW&C aircraft with options for three additional aircraft.[citation needed]",
				"after": "The 737 AEW&C is based on Boeing Business Jet 1; a 737-700IGW airframe variant of the Boeing 737 Next Generation, roughly similar to the 737-700ER. The aircraft uses the Northrop Grumman Electronic Systems Multi-role Electronically Scanned Array (MESA) radar. The L-band (1 to 2 GHz) electronically scanned AEW and surveillance radar is located on a dorsal fin on top of the fuselage, dubbed the \"top hat\", and is designed for minimal aerodynamic effect. The radar is capable of simultaneous air and sea search, fighter control and area search, with a maximum range of over 600 km (look-up mode). When operating in look-down mode against fighter-sized target, the maximum range is in excess of 370 km. When used against maritime targets, the maximum range is over 240 km for frigate-sized targets. MESA is capable of simultaneously tracking 180 targets and conducting 24 intercepts. In addition, the radar antenna array is also doubled as an ELINT array, with a maximum range of over 850 km at 9,000 meter altitude.[3] The 10.8 m long by 3.4 m high antenna assembly incorporates 7.3 m long by 2.7 m high Side-Emitting Electronic Manifold array, with the top hat supporting array providing 120° coverage on port and starboard side, while the top hat array itself provides 60° fore and aft, thus providing a complete 360° coverage. The radar's beam can be set for a 2° to 8° width, while scan duration can be set from 3 s to 40 s. Radar signal processing equipment and central computer are installed directly below the antenna array.[4]",
			"color": "slate|0.28197 gray|0.28197 light|0.22336 slate|0.22336 gray|0.22336 dark|0.14414 gray|0.14414 dark|0.14414 grey|0.14414 black|0.14371 silver|0.083031 light|0.042149 gray|0.042149 light|0.042149 grey|0.042149 gray|0.03753 grey|0.03753 gainsboro|0.017656 dim|0.015738 gray|0.015738 dim|0.015738 grey|0.015738  "
		}
	}
}
