{
	"add": {
		"doc": {
			"id": "42e48e7a97bd1b54a28cdcc50a6854d0513d9d9ce218cfa1358bdf836e4a0034",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/NGC_6302_Hubble_2009.full.jpg/170px-NGC_6302_Hubble_2009.full.jpg",
				"previous": "Plans called for Hubble to be serviced in February 2005, but the Columbia disaster in 2003, in which the orbiter disintegrated on re-entry into the atmosphere, had wide-ranging effects on the Hubble program. NASA Administrator Sean O'Keefe decided that all future shuttle missions had to be able to reach the safe haven of the International Space Station should in-flight problems develop. As no shuttles were capable of reaching both HST and the ISS during the same mission, future manned service missions were canceled.[80] This decision was assailed by numerous astronomers, who felt that Hubble was valuable enough to merit the human risk.[81] HST's planned successor, the James Webb Telescope (JWST), is not expected to launch until at least 2018. A gap in space-observing capabilities between a decommissioning of Hubble and the commissioning of a successor is of major concern to many astronomers, given the significant scientific impact of HST.[82] The consideration that JWST will not be located in low Earth orbit, and therefore cannot be easily upgraded or repaired in the event of an early failure, only makes these concerns more acute. On the other hand, many astronomers felt strongly that the servicing of Hubble should not take place if the expense were to come from the JWST budget.",
				"after": "In January 2004, O'Keefe said he would review his decision to cancel the final servicing mission to HST due to public outcry and requests from Congress for NASA to look for a way to save it. The National Academy of Sciences convened an official panel, which recommended in July 2004 that the HST should be preserved despite the apparent risks. Their report urged \"NASA should take no actions that would preclude a space shuttle servicing mission to the Hubble Space Telescope\".[83] In August 2004, O'Keefe asked Goddard Space Flight Center to prepare a detailed proposal for a robotic service mission. These plans were later canceled, the robotic mission being described as \"not feasible\".[84] In late 2004, several Congressional members, led by Senator Barbara Mikulski, held public hearings and carried on a fight with much public support (including thousands of letters from school children across the country) to get the Bush Administration and NASA to reconsider the decision to drop plans for a Hubble rescue mission.[85]",
			"color": "black|0.87012 thistle|0.038245 dim|0.016498 gray|0.016498 dim|0.016498 grey|0.016498 gray|0.011629 grey|0.011629 rosy|0.010001 brown|0.010001 light|0.0085915 slate|0.0085915 gray|0.0085915 dark|0.0081631 gray|0.0081631 dark|0.0081631 grey|0.0081631 slate|0.0074699 gray|0.0074699 lavender|0.005776 saddle|0.0051175 brown|0.0051175  "
		}
	}
}
