{
	"add": {
		"doc": {
			"id": "430b6a97d228bb26f1537500c50559e5cf60ac3a2f5e2c119e6140f888f6e070",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5d/John_Shanks.jpg/180px-John_Shanks.jpg",
				"previous": "At some point the cathedral grounds had become the burial ground for Elgin. The town council arranged for the boundary wall to be repaired in 1685 but significantly, the council ordered that the stones from the cathedral should not be used for that purpose.[78] Although the building was becoming increasingly unstable the chapterhouse continued to be used for meetings of the Incorporated Trades from 1671 to 1676 and then again from 1701 to around 1731.[79] No attempt was made to stabilise the structure and on Easter Sunday 1711 the central tower gave way, demolishing the nave. Following this collapse, the \"quarrying\" of the cathedral's stone work for local projects began.[18] Many artists visited Elgin to sketch the ruins, and it is from their work that the slow but continuing ruination can be observed.[80] By the closing years of the 18th century, travellers to Elgin began to visit the ruin, and pamphlets giving the history of the cathedral were prepared for those early tourists. In 1773 Samuel Johnson recorded, \"a paper was put into our hands, which deduced from sufficient authorities the history of this venerable ruin.\"[81]",
				"after": "Since the abolition of bishops within the Scottish Church in 1689, ownership of the abandoned cathedral fell to the crown, but no attempt to halt the decline of the building took place. Acknowledging the necessity to stabilise the structure, the Elgin Town Council initiated the reconstruction of the perimeter wall in 1809 and cleared debris from the surrounding area in about 1815.[82] The Lord Provost of Elgin petitioned the King's Remembrancer for assistance to build a new roof for the chapterhouse and in 1824, £121 was provided to the architect Robert Reid for its construction. Reid was significant in the development of a conservation policy for historical buildings in Scotland and was to become the first Head of the Scottish Office of Works (SOW) in 1827. It was probably during his tenure at the SOW that the supporting buttresses to the choir and transept walls were built.[80]",
			"color": "dark|0.15937 gray|0.15937 dark|0.15937 grey|0.15937 silver|0.13928 light|0.11668 gray|0.11668 light|0.11668 grey|0.11668 gainsboro|0.09912 gray|0.092995 grey|0.092995 dim|0.072487 gray|0.072487 dim|0.072487 grey|0.072487 white|0.042805 smoke|0.042805 sea|0.031873 shell|0.031873 ghost|0.030081 white|0.030081 snow|0.030066 alice|0.029116 blue|0.029116 lavender|0.028566 blush|0.028566 linen|0.026807 white|0.024926 floral|0.023912 white|0.023912 mint|0.019419 cream|0.019419 black|0.014215 azure|0.013579  "
		}
	}
}
