{
	"add": {
		"doc": {
			"id": "43245e3772e5c67cbd07d37a13764ec10f0f8d0a76952f59ddbfb2800f1d9845",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Hans_Staden%2C_Tupinamba_portrayed_in_cannibalistic_feast.jpg/200px-Hans_Staden%2C_Tupinamba_portrayed_in_cannibalistic_feast.jpg",
				"previous": "The second chapter, entitled \"The Classic Man-Eaters\", explores the accounts of cannibalism produced by European colonialists and travellers in the Americas during the Early Modern era. It begins by documenting the Spanish interaction with the Carib people of the Lesser Antilles, first begun by Christopher Columbus and his men in the 1490s. Columbus noted that the Caribs had been described as cannibals by the neighbouring Arawak people of the West Indies, but was initially sceptical about such claims himself. Arens highlights that it was only later, when Columbus began to oversee largescale colonization and pacification of Carib lands, that he began to assert that they were cannibals, in order to legitimize his cause. Arens then proceeds to note that the Spanish government only permitted the enslavement of cannibals in the Caribbean, leading European colonists to increasingly label the indigenous peoples as cannibalistic in order to increase their economic power. Following on from this, Arens goes on to critique the longstanding claims that the Aztec people of Mexico were cannibals; noting that while the early Spanish accounts of the Aztecs include first-hand descriptions of human sacrifice, he highlights that none of these Spanish observers actually witnessed cannibalism, despite the claims that were later made asserting the cannibalistic nature of Aztec religion. In contrast, Arens argues that the Aztecs found the idea of cannibalism – even in survival conditions – socially reprehensible, and believed that some of their neighbouring peoples were guilty of it.[7]",
				"after": "Chapter three, \"The Contemporary Man-Eaters\" explores the claims made for socially sanctioned cannibalism in the 20th century, with a particular focus on Sub-Saharan Africa and New Guinea. Regarding the former, Arens discusses E. E. Evans-Pritchard's work in disproving that the Azande people were cannibalistic, before arguing that the stories of socially accepted cannibalism in the \"Dark Continent\" were based largely on misunderstandings and the sensationalist claims of European travellers like Henry Morton Stanley, and that there was no reputable first-hand accounts of such a practice anywhere in Africa. Instead, he notes that many African societies found cannibalism to be a reprehensible anti-social activity that was associated with witchcraft, drawing comparisons with the Early Modern European witch hunt. Moving on to look at claims for cannibalism in New Guinea made by anthropologists like Margaret Mead and Ronald Berndt, he notes that none of them ever actually came across any evidence of the practice themselves, before going on to critique claims that cannibalism was the cause of the kuru outbreak among the New Guinean Fore people in the mid 20th century.[8]",
			"color": " "
		}
	}
}
