{
	"add": {
		"doc": {
			"id": "432aabdd74879bf9db4a9b9368bcf12c9edcb1bd08611e9282aae1b833b85bcd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Kiva_Chaco_Canyon_NM.jpg/220px-Kiva_Chaco_Canyon_NM.jpg",
				"previous": "Casa Rinconada, isolated from the other central sites, sits to the south side of Chaco Wash, adjacent to a Chacoan road leading to a set of steep stairs that reached the top of Chacra Mesa. Its sole kiva stands alone, with no residential or support structures whatever; it did once have a 39-foot (12 m) passageway leading from the underground kiva to several above-ground levels. Chetro Ketl, located near Pueblo Bonito, bears the typical 'D'-shape of many other central complexes, but is slightly smaller. Begun between AD 1020 and 1050, its 450–550 rooms shared one Great Kiva. Experts estimate that it took 29,135 man-hours to erect Chetro Ketl alone; Hewett estimated that it took the wood of 5,000 trees and 50 million stone blocks.[52]",
				"after": "Kin Kletso (\"Yellow House\") was a medium-sized complex located 0.5 miles (800 m) west of Pueblo Bonito. It shows strong evidence of construction and occupation by Pueblo peoples from the northern San Juan Basin. Its rectangular shape and design is related to the Pueblo II cultural group, rather than the Pueblo III style or its Chacoan variant. It contains 55 rooms, four ground-floor kivas, and a two-story cylindrical tower that may have functioned as a kiva or religious center. Evidence of an obsidian-processing industry was discovered near the village, which was erected between AD 1125 and 1130.[53]",
			"color": "black|0.33789 silver|0.13521 dark|0.12107 gray|0.12107 dark|0.12107 grey|0.12107 light|0.10178 gray|0.10178 light|0.10178 grey|0.10178 gainsboro|0.072173 gray|0.05262 grey|0.05262 dim|0.040534 gray|0.040534 dim|0.040534 grey|0.040534 linen|0.026265 antique|0.018377 white|0.018377 old|0.014043 lace|0.014043 sea|0.01398 shell|0.01398 floral|0.010974 white|0.010974 white|0.010885 smoke|0.010885 snow|0.0073643 ivory|0.0069088 mint|0.0053054 cream|0.0053054 white|0.0049547 misty|0.00473 rose|0.00473 beige|0.0035285  "
		}
	}
}
