{
	"add": {
		"doc": {
			"id": "432de0ebd7842e9c273e1adfbddef04e18346f734ad2892b81c352514316bcc1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/AtlantaDuringCivilWar.jpg/220px-AtlantaDuringCivilWar.jpg",
				"previous": "By 1860, Atlanta's population had grown to 9,554.[31][32] During the Civil War, the nexus of multiple railroads in Atlanta made the city a hub for the distribution of military supplies. In 1864, following the capture of Chattanooga, the Union Army moved southward and began its invasion of north Georgia. The region surrounding Atlanta was the location of several major army battles, culminating with the Battle of Atlanta and a four-month-long siege of the city by the Union Army under the command of General William Tecumseh Sherman. On September 1, 1864, Confederate General John Bell Hood made the decision to retreat from Atlanta, ordering all public buildings and possible assets to the Union Army destroyed. On the next day, Mayor James Calhoun surrendered Atlanta to the Union Army, and on September 7, General Sherman ordered the city's civilian population to evacuate. On November 11, 1864, in preparation of the Union Army's march to Savannah, Sherman ordered Atlanta to be burned to the ground, sparing only the city's churches and hospitals.[33]",
				"after": "After the Civil War ended in 1865, Atlanta was gradually rebuilt. Due to the city's superior rail transportation network, the state capital was moved to Atlanta from Milledgeville in 1868.[34] In the 1880 Census, Atlanta surpassed Savannah as Georgia's largest city. Beginning in the 1880s, Henry W. Grady, the editor of the Atlanta Constitution newspaper, promoted Atlanta to potential investors as a city of the \"New South\" that would be based upon a modern economy and less reliant on agriculture. By 1885, the founding of the Georgia School of Technology (now Georgia Tech) and the city's black colleges had established the city as a center for higher education. In 1895, Atlanta hosted the Cotton States and International Exposition, which attracted nearly 800,000 attendees and successfully promoted the New South's development to the world.[35]",
			"color": " "
		}
	}
}
