{
	"add": {
		"doc": {
			"id": "432f910616321d6c47ee1da1d2c2531b37c86c9ebef3aeecef9fb849d523aab6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Regulus_ignicapilla_-Galicia%2C_Spain_-singing_in_a_conifer_tree-8_%281%29.jpg/220px-Regulus_ignicapilla_-Galicia%2C_Spain_-singing_in_a_conifer_tree-8_%281%29.jpg",
			"previous": [],
				"after": "The common firecrest is monogamous. The male sings during the breeding season, often with its crest raised, and has a display which involves pointing its bill at another bird, showing the crest and strong face pattern. This differs from the display of the plainer-faced goldcrest, which bows its head to emphasise the crest. The breeding territory is about 0.5 hectares (1.2 acres), and may overlap with neighbouring goldcrest territories. Firecrests will sometimes defend their territories against goldcrests with the crest raised and a great deal of wing-fluttering,[26] but the amount of actual competition between the species may not be very great. A Spanish study suggested that territorial conflicts between the species, and other phenomena like males singing mixed or alternating songs, were most frequent when one species locally far outnumbered the other;[27] in other circumstances, the two kinglets learned to ignore each other's songs. In his courtship display the male firecrest raises his crest, points it towards his mate and hovers over her before mating takes place.[26]",
			"color": "dark|0.11064 gray|0.11064 dark|0.11064 grey|0.11064 black|0.11058 olive|0.088274 dark|0.085244 olive|0.085244 green|0.085244 gray|0.075006 grey|0.075006 silver|0.072552 dim|0.070706 gray|0.070706 dim|0.070706 grey|0.070706 light|0.05403 gray|0.05403 light|0.05403 grey|0.05403 gainsboro|0.041828 lavender|0.035779 white|0.020591 smoke|0.020591 light|0.019465 steel|0.019465 blue|0.019465 ghost|0.018952 white|0.018952 tan|0.018908 alice|0.018707 blue|0.018707 snow|0.015882 white|0.014421 lavender|0.013345 blush|0.013345 sea|0.013132 shell|0.013132  "
		}
	}
}
