{
	"add": {
		"doc": {
			"id": "435f3d6702a84d62184970ec584117dd11f40b7b9dacd2b22d1d1780e52d6455",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/McKinley_at_Atlanta.jpg/220px-McKinley_at_Atlanta.jpg",
				"previous": "The administration’s response to racial violence was minimal, causing him to lose black support.[184] When black postmasters at Hogansville, Georgia in 1897, and at Lake City, South Carolina the following year, were assaulted, McKinley issued no statement of condemnation. Although black leaders criticized McKinley for inaction, supporters responded by saying there was little the president could do to intervene. Critics replied by saying that he could at least publicly condemn such events, as Harrison had done.[186]",
				"after": "According to historian Clarance A. Bacote, “Before the Spanish–American War, the Negroes, in spite of some mistakes, regarded McKinley as the best friend they ever had.”[187] African Americans saw the onset of war in 1898 as an opportunity to display their patriotism; and black soldiers fought bravely at El Caney and San Juan Hill. African Americans in the peacetime Army had formed elite units; nevertheless they were harassed by whites as they traveled from the West to Tampa for embarkation to the war. Under pressure from black leaders, McKinley required the War Department to commission black officers above the rank of lieutenant. The heroism of the black troops did not still racial tensions in the South, as the second half of 1898 saw several outbreaks of racial violence; 11 African Americans were killed in riots in Wilmington, North Carolina.[188] McKinley toured the South in late 1898, hoping for sectional reconciliation. In addition to visiting Tuskegee Institute and black educator Booker T. Washington, he addressed the Georgia legislature, wearing a badge of gray, and visited Confederate memorials. In his tour of the South, McKinley did not mention the racial tensions or violence. Although the President received a rapturous reception from Southern whites, many African Americans, excluded from official welcoming committees, felt alienated by the President’s words and actions.[188][189]",
			"color": "dim|0.34918 gray|0.34918 dim|0.34918 grey|0.34918 gray|0.24332 grey|0.24332 dark|0.1534 gray|0.1534 dark|0.1534 grey|0.1534 silver|0.10035 light|0.061958 gray|0.061958 light|0.061958 grey|0.061958 gainsboro|0.043619 black|0.028125 white|0.0054669 smoke|0.0054669  "
		}
	}
}
