{
	"add": {
		"doc": {
			"id": "437f99ba785b14f6f63cf98064a66f30c49a4fea096e50592fdd3665616bcca2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/WarKorea_B-29-korea.jpg/170px-WarKorea_B-29-korea.jpg",
				"previous": "The Chinese intervention in late October 1950 bolstered the Korean People's Air Force (KPAF) of North Korea with the MiG-15, one of the world's most advanced jet fighters.[270] The fast, heavily armed MiG outflew first-generation UN jets such as the F-80 (United States Air Force) and Gloster Meteors (Royal Australian Air Force) posing a real threat to B-29 Superfortress bombers even under fighter escort. Fearful of confronting the United States directly, the Soviet Union denied involvement of their personnel in anything other than an advisory role, but air combat quickly resulted in Soviet pilots dropping their code signals and speaking over the wireless in Russian. This known direct Soviet participation was a casus belli that the UN Command deliberately overlooked, lest the war for the Korean peninsula expand to include the Soviet Union, and potentially escalate into atomic warfare.[270]",
				"after": "The USAF countered the MiG-15 by sending over three squadrons of its most capable fighter, the F-86 Sabre. These arrived in December 1950.[272][273] The MiG was designed as a bomber interceptor. It had a very high service ceiling—50,000 feet (15,000 m) and carried very heavy weaponry: one 37 mm cannon and two 23 mm cannons. They were fast enough to dive past the fighter escort of P-80 Shooting Stars and F9F Panthers and could reach and destroy the U.S. heavy bombers. B-29 losses could not be avoided, and the Air Force was forced to switch from a daylight bombing campaign to the necessarily less accurate nighttime bombing of targets. The MiGs were countered by the F-86 Sabres. They had a ceiling of 42,000 feet (13,000 m) and were armed with six .50 caliber (12.7 mm) machine guns, which were range adjusted by radar gunsights. If coming in at higher altitude the advantage of engaging or not went to the MiG. Once in a level flight dogfight, both swept-wing designs attained comparable maximum speeds of around 660 mph (1,100 km/h). The MiG climbed faster, but the Sabre turned and dived better.[274]",
			"color": " "
		}
	}
}
