{
	"add": {
		"doc": {
			"id": "4394e41cbe4c97b69fbadd53d374007938873f2f10b7ba57f3dbc486583132f0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Radio_transmitter_implant_in_pallid_sturgeon.jpg/220px-Radio_transmitter_implant_in_pallid_sturgeon.jpg",
				"previous": "Two populations of pallid sturgeon in the Missouri and Yellowstone Rivers of Montana are both at risk of extinction and current projections are that wild pallid sturgeon populations in Montana will be extinct by 2018.[2] Though a vigorous stocking effort was implemented in 1996, until pallid sturgeon females reach reproductive maturity sometime after they are 15 years of age, recovery efforts in Montana will not be readily measurable. The U.S. Bureau of Reclamation has been conducting spring pulse water releases from the Tiber dam every four to five years to try and recreate a semblance of an annual spring flood to restore and rejuvenate downstream floodplains. These pulse releases are done in an effort to restore suitable habitat for numerous fish species.[38]",
				"after": "In Nebraska, a small number of pallid sturgeon have been captured along the lower reaches of the Platte River. Unlike most rivers in the Mississippi-Missouri river system, the Platte River has only a few dams and they are well upstream from its confluence with the Missouri River. The lower Platte River is shallow with numerous sand bars and small islands. Though pallid sturgeon prefer more turbulent and deeper rivers than the Platte River, between 1979 and 2003 over a dozen pallid sturgeon, including some from hatcheries, have been captured from the Platte River.[39] A number of these pallid sturgeon have been fitted with radio transmitters which track their return to the Platte River when water levels and turbidity conditions are favorable. Coinciding with the majority of the pallid sturgeon that have been captured, the period that is generally most favorable is during the spring and early summer months. By mid-summer, a reduction in water levels and turbidity on the Platte River encourages pallid sturgeon to return to the Missouri River.",
			"color": "silver|0.13471 dark|0.12852 gray|0.12852 dark|0.12852 grey|0.12852 light|0.097064 steel|0.097064 blue|0.097064 light|0.091706 gray|0.091706 light|0.091706 grey|0.091706 lavender|0.086096 gray|0.07096 grey|0.07096 slate|0.064668 gray|0.064668 gainsboro|0.0615 light|0.060003 slate|0.060003 gray|0.060003 dim|0.037042 gray|0.037042 dim|0.037042 grey|0.037042 pale|0.035414 turquoise|0.035414 dark|0.03164 slate|0.03164 gray|0.03164 light|0.015046 cyan|0.015046 cadet|0.013467 blue|0.013467 alice|0.011608 blue|0.011608 powder|0.0098875 blue|0.0098875 rosy|0.0085822 brown|0.0085822 ghost|0.0083047 white|0.0083047 black|0.0072826 white|0.0047532 smoke|0.0047532  "
		}
	}
}
