{
	"add": {
		"doc": {
			"id": "439a9af35f894d0c2c3ea6519d32fc2905e9e674e8ae09f93381f5b491419e40",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/UniversityHallFlags.jpg/250px-UniversityHallFlags.jpg",
			"previous": [],
				"after": "Ohio Wesleyan has upheld academic internationalism since its early years; since the 19th century, the college has established links with several international schools. In 1879, OWU alumna Elizabeth Russell founded Kwassui Women's College in Nagasaki, Japan, when predominant Japanese culture considered women's education unimportant.[102] Today, Kwasuii College is one of the top finishing schools for young women in Japan.[103] In 1899, William Ehnis (from the class of 1898) traveled to Africa and opened a school in Mutare, Zimbabwe, that eventually became the Africa University.[104] In March 1988, Conrad Kent established the popular Salamanca Spanish Program for Ohio Wesleyan students. The school also manifests international interest in the percentage of international students it recruits and enrolls annually. Since 1983, Ohio Wesleyan has been listed in U.S. News & World Report among colleges that attract the highest percentage of international students.[105][106][107][108] The percentage of international students grew in the early and mid-1990s.[109][110] In a study adjusted for school size, Ohio Wesleyan came ninth among 118 American colleges and universities in total aid awards to international students and 69th in average award per international student among both large universities and small liberal arts colleges.[111] South East Asian students have significantly contributed to this growth.[112] The United Nations flag, along with the flags of more than sixty represented nations and the U.S. flag, flies in University Hall in honor of the ideal of peaceful international relations.[113]",
			"color": "black|0.14576 dark|0.091449 red|0.091449 dark|0.074663 slate|0.074663 gray|0.074663 firebrick|0.070922 slate|0.068502 gray|0.068502 light|0.058605 slate|0.058605 gray|0.058605 dark|0.056864 gray|0.056864 dark|0.056864 grey|0.056864 maroon|0.054408 gray|0.037331 grey|0.037331 light|0.026868 blue|0.026868 light|0.025083 steel|0.025083 blue|0.025083 dim|0.02274 gray|0.02274 dim|0.02274 grey|0.02274 tan|0.018742 olive|0.018045 silver|0.01769 powder|0.015542 blue|0.015542 dark|0.01478 golden|0.01478 rod|0.01478 midnight|0.014584 blue|0.014584 brown|0.013434 sea|0.012669 green|0.012669 navy|0.011384 teal|0.0094326 cadet|0.0085619 blue|0.0085619 dark|0.0076839 blue|0.0076839  "
		}
	}
}
