{
	"add": {
		"doc": {
			"id": "43b937650e9315a5fb8eaea0011064324056fb0e2dcf5e0d8d73e91f5ede0517",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Table_Rock_Outcropping.jpg/220px-Table_Rock_Outcropping.jpg",
				"previous": "The Table Rocks offer one of the most popular hiking locations in the Rogue Valley, with over 45,000 visitors annually.[29][39][63] Over 4,600 people per year participate in guided hikes through the Table Rock Environmental Education Program, hosted by the Bureau of Land Management and The Nature Conservancy.[64] Lower Table Rock features a walking trail, which climbs approximately 780 feet (240 m) to the top of the plateau over a distance of 1.75 miles (2.82 km).[65][66] It has eight interpretive panels along its length, explaining the history, flora, and fauna of the region.[56] Upper Table Rock also has a walking trail, 1.25 miles (2.01 km) long, ascending approximately 720 feet (220 m).[65][66] The trails are the most popular with hikers between March and May, when the wildflowers are in bloom. Another peak occurs in September through October.[56] Landmarks such as Mount McLoughlin, Mount Ashland, Roxy Ann Peak, and Pilot Rock are visible on clear days from the edge of the rocks.[65][66]",
				"after": "The Youth Conservation Corps, Boy Scouts, and the Oregon Department of Forestry built the trails leading to the tops of the Table Rocks in the early 1980s, around the same time the plateaus were being nominated as an Area of Critical Environmental Concern.[38][39] In June 1999, only two small trees were cut when Shady Cove contractor Randy Hodges rerouted a 3⁄4-mile (1.2 km) section of the Lower Table Rock trail to accommodate the growing number of visitors. The project involved decommissioning the old section, expanding the parking lot, and installing 2,200 feet (671 m) of new trail. Measures to protect the trail were implemented, such as installing rock waterbars and a layer of shale gravel over the clay.[67]",
			"color": "dim|0.52163 gray|0.52163 dim|0.52163 grey|0.52163 gray|0.21043 grey|0.21043 dark|0.082699 slate|0.082699 gray|0.082699 steel|0.045965 blue|0.045965 dark|0.035134 gray|0.035134 dark|0.035134 grey|0.035134 black|0.029562 dark|0.022203 olive|0.022203 green|0.022203 slate|0.017873 gray|0.017873 light|0.010483 slate|0.010483 gray|0.010483 tan|0.0085651  "
		}
	}
}
