{
	"add": {
		"doc": {
			"id": "43d4a15b603650ba5221e0fc13b7eb6e6bf03250a8d38deff97bd007a8746eaf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Caligula10a.jpg/220px-Caligula10a.jpg",
				"previous": "The Andalusian horse has been known historically as the Iberian Saddle Horse, Iberian War Horse, Spanish Horse, Portuguese, Peninsular, Extremeno, Villanos, Zapata, Zamaranos, Castilian,[6] and Jennet.[55] The Portuguese name refers to what is now the Lusitano, while the Peninsular, Iberian Saddle Horse and Iberian War Horse names refer to horses from the Iberian Peninsula as a whole. The Extremeno name refers to Spanish horses from the Extremadura province of Spain and the Zapata or Zapatero name to horses that come from the Zapata family stud. The Villano name has occasionally been applied to modern Andalusians, but originally referred to heavy, crossbred horses from the mountains north of Jaen.[56] The Carthusian horse, also known as the Carthusian-Andalusian and the Cartujano, is a sub-type of the Andalusian, rather than a distinct breed in itself.[7] A common nickname for the Andalusian is the \"Horse of Kings\".[57] Some sources state that the Andalusian and the Lusitano are genetically the same, differing only in the country of origin of individual horses.[58]",
				"after": "In many areas today, the breeding, showing, and registration of the Andalusian and Lusitano are controlled by the same registries. One example of this is the International Andalusian and Lusitano Horse Association (IALHA), claimed to have the largest membership of any Andalusian registering organization.[4] Other organizations, such as The Association of Purebred Spanish Horse Breeders of Spain (Asociación Nacional de Criadores de Caballo de Pura Raza Española or ANCCE), use the term \"Pura Raza Española\" or PRE to describe the true Spanish horse, and claim sole authority to officially register and issue documentation for PRE Horses, both in Spain and anywhere else in the world. In most of the world the terms \"Andalusian\" and \"PRE\" are considered one and the same breed,[4] but the public position of the ANCCE is that terms such as \"Andalusian\" and \"Iberian horse\" refer only to crossbreds, which the ANCCE considers to be horses that lack quality and purity, without official documentation or registration from official Spanish Stud Book.[10]",
			"color": "black|0.32679 silver|0.088104 dark|0.08679 gray|0.08679 dark|0.08679 grey|0.08679 light|0.077614 gray|0.077614 light|0.077614 grey|0.077614 dim|0.072934 gray|0.072934 dim|0.072934 grey|0.072934 gray|0.071433 grey|0.071433 gainsboro|0.054507 antique|0.027542 white|0.027542 linen|0.026975 misty|0.02562 rose|0.02562 sea|0.016863 shell|0.016863 old|0.016706 lace|0.016706 slate|0.015334 gray|0.015334 floral|0.011921 white|0.011921 tan|0.011737 white|0.010098 smoke|0.010098 lavender|0.007269 blush|0.007269 snow|0.0070825 light|0.0059901 slate|0.0059901 gray|0.0059901 ivory|0.0054709 papaya|0.0053198 whip|0.0053198 wheat|0.0038381  "
		}
	}
}
