{
	"add": {
		"doc": {
			"id": "43f78b6729913f508ac59fa36b8635969f1773f5ec79250d25f8d2a0a9ec153d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/MarwariHorseRajasthan.jpg/170px-MarwariHorseRajasthan.jpg",
				"previous": "The period of the British Raj hastened the Marwari's downfall, as did the eventual independence of India. The British occupiers preferred other breeds,[11] and tried to eliminate the Marwari, along with the Kathiawari.[12] The British instead preferred Thoroughbreds and polo ponies, and reduced the reputation of the Marwari to the point where even the inward-turning ears of the breed were mocked as the \"mark of a native horse\".[13] During the 1930s the Marwari deteriorated, with breeding stock diminishing and becoming of poorer quality due to poor breeding practices.[6] Indian independence, along with the obsolescence of warriors on horseback, led to a decreased need for the Marwari and many animals were subsequently killed.[11] In the 1950s many Indian noblemen lost their land and hence much of their ability to take care of animals, resulting in many Marwari horses being sold as pack horses, castrated, or killed. The breed was on the verge of extinction[4] until the intervention of Maharaja Umaid Singhji in the first half of the 20th century saved the Marwari. His work was carried on by his grandson, Maharaja Gaj Singh II.[6]",
				"after": "A British horsewoman named Francesca Kelly founded a group called Marwari Bloodlines in 1995, with the goal of promoting and preserving the Marwari horse around the world.[14] In 1999, Kelly and Raghuvendra Singh Dundlod, a descendant of Indian nobility, led a group that founded the Indigenous Horse Society of India (of which the Marwari Horse Society is part), a group that works with the government, breeders, and the public to promote and conserve the breed. Kelly and Dunlod also entered and won endurance races at the Indian national equestrian games, convincing the Equestrian Federation of India to sanction a national show for indigenous horses – the first in the country. The pair worked with other experts from the Indigenous Horse Society to develop the first breed standards.[15]",
			"color": "black|0.26065 tan|0.11835 peach|0.073228 puff|0.073228 bisque|0.059224 blanched|0.043542 almond|0.043542 antique|0.04196 white|0.04196 papaya|0.038807 whip|0.038807 burly|0.032107 wood|0.032107 wheat|0.027527 corn|0.025069 silk|0.025069 old|0.02409 lace|0.02409 beige|0.022654 linen|0.018477 light|0.015551 yellow|0.015551 floral|0.014727 white|0.014727 ivory|0.013971 dark|0.010535 gray|0.010535 dark|0.010535 grey|0.010535 sea|0.010144 shell|0.010144 gray|0.0097453 grey|0.0097453 moccasin|0.0094191 silver|0.0088192 dim|0.0085741 gray|0.0085741 dim|0.0085741 grey|0.0085741 navajo|0.0085696 white|0.0085696 light|0.0083014 gray|0.0083014 light|0.0083014 grey|0.0083014 white|0.0076833 smoke|0.0076833 snow|0.0071503 light|0.0070916 golden|0.0070916 rod|0.0070916 yellow|0.0070916 gainsboro|0.0069831 white|0.0062508 mint|0.0057913 cream|0.0057913 lavender|0.0057494 blush|0.0057494 ghost|0.0056213 white|0.0056213 alice|0.0048614 blue|0.0048614 honeydew|0.0044215 azure|0.0040785  "
		}
	}
}
