{
	"add": {
		"doc": {
			"id": "43f892f6e25d1be42263d1bb2f2560bd5be581eb16027472f8ba636f1e79b9a7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Lady_from_Shanghai_trailer_rita_hayworth6.JPG/220px-Lady_from_Shanghai_trailer_rita_hayworth6.JPG",
				"previous": "While the inceptive noir, Stranger on the Third Floor, was a B picture directed by a virtual unknown, many of the film noirs that have earned enduring fame were A-list productions by name-brand filmmakers. Debuting as a director with The Maltese Falcon (1941), John Huston followed with the major noirs Key Largo (1948) and The Asphalt Jungle (1950). Opinion is divided on the noir status of several of Alfred Hitchcock's thrillers from the era; at least four qualify by consensus: Shadow of a Doubt (1943), Notorious (1946), Strangers on a Train (1951), and The Wrong Man (1956).[53] Otto Preminger's success with Laura (1944) made his name and helped demonstrate noir's adaptability to a high-gloss 20th Century-Fox presentation.[54] Among Hollywood's most celebrated directors of the era, arguably none worked more often in a noir mode than Preminger—his other classic noirs include Fallen Angel (1945), Whirlpool (1949), Where the Sidewalk Ends (1950) (all for Fox) and Angel Face (1952). A half-decade after Double Indemnity and The Lost Weekend, Billy Wilder made Sunset Boulevard (1950) and Ace in the Hole (1951), noirs that were not so much crime dramas as satires on, respectively, Hollywood and the news media. In a Lonely Place (1950) was Nicholas Ray's breakthrough; his other noirs include his debut, They Live by Night (1948), and On Dangerous Ground (1952), noted for their unusually sympathetic treatment of characters alienated from the social mainstream.[55]",
				"after": "Orson Welles had notorious problems with financing, but his three film noirs were well budgeted: The Lady from Shanghai (1947) received top-level, \"prestige\" backing, while both The Stranger, his most conventional film, and Touch of Evil, an unmistakably personal work, were funded at levels lower but still commensurate with headlining releases.[56] Like The Stranger, Fritz Lang's The Woman in the Window (1945) was a production of the independent International Pictures. Lang's follow-up, Scarlet Street (1945), was one of the few classic noirs to be officially censored: filled with erotic innuendo, it was temporarily banned in Milwaukee, Atlanta, and New York State.[57] Scarlet Street was a semi-independent—cosponsored by Universal and Lang's own Diana Productions, of which the film's costar, Joan Bennett, was the second biggest shareholder. Lang, Bennett, and her husband, Universal veteran and Diana production head Walter Wanger, would make Secret Beyond the Door (1948) in similar fashion.[58]",
			"color": "dim|0.33269 gray|0.33269 dim|0.33269 grey|0.33269 gray|0.3009 grey|0.3009 dark|0.1667 gray|0.1667 dark|0.1667 grey|0.1667 silver|0.060033 light|0.02812 gray|0.02812 light|0.02812 grey|0.02812 gainsboro|0.02255 white|0.012202 smoke|0.012202 alice|0.0093648 blue|0.0093648 ghost|0.0091412 white|0.0091412 sea|0.0088578 shell|0.0088578 snow|0.0088082 lavender|0.0080604 blush|0.0080604 white|0.0078874 mint|0.0070184 cream|0.0070184 floral|0.0058544 white|0.0058544 azure|0.005629 linen|0.0047826  "
		}
	}
}
