{
	"add": {
		"doc": {
			"id": "441252eea9cae224083ffd896a91d176dfde1d4b5d4c396c14f1212c2fb7ebd3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Elvis_Presley_and_Judy_Tyler_in_Jailhouse_Rock_trailer.jpg/220px-Elvis_Presley_and_Judy_Tyler_in_Jailhouse_Rock_trailer.jpg",
				"previous": "Presley made his third and final Ed Sullivan Show appearance on January 6, 1957—on this occasion indeed shot only down to the waist. Some commentators have claimed that Parker orchestrated an appearance of censorship to generate publicity.[125][134] In any event, as critic Greil Marcus describes, Presley \"did not tie himself down. Leaving behind the bland clothes he had worn on the first two shows, he stepped out in the outlandish costume of a pasha, if not a harem girl. From the make-up over his eyes, the hair falling in his face, the overwhelmingly sexual cast of his mouth, he was playing Rudolph Valentino in The Sheik, with all stops out.\"[111] To close, displaying his range and defying Sullivan's wishes, Presley sang a gentle black spiritual, \"Peace in the Valley\". At the end of the show, Sullivan declared Presley \"a real decent, fine boy\".[135] Two days later, the Memphis draft board announced that Presley would be classified 1A and would probably be drafted sometime that year.[136]",
				"after": "Each of the three Presley singles released in the first half of 1957 went to number one: \"Too Much\", \"All Shook Up\", and \"(Let Me Be Your) Teddy Bear\". Already an international star, he was attracting fans even where his music was not officially released. Under the headline \"Presley Records a Craze in Soviet\", The New York Times reported that pressings of his music on discarded X-ray plates were commanding high prices in Leningrad.[137] Between film shoots and recording sessions, the singer also found time to purchase an 18-room mansion eight miles (13 km) south of downtown Memphis for himself and his parents: Graceland.[138] Loving You—the soundtrack to his second film, released in July—was Presley's third straight number one album. The title track was written by Leiber and Stoller, who were then retained to write four of the six songs recorded at the sessions for Jailhouse Rock, Presley's next movie. The songwriting team effectively produced the Jailhouse sessions and developed a close working relationship with Presley, who came to regard them as his \"good-luck charm\".[139]",
			"color": " "
		}
	}
}
