{
	"add": {
		"doc": {
			"id": "441ae732fc78b9e753dfa2d04f005ace776f82cf29b31952d484ea71babd75da",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Vickers_Viscount_807_ZK-BRD_Wellington_210471.jpg/220px-Vickers_Viscount_807_ZK-BRD_Wellington_210471.jpg",
				"previous": "TCA's procurement of the Viscount generated considerable interest from airlines and industry figures across the United States, including American aviation pioneer Howard Hughes, Hughes purchased 15 Viscounts immediately after personally flying one.[52][53] U.S. Capital Airlines became an important operator of the Type 700 Viscount,[N 8] using it heavily throughout the eastern U.S. routes; it was reported in 1958 that Capital had accumulated over 350,000 flight hours on its Viscounts, more than any other operator.[54] Continental Airlines and Northeast Airlines also became US Viscount operators.[55]",
				"after": "The first airline in Latin America to operate the Viscount was Cubana de Aviación. Cubana's -755D Viscounts, delivered in 1956, were placed on the Havana-Miami and Varadero-Miami routes, and were successful at raising Cubana's market share on these routes.[56] During the 1958 Cuban elections, a Cubana Viscount was hijacked by gunmen aligned with the 26th of July Movement, the aircraft crash-landed in the sea, reportedly killing 17 of the 20 occupants.[57] When the U.S. government imposed its embargo on Cuba in 1962, Cubana decided to sell all of its Viscounts. They were replaced by Soviet-built turboprop aircraft.[citation needed]",
			"color": "dim|0.40365 gray|0.40365 dim|0.40365 grey|0.40365 gray|0.1171 grey|0.1171 slate|0.068473 gray|0.068473 dark|0.054606 gray|0.054606 dark|0.054606 grey|0.054606 black|0.049398 silver|0.029784 light|0.027171 slate|0.027171 gray|0.027171 light|0.021667 gray|0.021667 light|0.021667 grey|0.021667 gainsboro|0.01853 white|0.016957 smoke|0.016957 lavender|0.015673 blush|0.015673 snow|0.015081 sea|0.014536 shell|0.014536 ghost|0.014047 white|0.014047 rosy|0.013997 brown|0.013997 white|0.013509 floral|0.011959 white|0.011959 alice|0.010957 blue|0.010957 linen|0.010671 mint|0.010564 cream|0.010564 misty|0.0076198 rose|0.0076198 brown|0.0070862 lavender|0.0067852 azure|0.005767  "
		}
	}
}
