{
	"add": {
		"doc": {
			"id": "441b6e1b321bbd647fa5407706649c5fa4dff20676bf357ecc24a4586c384242",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Mammuthus_primigenius_lectotypes.jpg/220px-Mammuthus_primigenius_lectotypes.jpg",
				"previous": "Following Cuvier's identification, Johann Friedrich Blumenbach gave the woolly mammoth its scientific name, Elephas primigenius, in 1799, placing it in the same genus as the Asian elephant. This name is Latin for \"first elephant\". Cuvier coined the name Elephas mammonteus a few months later, but the former name was subsequently used.[7] In 1828, Joshua Brookes used the name Mammuthus borealis for woolly mammoth fossils in his collection that he put up for sale, thereby coining a new genus name.[8] It is unclear where and how the word \"mammoth\" originated. According to the Oxford English Dictionary, it comes from an old Vogul word mēmoŋt 'earth-horn'.[9] It may be a version of mehemot, the Arabic version of the biblical word \"behemoth\". Another possible origin is Estonian, where maa means earth, and mutt means mole. The word was first used in Europe during the early 17th century, when referring to maimanto tusks discovered in Siberia.[10] Thomas Jefferson, who had a keen interest in palaeontology, is partially responsible for transforming the word mammoth from a noun describing the prehistoric elephant to an adjective describing anything of surprisingly large size. The first recorded use of the word as an adjective was in a description of a wheel of cheese (the \"Cheshire Mammoth Cheese\") given to Jefferson in 1802.[11]",
				"after": "The taxonomy of extinct elephants was complicated by the early 20th century, and in 1942, Henry Fairfield Osborn's posthumous monograph on the Proboscidea was published, wherein he used various taxon names that had previously been proposed for mammoth species, including replacing Mammuthus with Mammonteus, as he believed the former name to be invalidly published.[12] Mammoth taxonomy was simplified by various researchers from the 1970s onwards, all species were retained in the genus Mammuthus, and many proposed differences between species were instead interpreted as intraspecific variation.[13] Osborn chose two molars (found in Siberia and Osterode) from Blumenbach's collection at Göttingen University as the lectotype specimens for the woolly mammoth, since holotype designation was not practised in Blumenbach's time. Vera Gromova further proposed the former should be considered the lectotype with the latter as paralectotype. Both molars were thought lost by the 1980s, and the more complete \"Taimyr mammoth\" found in Siberia in 1948 was therefore proposed as the neotype specimen in 1990. Resolutions to historical issues about the validity of the genus name Mammuthus and the type species designation of E. primigenius were also proposed.[14] The paralectotype molar (specimen GZG.V.010.018) has sine been located in the Göttingen University collection, identified by comparing it with Osborn's illustration of a cast.[7][15]",
			"color": "dark|0.098841 gray|0.098841 dark|0.098841 grey|0.098841 light|0.08165 gray|0.08165 light|0.08165 grey|0.08165 silver|0.080953 gainsboro|0.075887 linen|0.069725 sea|0.060314 shell|0.060314 white|0.05986 smoke|0.05986 old|0.058612 lace|0.058612 floral|0.057962 white|0.057962 gray|0.053844 grey|0.053844 ivory|0.051392 mint|0.044913 cream|0.044913 antique|0.041977 white|0.041977 beige|0.04022 honeydew|0.039737 dim|0.024974 gray|0.024974 dim|0.024974 grey|0.024974 snow|0.023456 white|0.012886 azure|0.0040877 corn|0.0036345 silk|0.0036345 ghost|0.0035686 white|0.0035686 papaya|0.0032845 whip|0.0032845 alice|0.0032026 blue|0.0032026  "
		}
	}
}
