{
	"add": {
		"doc": {
			"id": "441e8d0a7aaaccdabfdec09bb6dd88795a18173d06eb111cc4839108c46c6413",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Robert_Campin_006.jpg/280px-Robert_Campin_006.jpg",
				"previous": "Van der Weyden's depiction of the Magdalen is based on Mary of Bethany,[9][33] identified by the time of Pope Gregory I as the repentant prostitute of Luke 7:36–50.[34] She then became associated with weeping and reading: Christ's mercy causes the eyes of the sinner to be contrite or tearful. Early Renaissance artists often conveyed this idea by portraying contemplative eyes, associating tears with words, and in turn weeping with reading. Examples can be seen in 16th-century works by Tintoretto and Titian which show the Magdalen reading, often with her eyes averted towards her book (and presumably away from a male gaze), or looking up to the heavens or, sometimes, glancing coyly towards the viewer.[35] Writing in \"The Crying Face\", Mosche Barasch explains that in van der Weyden's time the gesture of averting or concealing the eyes became a \"pictorial formula for crying\".[36]",
				"after": "By the medieval period, reading became synonymous with devotion, which involved withdrawal from public view. Van der Weyden's placement of the Magdalen in an interior scene reflects the increasing literacy of domestic or laywomen in the mid-15th century. The increased production of devotional texts showed that noble women of the period routinely read texts such as a psalter or book of hours in the privacy of their homes.[37] Whether the Magdalen herself was a reader, by the 17th century she was firmly established as such in the visual arts. Because the Magdalen was present at Christ's death and subsequent resurrection, she was seen as the bearer of news—a witness—and hence directly associated with the text.[38]",
			"color": "black|0.27553 burly|0.090053 wood|0.090053 tomato|0.072391 dark|0.069938 khaki|0.069938 saddle|0.059286 brown|0.059286 peru|0.051118 tan|0.049215 dark|0.042112 golden|0.042112 rod|0.042112 wheat|0.038397 pale|0.037764 golden|0.037764 rod|0.037764 lemon|0.016682 chiffon|0.016682 navajo|0.016499 white|0.016499 moccasin|0.016188 light|0.013255 golden|0.013255 rod|0.013255 yellow|0.013255 firebrick|0.011377 salmon|0.010455  "
		}
	}
}
