{
	"add": {
		"doc": {
			"id": "442daf90ac9e783a96df449347a614651f51bd8a111a9cfdd3684dfbcd3e1e43",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Platinum-nugget.jpg/220px-Platinum-nugget.jpg",
				"previous": "Platinum has six naturally occurring isotopes: 190Pt, 192Pt, 194Pt, 195Pt, 196Pt, and 198Pt. The most abundant of these is 195Pt, comprising 33.83% of all platinum. It is the only stable isotope with a non-zero spin; with a spin of 1/2, 195Pt satellite peaks are often observed in 1H and 31P NMR spectroscopy (i.e., Pt-phosphine and Pt-alkyl complexes). 190Pt is the least abundant at only 0.01%. Of the naturally occurring isotopes, only 190Pt is unstable, though it decays with a half-life of 6.5×1011 years, causing an activity of 15 Bq/kg of natural platinum. 198Pt can undergo alpha decay, but its decay had never been observed (the half-life is known to be longer than 3.2×1014 years), therefore it is considered stable. Platinum also has 31 synthetic isotopes ranging in atomic mass from 166 to 202, making the total number of known isotopes 37. The least stable of these is 166Pt with a half-life of 300 µs, whereas the most stable is 193Pt with a half-life of 50 years. Most platinum isotopes decay by some combination of beta decay and alpha decay. 188Pt, 191Pt, and 193Pt decay primarily by electron capture. 190Pt and 198Pt have double beta decay paths.[15]",
				"after": "Platinum is an extremely rare metal,[16] occurring at a concentration of only 0.005 ppm in Earth's crust.[17][18] It is sometimes mistaken for silver (Ag). Platinum is often found chemically uncombined as native platinum and as alloy with the other platinum-group metals and iron mostly. Most often the native platinum is found in secondary deposits in alluvial deposits. The alluvial deposits used by pre-Columbian people in the Chocó Department, Colombia are still a source for platinum-group metals. Another large alluvial deposit is in the Ural Mountains, Russia, and it is still mined.[11]",
			"color": "dim|0.3593 gray|0.3593 dim|0.3593 grey|0.3593 black|0.23613 gray|0.2278 grey|0.2278 dark|0.092118 gray|0.092118 dark|0.092118 grey|0.092118 silver|0.027164 light|0.013899 gray|0.013899 light|0.013899 grey|0.013899 gainsboro|0.010682  "
		}
	}
}
