{
	"add": {
		"doc": {
			"id": "443c46d8dfb268ade1415d68ad96c22cfc2e8b0772c234f3a8d087561fe355d6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Room_39_British_Museum.jpg/220px-Room_39_British_Museum.jpg",
			"previous": [],
				"after": "The Department of Prehistory and Europe was established in 1969 and is responsible for collections that cover a vast expanse of time and geography. It includes some of the earliest objects made by humans in east Africa over 2 million years ago, as well as Prehistoric and neolithic objects from other parts of the world; and the art and archaeology of Europe from the earliest times to the present day. Archeological excavation of prehistoric material took off and expanded considerably in the twentieth century and the department now has literally millions of objects from the Paleolithic and Mesolithic periods throughout the world, as well as from the Neolithic, Bronze Age and Iron age in Europe. Stone Age material from Africa has been donated by famous archaeologists such as Louis and Mary Leakey, and Gertrude Caton–Thompson. Paleolithic objects from the Sturge, Christy and Lartet collections include some of the earliest works of art from Europe. Many Bronze Age objects from across Europe were added during the nineteenth century, often from large collections built up by excavators and scholars such as Greenwell in Britain, Tobin and Cooke in Ireland, Lukis and de la Grancière in Brittany, Worsaae in Denmark, Siret at El Argar in Spain, and Klemm and Edelmann in Germany. A representative selection of Iron Age artefacts from Hallstatt were acquired as a result of the Evans/Lubbock excavations and from Giubiasco in Ticino through the Swiss National Museum.",
			"color": "black|0.20421 gray|0.19117 grey|0.19117 dim|0.1369 gray|0.1369 dim|0.1369 grey|0.1369 dark|0.11314 gray|0.11314 dark|0.11314 grey|0.11314 silver|0.044421 tan|0.028507 light|0.023804 gray|0.023804 light|0.023804 grey|0.023804 gainsboro|0.017576 white|0.015121 smoke|0.015121 floral|0.014327 white|0.014327 sea|0.013682 shell|0.013682 mint|0.013328 cream|0.013328 snow|0.012215 white|0.011782 linen|0.01175 light|0.011706 steel|0.011706 blue|0.011706 azure|0.010121 ivory|0.0097839 burly|0.0088255 wood|0.0088255 ghost|0.0083676 white|0.0083676 saddle|0.0079848 brown|0.0079848 old|0.0079062 lace|0.0079062 alice|0.0071058 blue|0.0071058 light|0.0063296 slate|0.0063296 gray|0.0063296 light|0.0062187 blue|0.0062187 honeydew|0.0062073 antique|0.0058619 white|0.0058619  "
		}
	}
}
