{
	"add": {
		"doc": {
			"id": "44429b0ec8666ff21ca4039380897b986ac35a03666c6fc22696c82b49dcf418",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/ConcordeCockpitSinsheim.jpg/220px-ConcordeCockpitSinsheim.jpg",
				"previous": "Concorde had other considerable difficulties that led to its dismal sales performance. Costs had spiralled during development to more than six times the original projections, arriving at a unit cost of £23 million in 1977.[50] World events had also dampened Concorde sales prospects, the 1973 oil crisis made many airlines think twice about aircraft with high rates of fuel consumption; and new wide-body aircraft, such as the Boeing 747, had recently made subsonic aircraft significantly more efficient and presented a low-risk option for airlines.[51] While carrying a full load, Concorde achieved 15.8 passenger miles per gallon of fuel, while the Boeing 707 reached 33.3 pm/g, the Boeing 747 46.4 pm/g, and the McDonnell Douglas DC-10 53.6 pm/g.[52] An emerging trend in the industry in favour of cheaper airline tickets had also caused airlines such as Qantas to question Concorde's market suitability.[53]",
				"after": "Concorde is an ogival delta winged aircraft with four Olympus engines based on those employed in the RAF's Avro Vulcan strategic bomber. It is one of the few commercial aircraft to employ a tailless design (the Tupolev Tu-144 being another). Concorde was the first airliner to have a (in this case, analogue) fly-by-wire flight-control system; the avionics system the Concorde used was unique because it was the first commercial aircraft to employ hybrid circuits.[54] The principal designer for the project was Pierre Satre, with Sir Archibald Russell as his deputy.[55]",
			"color": "black|0.57558 dim|0.19009 gray|0.19009 dim|0.19009 grey|0.19009 gray|0.079783 grey|0.079783 dark|0.043143 slate|0.043143 gray|0.043143 dark|0.030375 gray|0.030375 dark|0.030375 grey|0.030375 slate|0.022808 gray|0.022808 light|0.014359 slate|0.014359 gray|0.014359 silver|0.010793 light|0.0057145 gray|0.0057145 light|0.0057145 grey|0.0057145  "
		}
	}
}
