{
	"add": {
		"doc": {
			"id": "444900cab0d299db178a2a729a4c25fe813d5c5e62b52c1538cbbfe1924e3036",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/MSU_Wharton_Center.jpg/220px-MSU_Wharton_Center.jpg",
				"previous": "The oldest part of campus lies on the north bank of the Red Cedar.[27] It includes Collegiate Gothic architecture, plentiful trees, and curving roads with few straight lines. The College built its first three buildings here, of which none survive. Other historic buildings north of the river include the president's official residence, Cowles House, and Beaumont Tower, a carillon clock tower marking the site of College Hall, the original classroom building. To the east lies Eustace–Cole Hall, America's first freestanding horticulture laboratory.[28] Other landmarks include the bronze statue of former president John A. Hannah,[29] the W. J. Beal Botanical Garden, and the painted boulder known as \"The Rock\", which is a popular spot for theatre, tailgating, and candlelight vigils. On the northwest corner of campus lies the University's hotel, the Kellogg Hotel and Conference Center. The university also has a museum, initiated in 1857. MSU Museum is one of the oldest museums in the Midwest and is accredited by the American Alliance of Museums.[30]",
				"after": "The campus south of the river consists mostly of post-World War II International Style buildings, and is characterized by sparser foliage, relatively straight roadways, and many parking lots. The \"2020 Vision\" Master Plan proposes replacing these parking lots with parking ramps and green space,[31] but these plans will take many years to reach fruition. As part of the master plan, the University erected a new bronze statue of The Spartan in 2005 to be placed at the intersection of Chestnut and Kalamazoo, just south of the Red Cedar River. This replica replaced the original modernist terra cotta statue,[32] which can still be seen inside Spartan Stadium. Notable academic and research buildings on the South Campus include the Cyclotron and the College of Law.",
			"color": "dark|0.20809 olive|0.20809 green|0.20809 dim|0.2066 gray|0.2066 dim|0.2066 grey|0.2066 gray|0.13576 grey|0.13576 olive|0.11617 drab|0.11617 black|0.069099 silver|0.064701 dark|0.055437 gray|0.055437 dark|0.055437 grey|0.055437 rosy|0.041959 brown|0.041959 slate|0.026734 gray|0.026734 light|0.019946 slate|0.019946 gray|0.019946 dark|0.012996 sea|0.012996 green|0.012996 dark|0.011609 slate|0.011609 gray|0.011609 light|0.01048 gray|0.01048 light|0.01048 grey|0.01048  "
		}
	}
}
