{
	"add": {
		"doc": {
			"id": "445c154bd510575ffd32d62f17cbc37dfd0bc5b65e6c3420f2712ffd4c0ce497",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/China_Southern_Airlines_Headquarters.jpg/220px-China_Southern_Airlines_Headquarters.jpg",
				"previous": "In early 2015 it was announced that the airline would lease 24 Airbus A320neo aircraft from AerCap for delivery between 2016 and 2019.[36]",
			"after": [
				"China Southern is headquartered in Baiyun District, Guangzhou, Guangdong Province, People's Republic of China.[37][38][39]",
				"China Southern plans to open a new headquarters facility on a 988-acre (400 ha) site on the outskirts of Guangzhou, about 4 miles (6.4 km) from Guangzhou Baiyun International Airport. Woods Bagot won a competition for the architect firm which would design the facility. The proposed site consists of two parcels of land on opposite sides of a highway leading to Baiyun Airport; both sites are shaped like wings. The site will have a bridge and light rail system that operates above the highway to connect the two parcels, which will each have distinct functions. For instance, the east parcel will house internal functions such as the data center facilities, staff dormitories, and the training center. The airline wants it to be aesthetically pleasing from the air since it sits below a runway approach. The site will have a lot of outdoor space, which Woods Bagot designed along with Hargreaves Associates and Sherwood Design Engineers. Jean Weng, a Woods Bagot Beijing-based principal, said \"Most Chinese cities are very dense and very urban, but China Southern wants to create a human-scale campus, that’s close to nature.\"[40]"
			],
			"color": "black|0.32373 cadet|0.067881 blue|0.067881 dark|0.048628 gray|0.048628 dark|0.048628 grey|0.048628 silver|0.046382 light|0.041629 gray|0.041629 light|0.041629 grey|0.041629 gainsboro|0.036841 dim|0.032092 gray|0.032092 dim|0.032092 grey|0.032092 linen|0.03133 gray|0.029441 grey|0.029441 white|0.028694 smoke|0.028694 sea|0.028528 shell|0.028528 floral|0.027712 white|0.027712 old|0.02397 lace|0.02397 mint|0.022534 cream|0.022534 snow|0.022398 ivory|0.019702 white|0.01882 honeydew|0.017514 antique|0.017357 white|0.017357 dark|0.013985 slate|0.013985 gray|0.013985 azure|0.010619 ghost|0.0098774 white|0.0098774 pale|0.0095559 turquoise|0.0095559 slate|0.0086005 gray|0.0086005 light|0.0083251 slate|0.0083251 gray|0.0083251 lavender|0.0080688 blush|0.0080688 beige|0.007918 alice|0.0064172 blue|0.0064172 powder|0.00581 blue|0.00581 dark|0.0049165 sea|0.0049165 green|0.0049165  "
		}
	}
}
