{
	"add": {
		"doc": {
			"id": "445ffa117b77fb78442f7e5d6a356ea404645a8d92172c67fb3fddfcbc2391e0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/The_Ulster_Bank_Group_HQ%2C_George%27s_Quay_Plaza_-_geograph.org.uk_-_1743476.jpg/220px-The_Ulster_Bank_Group_HQ%2C_George%27s_Quay_Plaza_-_geograph.org.uk_-_1743476.jpg",
				"previous": "Many of Dublin's traditional industries, such as food processing, textile manufacturing, brewing, and distilling have gradually declined, although Guinness has been brewed at the St. James's Gate Brewery since 1759. Economic improvements in the 1990s have attracted a large number of global pharmaceutical, information and communications technology companies to the city and Greater Dublin Area. Companies such as Microsoft, Google, Amazon, eBay, PayPal, Yahoo!, Facebook, Twitter and Pfizer now have European headquarters and/or operational bases in the city.",
				"after": "Financial services have also become important to the city since the establishment of Dublin's International Financial Services Centre in 1987, which is globally recognised as a leading location for a range of internationally traded financial services. More than 500 operations are approved to trade in under the IFSC programme. The centre is host to half of the world's top 50 banks and to half of the top 20 insurance companies.[46] Many international firms have established major headquarters in the city, such as Citibank and Commerzbank. The Irish Stock Exchange (ISEQ), Internet Neutral Exchange (INEX) and Irish Enterprise Exchange (IEX) are also located in Dublin. The economic boom led to a sharp increase in construction, with large redevelopment projects in the Dublin Docklands and Spencer Dock. Completed projects include the Convention Centre, the 3Arena, and the Bord Gáis Energy Theatre.",
			"color": "dim|0.24597 gray|0.24597 dim|0.24597 grey|0.24597 gray|0.17237 grey|0.17237 dark|0.12523 gray|0.12523 dark|0.12523 grey|0.12523 slate|0.11446 gray|0.11446 light|0.10675 slate|0.10675 gray|0.10675 silver|0.056576 black|0.04483 light|0.028158 gray|0.028158 light|0.028158 grey|0.028158 gainsboro|0.018215 light|0.015344 steel|0.015344 blue|0.015344 dark|0.01369 slate|0.01369 gray|0.01369 light|0.0106 cyan|0.0106 alice|0.0089386 blue|0.0089386 azure|0.0058406  "
		}
	}
}
