{
	"add": {
		"doc": {
			"id": "4463495ec30821c4b53ccf1922039fd75b453753497022b61c6fc3357ddc25cb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Puerta_Este%2C_Angkor_Thom%2C_Camboya%2C_2013-08-16%2C_DD_01.JPG/150px-Puerta_Este%2C_Angkor_Thom%2C_Camboya%2C_2013-08-16%2C_DD_01.JPG",
			"previous": [],
				"after": "The outer wall, 1024 by 802 m and 4.5 m high, is surrounded by a 30 m apron of open ground and a moat 190 m wide. Access to the temple is by an earth bank to the east and a sandstone causeway to the west; the latter, the main entrance, is a later addition, possibly replacing a wooden bridge.[29] There are gopuras at each of the cardinal points; the western is by far the largest and has three ruined towers. Glaize notes that this gopura both hides and echoes the form of the temple proper.[30] Under the southern tower is a statue of Vishnu, known as Ta Reach, which may originally have occupied the temple's central shrine.[29] Galleries run between the towers and as far as two further entrances on either side of the gopura often referred to as \"elephant gates\", as they are large enough to admit those animals. These galleries have square pillars on the outer (west) side and a closed wall on the inner (east) side. The ceiling between the pillars is decorated with lotus rosettes; the west face of the wall with dancing figures; and the east face of the wall with balustered windows, dancing male figures on prancing animals, and devatas, including (south of the entrance) the only one in the temple to be showing her teeth.",
			"color": "silver|0.38733 dark|0.33646 gray|0.33646 dark|0.33646 grey|0.33646 light|0.094569 gray|0.094569 light|0.094569 grey|0.094569 tan|0.064778 dark|0.022639 khaki|0.022639 antique|0.014438 white|0.014438 olive|0.013182 drab|0.013182 gray|0.013182 grey|0.013182 dark|0.0087405 olive|0.0087405 green|0.0087405 gainsboro|0.0077853 misty|0.0075024 rose|0.0075024 dim|0.0066628 gray|0.0066628 dim|0.0066628 grey|0.0066628  "
		}
	}
}
