{
	"add": {
		"doc": {
			"id": "446dcce131da8fbccb97ac2827c1a60906ef36a2c56a47a276179bc68516687c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Outer_wall_and_keep_at_Brougham_Castle.jpg/220px-Outer_wall_and_keep_at_Brougham_Castle.jpg",
				"previous": "Brougham Castle is entered through a three-storey double-gatehouse.[58] Originally the coat of arms of Roger Clifford and his wife was carved above the entrance to the gatehouse but in the 19th century this was replaced by the current inscription, \"Thys Made Roger\", by Henry Tufton, 11th Earl of Thanet. The inscription was originally above the entrance of the great hall built by Roger Clifford, 5th Baron Clifford.[59] Erected on the slope inclining down to the river, the gatehouse was constructed in the early 14th century by Robert de Clifford, 1st Baron de Clifford. The complex has three components: the inner and outer gatehouses and a courtyard in between. The inner gatehouse survives to a height of 12.5 metres (41 ft) in the east. The ground-floor passage through the building is vaulted and there was a portcullis at the east end. A postern gate was hidden behind a buttress in the north side of the gatehouse and would have provided a discrete means of leaving the castle. The floors above the passageway each consisted of a single large room and were connected to the keep, allowing people to move between the two without having to go outside. In the 17th century Lady Anne Clifford converted the top floor into her bedroom.[60] Like the inner gatehouse, the outer section had a square plan, and the upper floors would each have been occupied by a single room. The building survives to a height of 14.5 metres (48 ft) in the east. Below the outer gatehouse was a dungeon, and at ground floor level on the north side the guardroom. The large rooms in both gatehouses would have been used as residences. Although the very top of the gatehouse no longer survives, it would have been crested by machicolations.[61]",
				"after": "Adjoined to the gatehouse is the 13th-century keep.[62] A keep contained the main domestic accommodation in a castle, usually high-status, and also provided the last place of refuge if the surrounding enclosure fell during an assault.[63] Brougham's keep has a square plan and is between 19 and 20 metres (62 and 66 ft) high, although originally would have stood taller. Access to each floor was granted by a spiral staircase in the north-east corner, with each floor consisting of a single large room. The garderobe was located in the north-west corner. It had long been assumed that the keep was built in the last quarter of the 12th century due to its simple design; the square design, use of narrow buttresses at each corner, and entrance through a forebuilding are consistent with other keeps built in the late 12th century. By the 13th century, Brougham's keep would have been old fashioned compared to the polygonal structures introduced in the 13th century.[62] However, historian Henry Summerson who assessed the historic documents for the castle concluded that construction could not have begun earlier than the first quarter of the 13th century.[8] The wooden floors no longer survive, and the use of the rooms in the keep is mostly conjectural, however it is likely that the ground floor would have served as a storage room, with the first floor being used as a hall and accommodation for the guards, and the second floor providing rooms for the lord.[64] A final fourth storey was added in early 14th century.[12] The keep would have been entered at first floor level, through the east side where it was abutted by a forebuilding. Despite the keep's importance to the castle structure, little survives of the building today.[65]",
			"color": "lavender|0.45221 light|0.3308 steel|0.3308 blue|0.3308 alice|0.074268 blue|0.074268 gainsboro|0.045882 ghost|0.031769 white|0.031769 light|0.019233 blue|0.019233 white|0.012972 smoke|0.012972 light|0.0065185 gray|0.0065185 light|0.0065185 grey|0.0065185 azure|0.0058471 dark|0.0037707 gray|0.0037707 dark|0.0037707 grey|0.0037707  "
		}
	}
}
