{
	"add": {
		"doc": {
			"id": "447499842b7231287c0c9f791f71f11c04b54e30e135f6298ac958f2fd52afa9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/PONYA_Inland_Term_1_jeh.JPG/220px-PONYA_Inland_Term_1_jeh.JPG",
				"previous": "By late 2006, Google established a new headquarters for its AdWords division in Ann Arbor, Michigan.[260] In November 2006, Google opened offices on Carnegie Mellon's campus in Pittsburgh, focusing on shopping-related advertisement coding and smartphone applications and programs.[261][262] Other office locations in the U.S. include Atlanta, Georgia; Austin, Texas; Boulder, Colorado; Cambridge, Massachusetts; San Francisco, California; Seattle, Washington; Reston, Virginia, and Washington, D.C..[citation needed] Google has several international offices.",
				"after": "In October 2006, the company announced plans to install thousands of solar panels to provide up to 1.6 megawatts of electricity, enough to satisfy approximately 30% of the campus' energy needs.[263] The system will be the largest solar power system constructed on a U.S. corporate campus and one of the largest on any corporate site in the world.[263] In addition, Google announced in 2009 that it was deploying herds of goats to keep grassland around the Googleplex short, helping to prevent the threat from seasonal bush fires while also reducing the carbon footprint of mowing the extensive grounds.[264][265] The idea of trimming lawns using goats originated from R. J. Widlar, an engineer who worked for National Semiconductor.[266] In 2008, Google faced accusations in Harper's Magazine of being an \"energy glutton\". The company was accused of employing its \"Don't be evil\" motto and its public energy-saving campaigns to cover up or make up for the massive amounts of energy its servers require.[267]",
			"color": "slate|0.12721 gray|0.12721 dark|0.12364 gray|0.12364 dark|0.12364 grey|0.12364 dim|0.11887 gray|0.11887 dim|0.11887 grey|0.11887 light|0.10733 slate|0.10733 gray|0.10733 gray|0.10249 grey|0.10249 silver|0.076939 black|0.067854 light|0.041801 gray|0.041801 light|0.041801 grey|0.041801 tan|0.038953 light|0.02915 steel|0.02915 blue|0.02915 peach|0.027782 puff|0.027782 gainsboro|0.024677 burly|0.022247 wood|0.022247 rosy|0.016324 brown|0.016324 lavender|0.0099686 navajo|0.0096723 white|0.0096723 wheat|0.0063074 bisque|0.0060438  "
		}
	}
}
