{
	"add": {
		"doc": {
			"id": "449696e3cc47bdfce6529013415696f330af329b94b7a57ac38d64b5a7335685",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Glass-half-full.jpeg/120px-Glass-half-full.jpeg",
				"previous": "Portal:Technology/Selected articles/24",
				"after": "Water fluoridation is the controlled addition of fluoride to a public water supply to reduce tooth decay. Fluoridated water has fluoride at a level that is effective for preventing cavities; this can occur naturally or by adding fluoride. Fluoridated water operates on tooth surfaces: in the mouth it creates low levels of fluoride in saliva, which reduces the rate at which tooth enamel demineralizes and increases the rate at which it remineralizes in the early stages of cavities. Typically a fluoridated compound is added to drinking water, a process that in the U.S. costs an average of about $1.02 per person-year. Defluoridation is needed when the naturally occurring fluoride level exceeds recommended limits. A 1994 World Health Organization expert committee suggested a level of fluoride from 0.5 to 1.0 mg/L (milligrams per liter), depending on climate. Dental cavities remain a major public health concern in most industrialized countries, affecting 60–90% of schoolchildren and the vast majority of adults, and costing society more to treat than any other disease. Water fluoridation prevents cavities in both children and adults, with studies estimating an 18–40% reduction in cavities when water fluoridation is used by children who already have access to toothpaste and other sources of fluoride. There is no clear evidence of adverse effects other than dental fluorosis. It is controversial, and opposition to it has been based on ethical, legal, safety, and efficacy grounds.",
			"color": "dark|0.30017 gray|0.30017 dark|0.30017 grey|0.30017 silver|0.27345 light|0.14973 gray|0.14973 light|0.14973 grey|0.14973 gainsboro|0.10357 black|0.052194 gray|0.034414 grey|0.034414 dim|0.021208 gray|0.021208 dim|0.021208 grey|0.021208 white|0.0077248 smoke|0.0077248 lavender|0.006136 alice|0.0056679 blue|0.0056679 ghost|0.005536 white|0.005536 lavender|0.0049584 blush|0.0049584 snow|0.004863 white|0.0041464 sea|0.0040179 shell|0.0040179 azure|0.0037167 mint|0.0036142 cream|0.0036142  "
		}
	}
}
