{
	"add": {
		"doc": {
			"id": "44b5661ee8af1ed1f589450f96b21390e8dd906ed0db093cfec52a2c6d98a9b1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Victoria_Day_Parade_May_20%2C_2007.jpg/220px-Victoria_Day_Parade_May_20%2C_2007.jpg",
				"previous": "Several cities hold a parade on the holiday, with the most prominent being that which has taken place since 1898 in the monarch's namesake city of Victoria, British Columbia.[30][31] In nearby New Westminster, the Victoria Day weekend is distinguished by the Hyack Anvil Battery Salute, a tradition created during colonial times as a surrogate for a 21-gun salute: Gunpowder is placed between two anvils, the top one upturned, and the charge is ignited, hurling the upper anvil into the air. Other celebrations include an evening fireworks show, such as that held at Ashbridge's Bay Beach in the east end of Toronto, and at Ontario Place, in the same city.",
				"after": "Across the country, Victoria Day serves as the unofficial marker of the end of the winter social season, and thus the beginning of the summer social calendar.[1][2][32] Banff, Alberta's Sunshine Village ends its lengthy ski season on Victoria Day and,[33] likewise, it is during this long weekend that many summer businesses—such as parks, outdoor restaurants, bicycle rentals, city tour operators, etc.—will open. Victoria Day is also a mark of the beginning of the cottage season, when cottage owners may reverse the winterization of their property.[34][35] Gardeners in Canada will similarly regard Victoria Day as the beginning of spring,[35] as it falls at a time when one can be fairly certain that frost will not return until the next autumn. There is also a change in fashion: lighter-coloured summer clothing was traditionally worn from Victoria Day through until Labour Day.[36]",
			"color": "dim|0.52908 gray|0.52908 dim|0.52908 grey|0.52908 black|0.13212 gray|0.075634 grey|0.075634 brown|0.049955 slate|0.033701 gray|0.033701 dark|0.032283 gray|0.032283 dark|0.032283 grey|0.032283 rosy|0.018851 brown|0.018851 dark|0.018426 olive|0.018426 green|0.018426 light|0.018361 slate|0.018361 gray|0.018361 dark|0.017129 slate|0.017129 gray|0.017129 firebrick|0.011443 maroon|0.0099839 silver|0.0095808  "
		}
	}
}
