{
	"add": {
		"doc": {
			"id": "44bf12ebcb9f9dc5f02934421d588d6eb294acdc7e702ad2faac287c7a36cb2a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Partial_Rrp6_structure.png/250px-Partial_Rrp6_structure.png",
				"previous": "Besides these nine core exosome proteins, two other proteins often associate with the complex in eukaryotic organisms. One of these is Rrp44, a hydrolytic RNase, which belongs to the RNase R family of hydrolytic exoribonucleases (nucleases that use water to cleave the nucleotide bonds). In addition to being an exoribonucleolytic enzyme, Rrp44 also has endoribonucleolytic activity, which resides in a separate domain of the protein.[16][17] In yeast, Rrp44 is associated with all exosome complexes and has a crucial role in the activity of the yeast exosome complex.[18] While a human homologue of the protein exists, no evidence was found for a long time that its human homologue was associated with the human exosome complex.[7] In 2010, however, it was discovered that humans have three Rrp44 homologues and two of these can be associated with the exosome complex. These two proteins most likely degrade different RNA substrates due to their different cellular localization, with one being localized in the cytoplasm (Dis3L1) and the other in the nucleus (Dis3).[19][20]",
				"after": "The second common associated protein is called Rrp6 (in yeast) or PM/Scl-100 (in human). Like Rrp44, this protein is a hydrolytic exoribonuclease, but in this case of the RNase D protein family.[21] The protein PM/Scl-100 is most commonly part of exosome complexes in the nucleus of cells, but can form part of the cytoplasmic exosome complex as well.[22]",
			"color": "red|0.39325 yellow|0.097786 dark|0.066847 red|0.066847 white|0.025715 smoke|0.025715 firebrick|0.024594 snow|0.024289 ghost|0.023787 white|0.023787 sea|0.023751 shell|0.023751 white|0.023666 alice|0.023383 blue|0.023383 mint|0.023065 cream|0.023065 floral|0.022902 white|0.022902 azure|0.021778 brown|0.020731 lavender|0.019555 blush|0.019555 indian|0.01509 red|0.01509 silver|0.012408 dark|0.011967 gray|0.011967 dark|0.011967 grey|0.011967 light|0.011262 gray|0.011262 light|0.011262 grey|0.011262 gainsboro|0.010101 pale|0.0066738 golden|0.0066738 rod|0.0066738 ivory|0.006456 maroon|0.0063946 rosy|0.0062927 brown|0.0062927 light|0.0061946 coral|0.0061946 gray|0.0051458 grey|0.0051458 khaki|0.0051157 linen|0.0048498 dark|0.0043461 khaki|0.0043461 misty|0.0042809 rose|0.0042809  "
		}
	}
}
