{
	"add": {
		"doc": {
			"id": "44bfe4388e63c3ad157fc5777365c71210af6ae22a04561707d6803f56f88385",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Trident_II_missile_cropped.jpg/220px-Trident_II_missile_cropped.jpg",
			"previous": [],
				"after": "Both the United States and the Soviet Union commissioned larger SSBNs designed for new missiles in 1981. The American large SSBN was the Ohio class, also called the \"Trident submarine\", with the largest SSBN armament ever of 24 missiles, initially Trident I but built with much larger tubes for the Trident II (D-5) missile, which entered service in 1990.[31][32] The entire class was converted to use Trident II by the early 2000s. Trident II offered a range of over 8,000 kilometres (4,300 nmi) with eight larger MIRV warheads than Trident I. When the USS Ohio (SSBN-726) commenced sea trials in 1980, two of the first ten US SSBNs had their missiles removed to comply with SALT treaty requirements; the remaining eight were converted to converted to attack submarines (SSN) by the end of 1982. These were all in the Pacific, and the Guam SSBN base was disestablished; the first several Ohio-class boats used new Trident facilities at Naval Submarine Base Bangor, Washington. Eighteen Ohio-class boats were commissioned by 1997,[33] four of which were converted as cruise missile submarines (SSGN) in the 2000s to comply with START I treaty requirements. The Soviet large SSBN was the Project 941 Akula, famous as the Typhoon-class (and not to be confused with the Project 971 Shchuka attack submarine, called \"Akula\" by NATO). The Typhoons were the largest submarines ever built at 48,000 tons submerged. They were armed with 20 of the new R-39 Rif (SS-N-20) missiles with a range of 8,300 kilometres (4,500 nmi) and 10 MIRV warheads. Six Typhoons were commissioned 1981-89.[34] A Typhoon was the subject of Tom Clancy's novel The Hunt for Red October.",
			"color": "dim|0.14815 gray|0.14815 dim|0.14815 grey|0.14815 gray|0.13403 grey|0.13403 slate|0.10764 gray|0.10764 dark|0.062114 gray|0.062114 dark|0.062114 grey|0.062114 light|0.058636 slate|0.058636 gray|0.058636 silver|0.044592 floral|0.025469 white|0.025469 sea|0.025467 shell|0.025467 light|0.024401 gray|0.024401 light|0.024401 grey|0.024401 snow|0.022027 white|0.021772 smoke|0.021772 mint|0.020699 cream|0.020699 white|0.020681 dark|0.020213 slate|0.020213 gray|0.020213 tan|0.019909 azure|0.017661 ghost|0.017365 white|0.017365 alice|0.015849 blue|0.015849 burly|0.014229 wood|0.014229 lavender|0.014101 blush|0.014101 antique|0.012879 white|0.012879 bisque|0.012573 linen|0.012477 blanched|0.012184 almond|0.012184 peach|0.012148 puff|0.012148 old|0.011937 lace|0.011937 papaya|0.011807 whip|0.011807 ivory|0.011173 wheat|0.010849 gainsboro|0.009093 corn|0.0085834 silk|0.0085834 beige|0.0080676 navajo|0.0079953 white|0.0079953 moccasin|0.0072137 rosy|0.0061688 brown|0.0061688  "
		}
	}
}
