{
	"add": {
		"doc": {
			"id": "44c2286be528e7915054413a944935ed78bf4059415009edbd2dedc0682137ef",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/%D0%9C%D0%B0%D0%BC%D0%BE%D0%BD%D1%82.jpg/220px-%D0%9C%D0%B0%D0%BC%D0%BE%D0%BD%D1%82.jpg",
				"previous": "Between 1692 and 1806, only four descriptions of frozen mammoths were published in Europe. None of the remains of those five were preserved, and no complete skeleton was recovered during that time.[105] While frozen woolly mammoth carcasses had been excavated by Europeans as early as 1728, the first fully documented specimen was discovered near the delta of the Lena River in 1799 by Ossip Schumachov, a Siberian hunter.[106] Schumachov let it thaw until he could retrieve the tusks for sale to the ivory trade. While in Yakutsk in 1806, Michael Friedrich Adams heard about the frozen mammoth. Upon arrival at the location, Adams discovered that wild animals had eaten most of the organs and flesh of the mammoth, including the trunk. He examined the carcass and realised what was left would still be the most complete mammoth recovered by that time. Adams recovered the entire skeleton, apart from the tusks, which Shumachov had already sold, and one foreleg, most of the skin, and nearly 18 kg (40 lb) of hair. During his return voyage he purchased a pair of tusks that he believed were the ones that Shumachov had sold. Adams brought it to the Zoological Museum of the Zoological Institute of the Russian Academy of Sciences, and the task of mounting the skeleton was given to Wilhelm Gottlieb Tilesius.[4] The Kunstkamera, the museum established by Peter the Great, contained the skeleton of an Indian elephant that could be used as reference.[107] This was one of the first attempts at reconstructing the skeleton of an extinct animal. Most of the reconstruction is correct, but Tilesius placed each tusk in the opposite socket, so that they curved outward instead of inward. The error was not corrected until 1899, and the correct placement of mammoth tusks was still a matter of debate into the twentieth century.[108][109]",
				"after": "The 1901 excavation of the \"Berezovka mammoth\" is the best documented of the early finds. It was discovered by the Berezovka River, and the Russian authorities financed its excavation. Its head was exposed, and the flesh had been scavenged. The animal still had grass between its teeth and on the tongue, showing that it had died suddenly. The entire expedition took 10 months, and the specimen had to be cut to pieces before it could be transported to St. Petersburg. It was identified as a 35- to 40-year-old male, which had died 35,000 years ago. One of its shoulder blades was broken, which may have happened when it fell into a crevasse.[103]",
			"color": "dim|0.3309 gray|0.3309 dim|0.3309 grey|0.3309 gray|0.30917 grey|0.30917 dark|0.1797 gray|0.1797 dark|0.1797 grey|0.1797 silver|0.062185 light|0.027181 steel|0.027181 blue|0.027181 light|0.026291 slate|0.026291 gray|0.026291 slate|0.022904 gray|0.022904 light|0.013312 gray|0.013312 light|0.013312 grey|0.013312 black|0.01227 tan|0.0074229  "
		}
	}
}
