{
	"add": {
		"doc": {
			"id": "44c61737e34f4f2b6069ef181cda5c3e2a5f235d33ffaa8d7d26f73bbc726d33",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/LindwallRunUp.jpg/220px-LindwallRunUp.jpg",
				"previous": "Lindwall returned to England in 1953, the site of his triumph five years earlier. Lindwall was to exhibit performances that were rated higher than during the Invincibles tour. Roland Perry wrote that Lindwall \"reached his zenith, producing a sustained, sensational season of brilliant, powerful and intelligent fast bowling\".[65] In the tour matches leading up to the Test, Lindwall set about gaining a psychological advantage over England's leading batsmen. In doing so, he could leave them in a poor state leading up to the Test, potentially curtailing their ability to win matches. In a match against Yorkshire, Lindwall bowled Hutton with an inswinger yorker, something he had developed the previous year. During a match against the country champions Surrey at The Oval, Lindwall came across Peter May, who was regarded as the best young English batsman to emerge from the post-war era. Lindwall's first over to May consisted of three inswingers and three outswingers, leaving him perplexed and uncertain about his position at top level cricket. Although Lindwall did not dismiss May, he regarded it as his best over at any level of cricket. The unsettled May was bowled in the following over by Ron Archer. Lindwall's performances saw him regarded as the finest fast bowler of his time.[65]",
				"after": "After Australia had been bowled out for 249 in the first innings of the First Test at Trent Bridge,[21][65] Lindwall's high paced swing yielded 5/57 and cut England down for 144. However, Australia were then bowled out for only 123, leaving England 228 for victory. They were 1/120 with Lindwall wicketless as rain curtailed the match.[21][65] In the Second Test at Lord's, England had reached 1/177 at stumps on the second day in reply to Australia's 346. The following day, Lindwall yorked rising star Tom Graveney and took 5/66 to restrict England to a lead of 26 runs. In Australia's second innings, Lindwall scored the fastest half-century in Ashes history. He took just 48 minutes to reach the mark, with two sixes and five fours.[66] The match was drawn with Lindwall taking 2/26 in the second innings.[21] Lindwall had helped to reduce England to 3/12 at stumps on the fourth day after removing Don Kenyon and Hutton with the new ball, but defiant batting on the final day saved the English.[66] The Third Test was again drawn due to heavy rain, with Lindwall failing to pass double figures in either innings and taking 2/30 in the first innings. Hassett won the toss for the fourth consecutive Test at Headingley and sent England into bat. In front of his home crowd in Yorkshire, Hutton was yorked second ball from a pacy inswinging yorker. Lindwall produced a display of fast and accurate pace bowling, taking 5/54 from 35 overs as England managed only 169.[67] After Australia took a 97 run lead, Lindwall took 3/104 to help leave the tourists with a victory target of 177. This was not before dour English all rounder Trevor Bailey attempted to stone-wall an Australian victory by batting for over four hours for 38 runs. Along with Miller, the pair took 14 wickets between them, displaying their pivotal role in Australia's bowling attack,[68] especially in the absence of the injured Johnston, who was unavailable for most of the tour.[69] Hutton ordered Bedser and Bailey to bowl leg theory from a long run, sending balls down the leg side to prevent the Australians from scoring. England held on for a draw with Australia 30 runs short when time ran out.[67][70] The teams met at The Oval for the deciding Test and Australia could manage 275 after winning the toss with Lindwall striking a quickfire 62 noted for an array of off drives to top score and push the total to respectability.[71] Lindwall then took 4/70 but it was not enough to prevent England taking a 31 run lead. Australia collapsed for 162 in the second innings, with the Surrey spin twins of Jim Laker and Tony Lock taking nine wickets between them. This left England 132 to win, something they achieved with eight wickets intact. Lindwall was unable to remove any of the Englishmen.[21][70]",
			"color": "dark|0.10467 gray|0.10467 dark|0.10467 grey|0.10467 gray|0.085419 grey|0.085419 silver|0.082133 light|0.078276 gray|0.078276 light|0.078276 grey|0.078276 gainsboro|0.074112 dim|0.073966 gray|0.073966 dim|0.073966 grey|0.073966 linen|0.058403 sea|0.051176 shell|0.051176 white|0.049608 smoke|0.049608 floral|0.045611 white|0.045611 old|0.043124 lace|0.043124 snow|0.04206 black|0.038295 lavender|0.028974 blush|0.028974 white|0.02749 misty|0.024571 rose|0.024571 mint|0.022582 cream|0.022582 ivory|0.01922 ghost|0.019085 white|0.019085 antique|0.01811 white|0.01811 azure|0.0054323 honeydew|0.0037236 alice|0.003021 blue|0.003021  "
		}
	}
}
