{
	"add": {
		"doc": {
			"id": "44cf8bb08dad5f07fc5c334bb0869638b85d70bc209ad4a21253fa6205bfb549",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Olympic_Park%2C_London%2C_16_April_2012.jpg/220px-Olympic_Park%2C_London%2C_16_April_2012.jpg",
				"previous": "By the mid-1980s, both the District line (extended to the East End in 1884 and 1902)[155] and Central line (1946)[156] were running beyond their capacity, and the Docklands Light Railway (1987) and Jubilee line (1999) were constructed to improve rail communications through the riverside district. There was a long-standing plan to provide London with an inner motorway box, the East Cross Route. Apart from a short section, this was never built,[157] but road communications were improved by the completion of the Limehouse Link tunnel under Limehouse Basin in 1993 and the extension of the A12 connecting to the Blackwall Tunnel with an upgraded carriageway in the 1990s. The extension of the East London line to the north, on the border between Islington and Hackney, provided further travel links in 2010. From 2017, Crossrail line 1 is expected to create a fast railway service across London, from east to west, with a major interchange at Whitechapel. New river crossings are planned at Beckton, (the Thames Gateway Bridge)[158] and the proposed Silvertown Link road tunnel, to supplement the existing Blackwall Tunnel.[159]",
				"after": "The 2012 Summer Olympics and Paralympics were held in an Olympic Park created on former industrial land around the River Lea. It is intended that this should leave a legacy of new sports facilities, housing, and industrial and technical infrastructure that will further help regenerate the area.[11] This is linked to a new Stratford International station in the Newham, and the future Stratford City development.[160] Also in Newham is London City Airport, built in 1986 in the former King George V Dock, a small airport serving short-haul domestic and European destinations. In the same area, the University of East London has developed a new campus which will provide the United States Olympic Team its training base during the London 2012 Olympic and Paralympic Games.[161] The Queen Mary campus has expanded into new accommodation both adjacent to its existing site at Mile End, and with specialist medical campuses at the Royal London Hospital, Whitechapel and at Charterhouse Square in the City. Whitechapel is the base for the London Air Ambulance, and the hospital's clinical facilities are undergoing a £1 billion refurbishment and expansion.[162]",
			"color": "dim|0.3176 gray|0.3176 dim|0.3176 grey|0.3176 gray|0.1874 grey|0.1874 dark|0.11773 gray|0.11773 dark|0.11773 grey|0.11773 silver|0.067125 light|0.04928 gray|0.04928 light|0.04928 grey|0.04928 gainsboro|0.037649 slate|0.036929 gray|0.036929 light|0.028982 slate|0.028982 gray|0.028982 black|0.027803 tan|0.027231 rosy|0.013681 brown|0.013681 dark|0.011303 slate|0.011303 gray|0.011303 lavender|0.0097932 white|0.0080251 smoke|0.0080251 alice|0.0075165 blue|0.0075165 ghost|0.0060639 white|0.0060639  "
		}
	}
}
