{
	"add": {
		"doc": {
			"id": "44d32d584b4693d442544f512a646f8cf26a2599cedd6110930edc3f72ff2f25",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/German_ewe_grazing_closeup.jpg/170px-German_ewe_grazing_closeup.jpg",
			"previous": [],
				"after": "Sheep are exclusively herbivorous mammals. Most breeds prefer to graze on grass and other short roughage, avoiding the taller woody parts of plants that goats readily consume.[31] Both sheep and goats use their lips and tongues to select parts of the plant that are easier to digest or higher in nutrition.[31] Sheep, however, graze well in monoculture pastures where most goats fare poorly.[31] Like all ruminants, sheep have a complex digestive system composed of four chambers, allowing them to break down cellulose from stems, leaves, and seed hulls into simpler carbohydrates. When sheep graze, vegetation is chewed into a mass called a bolus, which is then passed into the rumen, via the reticulum. The rumen is a 19- to 38-liter (5 to 10 gal) organ in which feed is fermented.[32] The fermenting organisms include bacteria, fungi, and protozoa.[33] (Other important rumen organisms include some archaea, which produce methane from carbon dioxide.[34]) The bolus is periodically regurgitated back to the mouth as cud for additional chewing and salivation.[32] Cud chewing is an adaptation allowing ruminants to graze more quickly in the morning, and then fully chew and digest feed later in the day.[35] This is safer than grazing, which requires lowering the head thus leaving the animal vulnerable to predators, while cud chewing does not.[12]",
			"color": "gray|0.28017 grey|0.28017 dark|0.25852 gray|0.25852 dark|0.25852 grey|0.25852 dim|0.18332 gray|0.18332 dim|0.18332 grey|0.18332 silver|0.10665 light|0.049967 gray|0.049967 light|0.049967 grey|0.049967 gainsboro|0.027791 thistle|0.020445 lavender|0.017255 light|0.010592 steel|0.010592 blue|0.010592 dark|0.010553 olive|0.010553 green|0.010553 light|0.0070862 slate|0.0070862 gray|0.0070862 black|0.0066776 slate|0.0064324 gray|0.0064324  "
		}
	}
}
