{
	"add": {
		"doc": {
			"id": "44d3cdbc60bf5482460fdc1817531dc0a0d09cff3228d87dc7b7968888296f4f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Allosaurus_atrox_Cleveland-Lloyd_Quarry.jpg/220px-Allosaurus_atrox_Cleveland-Lloyd_Quarry.jpg",
			"previous": [],
				"after": "Although sporadic work at what became known as the Cleveland-Lloyd Dinosaur Quarry in Emery County, Utah had taken place as early as 1927, and the fossil site itself described by William J. Stokes in 1945,[47] major operations did not begin there until 1960. Under a cooperative effort involving nearly 40 institutions, thousands of bones were recovered between 1960 and 1965.[4] The quarry is notable for the predominance of Allosaurus remains, the condition of the specimens, and the lack of scientific resolution on how it came to be. The majority of bones belong to the large theropod Allosaurus fragilis (it is estimated that the remains of at least 46 A. fragilis have been found there, out of at minimum 73 dinosaurs), and the fossils found there are disarticulated and well-mixed. Nearly a dozen scientific papers have been written on the taphonomy of the site, suggesting numerous mutually exclusive explanations for how it may have formed. Suggestions have ranged from animals getting stuck in a bog, to becoming trapped in deep mud, to falling victim to drought-induced mortality around a waterhole, to getting trapped in a spring-fed pond or seep.[48] Regardless of the actual cause, the great quantity of well-preserved Allosaurus remains has allowed this genus to be known in detail, making it among the best-known theropods. Skeletal remains from the quarry pertain to individuals of almost all ages and sizes, from less than 1 meter (3.3 feet)[49] to 12 meters (39 feet) long, and the disarticulation is an advantage for describing bones usually found fused.[4]",
			"color": "dim|0.13906 gray|0.13906 dim|0.13906 grey|0.13906 light|0.1188 gray|0.1188 light|0.1188 grey|0.1188 silver|0.1115 gainsboro|0.10062 dark|0.075216 gray|0.075216 dark|0.075216 grey|0.075216 gray|0.066311 grey|0.066311 slate|0.064705 gray|0.064705 light|0.053256 slate|0.053256 gray|0.053256 light|0.022697 steel|0.022697 blue|0.022697 white|0.017319 smoke|0.017319 peach|0.015651 puff|0.015651 dark|0.012828 slate|0.012828 gray|0.012828 linen|0.012795 antique|0.012206 white|0.012206 bisque|0.012104 rosy|0.0099565 brown|0.0099565 misty|0.0088017 rose|0.0088017 black|0.0086152 lavender|0.0085779 alice|0.008425 blue|0.008425 sea|0.008092 shell|0.008092 wheat|0.0078108 ghost|0.0071299 white|0.0071299 blanched|0.0070339 almond|0.0070339 lavender|0.0067847 blush|0.0067847 papaya|0.0059962 whip|0.0059962 snow|0.0057125  "
		}
	}
}
