{
	"add": {
		"doc": {
			"id": "44efd0d566430eb88605ef59660e8bab048364865cc8dcae34bcabe76ed0236b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Commonwealth_Park_in_Canberra.jpg/220px-Commonwealth_Park_in_Canberra.jpg",
			"previous": [],
				"after": "The surrounds of Lake Burley Griffin are very popular recreational areas, and is known locally as LBG. Public parks exist along most of the shore line, with free electric barbecue facilities, fenced-in swimming areas, picnic tables and toilets.[52] These parklands form a large part of the area around the lake, and occupy 3.139 km2 (776 acres) in total.[50] Some of the parks reserved for public recreation include Commonwealth, Weston, Kings and Grevillea Parks, Lennox Gardens and Commonwealth Place.[52] Commonwealth and Kings Park on the northern shore of the Central Basin are among the two most popular. The former is an urban horticultural park and is the location of the Canberra Festival.[14] Commonwealth Park is the location of Floriade, an annual flower festival that is held for around a month in spring and attracts upwards of 300,000 visitors,[103] a number comparable to the city population. The largest flower festival in Australia,[104] the event is a major tourist attraction for the city, and legal action was threatened after another festival in Australia wanted to use the same name.[105] An expansion is being planned to coincide with the centenary of the national capital.[106] The Weston Park to the west is known for its woodland and conifers, while Black Mountain Peninsula is known as a picnicking site with eucalypts.[14] Grevillea and Bowen Parks on the East Basin tend to be little used.[78]",
			"color": "black|0.13974 dark|0.12529 olive|0.12529 green|0.12529 dim|0.084695 gray|0.084695 dim|0.084695 grey|0.084695 dark|0.068978 gray|0.068978 dark|0.068978 grey|0.068978 gray|0.068654 grey|0.068654 silver|0.03909 light|0.037655 gray|0.037655 light|0.037655 grey|0.037655 gainsboro|0.036516 light|0.033929 steel|0.033929 blue|0.033929 light|0.033622 slate|0.033622 gray|0.033622 linen|0.027562 slate|0.023649 gray|0.023649 sea|0.022916 shell|0.022916 white|0.021255 smoke|0.021255 misty|0.018816 rose|0.018816 lavender|0.018209 blush|0.018209 floral|0.017796 white|0.017796 snow|0.017576 dark|0.016178 slate|0.016178 gray|0.016178 old|0.013786 lace|0.013786 dark|0.013352 khaki|0.013352 antique|0.011947 white|0.011947 ghost|0.011936 white|0.011936 white|0.010451 olive|0.009502 drab|0.009502 pale|0.0091545 golden|0.0091545 rod|0.0091545 tan|0.0091538  "
		}
	}
}
