{
	"add": {
		"doc": {
			"id": "44f09479e4edc9ae719c555dd392726f038641a9bc7c04672a41a235aaa5b056",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/DoubleSharp.svg/7px-DoubleSharp.svg.png",
				"previous": "Cole's manager Bennett Freed was working with Madonna's management and they were looking for new material for her album. Three of Cole's songs were chosen for reviewing, including \"Open Your Heart\". Madonna's manager Freddy DeMann overheard the song and thought it would be a hit for Madonna and he asked Cole to re-demo a female demo version. Her female backup singer, Donna De Lory was Cole's girlfriend and he immediately asked her to sing the demo.[1] Despite the fact that it did not fit exactly with the choice and genre of songs Madonna was singing at that time, she nevertheless accepted it. Madonna recorded \"Open Your Heart\", altered the lyrics thus earning a co-writing credit, and along with Patrick Leonard added a bassline underneath the song which turned it into a rock-dance track rather than the original rock 'n roll genre. The song was the first recorded cut for the True Blue album in late 1985 and ultimately made it to the final released tracklist.[1]",
				"after": "Author Susan McClary in Culture/power/history reviewed the song saying that, it was more upbeat than previous single \"Live to Tell\" and \"the play with closure in 'Open Your Heart' creates the image of open ended jouissance—an erotic energy that continually escapes containment\".[9] Author Taraborrelli called it as one of her most \"earnest\" songs and compared it with Aretha Franklin's song \"Respect\" as well as Barbra Streisand's \"A House is Not a Home\". According to him \"it was a tune people could understand and latch on to, which is what makes a pop song memorable\".[4][10] The New York Times writer Stephen Holden compared the song with sweeter post-Motown valentine songs.[11] Houston Chronicle writer Joey Guerra called the song \"perfect\" for dancefloor strut.[12] Stephen Thomas Erlewine of Allmusic called it a perfect dance song with deepened dance grooves.[13] Slant Magazine named the song as one of Madonna's most \"robust\" songs.[14] Robert Christgau said of the song, \"I'm not saying her flair is pleasureless—the generosity she demands in the inexhaustible 'Open Your Heart' is a two-way street and then some.\"[15]",
			"color": " "
		}
	}
}
