{
	"add": {
		"doc": {
			"id": "45021d9c6224bb620cb75d0fe330969e0953b5ce3786174f7d5508403ef43c8a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Old_city_walls_and_mamilla_ave._at_night_-_as_seen_from_%22Rooftop%22_restauran_-_Jerusalem%2C_Israel.jpg/150px-Old_city_walls_and_mamilla_ave._at_night_-_as_seen_from_%22Rooftop%22_restauran_-_Jerusalem%2C_Israel.jpg",
				"previous": "Higher than average percentages are employed in education (17.9% vs. 12.7%); health and welfare (12.6% vs. 10.7%); community and social services (6.4% vs. 4.7%); hotels and restaurants (6.1% vs. 4.7%); and public administration (8.2% vs. 4.7%).[342] During the British Mandate, a law was passed requiring all buildings to be constructed of Jerusalem stone in order to preserve the unique historic and aesthetic character of the city.[165] Complementing this building code, which is still in force, is the discouragement of heavy industry in Jerusalem; only about 2.2% of Jerusalem's land is zoned for \"industry and infrastructure.\" By comparison, the percentage of land in Tel Aviv zoned for industry and infrastructure is twice as high, and in Haifa, seven times as high.[260] Only 8.5% of the Jerusalem District work force is employed in the manufacturing sector, which is half the national average (15.8%).",
				"after": "Although many statistics indicate economic growth in the city, since 1967 East Jerusalem has lagged behind the development of West Jerusalem.[337] Nevertheless, the percentage of households with employed persons is higher for Arab households (76.1%) than for Jewish households (66.8%). The unemployment rate in Jerusalem (8.3%) is slightly better than the national average (9.0%), although the civilian labor force accounted for less than half of all persons fifteen years or older—lower in comparison to that of Tel Aviv (58.0%) and Haifa (52.4%).[260] Poverty remains a problem in the city as 37% of the families in Jerusalem lived in 2011 below the poverty line. According to a report by the Association for Civil Rights in Israel (ACRI), 78% of Arabs in Jerusalem lived in poverty in 2012, up from 64% in 2006. While the ACRI attributes the increase to the lack of employment opportunities, infrastructure and a worsening educational system, Ir Amim blames the legal status of Palestinians in Jerusalem.[343]",
			"color": "black|0.45038 tan|0.06804 burly|0.065245 wood|0.065245 peru|0.028043 pale|0.027934 golden|0.027934 rod|0.027934 dark|0.021805 khaki|0.021805 wheat|0.019856 navajo|0.019525 white|0.019525 sienna|0.017478 dim|0.017365 gray|0.017365 dim|0.017365 grey|0.017365 khaki|0.016916 moccasin|0.014792 rosy|0.013825 brown|0.013825 saddle|0.013544 brown|0.013544 gray|0.012139 grey|0.012139 dark|0.010659 gray|0.010659 dark|0.010659 grey|0.010659 sandy|0.010284 brown|0.010284  "
		}
	}
}
