{
	"add": {
		"doc": {
			"id": "450cd87417d0d95bb23b0e3212ffac4e94c3bef057150919c9d8286466d59d9a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Canterbury_College.jpg/200px-Canterbury_College.jpg",
				"previous": "Mountfort was born in Birmingham, an industrial town in the Midlands of England, the son of perfume manufacturer and jeweller Thomas Mountfort and his wife Susanna (née Woolfield). As a young adult he moved to London, where he was an early pupil of George Gilbert Scott (from 1841–46). He also studied architecture under the Anglo-Catholic[1] architect Richard Cromwell Carpenter, whose medieval Gothic style of design was to have a lifelong influence on Mountfort.[2] After completion of his training in 1848, Mountfort practised architecture in London. He married Emily Elizabeth Newman on 20 August 1850, and 18 days later the couple emigrated to New Zealand.[3] They were some of the first settlers to the province of Canterbury, arriving on one of the famed First Four Ships, the Charlotte-Jane on 16 December 1850.[4] These first settlers, known as \"The Pilgrims\",[5] have their names engraved on marble plaques in Cathedral Square, Christchurch, in front of the cathedral that Mountfort helped to design.[6]",
				"after": "Mountfort arrived in Canterbury full of ambition and drive to begin designing in 1850 as one of a wave of settlers encouraged to immigrate to the new colony of New Zealand by the British Government.[7][8] With him and his wife from England came also his brother Charles, his sister Susannah, and Charles' wife, all five of them aged between 21 and 26. Life in New Zealand at first was hard and disappointing: Mountfort found that there was little call for architects. Christchurch was little more than a large village of basic wooden huts on a windswept plain. The new émigré's architectural life in New Zealand had a disastrous beginning. His first commission in New Zealand was the Church of the Most Holy Trinity in Lyttelton, built in 1852 by Isaac Luck.[9][10] The building proved vulnerable to high winds and was considered unsafe. It was demolished in 1857.[9] This calamity was attributed to the use of unseasoned wood and his lack of knowledge of the local building materials. Whatever the cause, the result was a crushing blow to his reputation.[4] A local newspaper called him \"... a half-educated architect whose buildings... have given anything but satisfaction, he being evidently deficient in all knowledge of the principles of construction, though a clever draughtsman and a man of some taste.\".[2]",
			"color": "gray|0.32948 grey|0.32948 dim|0.30755 gray|0.30755 dim|0.30755 grey|0.30755 dark|0.14522 gray|0.14522 dark|0.14522 grey|0.14522 slate|0.11818 gray|0.11818 light|0.057475 slate|0.057475 gray|0.057475 silver|0.022462 light|0.004811 gray|0.004811 light|0.004811 grey|0.004811 gainsboro|0.0033556  "
		}
	}
}
