{
	"add": {
		"doc": {
			"id": "45115b9f3014b478611d1a656af909811025ea90a71c62f56ae8d5f8913eac7b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Volubilis_Decauville_track.jpg/220px-Volubilis_Decauville_track.jpg",
			"previous": [],
				"after": "Much of Volubilis was excavated by the French during their rule over French Morocco between 1912 and 1956, but the excavations at the site began decades earlier. From 1830, when the French conquest of Algeria began the process of extending French rule over much of northern, western and central Africa, archaeology was closely associated with French colonialism. The French army undertook scientific explorations as early as the 1830s and by the 1850s it was fashionable for French army officers to investigate Roman remains during their leave and spare time. By the late 19th century French archaeologists were undertaking an intensive effort to uncover north-west Africa's pre-Islamic past through excavations and restorations of archaeological sites.[22] The French had a very different conception of historic preservation to that of the Moroccan Muslims. As the historian Gwendolyn Wright puts it, \"the Islamic sense of history and architecture found the concept of setting off monuments entirely foreign\", which \"gave the French proof of the conviction that only they could fully appreciate the Moroccan past and its beauty.\" Emile Pauty of the Institut des Hautes Etudes Marocaines criticised the Muslims for taking the view that \"the passage of time is nothing\" and charged them with \"let[ting] their monuments fall into ruin with as much indifference as they once showed ardour in building them.\"[23]",
			"color": "tan|0.25806 dim|0.078139 gray|0.078139 dim|0.078139 grey|0.078139 antique|0.070867 white|0.070867 dark|0.060605 gray|0.060605 dark|0.060605 grey|0.060605 bisque|0.057168 peach|0.05633 puff|0.05633 gray|0.054239 grey|0.054239 silver|0.046905 wheat|0.041439 blanched|0.035198 almond|0.035198 light|0.03159 gray|0.03159 light|0.03159 grey|0.03159 papaya|0.028791 whip|0.028791 light|0.026413 slate|0.026413 gray|0.026413 light|0.019097 steel|0.019097 blue|0.019097 linen|0.018663 gainsboro|0.016567 old|0.013415 lace|0.013415 burly|0.012699 wood|0.012699 slate|0.0098697 gray|0.0098697 beige|0.0088453 sea|0.0079975 shell|0.0079975 corn|0.0077127 silk|0.0077127 misty|0.0076208 rose|0.0076208 floral|0.0066368 white|0.0066368  "
		}
	}
}
