{
	"add": {
		"doc": {
			"id": "45228bd69bbeef55ec01fc661c5c9f31f478891f0d8447d46625696e2c922a8d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Nishi_Honganji_Karamon_%28detail%29.jpg/220px-Nishi_Honganji_Karamon_%28detail%29.jpg",
				"previous": "In the Puranic texts of Hinduism, Narasimha (\"man-lion\") a half-lion, half-man incarnation or (avatar) of Vishnu, is worshipped by his devotees and saved the child devotee Prahlada from his father, the evil demon king Hiranyakashipu;[198] Vishnu takes the form of half-man/half-lion, in Narasimha, having a human torso and lower body, but with a lion-like face and claws.[199] Singh is an ancient Indian vedic name meaning \"lion\" (Asiatic lion), dating back over 2000 years to ancient India. It was originally only used by Rajputs a Hindu Kshatriya or military caste in India. After the birth of the Khalsa brotherhood in 1699, the Sikhs also adopted the name \"Singh\" due to the wishes of Guru Gobind Singh. Along with millions of Hindu Rajputs today, it is also used by over 20 million Sikhs worldwide.[200] Found famously on numerous flags and coats of arms all across Asia and Europe, the Asiatic lions also stand firm on the National Emblem of India.[201] Farther south on the Indian subcontinent, the Asiatic lion is symbolic for the Sinhalese,[202] Sri Lanka's ethnic majority; the term derived from the Indo-Aryan Sinhala, meaning the \"lion people\" or \"people with lion blood\", while a sword-wielding lion is the central figure on the national flag of Sri Lanka.[203]",
				"after": "The Asiatic lion is a common motif in Chinese art. They were first used in art during the late Spring and Autumn Period (fifth or sixth century BC), and became much more popular during the Han Dynasty (206 BC – AD 220), when imperial guardian lions started to be placed in front of imperial palaces for protection. Because lions have never been native to China, early depictions were somewhat unrealistic; after the introduction of Buddhist art to China in the Tang Dynasty (after the sixth century AD), lions usually were wingless, with shorter, thicker bodies, and curly manes.[204] The lion dance is a form of traditional dance in Chinese culture in which performers mimic a lion's movements in a lion costume, often with musical accompaniment from cymbals, drums, and gongs. They are performed at Chinese New Year, the August Moon Festival and other celebratory occasions for good luck.[205]",
			"color": "light|0.1866 slate|0.1866 gray|0.1866 light|0.16645 steel|0.16645 blue|0.16645 slate|0.14049 gray|0.14049 black|0.076058 dark|0.068927 gray|0.068927 dark|0.068927 grey|0.068927 gray|0.061752 grey|0.061752 rosy|0.054549 brown|0.054549 dim|0.047317 gray|0.047317 dim|0.047317 grey|0.047317 light|0.032078 blue|0.032078 burly|0.030725 wood|0.030725 tan|0.030677 silver|0.02041 lavender|0.008838 dark|0.0082024 slate|0.0082024 gray|0.0082024 powder|0.0073133 blue|0.0073133  "
		}
	}
}
