{
	"add": {
		"doc": {
			"id": "453c600b2c0c82a042d7e47429b73f71129e91afb202c7a9720a2f4ee9a19c70",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f0/Cowles_House_10_2007_BR.jpg/220px-Cowles_House_10_2007_BR.jpg",
			"previous": [],
				"after": "The college first admitted women in 1870, although at that time there were no female residence halls. The few women who enrolled either boarded with faculty families or made the arduous stagecoach trek from Lansing. From the early days, female students took the same rigorous scientific agriculture courses as male students. In 1896, the faculty created a \"Women Course\" that melded a home economics curriculum with liberal arts and sciences. That same year, the College turned the old Abbot Hall male dorm into a women's dormitory. It was not until 1899 that the State Agricultural College admitted its first African American student, William O. Thompson. After graduation, he taught at what is now Tuskegee University. President Jonathan L. Snyder invited its president Booker T. Washington to be the Class of 1900 commencement speaker. A few years later, Myrtle Craig became the first woman African-American student to enroll at the College. Along with the Class of 1907, she received her degree from U.S. President Theodore Roosevelt, commencement speaker for the Semi-Centennial celebration. The City of East Lansing was incorporated in that same year,[14] and two years later the college officially changed its name to Michigan Agricultural College (M.A.C.).",
			"color": "black|0.24778 dark|0.14403 olive|0.14403 green|0.14403 dim|0.11987 gray|0.11987 dim|0.11987 grey|0.11987 light|0.070851 slate|0.070851 gray|0.070851 dark|0.046801 slate|0.046801 gray|0.046801 slate|0.042494 gray|0.042494 gray|0.041031 grey|0.041031 dark|0.035572 gray|0.035572 dark|0.035572 grey|0.035572 olive|0.029957 drab|0.029957 silver|0.021851 steel|0.020849 blue|0.020849 light|0.018133 steel|0.018133 blue|0.018133 dark|0.015582 khaki|0.015582 light|0.012115 gray|0.012115 light|0.012115 grey|0.012115  "
		}
	}
}
