{
	"add": {
		"doc": {
			"id": "454d1c6f7ac90b8ac67b4f5eed983d774380f870860a13864665633917a0e2cd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/US_Navy_040722-N-9662L-031_USS_John_C._Stennis_%28CVN_74%29_passes_the_USS_Arizona_and_her_memorial_plaque_as_it_arrives_in_Pearl_Harbor%2C_Hawaii.jpg/250px-US_Navy_040722-N-9662L-031_USS_John_C._Stennis_%28CVN_74%29_passes_the_USS_Arizona_and_her_memorial_plaque_as_it_arrives_in_Pearl_Harbor%2C_Hawaii.jpg",
				"previous": "A 1965 film, In Harm's Way starring John Wayne, was filmed on Ford Island.[3] A fictionalized scene before the attack, with officers and their wives at a pool party, was reenacted by island residents on the anniversary of the attacks as late as 2001.[3] In 1970, the island's control tower was repainted for the filming of Tora! Tora! Tora!.[119] A Boeing B-17 Flying Fortress used in the production experienced a landing-gear malfunction and crash-landed on Ford Island, and the crash landing was included in the film.[120]",
				"after": "In April 2000, filming began on the Michael Bay film Pearl Harbor.[121] Before the filming, the cast and crew gathered on the USS Arizona memorial for a wreath-laying by a representative of Touchstone Pictures, Jerry Bruckheimer and Bay. The producers brought fifteen vintage planes to Ford Island, placing them in one hangar for the filming.[122] In addition, they brought fifteen ships back to Pearl Harbor for live bombardment (without sinking them).[122] The operations room of the control tower was converted into a barracks for the filming.[119] The Pacific Aviation Museum hoped that the film would increase public awareness of the tower and spur support for its restoration.[123] Bay reflected on the historic significance of Ford Island: \"I have a vivid memory of showing the crew around Ford Island during pre-production. We came upon a plaque directly across from the sunken Arizona, marking the spot where a torpedo hit nearly six decades ago. My crew stood in silence for three minutes at the sight of this small monument. It was a solemn moment for all of us, and I think it helped the crew appreciate the undertaking were [sic] about to begin.\"[124] During filming, a Vultee BT-13 Valiant used as a torpedo bomber crashed on the island.[120]",
			"color": "light|0.22856 steel|0.22856 blue|0.22856 dark|0.16732 gray|0.16732 dark|0.16732 grey|0.16732 steel|0.15406 blue|0.15406 gray|0.14172 grey|0.14172 silver|0.086202 dim|0.045768 gray|0.045768 dim|0.045768 grey|0.045768 light|0.04113 gray|0.04113 light|0.04113 grey|0.04113 gainsboro|0.026276 light|0.019409 slate|0.019409 gray|0.019409 black|0.017959 slate|0.012827 gray|0.012827 lavender|0.011153 misty|0.0076137 rose|0.0076137 dark|0.0069821 slate|0.0069821 gray|0.0069821 light|0.0060037 blue|0.0060037 lavender|0.0058035 blush|0.0058035  "
		}
	}
}
