{
	"add": {
		"doc": {
			"id": "456016f4f5ada740dc1218593b3f7076ff43a6ce70e997c810878942ed747759",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Cardiff_Bay_at_night.jpg/220px-Cardiff_Bay_at_night.jpg",
				"previous": "The city was proclaimed capital city of Wales on 20 December 1955, by a written reply by the Home Secretary Gwilym Lloyd George. Caernarfon had also vied for this title.[44] Cardiff therefore celebrated two important anniversaries in 2005. The Encyclopedia of Wales notes that the decision to recognise the city as the capital of Wales \"had more to do with the fact that it contained marginal Conservative constituencies than any reasoned view of what functions a Welsh capital should have\". Although the city hosted the Commonwealth Games in 1958, Cardiff only became a centre of national administration with the establishment of the Welsh Office in 1964, which later prompted the creation of various other public bodies such as the Arts Council of Wales and the Welsh Development Agency, most of which were based in Cardiff.",
				"after": "The East Moors Steelworks closed in 1978 and Cardiff lost population during the 1980s,[45] consistent with a wider pattern of counter urbanisation in Britain. However, it recovered and was one of the few cities (outside London) where population grew during the 1990s.[46] During this period the Cardiff Bay Development Corporation was promoting the redevelopment of south Cardiff; an evaluation of the regeneration of Cardiff Bay published in 2004 concluded that the project had \"reinforced the competitive position of Cardiff\" and \"contributed to a massive improvement in the quality of the built environment\", although it had failed \"to attract the major inward investors originally anticipated\".[47]",
			"color": "black|0.27207 dim|0.08184 gray|0.08184 dim|0.08184 grey|0.08184 dark|0.049421 gray|0.049421 dark|0.049421 grey|0.049421 gray|0.047556 grey|0.047556 tan|0.044276 silver|0.033607 burly|0.031853 wood|0.031853 slate|0.030015 gray|0.030015 light|0.027333 slate|0.027333 gray|0.027333 pale|0.025039 golden|0.025039 rod|0.025039 wheat|0.021361 peru|0.020196 light|0.019896 gray|0.019896 light|0.019896 grey|0.019896 light|0.017925 steel|0.017925 blue|0.017925 steel|0.017686 blue|0.017686 navajo|0.016087 white|0.016087  "
		}
	}
}
