{
	"add": {
		"doc": {
			"id": "456489e8b85a55fdb1622919d3a8060471bc09972977e0170e484f9f853ecd3e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/U_201%2C_Angarn.JPG/120px-U_201%2C_Angarn.JPG",
				"previous": "Portal:Arts/Featured article/17",
				"after": "The Greece Runestones comprise about 30 runestones containing information related to voyages made by Norsemen to \"Greece\", which referred to the Byzantine Empire. They were made during the Viking Age and until c. 1100. The stones were engraved in the Old Norse language with Scandinavian runes. All of the stones were found in modern-day Sweden, and the majority reside in Uppland (18 runestones) and Södermanland (7 runestones). Most of the stones were carved in memory of members of the Varangian Guard who never returned home, but a few stones mention men who returned with wealth. The only group of runestones that refer to expeditions abroad that are comparable in number are those that mention expeditions to England, the England Runestones. The stones vary in size from the small whetstone from Timans, to the boulder in Ed which is 18 m (59 ft) in circumference. Most of them are adorned with various runestone styles that were in use during the 11th century, and especially styles that were part of the Ringerike style (eight or nine stones) and the Urnes style (eight stones). The runestones have been continuously identified by scholars beginning with Johannes Bureus in the late 16th century, with many stones discovered during a national search for historic monuments in the late 17th century.",
			"color": "gray|0.44125 grey|0.44125 dim|0.28478 gray|0.28478 dim|0.28478 grey|0.28478 dark|0.070707 gray|0.070707 dark|0.070707 grey|0.070707 slate|0.027763 gray|0.027763 light|0.022217 slate|0.022217 gray|0.022217 alice|0.011509 blue|0.011509 azure|0.011398 white|0.011373 smoke|0.011373 mint|0.011071 cream|0.011071 ghost|0.010998 white|0.010998 white|0.010784 snow|0.010673 dark|0.010423 slate|0.010423 gray|0.010423 floral|0.0099351 white|0.0099351 sea|0.009536 shell|0.009536 silver|0.007338 lavender|0.0060717 blush|0.0060717 light|0.0044273 gray|0.0044273 light|0.0044273 grey|0.0044273 gainsboro|0.0039036 rosy|0.0036632 brown|0.0036632 black|0.003418  "
		}
	}
}
