{
	"add": {
		"doc": {
			"id": "45697735855d2b2713bd968d12afb88a184262bd42796c691cd02ba9bf5ae383",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Investigation_of_the_crash_site_of_MH-17.jpg/220px-Investigation_of_the_crash_site_of_MH-17.jpg",
				"previous": "On the day of the crash, a meeting was convened of the Trilateral Contact Group (consisting of the Organization for Security and Co-operation in Europe (OSCE), the Ukrainian national government, and Russia). After they had held a video conference with representatives of insurgents affiliated with the Donetsk People's Republic (who control the area where the aircraft crashed), the rebels promised to \"provide safe access and security guarantees\" to \"the national investigation commission\" by co-operating with Ukrainian authorities and OSCE monitors.[110] During the first two days of investigation, the militants prevented the OSCE and the workers of Ukrainian Emergencies Ministry from freely working at the crash site. Andre Purgin, a leader of the Donetsk People's Republic, declared later that \"we will guarantee the safety of international experts on the scene as soon as Kiev concludes a ceasefire agreement\".[111]",
				"after": "On 18 July, it was reported that the flight recorders had been recovered by separatists.[112] On the same day, the head of Donetsk Regional State Administration, Kostiantyn Batozky, stated that both flight recorders had been found.[113] On 21 July, Malaysian Prime Minister Najib Razak said that he had been told by Alexander Borodai, leader of the Donetsk People's Republic, that the black boxes would be handed over to Malaysian authorities.[114][115] Later that day, the flight data recorder and the cockpit voice recorder were handed over to Malaysian officials in Donetsk by rebels. The black boxes were examined at a facility operated by the UK AAIB.[116] On 23 July it was reported that the CVR was damaged but there was no evidence that it had been tampered with; it was also reported that authentic data had been downloaded.[117][118]",
			"color": "black|0.2193 dim|0.085389 gray|0.085389 dim|0.085389 grey|0.085389 gainsboro|0.055259 white|0.048914 smoke|0.048914 sea|0.044109 shell|0.044109 linen|0.043737 snow|0.04329 ghost|0.042599 white|0.042599 lavender|0.042558 blush|0.042558 alice|0.041627 blue|0.041627 white|0.037446 light|0.035962 gray|0.035962 light|0.035962 grey|0.035962 tan|0.030616 gray|0.02065 grey|0.02065 dark|0.018367 olive|0.018367 green|0.018367 azure|0.014225 mint|0.01378 cream|0.01378 dark|0.013515 gray|0.013515 dark|0.013515 grey|0.013515 silver|0.012931 burly|0.011734 wood|0.011734 dark|0.010395 salmon|0.010395 floral|0.010159 white|0.010159 lime|0.0094697 green|0.0094697  "
		}
	}
}
