{
	"add": {
		"doc": {
			"id": "456a18fee7c198660104c56548ae2c401d1f6d5702759409dfebf40498b3270f",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d3/Memorial_plaque_for_Baltimore_City_College_alumni_who_died_in_the_First_World_War.jpg/220px-Memorial_plaque_for_Baltimore_City_College_alumni_who_died_in_the_First_World_War.jpg",
				"previous": "By World War I, attendance in the school was rapidly increasing. An annex was added on 26th Street to alleviate overcrowding in the Howard Street building, but it was insufficient. Therefore, during the 1920s, alumni began campaigning to provide a proper building for the school, and in 1926, ground was broken for a massive Collegiate Gothic stone castle with a 38-acre (153,781 m²) campus, on a hill in the newly annexed northeastern suburbs at 33rd Street and The Alameda. The four-level \"Castle on the Hill\", which was surmounted by a 150 ft (46 m) tower and designed by architects Buckler and Fenhagen, cost almost $3,000,000 and accommodated 2,500 students.[45] The \"castle\" featured arched windows and cornices, cloisters, gargoyles, stained glass, mahogany paneling, plaster arches, chandeliers and terra cotta tiles and terrazzo floors with two courtyards and plans for additional wings and buildings.[46]",
				"after": "The following year, in 1927, the \"Advanced Academic Course\" (\"A\" Course) was introduced. Students in the \"A\" Course were able to enter their second year of college following their graduation.[5] This program of study and its counterpart, the college preparatory course (\"B\" Course), became the backbone of City College's academic program for over 60 years. On April 10, 1928, after nearly two years of construction, \"The Castle on the Hill\" opened its doors to the students and faculty.[47] The next year, the students published the first edition of The Collegian, City College's newspaper.[48] The publication quickly became an indispensable part of student life and gained national attention, when it won second place in a contest sponsored by the Columbia Scholastic Press Association of Columbia University. The Collegian held the first place title between 1935–1939.[49]",
			"color": "dim|0.26956 gray|0.26956 dim|0.26956 grey|0.26956 slate|0.19243 gray|0.19243 light|0.19043 slate|0.19043 gray|0.19043 gray|0.17599 grey|0.17599 dark|0.12392 gray|0.12392 dark|0.12392 grey|0.12392 dark|0.025406 slate|0.025406 gray|0.025406 silver|0.017611  "
		}
	}
}
