{
	"add": {
		"doc": {
			"id": "45840838ca62102632cd540d8065350e9fd8f8fba50daaffd10095e3845173b6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Beckham_LA_Galaxy_cropped.jpg/170px-Beckham_LA_Galaxy_cropped.jpg",
				"previous": "Beckham missed the next four LA Galaxy matches – three in the North American SuperLiga and an MLS game away at Toronto FC though he still made the trip with his teammates, sitting on the bench in street clothes. It was in Toronto on 5 August that the team got its first taste of what life would be like on the road with Beckham on the roster. Due to security concerns, it was the first time the team flew on a charter for a road match, rather than flying commercial (MLS normally forbids charter flights for away matches, claiming they provide competitive advantage, but in this case they made an exception due to the frenzy created around Beckham and resulting security issues). Also, instead of the usual MLS-mandated modest hotels, LA Galaxy stayed at the five-star Le Méridien King Edward in downtown Toronto (an expense paid for by the local Toronto promoter), while the glitz and glamour continued with the velvet rope, red carpet party at the Ultra Supper Club with Beckham as the centerpiece guest.[101]",
				"after": "Two weeks after his 12-minute appearance vs. Chelsea, still not fully healed Beckham finally made his league debut as a substitute on 9 August away versus DC United in front of the sellout crowd of 46,686 (nearly three times the average DC United home crowd) at the RFK Stadium, coming on for Quavas Kirk in the 71st minute.[102] Coming into the nationally televised match on ESPN, played under a heavy downpour with his team down a man and down a goal, even if only 70 percent fit, Beckham left a mark during the remaining twenty plus minutes. He hit a long free kick that Carlos Pavón failed to finish on for the equaliser, and then in the final minutes Beckham served a weighted through ball into Donovan's path that United's keeper Troy Perkins managed to break up in the last moment – the Galaxy lost 1–0. The next match on the road trip was at New England Revolution and Beckham decided to sit it out, fearing further aggravating his ankle injury on the Gillette Stadium's artificial surface.",
			"color": "dark|0.18852 gray|0.18852 dark|0.18852 grey|0.18852 silver|0.17056 light|0.15128 gray|0.15128 light|0.15128 grey|0.15128 gainsboro|0.11802 gray|0.07085 grey|0.07085 black|0.031451 white|0.029307 smoke|0.029307 linen|0.024207 dim|0.020816 gray|0.020816 dim|0.020816 grey|0.020816 sea|0.017188 shell|0.017188 floral|0.012633 white|0.012633 snow|0.012336 mint|0.011498 cream|0.011498 saddle|0.010484 brown|0.010484 old|0.010139 lace|0.010139 alice|0.0099378 blue|0.0099378 white|0.0085363 tan|0.0079889 ghost|0.0078881 white|0.0078881 azure|0.0068985 light|0.006676 slate|0.006676 gray|0.006676 light|0.0060397 steel|0.0060397 blue|0.0060397 ivory|0.0056518 slate|0.0054943 gray|0.0054943 sienna|0.0054539 lavender|0.0051252 antique|0.004349 white|0.004349 burly|0.0042924 wood|0.0042924 lavender|0.0041978 blush|0.0041978 beige|0.0036129  "
		}
	}
}
