{
	"add": {
		"doc": {
			"id": "4587ee8c1be3a5908811600125db31f360914b88acbf57ec573a55559465c021",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Defense.gov_News_Photo_061220-M-9019H-060.jpg/220px-Defense.gov_News_Photo_061220-M-9019H-060.jpg",
				"previous": "The amphibious assault techniques developed for World War II evolved, with the addition of air assault and maneuver warfare doctrine, into the current \"Operational Maneuver from the Sea\" doctrine of power projection from the seas.[7] The Marines are credited with the development of helicopter insertion doctrine and were the earliest in the American military to widely adopt maneuver-warfare principles which emphasize low-level initiative and flexible execution. In light of recent warfare that has strayed from the Corps' traditional missions,[30] it has renewed an emphasis on amphibious capabilities.[31]",
				"after": "The Marine Corps relies on the Navy for sealift to provide its rapid deployment capabilities. In addition to basing a third of the Fleet Marine Force in Japan, Marine Expeditionary Units (MEU) are typically stationed at sea. This allows the ability to function as first responders to international incidents. The United States Army maintains light infantry units capable of rapid worldwide deployment, but those units do not match the combined-arms integration of a MAGTF and lack the logistics that the Navy provides.[14] Therefore, the Marine Corps is often assigned to non-combat missions such as the evacuation of Americans from unstable countries and providing humanitarian relief during natural disasters. In larger conflicts, Marines act as a stopgap, to get into and hold an area until larger units can be mobilized. The Corps performed this role in World War I and the Korean War, where Marines were the first significant combat units deployed from the United States and held the line until the country could mobilize for war.[32] To aid rapid deployment, the Maritime Pre-Positioning System was developed: fleets of container ships are positioned throughout the world with enough equipment and supplies for a Marine Expeditionary Force to deploy for 30 days.",
			"color": "black|0.20051 tan|0.12597 peach|0.10965 puff|0.10965 burly|0.10806 wood|0.10806 bisque|0.075778 blanched|0.049765 almond|0.049765 wheat|0.04934 dim|0.040321 gray|0.040321 dim|0.040321 grey|0.040321 papaya|0.033528 whip|0.033528 navajo|0.03184 white|0.03184 antique|0.031535 white|0.031535 gray|0.02758 grey|0.02758 moccasin|0.026673 dark|0.011824 gray|0.011824 dark|0.011824 grey|0.011824 corn|0.010277 silk|0.010277  "
		}
	}
}
