{
	"add": {
		"doc": {
			"id": "45b5d952d2c0eed5ee38c5868514f2338275f3621f11eee1bcdfe30a5e3c81c8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Gloucester_cricketclub_1880.jpg/300px-Gloucester_cricketclub_1880.jpg",
				"previous": "It is generally understood that Gloucestershire County Cricket Club was formally constituted in 1870, having developed from Dr Henry Grace's West Gloucestershire club.[104] Gloucestershire acquired first-class status when its team played against Surrey at Durdham Down near Bristol on 2, 3 & 4 June 1870.[105] With Grace and his brothers E.M. and Fred playing, Gloucestershire won that game by 51 runs and quickly became one of the best teams in England. The club was unanimously rated Champion County in 1876 and 1877 as well as sharing the unofficial title in 1873 and staking a claim for it in 1874.[106] Surrey and Gloucestershire played a return match at The Oval in July 1870 and Gloucestershire won this by an innings and 129 runs. Grace scored 143, sharing a second wicket partnership with Frank Townsend (89) of 234.[107] The Grace family \"ran the show\" at Gloucestershire and E.M. was chosen as secretary which, as Birley points out, \"put him in charge of expenses, a source of scandal that was to surface before the end of the decade\".[36] W.G., though aged only 21, was from the start the team captain and Birley puts this down to his \"commercial drawing power\".[36]",
				"after": "In 1878, Gloucestershire made its first visit to Old Trafford Cricket Ground in July to play Lancashire and this was the match immortalised by Francis Thompson in his idyllic poem At Lord's.[108] In a match against Surrey at Clifton, the ball lodged in Grace's shirt after he had played it and he seized the opportunity to complete several runs before the fielders forced him to stop. He disingenuously claimed that he would have been out handled the ball if he had removed it and, following a discussion, it was agreed that three runs should be awarded.[109]",
			"color": "lavender|0.57942 thistle|0.25509 ghost|0.030692 white|0.030692 lavender|0.024287 blush|0.024287 alice|0.017219 blue|0.017219 dark|0.012496 gray|0.012496 dark|0.012496 grey|0.012496 silver|0.011663 light|0.011655 gray|0.011655 light|0.011655 grey|0.011655 gainsboro|0.01096 white|0.0078783 smoke|0.0078783 gray|0.0065928 grey|0.0065928 snow|0.0062633 light|0.0047865 steel|0.0047865 blue|0.0047865 black|0.0046861 white|0.0046111 dim|0.0044636 gray|0.0044636 dim|0.0044636 grey|0.0044636  "
		}
	}
}
