{
	"add": {
		"doc": {
			"id": "45be4fb385f83a582686fc7d3c70637042cd269d55eb39dff9375b0cc0f237cc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Aeroflot_Cargo_McDonnell_Douglas_MD-11_cockpit.jpg/220px-Aeroflot_Cargo_McDonnell_Douglas_MD-11_cockpit.jpg",
				"previous": "Assembly of the first MD-11 began on March 9, 1988, and the mating of the fuselage with wings occurred in October that year. The first flight was originally planned to occur in March 1989, but numerous problems with the manufacturing, delays with suppliers producing essential components and labor industrial actions delayed the ceremonial roll out of the prototype until September of that year. The following months were used to prepare the prototype for its maiden flight, which finally happened on January 10, 1990. The first two aircraft manufactured were intended for FedEx and thus, were already fitted with the forward side cargo door. They remained with the manufacturer as test aircraft until 1991 before being completely converted to freighters and delivered to their customer. FAA certification was achieved on November 8, 1990 while the European Joint Aviation Authorities (JAA) certified the MD-11 on October 17, 1991 after approximately 200 separate issues were resolved.[2]",
				"after": "Yugoslav Airlines, already flying several DC-10s, became the first customer of the MD-11. Three aircraft were manufactured but were never delivered due to war in Yugoslavia. The first MD-11 was delivered to Finnair on December 7, 1990 and it accomplished the first revenue service by an MD-11 on December 20, 1990, carrying passengers from Helsinki to Tenerife in the Canary Islands. MD-11 service in the U.S. was inaugurated by Delta Air Lines, also in 1990. It was during this period that flaws in the MD-11's performance became apparent. It failed to meet its targets for range and fuel burn.[4] American Airlines in particular was unimpressed, as was Singapore Airlines, who canceled their order for 20 aircraft. American Airlines cited problems with the performance of the airframe and the Pratt & Whitney PW4000 engines as reasons for the cancellation while the Singapore Airlines stated that the MD-11 could not operate on the airline's long haul routes.[5] Pre-flight estimates indicated that the P&W-powered MD-11 was to have a 7,000 nautical miles (13,000 km) range with 61,000 pounds (28,000 kg) of payload. With the Phase 1 drag reduction in place then, the aircraft could only achieve its full range with 48,500 pounds (22,000 kg) of payload, or a reduced range of 6,493 nautical miles (12,025 km) with a full payload.[6]",
			"color": "black|0.30158 slate|0.1516 gray|0.1516 light|0.13916 slate|0.13916 gray|0.13916 dim|0.12761 gray|0.12761 dim|0.12761 grey|0.12761 gray|0.1007 grey|0.1007 dark|0.075789 gray|0.075789 dark|0.075789 grey|0.075789 silver|0.043469 light|0.028002 gray|0.028002 light|0.028002 grey|0.028002 gainsboro|0.014529 light|0.0061408 steel|0.0061408 blue|0.0061408  "
		}
	}
}
