{
	"add": {
		"doc": {
			"id": "45eb4b4424700b5ea4389b0c2a4285e1a3fefc738c6d8b169871ea55c9589b9d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Montreal-WTC-Square_Victoria_Door.png/170px-Montreal-WTC-Square_Victoria_Door.png",
				"previous": "The headquarters of the Canadian Space Agency is in Longueuil, southeast of Montreal.[111] Montreal also hosts the headquarters of the International Civil Aviation Organization (ICAO, a United Nations body);[112] the World Anti-Doping Agency (an Olympic body);[113] the Airports Council International (the association of the world's airports – ACI World);[114] the International Air Transport Association (IATA),[115] IATA Operational Safety Audit and the International Gay and Lesbian Chamber of Commerce (IGLCC),[116] as well as some other international organizations in various fields.",
				"after": "Montreal is a centre of film and television production. The headquarters of Alliance Films and five studios of the Academy Award-winning documentary producer National Film Board of Canada are in the city, as well as the head offices of Telefilm Canada, the national feature-length film and television funding agency and Télévision de Radio-Canada. Given its eclectic architecture and broad availability of film services and crew members, Montreal is a popular filming location for feature-length films, and sometimes stands in for European locations.[117][118] The city is also home to many recognized cultural, film and music festivals (Just For Laughs, Just For Laughs Gags, Montreal International Jazz Festival, Montreal World Film Festival, and others), which contribute significantly to its economy. It is also home to one of the world's largest cultural enterprises, the Cirque du Soleil.[119]",
			"color": "dark|0.189 gray|0.189 dark|0.189 grey|0.189 dim|0.18548 gray|0.18548 dim|0.18548 grey|0.18548 black|0.1407 silver|0.099103 gray|0.096966 grey|0.096966 light|0.03321 gray|0.03321 light|0.03321 grey|0.03321 dark|0.031271 slate|0.031271 gray|0.031271 gainsboro|0.021122 white|0.021083 smoke|0.021083 sea|0.01914 shell|0.01914 snow|0.018588 ghost|0.018335 white|0.018335 alice|0.01762 blue|0.01762 white|0.01753 floral|0.017141 white|0.017141 mint|0.016574 cream|0.016574 lavender|0.01513 blush|0.01513 azure|0.013769 linen|0.0086488 slate|0.0072007 gray|0.0072007 light|0.0046194 slate|0.0046194 gray|0.0046194  "
		}
	}
}
