{
	"add": {
		"doc": {
			"id": "4612c30f700ed44cc573a228d5903f60101639677db597f13affe957bdb50466",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Barraband_Fregilupus.jpg/170px-Barraband_Fregilupus.jpg",
				"previous": "The hoopoe starling was 30 cm (12 in) in length. The bird's culmen was 41 mm (1.6 in) long, its wing 147 mm (5.8 in), its tail 114 mm (4.5 in), and its tarsus about 39 mm (1.5 in) long.[20] It was the largest of the three Mascarene starlings. A presumed adult male (NHMUK 1889.5.30.15) in the Paris museum has a light ash-grey head and back of the neck (lighter on the hind-neck), with a long crest the same colour with white shafts. Its back and tail are ash-brown, its wings darker with a greyish wash, and its uppertail covert feathers and rump have a rufous wash. Its primary coverts are white with brown tips, although the bases (instead of the tips) are brown in other specimens. The superciliary stripe, lore, and most of the specimen's underside is white, with a pale rufous wash on the flanks and undertail coverts. The extent of light rufous on the underside varies by specimen. The beak and legs are lemon-yellow, with yellow-brown claws. It has a bare, triangular area of skin around the eye, which may have been yellow in life. Though the species' iris was described as bluish-brown, it has been depicted as brown, yellow or orange.[21]",
				"after": "There has been confusion about which characteristics that were sexually dimorphic in the species. Only three specimens were sexed (all males), with age and individual variation not considered. The male is thought to have been largest with a longer, curvier beak. In 1911, Réunion resident Eugène Jacob de Cordemoy recalled his observations of the bird about 50 years before, suggesting that only males had a white crest, but this is thought to be incorrect. A presumed female (MNHN 2000-756) in the Paris museum appears to have a smaller crest, a smaller and less-curved beak, and smaller primary coverts. A juvenile specimen has a smaller crest and primary coverts, with a brown wash instead of ash grey on the crest, lore, and superciliary stripe, and a light-brown (instead of ash-brown) back. The juveniles of some southeast Asian starlings are also browner than adults.[4]",
			"color": "dark|0.26321 gray|0.26321 dark|0.26321 grey|0.26321 gray|0.24062 grey|0.24062 dim|0.18805 gray|0.18805 dim|0.18805 grey|0.18805 silver|0.13004 light|0.052246 gray|0.052246 light|0.052246 grey|0.052246 black|0.027583 gainsboro|0.024269 tan|0.017513 burly|0.013901 wood|0.013901 peru|0.0084282 rosy|0.0074431 brown|0.0074431  "
		}
	}
}
