{
	"add": {
		"doc": {
			"id": "4631ae027e04c3465f166a90a3130ed489ba524ffdefca81a2080e5494970779",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Fotothek_df_ps_0002470_Innenr%C3%A4ume_%5E_Ausstellungsgeb%C3%A4ude.jpg/220px-Fotothek_df_ps_0002470_Innenr%C3%A4ume_%5E_Ausstellungsgeb%C3%A4ude.jpg",
			"previous": [],
				"after": "After the death of Ashurbanipal in 627 BC, the Assyrian Empire began to disintegrate, riven by internal strife. Ashur-etil-ilani co-ruled with Ashurbanipal from 630 BC, while an Assyrian governor named Kandalanu sat on the throne of Babylon on behalf of his king. Babylonia seemed secure until both Ashurbanipal and Kandalanu died in 627 BC, and Assyria spiralled into a series of internal civil wars which would ultimately lead to its destruction.. An Assyrian general, Sin-shumu-lishir, revolted in 626 BC and declared himself king of Assyria and Babylon, but was promptly ousted by the Assyrian Army loyal to king Ashur-etil-ilani in 625 BC. Babylon was then taken by another son of Ashurbanipal Sin-shar-ishkun, who proclaimed himself king. His rule did not last long however, and the native Babylonians revolted with the help of the migrant Chaldean tribe (Bit Kaldu), led by the previously unknown Nabopolassar, who had made himself king of Chaldea in the far south east of Mesopotamia. Nabopolassar seized the throne amid the confusion, and the Neo-Babylonian dynasty was born. Babylonia as a whole then became a battle ground between king Ashur-etil-ilani and his brother Sin-shar-ishkun who fought to and fro over the region. This anarchic situation allowed Nabopolassar to stay on the throne of the city of Babylon itself, spending the next three years undisturbed, consolidating his position in the city.[2]",
			"color": "gainsboro|0.12531 light|0.10948 gray|0.10948 light|0.10948 grey|0.10948 linen|0.089109 black|0.073976 white|0.070512 smoke|0.070512 sea|0.069609 shell|0.069609 snow|0.056299 antique|0.048676 white|0.048676 lavender|0.04765 blush|0.04765 ghost|0.043973 white|0.043973 floral|0.043805 white|0.043805 old|0.039125 lace|0.039125 white|0.037674 alice|0.036082 blue|0.036082 silver|0.027269 mint|0.02576 cream|0.02576 beige|0.0093631 azure|0.0085949 ivory|0.0060609 misty|0.005716 rose|0.005716 dark|0.0052211 gray|0.0052211 dark|0.0052211 grey|0.0052211  "
		}
	}
}
