{
	"add": {
		"doc": {
			"id": "46387f62980a510338bb631e3593c340e7d891247dccc2bb1ec4587461a95e69",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Falero_Luis_Ricardo_Lily_Fairy_1888.jpg/180px-Falero_Luis_Ricardo_Lily_Fairy_1888.jpg",
				"previous": "When considered as beings that a person might actually encounter, fairies were noted for their mischief and malice. Some pranks ascribed to them, such as tangling the hair of sleepers into \"Elf-locks\", stealing small items or leading a traveler astray, are generally harmless. But far more dangerous behaviors were also attributed to fairies. Any form of sudden death might stem from a fairy kidnapping, with the apparent corpse being a wooden stand-in with the appearance of the kidnapped person.[8] Consumption (tuberculosis) was sometimes blamed on the fairies forcing young men and women to dance at revels every night, causing them to waste away from lack of rest.[44] Fairies riding domestic animals, such as cows or pigs or ducks, could cause paralysis or mysterious illnesses.",
				"after": "As a consequence, practical considerations of fairies have normally been advice on averting them. In terms of protective charms, cold iron is the most familiar, but other things are regarded as detrimental to the fairies: wearing clothing inside out, running water, bells (especially church bells), St. John's wort, and four-leaf clovers, among others. Some lore is contradictory, such as rowan trees in some tales being sacred to the fairies, and in other tales being protection against them. In Newfoundland folklore, the most popular type of fairy protection is bread, varying from stale bread to hard tack or a slice of fresh home-made bread. The belief that bread has some sort of special power is an ancient one. Bread is associated with the home and the hearth, as well as with industry and the taming of nature, and as such, seems to be disliked by some types of fairies. On the other hand, in much of the Celtic folklore, baked goods are a traditional offering to the folk, as are cream and butter.[35]",
			"color": "gray|0.27934 grey|0.27934 dark|0.2137 gray|0.2137 dark|0.2137 grey|0.2137 dim|0.18093 gray|0.18093 dim|0.18093 grey|0.18093 silver|0.06848 light|0.048243 slate|0.048243 gray|0.048243 slate|0.038375 gray|0.038375 light|0.02551 gray|0.02551 light|0.02551 grey|0.02551 tan|0.017188 gainsboro|0.016183 misty|0.01364 rose|0.01364 light|0.009621 steel|0.009621 blue|0.009621 antique|0.0092355 white|0.0092355 linen|0.0079891 peach|0.0063911 puff|0.0063911  "
		}
	}
}
