{
	"add": {
		"doc": {
			"id": "463e11ccc83c894f8e194956cf8c211dc5af241b4812d5054e21496b73a6ed07",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Dal%C3%AD.Rinoceronte.JPG/220px-Dal%C3%AD.Rinoceronte.JPG",
			"previous": [],
				"after": "The pre-eminent position of Dürer's image and its derivatives declined from the mid-to-late-18th century, when more live rhinoceroses were transported to Europe, shown to the curious public, and depicted in more accurate representations. Jean-Baptiste Oudry painted a life-size portrait of Clara the rhinoceros in 1749, and George Stubbs painted a large portrait of a rhinoceros in London around 1790. Both of these paintings were more accurate than Dürer's woodcut, and a more realistic conception of the rhinoceros gradually started to displace Dürer's image in the public imagination. In particular, Oudry's painting was the inspiration for a plate in Buffon's encyclopedic Histoire naturelle, which was widely copied.[39] In 1790, James Bruce's travelogue Travels to discover the source of the Nile dismissed Dürer's work as \"wonderfully ill-executed in all its parts\" and \"the origin of all the monstrous forms under which that animal has been painted, ever since\". Even so, Bruce's own illustration of the African white rhinoceros, which is noticeably different in appearance to the Indian rhinoceros, still shares conspicuous inaccuracies with Dürer's work.[40] Semiotician Umberto Eco argues that Dürer's \"scales and imbricated plates\" became a necessary element of depicting the animal, even to those who might know better, because \"they knew that only these conventionalized graphic signs could denote «rhinoceros» to the person interpreting the iconic sign.\" He also notes that the skin of a rhinoceros is rougher than it visually appears and that such plates and scales portray this non-visual information to a degree.[41]",
			"color": "black|0.33159 dark|0.1815 slate|0.1815 gray|0.1815 dim|0.13123 gray|0.13123 dim|0.13123 grey|0.13123 gray|0.08078 grey|0.08078 cadet|0.060244 blue|0.060244 dark|0.033623 gray|0.033623 dark|0.033623 grey|0.033623 light|0.027003 gray|0.027003 light|0.027003 grey|0.027003 silver|0.024977 gainsboro|0.02317 powder|0.019278 blue|0.019278 linen|0.01176  "
		}
	}
}
