{
	"add": {
		"doc": {
			"id": "46440ec43138d836d4dffc1fe10d6cc32c35974f74b22b68dba8802f99c9bff1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Aeroflot_A321-200_VP-BWN_SVO_2008-9-15.png/220px-Aeroflot_A321-200_VP-BWN_SVO_2008-9-15.png",
				"previous": "In the early 1990s, the Soviet Union underwent massive political upheavals, culminating in the dissolution of the country. Countries declared their independence during January 1990 – December 1991, resulting in the establishment of 15 republics. Up until that time, Aeroflot had been the only establishment providing air services throughout the CIS, but with the breakup of the Soviet Union, Aeroflot branches of these countries began their own services, and the airline itself came under control of Russia, the largest of the CIS republics, and was renamed Aeroflot – Russian International Airlines (ARIA).[13][14][15] Actually, it was in 1992 that Aeroflot was divided into a number of regional airlines,[16] whereas international routes were operated by ARIA.[15] Smaller regional airlines which emerged from the old Aeroflot were sometimes referred to as Babyflots;[13]:2 Bashkirian Airlines, Krasnoyarsk Airlines, Moscow Airways and Tatarstan Airlines were among the carriers that were formed from former Aeroflot directorates.[17]",
				"after": "In 1994, Aeroflot was registered as a joint-stock company and the government sold off 49% of its stake to Aeroflot employees. During the 1990s, Aeroflot was primarily focused on international flights from Moscow. However, by the end of the decade Aeroflot started an expansion in the domestic market. In 2000 the company name was changed to Aeroflot – Russian Airlines to reflect the change in the company strategy.[18]",
			"color": "dark|0.37745 olive|0.37745 green|0.37745 gray|0.21298 grey|0.21298 dim|0.12339 gray|0.12339 dim|0.12339 grey|0.12339 dark|0.10808 gray|0.10808 dark|0.10808 grey|0.10808 silver|0.031097 black|0.021304 light|0.019799 gray|0.019799 light|0.019799 grey|0.019799 dark|0.017581 slate|0.017581 gray|0.017581 firebrick|0.017001 slate|0.014486 gray|0.014486  "
		}
	}
}
