{
	"add": {
		"doc": {
			"id": "4652f0090548a59dfa6f9e4f24ef6e47f19cd6ee533a8bb37180a455df3cc288",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Ascocarp2.png/220px-Ascocarp2.png",
				"previous": "Members of the Glomeromycota form arbuscular mycorrhizae, a form of symbiosis wherein fungal hyphae invade plant root cells and both species benefit from the resulting increased supply of nutrients. All known Glomeromycota species reproduce asexually.[79] The symbiotic association between the Glomeromycota and plants is ancient, with evidence dating to 400 million years ago.[129] Formerly part of the Zygomycota (commonly known as 'sugar' and 'pin' molds), the Glomeromycota were elevated to phylum status in 2001 and now replace the older phylum Zygomycota.[130] Fungi that were placed in the Zygomycota are now being reassigned to the Glomeromycota, or the subphyla incertae sedis Mucoromycotina, Kickxellomycotina, the Zoopagomycotina and the Entomophthoromycotina.[42] Some well-known examples of fungi formerly in the Zygomycota include black bread mold (Rhizopus stolonifer), and Pilobolus species, capable of ejecting spores several meters through the air.[131] Medically relevant genera include Mucor, Rhizomucor, and Rhizopus.",
				"after": "The Ascomycota, commonly known as sac fungi or ascomycetes, constitute the largest taxonomic group within the Eumycota.[41] These fungi form meiotic spores called ascospores, which are enclosed in a special sac-like structure called an ascus. This phylum includes morels, a few mushrooms and truffles, unicellular yeasts (e.g., of the genera Saccharomyces, Kluyveromyces, Pichia, and Candida), and many filamentous fungi living as saprotrophs, parasites, and mutualistic symbionts. Prominent and important genera of filamentous ascomycetes include Aspergillus, Penicillium, Fusarium, and Claviceps. Many ascomycete species have only been observed undergoing asexual reproduction (called anamorphic species), but analysis of molecular data has often been able to identify their closest teleomorphs in the Ascomycota.[132] Because the products of meiosis are retained within the sac-like ascus, ascomycetes have been used for elucidating principles of genetics and heredity (e.g., Neurospora crassa).[133]",
			"color": "silver|0.091679 light|0.089059 gray|0.089059 light|0.089059 grey|0.089059 gainsboro|0.07458 white|0.070283 smoke|0.070283 ghost|0.061553 white|0.061553 alice|0.06133 blue|0.06133 snow|0.060492 sea|0.06045 shell|0.06045 lavender|0.058698 blush|0.058698 white|0.058052 mint|0.054771 cream|0.054771 floral|0.051992 white|0.051992 dark|0.051003 gray|0.051003 dark|0.051003 grey|0.051003 azure|0.04957 light|0.018358 steel|0.018358 blue|0.018358 rosy|0.016555 brown|0.016555 gray|0.016473 grey|0.016473 linen|0.014836 dim|0.01202 gray|0.01202 dim|0.01202 grey|0.01202 misty|0.010511 rose|0.010511 lavender|0.0063164 ivory|0.0036697  "
		}
	}
}
