{
	"add": {
		"doc": {
			"id": "465ec6ce419e6ead3e276236d865cbbcece1f6e7371ea2a60eada284a3b2044f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/B-17G_Nose_in_Detail.jpg/170px-B-17G_Nose_in_Detail.jpg",
				"previous": "The YB-40 was a heavily armed modification of the standard B-17 used before the North American P-51 Mustang, an effective long-range fighter, became available to act as escort. Additional armament included an additional dorsal turret in the radio room, a remotely operated and fired Bendix A-10 \"chin turret\" and twin .50 in (12.7 mm) guns in each of the waist positions. The ammunition load was over 11,000 rounds. All of these modifications made the YB-40 well over 10,000 lb (4,500 kg) heavier than a fully loaded B-17F. The YB-40s with their numerous heavy modifications had trouble keeping up with the lighter bombers once they had dropped their bombs, and so the project was abandoned and finally phased out in July 1943,[61][62][63] The YB-40 contributed to the inclusion of modified A-10 chin turrets in Vega B-17F from the United modification center during June and July 1943 in advance of the August production Douglas installation of the new Bendix A-16 remotely operated \"chin turret\" for a much-improved forward defensive weapons.",
				"after": "By the time the definitive B-17G appeared, the number of guns had been increased from seven to thirteen, the designs of the gun stations were finalized, and other adjustments were completed. The B-17G was the final version of the Flying Fortress, incorporating all changes made to its predecessor, the B-17F,[57] adopting the remotely operated \"chin turret\" for forward defense from the YB-40 \"gunship\" version, and in total 8,680 were built,[64] the last one (by Lockheed) on 28 July 1945.[65] Many B-17Gs were converted for other missions such as cargo hauling, engine testing and reconnaissance.[66] Initially designated SB-17G, a number of B-17Gs were also converted for search-and-rescue duties, later to be redesignated B-17H.[67]",
			"color": " "
		}
	}
}
