{
	"add": {
		"doc": {
			"id": "46641d46a1cc6f9bc2ff8ba36f4e4d1b0dc6095d1a2b8f1d9cdc4d1fd3ffec21",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/A_Overhead_view_of_Gangtok_from_the_ropeway_facility.JPG/220px-A_Overhead_view_of_Gangtok_from_the_ropeway_facility.JPG",
				"previous": "Gangtok is within the Sikkim Lok Sabha constituency that elects a member to the Lok Sabha (Lower House) of the Indian Parliament. The city elects one member in the Sikkim state legislative assembly, the Vidhan Sabha. The Sikkim Democratic Front (SDF) won both the parliamentary election in 2009 and the state assembly seat in the 2009 state assembly polls.[30][31]",
				"after": "Electricity is supplied by the power department of the Government of Sikkim. Gangtok has a nearly uninterrupted electricity supply due to Sikkim's numerous hydroelectric power stations. The rural roads around Gangtok are maintained by the Border Roads Organisation, a division of the Indian army. Several roads in Gangtok are reported to be in a poor condition,[11] whereas building construction activities continue almost unrestrained in this city lacking proper land infrastructure.[11] Most households are supplied by the central water system maintained and operated by the PHED.[11] The main source of PHED water supply is the Rateychu River, located about 16 km (9.9 mi) from the city, at an altitude of 2,621 m (8,599 ft). Its water treatment plant is located at Selep. The river Rateychu is snow-fed and has perennial streams. Since there is no habitation in the catchment area except for a small army settlement, there is little environmental degradation and the water is of very good quality.[11] 40 seasonal local springs are used by the Rural Management and Development Department of Sikkim Government to supply water to outlying rural areas.",
			"color": "dim|0.28803 gray|0.28803 dim|0.28803 grey|0.28803 gray|0.24675 grey|0.24675 dark|0.14125 gray|0.14125 dark|0.14125 grey|0.14125 silver|0.063852 slate|0.049153 gray|0.049153 light|0.045151 slate|0.045151 gray|0.045151 light|0.042459 gray|0.042459 light|0.042459 grey|0.042459 gainsboro|0.032859 dark|0.020501 olive|0.020501 green|0.020501 dark|0.013675 slate|0.013675 gray|0.013675 linen|0.0065077 black|0.0060206 white|0.0056693 smoke|0.0056693  "
		}
	}
}
