{
	"add": {
		"doc": {
			"id": "4679680b7d3daf8e1b1dff1cf42674b477fceb9f2316ccd5e4f846965f61cd14",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/ClevelandBay.jpg/220px-ClevelandBay.jpg",
			"previous": [],
				"after": "The earliest breeding of the ancestors of the Cleveland Bay was done in large part by English churches and monasteries, to meet a need for pack horses to carry trade goods between abbeys and monasteries in northeast England.[2] These medieval horses gained the nickname of \"Chapman Horses\" because of their use by travelling merchants known as \"chapmen\".[6] What is now the Cleveland Bay was developed from Barb and Andalusian horses crossed with Chapman Horse mares. The Barb blood came mainly from horses imported by wealthy young men on their Grand Tour of Europe, bought off the docks in Marseilles and transported back to England.[14] The Andalusian blood came from horses bred at the royal stud in Cordoba and given to English royalty by the King of Spain. The stallions were often available for breeding to local horses, and the first infusion of Andalusian blood was added to the native Chapman Horses. The Spanish horses also made their way to the outlying estates of English nobility, and were then taken by Oliver Cromwell's men after the English Civil War. Once in the hands of Cromwell's men, many of the stallions were made available for locals to cross with the existing Chapman Horses, adding a second infusion of Andalusian bloodlines. In the late 17th century a second infusion of Barb blood was added when Cleveland breeders purchased horses directly from soldiers at Tangier or from the Moors themselves.[15]",
			"color": "dim|0.18499 gray|0.18499 dim|0.18499 grey|0.18499 dark|0.13852 gray|0.13852 dark|0.13852 grey|0.13852 gray|0.13457 grey|0.13457 silver|0.090825 light|0.070518 gray|0.070518 light|0.070518 grey|0.070518 gainsboro|0.059932 white|0.038398 smoke|0.038398 alice|0.033071 blue|0.033071 ghost|0.032268 white|0.032268 snow|0.03014 sea|0.029081 shell|0.029081 lavender|0.02854 blush|0.02854 white|0.027758 mint|0.02505 cream|0.02505 azure|0.023779 floral|0.020556 white|0.020556 slate|0.016711 gray|0.016711 linen|0.008765  "
		}
	}
}
