{
	"add": {
		"doc": {
			"id": "467d4ebdfaca920c4cb72ddb940f88b90bda3e8da7b30106ab90f3d210ca7a00",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Ailanthus_altissima_%28female%29.jpg/250px-Ailanthus_altissima_%28female%29.jpg",
				"previous": "Ailanthus has been used to re-vegetate areas where acid mine drainage has occurred and it has been shown to tolerate pH levels as low as 4.1 (approximately that of tomato juice). It can withstand very low phosphorus levels and high salinity levels. The drought-tolerance of the tree is strong due to its ability to effectively store water in its root system.[18] It is frequently found in areas where few trees can survive. The roots are also aggressive enough to cause damage to subterranean sewers and pipes.[5] Along highways it often forms dense thickets in which few other tree species are present, largely due to the toxins it produces to prevent competition.[18]",
				"after": "Ailanthus produces an allelopathic chemical called ailanthone, which inhibits the growth of other plants.[34] The inhibitors are strongest in the bark and roots, but are also present in the leaves, wood and seeds of the plant. One study showed that a crude extract of the root bark inhibited 50% of a sample of garden cress (Lepidium sativum) seeds from germinating. The same study tested the extract as an herbicide on garden cress, redroot pigweed (Amaranthus retroflexus), velvetleaf (Abutilon theophrasti), yellow bristlegrass (Setaria pumila), barnyard grass (Echinochloa crusgalli), pea (Pisum sativum cv. Sugar Snap) and maize (Zea mays cv. Silver Queen). It proved able to kill nearly 100% of seedlings with the exception of velvetleaf, which showed some resistance.[35] Another experiment showed a water extract of the chemical was either lethal or highly damaging to 11 North American hardwoods and 34 conifers, with the white ash (Fraxinus americana) being the only plant not adversely affected.[36] The chemical does not, however, affect the tree of heaven's own seedlings, indicating that A. altissima has a defence mechanism to prevent autotoxicity.[34] Resistance in various plant species has been shown to increase with exposure. Populations without prior exposure to the chemicals are most susceptible to them. Seeds produced from exposed plants have also been shown to be more resistant than their unexposed counterparts.[37]",
			"color": "black|0.4287 dim|0.10307 gray|0.10307 dim|0.10307 grey|0.10307 gray|0.082999 grey|0.082999 dark|0.072438 gray|0.072438 dark|0.072438 grey|0.072438 dark|0.064421 olive|0.064421 green|0.064421 dark|0.050602 slate|0.050602 gray|0.050602 silver|0.039893 light|0.026796 gray|0.026796 light|0.026796 grey|0.026796 gainsboro|0.020208  "
		}
	}
}
