{
	"add": {
		"doc": {
			"id": "468052d52798f9ef1e946c6ac7eb107d0e5bbf37f1912624b56f405aeb536c51",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Floristic_regions_in_Europe_%28english%29.png/300px-Floristic_regions_in_Europe_%28english%29.png",
				"previous": "Probably 80 to 90 percent of Europe was once covered by forest.[170] It stretched from the Mediterranean Sea to the Arctic Ocean. Though over half of Europe's original forests disappeared through the centuries of deforestation, Europe still has over one quarter of its land area as forest, such as the taiga of Scandinavia and Russia, mixed rainforests of the Caucasus and the Cork oak forests in the western Mediterranean. During recent times, deforestation has been slowed and many trees have been planted. However, in many cases monoculture plantations of conifers have replaced the original mixed natural forest, because these grow quicker. The plantations now cover vast areas of land, but offer poorer habitats for many European forest dwelling species which require a mixture of tree species and diverse forest structure. The amount of natural forest in Western Europe is just 2–3% or less, in European Russia 5–10%. The country with the smallest percentage of forested area is Iceland (1%), while the most forested country is Finland (77%).[171]",
				"after": "In temperate Europe, mixed forest with both broadleaf and coniferous trees dominate. The most important species in central and western Europe are beech and oak. In the north, the taiga is a mixed spruce–pine–birch forest; further north within Russia and extreme northern Scandinavia, the taiga gives way to tundra as the Arctic is approached. In the Mediterranean, many olive trees have been planted, which are very well adapted to its arid climate; Mediterranean Cypress is also widely planted in southern Europe. The semi-arid Mediterranean region hosts much scrub forest. A narrow east-west tongue of Eurasian grassland (the steppe) extends eastwards from Ukraine and southern Russia and ends in Hungary and traverses into taiga to the north.",
			"color": "light|0.16342 gray|0.16342 light|0.16342 grey|0.16342 silver|0.15999 gainsboro|0.13356 dark|0.074363 gray|0.074363 dark|0.074363 grey|0.074363 red|0.039936 white|0.036611 smoke|0.036611 thistle|0.027198 light|0.022493 green|0.022493 alice|0.022257 blue|0.022257 lavender|0.019895 blush|0.019895 ghost|0.0197 white|0.0197 lime|0.019509 spring|0.019394 green|0.019394 linen|0.017602 snow|0.016931 light|0.016889 coral|0.016889 sea|0.015435 shell|0.015435 medium|0.014574 spring|0.014574 green|0.014574 white|0.013281 mint|0.012986 cream|0.012986 lavender|0.01291 azure|0.010843 rosy|0.0098692 brown|0.0098692 dark|0.0092954 sea|0.0092954 green|0.0092954 indian|0.0083965 red|0.0083965 lime|0.0078035 green|0.0078035 misty|0.0070941 rose|0.0070941 floral|0.0068408 white|0.0068408 light|0.0060248 pink|0.0060248 light|0.0055129 cyan|0.0055129 pink|0.005451 salmon|0.0052406 honeydew|0.0052099 turquoise|0.0034045  "
		}
	}
}
