{
	"add": {
		"doc": {
			"id": "46837ff9d7ba16975fcc332cbf48ab00fec29c3e83e7a7ebc5aefb9a1d199aee",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Mycena_aurantiomarginata_9900.jpg/220px-Mycena_aurantiomarginata_9900.jpg",
				"previous": "Gills are adnate with a decurrent tooth (where the gills curve up to join the stipe but then, close to the stipe, the margin turns down again), and initially narrow but broaden when old. They are pallid to grayish-olive with bright orange edges.[13] Smith noted that the edge color may spread to the gill faces in some specimens, because the pigment, rather than being encrusted on the walls of the cystidia, is found in the cytosol and therefore more readily diffusible.[16] The gills are spaced close together, with between 16 and 26 gills reaching the stipe,[14] and there are up to three tiers of interspersed lamellulae (short gills that do not extend fully from the cap edge to the stipe).[15] The cylindrical stipe is 3–6 cm (1.2–2.4 in) long by 0.1–0.2 cm (0.04–0.08 in) thick, hollow, and stiff but flexible;[13] it is somewhat thicker at the base.[17] It has a brownish to grayish-olive color that is sometimes tinged with shades of orange. The surface is smooth except for orange powder near the top, while the base is covered with stiff orange hairs. Smith reports the mushroom tissue to have no distinctive taste or odor,[13] while Aronsen says the odor is \"very conspicuous; sweet, fruity, often experienced as farinaceous or faintly of anise\".[14] Like many small Mycena species, the edibility of the mushroom is unknown, as it is too insubstantial to consider collecting for the table.[16]",
				"after": "The spores are elliptic, smooth, and amyloid, with dimensions of 7–9 by 4–5 μm.[13] The basidia (spore-bearing cells of the hymenium) are club-shaped, four-spored, and measure 25–32 by 5.5–7 μm.[14] Pleurocystidia and cheilocystidia (cystidia on the gill faces and edges, respectively) are abundant and similar in morphology: club-shaped to somewhat capitate (with a head),[13] the tops sparsely to densely covered with small spines (said to resemble a mace[18]), filled with a bright orange pigment, and measuring 28–36 by 7–12 μm. The flesh of the cap is covered with a cuticle, on the surface of which are found scattered cystidia similar to those on the gills. Directly beneath the cuticle is a layer of enlarged cells, and beneath this are filamentous hyphae.[13] Clamp connections are present in the hyphae.[14]",
			"color": "dim|0.28736 gray|0.28736 dim|0.28736 grey|0.28736 gray|0.1638 grey|0.1638 slate|0.14485 gray|0.14485 light|0.096613 slate|0.096613 gray|0.096613 dark|0.055003 gray|0.055003 dark|0.055003 grey|0.055003 dark|0.040961 slate|0.040961 gray|0.040961 dark|0.026875 khaki|0.026875 dark|0.014907 golden|0.014907 rod|0.014907  "
		}
	}
}
