{
	"add": {
		"doc": {
			"id": "468451f42dfb154a9fc2091f2e13a5ad9c02eb0c52ee7898f7a4c0429bbd99ed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Vojislav_%C5%A0e%C5%A1elj.jpg",
				"previous": "Chetnik units engaged in mass murders and war crimes.[142] In 1991, the Croatian town of Erdut was forcefully taken over by the SDG and JNA[171] and annexed to the puppet state of Republic of Serbian Krajina. Croats and other non-Serbs were either expelled or killed with Serbs repopulating empty villages in the area.[172] On 1 April 1992, the SDG attacked Bijeljina and carried out a massacre of Muslim civilians.[173] On 4 April, Chetnik irregulars helped the JNA in shelling Sarajevo. On 6 April, Chetniks and the JNA attacked Bijeljina, Foča, Bratunac, and Višegrad. On 9 April, the SDG and Šešelj's Chetniks aided the JNA and special units of the Serbian security force in overtaking Zvornik and ridding it of its local Muslim population.[174] Reports sent by Ražnatović to Milošević, Ratko Mladić, and Blagoje Adžić stated the plan was progressing, noting that the psychological attack on the Bosniak population in Bosnia and Herzegovina was effective and should continue.[175] Chetnik forces also engaged in mass murder in Vukovar and Srebrenica.[142] The White Eagles were responsible for atrocities and massacres in Voćin, Višegrad, Foča, Gacko, Sjeverin, and Štrpci,[163] and for terrorizing the Muslim population in Sandžak.[176] In September 1992, Chetniks attempted to force Sandžak Muslims in Pljevlja to flee by demolishing their stores and houses whilst shouting \"Turks leave\" and \"this is Serbia\". By mid-1993, they suffered over a hundred bombings, kidnappings, expulsions, and shootings. The SPO threatened Muslims with expulsion when reacting to requests for autonomy in Sandžak.[177] On 15 May 1993, Šešelj proclaimed 18 Chetnik fighters as vojvodas, naming towns that were cleansed of non-Serbs in their citation, and they were blessed by an Orthodox priest afterwards.[178] Šešelj came to be described as \"a man whose killer commando units operating in Croatia and Bosnia carried on the very worst of the Chetnik tradition.\"[139]",
				"after": "Later the SRS became a government coalition partner of Milosević and in 1998, Đujić publicly stated that he regretted awarding that title to Šešelj. He was quoted as saying, \"I was naïve when I nominated Šešelj [as] Vojvoda; I ask my people to forgive me. The greatest gravedigger of Serbdom is Slobodan Milošević\"[138] and that he is \"disappointed in Šešelj for openly collaborating with Milošević's Socialist Party, with Communists who have only changed their name. ... Šešelj has sullied the reputation of Chetniks and Serbian nationalism.\"[179] In 2000, Ražnatović was killed before facing prosecution by the International Criminal Tribunal for the former Yugoslavia (ICTY).[180] In 2003, Šešelj surrendered himself to the ICTY to face war crimes charges.[181] Nikolić, who Šešelj had in 1993 proclaimed vojvoda[182] and awarded the Order of Chetnik Knights for his subordinates' \"personal courage in defending the fatherland\",[183] took over the SRS.[181] He vowed to pursue a Greater Serbia \"through peaceful means\".[184] In 2005, it was alleged Nikolić was present during the massacre of Croatian civilians in Antin.[183] The Ministry of Interior of Croatia stated Croatian police had no reports of Nikolić participating.[185] In 2008, Lukić was sentenced to life imprisonment for crimes against humanity and war crimes.[186]",
			"color": "dark|0.63043 khaki|0.63043 black|0.064386 lavender|0.058389 tan|0.049867 burly|0.042601 wood|0.042601 thistle|0.022828 pale|0.012892 golden|0.012892 rod|0.012892  "
		}
	}
}
