{
	"add": {
		"doc": {
			"id": "468fdfa2a09f7a2591b405df0f5ba88825d19c5272ce0dca358bae0a32cedafa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/U_73%2C_H%C3%A4gerstalund.jpg/220px-U_73%2C_H%C3%A4gerstalund.jpg",
			"previous": [],
				"after": "Runestone U 73 (location) was probably erected to explain the order of inheritance from two men who died as Varangians.[30] It is in the style Pr3[31] which is part of the more general Urnes style. The stone, which is of greyish granite measuring 2 m (6 ft 7 in) in height and 1.2 m (3 ft 11 in) in width,[32] is raised on a slope some 100 m (330 ft) north of Hägerstalund farm, formerly Hansta(lund). The stone was discovered by Johan Peringskiöld during the national search for historic monuments in the late 17th century. The stone shares the same message as U 72, together with which it once formed a monument,[32] but U 72 was moved to Skansen in 1896.[33] The latter stone relates that \"these stones\" were raised by Gerðarr and Jörundr in memory of Ernmundr and Ingimundr. Consequently, U 73's phrase \"Inga's sons\" and \"they died in Greece\" refer to Ernmundr and Ingimundr.[32] Ernmundr and Ingimundr had inherited from their father, but they departed for the Byzantine Empire and died there as Varangians. As they had not fathered any children, their mother Inga inherited their property, and when she died, her brothers Gerðarr and Jörundr inherited from her. These two brothers then raised the two memorials in honour of their nephews, which was probably due to the nephews having distinguished themselves in the South. However, it may have also been in gratitude for wealth gathered by the nephews overseas. At the same time, the monument served to document how the property had passed from one clan to another.[32][34] Sawyer (2000), on the other hand, suggests that because the two inscriptions do not mention who commissioned them, the only eventual claimant to the fortune, and the one that had the stones made, may have been the church.[35] The runemaster has been identified as Visäte.[31]",
			"color": "dim|0.28494 gray|0.28494 dim|0.28494 grey|0.28494 gray|0.25003 grey|0.25003 dark|0.23314 slate|0.23314 gray|0.23314 dark|0.087751 gray|0.087751 dark|0.087751 grey|0.087751 silver|0.040388 slate|0.022929 gray|0.022929 light|0.018292 gray|0.018292 light|0.018292 grey|0.018292 light|0.014395 slate|0.014395 gray|0.014395 gainsboro|0.012065  "
		}
	}
}
