{
	"add": {
		"doc": {
			"id": "469595511cc52fcf2417abcfed60bddb4a11bf01be061703ea00ca62cc9be2da",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Israel_painted_frog.JPG/220px-Israel_painted_frog.JPG",
				"previous": "Dramatic declines in amphibian populations, including population crashes and mass localized extinction, have been noted since the late 1980s from locations all over the world, and amphibian declines are thus perceived to be one of the most critical threats to global biodiversity.[134] In 2004, the International Union for Conservation of Nature (IUCN) reported stating that currently birds,[135] mammals, and amphibians extinction rates were at maximum 48 times greater than natural extinction rates—possibly 1,024 times higher. In 2006 there were believed to be 4,035 species of amphibians that depended on water at some stage during their life cycle. Of these, 1,356 (33.6%) were considered to be threatened and this figure is likely to be an underestimate because it excludes 1,427 species for which there was insufficient data to assess their status.[136] A number of causes are believed to be involved, including habitat destruction and modification, over-exploitation, pollution, introduced species, climate change, endocrine-disrupting pollutants, destruction of the ozone layer (ultraviolet radiation has shown to be especially damaging to the skin, eyes, and eggs of amphibians), and diseases like chytridiomycosis. However, many of the causes of amphibian declines are still poorly understood, and are a topic of ongoing discussion.[137]",
				"after": "With their complex reproductive needs and permeable skins, amphibians are often considered to be ecological indicators.[138] In many terrestrial ecosystems, they constitute one of the largest parts of the vertebrate biomass. Any decline in amphibian numbers will have an impact on the patterns of predation. The loss of carnivorous species near the top of the food chain will upset the delicate ecosystem balance and may cause dramatic increases in opportunistic species. In the Middle East, a growing appetite for eating frog legs and the consequent gathering of them for food was linked to an increase in mosquitoes.[139] Predators that feed on amphibians are affected by their decline. The western terrestrial garter snake (Thamnophis elegans) in California is largely aquatic and depends heavily on two species of frog that are diminishing in numbers, the Yosemite toad (Bufo canorus) and the mountain yellow-legged frog (Rana muscosa), putting the snake's future at risk. If the snake were to become scarce, this would affect birds of prey and other predators that feed on it.[140] Meanwhile, in the ponds and lakes, fewer frogs means fewer tadpoles. These normally play an important role in controlling the growth of algae and also forage on detritus that accumulates as sediment on the bottom. A reduction in the number of tadpoles may lead to an overgrowth of algae, resulting in depletion of oxygen in the water when the algae later die and decompose. Aquatic invertebrates and fish might then die and there would be unpredictable ecological consequences.[141]",
			"color": "khaki|0.39496 black|0.2482 dark|0.080381 golden|0.080381 rod|0.080381 pale|0.044532 golden|0.044532 rod|0.044532 dark|0.021666 khaki|0.021666 dark|0.018245 gray|0.018245 dark|0.018245 grey|0.018245 golden|0.017656 rod|0.017656 silver|0.013791 gray|0.013706 grey|0.013706  "
		}
	}
}
