{
	"add": {
		"doc": {
			"id": "46dc2a170096979140d0dca6fe490a229cc57089cbb3f632d3028b1d37fc5c1f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Miller_V.jpg/170px-Miller_V.jpg",
				"previous": "Despite the scare over his back complaint, Miller returned from New Zealand to play in the 1946 season, which turned out to be his last season in the VFL; St Kilda's finished second-last.[214] Miller played with more aggression than during his pre-war years and his high leaping marks were a noted feature of a season that saw him chosen to represent Victoria against South Australia.[215] Miller thus became one of the few players to play at the highest levels of both cricket and Australian rules football.[215]",
				"after": "Miller was discharged from the RAAF on 26 June 1946,[215] and returned to his job at Vacuum Oil. Miller resented the fact that many of his colleagues had avoided the hazards of war and moved steadily up the ladder and regarded his job as demeaning.[216][217] Under such circumstances, Miller contemplated quitting Australian cricket and accepting a professional contract with Rawtenstall in the Lancashire League, valued at £1,000 per year,[218] for three seasons. With advertising and commercial commitments likely to triple this figure, playing in England would have been approximately ten times more lucrative than continuing in Australia.[216] However, Miller was worried that his impulsive style would be curtailed by the pressures of professionalism. At that time, the Board of Control's policy stipulated that any player that signed with a professional league in England could not represent Australia.[219] Miller's contract would see him in England until he was 30, effectively ending his career for Australia. Furthermore, it would have prevented him from playing Australian football during the winter.[220] Miller weighed it up and opted to sign the contract that tied him to Rawtenstall, with his duties to start with the onset of the English season in April 1947.[221]",
			"color": "dim|0.27041 gray|0.27041 dim|0.27041 grey|0.27041 slate|0.21661 gray|0.21661 light|0.18551 slate|0.18551 gray|0.18551 gray|0.16265 grey|0.16265 dark|0.15806 slate|0.15806 gray|0.15806 dark|0.0067689 gray|0.0067689 dark|0.0067689 grey|0.0067689  "
		}
	}
}
