{
	"add": {
		"doc": {
			"id": "46de8e46adeaa16b973985014e2ce08a853cc354054506e27368176c7eff50bd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Bristol_Old_Vic_%28750px%29.jpg/220px-Bristol_Old_Vic_%28750px%29.jpg",
			"previous": [],
				"after": "The city's principal theatre company, the Bristol Old Vic, was founded in 1946 as an offshoot of the Old Vic company in London. Its premises on King Street consist of the 1766 Theatre Royal (400 seats), a modern studio theatre (150 seats), and foyer and bar areas in the adjacent Coopers' Hall (built 1743). The Theatre Royal is a grade I listed building and was the oldest continuously operating theatre in England. The Bristol Hippodrome is a larger theatre (1981 seats) which hosts national touring productions, whilst other theatres include the Tobacco Factory (250 seats), The Brewery (90 seats), Bierkeller Theatre (400 seats), QEH (220 seats), the Redgrave Theatre (at Clifton College) (320 seats) and the Alma Tavern (50 seats). Arnolfini stage a regular programme of experimental, physical and live art theatre and the University of Bristol Drama Department has a regular programme of visiting companies and in-house work at the Wickham Theatre.[10] Other venues which have hosted theatre productions include Hope Chapel (Hotwells) (formerly the Hope Centre), the Hen and Chicken pub (Bedminster) and PACTS (Easton).",
			"color": "dim|0.29089 gray|0.29089 dim|0.29089 grey|0.29089 gray|0.2096 grey|0.2096 dark|0.14531 gray|0.14531 dark|0.14531 grey|0.14531 silver|0.055934 light|0.032583 gray|0.032583 light|0.032583 grey|0.032583 black|0.030838 antique|0.025499 white|0.025499 gainsboro|0.023213 beige|0.01685 slate|0.014118 gray|0.014118 linen|0.013694 old|0.013035 lace|0.013035 papaya|0.013033 whip|0.013033 corn|0.010598 silk|0.010598 light|0.0093671 slate|0.0093671 gray|0.0093671 blanched|0.0092692 almond|0.0092692 floral|0.0084429 white|0.0084429 ivory|0.0079898 sea|0.0075735 shell|0.0075735 light|0.0065362 yellow|0.0065362 dark|0.006501 slate|0.006501 gray|0.006501 white|0.0057793 smoke|0.0057793 light|0.004343 golden|0.004343 rod|0.004343 yellow|0.004343 honeydew|0.0042156  "
		}
	}
}
