{
	"add": {
		"doc": {
			"id": "46e636696beee9a184b182ecea78666a095f9f52436b6df39c00b744c0cdc88b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Off_to_Ohio.png/220px-Off_to_Ohio.png",
				"previous": "Recognizing McKinley’s potential, the Democrats, whenever they controlled the Ohio legislature, sought to gerrymander or redistrict him out of office.[63] In 1878, McKinley faced election in a redrawn 17th district; he won anyway, causing Hayes to exult, “Oh, the good luck of McKinley! He was gerrymandered out and then beat the gerrymander! We enjoyed it as much as he did.”[64] After the 1882 election, McKinley was unseated on an election contest by a near party-line House vote.[65] Out of office, he was briefly depressed by the setback, but soon vowed to run again. The Democrats again redistricted Stark County for the 1884 election; McKinley was returned to Congress anyway.[66]",
				"after": "For 1890, the Democrats gerrymandered McKinley one final time, placing Stark County in the same district as one of the strongest pro-Democrat counties, Holmes, populated by solidly Democratic Pennsylvania Dutch. The new boundaries seemed good, based on past results, for a Democratic majority of 2000 to 3000. The Republicans could not reverse the gerrymander as legislative elections would not be held until 1891, but they could throw all their energies into the district, as the McKinley Tariff was a main theme of the Democratic campaign nationwide, and there was considerable attention paid to McKinley’s race. The Republican Party sent its leading orators to Canton, including Blaine (then Secretary of State), Speaker Reed and President Harrison. The Democrats countered with their best spokesmen on tariff issues.[67] McKinley tirelessly stumped his new district, reaching out to its 40,000 voters to explain that his tariff",
			"color": "dim|0.16302 gray|0.16302 dim|0.16302 grey|0.16302 gray|0.15334 grey|0.15334 dark|0.089089 gray|0.089089 dark|0.089089 grey|0.089089 silver|0.046773 light|0.036743 gray|0.036743 light|0.036743 grey|0.036743 black|0.034583 gainsboro|0.034446 peach|0.028578 puff|0.028578 sea|0.026717 shell|0.026717 white|0.02585 smoke|0.02585 linen|0.025212 antique|0.024199 white|0.024199 snow|0.022243 slate|0.022167 gray|0.022167 floral|0.020594 white|0.020594 ghost|0.01919 white|0.01919 light|0.018739 slate|0.018739 gray|0.018739 white|0.018523 misty|0.018165 rose|0.018165 lavender|0.018088 blush|0.018088 alice|0.017682 blue|0.017682 tan|0.017403 mint|0.016785 cream|0.016785 bisque|0.015518 azure|0.011461 rosy|0.010571 brown|0.010571 old|0.009992 lace|0.009992 thistle|0.0095029 papaya|0.0074293 whip|0.0074293 blanched|0.0072714 almond|0.0072714 burly|0.0054211 wood|0.0054211 dark|0.0048311 slate|0.0048311 gray|0.0048311  "
		}
	}
}
