{
	"add": {
		"doc": {
			"id": "46ff142578bc07cd33694a4a69eb52c0e99ef8b2f71fa2da3f4a9efea160c722",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f6/Hilda_Rix_Nicholas_painting_%22The_Summer_House%22.jpg/220px-Hilda_Rix_Nicholas_painting_%22The_Summer_House%22.jpg",
				"previous": "Rix Nicholas had met the farming family, the Wrights, in the early 1920s, including Ned, the subject of In Australia. After returning to the district, she married Edgar Wright on 2 June 1928 in Melbourne, and the couple settled on a property called Knockalong, near Delegate.[102] She continued to exhibit under the name Rix Nicholas, though she was also known as Rix Wright. Her friend Dorothy Richmond, with whom she had visited the region at the start of the decade, married Edgar Wright's cousin, Walter, and settled in the same region.[103] Then, in 1930, Rix Nicholas and her husband had their only child, a son, whom they named Rix.[103][notes 7]",
				"after": "While Australian artists embraced modernism and addressed the city, Rix Nicholas focussed on representing a pastoral ideal. In France in the 1920s, Rix Nicholas had entertained Roy de Maistre, one of the first Australians to experiment with abstractionism, and enthusiastically asked him to share more about his 'colour-music theory';[83] however when modernism confronted Australian art in the 1920s and 1930s, Rix Nicholas sided against it.[104] There was in any case, as art historian Jeanette Hoorn wryly observed, \"no market for post-impressionist painting in outback New South Wales in the 1920s\".[105] Rix Nicholas sought to build on her existing success and often focussed on portraits,[105] while her approach to her subject matter became \"more and more didactic\".[106] Women were frequently portrayed, both as rural workers (as in The Fair Musterer) and in domestic or family scenes (as in On The Hilltop). Several images, such as On the Hilltop and Spring Afternoon, Knockalong portray women caring for a young son in a rural setting. Her most \"stereotypically feminine\"[107] work was The Summer House, which shows two of Rix Nicholas's friends with some freshly cut flowers, in a setting that, unlike most of her works of the period, screened out the surrounding landscape. It was a picture about which Rix Nicholas was never convinced and which she never publicly displayed.[107] Yet it has become one of her best known works, its easy acceptance consistent with the way reviewers in the 1930s pigeon-holed her work in terms of conventional gender roles.[108]",
			"color": "dark|0.32019 gray|0.32019 dark|0.32019 grey|0.32019 silver|0.14791 gray|0.11926 grey|0.11926 slate|0.11395 gray|0.11395 light|0.10323 slate|0.10323 gray|0.10323 dim|0.060569 gray|0.060569 dim|0.060569 grey|0.060569 light|0.048395 gray|0.048395 light|0.048395 grey|0.048395 rosy|0.041722 brown|0.041722 gainsboro|0.02048 peru|0.0039607 dark|0.00373 slate|0.00373 gray|0.00373  "
		}
	}
}
