{
	"add": {
		"doc": {
			"id": "47081e8ec81d4cb332e5fc955c4ef842ab01f8fdda444c8afe7fd87938c29efb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Allison_1710-115_V12_Aircraft_engine.jpg/220px-Allison_1710-115_V12_Aircraft_engine.jpg",
				"previous": "The very first V-1710 was purchased by the U.S. Navy as their GV-1710-2, and appears to have had an Allison serial of number 1, suggesting that they restarted numbering for the V-1710. The first V-1710 engine purchased by the USAAC was AAC 33-42, Allison Serial No. 2, the XV-1710-1, while Serial Nos. 3, 4, 5 were V-1710-4 engines for U.S. Navy airships, followed by a batch of 11 Air Corps engines purchased with FY-1934 funds (34-4 through 34-14) that covered Allison serials 6 through 16. After these the production race was on, totaling over 70,000 V-1710s.[2]",
				"after": "By this time the Army had become more interested in the design, and asked Allison to continue with a new \"C\" model. They had few funds of their own to invest, and Allison supported much of the development out of their own pocket. The V-1710-C first flew on 14 December 1936 in the Consolidated A-11A testbed. The V-1710-C6 successfully completed the Army 150 hour Type Test on 23 April 1937, at 1,000 hp (750 kW), the first engine of any type to do so. By then all of the other Army engine projects had been cancelled or withdrawn, leaving the V-1710 as the only modern design available. It was soon found as the primary power plant of the new generation of United States Army Air Corps (USAAC) fighters, the P-38 Lightning, P-39 Airacobra and P-40 Warhawk.",
			"color": "dim|0.2199 gray|0.2199 dim|0.2199 grey|0.2199 gray|0.18094 grey|0.18094 black|0.15414 dark|0.12957 gray|0.12957 dark|0.12957 grey|0.12957 slate|0.055919 gray|0.055919 silver|0.054621 light|0.053264 slate|0.053264 gray|0.053264 dark|0.034266 slate|0.034266 gray|0.034266 light|0.027541 gray|0.027541 light|0.027541 grey|0.027541 gainsboro|0.019935 light|0.00751 steel|0.00751 blue|0.00751 white|0.0071255 smoke|0.0071255 snow|0.0051413 ghost|0.0050024 white|0.0050024  "
		}
	}
}
