{
	"add": {
		"doc": {
			"id": "472056db26a699bd7eb1d921bbb459119fed39f61db397a19e40f7b47c1222f5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Newton-letter-to-briggs_03.jpg/220px-Newton-letter-to-briggs_03.jpg",
				"previous": "From this work, he concluded that the lens of any refracting telescope would suffer from the dispersion of light into colours (chromatic aberration). As a proof of the concept, he constructed a telescope using a mirror as the objective to bypass that problem.[45][46] Building the design, the first known functional reflecting telescope, today known as a Newtonian telescope,[46] involved solving the problem of a suitable mirror material and shaping technique. Newton ground his own mirrors out of a custom composition of highly reflective speculum metal, using Newton's rings to judge the quality of the optics for his telescopes. In late 1668[47] he was able to produce this first reflecting telescope. In 1671, the Royal Society asked for a demonstration of his reflecting telescope.[48] Their interest encouraged him to publish his notes, Of Colours,[49] which he later expanded into the work Opticks. When Robert Hooke criticised some of Newton's ideas, Newton was so offended that he withdrew from public debate. Newton and Hooke had brief exchanges in 1679–80, when Hooke, appointed to manage the Royal Society's correspondence, opened up a correspondence intended to elicit contributions from Newton to Royal Society transactions,[50] which had the effect of stimulating Newton to work out a proof that the elliptical form of planetary orbits would result from a centripetal force inversely proportional to the square of the radius vector (see Newton's law of universal gravitation – History and De motu corporum in gyrum). But the two men remained generally on poor terms until Hooke's death.[51]",
				"after": "Newton argued that light is composed of particles or corpuscles, which were refracted by accelerating into a denser medium. He verged on soundlike waves to explain the repeated pattern of reflection and transmission by thin films (Opticks Bk.II, Props. 12), but still retained his theory of 'fits' that disposed corpuscles to be reflected or transmitted (Props.13). However, later physicists favoured a purely wavelike explanation of light to account for the interference patterns and the general phenomenon of diffraction. Today's quantum mechanics, photons, and the idea of wave–particle duality bear only a minor resemblance to Newton's understanding of light.",
			"color": "wheat|0.1813 moccasin|0.17881 navajo|0.15797 white|0.15797 pale|0.13623 golden|0.13623 rod|0.13623 lemon|0.11543 chiffon|0.11543 light|0.085894 golden|0.085894 rod|0.085894 yellow|0.085894 tan|0.058625 burly|0.051697 wood|0.051697 light|0.014064 yellow|0.014064 corn|0.0045465 silk|0.0045465  "
		}
	}
}
