{
	"add": {
		"doc": {
			"id": "473560aff15d234ce0b401a034af4c1574d92e965ed5b555286f793794b0aca7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Redwood-NP_Map.png/220px-Redwood-NP_Map.png",
				"previous": "The United Nations designated Redwood National and State Parks a World Heritage Site on September 5, 1980. The evaluation committee noted 50 prehistoric archaeological sites, spanning 4,500 years. It also cited ongoing research in the park by Humboldt State University researchers, among others.[17] The park is part of a much larger region designated the California Coast Ranges International Biosphere Reserve on June 30, 1983.[18] The California Coast Ranges biosphere is overseen by the University of California Natural Reserve System.",
			"after": [
				"Redwood National Park headquarters is located in Crescent City, California, with a service office located in Arcata and an operations center located in Orick, California.",
				"Lack of money has precluded major improvements, however, and timber companies have replanted much of the logged area with non-native tree species. Coastline areas, including dunes and coastal prairie, have been invaded by exotic species, partly due to the suppression of forest fires until the 1980s. A fire management plan now allows controlled burning as one method to return the parkland to its original state. Since the redwoods were logged on the basis of accessibility, with inaccessible areas being cut last, large old-growth forest sections were isolated from one another, sometimes by many miles. In these cases it will be decades more before mature forest can return, regardless of the amount of money used to rehabilitate the ecosystem.[19]"
			],
			"color": "honeydew|0.10228 mint|0.091647 cream|0.091647 ivory|0.076657 white|0.073635 smoke|0.073635 floral|0.071979 white|0.071979 old|0.06634 lace|0.06634 sea|0.064742 shell|0.064742 azure|0.063475 white|0.062059 linen|0.060591 snow|0.051726 light|0.04274 cyan|0.04274 beige|0.030671 alice|0.017327 blue|0.017327 light|0.015724 gray|0.015724 light|0.015724 grey|0.015724 gainsboro|0.013853 silver|0.012267 pale|0.01121 turquoise|0.01121 corn|0.010787 silk|0.010787 powder|0.010656 blue|0.010656 light|0.010459 yellow|0.010459 dark|0.0068863 gray|0.0068863 dark|0.0068863 grey|0.0068863 light|0.0059439 golden|0.0059439 rod|0.0059439 yellow|0.0059439 gray|0.0044839 grey|0.0044839 ghost|0.0035307 white|0.0035307 dark|0.0034542 sea|0.0034542 green|0.0034542  "
		}
	}
}
