{
	"add": {
		"doc": {
			"id": "47400e8c06c4568432e49a2aa388d551560f9dcdcc8b0b10efd1991919b1eac9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Presley_%26_Mahendra_%281%29.jpg/220px-Presley_%26_Mahendra_%281%29.jpg",
				"previous": "After training, Presley joined the 3rd Armored Division in Friedberg, Germany, on October 1.[156] Introduced to amphetamines by a sergeant while on maneuvers, he became \"practically evangelical about their benefits\"—not only for energy, but for \"strength\" and weight loss, as well—and many of his friends in the outfit joined him in indulging.[157] The Army also introduced Presley to karate, which he studied seriously, later including it in his live performances.[158] Fellow soldiers have attested to Presley's wish to be seen as an able, ordinary soldier, despite his fame, and to his generosity. He donated his Army pay to charity, purchased TV sets for the base, and bought an extra set of fatigues for everyone in his outfit.[159]",
				"after": "While in Friedberg, Presley met 14-year-old Priscilla Beaulieu. They would eventually marry after a seven-and-a-half-year courtship.[160] In her autobiography, Priscilla says that despite his worries that it would ruin his career, Parker convinced Presley that to gain popular respect, he should serve his country as a regular soldier rather than in Special Services, where he would have been able to give some musical performances and remain in touch with the public.[161] Media reports echoed Presley's concerns about his career, but RCA producer Steve Sholes and Freddy Bienstock of Hill and Range had carefully prepared for his two-year hiatus. Armed with a substantial amount of unreleased material, they kept up a regular stream of successful releases.[162] Between his induction and discharge, Presley had ten top 40 hits, including \"Wear My Ring Around Your Neck\", the best-selling \"Hard Headed Woman\", and \"One Night\"[163] in 1958, and \"(Now and Then There's) A Fool Such as I\" and the number one \"A Big Hunk o' Love\" in 1959.[164] RCA also generated four albums compiling old material during this period, most successfully Elvis' Golden Records (1958), which hit number three on the LP chart.[165]",
			"color": " "
		}
	}
}
