{
	"add": {
		"doc": {
			"id": "4748e587947a7d3d234d987250e371f682e2fa2574ce74260cb405cf711a532f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Cigogne_blanche_MHNT.jpg/170px-Cigogne_blanche_MHNT.jpg",
				"previous": "A white stork pair raises a single brood a year. The female typically lays four eggs, though clutches of one to seven have been recorded.[72] The eggs are white, but often look dirty or yellowish due to a glutinous covering. They measure 72.58 mm × 51.86 mm (2.857 in × 2.042 in),[88] and weigh 96–129 g (3.4–4.6 oz),[72] of which 10.76 g (0.380 oz) is shell.[88] Incubation begins as soon as the first egg is laid, so the brood hatches asynchronously, beginning 33 to 34 days later. The first hatchling typically has a competitive edge over the others. While stronger chicks are not aggressive towards weaker siblings, as is the case in some species, weak or small chicks are sometimes killed by their parents.[89][90] This behaviour occurs in times of food shortage to reduce brood size and hence increase the chance of survival of the remaining nestlings. White stork nestlings do not attack each other, and their parents' method of feeding them (disgorging large amounts of food at once) means that stronger siblings cannot outcompete weaker ones for food directly, hence parental infanticide is an efficient way of reducing brood size. Despite this, this behaviour has not commonly been observed.[89]",
				"after": "The temperature and weather around the time of hatching in spring is important; cool temperatures and wet weather increase chick mortality and reduce breeding success rates.[45] Somewhat unexpectedly, studies have found that later-hatching chicks which successfully reach adulthood produce more chicks than do their earlier-hatching nestmates.[91] The body weight of the chicks increases rapidly in the first few weeks and reaches a plateau of about 3.4 kg (7.5 lb) in 45 days. The length of the beak increases linearly for about 50 days.[92] Young birds are fed with earthworms and insects, which are regurgitated by the parents onto the floor of the nest. Older chicks reach into the mouths of parents to obtain food.[93] Chicks fledge 58 to 64 days after hatching.[94]",
			"color": "tan|0.31526 gainsboro|0.085659 light|0.082197 gray|0.082197 light|0.082197 grey|0.082197 gray|0.069083 grey|0.069083 dark|0.059322 gray|0.059322 dark|0.059322 grey|0.059322 white|0.053388 smoke|0.053388 silver|0.044865 lavender|0.034206 blush|0.034206 alice|0.034132 blue|0.034132 ghost|0.033462 white|0.033462 sea|0.032279 shell|0.032279 snow|0.031687 linen|0.027782 white|0.026529 mint|0.021773 cream|0.021773 floral|0.014827 white|0.014827 azure|0.011498 dim|0.0099454 gray|0.0099454 dim|0.0099454 grey|0.0099454 burly|0.0083032 wood|0.0083032  "
		}
	}
}
