{
	"add": {
		"doc": {
			"id": "47620edf2243b0b26599e8e7e22a2a4729238d8d1c0e3790ddd17a1847d27cf8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Deutsches_Reich_1871-1918.png/220px-Deutsches_Reich_1871-1918.png",
				"previous": "King William I appointed Otto von Bismarck the new Minister President of Prussia in 1862. Bismarck successfully waged war on Denmark in 1864. Prussian victory in the Austro-Prussian War of 1866 enabled him to create the North German Confederation (Norddeutscher Bund) and to exclude Austria from the federation's affairs. After the French defeat in the Franco-Prussian War, the German Empire was proclaimed in 1871 in Versailles, uniting all scattered parts of Germany except Austria. Prussia was the dominating constituent of the new state; the Hohenzollern King of Prussia ruled as its concurrent Emperor, and Berlin became its capital.[31]",
				"after": "In the Gründerzeit period following the unification of Germany, Bismarck's foreign policy as Chancellor of Germany under Emperor William I secured Germany's position as a great nation by forging alliances, isolating France by diplomatic means, and avoiding war. As a result of the Berlin Conference in 1884 Germany claimed several colonies including German East Africa, German South-West Africa, Togo, and Cameroon.[32] Under Wilhelm II, however, Germany, like other European powers, took an imperialistic course leading to friction with neighbouring countries. Most alliances in which Germany had previously been involved were not renewed, and new alliances excluded the country.[33]",
			"color": "dark|0.19529 sea|0.19529 green|0.19529 steel|0.12671 blue|0.12671 powder|0.1106 blue|0.1106 light|0.096486 blue|0.096486 pale|0.051251 turquoise|0.051251 light|0.044746 cyan|0.044746 gold|0.04226 salmon|0.030386 peru|0.02703 azure|0.023775 alice|0.021119 blue|0.021119 cadet|0.020097 blue|0.020097 gray|0.017006 grey|0.017006 mint|0.014909 cream|0.014909 white|0.014332 smoke|0.014332 ghost|0.013045 white|0.013045 light|0.012187 slate|0.012187 gray|0.012187 white|0.011272 dim|0.011253 gray|0.011253 dim|0.011253 grey|0.011253 pale|0.011186 golden|0.011186 rod|0.011186 snow|0.009726 slate|0.0090407 gray|0.0090407 sienna|0.0089608 lemon|0.0080414 chiffon|0.0080414 chocolate|0.0077439 golden|0.0070433 rod|0.0070433  "
		}
	}
}
