{
	"add": {
		"doc": {
			"id": "477437b720d1dd100033a9029bd265705d2bd26c421c028341cd355ae6caa4e8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Dhoni_at_Reebok_event.jpg/220px-Dhoni_at_Reebok_event.jpg",
				"previous": "India has had six regular Test captains since Mohammad Azharuddin took charge in 1989. Azharuddin led the team in 47 Test matches from 1989-90 to 1998-99, winning 14, and in 173 ODIs, winning 89. He was followed by Sachin Tendulkar, who captained the team in 25 Test matches and 73 ODIs in the late 1990s; Tendulkar was relatively unsuccessful[61][62] as a captain, winning only 4 Test matches and 23 ODIs. He was replaced as ODI captain by Ajay Jadeja and then by Sourav Ganguly.",
				"after": "Ganguly became the regular captain of the team in both Tests and ODIs in 2000. He remained captain until 2005-06 and became the then most successful Indian captain, winning 21 of his 49 Test matches in charge and 73 of his 141 ODIs. Under his captaincy, India became the joint-winners of the 2002 ICC Champions Trophy with Sri Lanka, and the runners-up of the 2003 Cricket World Cup. India lost only three Tests at home under Ganguly and managed to draw Test series in England and Australia. Rahul Dravid took over as Test captain in 2005. In 2006, he led India to its first Test series victory in the West Indies in more than 30 years. In September 2007, Mahendra Singh Dhoni was named as the new captain of the ODI and T20I teams, after Dravid stepped down from the post. Soon after taking up the captaincy, Dhoni led the team to the inaugural World Twenty20 title. Anil Kumble was appointed Test captain in November 2007, but retired from international cricket in November 2008 after captaining in 14 Tests. Dhoni succeeded him as the Test captain, making him the captain in all formats. Under the captaincy of Dhoni, the Indian team held the number one position in the Test rankings for 21 months (from November 2009 to August 2011), and set a national record for most back-to-back ODI wins (nine straight wins).[63] Dhoni also led the team to victory in 2011 Cricket World Cup and 2013 ICC Champions Trophy. However, the team performed poorly in away Tests from 2011 to 2014. Dhoni retired from Test cricket in December 2014, and Virat Kohli was named his successor.",
			"color": "burly|0.23126 wood|0.23126 tan|0.18418 dark|0.11307 salmon|0.11307 dim|0.10917 gray|0.10917 dim|0.10917 grey|0.10917 gray|0.078183 grey|0.078183 navajo|0.052676 white|0.052676 peach|0.04412 puff|0.04412 dark|0.033914 slate|0.033914 gray|0.033914 wheat|0.022082 black|0.02082 light|0.019248 salmon|0.019248  "
		}
	}
}
