{
	"add": {
		"doc": {
			"id": "4774fe726b7d9dc005fd456e8dc7625d5ee496e77c2b5e4040b77602a5492f00",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/DiplodocusDB.jpg/220px-DiplodocusDB.jpg",
				"previous": "One of the best-known sauropods, Diplodocus was a very large long-necked quadrupedal animal, with a long, whip-like tail. Its forelimbs were slightly shorter than its hind limbs, resulting in a largely horizontal posture. The long-necked, long-tailed animal with four sturdy legs has been mechanically compared with a suspension bridge.[6] In fact, Diplodocus is the longest dinosaur known from a complete skeleton.[6] The partial remains of D. hallorum have increased the estimated length, though not as much as previously thought; when first described in 1991, discoverer David Gillette calculated it may have been up to 52 m (170 ft) long,[7] making it the longest known dinosaur (excluding those known from exceedingly poor remains, such as Amphicoelias). Some weight estimates ranged as high as 113 tons (125 US short tons). The estimated length was later revised downward to 33 metres (108 ft)[8] based on findings that show that Gillette had originally misplaced vertebrae 12–19 as vertebrae 20–27. The nearly complete Diplodocus skeleton at the Carnegie Museum of Natural History in Pittsburgh, Pennsylvania, on which estimates of Seismosaurus are based, also was found to have had its 13th tail vertebra come from another dinosaur, throwing size estimates for Seismosaurus further off. While dinosaurs such as Supersaurus were probably longer, fossil remains of these animals are only fragmentary.[9] Modern mass estimates for Diplodocus (exclusive of D. hallorum) have tended to be in the 10 to 16 tonne (11–17.6 ton) range: 10 tonnes (11 tons);[10] 11.5 tonnes (12.7 tons);[11] 12.7 tonnes (14 tons);[12] and 16 tonnes (17.6 tons).[13]",
				"after": "Diplodocus had an extremely long tail, composed of about 80 caudal vertebrae,[14] which is almost double the number some of the earlier sauropods had in their tails (such as Shunosaurus with 43), and far more than contemporaneous macronarians had (such as Camarasaurus with 53). There has been speculation as to whether it may have had a defensive[15] or noisemaking (by cracking it like a coachwhip) function.[16] The tail may have served as a counterbalance for the neck. The middle part of the tail had 'double beams' (oddly shaped chevron bones on the underside, which gave Diplodocus its name). They may have provided support for the vertebrae, or perhaps prevented the blood vessels from being crushed if the animal's heavy tail pressed against the ground. These 'double beams' are also seen in some related dinosaurs.[17]",
			"color": "peach|0.083604 puff|0.083604 wheat|0.073386 bisque|0.069229 navajo|0.05449 white|0.05449 moccasin|0.047846 blanched|0.042111 almond|0.042111 burly|0.039158 wood|0.039158 dark|0.038736 gray|0.038736 dark|0.038736 grey|0.038736 antique|0.035634 white|0.035634 gainsboro|0.034308 tan|0.028059 silver|0.027891 thistle|0.027734 papaya|0.027033 whip|0.027033 white|0.026885 smoke|0.026885 misty|0.026124 rose|0.026124 light|0.02607 gray|0.02607 light|0.02607 grey|0.02607 linen|0.025369 mint|0.022501 cream|0.022501 alice|0.021626 blue|0.021626 rosy|0.021304 brown|0.021304 pale|0.02129 golden|0.02129 rod|0.02129 azure|0.01976 snow|0.018041 sea|0.017543 shell|0.017543 ghost|0.014633 white|0.014633 white|0.014042 floral|0.013353 white|0.013353 old|0.010529 lace|0.010529 gray|0.0087005 grey|0.0087005 khaki|0.0078703 light|0.0068266 cyan|0.0068266 dark|0.0065998 khaki|0.0065998 lavender|0.0058316 honeydew|0.0056507 lavender|0.005619 blush|0.005619 corn|0.0053467 silk|0.0053467 beige|0.0051552  "
		}
	}
}
