{
	"add": {
		"doc": {
			"id": "47827b1f561796951b7b0112c9026e5b6e32e36d0cf1008e4d9d95c1e0ef66f8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Stone_Mountain_countermarked.jpg/220px-Stone_Mountain_countermarked.jpg",
				"previous": "Although volunteer enthusiasm was essential to the Association's plans in the Harvest Campaign, it did not rely on it at the higher levels; the state chairs were compensated, both by salary and commission. J.W. Gibbes, clerk of the South Carolina House of Representatives, was hired as that state's executive director; he undertook to sell 100,000 coins and received just under $3,500 in salary and commissions, all paid in 1926. Local volunteers organized Chamber of Commerce luncheons to sell coins throughout the South; chapters of the UDC purchased pieces to present to surviving Civil War veterans.[46] Mrs. N. Burton Bass of Atlanta was reported to be the leading seller, once disposing of 233 coins in an afternoon. A series of dance balls honored the UDC members who sold large numbers of pieces. Nevertheless, Hyder and Colbert suggested that there was \"a general lack of more ladies such as Mrs. Bass\"; many municipalities had trouble finding local chairs.[47] Outside the South, sales were promoted by three professional publicists hired by the Association.[48] To keep public interest high, the Association released Lukeman's conceptions for Stone Mountain, which were on a smaller scale than Borglum's.[49] Lukeman conceived a scaled-down concept, of the three Confederate leaders on horseback.[5] Despite the campaign, sales were slower than expected.[50] In late 1925, the Association offered Northern banks a commission of seven cents a coin; it is uncertain if any took up the offer.[51] The continuing opposition of the GAR to the coins dampened sales in the North.[52]",
				"after": "One means of fundraising that Harvest Campaign administrators decided on was to counterstamp some of the coins for sale at premium prices. The letters and numbers are believed to have been punched by the Association, as they are almost entirely uniform. Some were given a state abbreviation and a number, and were sent to be auctioned in various towns. Gibbes reported that the counterstamped pieces sent to South Carolina sold for an average of $23, ranging from $10 to $110, and recommended that the auctions be preceded with the account of the sale of one in Bradenton, Florida, for $1,300.[53] Which town got which number was the luck of the draw.[54] Others were marked with \"U.D.C.\" and a state abbreviation, together with a number which probably represents a membership or chapter number. These were intended for presentation to members deserving of special honor, such as an outgoing president. They did not sell well, as the Association had alienated many UDC members over the firing of Borglum. The Association also announced a program for sale to the Sons of Confederate Veterans, although whether any coins were sold under this program is unclear, as none have been identified.[55] Pieces marked \"G.L.\" and \"S.L.\" were puzzled over by collectors for many years; A. Steve Deitert in the January 2011 edition of The Numismatist identified the markings as \"Gold Lavalier\" and \"Silver Lavalier\". These coins were given to county winners and runners-up in a selling competition for young ladies.[56]",
			"color": "dark|0.15621 gray|0.15621 dark|0.15621 grey|0.15621 rosy|0.1079 brown|0.1079 gray|0.10477 grey|0.10477 antique|0.10111 white|0.10111  "
		}
	}
}
