{
	"add": {
		"doc": {
			"id": "4791ccfc9a648d027cf14cd05bd635aaebc257753130f3a14f6303697cb87f66",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/1776_Potosi_2_reales_obv.jpg/170px-1776_Potosi_2_reales_obv.jpg",
				"previous": "The Flying Eagle cent was issued in exchange for worn Spanish colonial silver coins, which until then had circulated widely in the United States. These \"small cents\" were also issued in exchange for the copper coins they had replaced. By 1858, Mint authorities found the piece unsatisfactory in production. The high points on both sides of the coin (the eagle's head and the wreath) opposed each other, and it was difficult to get the design to be brought out fully in the tough copper-nickel alloy. Mint Engraver James B. Longacre, designer of the Flying Eagle cent, was instructed to develop alternative designs. He produced one, showing a slimmer eagle, which would not clash as much with the reverse wreath. Although this would have cured the production problem, the design was not liked.[4] Mint Director James Ross Snowden suggested a head of Columbus as an obverse design, but Longacre felt the public would not approve of a historic figure on an American coin.[b][5]",
				"after": "In 1858, the Mint tested new designs for the cent.[6] Between 60 and 100 sets of twelve pattern coins were struck, consisting of the standard Flying Eagle obverse, a \"scrawny eagle\" pattern, and the Indian Head design, mated with four different wreaths for the reverse. Snowden would make his choice of what design would be struck in 1859 from these patterns; the sets were also sold to collectors.[c][7][8] The Indian Head design was apparently prepared by April, as on the twelfth of that month, a Mr. Howard wrote to Snowden that \"I have learned that a new pattern piece for the cent has been struck off at the Mint [with] a head resembling that of the three dollar piece and on the reverse a shield at the top of the olive and oak wreath\", and asking to purchase a specimen.[9] Other numismatists also sought pieces: R. Coulton Davis, a Philadelphia druggist with ties to the Mint, wrote to Snowden in June informing him of a favorable story in a Boston newspaper, and Augustus B. Sage wrote to the Mint Director the same month, asking for a specimen for himself, and one for the newly founded American Numismatic Society.[d][9]",
			"color": "misty|0.17896 rose|0.17896 antique|0.15643 white|0.15643 linen|0.07504 papaya|0.073963 whip|0.073963 rosy|0.06622 brown|0.06622 blanched|0.060587 almond|0.060587 old|0.056788 lace|0.056788 bisque|0.056156 sea|0.039578 shell|0.039578 corn|0.032923 silk|0.032923 floral|0.032899 white|0.032899 beige|0.03058 peach|0.026387 puff|0.026387 ivory|0.023388 light|0.012634 gray|0.012634 light|0.012634 grey|0.012634 light|0.011201 yellow|0.011201 silver|0.0099555 gainsboro|0.0091523 snow|0.0078475 lavender|0.0067396 blush|0.0067396 dark|0.0065963 gray|0.0065963 dark|0.0065963 grey|0.0065963  "
		}
	}
}
