{
	"add": {
		"doc": {
			"id": "47aa8abe3d28e20699f979c24a5cc9ed665003b392174c7d4d70c5bb6cb8ec6d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Structure_of_cation_of_%28%28C5tBu3H2%29Rh%28C5H5%29%29BF4.png/650px-Structure_of_cation_of_%28%28C5tBu3H2%29Rh%28C5H5%29%29BF4.png",
				"previous": "[(η5-C5tBu3H2)Rh(η5-C5H5)]BF4 forms a colourless centrosymmetric monoclinic crystal belonging to the P21/c space group, and with a density of 1.486 g cm−3.[41] Looking at the ORTEP diagram of the structure of the cation (at right), it is evident that it possesses the typical geometry expected of a rhodocene or rhodocenium cation. The two cyclopentadienyl rings are close to parallel (the centroid–Rh–centroid angle is 177.2°) and the rhodium centre is slightly closer to the substituted cyclopentadienyl ring (Rh–centroid distances are 1.819 Å and 1.795 Å), an observation attributed to the greater inductive effect of the tert-butyl groups on the substituted ligand.[41] The ORTEP diagram shows that the cation adopts an eclipsed conformation in the solid state. However, the crystal structure of the hexafluorophosphate salt shows three crystallographically independent cations, one eclipsed, one staggered, and one which is rotationally disordered.[41] This suggests that the conformation adopted is dependent on the anion present and also illustrates that the energy barrier to rotation is low – in ferrocene, the rotational energy barrier is known to be ~5 kJ mol−1 in both solution and gas phase.[12]",
				"after": "The diagram above shows the rhodium–carbon (in red, inside pentagons on the left) and carbon–carbon (in blue, outside pentagons on the left) bond distances for both ligands, along with the bond angles (in green, inside pentagons on the right) within each cyclopentadienyl ring. The atom labels used are the same as those shown in the crystal structure above. Within the unsubstituted cyclopentadienyl ligand, the carbon–carbon bond lengths vary between 1.35 Å and 1.40 Å and the internal bond angles vary between 107° and 109°. For comparison, the internal angle at each vertex of a regular pentagon is 108°. The rhodium–carbon bond lengths vary between 2.16 Å and 2.18 Å.[41] These results are consistent with η5-coordination of the ligand to the metal centre. In the case of the substituted cyclopentadienyl ligand, there is somewhat greater variation: carbon–carbon bond lengths vary between 1.39 Å and 1.48 Å, the internal bond angles vary between 106° and 111°, and the rhodium–carbon bond lengths vary between 2.14 Å and 2.20 Å. The greater variation in the substituted ligand is attributed to the distortions necessary to relieve the steric strain imposed by neighbouring tert-butyl substituents; despite these variations, the data demonstrate that the substituted cyclopentadienyl is also η5-coordinated.[41]",
			"color": "white|0.089434 smoke|0.089434 sea|0.089336 shell|0.089336 snow|0.088987 white|0.088669 floral|0.08853 white|0.08853 mint|0.088075 cream|0.088075 ghost|0.088006 white|0.088006 alice|0.087388 blue|0.087388 azure|0.086684 lavender|0.084503 blush|0.084503 gray|0.013648 grey|0.013648 dim|0.013183 gray|0.013183 dim|0.013183 grey|0.013183 light|0.012238 green|0.012238 misty|0.010649 rose|0.010649 dark|0.0095979 gray|0.0095979 dark|0.0095979 grey|0.0095979 pink|0.0089535 light|0.0084884 coral|0.0084884 light|0.0084302 pink|0.0084302 ivory|0.0074737 black|0.0049709 honeydew|0.0042528 silver|0.0035998 linen|0.0035758 light|0.0027222 gray|0.0027222 light|0.0027222 grey|0.0027222  "
		}
	}
}
