{
	"add": {
		"doc": {
			"id": "47ac4a4cd6aba0481fe397a3502e9d792a3a3f7e4682916ff21c002840f42d8b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Cylindrical_Projection_basics2.svg/400px-Cylindrical_Projection_basics2.svg.png",
				"previous": "The spherical approximation of Earth with radius a can be modelled by a smaller sphere of radius R, called the globe in this section. The globe determines the scale of the map. The various cylindrical projections specify how the geographic detail is transferred from the globe to a cylinder tangential to it at the equator. The cylinder is then unrolled to give the planar map.[4][5] The fraction R/a is called the representative fraction (RF) or the principal scale of the projection. For example, a Mercator map printed in a book might have an equatorial width of 13.4 cm corresponding to a globe radius of 2.13 cm and an RF of approximately 1/300M (M is used as an abbreviation for 1,000,000 in writing an RF) whereas Mercator's original 1569 map has a width of 198 cm corresponding to a globe radius of 31.5 cm and an RF of about 1/20M.",
				"after": "A cylindrical map projection is specified by formulæ linking the geographic coordinates of latitude φ and longitude λ to Cartesian coordinates on the map with origin on the equator and x-axis along the equator. By construction, all points on the same meridian lie on the same generator[6] of the cylinder at a constant value of x, but the distance y along the generator (measured from the equator) is an arbitrary[7] function of latitude, y(φ). In general this function does not describe the geometrical projection (as of light rays onto a screen) from the centre of the globe to the cylinder, which is only one of an unlimited number of ways to conceptually project a cylindrical map.",
			"color": "white|0.087704 smoke|0.087704 sea|0.087203 shell|0.087203 snow|0.086982 white|0.086554 ghost|0.085634 white|0.085634 floral|0.085107 white|0.085107 alice|0.083433 blue|0.083433 mint|0.082902 cream|0.082902 azure|0.07995 lavender|0.079072 blush|0.079072 dark|0.029617 gray|0.029617 dark|0.029617 grey|0.029617 dim|0.026277 gray|0.026277 dim|0.026277 grey|0.026277 misty|0.022142 rose|0.022142 gray|0.020407 grey|0.020407 silver|0.013803 linen|0.01054 ivory|0.0091121 light|0.0081273 gray|0.0081273 light|0.0081273 grey|0.0081273 gainsboro|0.0077863 old|0.0032304 lace|0.0032304  "
		}
	}
}
