{
	"add": {
		"doc": {
			"id": "47ce890b82880b3553143f700c562d6c47ff4d694a8eca7d086b1b0a29983a84",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/ARC194219.png/220px-ARC194219.png",
				"previous": "Historian Donald Sassoon catalogued the growth of the painting's fame.[51] During the mid-19th century, Théophile Gautier and the Romantic poets were able to write about Mona Lisa as a femme fatale because Lisa was an ordinary person. Mona Lisa \"...was an open text into which one could read what one wanted; probably because she was not a religious image; and, probably, because the literary gazers were mainly men who subjected her to an endless stream of male fantasies.\" During the 20th century, the painting was stolen, an object for mass reproduction, merchandising, lampooning and speculation, and was reproduced in \"300 paintings and 2,000 advertisements\".[52] The subject was described as deaf, in mourning,[14] toothless, a \"highly-paid tart\", various people's lover, a reflection of the artist's neuroses, and a victim of syphilis, infection, paralysis, palsy, cholesterol or a toothache.[52] Scholarly as well as amateur speculation assigned Lisa's name to at least four different paintings[13][14][15] and the sitter's identity to at least ten different people.[16][17][19][53]",
				"after": "Visitors spend about 15 seconds viewing the Mona Lisa.[54] Until the 20th century, Mona Lisa was one among many and not the \"most famous painting\"[55] in the world as it is termed today. In 1878, the Baedeker guide called it \"the most celebrated work of Leonardo in the Louvre\". Between 1851 and 1880, artists who visited the Louvre copied Mona Lisa roughly half as many times as certain works by Bartolomé Esteban Murillo, Antonio da Correggio, Paolo Veronese, Titian, Jean-Baptiste Greuze and Pierre-Paul Prud'hon.[52]",
			"color": "black|0.28586 rosy|0.26688 brown|0.26688 dark|0.093854 gray|0.093854 dark|0.093854 grey|0.093854 light|0.047761 gray|0.047761 light|0.047761 grey|0.047761 dim|0.044696 gray|0.044696 dim|0.044696 grey|0.044696 silver|0.043315 gray|0.040102 grey|0.040102 gainsboro|0.037009 slate|0.026818 gray|0.026818  "
		}
	}
}
