{
	"add": {
		"doc": {
			"id": "47e9e7c6c904e221668142bd8c9b3fac35ec091062bbfc4d15d17ceb513c135f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/15R-33L_-_Aeropuerto_de_Madrid-Barajas_-_detail.jpg/220px-15R-33L_-_Aeropuerto_de_Madrid-Barajas_-_detail.jpg",
				"previous": "For clarity in radio communications, each digit in the runway name is pronounced individually: runway three six, runway one four, etc. A leading zero, for example in \"runway zero six\" or \"runway zero one left\", is included for all ICAO and some U.S. military airports (such as Edwards Air Force Base). However, most U.S. civil aviation airports drop the leading zero as required by FAA regulation.[3] This also includes some military airfields such as Cairns Army Airfield. This American anomaly may lead to inconsistencies in conversations between American pilots and controllers in other countries. It is very common in a country such as Canada for a controller to clear an incoming American aircraft to, for example, runway 04, and the pilot read back the clearance as runway 4. In flight simulation programs those of American origin might apply U.S. usage to airports around the world. For example runway 05 at Halifax will appear on the program as the single digit 5 rather than 05.",
				"after": "Runway designations change over time because the magnetic poles slowly drift on the Earth's surface and the magnetic bearing will change. Depending on the airport location and how much drift takes place, it may be necessary over time to change the runway designation. As runways are designated with headings rounded to the nearest 10 degrees, this will affect some runways more than others. For example, if the magnetic heading of a runway is 233 degrees, it would be designated Runway 23. If the magnetic heading changed downwards by 5 degrees to 228, the Runway would still be Runway 23. If on the other hand the original magnetic heading was 226 (Runway 23), and the heading decreased by only 2 degrees to 224, the runway should become Runway 22. Because the drift itself is quite slow, runway designation changes are uncommon, and not welcomed, as they require an accompanying change in aeronautical charts and descriptive documents. When runway designations do change, especially at major airports, it is often changed at night as taxiway signs need to be changed and the huge numbers at each end of the runway need to be repainted to the new runway designators. In July 2009 for example, London Stansted Airport in the United Kingdom changed its runway designations from 05/23 to 04/22 during the night.",
			"color": "sienna|0.31814 tan|0.15351 light|0.092756 golden|0.092756 rod|0.092756 yellow|0.092756 wheat|0.089071 lemon|0.061508 chiffon|0.061508 beige|0.059419 corn|0.051611 silk|0.051611 blanched|0.051326 almond|0.051326 light|0.038618 yellow|0.038618 papaya|0.036874 whip|0.036874 antique|0.013793 white|0.013793 burly|0.010397 wood|0.010397 bisque|0.0061232  "
		}
	}
}
