{
	"add": {
		"doc": {
			"id": "47f271ed4c4b2c1fafe3677cc1e6fc9a548038891cd3af7567eebcb435b04470",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Bu_yan-er_yu_yi_mu_liao-ran.jpg/220px-Bu_yan-er_yu_yi_mu_liao-ran.jpg",
				"previous": "Yet the dynasty rallied. Chinese generals and officials such as Zuo Zongtang led the suppression of rebellions and stood behind the Manchus. When the Tongzhi Emperor came to the throne at the age of five in 1861, these officials rallied around him in what was called the Tongzhi Restoration. Their aim was to adopt western military technology in order to preserve Confucian values. Zeng Guofan, in alliance with Prince Gong, sponsored the rise of younger officials such as Li Hongzhang, who put the dynasty back on its feet financially and instituted the Self-Strengthening Movement. The reformers then proceeded with institutional reforms, including China's first unified ministry of foreign affairs, the Zongli Yamen; allowing foreign diplomats to reside in the capital; establishment of the Imperial Maritime Customs Service; the formation of modernized armies, such as the Beiyang Army, as well as a navy; and the purchase from Europeans of armament factories. [63]",
				"after": "The dynasty lost control of peripheral territories bit by bit. In return for promises of support against the British and the French, Czarist Russia took large chunks of territory in the Northeast in 1860. The period of cooperation between the reformers and the European powers ended with the Tientsin Massacre of 1870, which was incited by the murder of French nuns set off by the belligerence of local French diplomats. Starting with the Cochinchina Campaign in 1858, France expanded control of Indochina. By 1883, France was in full control of the region and had reached the Chinese border. The Sino-French War over Tonkin, once a Qing tributary state, ended in 1885 with French victory and Chinese recognition of all the French claims to it.[64]",
			"color": "silver|0.17174 light|0.096296 gray|0.096296 light|0.096296 grey|0.096296 light|0.090206 blue|0.090206 light|0.073186 steel|0.073186 blue|0.073186 dark|0.062943 gray|0.062943 dark|0.062943 grey|0.062943 gainsboro|0.054453 navajo|0.044715 white|0.044715 pale|0.041744 golden|0.041744 rod|0.041744 dark|0.037912 slate|0.037912 gray|0.037912 moccasin|0.037636 wheat|0.031141 gray|0.023084 grey|0.023084 dim|0.01304 gray|0.01304 dim|0.01304 grey|0.01304 tan|0.012765 powder|0.01236 blue|0.01236 lemon|0.010178 chiffon|0.010178 khaki|0.0098661 burly|0.0096776 wood|0.0096776 bisque|0.0090841 light|0.0087465 slate|0.0087465 gray|0.0087465 blanched|0.0076544 almond|0.0076544 white|0.0072998 smoke|0.0072998 slate|0.0069876 gray|0.0069876 floral|0.006816 white|0.006816 linen|0.0068131 dark|0.006607 khaki|0.006607 sea|0.0065433 shell|0.0065433 old|0.005981 lace|0.005981 light|0.0058987 golden|0.0058987 rod|0.0058987 yellow|0.0058987 antique|0.0055959 white|0.0055959 mint|0.005456 cream|0.005456 snow|0.0054034 peach|0.0052743 puff|0.0052743 ivory|0.0051716 papaya|0.0050203 whip|0.0050203 beige|0.0049504 white|0.0049467  "
		}
	}
}
