{
	"add": {
		"doc": {
			"id": "47f9e63116af58c87bbfe4f39f44d41dfed6099e7f796efd667e848731998767",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Alfkors.svg/220px-Alfkors.svg.png",
				"previous": "In Denmark and Sweden, the elves appear as beings distinct from the vetter, even though the border between them is diffuse. The insect-winged fairies in Celtic mythology are often called älvor in modern Swedish or alfer in Danish, although the more formal translation is feer. In a similar vein, the alf found in the fairy tale The Elf of the Rose by Danish author Hans Christian Andersen is so tiny that he can have a rose blossom for home, and has 'wings that reached from his shoulders to his feet'. Yet Andersen also wrote about elvere in The Elfin Hill. The elves in this story are more alike those of traditional Danish folklore, who were beautiful females, living in hills and boulders, capable of dancing a man to death. Like the huldra in Norway and Sweden, they are hollow when seen from the back.",
				"after": "The elves of Norse mythology have survived into folklore mainly as females, living in hills and mounds of stones.[96] The Swedish älvor, (sing. älva) were stunningly beautiful girls who lived in the forest with an elven king.[97][98] In Romantic art and literature, elves are typically pictured as fair-haired, white-clad, and (like most creatures in the Scandinavian folklore) nasty when offended. In folk-stories, they often play the role of disease-spirits. The most common, though also most harmless case was various irritating skin rashes, which were called älvablåst (elven blow) and could be cured by a forceful counter-blow (a handy pair of bellows was most useful for this purpose). Skålgropar, a particular kind of petroglyph found in Scandinavia, were known in older times as älvkvarnar (elven mills), pointing to their believed usage. One could appease the elves by offering them a treat (preferably butter) placed into an elven mill.",
			"color": "black|0.75115 dim|0.094532 gray|0.094532 dim|0.094532 grey|0.094532 gray|0.079051 grey|0.079051 dark|0.069719 gray|0.069719 dark|0.069719 grey|0.069719 silver|0.0053799  "
		}
	}
}
