{
	"add": {
		"doc": {
			"id": "47f9b22010557437939ff35abcdf9eba07267f28d163631f9a162980d56047d6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Raceways.jpg/220px-Raceways.jpg",
			"previous": [],
				"after": "Since 1870, rainbow trout have been artificially propagated in fish hatcheries to restock streams and to introduce them into non-native waters. The first rainbow trout hatchery was established on San Leandro Creek, a tributary of San Francisco Bay, in 1870, and trout production began in 1871. The hatchery was stocked with the locally native rainbow trout, and likely steelhead of the coastal rainbow trout subspecies (O. m. irideus). The fish raised in this hatchery were shipped to hatcheries out of state for the first time in 1875, to Caledonia, New York, and then in 1876 to Northville, Michigan. In 1877, another California rainbow trout hatchery, the first federal fish hatchery in the National Fish Hatchery System, was established on Campbell Creek, a McCloud River tributary.[37] The McCloud River hatchery indiscriminately mixed coastal rainbow trout eggs with the eggs of local McCloud River redband trout (O. m. stonei). Eggs from the McCloud hatchery were also provided to the San Leandro hatchery, thus making the origin and genetic history of hatchery-bred rainbow trout somewhat diverse and complex.[38] In the U.S., there are hundreds of hatcheries operated by the U.S. Fish and Wildlife Service and various state agencies and tribal governments propagating rainbow trout for conservation and recreational sport fishing.[39][40][41][42] Six of ten Canadian provinces have rainbow trout farms, with Ontario leading production.[43]",
			"color": "dark|0.30976 gray|0.30976 dark|0.30976 grey|0.30976 dim|0.17877 gray|0.17877 dim|0.17877 grey|0.17877 gray|0.17116 grey|0.17116 silver|0.10945 light|0.035968 gray|0.035968 light|0.035968 grey|0.035968 light|0.035066 slate|0.035066 gray|0.035066 black|0.033944 slate|0.027801 gray|0.027801 gainsboro|0.021664 light|0.012188 steel|0.012188 blue|0.012188  "
		}
	}
}
