{
	"add": {
		"doc": {
			"id": "48021c877976e7f147fae00bd60aef824426e6d946088d38543712bf91bc6df7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/1937_Waco_VKS-7_CAvM_Ottawa%2CON_MDF_8398.jpg/220px-1937_Waco_VKS-7_CAvM_Ottawa%2CON_MDF_8398.jpg",
				"previous": "An unwanted side effect of aileron operation is adverse yaw—a yawing moment in the opposite direction to the roll. Using the ailerons to roll an aircraft to the right produces a yawing motion to the left. As the aircraft rolls, adverse yaw is caused partly by the change in drag between the left and right wing. The rising wing generates increased lift, which causes increased induced drag. The descending wing generates reduced lift, which causes reduced induced drag. Profile drag caused by the deflected ailerons may add further to the difference, along with changes in the lift vectors as one rotates back while the other rotates forward.",
				"after": "In a coordinated turn, adverse yaw is effectively compensated by the use of the rudder, which results in a sideforce on the vertical tail that opposes the adverse yaw by creating a favorable yawing moment. Another method of compensation is 'differential ailerons', which have been rigged such that the down-going aileron deflects less than the up-going one. In this case the opposing yaw moment is generated by a difference in profile drag between the left and right wingtips. Frise ailerons accentuate this profile drag imbalance by protruding beneath the wing of an upward-deflected aileron, most often by being hinged slightly behind the leading edge and near the bottom of the surface, with the lower section of the aileron surface's leading edge protruding slightly below the wing's undersurface when the aileron is deflected upwards, substantially increasing profile drag on that side. Ailerons may also be designed to use a combination of these methods.[30]",
			"color": "black|0.45659 dim|0.10568 gray|0.10568 dim|0.10568 grey|0.10568 dark|0.084907 slate|0.084907 gray|0.084907 light|0.056035 gray|0.056035 light|0.056035 grey|0.056035 gainsboro|0.049065 silver|0.029522 brown|0.025753  "
		}
	}
}
