{
	"add": {
		"doc": {
			"id": "481726cd03177a2ebca16f0a2092292a30ed758d2240b9fffe480bd8a0bbc96e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/KingsCollegeChapelWest.jpg/220px-KingsCollegeChapelWest.jpg",
			"previous": [],
			"after": [
				"Education in the United Kingdom is a devolved matter, with each country having a separate education system.",
				"Whilst education in England is the responsibility of the Secretary of State for Education, the day-to-day administration and funding of state schools is the responsibility of local authorities.[386] Universally free of charge state education was introduced piecemeal between 1870 and 1944.[387][388] Education is now mandatory from ages five to sixteen (15 if born in late July or August). In 2011, the Trends in International Mathematics and Science Study (TIMSS) rated 13–14-year-old pupils in England and Wales 10th in the world for maths and 9th for science.[389] The majority of children are educated in state-sector schools, a small proportion of which select on the grounds of academic ability. Two of the top ten performing schools in terms of GCSE results in 2006 were state-run grammar schools. Over half of students at the leading universities of Cambridge and Oxford had attended state schools.[390] Despite a fall in actual numbers the proportion of children in England attending private schools has risen to over 7%.[391] In 2010, more than 45% of places at the University of Oxford and 40% at the University of Cambridge were taken by students from private schools, even though they educate just 7% of the population.[392] England has the two oldest universities in English-speaking world, Universities of Oxford and Cambridge (jointly known as \"Oxbridge\") with history of over eight centuries. The United Kingdom has 9 universities featured in the Times Higher Education top 100 rankings, making it second to the United States in terms of representation.[393]"
			],
			"color": "black|0.28208 dark|0.21164 olive|0.21164 green|0.21164 tan|0.094403 dark|0.071841 slate|0.071841 gray|0.071841 wheat|0.05123 dim|0.046175 gray|0.046175 dim|0.046175 grey|0.046175 burly|0.026889 wood|0.026889 moccasin|0.018435 gray|0.016795 grey|0.016795 dark|0.014724 gray|0.014724 dark|0.014724 grey|0.014724 navajo|0.01455 white|0.01455 pale|0.013241 golden|0.013241 rod|0.013241 silver|0.0096627 antique|0.0080612 white|0.0080612 bisque|0.0078783 linen|0.007316  "
		}
	}
}
