{
	"add": {
		"doc": {
			"id": "481f4d50a007bfe6510c39a19f64bfce97769393025a9edda1ad042f68b5ee41",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Mariah_Carey_2003_tour_1.jpg/220px-Mariah_Carey_2003_tour_1.jpg",
				"previous": "After she received Billboard's Artist of the Decade Award and the World Music Award for Best-Selling Female Artist of the Millennium,[112] Carey parted from Columbia and signed a $100 million five-album recording contract with Virgin Records (EMI Records).[113] Carey was given full conceptual and creative control over the project.[113] She opted to record an album partly mixed with 1980s influenced disco and other similar genres, in order to go hand-in-hand with the film's setting.[114] She often stated that Columbia had regarded her as a commodity, with her separation from Mottola exacerbating her relations with label executives. Just a few months later, in July 2001, it was widely reported that Carey had suffered a physical and emotional breakdown. She had left messages on her website that complained of being overworked,[115] and her relationship with the Latin icon Luis Miguel ended.[116][not in citation given] In an interview the following year, she said, \"I was with people who didn't really know me and I had no personal assistant. I'd do interviews all day long and get two hours of sleep a night, if that.\"[117] Due to the pressure from the media, her heavy work schedule and the split from Miguel, Carey began posting a series of disturbing messages on her official website, and displayed erratic behavior on several live promotional outings.[118] On July 19, 2001, Carey made a surprise appearance on the MTV program Total Request Live (TRL).[119] As the show's host Carson Daly began taping following a commercial break, Carey came out pushing an ice cream cart while wearing a large men's shirt, and began a striptease, in which she shed her shirt to reveal a tight yellow and green ensemble.[119] While she later revealed that Daly was aware of her presence in the building prior to her appearance, Carey's appearance on TRL garnered strong media attention.[118] Only days later, Carey began posting irregular voice notes and messages on her official website: \"I'm trying to understand things in life right now and so I really don't feel that I should be doing music right now. What I'd like to do is just a take a little break or at least get one night of sleep without someone popping up about a video. All I really want is [to] just be me and that's what I should have done in the first place ... I don't say this much but guess what, I don't take care of myself.\"[119] Following the quick removal of the messages, Berger commented that Carey had been \"obviously exhausted and not thinking clearly\" when she posted the letters.[120]",
				"after": "On July 26, she was suddenly hospitalized, citing \"extreme exhaustion\" and a \"physical and emotional breakdown\".[121] Carey was inducted at an un-disclosed hospital in Connecticut, and remained hospitalized and under doctor's care for two weeks, followed by an extended absence from the public.[121] Following the heavy media coverage surrounding Carey's publicized breakdown and hospitalization, Virgin Records and 20th Century Fox delayed the release of both Glitter, as well as its soundtrack of the same name.[120] Consequently, critics suggested that in delaying Glitter, hype for the project would have largely subsided, and would possibly hurt both ticket and album sales.[122][not in citation given] When discussing the project's weak commercial reaction, Carey blamed both her frame of mind during the time of its release, its postponement, as well as the soundtrack having been released on September 11.[123] Critics panned Glitter, as well as its accompanying soundtrack; both were unsuccessful commercially.[124][not in citation given] The accompanying soundtrack album, Glitter, became Carey's lowest-selling album to that point. The St. Louis Post-Dispatch dismissed it as \"an absolute mess that'll go down as an annoying blemish on a career that, while not always critically heralded, was at least nearly consistently successful.\"[125] Following the negative cloud that was ensuing Carey's personal life at the time, as well as the project's poor reception, her $100 million five-album record deal with Virgin Records (EMI Records) was bought out for $50 million.[113][126] Soon after, Carey flew to Capri, Italy for a period of five months, in which she began writing material for her new album, stemming from all the personal experiences she had endured throughout the past year.[118] Carey later said that her time at Virgin was \"a complete and total stress-fest [...] I made a total snap decision which was based on money and I never make decisions based on money. I learned a big lesson from that.\"[127] Later that year, she signed a contract with Island Records, valued at more than $24 million,[128] and launched the record label MonarC. To add further to Carey's emotional burdens, her father, with whom she had little contact since childhood, died of cancer that year.[129]",
			"color": "black|0.48869 light|0.078099 coral|0.078099 indian|0.065446 red|0.065446 salmon|0.050747 sienna|0.030589 tan|0.026993 pale|0.025603 violet|0.025603 red|0.025603 coral|0.017379 dim|0.011915 gray|0.011915 dim|0.011915 grey|0.011915 gray|0.011307 grey|0.011307 indigo|0.011052 dark|0.010494 gray|0.010494 dark|0.010494 grey|0.010494 dark|0.0098616 salmon|0.0098616 rosy|0.0097499 brown|0.0097499 silver|0.0078272 dark|0.0068473 slate|0.0068473 blue|0.0068473  "
		}
	}
}
