{
	"add": {
		"doc": {
			"id": "4827d58dc8a7a8e2c0c02c14a0482b5737f6d7df3d3702c14edfcb8a9b0449ea",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/25/Oregon_Territory_Capital_building.jpg/220px-Oregon_Territory_Capital_building.jpg",
			"previous": [],
				"after": "The land developed for the permanent capitol buildings was Salem block 84, sold to the state for this purpose by pioneer and Salem founder W. H. Willson.[6] Construction of the first capitol building began in 1854,[7] shortly after Congress confirmed Salem as the capital city. However, with the capital moving to Corvallis the next year, construction was temporarily halted. After the capital's return to Salem, the building was nearly completed by late 1855.[7] This territorial capitol, of Greek Revival-style,[8] stood 50 feet (15 m) wide and 75 feet (23 m) long (15 by 23 m), with a stone facade and a 10-foot (3 m) portico. Built of native ashlar blocks, the exterior walls, two stories high, ranged in color from a deep sky blue to white. The first floor was 19 feet (5.8 m) tall and the second 15 feet (4.6 m) tall with an eight-foot (2.4 m) entablature. The building was decorated with four Ionic columns on the front (west) end. The building housed a variety of rooms, including a federal courthouse with a chamber measuring 20 by 27 feet (6 by 8 m) and an executive office of 18 by 20 ft (5.5 by 6 m) on the first floor. Also on the first floor was the House chamber, measuring 36 by 46 feet (11 by 14 m) and having three entrances. The first floor also held the main hall, which included an entrance 15 feet (5 m) wide. On the second floor was the Senate chamber, 26 by 36 feet (8 by 11 m). Additionally, the Territorial Library was housed in a room that was 20 by 36 feet (6 by 11 m). The second story also had a gallery viewing area for the House, three committee rooms, and several rooms for government clerks.[6] The capitol was designed by Captain Charles Bennet, who participated in the discovery of gold at Sutter's Mill in 1848, and construction supervised by William H. Richter at a total cost of $25,000.[9]",
			"color": " "
		}
	}
}
