{
	"add": {
		"doc": {
			"id": "48279945f69fe84d7978fdd79b9c7e442c5cd77cb992d2068148977ca21d6b05",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/HMS_Warrior_%281860%29_bulkhead_armour.jpg/220px-HMS_Warrior_%281860%29_bulkhead_armour.jpg",
				"previous": "The armored cruiser was developed in the 1870s as an attempt to combine the virtues of the armored ironclad warship and the fast and long-ranged, but unarmored, cruisers of the time. Such a ship was desirable to protect overseas trade and, especially for the French and British, to police their vast overseas empires. The concern within higher naval circles was that without ships that could fulfill these requirements and incorporate new technology, their fleet would become obsolete and ineffective should a war at sea arise.[1] Concern over obsolescence in official circles was further fueled by the race between the increasing size of naval guns and of armor strong enough to withstand such fire. In 1860, one of the largest naval cannons in standard use had a bore of 8 inches (203 mm) and fired a 68-pound (31 kg) solid shot or approximately 51 pound spherical shell. By 1884, guns with as wide a bore as 16.25 inches (413 mm), firing an 1,800-pound (816 kg) exploding shell, were being mounted on naval vessels. This gun could penetrate up to 34 inches of wrought iron, the earliest form of naval armor. These were muzzle-loading guns, as had been used on ships from the 1500s. Breech-loading cannon, which were readopted into naval use in the 1870s, were more destructive than muzzle loaders due to their higher rate of fire. The development of rifled cannon, which improved accuracy, and advancements in shells were other factors. Although a cruiser would not likely face the largest-caliber guns of a battleship and many navies commonly used smaller weapons as they did not wear out as fast as larger ones did, cruisers still needed some form of protection to preclude being shot to pieces.[2]",
				"after": "The adoption of rolled iron armor in 1865 and sandwich armor in 1870 gave ships a chance to withstand fire from larger guns. Both these protective schemes used wood as an important component, which made them extremely heavy and limited speed, the key factor in a cruiser's ability to perform its duties satisfactorily.[3] While the first ocean-going ironclads had been launched around 1860, the \"station ironclads\" built for long-range colonial service such as the British Audacious class and French Belliqueuse were too slow, at 13 and 11 knots respectively, to raid enemy commerce or hunt down enemy commerce raiders, tasks usually assigned to frigates or corvettes. Powered by both sail and steam but without the additional weight of armor, these ships could reach speeds of up to 16 or 17 knots. The most powerful among them were the British Inconstant, the U.S. Navy's Wampanoag and the French Duquesne. The British especially had hoped to rely on these vessels to serve the more distant reaches of its empire. In the aftermath of the Battle of Hampton Roads in 1862, where United States wooden warships were defeated by the Confederate ironclad CSS Virginia, the Admiralty realized that its ships could theoretically encounter an ironclad in any theater of operation.[4]",
			"color": "rosy|0.25592 brown|0.25592 dim|0.15244 gray|0.15244 dim|0.15244 grey|0.15244 maroon|0.077365 black|0.073717 brown|0.063962 tan|0.058571 gray|0.056597 grey|0.056597 burly|0.055672 wood|0.055672 dark|0.047836 red|0.047836 sienna|0.044764 dark|0.023246 slate|0.023246 gray|0.023246  "
		}
	}
}
