{
	"add": {
		"doc": {
			"id": "4828863103a285e922e0429e4d37807f3a19a1e8b1dbd239f49401401950c325",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/May_2010_179_crop%2C_rotate.jpg/220px-May_2010_179_crop%2C_rotate.jpg",
				"previous": "The original house built in the 1850s is L-shaped. According to the architectural drawings made for the HABS, the bottom of the L is 60 feet 4 inches (18.39 m) north–south by 35 feet 8 inches (10.87 m) east–west. In 1935 the ground floor of this part of the house included the main door and entrance hall, living room, parlor, library, and stairs. The main entrance is on the west side, which has a porch 60 feet 4 inches (18.39 m) wide by 12 feet (3.7 m) deep, supported by pairs of square pillars with stairs on the north, south, and west sides. The top of the L is 24 feet 2 inches (7.37 m) north–south by 40 feet 6 inches (12.34 m) east–west, and in 1935 the ground floor of the top of the L had the dining room, gun room, \"brush up room\", toilet, stairs, and a passage to the 1913 addition.[7] The inside corner of the L has a two-story covered porch along the south side, and an open terrace on the east side's ground floor. In 1935 the second story of the original house had four bedrooms and a bathroom in the lower part of the L and two bedrooms and a bath in the upper part, as well as two staircases and hallways.[2][7]",
				"after": "The mansion's stone walls are 2 feet (0.6 m) thick; the individual building stones are \"field sandstone about 17 inches square, of various thicknesses\" (17 inches is 43 cm).[7] There is a basement below the original house. The lower part of the L is five bays by two bays; the original double-hung sash windows in each bay of the 1850s house have six panes of glass per sash. All the original windows have shutters, these are paneled on the first floor and louvered on the second. The main door is in the Federal style with a large fanlight above the door and sidelights on either side. The attic in the 1850s part of the house is not finished, and the gable roof has \"boxed cornices with returns\".[2][7]",
			"color": "gray|0.18914 grey|0.18914 dark|0.165 gray|0.165 dark|0.165 grey|0.165 silver|0.085639 black|0.079031 dim|0.076766 gray|0.076766 dim|0.076766 grey|0.076766 light|0.063376 gray|0.063376 light|0.063376 grey|0.063376 gainsboro|0.053978 dark|0.034519 slate|0.034519 gray|0.034519 white|0.031018 smoke|0.031018 sea|0.024472 shell|0.024472 snow|0.023297 ghost|0.02087 white|0.02087 linen|0.020054 white|0.020012 mint|0.019768 cream|0.019768 floral|0.019651 white|0.019651 alice|0.019478 blue|0.019478 azure|0.01471 lavender|0.013247 blush|0.013247 slate|0.0072723 gray|0.0072723 old|0.0057703 lace|0.0057703 light|0.0054261 slate|0.0054261 gray|0.0054261 ivory|0.0034971  "
		}
	}
}
