{
	"add": {
		"doc": {
			"id": "482c0124d75e0bc746054c9004583fc17581e6a825008e21372d4b56b1f785aa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Czech_Airlines_Airbus_A330_OK-YBA_02.JPG/220px-Czech_Airlines_Airbus_A330_OK-YBA_02.JPG",
				"previous": "Since its transformation to a joint stock company in August 1992 ČSA never paid dividends. The sale of a minority share to Air France was a fiasco leading to withdrawal of the French airline, subsequently Antonín Jakubše and Miroslav Kůla managed to stabilise the company and gradually enlarge its fleet.[13] In September 2003 Miroslav Kůla was fired. New CEO, ex-minister Jaroslav Tvrdík, agreed with the unions to increase wages by a third and announced \"unprecedented\" enlargement of the fleet.[14][15] In 2005 the financial situation sharply deteriorated. Even though sale of two ATR planes improved the operating result by CZK 198 million, the operating loss was almost half a billion Czech crowns and the Government of Jiří Paroubek replaced Jaroslav Tvrdík with Radomír Lašák. The airline generated further operating losses, profit CZK 2.1 bn from sale of almost all real estate and profit CZK 1.2 bn from sales of planes were not sufficient to offset them. In 2005-2010 ČSA generated operating loss CZK 3.4 bn, without the profit from sale of long term assets the operating loss would be two times higher. The gross margin did not even cover the personnel expenses.[16]",
			"after": [
				"The Czech Airlines fleet consists of the following aircraft (as of April 2014):",
				"At October 2013, the average age of the Czech Airlines fleet is 8.5 years.[17]"
			],
			"color": "dim|0.16664 gray|0.16664 dim|0.16664 grey|0.16664 dark|0.14884 olive|0.14884 green|0.14884 gray|0.14189 grey|0.14189 dark|0.095613 gray|0.095613 dark|0.095613 grey|0.095613 slate|0.065207 gray|0.065207 light|0.046058 slate|0.046058 gray|0.046058 silver|0.038034 light|0.025514 gray|0.025514 light|0.025514 grey|0.025514 gainsboro|0.023314 white|0.019188 smoke|0.019188 sea|0.015835 shell|0.015835 snow|0.015566 black|0.015141 ghost|0.014208 white|0.014208 white|0.014035 floral|0.01333 white|0.01333 mint|0.012975 cream|0.012975 alice|0.012635 blue|0.012635 azure|0.010965 linen|0.010635 lavender|0.010242 blush|0.010242  "
		}
	}
}
