{
	"add": {
		"doc": {
			"id": "48304515266fbe0bf3c3e27271081df30a29085651ed4dafa0b46c472bfe9f94",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/View_from_South_City_Mall.jpg/120px-View_from_South_City_Mall.jpg",
				"previous": "Portal:Geography/Featured article/6",
				"after": "Kolkata, formerly known as Calcutta, is the capital of the Indian state of West Bengal. Located on the east bank of the Hooghly river, it is the principal commercial, cultural, and educational centre of East India. The Port of Kolkata is India's oldest operating port as well as its sole major riverine port. As of 2011, the city had 4.5 million residents; the urban agglomeration, which comprises the city and its suburbs, was home to approximately 14.1 million, making it the third-most populous metropolitan area in India. In the late 17th century, the three villages that predated Kolkata were ruled by the Nawab of Bengal under Mughal suzerainty. After the Nawab granted the East India Company a trading license in 1690, the area was developed by the Company into an increasingly fortified mercantile base. Under East India Company and later under the British Raj, Kolkata served as the capital of India until 1911, when its perceived geographical disadvantages, combined with growing nationalism in Bengal, led to a shift of the capital to New Delhi. Following Indian independence in 1947, Kolkata—which was once the centre of modern Indian education, science, culture, and politics—witnessed several decades of relative economic stagnation. Since the early 2000s, it has undergone an economic rejuvenation.",
			"color": "dim|0.22109 gray|0.22109 dim|0.22109 grey|0.22109 gray|0.1596 grey|0.1596 dark|0.14819 gray|0.14819 dark|0.14819 grey|0.14819 black|0.14003 slate|0.10338 gray|0.10338 light|0.076048 slate|0.076048 gray|0.076048 dark|0.06712 slate|0.06712 gray|0.06712 silver|0.044856 light|0.01132 gray|0.01132 light|0.01132 grey|0.01132 rosy|0.0075775 brown|0.0075775 gainsboro|0.0052368  "
		}
	}
}
