{
	"add": {
		"doc": {
			"id": "483590c87971eb48c51338a16becc403db17f68235b475a81a41579c8d942e25",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/PIT_US_Airways.JPG/220px-PIT_US_Airways.JPG",
			"previous": [],
				"after": "In late 2003-early 2004, US Airways lobbied for lower operating fees at Pittsburgh International Airport, citing its economies of scale as the primary carrier and largest tenant at the airport. US Airways attempted to leverage its adverse cash position and \"red ink\" in the years following 9/11 to negotiate better financial terms with the airport. The Allegheny County Airport Authority rejected US Airways' demands for reduced landing fees and lower lease payments, in part due to antitrust and FAA regulations that required the airport operator to extend the same financial terms to all carriers if it accepted US Airways' demands. US Airways threatened to move traffic to rival hubs in Philadelphia and Charlotte, and the airline made good on its threat in November 2004, reducing its flights at Pittsburgh International Airport from primary-hub to secondary-hub status. This action also resulted in the closing of the commuter terminal, also known as concourse E. The airline, led by former ExpressJet Airlines CEO David N. Siegel, continued to demote Pittsburgh International Airport in subsequent years until it became only a focus city airport for the company.[39] As of 2010, Pittsburgh is no longer listed as a US Airways focus city.[40] US Airways now operates an average of only 39 departures a day exclusively to domestic destinations, compared to 2001 when it was a hub with 500+ flights a day with service across the United States and to Europe.[41]",
			"color": "dark|0.57436 gray|0.57436 dark|0.57436 grey|0.57436 gray|0.21499 grey|0.21499 dim|0.056846 gray|0.056846 dim|0.056846 grey|0.056846 silver|0.050296 slate|0.046463 gray|0.046463 light|0.033659 slate|0.033659 gray|0.033659 black|0.013137 light|0.0045867 gray|0.0045867 light|0.0045867 grey|0.0045867 dark|0.003013 slate|0.003013 gray|0.003013  "
		}
	}
}
