{
	"add": {
		"doc": {
			"id": "483c3aa6ad265f1307bc9e0bfb58c09d653e1ff0ac1a736392b9561101e18f0a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/William_Hogarth_-_Gin_Lane.jpg/220px-William_Hogarth_-_Gin_Lane.jpg",
				"previous": "Unlike the former constables, the police were recruited widely and financed by a levy on ratepayers; so they were initially disliked. The force took until the mid-19th century to be established in the East End. Unusually, Joseph Sadler Thomas, a Metropolitan Police superintendent of 'F' (Covent Garden) Division appears to have mounted the first local investigation (in Bethnal Green), in November 1830 of the London Burkers.[113] In 1841, a specific Dockyard division of the Metropolitan force was formed to assume responsibility for shore patrols within the docks,[114] a detective department was formed in 1842, and in 1865, 'J' division was established in Bethnal Green.[112]",
				"after": "One of the East End industries that serviced ships moored off the Pool of London was prostitution, and in the 17th century, this was centred on the Ratcliffe Highway, a long street lying on the high ground above the riverside settlements. In 1600, it was described by the antiquarian John Stow as 'a continual street, or filthy straight passage, with alleys of small tenements or cottages builded, inhabited by sailors and victuallers.' Crews were 'paid off' at the end of a long voyage, and would spend their earnings on drink in the local taverns.[115]",
			"color": "black|0.32412 dim|0.2093 gray|0.2093 dim|0.2093 grey|0.2093 gray|0.1117 grey|0.1117 dark|0.070228 gray|0.070228 dark|0.070228 grey|0.070228 silver|0.039624 antique|0.030265 white|0.030265 light|0.022895 gray|0.022895 light|0.022895 grey|0.022895 linen|0.022738 old|0.021218 lace|0.021218 beige|0.019879 floral|0.016466 white|0.016466 ivory|0.016087 gainsboro|0.015062 papaya|0.014998 whip|0.014998 sea|0.014171 shell|0.014171 corn|0.01372 silk|0.01372 honeydew|0.0083974  "
		}
	}
}
