{
	"add": {
		"doc": {
			"id": "484dad27ac95d12eb3f60ed41e2cacacf35c1131df5c229020a3d2403033739c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Baptism_Jar_%28Portuguese_period%29.JPG/220px-Baptism_Jar_%28Portuguese_period%29.JPG",
				"previous": "The liturgy of baptism for Catholics, Eastern Orthodox, Lutheran, Anglican, and Methodist makes clear reference to baptism as not only a symbolic burial and resurrection, but an actual supernatural transformation, one that draws parallels to the experience of Noah and the passage of the Israelites through the Red Sea divided by Moses. Thus, baptism is literally and symbolically not only cleansing, but also dying and rising again with Christ. Catholics believe that baptism is necessary for the cleansing of the taint of original sin, and for that reason infant baptism is a common practice. The Eastern Churches (Eastern Orthodox Church and Oriental Orthodoxy) also baptize infants on the basis of texts, such as Matthew 19:14, which are interpreted as supporting full Church membership for children. In these denominations, baptism is immediately followed by Chrismation and Communion at the next Divine Liturgy, regardless of age. Orthodox likewise believe that baptism removes what they call the ancestral sin of Adam.[107] Anglicans believe that Baptism is also the entry into the Church and therefore allows them access to all rights and responsibilities as full members, including the privilege to receive Holy Communion. Most Methodists and Anglicans agree that it also cleanses the taint of what in the West is called original sin, in the East ancestral sin.",
				"after": "Eastern Orthodox Christians usually insist on complete threefold immersion as both a symbol of death and rebirth into Christ, and as a washing away of sin. Latin Church Catholics generally baptize by affusion (pouring); Eastern Catholics usually by submersion, or at least partial immersion. However, submersion is gaining in popularity within the Latin Catholic Church. In newer church sanctuaries, the baptismal font may be designed to expressly allow for baptism by immersion.[citation needed] Anglicans baptize by submersion, immersion, affusion or sprinkling.",
			"color": "black|0.41619 dark|0.19594 gray|0.19594 dark|0.19594 grey|0.19594 silver|0.077621 gray|0.039481 grey|0.039481 powder|0.034409 blue|0.034409 beige|0.034331 light|0.031323 gray|0.031323 light|0.031323 grey|0.031323 light|0.028697 blue|0.028697  "
		}
	}
}
