{
	"add": {
		"doc": {
			"id": "484eb960309a3a604f209e4b039e312986d2d4346e0dc2c0842a0d0efab390a3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Fryderyk_Chopin.jpg/170px-Fryderyk_Chopin.jpg",
				"previous": "To forestall the rise of a new generation of educated Poles, German officials decreed that the schooling of Polish children would be limited to a few years of elementary education. Reichsführer-SS Heinrich Himmler wrote, in a memorandum of May 1940: \"The sole purpose of this schooling is to teach them simple arithmetic, nothing above the number 500; how to write one's name; and the doctrine that it is divine law to obey the Germans .... I do not regard a knowledge of reading as desirable.\"[22][37] Hans Frank echoed him: \"The Poles do not need universities or secondary schools; the Polish lands are to be converted into an intellectual desert.\"[2] The situation was particularly dire in the former Polish territories beyond the General Government, which had been annexed to the Third Reich.[38] The specific policy varied from territory to territory, but in general, there was no Polish-language education at all. German policy constituted a crash-Germanization of the populace.[38][39][40] Polish teachers were dismissed, and some were invited to attend \"orientation\" meetings with the new administration, where they were either summarily arrested or executed on the spot.[38] Some Polish schoolchildren were sent to German schools, while others were sent to special schools where they spent most of their time as unpaid laborers, usually on German-run farms; speaking Polish brought severe punishment.[38] It was expected that Polish children would begin to work once they finished their primary education at age 12 to 15.[40] In the eastern territories not included in the General Government (Bezirk Bialystok, Reichskommissariat Ostland and Reichskommissariat Ukraine) many primary schools were closed, and most education was conducted in non-Polish languages such as Ukrainian, Belorussian, and Lithuanian.[38] In the Bezirk Bialystok region, for example, 86% of the schools that had existed before the war were closed down during the first two years of German occupation, and by the end of the following year that figure had increased to 93%.[38]",
				"after": "The state of Polish primary schools was somewhat better in the General Government,[38] though by the end of 1940, only 30% of prewar schools were operational, and only 28% of prewar Polish children attended them.[41] A German police memorandum of August 1943 described the situation as follows:",
			"color": "black|0.30914 dim|0.096386 gray|0.096386 dim|0.096386 grey|0.096386 gray|0.07524 grey|0.07524 light|0.074468 gray|0.074468 light|0.074468 grey|0.074468 gainsboro|0.068294 dark|0.067385 gray|0.067385 dark|0.067385 grey|0.067385 silver|0.062433 linen|0.036738 white|0.035762 smoke|0.035762 sea|0.030032 shell|0.030032 floral|0.024924 white|0.024924 snow|0.02327 old|0.022127 lace|0.022127 mint|0.021573 cream|0.021573 white|0.017988 ivory|0.012719 azure|0.0074555 ghost|0.0051117 white|0.0051117 alice|0.0042547 blue|0.0042547 honeydew|0.0037593  "
		}
	}
}
