{
	"add": {
		"doc": {
			"id": "485148f04ea5bc481733dd8d89d0b4a0266e76de37002626fe586abfbe5d6334",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/HMS_Eagle_at_Alexandria_Dec_1940.jpg/220px-HMS_Eagle_at_Alexandria_Dec_1940.jpg",
				"previous": "When World War Two began the following month, the ship had just completed her refit in Singapore. She put to sea a few days later and began searching for German merchant ships in company with the light cruiser Birmingham and escorted by the destroyer Daring. A Swordfish discovered the freighter SS Franken south of the port of Padang on Sumatra and Birmingham was ordered to intercept it while Eagle continued her air patrols. She arrived in Colombo, Ceylon, on 10 September and until 5 October she searched the Indian Ocean between the west coast of India and the Maldive Islands with the light cruiser Liverpool for German ships. Eagle was then assigned to Force I together with the heavy cruisers Cornwall and Dorsetshire, to search the Indian Ocean for the pocket battleship Admiral Graf Spee and other German commerce raiders. In mid-December her boilers and bottom were cleaned during a period of maintenance in Durban, South Africa.[31]",
				"after": "Eagle continued to patrol the Indian Ocean in 1940, but escorted a large Australian troop convoy to Suez early in the year. While in the vicinity of the Nicobar Islands on 14 March, a 250 lb (110 kg) bomb accidentally exploded, killing 14 men. The damage to the ship was mostly confined to the bomb magazines, although two generators were knocked out. The explosion flashed upwards through the port bomb lift and ignited the wing on one Swordfish stowed in the hangar. All but four of the aircraft were damaged by the corrosive salt-water spray system when the fire was doused. She was repaired at Singapore between 15 March and 9 May when the ship sailed for Colombo en route to the Mediterranean, which she reached on 26 May. In June three crated Gloster Sea Gladiators were found in storage at Dekheila and these aircraft became the only fighters available for the entire fleet in the Eastern Mediterranean.[32]",
			"color": " "
		}
	}
}
