{
	"add": {
		"doc": {
			"id": "4853ce6cff7b895083cf92ba3207dbf4b9b00db313ebacdd22bb7e3049b3612e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Reichsgesetzblatt34_1878.jpg/220px-Reichsgesetzblatt34_1878.jpg",
				"previous": "According to Angela Vogel and Hartmut Rübner, Carl Hillmann, a typesetter and prominent trade unionist in the 1870s, was the \"intellectual father\" of the localist and anarcho-syndicalist movement. Vogel's and Rübner's claim is based on the fact that Hillmann was the first in Germany to consider unions' primary role to be the creation of the conditions for a socialist revolution, not simply to improve workers' living conditions. He also advocated a de-centralized trade union federation structure. Many of the later anarcho-syndicalists including Rudolf Rocker agree with this notion. Hans Manfred Bock, on the other hand, sees no evidence for Hillmann's influence on the FVdG.[5]",
				"after": "From 1878 to 1890, the Anti-Socialist Laws forbade all socialist trade unions. Only small local organizations, which communicated via intermediaries such as stewards, who worked illegally or semi-legally, survived. This form of organization was easier to protect against state repression.[6] After the laws were sunset in 1890, the General Commission of the Trade Unions of Germany was founded on November 17 at a conference in Berlin to centralize the socialist labor movement. In 1892, the Trade Union Congress of Halberstadt was held to organize the many local unions under the committee.[7] The localists, 31,000 of whom were represented at the congress,[8] wanted to retain many of the changes that had been adopted during the repressive period. For example, they opposed separate organizations for political and economic matters, such as the party and the trade union.[9] They especially wanted to keep their grassroots democratic structures. They also advocated local trade unions being networked by delegates rather than ruled centrally, and were wary of bureaucratic structures.[10] The localists' proposals were rejected at the Halberstadt congress, so they refused to join the centralized trade unions, which became known as the Free Trade Unions. They did not renounce social democracy, but rather considered themselves to be an avant-garde within the social democratic movement in Germany.[11]",
			"color": " "
		}
	}
}
