{
	"add": {
		"doc": {
			"id": "4857b341a92a85d1ed8b0b16518aa01f4b7d508d974939533a26dd313cf18eff",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Miami_Cathedral_of_Saint_Mary.jpg/250px-Miami_Cathedral_of_Saint_Mary.jpg",
				"previous": "The most common accent throughout Florida is general American English, but there are a variety of English-language accents and dialects in Florida. Southern accents are common in northern Florida, while due to migration patterns, the east coast of Florida has a northeastern accent and the west coast of Florida has a midwestern accent.",
			"after": [
				"In 2010, the three largest denominational groups in Florida were the Catholic Church, the Southern Baptist Convention, and the United Methodist Church.[99]",
				"Florida is mostly Protestant, but Roman Catholicism is the single largest denomination in the state, due in significant part to the state's large Hispanic population. There is also a sizable Jewish community, located mainly in South Florida; this is the largest Jewish population in the South and the third largest in the country behind New York and California.[100] Florida's current religious affiliations include Protestants at 48%, Roman Catholics at 26%, Jews at 3%, Jehovah's Witnesses at 1%, Muslim at 1%, Orthodox at 1%, Buddhists at 0.5% and Hindus at 0.5%. Atheists, deists, and other non-religious people compose 16% of Florida's population.[101]"
			],
			"color": "gray|0.2879 grey|0.2879 dark|0.19448 gray|0.19448 dark|0.19448 grey|0.19448 black|0.12573 tan|0.08205 dim|0.078697 gray|0.078697 dim|0.078697 grey|0.078697 silver|0.038937 steel|0.026596 blue|0.026596 light|0.023981 steel|0.023981 blue|0.023981 light|0.023201 slate|0.023201 gray|0.023201 slate|0.022682 gray|0.022682 light|0.015546 gray|0.015546 light|0.015546 grey|0.015546 dark|0.013795 olive|0.013795 green|0.013795 dark|0.012095 slate|0.012095 gray|0.012095 wheat|0.0087338 gainsboro|0.0079499 corn|0.0065448 flower|0.0065448 blue|0.0065448  "
		}
	}
}
