{
	"add": {
		"doc": {
			"id": "48775decc5902cfaeedf73ecd187f89144e1ce51a5f69b1096eca0f207875396",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/ME-110G-2_at_RAF_Hendon.jpg/220px-ME-110G-2_at_RAF_Hendon.jpg",
				"previous": "Armament also advanced during the war. The rifle-caliber machine guns that were common on prewar fighters could not easily down the more rugged warplanes of the era. Air forces began to replace or supplement them with cannons, which fired explosive shells that could blast a hole in an enemy aircraft—rather than relying on kinetic energy from a solid bullet striking a critical component of the aircraft, such as a fuel line or control cable, or the pilot. Cannons could bring down even heavy bombers with just a few hits, but their slower rate of fire made it difficult to hit fast moving fighters in a dogfight. Eventually, most fighters mounted cannons, sometimes in combination with machine guns.",
				"after": "The British epitomized this shift. Their standard early war fighters mounted eight .303-inch (7.7 mm) calibre machine guns—whereas by mid-war they often featured a combination of machine guns and 20 mm cannons, and late in the war often only cannons. The Americans, in contrast, had problems designing a native cannon design, so instead placed multiple .50 caliber (12.7 mm) heavy machine guns on their fighters. Fighters were also increasingly fitted with bomb racks and air-to-surface ordnance such as bombs or rockets beneath their wings, and pressed into close air support roles as fighter-bombers. Although they carried less ordnance than light and medium bombers, and generally had a shorter range, they were cheaper to produce and maintain and their maneuverability made it easier for them to hit moving targets such as motorized vehicles. Moreover, if they encountered enemy fighters, their ordnance (which reduced lift and increased drag and therefore decreased performance) could be jettisoned and they could engage the enemy fighters, which eliminated the need for fighter escorts that bombers required. Heavily armed and sturdily constructed fighters such as Germany's Focke-Wulf Fw 190, Britain's Hawker Typhoon and Hawker Tempest, and America's P-40, Corsair, P-47 and P-38 all excelled as fighter-bombers, and since the Second World War ground attack has been an important secondary capability of many fighters.",
			"color": "black|0.19045 dim|0.10732 gray|0.10732 dim|0.10732 grey|0.10732 gray|0.096923 grey|0.096923 dark|0.090682 slate|0.090682 gray|0.090682 dark|0.081562 gray|0.081562 dark|0.081562 grey|0.081562 slate|0.078058 gray|0.078058 light|0.068329 slate|0.068329 gray|0.068329 silver|0.044437 light|0.02768 gray|0.02768 light|0.02768 grey|0.02768 light|0.026372 steel|0.026372 blue|0.026372 antique|0.020815 white|0.020815 gainsboro|0.019178 lavender|0.011625 linen|0.0093384 white|0.0087213 smoke|0.0087213 sea|0.0084064 shell|0.0084064 papaya|0.0081375 whip|0.0081375 floral|0.0078926 white|0.0078926 old|0.0078926 lace|0.0078926 alice|0.0071724 blue|0.0071724 tan|0.0070665 beige|0.0069102 snow|0.0068479 ghost|0.0067812 white|0.0067812 white|0.0061465 mint|0.0060997 cream|0.0060997 blanched|0.005646 almond|0.005646  "
		}
	}
}
