{
	"add": {
		"doc": {
			"id": "48798b06c6e8d7e02451327b5bf127965ef0b8d7043d395d9a2a38480f11ccad",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Intcal_13_calibration_curve.png/220px-Intcal_13_calibration_curve.png",
				"previous": "A calibration curve is used by taking the radiocarbon date reported by a laboratory, and reading across from that date on the vertical axis of the graph. The point where this horizontal line intersects the curve will give the calendar age of the sample on the horizontal axis. This is the reverse of the way the curve is constructed: a point on the graph is derived from a sample of known age, such as a tree ring; when it is tested, the resulting radiocarbon age gives a data point for the graph.[28]",
				"after": "Over the next thirty years many calibration curves were published using a variety of methods and statistical approaches.[28] These were superseded by the INTCAL series of curves, beginning with INTCAL98, published in 1998, and updated in 2004, 2009, and 2013. The improvements to these curves are based on new data gathered from tree rings, varves, coral, plant macrofossils, speleothems, and foraminifera. The INTCAL13 data includes separate curves for the northern and southern hemispheres, as they differ systematically because of the hemisphere effect; there is also a separate marine calibration curve.[69] For a set of samples with a known sequence and separation in time such as a sequence of tree rings, the samples' radiocarbon ages form a small subset of the calibration curve. The resulting curve can then be matched to the actual calibration curve by identifying where, in the range suggested by the radiocarbon dates, the wiggles in the calibration curve best match the wiggles in the curve of sample dates. This \"wiggle-matching\" technique can lead to more precise dating than is possible with individual radiocarbon dates.[70] Wiggle-matching can be used in places where there is a plateau on the calibration curve, and hence can provide a much more accurate date than the intercept or probability methods are able to produce.[71] The technique is not restricted to tree rings; for example, a stratified tephra sequence in New Zealand, known to predate human colonization of the islands, has been dated to 1314 AD ± 12 years by wiggle-matching.[72] The wiggles also mean that reading a date from a calibration curve can give more than one answer: this occurs when the curve wiggles up and down enough that the radiocarbon age intercepts the curve in more than one place, which may lead to a radiocarbon result being reported as two separate age ranges, corresponding to the two parts of the curve that the radiocarbon age intercepted.[28]",
			"color": "light|0.80907 steel|0.80907 blue|0.80907 lavender|0.10618 steel|0.045369 blue|0.045369 light|0.017958 blue|0.017958 gainsboro|0.015438  "
		}
	}
}
