{
	"add": {
		"doc": {
			"id": "4882eb4a30f50cf4aa75b12c0e588d1ae8da44265f38e0fd9e36081cce90ca42",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Deinonychus_Steveoc.jpg/220px-Deinonychus_Steveoc.jpg",
			"previous": [],
				"after": "The identification, in 2000, of a probable Deinonychus egg associated with one of the original specimens allowed comparison with other theropod dinosaurs in terms of egg structure, nesting, and reproduction. In their 2006 examination of the specimen, Grellet-Tinner and Makovicky examined the possibility that the dromaeosaurid had been feeding on the egg, or that the egg fragments had been associated with the Deinonychus skeleton by coincidence. They dismissed the idea that the egg had been a meal for the theropod, noting that the fragments were sandwiched between the belly ribs and forelimb bones, making it impossible that they represented contents of the animal's stomach. In addition, the manner in which the egg had been crushed and fragmented indicated that it had been intact at the time of burial, and was broken by the fossilization process. The idea that the egg was randomly associated with the dinosaur was also found to be unlikely; the bones surrounding the egg had not been scattered or disarticulated, but remained fairly intact relative to their positions in life, indicating that the area around and including the egg was not disturbed during preservation. The fact that these bones were belly ribs (gastralia), which are very rarely found articulated, supported this interpretation. All the evidence, according to Grellet-Tinner and Makovicky, indicates that the egg was intact beneath the body of the Deinonychus when it was buried. It is possible that this represents brooding or nesting behavior in Deinonychus similar to that seen in the related troodontids and oviraptorids, or that the egg was in fact inside the oviduct when the animal died.[23]",
			"color": "light|0.19916 gray|0.19916 light|0.19916 grey|0.19916 gainsboro|0.18081 dim|0.13325 gray|0.13325 dim|0.13325 grey|0.13325 white|0.11711 smoke|0.11711 silver|0.085011 gray|0.08374 grey|0.08374 dark|0.057849 gray|0.057849 dark|0.057849 grey|0.057849 linen|0.053591 lavender|0.020923 blush|0.020923 alice|0.018529 blue|0.018529 ghost|0.014835 white|0.014835 sea|0.010723 shell|0.010723 snow|0.0095514 white|0.0058305 mint|0.0041316 cream|0.0041316  "
		}
	}
}
