{
	"add": {
		"doc": {
			"id": "48884b1c9f44d00e70e5bebd089fd14d2ae81c69a95850632daf64747b2efe26",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/MargaretFullerHouseJuly2008.jpg/220px-MargaretFullerHouseJuly2008.jpg",
			"previous": [],
				"after": "Sarah Margaret Fuller was born May 23, 1810,[1] in Cambridgeport, Massachusetts, the first child of Timothy Fuller and Margaret Crane Fuller. She was named after her paternal grandmother and her mother; by the age of nine, however, she dropped \"Sarah\" and insisted on being called \"Margaret\".[2] The Margaret Fuller House, in which she was born, is still standing. Her father taught Fuller to read and write at the age of three and a half, shortly after the couple's second daughter, Julia Adelaide, died at the age of fourteen months.[3] He offered her an education as rigorous as any boy's at the time and forbade her from reading the typical feminine fare of the time, such as etiquette books and sentimental novels.[4] He incorporated Latin into his teaching shortly after the birth of the couple's son, Eugene, in May 1815, and soon Margaret was translating simple passages from Virgil.[5] Later in life Margaret blamed her father's exacting love and his valuation of accuracy and precision for her childhood nightmares and sleepwalking.[6] During the day, Margaret spent time with her mother, who taught her household chores and sewing.[7] In 1817, her brother William Henry Fuller was born, and her father was elected as a representative in the United States Congress. For the next eight years, he spent four to six months a year in Washington, D.C.[8] At the age of 10, Fuller wrote a cryptic note which her father saved: \"On 23 May 1810, was born one foredoomed to sorrow and pain, and like others to have misfortunes.\"[9]",
			"color": "black|0.26407 dim|0.21941 gray|0.21941 dim|0.21941 grey|0.21941 gray|0.10191 grey|0.10191 dark|0.056582 slate|0.056582 gray|0.056582 dark|0.035019 gray|0.035019 dark|0.035019 grey|0.035019 antique|0.032693 white|0.032693 slate|0.028725 gray|0.028725 light|0.020883 slate|0.020883 gray|0.020883 tan|0.019507 blanched|0.018964 almond|0.018964 silver|0.018941 dark|0.018729 olive|0.018729 green|0.018729 papaya|0.018016 whip|0.018016 bisque|0.017899 light|0.013484 gray|0.013484 light|0.013484 grey|0.013484 linen|0.011744 beige|0.011385 old|0.011077 lace|0.011077 wheat|0.010659 gainsboro|0.0097568 corn|0.009349 silk|0.009349 floral|0.0064939 white|0.0064939  "
		}
	}
}
