{
	"add": {
		"doc": {
			"id": "488e38df8e5ac0353918fc483daa3978f34a0483b3b9f50c65303f1a2a6a84d7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/LCST-UCST_plot.svg/350px-LCST-UCST_plot.svg.png",
			"previous": [],
				"after": "In general, polymeric mixtures are far less miscible than mixtures of small molecule materials. This effect results from the fact that the driving force for mixing is usually entropy, not interaction energy. In other words, miscible materials usually form a solution not because their interaction with each other is more favorable than their self-interaction, but because of an increase in entropy and hence free energy associated with increasing the amount of volume available to each component. This increase in entropy scales with the number of particles (or moles) being mixed. Since polymeric molecules are much larger and hence generally have much higher specific volumes than small molecules, the number of molecules involved in a polymeric mixture is far smaller than the number in a small molecule mixture of equal volume. The energetics of mixing, on the other hand, is comparable on a per volume basis for polymeric and small molecule mixtures. This tends to increase the free energy of mixing for polymer solutions and thus make solvation less favorable. Thus, concentrated solutions of polymers are far rarer than those of small molecules.",
			"color": "white|0.070597 smoke|0.070597 white|0.069128 snow|0.068921 mint|0.068872 cream|0.068872 sea|0.068264 shell|0.068264 ghost|0.068027 white|0.068027 alice|0.067871 blue|0.067871 floral|0.066757 white|0.066757 azure|0.066626 lavender|0.061835 blush|0.061835 dark|0.054063 gray|0.054063 dark|0.054063 grey|0.054063 gray|0.050833 grey|0.050833 dim|0.043027 gray|0.043027 dim|0.043027 grey|0.043027 silver|0.038864 black|0.033823 light|0.025844 gray|0.025844 light|0.025844 grey|0.025844 aqua|0.015351 marine|0.015351 gainsboro|0.01308 dark|0.0084233 salmon|0.0084233 misty|0.0082525 rose|0.0082525 light|0.0077555 cyan|0.0077555 ivory|0.0070248 linen|0.0060624 honeydew|0.003584 light|0.0033173 salmon|0.0033173  "
		}
	}
}
