{
	"add": {
		"doc": {
			"id": "4899bbb0f73bb7431bee79d73ac67b3621af0018fb338f10aa4b06787f33ed76",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Platipus-on-the-surface.jpg/220px-Platipus-on-the-surface.jpg",
				"previous": "Although the platypus' eyes are small and not used under water, several features indicate that vision played an important role in its ancestors. The corneal surface and the adjacent surface of the lens is flat while the posterior surface of the lens is steeply curved, similar to the eyes of other aquatic mammals such as otters and sea-lions. A temporal (ear side) concentration of retinal ganglion cells, important for binocular vision, indicates a role in predation, while the accompanying visual acuity is insufficient for such activities. Furthermore, this limited acuity is matched by a low cortical magnification, a small lateral geniculate nucleus and a large optic tectum, suggesting that the visual midbrain plays a more important role than the visual cortex like in some rodents. These features suggest that the platypus has adapted to an aquatic and nocturnal lifestyle, developing its electrosensory system at the cost of its visual system; an evolutionary process paralleled by the small number of electroreceptors in the short-beaked echidna, who dwells in dry environments, whilst the long-beaked echidna, who lives in moist environments, is intermediate between the other two monotremes.[34]",
				"after": "The platypus is semiaquatic, inhabiting small streams and rivers over an extensive range from the cold highlands of Tasmania and the Australian Alps to the tropical rainforests of coastal Queensland as far north as the base of the Cape York Peninsula.[40] Inland, its distribution is not well known; it is extinct in South Australia (apart from an introduced population on Kangaroo Island)[41] and is no longer found in the main part of the Murray-Darling Basin, possibly due to the declining water quality brought about by extensive land clearing and irrigation schemes.[42] Along the coastal river systems, its distribution is unpredictable; it appears to be absent from some relatively healthy rivers, and yet maintains a presence in others that are quite degraded (the lower Maribyrnong, for example).[43]",
			"color": "dim|0.21962 gray|0.21962 dim|0.21962 grey|0.21962 gray|0.11532 grey|0.11532 dark|0.11416 gray|0.11416 dark|0.11416 grey|0.11416 light|0.087826 steel|0.087826 blue|0.087826 silver|0.062693 lavender|0.054482 light|0.042632 gray|0.042632 light|0.042632 grey|0.042632 light|0.040528 slate|0.040528 gray|0.040528 slate|0.039954 gray|0.039954 gainsboro|0.034528 alice|0.026044 blue|0.026044 ghost|0.024166 white|0.024166 white|0.022655 smoke|0.022655 snow|0.017638 lavender|0.016887 blush|0.016887 white|0.016335 azure|0.014732 mint|0.013038 cream|0.013038 sea|0.011836 shell|0.011836 floral|0.0098878 white|0.0098878  "
		}
	}
}
