{
	"add": {
		"doc": {
			"id": "48a951cb687dd52ed3ededee9fedd689e8bde4e7366453d162e8014d1dd76f51",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/8/80/Astro_Orbiter_Tower.jpg/250px-Astro_Orbiter_Tower.jpg",
			"previous": [],
				"after": "The second Tomorrowland opened on October 1, 1971 at the Magic Kingdom in the Walt Disney World Resort, Florida, and, like at Disneyland, was opened unfinished. On opening day, only two attractions opened: the Grand Prix Raceway, and the Skyway to Fantasyland. Tomorrowland was noted for being very barren and sterile at this time, due to the land being very flat and undetailed. A large wall was located past the two large show buildings, and stretched all the way to where the Carousel of Progress is now, which used to be a large food court. It was outside and was removed within two years. Tomorrowland Terrace was, and is the largest restaurant in the Magic Kingdom despite the name change in 1994. America the Beautiful opened in November, and Flight to the Moon opened late on Christmas Eve, 1971, due to technical problems. The south show building received an expansion in 1972, which would house If You Had Wings. The south building would be further expanded in 1973, opening the Plaza Pavilion (now called Tomorrowland Terrace). In 1973, the plans for Tomorrowland were finalized; and for about two years, construction was a common sight. Star Jets, and the Space Bar opened in 1974. The next year, Space Mountain and The Carousel of Progress opened on January 15. A railroad station was planned to open, next to Space Mountain, but the concept never came to be due to a congestion of people exiting Space Mountain. In June, the second version of the WEDWay Peoplemover would open. This Peoplemover bore resemblance to Disneyland's, but was different, in that it used linear induction motors. This Tomorrowland somewhat resembled Disneyland's Tomorrowland at the time, with large white clean buildings. Large waterfalls and monoliths greeted the guests as they entered this land. In 1983, the waterfalls were decommissioned due to the slightest winds sending water everywhere, and a mural was placed on the monoliths. In the early 90s, the colors on the outside were changed from soft pastel colors to bright reds, yellows and blues. In 1989, If You Had Wings was closed due to Eastern Airlines going out of business, and Delta Dreamflight opened.",
			"color": "gray|0.16481 grey|0.16481 dark|0.14083 gray|0.14083 dark|0.14083 grey|0.14083 silver|0.12425 black|0.1234 dim|0.10111 gray|0.10111 dim|0.10111 grey|0.10111 light|0.056063 gray|0.056063 light|0.056063 grey|0.056063 slate|0.045911 gray|0.045911 light|0.037434 steel|0.037434 blue|0.037434 gainsboro|0.032443 steel|0.025068 blue|0.025068 light|0.022098 slate|0.022098 gray|0.022098 saddle|0.011565 brown|0.011565 burly|0.0076688 wood|0.0076688 white|0.0073954 smoke|0.0073954 linen|0.0066628 sea|0.0062285 shell|0.0062285 dark|0.0055071 slate|0.0055071 gray|0.0055071 floral|0.0051204 white|0.0051204 tan|0.004927 snow|0.004891 lavender|0.0039294 blush|0.0039294  "
		}
	}
}
