{
	"add": {
		"doc": {
			"id": "48b3735c6c0b59c7b477ee3f91700e7357816939c34fa851fb0ad3eec2c11e50",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Mappa_di_Eratostene.jpg/220px-Mappa_di_Eratostene.jpg",
			"previous": [
				"",
				"Seventeen hundred years after Eratosthenes' death, while Christopher Columbus studied what Eratosthenes had written about the size of the Earth, he chose to believe that the Earth's circumference was much smaller. Had Columbus set sail knowing that Eratosthenes' larger circumference value was more accurate, he would have known that the place where he made landfall was not Asia, but rather a New World.[18]"
			],
				"after": "Eratosthenes continued from his knowledge about the Earth, his discoveries of its size and shape, and began to sketch it. In the Library of Alexandria he had access to various travel books, which contained various items of information and representations of the world that needed to be pieced together in some organized format.[19] In his three-volume work Geography (Greek: Geographika), he described and mapped his entire known world, even dividing the Earth into five climate zones:[20] two freezing zones around the pole, two temperate zones, and a zone encompassing the equator and the tropics.[21] He had invented geography. He created terminology that is still used today. He placed grids of overlapping lines over the surface of the Earth. He used parallels and meridians to link together every place in the world. It was now possible to estimate one's distance from remote locations with this network over the surface of the Earth. In the Geography the names of over 400 cities and their locations were shown: this had never been achieved before.[3] Unfortunately, his Geography has been lost to history, but fragments of the work can be pieced together from other great historians like Pliny, Polybius, Strabo, and Marcianus.",
			"color": "peach|0.13457 puff|0.13457 bisque|0.12096 blanched|0.10126 almond|0.10126 tan|0.095586 papaya|0.084426 whip|0.084426 antique|0.077717 white|0.077717 wheat|0.074618 corn|0.053716 silk|0.053716 beige|0.042 old|0.034679 lace|0.034679 moccasin|0.033349 burly|0.03314 wood|0.03314 light|0.0282 yellow|0.0282 navajo|0.023168 white|0.023168 light|0.019867 golden|0.019867 rod|0.019867 yellow|0.019867 linen|0.013771 lemon|0.011905 chiffon|0.011905 ivory|0.011594 floral|0.0040515 white|0.0040515  "
		}
	}
}
