{
	"add": {
		"doc": {
			"id": "48bb9ee2d9e5e5b3f585b69c35ad9f8ddae841b69d91d7d8c35d030be2c1635d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/University_of_Glasgow_Gilbert_Scott_Building_-_Feb_2008-2.jpg/200px-University_of_Glasgow_Gilbert_Scott_Building_-_Feb_2008-2.jpg",
			"previous": [],
				"after": "The French Gothic revival was set on sounder intellectual footings by a pioneer, Arcisse de Caumont, who founded the \"Societé des Antiquaires de Normandie\" at a time when \"antiquaire\" still meant a connoisseur of antiquities, and who published his great work on architecture in French Normandy in 1830 (Summerson 1948). The following year Victor Hugo's historical romance novel \"Hunchback of Notre Dame\" appeared, in which the great Gothic cathedral of Paris was at once a setting and a protagonist in a hugely popular work of fiction. Hugo intended his book to awaken a concern for the surviving Gothic architecture left in Europe, however, rather than to initiate a craze for neo-Gothic in contemporary life. In the same year that \"Notre-Dame de Paris\" appeared, the new French restored Bourbon monarchy established an office in the Royal French Government of \"Inspector-General of Ancient Monuments\", a post which was filled in 1833 by Prosper Merimée, who became the secretary of a new \"Commission des Monuments Historiques\" in 1837. This was the Commission that instructed Eugène Viollet-le-Duc to report on the condition of the \"Abbey of Vézelay\" in 1840. Following this, Viollet le Duc set to restore most of the symbolic buildings in France – Notre Dame de Paris, \"Vézelay\", \"Carcassonne\", \"Roquetaillade castle\", the especial famous and picturesque Mont Saint-Michel on its peaked coastal island, \"Pierrefonds\", \"Palais des Papes\" in Avignon... When France's first prominent neo-Gothic church[9] was built, the \"Basilica of Saint-Clotilde\",[10] Paris, begun in September 1846 and consecrated 30 November 1857, the architect chosen was, significantly, of German extraction, François-Christian Gau, (1790–1853); the design was significantly modified by Gau's assistant, Théodore Ballu, in the later stages, to produce the pair of \"flèches\" that crown the west end.",
			"color": "black|0.7629 sienna|0.090816 saddle|0.056186 brown|0.056186 peru|0.028706 sandy|0.018184 brown|0.018184 dark|0.013587 slate|0.013587 gray|0.013587  "
		}
	}
}
