{
	"add": {
		"doc": {
			"id": "48bb46a5fc4ce689e686993a6a6ebd5021e95805fac4362352c2ee69494f779c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/North_america_rock_types.jpg/150px-North_america_rock_types.jpg",
				"previous": "The United States Geographical Survey (USGS) states that the geographic center of North America is \"6 miles [10 km] west of Balta, Pierce County, North Dakota\" at about 48°10′N 100°10′W﻿ / ﻿48.167°N 100.167°W﻿ / 48.167; -100.167, about 24 kilometres (15 mi) from Rugby, North Dakota. The USGS further states that \"No marked or monumented point has been established by any government agency as the geographic center of either the 50 States, the conterminous United States, or the North American continent.\" Nonetheless, there is a 4.6-metre (15 ft) field stone obelisk in Rugby claiming to mark the center. The North American continental pole of inaccessibility is located 1,650 km (1,030 mi) from the nearest coastline, between Allen and Kyle, South Dakota at 43°22′N 101°58′W﻿ / ﻿43.36°N 101.97°W﻿ / 43.36; -101.97﻿ (Pole of Inaccessibility North America).[51]",
				"after": "Geologically, Canada is one of the oldest regions in the world, with more than half of the region consisting of precambrian rocks that have been above sea level since the beginning of the Palaeozoic era.[52] Canada's mineral resources are diverse and extensive.[52] Across the Canadian Shield and in the north there are large iron, nickel, zinc, copper, gold, lead, molybdenum, and uranium reserves. Large diamond concentrations have been recently developed in the Arctic,[53] making Canada one of the world's largest producers. Throughout the Shield there are many mining towns extracting these minerals. The largest, and best known, is Sudbury, Ontario. Sudbury is an exception to the normal process of forming minerals in the Shield since there is significant evidence that the Sudbury Basin is an ancient meteorite impact crater. The nearby, but less known Temagami Magnetic Anomaly has striking similarities to the Sudbury Basin. Its magnetic anomalies are very similar to the Sudbury Basin, and so it could be a second metal-rich impact crater.[54] The Shield is also covered by vast boreal forests that support an important logging industry.",
			"color": "dark|0.1659 gray|0.1659 dark|0.1659 grey|0.1659 silver|0.15032 light|0.13709 gray|0.13709 light|0.13709 grey|0.13709 gainsboro|0.1102 khaki|0.04951 gray|0.045152 grey|0.045152 dim|0.033615 gray|0.033615 dim|0.033615 grey|0.033615 rosy|0.031725 brown|0.031725 white|0.031158 smoke|0.031158 linen|0.020598 black|0.019612 pale|0.017192 golden|0.017192 rod|0.017192 lavender|0.017186 blush|0.017186 sea|0.014856 shell|0.014856 dark|0.014228 khaki|0.014228 ghost|0.014021 white|0.014021 alice|0.01376 blue|0.01376 snow|0.012647 misty|0.010719 rose|0.010719 lavender|0.0095827 light|0.0088445 slate|0.0088445 gray|0.0088445 light|0.0087483 steel|0.0087483 blue|0.0087483 slate|0.0075626 gray|0.0075626 white|0.0069148 floral|0.00583 white|0.00583 mint|0.0049629 cream|0.0049629 wheat|0.0039782 antique|0.003712 white|0.003712 old|0.0034051 lace|0.0034051  "
		}
	}
}
