{
	"add": {
		"doc": {
			"id": "48bd37e88b160d1935d705a80366fd844b34926039a142da7af12050c2723705",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Mariah_Carey13_Edwards_Dec_1998.jpg/220px-Mariah_Carey13_Edwards_Dec_1998.jpg",
			"previous": [],
				"after": "Love is the subject of the majority of Carey's lyrics, although she has written about themes such as racism, social alienation, death, world hunger, and spirituality. She has said that much of her work is partly autobiographical, but Time magazine wrote: \"If only Mariah Carey's music had the drama of her life. Her songs are often sugary and artificial—NutraSweet soul. But her life has passion and conflict,\" applying it to the first stages of her career. He commented that as her albums progressed, so too her songwriting and music blossomed into more mature and meaningful material.[255] Jim Faber of the New York Daily News, made similar comments, \"For Carey, vocalizing is all about the performance, not the emotions that inspired it. Singing, to her, represents a physical challenge, not an emotional unburdening.\"[256] While reviewing Music Box, Stephen Holden from Rolling Stone commented that Carey sang with \"sustained passion\", while Arion Berger of Entertainment Weekly wrote that during some vocal moments, Carey becomes \"too overwhelmed to put her passion into words.\"[257] In 2001, The Village Voice wrote in regards to what they considered Carey's \"centerless ballads\", writing, \"Carey's Strawberry Shortcake soul still provides the template with which teen-pop cuties draw curlicues around those centerless [Diane] Warren ballads [.....] it's largely because of [Blige] that the new R&B demands a greater range of emotional expression, smarter poetry, more from-the-gut testifying, and less [sic] unnecessary notes than the squeaky-clean and just plain squeaky Mariah era. Nowadays it's the Christina Aguileras and Jessica Simpsons who awkwardly oversing, while the women with roof-raising lung power keep it in check when tune or lyric demands.\"[258]",
			"color": "tan|0.24486 antique|0.057555 white|0.057555 wheat|0.046636 linen|0.036531 sea|0.034709 shell|0.034709 bisque|0.033615 floral|0.033127 white|0.033127 papaya|0.032202 whip|0.032202 old|0.03217 lace|0.03217 blanched|0.032078 almond|0.032078 white|0.027526 smoke|0.027526 snow|0.02442 ivory|0.022674 beige|0.021685 black|0.020641 mint|0.020332 cream|0.020332 dim|0.019998 gray|0.019998 dim|0.019998 grey|0.019998 white|0.019701 burly|0.018722 wood|0.018722 gainsboro|0.014984 corn|0.01475 silk|0.01475 gray|0.014315 grey|0.014315 ghost|0.014031 white|0.014031 peach|0.013461 puff|0.013461 azure|0.013375 alice|0.01325 blue|0.01325 dark|0.012331 salmon|0.012331 misty|0.011974 rose|0.011974 light|0.011711 gray|0.011711 light|0.011711 grey|0.011711 dark|0.011402 gray|0.011402 dark|0.011402 grey|0.011402 lavender|0.010637 blush|0.010637 silver|0.0084307  "
		}
	}
}
