{
	"add": {
		"doc": {
			"id": "4901f179ed1800d31261608ee32de2e100286ff9ebd298b33d9b928addcc2173",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Marwari_horse_show_jumping_Jodhpur_polo_ground.jpg/220px-Marwari_horse_show_jumping_Jodhpur_polo_ground.jpg",
				"previous": "As a direct result of indiscriminate breeding practices, as of 2001 only a few thousand purebred Marwaris existed.[21] Research studies have been conducted to examine the genetics of the Marwari and its relationship to other Indian and non-Indian horse breeds. Six different breeds have been identified in India: the Marwari, Kathiawari, Spiti pony, Bhutia pony, Manipuri Pony, and Zanskari. These six are distinct from each other in terms of unique performance traits and different agroclimactic conditions in the various areas of India where they originated. A 2005 study was conducted to identify past genetic bottlenecks in the Marwari. The study found that, in the DNA of the horses tested, there was no evidence of a genetic bottleneck in the breed's history. However, since the population has decreased rapidly in past decades, bottlenecks may have occurred that were not identified in the study.[21] In 2007, a study was conducted to assess genetic variation among all Indian horse breeds except the Kathiawari. Based on analysis of microsatellite DNA, the Marwari was found to be the most genetically distinct breed of the five studied, and was most distant from the Manipuri; none of the breeds were found to have close genetic ties to the Thoroughbred. The Marwari was distinguishable from the other breeds in terms of both physical characteristics (mainly height) and environmental adaptability. The physical differences were attributed to differing ancestries: the Marwari are closely associated with the Arabian horse, while the four other breeds are supposedly descended from the Tibetan pony.[22]",
			"after": [],
			"color": "firebrick|0.081646 black|0.081429 tan|0.07695 brown|0.065711 dim|0.05956 gray|0.05956 dim|0.05956 grey|0.05956 light|0.055576 sky|0.055576 blue|0.055576 gray|0.034698 grey|0.034698 azure|0.028443 light|0.027486 cyan|0.027486 alice|0.025975 blue|0.025975 maroon|0.025368 mint|0.025174 cream|0.025174 dark|0.023902 gray|0.023902 dark|0.023902 grey|0.023902 white|0.02322 smoke|0.02322 light|0.02317 steel|0.02317 blue|0.02317 white|0.022154 ghost|0.020498 white|0.020498 snow|0.018939 dark|0.018433 red|0.018433 indian|0.018309 red|0.018309 silver|0.016915 light|0.01689 blue|0.01689 light|0.014481 gray|0.014481 light|0.014481 grey|0.014481 gainsboro|0.012952 floral|0.012382 white|0.012382 honeydew|0.012129 powder|0.011636 blue|0.011636 lavender|0.011566 sky|0.011384 blue|0.011384 sea|0.010745 shell|0.010745 lavender|0.0099215 blush|0.0099215  "
		}
	}
}
