{
	"add": {
		"doc": {
			"id": "49221482775c9a1fc86a80920781f6c37b7dbb384d20baed4b1c9e6c90b0770c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Spomenik_poginulima_u_zrakoplovnoj_nesre%C4%87i_1976_Mirogoj_srpanj_2008.jpg/250px-Spomenik_poginulima_u_zrakoplovnoj_nesre%C4%87i_1976_Mirogoj_srpanj_2008.jpg",
				"previous": "According to Pelin, he walked to the upper sector console holding JP550's flight progress strip. He asked Tasić if the DC-9 could climb to FL350. Tasić took the strip from Pelin and looked at it, then asked where the aircraft was at the moment. Pelin then pointed to a blip on the screen approaching Kostajnica. Tasić's response was 'yes, it could climb'. Pelin then noticed an aircraft on the screen coming from the direction of Metlika and asked Tasić about it, who said 'wait until they cross'. Pelin referred to the middle-sector screen to make sure that he had identified the DC-9 positively on the upper-sector screen. He then returned to Tasić and they both watched the targets pass each other, at which point Tasić authorised JP550 to climb. Pelin then called out to Erjavec and said 'yes, climb it'. Upon Erjevec receiving the OK from Pelin, he instructed the DC-9 to climb to FL350. That was at 10:07:40.",
				"after": "At 10:12:03, JP550 called the Zagreb middle-sector controller to inform them that the aircraft was out of flight level 310. The last instructions given by Erjavec to JP550 were to call the upper-sector controller on 134.45 MHz and to stop squawking the assigned squawk code. By instructing JP550 to squawk Standby, Erjavec simply released a code allocated for the middle sector. The data tag for the DC-9 would now disappear from his screen and the aircraft would become merely a point among many others. If everything about this handover had been normal, the DC-9 would have been given a new code on initial contact with the upper sector controller and would have been positively identified on the upper sector screen with its flight number and altitude readout. But this had not been a normal handover because of the ill-handled co-ordination for the climb. Also, Tasić was busy with other traffic and JP550 did not immediately contact the upper-sector controller. This could have been because the frequency was busy, but the pilots might also have delayed the call for some unknown reason.",
			"color": "dim|0.43976 gray|0.43976 dim|0.43976 grey|0.43976 gray|0.22353 grey|0.22353 dark|0.11383 gray|0.11383 dark|0.11383 grey|0.11383 slate|0.08329 gray|0.08329 light|0.063063 slate|0.063063 gray|0.063063 silver|0.032532 light|0.016176 gray|0.016176 light|0.016176 grey|0.016176 gainsboro|0.010079  "
		}
	}
}
