{
	"add": {
		"doc": {
			"id": "494f3e3f7f91f1304a144af8ef5e46287ffb756a27a844ac7c0956143b20ba35",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Paraceratherium_herd.jpg/220px-Paraceratherium_herd.jpg",
				"previous": "Remains assignable to Paraceratherium have been found in early to late Oligocene (34–23 million years ago) formations across Eurasia, in modern-day China, Mongolia, India, Pakistan, Kazakhstan, Georgia, Turkey, Romania, Bulgaria, and the former Yugoslavia.[5] Their distribution may be correlated with the palaeogeographic development of the Alpine-Himalayan mountain belt. The range of Paraceratherium finds implies that they inhabited a continuous landmass with a similar environment across it, but this is contradicted by palaeogeographic maps that show this area had various marine barriers, so the genus was successful in being widely distributed despite this.[43] The fauna which coexisted with Paraceratherium included other rhinoceroses, artiodactyls, rodents, beardogs, weasels, hyaenodonts, nimravids and cats.[26]",
				"after": "The habitat of Paraceratherium appears to have varied across its range, based on the types of geological formations it has been found in.[26] The Hsanda Gol Formation of Mongolia represents an arid desert basin, and the environment is thought to have had few tall trees and limited brush cover, as the fauna consisted mainly of animals that fed from tree tops or close to the ground.[44] A study of fossil pollen showed that much of China was woody shrubland, with plants such as saltbush, mormon tea (Ephedra), and nitre bush (Nitraria), all adapted to arid environments. Trees were rare, and concentrated near groundwater.[45] The parts of China where Paraceratherium lived had dry lakes and abundant sand dunes, and the most common plant fossils are leaves of the desert-adapted Palibinia. Trees in Mongolia and China included birch, elm, oaks, and other deciduous trees, while Siberia and Kazakhstan also had walnut trees.[26] Dera Bugti in Pakistan had dry, temperate to subtropical forest.[41]",
			"color": "dim|0.34649 gray|0.34649 dim|0.34649 grey|0.34649 black|0.26617 gray|0.23184 grey|0.23184 dark|0.090661 gray|0.090661 dark|0.090661 grey|0.090661 silver|0.02911 light|0.013624 gray|0.013624 light|0.013624 grey|0.013624 gainsboro|0.007979  "
		}
	}
}
