{
	"add": {
		"doc": {
			"id": "495364ad43b702c05a2260c2e32b9e44fcaaed08e4403960c9caa6fb075ba66a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Northern_Qi_scholars_collating_classic_texts2.jpg/310px-Northern_Qi_scholars_collating_classic_texts2.jpg",
				"previous": "The first nationwide government-funded school system in China was established in the year 3 AD under Emperor Ping of Han (9 BC–5 AD).[76] During the Northern Song dynasty, the government gradually reestablished an official school system after it was heavily damaged during the preceding Five Dynasties period.[77] Government-established schools soon eclipsed the role of private academies by the mid-11th century.[78][79] At the apex of higher education in the school system were the central schools located in the capital city, the Guozijian, the Taixue, and several vocational schools.[80] The first major reform effort to rebuild prefectural and county schools was initiated by Chancellor Fan Zhongyan (989–1052) in the 1040s. Before this time, the bulk of funds allotted for the establishment of prefectural and county schools was left up to private financing and minimal amount of government funding; Fan's reform effort started the trend of greater government financing, at least for prefectural schools.[81] Major expansion of educational facilities was initiated by Emperor Huizong, who used funds originally allotted for disaster relief and food-price stabilizing to fund new prefectural and county schools and demoted officials who neglected to repair, rebuild, and maintain these government schools.[82] The historian John W. Chaffe states that by the early 12th century the state school system had 1,500,000 acres (6,100 km2) of land that could provide for some 200,000 student residents living in dormitories.[83] After the widespread destruction of schools during the Jurchen invasions from the 1120s to 1140s, Emperor Gaozong of Song (r. 1127–1162) issued an edict to restore prefectural schools in 1142 and county schools in 1148, although the county schools by and large were reconstructed by the efforts of local county officials' private fundraising.[84]",
				"after": "By the late 12th century, many critics of the examination system and government-run schools initiated a movement to revive private academies.[78] During the course of the Southern Song, the academy became a viable alternative to the state school system.[85] Even those that were semi-private or state-sponsored were still seen as independent of the state's influence and their teachers uninterested in larger, nationwide issues.[85] One of the earliest academic institutions established in the Song period was the Yuelu Academy, founded in 976 during the reign of Emperor Taizu (r. 960–976). The Chinese scientist and statesman Shen Kuo was once the head chancellor of the Hanlin Academy,[86] established during the Tang dynasty. The Neo-Confucian Donglin Academy, established in 1111, was founded upon the staunch teaching that adulterant influences of other ideologies such as Buddhism should not influence the teaching of their purely Confucian school.[87] This belief hearkened back to the writings of the Tang essayist, prose stylist, and poet Han Yu (768–824), who was certainly a critic of Buddhism and its influence upon Confucian values.[88] Although the White Deer Grotto Academy of the Southern Tang (937–976) had fallen out of use during the early half of the Song, the Neo-Confucian philosopher Zhu Xi (1130–1200) reinvigorated it.[85]",
			"color": "tan|0.68167 burly|0.30592 wood|0.30592  "
		}
	}
}
