{
	"add": {
		"doc": {
			"id": "496b644e7487b8ae2c7300d283220a990a125636e64a99e09b838086ccf0e1f8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Woman_sorting_vanilla_in_Sambava_Madagascar.jpg/220px-Woman_sorting_vanilla_in_Sambava_Madagascar.jpg",
				"previous": "The 18th century in the central highlands was characterized by increasing population density and consequent famines, aggravated by warring among the principalities of Imerina. At the turn of the 19th century, King Andrianampoinimerina (1787–1810) successfully united these fractious Merina groups under his rule, then used slaves and forced labor—exacted in lieu of taxes for those without means to offer material payment—to systematically work the irrigated rice fields around Antananarivo. In this way, he ensured regular grain surpluses that were sufficient to consistently feed the entire population and export products for trade with other regions of the island. Marketplaces were established across the island to serve as central trading points for designated commodities such as smoked and dried seafood and meats, dried maize, salt, dried cassava and various fruits.[24] Rice cakes, including mofo gasy ([ˈmufʷˈɡasʲ]) and menakely ([menə̥ˈkelʲ]), were also sold by market vendors.[25] By this period, coastal cuisine had likewise evolved: early 19th century voyagers reported eating dishes on Île Sainte-Marie prepared with curry powder (including a spiced rice resembling biryani) and drinking coffee and tea.[26] Andrianampoinimerina's son, Radama I, succeeded in uniting nearly the entire island under his rule, and established the Kingdom of Madagascar. A line of Merina monarchs would continue to govern the island until its colonization by the French in 1896.[27]",
				"after": "Under the Kingdom of Madagascar, plantations were established for the production of crops exported to foreign markets such as England and France. Cloves were imported and planted in 1803, and coconuts—which had been relatively sparse on the island—were cultivated on plantations for the production of oil. Similarly, coffee had been grown on family plots of four to five trees until the early 19th century, when more intensive cultivation for export began.[28] Vanilla, later to become one of Madagascar's premiere export crops, was introduced by French entrepreneurs in 1840 and planted in eastern coastal rainforests. The technique of hand pollination, critical to higher vanilla yields, was introduced 30 years later.[29] Nonetheless, vanilla remained a marginal crop until the end of the monarchy.[30]",
			"color": "black|0.17411 dim|0.13718 gray|0.13718 dim|0.13718 grey|0.13718 gray|0.095509 grey|0.095509 dark|0.083632 gray|0.083632 dark|0.083632 grey|0.083632 light|0.08077 gray|0.08077 light|0.08077 grey|0.08077 silver|0.079137 gainsboro|0.068066 tan|0.032423 white|0.022624 smoke|0.022624 rosy|0.021432 brown|0.021432 lavender|0.017519 blush|0.017519 ghost|0.016693 white|0.016693 alice|0.016488 blue|0.016488 snow|0.015554 misty|0.015042 rose|0.015042 sea|0.014535 shell|0.014535 white|0.012592 lavender|0.011511 linen|0.011283 mint|0.010002 cream|0.010002 azure|0.0095034 floral|0.0093968 white|0.0093968  "
		}
	}
}
