{
	"add": {
		"doc": {
			"id": "496b99abf61100b73667c4b8a056e9f4e3efd695a0d24bb647b0dd77ecd14800",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Senned_National_Assembly_for_Wales.jpg/220px-Senned_National_Assembly_for_Wales.jpg",
				"previous": "Between the 2004 and 2012 local elections, no individual political party held a majority on Cardiff County Council. The Liberal Democrats held the largest number of seats and Cllr Rodney Berman was Leader of the Council.[52] The Liberal Democrats and Plaid Cymru formed a partnership administration.[53] In the 2012 elections the Labour Party achieved an outright majority, after gaining an additional 33 seats across the city.",
				"after": "The National Assembly for Wales has been based in Cardiff Bay since its formation in 1999. The building, known as the Senedd (which translates into English as Legislature, Parliament or Senate) was opened on 1 March 2006, by The Queen.[54] The Assembly Members (AMs), the Assembly Commission and Ministerial support staff are based in Cardiff Bay. Cardiff elects four constituency Assembly Members (AMs) to the Assembly, with the individual constituencies for the Assembly being the same as for the UK Parliament. All of the city's residents have an extra vote for the South Wales Central region which increases proportionality to the Assembly. The most recent Welsh Assembly general election were held on 5 May 2011.",
			"color": "black|0.23995 dim|0.13975 gray|0.13975 dim|0.13975 grey|0.13975 gray|0.10031 grey|0.10031 dark|0.056436 gray|0.056436 dark|0.056436 grey|0.056436 slate|0.049286 gray|0.049286 alice|0.040864 blue|0.040864 ghost|0.037191 white|0.037191 azure|0.036222 white|0.034008 smoke|0.034008 light|0.033772 slate|0.033772 gray|0.033772 light|0.027736 cyan|0.027736 white|0.02619 silver|0.025705 mint|0.025691 cream|0.025691 snow|0.023832 lavender|0.020689 light|0.015657 gray|0.015657 light|0.015657 grey|0.015657 gainsboro|0.0122 dark|0.0085609 slate|0.0085609 gray|0.0085609 lavender|0.0073114 blush|0.0073114  "
		}
	}
}
