{
	"add": {
		"doc": {
			"id": "496e09b66c86fba6b7d84c8ff1841923f3da0544e0341ac6f977cb6210d5a661",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/dd/Vickers_Nene_Viking_G-AJPH.jpg/220px-Vickers_Nene_Viking_G-AJPH.jpg",
				"previous": "The prototype (designated the Type 491 and registered G-AGOK) was built by the Vickers Experimental Department at its wartime Foxwarren dispersal site and was first flown by 'Mutt' Summers at Wisley Airfield on 22 June 1945.[1] This aircraft crashed on 23 April 1946 due to a double engine failure; no fatalities occurred as a result of the crash. Following successful trials of the three prototypes the British Overseas Airways Corporation (BOAC) ordered 19 aircraft. The first BOAC aircraft flew on 23 March 1946. The prototypes were then used for trials with the Royal Air Force which lead to orders for military versions (the Viking C2 (12 ordered as freighter/transports) and modified Valetta C1).",
				"after": "The initial 19 production aircraft (later designated the Viking 1A) carried 21 passengers, they had metal fuselages and - except for the wing inboard of the nacelles - fabric-clad geodetic wings and tail units. Following feedback from customers, the next 14 examples, known as the Viking 1, featured stressed-metal wings and tail units. The next variant, the Viking 1B, was 28 in (71 cm) longer, carrying 24 passengers with up-rated Bristol Hercules piston engines, achieved a production run of 115. One of this batch was changed during production to so that it could be fitted with two Rolls-Royce Nene turbojet engines and upon its first flight on 6 April 1948 became the world's first entirely jet-powered airliner albeit only a prototype. In 1948, on the 39th anniversary of Blériot's crossing of the English Channel, the Type 618 Nene-Viking flew Heathrow–Paris (Villacoublay) in the morning carrying letters to Bleriot's widow and son (secretary of the FAI), who met it at the airport. The flight of 222 miles took only 34 minutes. It then flew back to London in the afternoon. It obtained a maximum speed of 415 mph (668 km/h) at 12,000 ft (3,700 m) and averaged 394 mph (634 km/h).[2] In 1954 it was bought from the Ministry of Supply and underwent the substantial conversion to Hercules 634 piston engines by Eagle Aviation to join their fleet.[3]",
			"color": " "
		}
	}
}
