{
	"add": {
		"doc": {
			"id": "49765c1cda801f3f94e7b99e8025a3f55dbb72ce803b7842d1870d7d0a2ff53d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/249_global.png/220px-249_global.png",
				"previous": "During the Permian all the Earth's major land masses, except portions of East Asia, were collected into a single supercontinent known as Pangaea. Pangaea straddled the equator and extended toward the poles, with a corresponding effect on ocean currents in the single great ocean (Panthalassa, the universal sea), and the Paleo-Tethys Ocean, a large ocean that was between Asia and Gondwana. The Cimmeria continent rifted away from Gondwana and drifted north to Laurasia, causing the Paleo-Tethys to shrink. A new ocean was growing on its southern end, the Tethys Ocean, an ocean that would dominate much of the Mesozoic Era. Large continental landmasses create climates with extreme variations of heat and cold (\"continental climate\") and monsoon conditions with highly seasonal rainfall patterns. Deserts seem to have been widespread on Pangaea.",
			"after": [
				"The Mesozoic extended roughly from 252 to 66 million years ago.[2]",
				"After the vigorous convergent plate mountain-building of the late Paleozoic, Mesozoic tectonic deformation was comparatively mild. Nevertheless, the era featured the dramatic rifting of the supercontinent Pangaea. Pangaea gradually split into a northern continent, Laurasia, and a southern continent, Gondwana. This created the passive continental margin that characterizes most of the Atlantic coastline (such as along the U.S. East Coast) today."
			],
			"color": "lemon|0.20379 chiffon|0.20379 light|0.19307 golden|0.19307 rod|0.19307 yellow|0.19307 medium|0.17535 slate|0.17535 blue|0.17535 pale|0.12067 golden|0.12067 rod|0.12067 khaki|0.096048 light|0.04999 sky|0.04999 blue|0.04999 wheat|0.013583 light|0.012736 steel|0.012736 blue|0.012736 slate|0.011872 blue|0.011872 moccasin|0.010472 light|0.0088381 blue|0.0088381 tan|0.0074137 medium|0.0068285 purple|0.0068285 powder|0.0064698 blue|0.0064698 corn|0.0057567 flower|0.0057567 blue|0.0057567 burly|0.0054965 wood|0.0054965 rosy|0.0049009 brown|0.0049009 lavender|0.004574  "
		}
	}
}
