{
	"add": {
		"doc": {
			"id": "497a881ef54b6607b9c07e4cbbed5798478e85af37f58c4597380aff85d59cd7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Roman_temple%2C_Maiden_Castle.jpg/300px-Roman_temple%2C_Maiden_Castle.jpg",
			"previous": [],
				"after": "In AD 43, the Roman conquest of Britain began. Vespasian's subsequent campaign to conquer the tribes of the Atrebates, Dumnonii, and Durotriges in the southwest of Britain took place in AD 43–47.[58] Based on the discovery of a group of bodies in the Late Iron Age formal cemetery that had met a violent death, archaeologist Mortimer Wheeler created a vivid story of the fall of Maiden Castle to Roman forces. He believed a legion wreaked destruction on the site, butchering men, women, and children, before setting fire to the site and slighting its defences. However, there is little archaeological evidence to support this version of events, or even that the hill fort was attacked by the Romans. Although there is a layer of charcoal, it is associated with the iron works, and the main evidence for slighting of defences comes from the collapse of an entranceway to the fort. Although 14 bodies in the cemetery exhibited signs of a violent death, there is no evidence that they died at Maiden Castle.[59] The eastern part of the hill fort remained in use for at least the first few decades of the Roman occupation, although the duration and nature of habitation is uncertain. Many 1st-century Roman artefacts have been discovered near the east entrance and in the centre of the hill fort. It has been suggested that Maiden Castle was occupied as a Roman military outpost or fort and the settlement discontinued, as there is no known fort in the area and it was not uncommon for hill forts in the southwest to have been occupied by Roman forces. This was a characteristic of Vespasian's campaign in the region; there was military occupation at Cadbury Castle in Somerset, Hembury in Devon, and Hodd Hill in Dorset.[60]",
			"color": "dark|0.86604 olive|0.86604 green|0.86604 tan|0.079253 olive|0.025765 drab|0.025765  "
		}
	}
}
