{
	"add": {
		"doc": {
			"id": "4994604c0274cdc36cce3891d17c6ca99a66903a8545e7e6a1f71078691d4d75",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Lima-siglo-xix-vaillant.jpg/220px-Lima-siglo-xix-vaillant.jpg",
				"previous": "In the 15th century, the Incas emerged as a powerful state which, in the span of a century, formed the largest empire in pre-Columbian America with their capital in Cusco.[19] The Incas of Cusco originally represented one of the small and relatively minor ethnic groups, the Quechuas. Gradually, as early as the thirteenth century, they began to expand and incorporate their neighbors. Inca expansion was slow until about the middle of the fifteenth century, when the pace of conquest began to accelerate, particularly under the rule of the great emperor Pachacuti. Under his rule and that of his son, Topa Inca Yupanqui, the Incas came to control upwards of a third of South America, with a population of 9 to 16 million inhabitants under their rule. Pachacuti also promulgated a comprehensive code of laws to govern his far-flung empire, while consolidating his absolute temporal and spiritual authority as the God of the Sun who ruled from a magnificently rebuilt Cusco.[20] From 1438 to 1533, the Incas used a variety of methods, from conquest to peaceful assimilation, to incorporate a large portion of western South America, centered on the Andean mountain ranges, from southern Colombia to Chile, between the Pacific Ocean in the west and the Amazon rainforest in the east. The official language of the empire was Quechua, although hundreds of local languages and dialects were spoken. The Inca referred to their empire as Tawantinsuyu which can be translated as \"The Four Regions\" or \"The Four United Provinces.\" Many local forms of worship persisted in the empire, most of them concerning local sacred Huacas, but the Inca leadership encouraged the worship of Inti, the sun god and imposed its sovereignty above other cults such as that of Pachamama.[21] The Incas considered their King, the Sapa Inca, to be the \"child of the sun.\"[22]",
				"after": "Atahualpa, the last Sapa Inca became emperor when he defeated and executed his older half-brother Huascar in a civil war sparked by the death of their father, Inca Huayna Capac. In December 1532, a party of conquistadors led by Francisco Pizarro defeated and captured the Inca Emperor Atahualpa in the Battle of Cajamarca. The Spanish conquest of the Inca Empire was one of the most important campaigns in the Spanish colonization of the Americas. After years of preliminary exploration and military conflicts, it was the first step in a long campaign that took decades of fighting but ended in Spanish victory and colonization of the region known as the Viceroyalty of Peru with its capital at Lima, which became known as \"The City of Kings\". The conquest of the Inca Empire led to spin-off campaigns throughout the viceroyalty as well as expeditions towards the Amazon Basin,Go as in the case of Spanish efforts to quell Amerindian resistance. The last resistance was suppressed when the Spaniards took hold of the last Inca stronghold of Vilcabamba in 1572.",
			"color": "tan|0.15159 pale|0.10021 golden|0.10021 rod|0.10021 burly|0.085703 wood|0.085703 lemon|0.075606 chiffon|0.075606 wheat|0.067206 light|0.063783 golden|0.063783 rod|0.063783 yellow|0.063783 black|0.051572 moccasin|0.042821 light|0.041697 yellow|0.041697 dark|0.041463 khaki|0.041463 corn|0.038973 silk|0.038973 navajo|0.031696 white|0.031696 beige|0.030855 papaya|0.026209 whip|0.026209 blanched|0.025694 almond|0.025694 bisque|0.016361 antique|0.015496 white|0.015496 old|0.013913 lace|0.013913 ivory|0.013152 floral|0.0097681 white|0.0097681 peach|0.0089343 puff|0.0089343 linen|0.0089069  "
		}
	}
}
