{
	"add": {
		"doc": {
			"id": "49b2c872f12008f4c2f841e62956b254176867a53d8e47543aea96b4bd2c469b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Mercator_1569_map_small.jpg/220px-Mercator_1569_map_small.jpg",
				"previous": "In the Mediaeval era, the Vikings used clinker-built ships to colonize Iceland, Greenland, Canada, and Russia.[6](pp12–13) A compass showing magnetic north is first attested—in the form of a \"south-pointing spoon\"—in the 1st-century Chinese Lunheng. The first evidence of its use in Chinese maritime navigation, however, dates to Zhu Yu's c. 1115 Pingzhou Table Talks. Alexander of Neckham's De naturis rerum, the first European mention of a magnetized needle, dates to 1190 and immediately notes its use among sailors. Latitude (the ship's position ranging from 0° at the equator to 90° north and south) could be determined by inclinometers—including the astrolabe, sextant, and Jacob's staff—measuring the angle between the horizon and heavenly bodies like the sun or moon. Accurately determining longitude (the ship's position east or west of some fixed point) proved much harder.[142]",
				"after": "In the 15th century, West European mariners—beginning with Portugal—started making still longer voyages of exploration, using improvements on translated Islamic star charts and a variation on African fishing boats called the caravel. In 1473, Lopes Gonçalves crossed the equator and disproved the Aristotlean notion that a ring of fire would bar exploration of the southern hemisphere. Bartolomeu Dias rounded the Cape of Good Hope in 1487; in 1498, Vasco da Gama reached Malindi, where a local pilot showed him how to follow the monsoon to India. In 1492, relying on incorrect estimates of the circumference of the Earth, the Genovese Christopher Columbus sailed from Cadiz to the Canaries and thence into the open Atlantic in a Spanish attempt to reach the Orient. Instead, he made landfall on an island in the Caribbean Sea. The resulting Columbian Exchange introduced potatoes, corn, and chili peppers to the Old World while smallpox epidemics devastated the indigenous peoples of the Americas. This disruption and depopulation permitted rapid Spanish conquests and led to the widespread adoption of African slavery to man lucrative tobacco, sugar, indigo, and cotton plantations. In 1519, Juan Sebastián Elcano completed Magellan's Spanish expedition to sail around the world.[6](pp12–13) These and other voyages permitted European maps to attain a previously impossible degree of accuracy. In 1538, Gerardus Mercator devised a map projection conveniently making constant bearings (rhumb lines) straight.[6](pp12–13) In the Arctic, in 1594, the Dutch captain Willem Barentsz reached Svalbard and the Barents Sea while, in the south, Anthony de la Roché crossed the Antarctic Convergence in 1675 and three separate expeditions—one British, one American, and one Russian—all claimed to have discovered Antarctica in 1820.[143][144][145] Not all voyages of discovery originated in Western Europe. Although accurate charting of the coasts of Russia only began in the 18th century and the archipelago of Severnaya Zemlya was not discovered until 1910,[146] Novgorodians had been sailing the White Sea since at least the 13th century.[147] Despite a long-standing preference for autarky, China briefly opened up under the Song and Mongol Yuan dynasties. In the early 15th century, Zheng He's fleet of treasure ships repeatedly sailed from Ming China with 37,000 men aboard 317 ships, reaching as far as the African coast.[6](pp12–13) Chinese exploration, however, was soon curtailed again and finally outlawed. The peoples of East Asia were introduced to the true shape of the other continents from the maps of Matteo Ricci.",
			"color": "blanched|0.16671 almond|0.16671 antique|0.14667 white|0.14667 papaya|0.12452 whip|0.12452 wheat|0.12286 bisque|0.12139 beige|0.0788 corn|0.067342 silk|0.067342 light|0.033219 golden|0.033219 rod|0.033219 yellow|0.033219 light|0.0317 yellow|0.0317 old|0.029096 lace|0.029096  "
		}
	}
}
