{
	"add": {
		"doc": {
			"id": "49b2e2d8d62306b687cce1d98435568d99e2f5ad24b8490c87ec6a3a67b5f9a6",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8f/Agartala_airport_from_the_apron.jpg/250px-Agartala_airport_from_the_apron.jpg",
				"previous": "Only one major road, the National Highway 44 (NH-44), connects Tripura to the rest of India.[80] Starting at Sabroom in southern Tripura, it heads north to the capital Agartala, turns east and then north-east to enter the state of Assam. Locally known as \"Assam Road\", the NH-44 is often called the lifeline of Tripura.[80] However, the highway is single lane and of poor quality; often landslides, rains or other disruptions on the highway cut the state off from its neighbours.[32]:73[71]:44 Another National Highway, NH 44A, connects the town Manu in South Tripura district with Aizawl, Mizoram.[31] The Tripura Road Transport Corporation is the government agency overlooking public transport on road. A hilly and land-locked state, Tripura is dependent mostly on roads for transport.[80] The total length of roads in the state is 16,931 km (10,520 mi) of which national highways constitute 448 km (278 mi) and state highways 689 km (428 mi), as of 2009–10.[80] Residents in rural areas frequently use waterways as a mode of transport.[81]:140",
				"after": "Agartala Airport, located 12.5 km (6.7 nautical miles) northwest of Agartala at Singerbhil, is the second busiest airport in north east India after Guwahati. There are direct flight connections to Kolkata, Imphal, Delhi, Silchar, Aizwal, Guwahati, Bangalore, Chennai, Ahmedabad and Mumbai. The major airlines are Air India, Jet Airways (Operating Codeshare and Konnect Flights), Indigo Airlines and Spicejet. Passenger helicopter services are available between the capital and major towns (Kailashahar, Dharmanagar) as well as to more remote areas such as Kanchanpur and Gandacherra.[80]",
			"color": "black|0.45475 gray|0.11255 grey|0.11255 dark|0.10275 gray|0.10275 dark|0.10275 grey|0.10275 dim|0.074113 gray|0.074113 dim|0.074113 grey|0.074113 silver|0.046208 rosy|0.035147 brown|0.035147 light|0.020634 gray|0.020634 light|0.020634 grey|0.020634 tan|0.019538 midnight|0.017214 blue|0.017214 gainsboro|0.011561  "
		}
	}
}
