{
	"add": {
		"doc": {
			"id": "49b8a727c9893f604390a96c395afaecfc13cb9d060d4f24a5abbc4112467225",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/93/BHouse2.jpg/400px-BHouse2.jpg",
				"previous": "The principal entrance hall, reception and family bedrooms were placed on the first floor above a low semi-basement containing service rooms. The two principal entrances to the mansion in the centre of both the north and south facades were accessed by external staircases, originally a single broad flight on the north side and a double staircase on the south. These staircases have since been replaced by simpler designs.",
				"after": "The second floor has a matching fenestration, with windows of equal value to those on the first floor below. The very latest innovation, sash windows, was used on both floors. The semi-basement and attic storey used the more old-fashioned mullioned and transomed windows, indicating the lower status of the occupants of these floors. It was clearly emphasised from without that the two main floors of the house were purely for state and family use, and the staff and service areas were confined to the semi-basement and attic floors. This concept of keeping staff and domestic matters out of sight (when not required) was relatively new and had first been employed by Pratt in the design of Coleshill House in Berkshire. The contemporary social commentator of the day Roger North lauded back stairs, of which Belton has two examples (5 and 14 on plan), as one of the most important inventions of his day.[25]",
			"color": "saddle|0.10718 brown|0.10718 dark|0.084965 gray|0.084965 dark|0.084965 grey|0.084965 gray|0.064244 grey|0.064244 silver|0.049053 light|0.045687 blue|0.045687 dark|0.037449 golden|0.037449 rod|0.037449 light|0.030773 gray|0.030773 light|0.030773 grey|0.030773 dim|0.030669 gray|0.030669 dim|0.030669 grey|0.030669 sky|0.029653 blue|0.029653 black|0.02927 sienna|0.024392 gainsboro|0.024246 linen|0.022601 sea|0.021246 shell|0.021246 antique|0.020771 white|0.020771 white|0.020138 smoke|0.020138 floral|0.019604 white|0.019604 light|0.019466 steel|0.019466 blue|0.019466 old|0.01859 lace|0.01859 snow|0.01752 dark|0.017218 khaki|0.017218 white|0.01527 mint|0.014491 cream|0.014491 tan|0.014163 beige|0.013671 ghost|0.013263 white|0.013263 ivory|0.012696 lavender|0.012119 blush|0.012119 papaya|0.012068 whip|0.012068 light|0.011299 slate|0.011299 gray|0.011299 alice|0.010939 blue|0.010939 corn|0.0096304 silk|0.0096304 olive|0.0092546 drab|0.0092546 blanched|0.009027 almond|0.009027 rosy|0.0086807 brown|0.0086807 azure|0.0084208 misty|0.0082592 rose|0.0082592  "
		}
	}
}
