{
	"add": {
		"doc": {
			"id": "49d60cc407ea97fdbfc7e77f4b260af64128df6606b37a42ccb324b2ad27b7f3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Hands-free_Driving.jpg/220px-Hands-free_Driving.jpg",
			"previous": [],
				"after": "Fully autonomous vehicles, also known as driverless cars, already exist in prototype (such as the Google driverless car), and are expected to be commercially available around 2020. According to urban designer and futurist Michael E. Arth, driverless electric vehicles—in conjunction with the increased use of virtual reality for work, travel, and pleasure—could reduce the world's 800 million vehicles to a fraction of that number within a few decades.[54] This would be possible if almost all private cars requiring drivers, which are not in use and parked 90% of the time, would be traded for public self-driving taxis that would be in near constant use. This would also allow for getting the appropriate vehicle for the particular need—a bus could come for a group of people, a limousine could come for a special night out, and a Segway could come for a short trip down the street for one person. Children could be chauffeured in supervised safety, DUIs would no longer exist, and 41,000 lives could be saved each year in the US alone.[55][56]",
			"color": "dim|0.44375 gray|0.44375 dim|0.44375 grey|0.44375 gray|0.17413 grey|0.17413 black|0.12041 steel|0.028823 blue|0.028823 slate|0.024736 gray|0.024736 light|0.023172 slate|0.023172 gray|0.023172 dark|0.019474 gray|0.019474 dark|0.019474 grey|0.019474 light|0.016511 steel|0.016511 blue|0.016511 corn|0.012347 flower|0.012347 blue|0.012347 silver|0.0112 dark|0.010371 slate|0.010371 blue|0.010371 midnight|0.0089793 blue|0.0089793 light|0.0086462 gray|0.0086462 light|0.0086462 grey|0.0086462 gainsboro|0.0064642 royal|0.0063079 blue|0.0063079 dark|0.0052304 slate|0.0052304 gray|0.0052304 light|0.005193 blue|0.005193 white|0.0047074 smoke|0.0047074 dodger|0.0046019 blue|0.0046019  "
		}
	}
}
