{
	"add": {
		"doc": {
			"id": "49d8327fe8380cda91fa3ab0358c3a3532d78a42a759a787bf773105fe9bb03b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Tailor_in_Chad.jpg/250px-Tailor_in_Chad.jpg",
				"previous": "The music of Chad includes a number of unusual instruments such as the kinde, a type of bow harp; the kakaki, a long tin horn; and the hu hu, a stringed instrument that uses calabashes as loudspeakers. Other instruments and their combinations are more linked to specific ethnic groups: the Sara prefer whistles, balafones, harps and kodjo drums; and the Kanembu combine the sounds of drums with those of flute-like instruments.[106]",
				"after": "The music group Chari Jazz formed in 1964 and initiated Chad's modern music scene. Later, more renowned groups such as African Melody and International Challal attempted to mix modernity and tradition. Popular groups such as Tibesti have clung faster to their heritage by drawing on sai, a traditional style of music from southern Chad. The people of Chad have customarily disdained modern music. However, in 1995 greater interest has developed and fostered the distribution of CDs and audio cassettes featuring Chadian artists. Piracy and a lack of legal protections for artists' rights remain problems to further development of the Chadian music industry.[106][107]",
			"color": "dim|0.23282 gray|0.23282 dim|0.23282 grey|0.23282 gray|0.12538 grey|0.12538 light|0.07895 slate|0.07895 gray|0.07895 slate|0.060395 gray|0.060395 dark|0.052787 slate|0.052787 gray|0.052787 black|0.043521 dark|0.039231 gray|0.039231 dark|0.039231 grey|0.039231 light|0.030808 steel|0.030808 blue|0.030808 indian|0.02612 red|0.02612 light|0.022938 coral|0.022938 silver|0.021308 peru|0.016706 steel|0.013992 blue|0.013992 chocolate|0.013899 sandy|0.01322 brown|0.01322 brown|0.012343 dark|0.011325 salmon|0.011325 dark|0.010459 orange|0.010459 sienna|0.010225 golden|0.0084234 rod|0.0084234 orange|0.0082128 khaki|0.0078151 burly|0.0072434 wood|0.0072434  "
		}
	}
}
