{
	"add": {
		"doc": {
			"id": "49e460ee85022580bd76b2e627fa842681b4a07f2bf508a32ccd2dee64c96580",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Holborne_Pavans_Galliards_Almains.jpg/220px-Holborne_Pavans_Galliards_Almains.jpg",
				"previous": "In Elizabethan England, music printing was regulated by two royal patents issued by the queen: one for metrical psalters (psalms set to music) and one for all other types of music and music paper. The patent-holders thus held a monopoly—only they or their assignees could legally print music.[20] After printer John Day's death in 1584, the patent for metrical psalters transferred to his son Richard Day and was administered by his assignees, who were members of the Stationers' Company. The more general one was awarded to composers Thomas Tallis and William Byrd in January 1575. Despite the monopoly, Tallis and Byrd were not successful in their printing endeavors; their 1575 collection of Latin motets called Cantiones quae ab argumento sacrae vocantur failed to sell and was a financial disaster.[21] After Tallis died in 1585, Byrd continued holding the patent, producing works with his assignee, Thomas East.[22] The monopoly expired in 1596, prompting prospective music publishers such as Barley to take advantage of the resulting power vacuum.[20]",
				"after": "In 1596, despite not having access to a proper music fount, Barley (using the services of Danter and his wood blocks) published The Pathway to Music, a music theory book, and A New Booke of Tabliture, a tutor for the lute and related instruments that included compositions by John Dowland, Philip Rosseter, and Anthony Holborne. Both featured numerous errors, and for the latter, Barley seems not to have gained prior publishing approval from the composers. Dowland disowned A New Booke of Tabliture, calling his lute lessons \"falce and unperfect\",[23] while Holborne complained of \"corrupt coppies\" of his work being presented by a \"meere stranger\".[24] Modern musicologists have labelled the publication \"exasperating\" and \"seedy\".[23] Morley criticized The Pathway to Music, stating that the author should be \"ashamed of his labour\",[23] and that \"[v]ix est in toto pagina sano libro\" (\"there is scarcely a page that makes sense in the whole book\").[25] Despite their flaws, both works seem to have been instrumental in introducing music tutor books to the London market.[23]",
			"color": " "
		}
	}
}
