{
	"add": {
		"doc": {
			"id": "4a1f785de0d18f35ea8a7c26a1e9b872acd2bd96d39f7f380f13471153799b15",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Marjory_S_Douglas_Friends_photo.jpg/120px-Marjory_S_Douglas_Friends_photo.jpg",
				"previous": "Portal:Society/Featured biography/6",
				"after": "Marjory Stoneman Douglas (1890–1998) was an American journalist, writer, feminist, and environmentalist known for her staunch defense of the Everglades against efforts to drain it and reclaim land for development. Moving to Miami as a young woman to work for The Miami Herald, Douglas became a freelance writer, producing over a hundred short stories that were published in popular magazines. Her most influential work was the book The Everglades: River of Grass, which redefined the popular conception of the Everglades as a treasured river instead of a worthless swamp; its impact has been compared to that of the influential 1962 book Silent Spring. Her books, stories, and journalism career brought her influence in Miami, which she used to advance her causes. Douglas lived until age 108, working until nearly the end of her life for Everglades restoration. Upon her death, an obituary in The Independent in London stated, \"In the history of the American environmental movement, there have been few more remarkable figures than Marjory Stoneman Douglas.\"",
			"color": "dark|0.15293 gray|0.15293 dark|0.15293 grey|0.15293 silver|0.12066 gray|0.10466 grey|0.10466 light|0.098277 gray|0.098277 light|0.098277 grey|0.098277 gainsboro|0.077861 dim|0.07732 gray|0.07732 dim|0.07732 grey|0.07732 black|0.055232 white|0.035955 smoke|0.035955 linen|0.032798 sea|0.031592 shell|0.031592 snow|0.027947 floral|0.026513 white|0.026513 white|0.023638 mint|0.02077 cream|0.02077 ghost|0.019965 white|0.019965 lavender|0.018036 blush|0.018036 misty|0.015859 rose|0.015859 old|0.013482 lace|0.013482 alice|0.012757 blue|0.012757 azure|0.011287 ivory|0.010494 rosy|0.0037469 brown|0.0037469 honeydew|0.0030533  "
		}
	}
}
