{
	"add": {
		"doc": {
			"id": "4a3031e6ff41768c28ff1ed419fccd13833932b50477f4a7fb305c93a2661bff",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Regaining_the_Provincial_Capital_of_Ruizhou.jpg/280px-Regaining_the_Provincial_Capital_of_Ruizhou.jpg",
				"previous": "The Taiping Rebellion in the mid-19th century was the first major instance of anti-Manchu sentiment threatening the stability of the dynasty. Hong Xiuquan, a failed civil service candidate, led the Taiping Rebellion, amid widespread social unrest and worsening famine. In 1851 Hong Xiuquan and others launched an uprising in Guizhou province, established the Taiping Heavenly Kingdom with Hong himself as king, claiming he often had visions of God and that he was the brother of Jesus Christ. Slavery, concubinage, arranged marriage, opium smoking, footbinding, judicial torture, and the worship of idols were all banned. However, success and subsequent authority and power led to internal feuds, defections and corruption. In addition, British and French troops, equipped with modern weapons, had come to the assistance of the Qing imperial army. It was not until 1864 that Qing armies under Zeng Guofan succeeded in crushing the revolt. The rebellion not only posed the most serious threat towards Qing rulers; it was also \"bloodiest civil war of all time.\" Between 20 and 30 million people died during its fourteen-year course from 1850 to 1864.[62] After the outbreak of this rebellion, there were also revolts by the Muslims and Miao people of China against the Qing dynasty, most notably in the Dungan Revolt (1862–77) in the northwest and the Panthay Rebellion (1856–1873) in Yunnan.",
				"after": "The Western powers, largely unsatisfied with the Treaty of Nanjing, gave grudging support to the Qing government during the Taiping and Nian Rebellions. China's income fell sharply during the wars as vast areas of farmland were destroyed, millions of lives were lost, and countless armies were raised and equipped to fight the rebels. In 1854, Great Britain tried to re-negotiate the Treaty of Nanjing, inserting clauses allowing British commercial access to Chinese rivers and the creation of a permanent British embassy at Beijing.",
			"color": "tan|0.49996 dim|0.10277 gray|0.10277 dim|0.10277 grey|0.10277 gray|0.10119 grey|0.10119 dark|0.056809 gray|0.056809 dark|0.056809 grey|0.056809 burly|0.035255 wood|0.035255 rosy|0.024942 brown|0.024942 wheat|0.020634 silver|0.019579 dark|0.015837 khaki|0.015837 slate|0.013586 gray|0.013586 light|0.012034 gray|0.012034 light|0.012034 grey|0.012034 gainsboro|0.010712  "
		}
	}
}
