{
	"add": {
		"doc": {
			"id": "4a322f6f75f3c8c73e50dcbd46204654bcae35c8038ec30b33cdca6fddb463f1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Black_Raku_Tea_Bowl.jpg/220px-Black_Raku_Tea_Bowl.jpg",
				"previous": "A defining feature of most ukiyo-e prints is a well defined, bold, flat line.[135] The earliest prints were monochromatic, and these lines were the only printed element; even with the advent of colour this characteristic line continued to dominate.[136] Ukiyo-e composition is noted for the arrangement of forms in flat spaces.[137] Figures in ukiyo-e compositions were typically arranged in a single plane of depth. Attention was drawn to vertical and horizontal relationships, as well as details such as lines, shapes, and patterns such as those on clothing.[138] Compositions were often asymmetrical, and the viewpoint was often from unusual angles, such as from above. Elements of images were often cropped, giving the composition a spontaneous feel.[139] In colour prints, contours of most colour areas are sharply defined, usually by the linework.[140] The aesthetic of flat areas of colour contrasts with the modulated colours expected in Western traditions[137] and with other prominent contemporary traditions in Japanese art patronized by the upper class, such as in the subtle monochrome ink brushstrokes of zenga brush painting or tonal colours of the Kanō school of painting.[140]",
				"after": "The colourful, ostentatious, and complex patterns; concern with changing fashions; and tense, dynamic poses and compositions in ukiyo-e works are in striking contrast to many concepts in traditional Japanese aesthetics. Prominent amongst these, wabi-sabi favours simplicity, asymmetry, and imperfection, with evidence of the passage of time;[141] and shibui values subtlety, humility, and restraint.[142] Ukiyo-e can be less at odds with aesthetic concepts such as the racy, urbane stylishness of iki.[143]",
			"color": "dim|0.66807 gray|0.66807 dim|0.66807 grey|0.66807 gray|0.20572 grey|0.20572 dark|0.065684 gray|0.065684 dark|0.065684 grey|0.065684 silver|0.03792  "
		}
	}
}
