{
	"add": {
		"doc": {
			"id": "4a412161b5065b863eb50fb3769faf1f9b9c6a14971f44da4c0701f193f11598",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Dried_Dodo_Head_Half_from_Oxford_University_Museum_of_Natural_History.jpg/220px-Dried_Dodo_Head_Half_from_Oxford_University_Museum_of_Natural_History.jpg",
				"previous": "As no complete dodo specimens exist, its external appearance, such as plumage and colouration, is hard to determine.[2] Illustrations and written accounts of encounters with the dodo between its discovery and its extinction (1598–1662) are the primary evidence for its external appearance.[35] According to most representations, the dodo had greyish or brownish plumage, with lighter primary feathers and a tuft of curly light feathers high on its rear end. The head was grey and naked, the beak green, black and yellow, and the legs were stout and yellowish, with black claws.[36] The bird was sexually dimorphic: males were larger and had proportionally longer beaks. The beak was up to 23 centimetres (9.1 in) in length and had a hooked point.[37]",
				"after": "Subfossil remains and remnants of the birds that were brought to Europe in the 17th century show that they were very large birds, 1 metre (3 feet 3 inches) tall, and possibly weighing up to 23 kilograms (51 lb). The higher weights have been attributed to birds in captivity; weights in the wild were estimated to have been in the range 10.6–21.1 kg (23–47 lb).[38] A later estimate gives an average weight as low as 10.2 kg (22 lb).[39] This has been questioned, and there is still some controversy.[40][41] It has been suggested that the weight depended on the season, and that individuals were fat during cool seasons, but less so during hot.[42] A study of the few remaining feathers on the Oxford specimen head showed that they were pennaceous rather than plumaceous (downy) and most similar to those of other pigeons.[43]",
			"color": "black|0.88734 dim|0.065346 gray|0.065346 dim|0.065346 grey|0.065346  "
		}
	}
}
