{
	"add": {
		"doc": {
			"id": "4a4fa0768718bd4af98c9ed9f40d3253ddc7d679e7506d219521c4956b1793d4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Little_Nemo_score_cover.jpg/220px-Little_Nemo_score_cover.jpg",
				"previous": "Impresario F. F. Proctor approached McCay in April 1906 to perform chalk talks for the vaudeville circuit.[42] For $500 per week he was to draw twenty-five sketches in fifteen minutes before live audiences, as a pit band played a piece called \"Dream of the Rarebit Fiend\".[43] In his The Seven Ages of Man routine, he drew two faces and progressively aged them.[44] His first performance was on June 11, 1906,[43] in a show that also featured entertainer W. C. Fields.[43] It was a success, and McCay toured with the show throughout 1907,[45] while managing to complete his comic strip and illustration work on time, often working in hotel rooms or backstage.[46]",
				"after": "As early as 1905, several abortive attempts were made to produce a stage version of Little Nemo. In mid-1907, Marcus Klaw and A. L. Erlanger announced they would put on an extravagant Little Nemo show for an unprecedented $100,000, with a score by Victor Herbert[47] and lyrics by Harry B. Smith.[47] It starred midget Gabriel Weigel as Nemo, Joseph Cawthorn as Dr. Pill, and Billy B. Van as Flip.[48] Reviews were positive; it played to sold-out houses in New York and toured for two seasons.[49] McCay brought his vaudeville act to each city where Little Nemo played. When the Keith circuit[c] refused McCay to perform in Boston without a new act, McCay switched to the William Morris circuit, with a $100-a-week raise.[50] In several cities, McCay brought his son, who as publicity sat on a small throne dressed as Nemo.[51]",
			"color": "dim|0.16382 gray|0.16382 dim|0.16382 grey|0.16382 gray|0.16165 grey|0.16165 dark|0.098246 gray|0.098246 dark|0.098246 grey|0.098246 black|0.086892 dark|0.081033 olive|0.081033 green|0.081033 midnight|0.053625 blue|0.053625 silver|0.022248 light|0.017733 gray|0.017733 light|0.017733 grey|0.017733 antique|0.01745 white|0.01745 dark|0.016385 khaki|0.016385 wheat|0.016134 beige|0.016106 slate|0.015533 gray|0.015533 gainsboro|0.015357 tan|0.013965 dark|0.013704 slate|0.013704 gray|0.013704 light|0.012173 slate|0.012173 gray|0.012173 pale|0.011829 golden|0.011829 rod|0.011829 papaya|0.010608 whip|0.010608 blanched|0.010508 almond|0.010508 maroon|0.010191 bisque|0.0086361  "
		}
	}
}
