{
	"add": {
		"doc": {
			"id": "4a5a3502c95247279b295ff95b8439aa01a77295bfd90792ca075ac0ef915053",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Three_guinea_pigs_%28Cavia_porcellus%29_at_Keswick_Public_Library.jpg/220px-Three_guinea_pigs_%28Cavia_porcellus%29_at_Keswick_Public_Library.jpg",
				"previous": "Guinea pigs can learn complex paths to food, and can accurately remember a learned path for months. Their strongest problem-solving strategy is motion.[57] While guinea pigs can jump small obstacles, they are poor climbers, and are not particularly agile. They startle extremely easily, and either freeze in place for long periods or run for cover with rapid, darting motions when they sense danger.[42] Larger groups of startled guinea pigs \"stampede\", running in haphazard directions as a means of confusing predators.[58] When excited, guinea pigs may repeatedly perform little hops in the air (known as \"popcorning\"), a movement analogous to the ferret's war dance.[59] They are also exceedingly good swimmers.[60]",
				"after": "Like many rodents, guinea pigs sometimes participate in social grooming, and they regularly self-groom.[61] A milky-white substance is secreted from their eyes and rubbed into the hair during the grooming process.[62] Groups of boars often chew each other's hair, but this is a method of establishing hierarchy within a group, rather than a social gesture.[60] Dominance is also established through biting (especially of the ears), piloerection, aggressive noises, head thrusts, and leaping attacks.[63] Non-sexual simulated mounting for dominance is also common among same-sex groups.",
			"color": "tan|0.2753 dark|0.19446 gray|0.19446 dark|0.19446 grey|0.19446 gray|0.071538 grey|0.071538 dim|0.067376 gray|0.067376 dim|0.067376 grey|0.067376 silver|0.046566 black|0.046389 light|0.035581 gray|0.035581 light|0.035581 grey|0.035581 antique|0.031281 white|0.031281 gainsboro|0.025894 wheat|0.016465 linen|0.014105 white|0.011712 smoke|0.011712 sea|0.011533 shell|0.011533 light|0.011233 slate|0.011233 gray|0.011233 old|0.010117 lace|0.010117 floral|0.009768 white|0.009768 beige|0.0097362  "
		}
	}
}
