{
	"add": {
		"doc": {
			"id": "4a67f87d9804195793cbf116557092f68040d514218fff98399af90c599b685e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/HMS_Agincourt_%281914%29.JPG/220px-HMS_Agincourt_%281914%29.JPG",
				"previous": "On 1 January 1915, Agincourt was still assigned to the 4th BS, but had been assigned to the 1st Battle Squadron before the Battle of Jutland on 31 May 1916. She was the last ship of the Sixth Division of the 1st BS, along with HMS Hercules, HMS Revenge and the flagship, HMS Marlborough, the most heterogeneous group possible as each ship was from a different class. The Sixth Division was the starboardmost column of the Grand Fleet as it headed south to rendezvous with the ships of Admiral Beatty's Battlecruiser Fleet, then engaged with their opposite numbers from the German High Seas Fleet in the North Sea.[45] Admiral Jellicoe, commander of the Grand Fleet, kept it in cruising formation until 6:15 p.m.[D] when he ordered it to deploy from column into a single line based on the port division, each ship turning 90° in succession. This turn made the Sixth Division the closest ships in the Grand Fleet to the battleships of the High Seas Fleet and they fired on each ship as they made their turn to port. This concentration of fire later became known as \"Windy Corner\" to the British as the ships were drenched by German shell splashes although none were hit.[46]",
				"after": "At 6:24 Agincourt opened fire on a German battlecruiser with her main guns. Shortly afterwards her six-inch guns followed suit as German destroyers made torpedo attacks on the British battleships to cover the turn to the south of the High Seas Fleet.[47] Agincourt successfully evaded two torpedoes, although another struck Marlborough.[48] Visibility cleared around 7:15 and she engaged a Kaiser-class battleship without result before it was lost in the smoke and haze.[49] Around 8:00 Marlborough was forced to reduce speed because of the strain on her bulkheads from her torpedo damage and her division mates conformed to her speed.[50] In the reduced visibility the division lost sight of the Grand Fleet during the night, passing the badly damaged battlecruiser SMS Seydlitz without opening fire.[51] Dawn found them with only the detritus from the previous day's battle in sight and the division arrived back at Scapa Flow on 2 June.[52] Agincourt fired 144 twelve-inch shells and 111 six-inch shells during the battle, although she is not known to have hit anything.[43]",
			"color": "dim|0.54551 gray|0.54551 dim|0.54551 grey|0.54551 gray|0.28307 grey|0.28307 black|0.1449 dark|0.017794 gray|0.017794 dark|0.017794 grey|0.017794  "
		}
	}
}
