{
	"add": {
		"doc": {
			"id": "4a73b68c514794faccd5612c74e9889ae6dca530a4e18da456244e40656fb280",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Henry_Moore_Allan_Warren.jpg/220px-Henry_Moore_Allan_Warren.jpg",
				"previous": "On the campus of the University of Chicago in December 1967, 25 years to the minute[27] after the team of physicists led by Enrico Fermi achieved the first controlled, self-sustaining nuclear chain reaction, Moore's Nuclear Energy was unveiled on the site of what was once the university's football field stands, in the rackets court beneath which the experiments had taken place.[28] This 12-foot-tall piece in the middle of a large, open plaza is often thought to represent a mushroom cloud topped by a massive human skull, but Moore's interpretation was very different. He once told a friend that he hoped viewers would \"go around it, looking out through the open spaces, and that they may have a feeling of being in a cathedral.\"[29] In Chicago, Illinois, Moore also commemorated science with a large bronze sundial, locally named Man Enters the Cosmos (1980), which was commissioned to recognise the space exploration program.[30]",
				"after": "The last three decades of Moore's life continued in a similar vein; several major retrospectives took place around the world, notably a very prominent exhibition in the summer of 1972 in the grounds of the Forte di Belvedere overlooking Florence. Following the pioneering documentary 'Henry Moore', produced by John Read in 1951, he appeared in many films. In 1964, for instance, Moore was featured in the documentary \"5 British Sculptors (Work and Talk)\" by American filmmaker Warren Forma. By the end of the 1970s, there were some 40 exhibitions a year featuring his work. The number of commissions continued to increase; he completed Knife Edge Two Piece in 1962 for College Green near the Houses of Parliament in London. According to Moore, \"When I was offered the site near the House of Lords ... I liked the place so much that I didn't bother to go and see an alternative site in Hyde Park—one lonely sculpture can be lost in a large park. The House of Lords site is quite different. It is next to a path where people walk and it has a few seats where they can sit and contemplate it.\"[31]",
			"color": "light|0.13304 steel|0.13304 blue|0.13304 slate|0.086428 gray|0.086428 light|0.077127 slate|0.077127 gray|0.077127 lavender|0.068963 dim|0.062684 gray|0.062684 dim|0.062684 grey|0.062684 ghost|0.04471 white|0.04471 alice|0.044319 blue|0.044319 white|0.042463 smoke|0.042463 snow|0.040793 gray|0.040237 grey|0.040237 white|0.039846 sea|0.03845 shell|0.03845 azure|0.038355 lavender|0.038329 blush|0.038329 mint|0.037832 cream|0.037832 floral|0.036971 white|0.036971 dark|0.025627 gray|0.025627 dark|0.025627 grey|0.025627 thistle|0.023578 black|0.023026 silver|0.015944 light|0.012118 gray|0.012118 light|0.012118 grey|0.012118 gainsboro|0.010698 ivory|0.0048258 misty|0.0037634 rose|0.0037634  "
		}
	}
}
