{
	"add": {
		"doc": {
			"id": "4a8aed43e55ce01accd0f73341cbb2183079fb2dc5196f9d6bee28b91ebb51f0",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8f/Stripline_filter_low-pass_stubs.svg/220px-Stripline_filter_low-pass_stubs.svg.png",
				"previous": "A more complex example of stepped impedance design is presented in figure 6. Again, narrow lines are used to implement inductors and wide lines correspond to capacitors, but in this case, the lumped-element counterpart has resonators connected in shunt across the main line. This topology can be used to design elliptical filters or Chebyshev filters with poles of attenuation in the stopband. However, calculating component values for these structures is an involved process and has led to designers often choosing to implement them as m-derived filters instead, which perform well and are much easier to calculate. The purpose of incorporating resonators is to improve the stopband rejection. However, beyond the resonant frequency of the highest frequency resonator, the stopband rejection starts to deteriorate as the resonators are moving towards open-circuit. For this reason, filters built to this design often have an additional single stepped-impedance capacitor as the final element of the filter.[46] This also ensures good rejection at high frequency.[47][48][49]",
				"after": "Another common low-pass design technique is to implement the shunt capacitors as stubs with the resonant frequency set above the operating frequency so that the stub impedance is capacitive in the passband. This implementation has a lumped-element counterpart of a general form similar to the filter of figure 6. Where space allows, the stubs may be set on alternate sides of the main line as shown in figure 7(a). The purpose of this is to prevent coupling between adjacent stubs which detracts from the filter performance by altering the frequency response. However, a structure with all the stubs on the same side is still a valid design. If the stub is required to be a very low impedance line, the stub may be inconveniently wide. In these cases, a possible solution is to connect two narrower stubs in parallel. That is, each stub position has a stub on both sides of the line. A drawback of this topology is that additional transverse resonant modes are possible along the λ/2 length of line formed by the two stubs together. For a choke design, the requirement is simply to make the capacitance as large as possible, for which the maximum stub width of λ/4 may be used with stubs in parallel on both sides of the main line. The resulting filter looks rather similar to the stepped impedance filter of figure 5, but has been designed on completely different principles.[42] A difficulty with using stubs this wide is that the point at which they are connected to the main line is ill defined. A stub that is narrow in comparison to λ can be taken as being connected on its centre-line and calculations based on that assumption will accurately predict filter response. For a wide stub, however, calculations that assume the side branch is connected at a definite point on the main line leads to inaccuracies as this is no longer a good model of the transmission pattern. One solution to this difficulty is to use radial stubs instead of linear stubs. A pair of radial stubs in parallel (one on either side of the main line) is called a butterfly stub (see figure 7(b)). A group of three radial stubs in parallel, which can be achieved at the end of a line, is called a clover-leaf stub.[50][51]",
			"color": "burly|0.23104 wood|0.23104 navajo|0.21731 white|0.21731 tan|0.1698 wheat|0.15564 antique|0.052098 white|0.052098 light|0.050138 gray|0.050138 light|0.050138 grey|0.050138 gainsboro|0.036989 moccasin|0.033504 silver|0.023782  "
		}
	}
}
