{
	"add": {
		"doc": {
			"id": "4a8cfe230087f5a27aa41107648f5a0e99b30c35ef558044a4d1f7d9a948cea9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Cathedral_churches_of_Moray.png/200px-Cathedral_churches_of_Moray.png",
			"previous": [],
				"after": "The Diocese of Moray was a regional bishopric unlike the pre-eminent see of the Scottish church, St Andrews, which had evolved from a more ancient monastic Celtic church and administered scattered localities.[3] It is uncertain whether there were bishops of Moray before c. 1120 [4] but the first known prelate—possibly later translated to Dunkeld—was Gregory (or Gregoir). He was probably bishop in name only, with the first resident diocesan being Richard of Lincoln.[5] Gregory was a signatory to the foundation charter of Scone Priory, issued by Alexander I (Alaxandair mac Maíl Choluim) between December 1123 and April 1124,[6] and again in a charter defining the legal rights of the same monastery.[7] He is recorded for the last time when he witnessed a charter granted by David I to Dunfermline Abbey in c. 1128.[8] After the suppression of Óengus of Moray's rebellion in 1130, King David must have regarded the continued presence of bishops in Moray as essential to the stability of the province.[9][10] These early bishops had no settled location for their cathedral, and sited it successively at the churches of Birnie, Kinneddar and Spynie.[11] Pope Innocent III issued an apostolic bull on 7 April 1206 that allowed bishop Bricius de Douglas to fix his cathedral church at Spynie—its inauguration was held between spring 1207 and summer 1208.[12] A chapter of five dignitaries and three ordinary canons was authorised and based its constitution on that of Lincoln Cathedral.[13] Elgin became the lay centre of the province under David I, who probably established the first castle in the town,[10][14] and it may have been this castle, with its promise of better security, that prompted Bricius, before July 1216, to petition the Pope to move the seat from Spynie.[15]",
			"color": "dark|0.8972 sea|0.8972 green|0.8972 cadet|0.025522 blue|0.025522 blue|0.0099897 light|0.0082925 blue|0.0082925 powder|0.0064557 blue|0.0064557 sky|0.0064342 blue|0.0064342  "
		}
	}
}
