{
	"add": {
		"doc": {
			"id": "4a91a3c11136a7cc558af36a83f08d4d73071216f942ebd2f804cdf8c0e426cd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/BulletForMyValentine2006.PNG/200px-BulletForMyValentine2006.PNG",
				"previous": "Metalcore, a hybrid of extreme metal and hardcore punk,[206] emerged as a commercial force in the mid-2000s decade. It is rooted in the crossover thrash style developed two decades earlier by bands such as Suicidal Tendencies, Dirty Rotten Imbeciles, and Stormtroopers of Death.[207] Through the 1990s, metalcore was mostly an underground phenomenon;[208] early bands include Earth Crisis,[209][210][211] Hogan's Heroes,[212][213] Converge,[210] Hatebreed[211][214] and Shai Hulud.[215][216] By 2004, melodic metalcore—influenced as well by melodic death metal—was popular enough that Killswitch Engage's The End of Heartache and Shadows Fall's The War Within debuted at numbers 21 and 20, respectively, on the Billboard album chart.[217]",
				"after": "Welsh band Bullet for My Valentine's third studio album Fever debuted at position number 3 on The Billboard 200 and number 1 on Billboard's Rock and Alternative charts, making it the band's most successful record to date. In recent years, metalcore bands have received prominent slots at Ozzfest and the Download Festival. Lamb of God, a groove metal band, hit the Billboard top 10 in 2006 with Sacrament. The success of these bands and others such as Trivium and Avenged Sevenfold[218] which have released both metalcore and straight-ahead thrash albums. Bands like Motionless In White have experimented with Metalcore further by including Gothic Metal and Industrial Metal influences. Other notable experiments include Asking Alexandria mixing Trance, this has led to an explosion of bands following this combination. One such band is Silent Descent who mix Melodic Death Metal with trance. Evolving even further from metalcore comes mathcore, a more rhythmically complicated and progressive style brought to light by bands such as The Dillinger Escape Plan, Converge, and Protest the Hero.[219] Mathcore's main defining quality is the use of odd time signatures, and has been described to possess rhythmic comparability to free Jazz.[220]",
			"color": "black|0.4313 dark|0.036942 slate|0.036942 gray|0.036942 dark|0.036536 gray|0.036536 dark|0.036536 grey|0.036536 dim|0.036158 gray|0.036158 dim|0.036158 grey|0.036158 light|0.030424 gray|0.030424 light|0.030424 grey|0.030424 honeydew|0.030252 silver|0.029087 gainsboro|0.028465 light|0.027807 cyan|0.027807 gray|0.022466 grey|0.022466 mint|0.022309 cream|0.022309 azure|0.021999 slate|0.021683 gray|0.021683 light|0.020121 slate|0.020121 gray|0.020121 white|0.018666 smoke|0.018666 alice|0.015735 blue|0.015735 pale|0.014452 turquoise|0.014452 white|0.01274 floral|0.01217 white|0.01217 snow|0.011841 powder|0.0098461 blue|0.0098461 ghost|0.009333 white|0.009333 light|0.0082078 steel|0.0082078 blue|0.0082078 sea|0.0068772 shell|0.0068772 ivory|0.0066886 rosy|0.0063321 brown|0.0063321 peach|0.0062487 puff|0.0062487 tan|0.0060901  "
		}
	}
}
