{
	"add": {
		"doc": {
			"id": "4a933a858d41cd1499d759ab9b4ccda34c41d7e9787542e877965a6c9b36f9ec",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/2014-09-15_16-14-55_lion-belfort.jpg/220px-2014-09-15_16-14-55_lion-belfort.jpg",
				"previous": "Arriving at New York Harbor, Bartholdi focused on Bedloe's Island as a site for the statue, struck by the fact that vessels arriving in New York had to sail past it. He was delighted to learn that the island was owned by the United States government—it had been ceded by the New York State Legislature in 1800 for harbor defense. It was thus, as he put it in a letter to Laboulaye: \"land common to all the states.\"[13] As well as meeting many influential New Yorkers, Bartholdi visited President Ulysses S. Grant, who assured him that it would not be difficult to obtain the site for the statue.[14] Bartholdi crossed the United States twice by rail, and met many Americans he felt would be sympathetic to the project.[12] But he remained concerned that popular opinion on both sides of the Atlantic was insufficiently supportive of the proposal, and he and Laboulaye decided to wait before mounting a public campaign.[15]",
				"after": "Bartholdi had made a first model of his concept in 1870.[16] The son of a friend of Bartholdi's, American artist John LaFarge, later maintained that Bartholdi made the first sketches for the statue during his U.S. visit at La Farge's Rhode Island studio. Bartholdi continued to develop the concept following his return to France.[16] He also worked on a number of sculptures designed to bolster French patriotism after the defeat by the Prussians. One of these was the Lion of Belfort, a monumental sculpture carved in sandstone below the fortress of Belfort, which during the war had resisted a Prussian siege for over three months. The defiant lion, 73 feet (22 m) long and half that in height, displays an emotional quality characteristic of Romanticism, which Bartholdi would later bring to the Statue of Liberty.[17]",
			"color": "tan|0.39952 peach|0.17665 puff|0.17665 rosy|0.078059 brown|0.078059 dim|0.053708 gray|0.053708 dim|0.053708 grey|0.053708 bisque|0.052288 burly|0.042579 wood|0.042579 gray|0.039963 grey|0.039963 antique|0.021222 white|0.021222 blanched|0.019409 almond|0.019409  "
		}
	}
}
