{
	"add": {
		"doc": {
			"id": "4a9607e38471488cb96ca8bf6c9db7d10906a8b586559ab8403a2b9696b4c99e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/8marchrallydhaka_%2855%29.JPG/120px-8marchrallydhaka_%2855%29.JPG",
				"previous": "Portal:Society/Featured article/31",
				"after": "Feminism is a collection of movements and ideologies aimed at defining, establishing, and defending equal political, economic, and social rights for women. In addition, feminism seeks to establish equal opportunities for women in education and employment. A Feminist is \"an advocate or supporter of the rights and equality of women\". Feminist theory, which emerged from these feminist movements, aims to understand the nature of gender inequality by examining women's social roles and lived experience; it has developed theories in a variety of disciplines in order to respond to issues such as the social construction of sex and gender. Some of the earlier forms of feminism have been criticized for taking into account only white, middle-class, educated perspectives. This led to the creation of ethnically specific or multiculturalist forms of feminism. Feminist activists campaign for women's rights – such as in contract law, property, and voting – while also promoting bodily integrity, autonomy, and reproductive rights for women. Feminist campaigns have changed societies, particularly in the West, by achieving women's suffrage, gender neutrality in English, equal pay for women, reproductive rights for women (including access to contraceptives and abortion), and the right to enter into contracts and own property. Feminists have worked to protect women and girls from domestic violence, sexual harassment, and sexual assault. They have also advocated for workplace rights, including maternity leave, and against forms of discrimination against women. Feminism is mainly focused on women's issues, but because feminism seeks gender equality, some feminists argue that men's liberation is a necessary part of feminism, and that men are also harmed by sexism and gender roles.",
			"color": "black|0.16659 dark|0.13783 gray|0.13783 dark|0.13783 grey|0.13783 gray|0.090329 grey|0.090329 khaki|0.089178 silver|0.059574 dim|0.055057 gray|0.055057 dim|0.055057 grey|0.055057 dark|0.043133 khaki|0.043133 dark|0.029326 slate|0.029326 gray|0.029326 dark|0.028837 olive|0.028837 green|0.028837 light|0.027666 slate|0.027666 gray|0.027666 slate|0.027123 gray|0.027123 light|0.023803 gray|0.023803 light|0.023803 grey|0.023803 sienna|0.020854 pale|0.020824 golden|0.020824 rod|0.020824 gainsboro|0.01242 teal|0.011167 cadet|0.010047 blue|0.010047 sandy|0.0094086 brown|0.0094086 dark|0.0091235 salmon|0.0091235 indian|0.0086483 red|0.0086483 rosy|0.007535 brown|0.007535 pale|0.0070055 violet|0.0070055 red|0.0070055 thistle|0.0064625  "
		}
	}
}
