{
	"add": {
		"doc": {
			"id": "4ab68afed39efade17a29325be994dcf2f5a5b8230eea61ff029ed782ee21ffd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Serbian_prisoners_in_Jasenovac.jpg/220px-Serbian_prisoners_in_Jasenovac.jpg",
				"previous": "Serbia fought in the Balkan Wars of 1912–13, which forced the Ottomans out of the Balkans and doubled the territory and population of the Kingdom of Serbia. In 1914, a young Bosnian Serb student named Gavrilo Princip assassinated Archduke Franz Ferdinand of Austria, which directly contributed to the outbreak of World War I.[35] In the fighting that ensued, Serbia was invaded by Austria-Hungary. Despite being outnumbered, the Serbs subsequently defeated the Austro-Hungarians at the Battle of Cer, which marked the first Allied victory over the Central Powers in the war.[36] Further victories at the battles of Kolubara and the Drina meant that Serbia remained unconquered as the war entered its second year. However, an invasion by the forces of Germany, Austria-Hungary and Bulgaria overwhelmed the Serbs in the winter of 1915, and a subsequent withdrawal by the Serbian Army through Albania took the lives of more than 240,000 Serbs. Serb forces spent the remaining years of the war fighting on the Salonika Front in Greece, before liberating Serbia from Austro-Hungarian occupation in November 1918.[37]",
				"after": "Serbs subsequently formed the Kingdom of Serbs, Croats and Slovenes with other South Slavic peoples. The country was later renamed the Kingdom of Yugoslavia, and was led from 1921 to 1934 by King Alexander I of the Serbian Karađorđević dynasty.[38] During World War II, Yugoslavia was invaded by the Axis powers in April 1941. The country was subsequently divided into many pieces, with Serbia being directly occupied by the Germans.[39] Serbs in the Independent State of Croatia (NDH) experienced persecution at the hands of the Croatian ultra-nationalist, fascist Ustaše, who attempted to exterminate the Serb population in death camps. More than half a million Serbs were killed in the territory of Yugoslavia during World War II.[40] Serbs in occupied Yugoslavia subsequently formed a resistance movement known as the Yugoslav Army in the Homeland, or the Chetniks. The Chetniks had the official support of the Allies until 1943, when Allied support shifted to the Communist Yugoslav Partisans, a multi-ethnic force, formed in 1941, which also had a large majority of Serbs in its ranks in the first two years of war, later, after the fall of Italy, September 1943. other ethnic groups joined Partisans in larger numbers.[39] At the end of the war, the Partisans, led by the Croat Josip Broz Tito, emerged victorious. Yugoslavia subsequently became a Communist state. Tito died in 1980, and his death saw Yugoslavia plunge into economic turmoil.[41] Yugoslavia disintegrated in the early 1990s, and a series of wars resulted in the creation of five new states. The heaviest fighting occurred in Croatia and Bosnia and Herzegovina, whose Serb populations rebelled and sought unification with Serbia, which was then still part of the Federal Republic of Yugoslavia. The war in Croatia ended in August 1995, with a Croatian military offensive known as Operation Storm crushing the Croatian Serb rebellion and causing as many as 200,000 Serbs to flee the country. The Bosnian War ended that same year, with the Dayton Agreement dividing the country along ethnic lines. In 1998–99, a conflict in Kosovo between the Yugoslav Army and Albanians seeking independence erupted into full-out war, resulting in a 78-day-long NATO bombing campaign which effectively drove Yugoslav security forces from Kosovo.[42] Subsequently, more than 200,000 Serbs and other non-Albanians fled the province.[43] On 5 October 2000, Yugoslav President Slobodan Milosević was overthrown in a bloodless revolt after he refused to admit defeat in the 2000 Yugoslav general election.[44]",
			"color": " "
		}
	}
}
