{
	"add": {
		"doc": {
			"id": "4acce0af017bf625fff2d4f218cf505742ec6820d8b5f69f3a2752ad7a6f2552",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Chetwynd_BC_Highway_97.jpg/220px-Chetwynd_BC_Highway_97.jpg",
				"previous": "The John Hart Highway portion of Highway 97 runs east-west through Chetwynd, connecting the town to Dawson Creek (102 km or 67 mi east) and Prince George (304 km or 185 mi south). Highway 29 (Don Philips Way) runs north-south through Chetwynd, connecting the town to Hudson's Hope (60 km or 34 mi north) and Tumbler Ridge (89 km or 47 mi southeast). The downtown core lies just west of the intersection of Highway 97 and Highway 29. Chetwynd's internal street network has 28 km or 17 mi of paved road[32] which uses the highway as its main arterial road with parallel frontage roads for local trips. A site plan by the province in 1957 laid out the basic structure of the town.[4] The residential areas are separated from the industry and the highway by the use of natural features, such as contours or creeks, and vegetative buffers.",
				"after": "Chetwynd has rail, air, and bus service for regional and provincial transportation needs. Rail lines enter Chetwynd from three directions: from Fort St. John in the north, from Dawson Creek in the east, and from Prince George in the south. Pacific Great Eastern Railway (later BC Rail) ran passenger service to Chetwynd until 1990. Since then the trains have been used solely for moving resources such as lumber and coal. The District of Chetwynd has operated the unmanned Chetwynd Municipal Airport (IATA: YCQ) since 1970. The runway was paved in 1975 but only handles chartered flights and helicopters. A new airport terminal was constructed in 2008 by students at Northern Lights College.[33] The closest airports with commercial airlines are at Fort St. John and Dawson Creek. Greyhound Bus Lines maintain a bus stop in town on their Vancouver-Prince George-Dawson Creek route.",
			"color": "dim|0.50079 gray|0.50079 dim|0.50079 grey|0.50079 gray|0.37898 grey|0.37898 dark|0.052344 gray|0.052344 dark|0.052344 grey|0.052344 slate|0.025247 gray|0.025247 light|0.019708 slate|0.019708 gray|0.019708 dark|0.0095029 slate|0.0095029 gray|0.0095029  "
		}
	}
}
