{
	"add": {
		"doc": {
			"id": "4ad89906aff824a94a9bfc0e0f8ca6dce3ae7d1077154c49940eda1306fcac5d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/S%C3%B6derala_weathervane.jpg/220px-S%C3%B6derala_weathervane.jpg",
				"previous": "The type object most commonly used to define Ringerike Style is a 2.15 m high carved stone from Vang in Oppland. Apart from a runic memorial inscription on its right edge, the main field of the Vang Stone is filled with a balanced tendril ornament springing from two shell spirals at the base: the main stems cross twice to terminate in lobed tendrils. At the crossing, further tendrils spring from loops and pear-shaped motifs appear from the tendril centres on the upper loop. Although axial in conception, a basic asymmetry arises in the deposition of the tendrils. Surmounting the tendril pattern appears a large striding animal in double-contoured rendering with spiral hips and a lip lappet. Comparing the Vang Stone animal design with the related animal from the Mammen axe-head, the latter lacks the axiality seen in the Vang Stone and its tendrils are far less disciplined: the Mammen scroll is wavy, while the Vang scroll appears taut and evenly curved, these features marking a key difference between Mammen and Ringerike ornament. The inter-relationship between the two styles is obvious, however, when comparing the Vang Stone animal with that found on the Jelling Stone.",
				"after": "With regard to metalwork, Ringerike Style is best seen in two copper-gilt weather-vanes, from Källunge, Gotland and from Söderala, Hälsingland. The former displays one face two axially-constructed loops in the form of snakes, which in turn sprout symmetrically-placed tendrils. The snake heads, as well as the animal and snake on the reverse, find more florid treatment than on the Vang Stone: all have lip lappets, the snakes bear pigtails, while all animals have a pear-shaped eye with the point directed towards the snout - a diagnostic feature of Ringerike Style.",
			"color": "black|0.65048 dim|0.068776 gray|0.068776 dim|0.068776 grey|0.068776 tan|0.062684 gray|0.050585 grey|0.050585 dark|0.029521 gray|0.029521 dark|0.029521 grey|0.029521 burly|0.022894 wood|0.022894 wheat|0.01179 silver|0.0090599  "
		}
	}
}
