{
	"add": {
		"doc": {
			"id": "4ae7b1a9ff1ad03b29d303cb7da7bee5c99345f3c2550c8ae47e463af9455d8f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Sterna_hirundo_-Massachusetts%2C_USA_-juvenile-8.jpg/220px-Sterna_hirundo_-Massachusetts%2C_USA_-juvenile-8.jpg",
				"previous": "The common tern breeds in colonies which do not normally exceed 2,000 pairs,[43] but may occasionally number more than 20,000 pairs.[58] Colonies inland tend to be smaller than on the coast. Common terns often nest alongside other coastal species, such as Arctic,[59] roseate and Sandwich terns, black-headed gulls,[60][61] and black skimmers.[62] Especially in the early part of the breeding season, for no known reason, most or all of the terns will fly in silence low and fast out to sea. This phenomenon is called a \"dread\".[43]",
				"after": "On their return to the breeding sites, the terns may loiter for a few days before settling into a territory,[63] and the actual start of nesting may be linked to a high availability of fish.[64] Terns defend only a small area, with distances between nests sometimes being as little as 50 cm (20 in), although 150–350 cm (59–138 in) is more typical. As with many birds, the same site is re-used year after year, with a record of one pair returning for 17 successive breeding seasons. Around 90% of experienced birds reuse their former territory, so young birds must nest on the periphery, find a bereaved mate, or move to another colony.[63] A male selects a nesting territory a few days after his arrival in the spring, and is joined by his previous partner unless she is more than five days late, in which case the pair may separate.[65]",
			"color": "silver|0.29883 light|0.2673 gray|0.2673 light|0.2673 grey|0.2673 gainsboro|0.18878 dark|0.10072 gray|0.10072 dark|0.10072 grey|0.10072 gray|0.03631 grey|0.03631 dim|0.029707 gray|0.029707 dim|0.029707 grey|0.029707 black|0.024587 linen|0.014997 white|0.0046581 smoke|0.0046581 antique|0.0044757 white|0.0044757 light|0.0044093 steel|0.0044093 blue|0.0044093 sea|0.0039167 shell|0.0039167  "
		}
	}
}
