{
	"add": {
		"doc": {
			"id": "4af277964c7fe74c3b2d3390f4dc612829df949fdc323dd4d34714a526bfa028",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/N961AM21042014LHR_%2813962839991%29.jpg/220px-N961AM21042014LHR_%2813962839991%29.jpg",
				"previous": "On 29 June 2006, the International Lease Finance Corporation (ILFC) and Aeroméxico announced that the airline will operate 3 Boeing 787 Dreamliners. Aeroméxico will lease the 5 787-8s from ILFC with deliveries scheduled to begin in early 2012, another 2 planes on lease from ILFC will be in service by 2013, and 2 more in 2014. It was originally going to be delivered in 2010 and 2011, but it was delayed for 2 years. From 2006, Consorcio Aeroméxico S.A. de C.V., the parent company of Aeroméxico at the time, was facing large debts and could not make any profits to pay them off. This forced the company to offer Aeroméxico for sale in 2007. In early October, a week-long auction was held, with Grupo Financiero Banamex competing against the Saba family. Finally, in 17 October 2007, Banamex had put forward the highest bid, and the airline was sold to the bank for US$249.1 million. In October, 2010 Aeromexico's largest competitor Mexicana de Aviacion filed for bankruptcy and was placed into administration.",
			"after": [
				"Delta Air Lines, a US airline, signed with Aeroméxico for commercial alliances.",
				"On 25 July 2012, Andrés Conesa, Aeromexico CEO announced the purchase of 10 Boeing 787-9 Dreamliner, albeit 6 firm orders and 4 options; with this, the company will become the first Mexican carrier to have this kind of equipment. In early July 2012 it was reported that the company was looking at Airbus A320 and A350, but ultimately decided on the aircraft manufacturer Boeing. The new order is added to the package of 20 aircraft that the company had announced in 2011 and nine more Boeing 787-8 Dreamliner already provided. The delivery of the Dreamliners began in the summer of 2013. The total investment is US$11 billion and that includes the acquisition of 90 Boeing 737-8 MAX which will be delivered during 2018.[13][14] The airline took delivery of its first Boeing 787-8 Dreamliner (albeit leased from ILFC) in early August 2013 and officially launched commercial service on 1 October 2013.[15]"
			],
			"color": "dim|0.28489 gray|0.28489 dim|0.28489 grey|0.28489 gray|0.088543 grey|0.088543 light|0.059672 gray|0.059672 light|0.059672 grey|0.059672 silver|0.057262 gainsboro|0.053339 dark|0.048856 gray|0.048856 dark|0.048856 grey|0.048856 white|0.032692 smoke|0.032692 sea|0.028096 shell|0.028096 black|0.027663 snow|0.026577 floral|0.024972 white|0.024972 linen|0.023848 white|0.02358 mint|0.023181 cream|0.023181 ghost|0.023122 white|0.023122 alice|0.021601 blue|0.021601 lavender|0.017747 blush|0.017747 azure|0.017313 slate|0.011632 gray|0.011632 lavender|0.011004 dark|0.010697 olive|0.010697 green|0.010697 old|0.01063 lace|0.01063  "
		}
	}
}
