{
	"add": {
		"doc": {
			"id": "4b0092671eb0cabd44c5ebd930161e607f4104d26cfca68954de63075a4dd9fd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Geocoin_at_Spier%27s.JPG/220px-Geocoin_at_Spier%27s.JPG",
				"previous": "For the traditional geocache, a geocacher will place a waterproof container containing a log book (with pen or pencil) and trade items then record the cache's coordinates. These coordinates, along with other details of the location, are posted on a listing site (see list of some sites below). Other geocachers obtain the coordinates from that listing site and seek out the cache using their GPS handheld receivers. The finding geocachers record their exploits in the logbook and online, but then must return the cache to the same coordinates so that other geocachers may find it. Geocachers are free to take objects (except the logbook, pencil, or stamp) from the cache in exchange for leaving something of similar or higher value.",
				"after": "Typical cache \"treasures\" are not high in monetary value but may hold personal value to the finder. Aside from the logbook, common cache contents are unusual coins or currency, small toys, ornamental buttons, CDs, or books. Also common are objects that are moved from cache to cache called \"hitchhikers\", such as Travel Bugs or Geocoins, whose travels may be logged and followed online. Cachers who initially place a Travel Bug or Geocoins often assign specific goals for their trackable items. Examples of goals are to be placed in a certain cache a long distance from home, or to travel to a certain country, or to travel faster and farther than other hitchhikers in a race. Higher value items are occasionally included in geocaches as a reward for the First to Find (called \"FTF\"), or in locations which are harder to reach. Dangerous or illegal items, weapons, food and drugs are generally not allowed and are specifically against the rules of most geocache listing sites.",
			"color": "black|0.28102 dim|0.16035 gray|0.16035 dim|0.16035 grey|0.16035 gray|0.15478 grey|0.15478 dark|0.13932 gray|0.13932 dark|0.13932 grey|0.13932 silver|0.074296 light|0.049869 gray|0.049869 light|0.049869 grey|0.049869 gainsboro|0.033243 slate|0.015808 gray|0.015808 antique|0.011862 white|0.011862 linen|0.011258 light|0.010982 slate|0.010982 gray|0.010982 old|0.0066287 lace|0.0066287 sea|0.006497 shell|0.006497 white|0.005722 smoke|0.005722 floral|0.0053567 white|0.0053567 beige|0.0039442  "
		}
	}
}
