{
	"add": {
		"doc": {
			"id": "4b00485531aef20aa1de2e80cc6e9d22184b810da12b94652e2b00fc2b65b72e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/US_Navy_050423-N-6214F-004_Aviation_Boatswain%27s_Mate_2nd_Class_Courtney_F._Godfrey_runs_behind_the_foul_line_as_a_Marine_Corps_AV-8B_Harrier_II-_performs_a_vertical_takeoff.jpg/220px-thumbnail.jpg",
				"previous": "Vertical takeoff refers to aircraft or rockets that take off in a vertical trajectory. Vertical takeoff eliminates the need for airfields. Most vertical take off aircraft are also able to land vertically, but there were certain rocket-powered aircraft of the Luftwaffe that only took off vertically, landing in other ways. The Bachem Ba 349 Natter landed under a parachute after having taken off vertically. Other late Third Reich projects, such as the Heinkel P.1077 Julia or the Focke-Wulf Volksjäger 2 climbed to their ceiling at a nearly vertical angle and landed later on a skid.[1]",
				"after": "Vertical take-off and landing (VTOL) aircraft include fixed-wing aircraft that can hover, take off and land vertically as well as helicopters and other aircraft with powered rotors, such as tiltrotors.[2][3][4][5] Some VTOL aircraft can operate in other modes as well, such as CTOL (conventional take-off and landing), STOL (short take-off and landing), and/or STOVL (short take-off and vertical landing). Others, such as some helicopters, can only operate by VTOL, due to the aircraft lacking landing gear that can handle horizontal motion. VTOL is a subset of V/STOL (vertical and/or short take-off and landing).",
			"color": "light|0.20615 blue|0.20615 powder|0.16984 blue|0.16984 light|0.12906 steel|0.12906 blue|0.12906 light|0.08709 cyan|0.08709 dim|0.075588 gray|0.075588 dim|0.075588 grey|0.075588 black|0.066303 alice|0.052794 blue|0.052794 azure|0.05128 gray|0.041446 grey|0.041446 dark|0.03842 gray|0.03842 dark|0.03842 grey|0.03842 mint|0.023906 cream|0.023906 silver|0.013196 sky|0.0097774 blue|0.0097774 white|0.0086526 smoke|0.0086526 dark|0.0047692 slate|0.0047692 gray|0.0047692 honeydew|0.0045788 light|0.0043908 gray|0.0043908 light|0.0043908 grey|0.0043908  "
		}
	}
}
