{
	"add": {
		"doc": {
			"id": "4b1edb5df4502254f79efa3bf83887a7e34b2e2e32bcdc3f59ad9b2fd44c91ad",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Pioneer_square.jpg/170px-Pioneer_square.jpg",
				"previous": "The second and most dramatic boom and bust resulted from the Klondike Gold Rush, which ended the depression that had begun with the Panic of 1893; in a short time, Seattle became a major transportation center. On July 14, 1897, the S.S. Portland docked with its famed \"ton of gold\", and Seattle became the main transport and supply point for the miners in Alaska and the Yukon. Few of those working men found lasting wealth, however; it was Seattle's business of clothing the miners and feeding them salmon that panned out in the long run. Along with Seattle, other cities like Everett, Tacoma, Port Townsend, Bremerton, and Olympia, all in the Puget Sound region, became competitors for exchange, rather than mother lodes for extraction, of precious metals.[34] The boom lasted well into the early part of the 20th century and funded many new Seattle companies and products. In 1907, 19-year-old James E. Casey borrowed $100 from a friend and founded the American Messenger Company (later UPS). Other Seattle companies founded during this period include Nordstrom and Eddie Bauer.[31]",
				"after": "The Gold Rush era culminated in the Alaska-Yukon-Pacific Exposition of 1909, which is largely responsible for the layout of today's University of Washington campus.[35]",
			"color": "white|0.081466 smoke|0.081466 light|0.078977 gray|0.078977 light|0.078977 grey|0.078977 gainsboro|0.077744 sea|0.07334 shell|0.07334 snow|0.069592 ghost|0.066606 white|0.066606 silver|0.066047 floral|0.063828 white|0.063828 lavender|0.063008 blush|0.063008 white|0.062748 alice|0.060799 blue|0.060799 mint|0.057841 cream|0.057841 dark|0.049648 gray|0.049648 dark|0.049648 grey|0.049648 azure|0.044159 linen|0.041539 gray|0.020031 grey|0.020031 old|0.007747 lace|0.007747 dim|0.0066887 gray|0.0066887 dim|0.0066887 grey|0.0066887 ivory|0.0044865 misty|0.0028855 rose|0.0028855  "
		}
	}
}
