{
	"add": {
		"doc": {
			"id": "4b1ef2a11546a61f62485962b658579613aaa8b0926bd7dc1f514ba13b3079aa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Presque_Isle_Waterworks_Lighthouse.jpg/220px-Presque_Isle_Waterworks_Lighthouse.jpg",
				"previous": "In 1908, Erie started building a waterworks on Presque Isle to provide fresh water for the city. Water from Lake Erie was pumped into two reservoirs on the peninsula, where particulates in the water were allowed to settle, removing them from the lake water. After treatment, the water flowed into the waterlines of the city. In 1917 a pumphouse powered by a steam boiler and engine was built: this pumped the water from one basin into the other, then across Presque Isle Bay to Erie. This system of supplying drinking water for Erie operated until 1949. The pumphouse is now used for zebra mussel control and as a concession stand for bicycle and quadracycle-rentals within the state park.[3]",
				"after": "As Pennsylvania's only surf beach, the Presque Isle beaches were already a popular attraction when the state legislature authorized the creation of the \"Pennsylvania State Park at Erie\" in May 1921.[16] Oversight was given to the new \"State Park and Harbor Commission of Erie\", including local representation, instead of to the state Department of Forests and Waters. Presque Isle quickly became the most popular state park in Pennsylvania. Presque Isle was an early example of locating state parks near cities, a trend that would become prevalent statewide only in the 1960s.[17]",
			"color": "dark|0.16854 gray|0.16854 dark|0.16854 grey|0.16854 silver|0.16103 light|0.14004 gray|0.14004 light|0.14004 grey|0.14004 gainsboro|0.10133 light|0.0874 steel|0.0874 blue|0.0874 light|0.057923 slate|0.057923 gray|0.057923 black|0.048261 tan|0.034059 gray|0.033877 grey|0.033877 slate|0.031759 gray|0.031759 dim|0.020421 gray|0.020421 dim|0.020421 grey|0.020421 lavender|0.02016 white|0.016749 smoke|0.016749 lavender|0.011686 blush|0.011686 ghost|0.0080965 white|0.0080965 linen|0.0080139 burly|0.0074603 wood|0.0074603 alice|0.0069539 blue|0.0069539 sea|0.0065368 shell|0.0065368 snow|0.0063981 wheat|0.0038548  "
		}
	}
}
