{
	"add": {
		"doc": {
			"id": "4b2f216d9805d2700b296b5f74a3130cd18da82bf704cb15098575319bab4d3b",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/b/bf/Belton_Tyreconnelfamily.jpg/220px-Belton_Tyreconnelfamily.jpg",
				"previous": "Belton House remained relatively untouched during this period, largely owing to the failing fortunes of the Brownlow family. The 3rd Earl Brownlow and his Countess lived for only a few months of the year at Belton, where they came for the fox-hunting, and divided the remainder of their time between their house in London and Ashridge, another country house in Hertfordshire. Ashridge, a huge Gothic revival pile, had come to the Brownlows in the 19th century through the Egerton family. It was sold, with its art collection and furnishings, to pay the death duties arising on the death of the 3rd Earl in 1921. Hence Belton became the Brownlow's sole country home. Further death duties were incurred in 1927 on the death of the 3rd Earl's successor, his second cousin Adelbert Cust, 5th Baron Brownlow.[50]",
				"after": "In the ensuing period many thousands of country houses of great architectural value were demolished, or had whole wings razed to the ground. In 1955 alone one house was demolished every five days.[52] In this respect Belton was fortunate to survive at all, as in addition to the family's problems, the house deteriorated to such an extent that in 1961 the 6th Baron employed the architect Francis Johnson to oversee a large restoration program lasting three years. Not only was the roof repaired but much of the panelling taken down and repaired, and new cornices installed. Also attempts were made to curtail serious infestations of dry rot.[53] By the time of the death of the 6th Baron in 1978, the resultant death duties, coupled with the rising costs of the upkeep, made Belton too much for the Brownlow family.",
			"color": "black|0.32651 pale|0.066193 golden|0.066193 rod|0.066193 light|0.050857 golden|0.050857 rod|0.050857 yellow|0.050857 beige|0.039877 tan|0.039195 lemon|0.036786 chiffon|0.036786 dark|0.033146 olive|0.033146 green|0.033146 wheat|0.032103 burly|0.024962 wood|0.024962 honeydew|0.021214 corn|0.02043 silk|0.02043 mint|0.02029 cream|0.02029 white|0.020014 smoke|0.020014 light|0.018913 yellow|0.018913  "
		}
	}
}
