{
	"add": {
		"doc": {
			"id": "4b3847b28d3a19c0d239afec8e027e06d2d47d5193848adc0d3ea3fb113cea9e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Gorgosaurus_BW.jpg/220px-Gorgosaurus_BW.jpg",
				"previous": "Gorgosaurus teeth were typical of all known tyrannosaurids. The eight premaxillary teeth at the front of the snout were smaller than the rest, closely packed and D-shaped in cross section. In Gorgosaurus, the first tooth in the maxilla was also shaped like the premaxillary teeth. The rest of the teeth were oval in cross section, rather than blade-like as in most other theropods.[2] Along with the eight premaxillary teeth, Gorgosaurus had 26 to 30 maxillary teeth and 30 to 34 teeth in the dentary bones of the lower jaw. This number of teeth is similar to Albertosaurus and Daspletosaurus but is fewer than those of Tarbosaurus or Tyrannosaurus.[6]",
				"after": "Gorgosaurus shared its general body plan with all other tyrannosaurids. Its massive head was perched on the end of an S-shaped neck. In contrast to its large head, its forelimbs were very small. The forelimbs had only two digits, although a third metacarpal is known in some specimens, the vestigial remains of the third digit seen in other theropods. Gorgosaurus had four digits on each hindlimb, including a small first toe (hallux) which did not contact the ground. Tyrannosaurid hindlimbs were long relative to overall body size compared with other theropods.[2] The largest known Gorgosaurus femur measured 105 cm (41 in) long. In several smaller specimens of Gorgosaurus, the tibia was longer than the femur, a proportion typical of fast-running animals.[1] The two bones were of equal length in the largest specimens.[7] The long, heavy tail served as a counterweight to the head and torso and placed the center of gravity over the hips.[2]",
			"color": "dark|0.55837 gray|0.55837 dark|0.55837 grey|0.55837 tan|0.13721 gray|0.13446 grey|0.13446 silver|0.0385 black|0.029803 light|0.019141 gray|0.019141 light|0.019141 grey|0.019141 dim|0.012977 gray|0.012977 dim|0.012977 grey|0.012977 wheat|0.012544 antique|0.012212 white|0.012212 gainsboro|0.011936  "
		}
	}
}
