{
	"add": {
		"doc": {
			"id": "4b44f8ceb2c944588914c20541d731815269aff4a18fc1ba95488d784870be3c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Sanjak_of_Albania_Map_1431.svg/200px-Sanjak_of_Albania_Map_1431.svg.png",
			"previous": [],
				"after": "At the dawn of the establishment of the Ottoman Empire in Southeast Europe, the geopolitical landscape was marked by scattered kingdoms of small principalities. The Ottomans erected their garrisons throughout southern Albania by 1415 and established formal jurisdiction over most of Albania by 1431.[61] However, on 1443 a great and longstanding revolt broke under the lead of the Albanian national hero Skanderbeg, which lasted until 1479, many times defeating major Ottoman armies led by sultans Murad II and Mehmed II. Skanderbeg united initially the Albanian princes and later established a centralized authority over most of the non-conquered territories, becoming Lord of Albania. He also tried relentlessly but rather unsuccessfully to create a European coalition against the Ottomans. He frustrated every attempt by the Turks to regain Albania, which they envisioned as a springboard for the invasion of Italy and western Europe. His unequal fight against the mightiest power of the time won the esteem of Europe as well as some support in the form of money and military aid from Naples, the papacy, Venice, and Ragusa.[62] Finally after decades of resistance, Ottomans captured Shkodër in 1479 and Durrës in 1501.[63] Skanderbeg’s long struggle to keep Albania free became highly significant to the Albanian people, as it strengthened their solidarity, made them more conscious of their national identity, and served later as a great source of inspiration in their struggle for national unity, freedom, and independence.[62][64] The invasion triggered a several waves of migration of Albanians from Albania, Epir and Peoponesse to the south of Italy, constituting an Arbereshe community. Albanians were recruited all over Europe as a light cavalry known as stratioti. The stratioti were pioneers of light cavalry tactics during this era. In the early 16th century heavy cavalry in the European armies was principally remodeled after Albanian stradioti of the Venetian army, Hungarian hussars and German mercenary cavalry units (Schwarzreitern).[65] By the 16th century, Ottoman rule over Southeast Europe was largely secure. The Ottomans proceeded in stages, first appointing a qadi along with governors and then military retainers in the cities. Timar holders, not necessarily converts to Islam, would occasionally rebel, the most famous case of which is Skanderbeg. His figure would be used later in the 19th century as a central component of Albanian national identity. Ottoman control over the Albanian territories was secured in 1571 when Ulcinj, presently in Montenegro, was captured. The most significant impact on the Albanians was the gradual Islamisation process of a large majority of the population- although such a process only became widespread in the 17th century.[66] Mainly Catholics converted in the 17th century, while the Orthodox Albanians became Muslim mainly in the following century. Initially confined to the main city centres of Elbasan and Shkodër, by this time the countryside was also embracing the new religion.[66] In Elbasan Muslims made up just over half the population in 1569–70 whereas in Shkodër this was almost 90% and in Berat closer to 60%. In the 17th century, however, Catholic conversion to Islam increased, even in the countryside. The motives for conversion according to scholars were diverse, depending on the context. The lack of source-material does not help when investigating such issues.[66] Albanians could also be found across the empire, in Egypt, Algeria, and across the Maghreb as vital military and administrative retainers.[67]",
			"color": "antique|0.091528 white|0.091528 linen|0.089798 papaya|0.089596 whip|0.089596 old|0.089446 lace|0.089446 blanched|0.08925 almond|0.08925 beige|0.08914 sea|0.088963 shell|0.088963 corn|0.088743 silk|0.088743 floral|0.088694 white|0.088694 misty|0.084132 rose|0.084132 dark|0.042833 sea|0.042833 green|0.042833 dark|0.039395 olive|0.039395 green|0.039395 olive|0.014441 drab|0.014441  "
		}
	}
}
