{
	"add": {
		"doc": {
			"id": "4b4ed074b8d5daa79067e9ebfab35f413ba35fdc37ef9818829fa7d37625a9e5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Abrolhos_North-Island2.jpg/220px-Abrolhos_North-Island2.jpg",
				"previous": "Stokes explicitly stated the tammar wallaby to be absent from North Island in 1840,[2] and it was not recorded by the Percy Sladen Trust Expedition in 1913. It was apparently introduced to the island in the 1920s, as early fishermen reported seeing it between 1928 and 1930. This introduction failed, possibly due to overgrazing.[6] The species was not found by Serventy during his 1945 visit, nor by Storr in 1959, but the latter found plenty of remains, mostly mandibles. Storr interpreted these remains as predating the 1920s introduction, suggesting that a native population of tammars became extinct on the island before 1840.[5] Albert Russell Main agreed,[21] but the theory has not been accepted by later researchers.[6][22]",
				"after": "In 1985, five tammar wallabies were introduced onto North Island, and the population established successfully. Possible reasons for this success include the absence of the wallabies' natural predator, the carpet python (Morelia spilota imbricata);[23] the availability of additional food and water from the fishers' huts, which are occupied during the harshest time of the year; and the presence of the air strip, which apparently provides additional food for them.[6] By the 2000s, there were over 450 tammar wallabies on the island.[24] The wallabies overgrazed and ringbarked the native vegetation, particularly the area burnt in 1935,[6] thus reducing vegetation cover and causing a serious decline in populations of some plant species. In 2003, island residents asked the Department of Conservation and Land Management (CALM; now the Department of Environment and Conservation) for help in managing the issue. CALM staff visited the island in April and May of that year and produced a report recommending an investigation into controlling population levels by the use of implanted contraceptives.[6] Exploration of this option began in 2005,[23] but in July 2007 the research was discontinued. Around 60 wallabies were removed to educational institutions for research purposes, and culling began.[25] By February 2008, the wallaby population had been reduced to around 25 individuals.[24]",
			"color": "dim|0.43129 gray|0.43129 dim|0.43129 grey|0.43129 gray|0.27068 grey|0.27068 dark|0.12893 olive|0.12893 green|0.12893 dark|0.11209 gray|0.11209 dark|0.11209 grey|0.11209 silver|0.024028 black|0.015808  "
		}
	}
}
