{
	"add": {
		"doc": {
			"id": "4b506f9f3b55b35ead15f0d0f18bec77e7ce5d8bf7d214515128348a5506e2dd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Medieval_baker.jpg/220px-Medieval_baker.jpg",
				"previous": "One of the most common constituents of a medieval meal, either as part of a banquet or as a small snack, were sops, pieces of bread with which a liquid like wine, soup, broth, or sauce could be soaked up and eaten. Another common sight at the medieval dinner table was the frumenty, a thick wheat porridge often boiled in a meat broth and seasoned with spices. Porridges were also made of every type of grain and could be served as desserts or dishes for the sick, if boiled in milk (or almond milk) and sweetened with sugar. Pies filled with meats, eggs, vegetables, or fruit were common throughout Europe, as were turnovers, fritters, doughnuts, and many similar pastries. By the Late Middle Ages biscuits (cookies in the U.S.) and especially wafers, eaten for dessert, had become high-prestige foods and came in many varieties. Grain, either as bread crumbs or flour, was also the most common thickener of soups and stews, alone or in combination with almond milk.",
				"after": "The importance of bread as a daily staple meant that bakers played a crucial role in any medieval community. Bread consumption was high in most of Western Europe by the 14th century. Estimates of bread consumption from different regions are fairly similar: around 1 to 1.5 kilograms (2.2 to 3.3 lb) of bread per person per day. Among the first town guilds to be organized were the bakers', and laws and regulations were passed to keep bread prices stable. The English Assize of Bread and Ale of 1266 listed extensive tables where the size, weight, and price of a loaf of bread were regulated in relation to grain prices. The baker's profit margin stipulated in the tables was later increased through successful lobbying from the London Baker's Company by adding the cost of everything from firewood and salt to the baker's wife, house, and dog. Since bread was such a central part of the medieval diet, swindling by those who were trusted with supplying the precious commodity to the community was considered a serious offense. Bakers who were caught tampering with weights or adulterating dough with less expensive ingredients could receive severe penalties. This gave rise to the \"baker's dozen\": a baker would give 13 for the price of 12, to be certain of not being known as a cheat.[50]",
			"color": "peru|0.19971 sandy|0.1823 brown|0.1823 sienna|0.16721 chocolate|0.081348 dark|0.060434 slate|0.060434 gray|0.060434 coral|0.056217 khaki|0.042364 pale|0.038883 golden|0.038883 rod|0.038883 saddle|0.028477 brown|0.028477 dark|0.027339 khaki|0.027339 burly|0.01835 wood|0.01835 wheat|0.014414 navajo|0.010962 white|0.010962 tan|0.01067  "
		}
	}
}
