{
	"add": {
		"doc": {
			"id": "4b7b7cdcd583758cd1c1c872e5837335230e78fa2184302cd52d96c993a76163",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Canterbury_Museum1.jpg/300px-Canterbury_Museum1.jpg",
				"previous": "In 1872 Mountfort became a founding member of the Canterbury Association of Architects, a body which was responsible for all subsequent development of the new city. Mountfort was now at the pinnacle of his career.[20] Mountfort notably altered the use of a segmented arch rather than one in the Romanesque style; the latter of which was considered by Augustus Pugin to be fundamentally important to the Gothic style. The college posed a challenge in its main hall; on the hall's completion in 1882, it was the largest public space in Christchurch.[36] Additionally, a level of detail not possible in previous works was present in the hall's design due to the superior funding for the college. The completion of the first stage was met with praise and optimism, though extensions such as a biological lab were added in the early 1890s.[37] By the 1880s, Mountfort was hailed as New Zealand's premier ecclesiastical architect, with over forty churches to his credit.",
				"after": "In 1888, he designed St John's Cathedral in Napier.[4] This brick construction was demolished in the disastrous 1931 earthquake that destroyed much of Napier.[38] Between 1886 and 1897, Mountfort worked on one of his largest churches, the wooden St Mary's, the cathedral church of Auckland. Covering 9,000 square feet (840 m2), St Mary's is the largest and last timber church built by Mountfort,[39] and the largest wooden Gothic church in the world.[4] At its completion, it was said that \"in point of design, completeness and beauty [it] reaches a high level mark not yet approached in the diocese\". The emphasis placed on the sweeping roof by the great aisle windows struck a balance to the great area the church enclosed. In 1982 the entire church, complete with its stained glass windows, was transported to a new site, across the road from its former position where a new cathedral was to be built. St Mary's church was consecrated in 1898, one of Mountfort's final grand works.[40]",
			"color": " "
		}
	}
}
