{
	"add": {
		"doc": {
			"id": "4b8a0db92cb888da68e3b06390814d00cd04d0b3976e69cb788dccd958ac2214",
			"url": "https://upload.wikimedia.org/wikipedia/en/timeline/cf83340227eef2b57716c25ae28d8133.png",
			"previous": [],
				"after": "The 1950s was a period of rapid growth for IAM. The production of jet engines during the war led IAM to expand to the aircraft industry. By 1958, IAM had more than 900,000 members. This was due to the fact that IAM took steps to begin to move away from its racist past. In 1955, under the leadership of President Al Hayes IAM became more of an industrial union it began to shift from railroad to metal fabrication. IAM had more union members as well as workers in the aircraft industry. Thus, Aerospace workers were attracted to join IAM. In 1964, IAM changed its name to the International Association of Machinists and Aerospace Workers. IAMAW began to strike against five major airlines, including Eastern, National, Northwest, Trans World, and United Airlines. 35,400 IAMAW members in 231 cities grounded the airlines for 43 days finally winning 5% raises in three successive years.[16] IAM membership nearly doubled in the 1950s, in large part due to the burgeoning airline industry, from 501,000 members in 1949 to 903,000 members in 1958. As a result of the influx of members from the airlines and the new American space program, the delegates voted to change the name to the International Association of Machinists and Aerospace Workers at the 1964 convention.[17] In 1982, due to individual and corporate bankruptcies IAM membership dropped to 820,211 from a high of 927,000 in 1973.[18] Also, in 1982 boycott was initiated by the IAM against Brown & Sharpe, a machine, precision, measuring and cutting tool manufacturer, headquartered in Rhode Island. The boycott was called after the firm refused to bargain in good faith (withdrawing previously negotiated clauses in the contract), and forced the union into a strike, during which police sprayed pepper gas on some 800 picketers at the company's North Kingston plant in early 1982. Three weeks later, a machinist narrowly escaped serious injury when a shot fired into the picket line hit his belt buckle.",
			"color": "white|0.070982 snow|0.06685 mint|0.061317 cream|0.061317 ghost|0.059905 white|0.059905 azure|0.05914 alice|0.058468 blue|0.058468 white|0.05825 smoke|0.05825 gainsboro|0.057708 light|0.057317 gray|0.057317 light|0.057317 grey|0.057317 sea|0.056296 shell|0.056296 floral|0.056178 white|0.056178 silver|0.049334 lavender|0.039695 blush|0.039695 gold|0.02329 ivory|0.022122 lime|0.020039 green|0.020039 pink|0.019359 light|0.019034 steel|0.019034 blue|0.019034 lavender|0.018563 red|0.01596 dim|0.014719 gray|0.014719 dim|0.014719 grey|0.014719 misty|0.010827 rose|0.010827 light|0.0077141 pink|0.0077141 light|0.0070245 blue|0.0070245 linen|0.0061828 light|0.0055421 cyan|0.0055421 light|0.0053739 golden|0.0053739 rod|0.0053739 yellow|0.0053739 honeydew|0.005084 lemon|0.005067 chiffon|0.005067 khaki|0.0048768 beige|0.0041677 old|0.0032749 lace|0.0032749 rosy|0.0031329 brown|0.0031329 antique|0.0030849 white|0.0030849  "
		}
	}
}
