{
	"add": {
		"doc": {
			"id": "4b9490cb7bbfc68584457a2152aabf58ef6f55d4d1d48cced5cb7747d43e16eb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Tomcats_DS_tanking_DN-ST-91-07919.jpg/170px-Tomcats_DS_tanking_DN-ST-91-07919.jpg",
			"previous": [],
				"after": "During the time of Operation Desert Shield, the military buildup to the Persian Gulf War, US Air Force Boeing KC-135s & McDonnell Douglas KC-10As, and USMC KC-130 Hercules aircraft were deployed to forward air bases in England, Diego Garcia, and Saudi Arabia. Aircraft stationed in Saudi Arabia normally maintained an orbit in the Saudi–Iraqi neutral zone, informally known as \"Frisbee\", and refueled Coalition Aircraft whenever necessary. Two side by side tracks over central Saudi Arabia called \"Prune\" and \"Raisin\" featured 2–4 basket equipped KC-135 tankers each and were used by Navy aircraft from the Red Sea Battle Force. Large Navy strike groups from the Red Sea would send A-6 tankers to the Prune and Raisin tracks ahead of the strike aircraft arriving to top off and take up station to the right of the Air Force tankers thereby providing an additional tanking point. RAF Handley Page Victor and Vickers VC10 tankers were also used to refuel British and coalition aircraft and were popular with the US Navy for their docile basket behavior and having three point refueling stations. An additional track was maintained close to the northwest border for the E-3 AWACS aircraft and any Navy aircraft needing emergency fuel. These 24-hour air-refueling zones helped make the intense air campaign during Operation Desert Storm possible. An additional 24/7 tanker presence was maintained over the Red Sea itself to refuel Navy F-14 Tomcats maintaining Combat Air Patrol tracks. During the last week of the conflict, KC-10 tankers moved inside Iraq to support barrier CAP missions set up to block Iraqi fighters from escaping to Iran.",
			"color": "light|0.2795 gray|0.2795 light|0.2795 grey|0.2795 gainsboro|0.20834 silver|0.20748 dark|0.036086 gray|0.036086 dark|0.036086 grey|0.036086 light|0.032934 blue|0.032934 powder|0.028242 blue|0.028242 white|0.026741 smoke|0.026741 sky|0.023844 blue|0.023844 alice|0.019829 blue|0.019829 ghost|0.014846 white|0.014846 linen|0.013255 snow|0.01265 sea|0.012616 shell|0.012616 black|0.01088 lavender|0.010226 blush|0.010226 white|0.0091113 lavender|0.0080883 mint|0.0077737 cream|0.0077737 floral|0.0077089 white|0.0077089 gray|0.0075323 grey|0.0075323 azure|0.0071552 dim|0.0039466 gray|0.0039466 dim|0.0039466 grey|0.0039466  "
		}
	}
}
