{
	"add": {
		"doc": {
			"id": "4b991329e285c10a9fbdcbddd36e7c2e883233d7a160913664416a263e087af2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Crex_crex00.jpg/170px-Crex_crex00.jpg",
				"previous": "The corn crake winters mainly in Africa, from the Democratic Republic of the Congo and central Tanzania south to eastern South Africa. North of this area, it is mainly seen on migration, but occasionally winters in North Africa and to the west and north of its core area in southeast Africa. Most of the South African population of about 2,000 birds occurs in KwaZulu-Natal and the former Transvaal Province, and numbers elsewhere in Africa are uncertain. There are several nineteenth-century records, when populations were much higher than now, of birds being seen in western Europe, mainly Britain and Ireland, between December and February.[22]",
				"after": "This crake migrates to Africa along two main routes: a western route through Morocco and Algeria, and a more important flyway through Egypt. On passage, it has been recorded in most countries between its breeding and wintering ranges, including much of West Africa.[12] Birds from Coll following the western route paused in West Africa on their way further south, and again on the return flight, when they also rested in Spain or North Africa.[23] Eastern migrants have been recorded in those parts of southern Asia that lie between the east of the breeding range and Africa. Further afield, the corn crake has been recorded as a vagrant to Sri Lanka, Vietnam and Australia,[21] the Seychelles,[24] Bermuda,[25] Canada, the US, Greenland,[12] Iceland, the Faroes, the Azores, Madeira, and the Canary Islands.[22]",
			"color": "black|0.22507 dark|0.14238 gray|0.14238 dark|0.14238 grey|0.14238 rosy|0.11729 brown|0.11729 gray|0.095711 grey|0.095711 tan|0.086926 cadet|0.048379 blue|0.048379 dark|0.043587 slate|0.043587 gray|0.043587 dim|0.029388 gray|0.029388 dim|0.029388 grey|0.029388 burly|0.027907 wood|0.027907 sienna|0.018737 saddle|0.014095 brown|0.014095 teal|0.012774 dark|0.012378 cyan|0.012378 sea|0.01234 green|0.01234 silver|0.012076 peach|0.011318 puff|0.011318  "
		}
	}
}
