{
	"add": {
		"doc": {
			"id": "4bb58311853a38523c4a13710048184e91c7fdd119b1e24e9cee28b4b0777530",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/LambeosaurusDB.jpg/220px-LambeosaurusDB.jpg",
				"previous": "In build, Lambeosaurus was like other hadrosaurids, and could move on both two legs and all fours, as shown by footprints of related animals. It had a long tail stiffened by ossified tendons that prevented it from drooping. The hands had four fingers, lacking the innermost finger of the generalized five-fingered tetrapod hand, while the second, third, and fourth fingers were bunched together and bore hooves, suggesting the animal could have used the hands for support. The fifth finger was free and could be used to manipulate objects. Each foot had only the three central toes.[4]",
				"after": "The most distinctive feature, the crest, was different in the two well-known species. In L. lambei, it had a hatchet-like shape when the dinosaur was full-grown, and was somewhat shorter and more rounded in specimens interpreted as females.[2] The \"hatchet blade\" projected in front of the eyes, and the \"handle\" was a solid bony rod that jutted out over the back of the skull. The \"hatchet blade\" had two sections: the uppermost portion was a thin bony \"coxcomb\" that grew out relatively late in life, when an individual neared adulthood; and the lower portion held hollow spaces that were continuations of the nasal passages.[2] In L. magnicristatus, the \"handle\" was greatly reduced, and the \"blade\" expanded,[5] forming a tall, exaggerated pompadour-like crest. This crest is damaged in the best overall specimen, and only the front half remains.[6]",
			"color": "dark|0.21004 khaki|0.21004 black|0.16259 tan|0.11445 pale|0.10524 golden|0.10524 rod|0.10524 peru|0.096369 khaki|0.049326 dim|0.049136 gray|0.049136 dim|0.049136 grey|0.049136 sandy|0.044873 brown|0.044873 gray|0.042799 grey|0.042799 burly|0.042571 wood|0.042571 dark|0.02864 gray|0.02864 dark|0.02864 grey|0.02864 wheat|0.016079  "
		}
	}
}
