{
	"add": {
		"doc": {
			"id": "4bc7548c6ade933a72d171e09f9521504773b9312d5944525ca02a0d0eb14a8e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/1941_Royal_Easter_Show_Medal_%22Cattle_Dog%22_awarded_to_A._Bevis.JPG/220px-1941_Royal_Easter_Show_Medal_%22Cattle_Dog%22_awarded_to_A._Bevis.JPG",
				"previous": "Kaleski's standard was adopted by breed clubs in Queensland and New South Wales and re-issued as their own, with local changes. His writings from the 1910s give an important insight into the early history of the breed. However, dog breeder and author Noreen Clark has noted that his opinions are sometimes just that, and he introduces some contradictory assertions in his later writings, as well as some assumptions that are illogical in the light of modern science.[47] Some of these have persisted; for example he saw the red colour form as having more dingo in it than the blue form, and there is a persistent belief that reds are more vicious than blues. The most enduring of Kaleski's myths relate to Dalmatian and Kelpie infusions into the early Cattle Dog breed. These infusions are not referred to in Kaleski's writings until the 1920s and it seems likely that Kaleski sought to explain the Cattle Dog's mottled colouration and tan on legs by similarity to the Dalmatian and Kelpie, respectively.[48] The genetics of coat colour, and the current understanding of hereditary characteristics, make the infusion of Dalmatian to increase the cattle dog's tolerance of horses an extremely unlikely event. There were relatively few motor vehicles in Australia at the beginning of the 20th century, so most dogs of any breed would have been accustomed to horses.[49] The Kelpie breed was developed after the Cattle Dog type was described, so its infusion is unlikely.[50] It is possible that there was some infusion of Bull Terrier but there is no verifiable record of this, and the Cattle Dog has not had the Bull Terrier's instinct to bite and hold, which would have been an undesirable trait.[51] Early in the 1900s there was considerable in-fighting amongst members of the Cattle Dog Club, and a series of arguments about the origin of the breed appeared in newspapers and journals of the time. While many of these arguments were misleading, some irrational, and the majority not supported by historical facts, they continue to be circulated,[44] resulting in a number of theories on the origins of the breed. In recent years, information technology enabling the manipulation of large databases combined with advances in the understanding of canine genetics has allowed a clearer understanding of the development of the breed.[52]",
				"after": "Through the 1890s, Cattle Dogs of Halls Heeler derivations were seen in the kennels of exhibiting Queensland dog breeders such as William Byrne of Booval, and these were a different population from those shown in New South Wales. Little Logic was bred in Rockdale, New South Wales, however Sydney exhibitors saw Little Logic for the first time after the dog had been added to the Hillview kennels of Arch Bevis in Brisbane. The show records of Little Logic and his offspring created a demand in New South Wales for Queensland dogs.[53] By the end of the 1950s, there were few Australian Cattle Dogs whelped that were not descendants of Little Logic and his best known son, Logic Return. The success and popularity of these dogs led to the growth of the nickname \"Queensland Heeler\".[54]",
			"color": "dim|0.47858 gray|0.47858 dim|0.47858 grey|0.47858 gray|0.38096 grey|0.38096 tan|0.05233 burly|0.026289 wood|0.026289 dark|0.0089244 gray|0.0089244 dark|0.0089244 grey|0.0089244 peach|0.0073151 puff|0.0073151  "
		}
	}
}
