{
	"add": {
		"doc": {
			"id": "4bca41d570c77a853e29d8fc64cd2175f0bb430e28041d470b9127986023efd3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/British_Airways_Concorde_official_handover_ceremony_Fitzgerald.jpg/220px-British_Airways_Concorde_official_handover_ceremony_Fitzgerald.jpg",
				"previous": "The formation of Richard Branson's Virgin Atlantic Airways in 1984 created a competitor for BA. The intense rivalry between British Airways and Virgin Atlantic culminated in the former being sued for libel in 1993, arising from claims and counter claims over a \"dirty tricks\" campaign against Virgin. This campaign included allegations of poaching Virgin Atlantic customers, tampering with private files belonging to Virgin and undermining Virgin's reputation in the City. As a result of the case BA management apologised \"unreservedly\", and the company agreed to pay £110,000 damages to Virgin, £500,000 to Branson personally and £3 million legal costs.[12] Lord King stepped down as chairman in 1993 and was replaced by his deputy, Colin Marshall, while Bob Ayling took over as CEO.[13] Virgin filed a separate action in the US that same year regarding BA's domination of the trans-Atlantic routes, but it was thrown out in 1999.[12]",
				"after": "In 1992 British Airways expanded through the acquisition of the financially troubled Dan-Air, giving BA a much larger presence at Gatwick airport. British Asia Airways, a subsidiary based in Taiwan, was formed in March 1993 to operate between London and Taipei. That same month BA purchased a 25% stake in the Australian airline Qantas and, with the acquisition of Brymon Airways in May, formed British Airways Citiexpress (later BA Connect).[13] In September 1998, British Airways, along with American Airlines, Cathay Pacific, Qantas, and Canadian Airlines, formed the Oneworld airline alliance. Oneworld began operations on 1 February 1999, and is the third largest airline alliance in the world, behind SkyTeam and Star Alliance.[11]",
			"color": "black|0.44453 dim|0.19526 gray|0.19526 dim|0.19526 grey|0.19526 gray|0.18072 grey|0.18072 dark|0.060328 slate|0.060328 gray|0.060328 dark|0.047324 gray|0.047324 dark|0.047324 grey|0.047324 slate|0.032826 gray|0.032826 light|0.031004 slate|0.031004 gray|0.031004 silver|0.0045119  "
		}
	}
}
