{
	"add": {
		"doc": {
			"id": "4be294d0582ad40b43aaf6bf231c9c0056140c47f1ff14264490b30f965907ac",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Chaoyang_Lake.jpg/220px-Chaoyang_Lake.jpg",
				"previous": "Northwest Chengdu is bordered by the high and steep Longmen Mountain and in the west by the Qionglai Mountains, the elevation of which exceeds 3,000 m (9,800 ft) and includes Miao Jiling (5,364 m, 17,598 ft) and Xiling Snow Mountain (5,164 m, 16,942 ft). The western mountainous area is also home to a large primitive forest with abundant biological resources and a Giant Panda habitat. East of Chengdu stands the low Longquan Mountain and the west bordering area of the hilly land of middle reaches of Min River, an area noted by several converging rivers. Since ancient times, Chengdu has been known as \"the Abundant Land\" owing to its fertile soil, favorable climate, and novel Dujiangyan Irrigation System.",
				"after": "Chengdu is located at the western edge of the Sichuan Basin and sits on the Chengdu Plain; the dominating terrain is plains. The prefecture ranges in latitude from 30° 05' to 31° 26' N, while its longitude ranges from 102° 54' to 104° 53' E, stretching for 192 kilometres (119 mi) from east to west and 166 km (103 mi) south to north, administering 12,390 square kilometres (4,780 sq mi) of land. Neighbouring prefectures are Deyang (NE), Ziyang (SE), Meishan (S), Ya'an (SW), and the Ngawa Tibetan and Qiang Autonomous Prefecture (N). The urban area, with an elevation of 500 m (1,600 ft), features a few rivers, three of them being the Jin, Fu, and Sha Rivers. Outside of the immediate urban area, the topography becomes more complex: to the east lies the Longquan Range (龙泉山脉) and the Penzhong Hills (盆中丘陵); to the west lie the Qionglai Mountains, which rise to 5,364 m (17,598 ft) in Dayi County. The lowest point in Chengdu Prefecture, at 378 m (1,240 ft), lies in the southeast in Jintang County.",
			"color": "dark|0.23715 slate|0.23715 gray|0.23715 light|0.21062 blue|0.21062 lavender|0.1755 dark|0.071799 olive|0.071799 green|0.071799 black|0.061221 gainsboro|0.045632 light|0.035259 steel|0.035259 blue|0.035259 light|0.032349 gray|0.032349 light|0.032349 grey|0.032349 dim|0.029272 gray|0.029272 dim|0.029272 grey|0.029272 alice|0.022382 blue|0.022382 slate|0.019608 gray|0.019608 gray|0.012737 grey|0.012737 light|0.0098369 slate|0.0098369 gray|0.0098369 powder|0.0086979 blue|0.0086979 silver|0.0082015  "
		}
	}
}
