{
	"add": {
		"doc": {
			"id": "4bea79e0d03841d7902bfe012de92516246852256080f5bf843b9679147c3001",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Triturus_dobrogicus_dunai_tarajosg%C5%91te.jpg/220px-Triturus_dobrogicus_dunai_tarajosg%C5%91te.jpg",
				"previous": "The order Caudata (from the Latin cauda meaning \"tail\") consists of the salamanders—elongated, low-slung animals that mostly resemble lizards in form. This is a symplesiomorphic trait and they are no more closely related to lizards than they are to mammals.[37] Salamanders lack claws, have scale-free skins, either smooth or covered with tubercles, and tails that are usually flattened from side to side and often finned. They range in size from the Chinese giant salamander (Andrias davidianus), which has been reported to grow to a length of 1.8 metres (5 ft 11 in),[38] to the diminutive Thorius pennatulus from Mexico which seldom exceeds 20 mm (0.8 in) in length.[39] Salamanders have a mostly Laurasian distribution, being present in much of the Holarctic region of the northern hemisphere. The family Plethodontidae is also found in Central America and South America north of the Amazon basin;[33] South America was apparently invaded from Central America by about the start of the Miocene, 23 million years ago.[40] Urodela is a name sometimes used for all the extant species of salamanders.[41] Members of several families of salamanders have become paedomorphic and either fail to complete their metamorphosis or retain some larval characteristics as adults.[42] Most salamanders are under 15 cm (6 in) long. They may be terrestrial or aquatic and many spend part of the year in each habitat. When on land, they mostly spend the day hidden under stones or logs or in dense vegetation, emerging in the evening and night to forage for worms, insects and other invertebrates.[33]",
				"after": "The suborder Cryptobranchoidea contains the primitive salamanders. A number of fossil cryptobranchids have been found, but there are only three living species, the Chinese giant salamander (Andrias davidianus), the Japanese giant salamander (Andrias japonicus) and the hellbender (Cryptobranchus alleganiensis) from North America. These large amphibians retain several larval characteristics in their adult state; gills slits are present and the eyes are unlidded. A unique feature is their ability to feed by suction, depressing either the left side of their lower jaw or the right.[43] The males excavate nests, persuade females to lay their egg strings inside them, and guard them. As well as breathing with lungs, they respire through the many folds in their thin skin, which has capillaries close to the surface.[44]",
			"color": "silver|0.73526 dark|0.14268 gray|0.14268 dark|0.14268 grey|0.14268 gray|0.032021 grey|0.032021 black|0.029268 dim|0.01865 gray|0.01865 dim|0.01865 grey|0.01865 light|0.016042 gray|0.016042 light|0.016042 grey|0.016042  "
		}
	}
}
