{
	"add": {
		"doc": {
			"id": "4c007d9053158bbd7a4fb87acf7de27399b14acc6913c7ab6700df7cd5e472c1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/%D0%9C%D0%B0%D0%BC%D0%BE%D0%BD%D1%82%D1%91%D0%BD%D0%BE%D0%BA_%D0%AE%D0%BA%D0%B0.JPG/220px-%D0%9C%D0%B0%D0%BC%D0%BE%D0%BD%D1%82%D1%91%D0%BD%D0%BE%D0%BA_%D0%AE%D0%BA%D0%B0.JPG",
				"previous": "In 2007, the carcass of a female calf nicknamed \"Lyuba\" was discovered near the Yuribey River, where it had been buried for 41,800 years.[54][114] By cutting a section through a molar and analysing its growth lines, they found that the animal had died at the age of one month.[61] The mummified calf weighed 50 kg (110 lb), was 85 cm (33 in) high and 130 cm (51 in) in length.[115][116] At the time of discovery, its eyes and trunk were intact and some fur remained on its body. Its organs and skin are very well preserved.[117] \"Lyuba\" is believed to have been suffocated by mud in a river that its herd was crossing.[54][118] After death, its body may have been colonised by bacteria that produce lactic acid, which \"pickled\" it, preserving the mammoth in a nearly pristine state.[54]",
				"after": "In 2012, a juvenile was found in Siberia, which had man-made cut marks. Scientists estimated its age at death to be 2.5 years, and nicknamed it \"Yuka\". Its skull and pelvis had been removed prior to discovery, but were found nearby.[79][119] After being discovered, the skin of \"Yuka\" was prepared to produce a taxidermy mount.[34] Another mammoth discovery was reported in October 2012, when it was excavated on the Taymyr Peninsula. It was dated to 30,000 years old. It was named \"Zhenya\" after the boy who found it.[120]",
			"color": "dim|0.14955 gray|0.14955 dim|0.14955 grey|0.14955 dark|0.1463 gray|0.1463 dark|0.1463 grey|0.1463 gray|0.13244 grey|0.13244 silver|0.062923 white|0.038802 smoke|0.038802 sea|0.038214 shell|0.038214 floral|0.037624 white|0.037624 snow|0.037058 white|0.036111 mint|0.035985 cream|0.035985 ghost|0.03406 white|0.03406 light|0.033174 gray|0.033174 light|0.033174 grey|0.033174 azure|0.032717 alice|0.032341 blue|0.032341 tan|0.027689 lavender|0.02444 blush|0.02444 gainsboro|0.022432 ivory|0.013049 linen|0.01215  "
		}
	}
}
