{
	"add": {
		"doc": {
			"id": "4c01e7784e8f5106fc717a46b4db28e52eaa9032edcadb4eb5b46422ac317542",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Song-Imperial-Garden1.jpg/220px-Song-Imperial-Garden1.jpg",
				"previous": "Architecture during the Song period reached new heights of sophistication. Authors such as Yu Hao and Shen Kuo wrote books outlining the field of architectural layouts, craftsmanship, and structural engineering in the 10th and 11th centuries, respectively. Shen Kuo preserved the written dialogues of Yu Hao when describing technical issues such as slanting struts built into pagoda towers for diagonal wind bracing.[189] Shen Kuo also preserved Yu's specified dimensions and units of measurement for various building types.[190] The architect Li Jie (1065–1110), who published the Yingzao Fashi ('Treatise on Architectural Methods') in 1103, greatly expanded upon the works of Yu Hao and compiled the standard building codes used by the central government agencies and by craftsmen throughout the empire.[191] He addressed the standard methods of construction, design, and applications of moats and fortifications, stonework, greater woodwork, lesser woodwork, wood-carving, turning and drilling, sawing, bamboo work, tiling, wall building, painting and decoration, brickwork, glazed tile making, and provided proportions for mortar formulas in masonry.[192][193] In his book, Li provided detailed and vivid illustrations of architectural components and cross-sections of buildings. These illustrations displayed various applications of corbel brackets, cantilever arms, mortise and tenon work of tie beams and cross beams, and diagrams showing the various building types of halls in graded sizes.[194] He also outlined the standard units of measurement and standard dimensional measurements of all building components described and illustrated in his book.[195]",
				"after": "Grandiose building projects were supported by the government, including the erection of towering Buddhist Chinese pagodas and the construction of enormous bridges (wood or stone, trestle or segmental arch bridge). Many of the pagoda towers built during the Song period were erected at heights that exceeded ten stories. Some of the most famous are the Iron Pagoda built in 1049 during the Northern Song and the Liuhe Pagoda built in 1165 during the Southern Song, although there were many others. The tallest is the Liaodi Pagoda of Hebei built in 1055, towering 84 m (276 ft) in total height. Some of the bridges reached lengths of 1,220 m (4,000 ft), with many being wide enough to allow two lanes of cart traffic simultaneously over a waterway or ravine.[196] The government also oversaw construction of their own administrative offices, palace apartments, city fortifications, ancestral temples, and Buddhist temples.[197]",
			"color": "dark|0.98911 khaki|0.98911  "
		}
	}
}
