{
	"add": {
		"doc": {
			"id": "4c16ed4e6ce8a6ca8269348884dae9d7721e6b8a135848d136f396d7439b975c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Maneless_lion_from_Tsavo_East_National_Park.png/220px-Maneless_lion_from_Tsavo_East_National_Park.png",
				"previous": "The mane of the adult male lion, unique among cats, is one of the most distinctive characteristics of the species. It may provide an excellent intimidation display; aiding the lion during confrontations with other lions.[52] The presence, absence, colour, and size of the mane is associated with genetic precondition, sexual maturity, climate, and testosterone production; the rule of thumb is the darker and fuller the mane, the healthier the lion. Sexual selection of mates by lionesses favors males with the densest, darkest mane.[53] Research in Tanzania also suggests mane length signals fighting success in male–male relationships. Darker-maned individuals may have longer reproductive lives and higher offspring survival, although they suffer in the hottest months of the year.[54]",
				"after": "Scientists once believed that the distinct status of some subspecies could be justified by morphology, including the size of the mane. Morphology was used to identify subspecies such as the Barbary lion and Cape lion. Research has suggested, however, that environmental factors influence the colour and size of a lion's mane, such as the ambient temperature.[54] The cooler ambient temperature in European and North American zoos, for example, may result in a heavier mane. Thus the mane is not an appropriate marker for identifying subspecies.[17][55] The males of the Asiatic subspecies, however, are characterised by sparser manes than average African lions.[56]",
			"color": "tan|0.52782 burly|0.22057 wood|0.22057 silver|0.072073 light|0.037638 gray|0.037638 light|0.037638 grey|0.037638 gainsboro|0.016447 misty|0.014489 rose|0.014489 gray|0.013046 grey|0.013046 antique|0.011879 white|0.011879 dark|0.011837 gray|0.011837 dark|0.011837 grey|0.011837  "
		}
	}
}
