{
	"add": {
		"doc": {
			"id": "4c1d14f98b393a5dca00bee151352220cd7fdbd11e9ac6d9fe0a633a2808cea6",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/fb/Jean_Bellette%27s_painting_%22Still_life_with_wooden_bowl%22_%28c.1954%29.jpg/220px-Jean_Bellette%27s_painting_%22Still_life_with_wooden_bowl%22_%28c.1954%29.jpg",
				"previous": "Paintings by Bellette were among those of twelve Australian artists included in the 1953 Arts Council of Great Britain exhibition in London, five regional British cities, and at the Venice Biennale. Bellette was one of only two women represented, the other being Constance Stokes.[5][28][29] As with her Sulman prize-winners, Bellette's subjects were classically-themed works: Electra (1944) and Oedipus (1945). Arts Council chairman Kenneth Clark was disappointed with the response of British critics to the exhibition, and their focus on a theme of nationhood paid little regard to the works of Bellette and several others.[30]",
				"after": "As well as spending time in Sydney's art community, in 1954 Haefliger and Bellette purchased a cottage in Hill End, an old gold mining village in central New South Wales. They added a studio, and the site became both a weekender and a venue for social visits and artistic endeavours by colleagues from the Sydney circle, including Drysdale, Margaret Olley, John Olsen, David Edgar Strachan and Donald Friend.[13][31] This gathering of artists, sometimes referred to as the Hill End Group, is known for its landscape art. Bellette, though sometimes a painter of landscapes, was known for her classical subjects and still lifes, which critics struggled to accommodate within their understanding of the Hill End Group.[32] Nevertheless, several still lifes from this period are held in public collections, including Still Life with Fish (1954), in the Tasmanian Museum and Art Gallery,[3] and Still life with wooden bowl (c. 1954), in the Art Gallery of New South Wales.[33] These images were often rendered with strong colour,[3] which was also sometimes a feature of earlier works on which critics would remark.[17][34]",
			"color": "black|0.25313 wheat|0.079831 tan|0.064797 chocolate|0.050663 light|0.04828 slate|0.04828 gray|0.04828 antique|0.048148 white|0.048148 dark|0.042758 gray|0.042758 dark|0.042758 grey|0.042758 silver|0.041814 dim|0.027679 gray|0.027679 dim|0.027679 grey|0.027679 gray|0.024498 grey|0.024498 slate|0.022692 gray|0.022692 blanched|0.021667 almond|0.021667 peru|0.021253 papaya|0.020636 whip|0.020636 beige|0.018115 dark|0.01699 slate|0.01699 gray|0.01699 light|0.016331 gray|0.016331 light|0.016331 grey|0.016331 burly|0.015733 wood|0.015733 bisque|0.015368 golden|0.012358 rod|0.012358 linen|0.01063 gainsboro|0.0099401 old|0.0097702 lace|0.0097702 corn|0.0097249 silk|0.0097249 moccasin|0.0095337 pale|0.0071512 golden|0.0071512 rod|0.0071512  "
		}
	}
}
