{
	"add": {
		"doc": {
			"id": "4c37e56527161bf469795e1c3d795ad936f9fd369f516eb53e3fa8b1b1c60b3b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/San_tribesman.jpg/170px-San_tribesman.jpg",
				"previous": "Africa's population has rapidly increased over the last 40 years, and consequently, it is relatively young. In some African states, half or more of the population is under 25 years of age.[96] The total number of people in Africa increased from 221 million in 1950 to 1.1 billion in 2013.[97][98]",
				"after": "Speakers of Bantu languages (part of the Niger–Congo family) are the majority in southern, central and southeast Africa. The Bantu-speaking peoples from The Sahel progressively expanded over most of Sub-Saharan Africa.[99] But there are also several Nilotic groups in South Sudan and East Africa, the mixed Swahili people on the Swahili Coast, and a few remaining indigenous Khoisan (\"San\" or \"Bushmen\") and Pygmy peoples in southern and central Africa, respectively. Bantu-speaking Africans also predominate in Gabon and Equatorial Guinea, and are found in parts of southern Cameroon. In the Kalahari Desert of Southern Africa, the distinct people known as the Bushmen (also \"San\", closely related to, but distinct from \"Hottentots\") have long been present. The San are physically distinct from other Africans and are the indigenous people of southern Africa. Pygmies are the pre-Bantu indigenous peoples of central Africa.[100]",
			"color": "tan|0.36833 burly|0.11551 wood|0.11551 sienna|0.055627 black|0.041474 dim|0.040139 gray|0.040139 dim|0.040139 grey|0.040139 gray|0.037355 grey|0.037355 dark|0.027879 gray|0.027879 dark|0.027879 grey|0.027879 sandy|0.02742 brown|0.02742 silver|0.02552 peach|0.022749 puff|0.022749 light|0.022367 gray|0.022367 light|0.022367 grey|0.022367 dark|0.021818 salmon|0.021818 antique|0.018335 white|0.018335 gainsboro|0.016254 saddle|0.015627 brown|0.015627 linen|0.011435 wheat|0.010891 misty|0.010692 rose|0.010692  "
		}
	}
}
