{
	"add": {
		"doc": {
			"id": "4c499d909d7d21303b3ef679de18e84958ba29bbe7362bc377e2596e07cb1155",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Continental_Airlines_BusinessFirst_entree.jpg/220px-Continental_Airlines_BusinessFirst_entree.jpg",
				"previous": "Continental considered BusinessFirst to be its signature onboard product, and the service is a frequent subject of advertising campaigns. Customers seated in the BusinessFirst cabin on longhaul flights from the United States to Europe, Asia, select cities in South America, and the Middle East received special ground services, including EliteAccess priority bag service at check-in, expedited security screening (where available), access to Continental's Presidents Club or affiliated Star Alliance lounges, personalized Continental Concierge service, and dedicated boarding procedures.",
				"after": "On board, multi-course meals were designed by Continental's Congress of Chefs, beverages were selected by Continental's Wine Masters, and service was provided by flight attendants from separate International crew bases at Newark and Houston. Most flights had at least two meal services. Entertainment was offered at each individual seat, and passengers on Boeing 777 and 757 aircraft had access to a new Audio-Video On Demand system with touch-screen controls. 767 aircraft featured older, looped-video multi-channel entertainment systems, generally with a wider programming selection than Economy Class. 767 aircraft were expected to receive AVOD in the near future. Customers also were provided headphones, a large pillow, wool blanket, and amenity kit prior to departure. Upon arrival, BusinessFirst customers have access to shower facilities and arrival lounges at most airports.",
			"color": "rosy|0.29307 brown|0.29307 gray|0.15748 grey|0.15748 dim|0.14808 gray|0.14808 dim|0.14808 grey|0.14808 tan|0.12013 burly|0.10311 wood|0.10311 black|0.078806 saddle|0.057513 brown|0.057513 dark|0.014482 gray|0.014482 dark|0.014482 grey|0.014482  "
		}
	}
}
