{
	"add": {
		"doc": {
			"id": "4c4dda8671be991ded8401c07c3803df48b689ca3e81b06602fcb903e5753b8d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Redback_Spider_on_deck.jpg/220px-Redback_Spider_on_deck.jpg",
				"previous": "The black house spider (Badumna insignis), daddy-long-legs spider (Pholcus phalangioides) and the giant daddy-long-legs spider (Artema atlanta) are known to prey on the redback spider,[64] and redbacks are often absent if these species are present in significant numbers.[65] Agenioideus nigricornis, a spider wasp, is a parasitoid of the adult redback.[66] Other wasps of the families Eurytomidae and Ichneumonidae parasitise redback eggs, and mantid lacewings (Neuroptera and Mantispidae) prey on redback eggs.[66]",
				"after": "The redback spider is responsible for far more envenomations requiring antivenom than any other creature in Australia.[67] Estimates of the number of people thought to be bitten by redback spiders each year across Australia range from 2,000 to 10,000.[68][69] The larger female spider is responsible for almost all cases of redback spider bites. The smaller male was thought to be unable to envenomate a human, although some cases have been reported; their rarity is probably due to the male's smaller size and proportionally smaller fangs, rather than the male being incapable of biting or lacking potent venom.[70] The bite from both juvenile and mature females appear to have similar potency. The male bite usually only produces short-lived, mild pain.[70] Most bites occur in the warmer months between December and April, in the afternoon or evening.[70][71] As the female redback is slow-moving and rarely leaves her web, bites generally occur as a result of placing a hand or other body part too close to the web, such as when reaching into dark holes or wall cavities. Bites often also occur when a hidden spider is disturbed in objects such as clothes, shoes, gloves, building materials or garden tools.[72][73]",
			"color": "peru|0.51213 sienna|0.23086 black|0.1021 chocolate|0.06129 saddle|0.02777 brown|0.02777 sandy|0.0223 brown|0.0223 dark|0.01413 salmon|0.01413  "
		}
	}
}
