{
	"add": {
		"doc": {
			"id": "4c567196a4bbba3279645e9ad88bd4d09deff1e290970c2ffa07245abb613f2a",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/51/Rosebud_at_Jones_Beach.jpg/300px-Rosebud_at_Jones_Beach.jpg",
			"previous": [],
				"after": "In 1930, the planner Robert Moses hired Rosebud Yellow Robe as Director of the Indian Village at Jones Beach State Park.[13] Rosebud became a public celebrity to thousands of children who visited the Indian Village at Jones Beach every summer from 1930 to 1950. The Indian Village at Jones Beach was created as a Plains Indian village for children with three large tipis. The large Council Tipi contained museum cases with artifacts borrowed from the American Museum of Natural History. The other tipis served as club houses for the children. Rosebud told stories and folklore of the Lakota and local Eastern Woodlands tribes.[14] Rosebud worked as Director of the Indian Village from 1930 to 1950, and taught tens of thousands of school children and several generations of New Yorkers about Native American history and culture.[15] Rosebud recalled, \"When I first lectured to public school classes in New York, many of the smaller children hid under their desks, for they knew from the movies what a blood-thirsty scalping Indian might do to them.\" [16] Yellow Robe dressed in a 19th-century Lakota Indian costume: a deerskin dress, leggings, and moccasins, with a feathered warbonnet, not customarily worn by women.[17] Children listened to stories and legends Rosebud and her sisters heard from her father, teaching them about Native American culture through handicraft, games and songs. Each year ended with the Annual American Indian Art Exhibit where the projects the children had been working on were showcased and judged. Winners were awarded with authentic Indian artifacts which were then displayed in participating local schools.[18] During the winter season, dressed in tribal costume, Yellow Robe visited schools and public libraries to tell Lakota stories and legends.[17] In the summer of 1932, Rosebud staged a ceremony characterized as a \"Peace Council Fire\" that attracted a crowd estimated at one thousand people including three hundred children. From the late 1930s through the 1950s, Yellow Robe was a broadcast celebrity with the CBS Broadcast Center in New York City and appeared as a regular on NBC children's programs. In later years, Rosebud continued her storytelling and lectures at the American Museum of Natural History and the Donnell Library of New York. In 1994, Yellow Robe's career as an educator was honored in a performance of \"Rosebud's Song\" by the National Dance Institute at New York City's Madison Square Garden.",
			"color": " "
		}
	}
}
