{
	"add": {
		"doc": {
			"id": "4c64234ac4344ba59697bb493fa506e2d658a2b0a0f3ce678f173f03b33617b0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Alloquarrynolang.png/220px-Alloquarrynolang.png",
				"previous": "The Morrison Formation has been a rich fossil hunting ground. The flora of the period has been revealed by fossils of green algae, fungi, mosses, horsetails, ferns, cycads, ginkgoes, and several families of conifers. Animal fossils discovered include bivalves, snails, ray-finned fishes, frogs, salamanders, turtles, sphenodonts, lizards, terrestrial and aquatic crocodylomorphans, several species of pterosaur, numerous dinosaur species, and early mammals such as docodonts, multituberculates, symmetrodonts, and triconodonts. Dinosaurs known from the Morrison include the theropods Ceratosaurus, Ornitholestes, and Torvosaurus, the sauropods Apatosaurus, Brachiosaurus, Camarasaurus, and Diplodocus, and the ornithischians Camptosaurus, Dryosaurus, and Stegosaurus.[84] Allosaurus is commonly found at the same sites as Apatosaurus, Camarasaurus, Diplodocus, and Stegosaurus.[85] The Late Jurassic formations of Portugal where Allosaurus is present are interpreted as having been similar to the Morrison but with a stronger marine influence. Many of the dinosaurs of the Morrison Formation are the same genera as those seen in Portuguese rocks (mainly Allosaurus, Ceratosaurus, Torvosaurus, and Apatosaurus), or have a close counterpart (Brachiosaurus and Lusotitan, Camptosaurus and Draconyx).[86]",
				"after": "Allosaurus coexisted with fellow large theropods Ceratosaurus and Torvosaurus in both the United States and Portugal.[86] The three appear to have had different ecological niches, based on anatomy and the location of fossils. Ceratosaurs and torvosaurs may have preferred to be active around waterways, and had lower, thinner bodies that would have given them an advantage in forest and underbrush terrains, whereas allosaurs were more compact, with longer legs, faster but less maneuverable, and seem to have preferred dry floodplains.[87] Ceratosaurus, better known than Torvosaurus, differed noticeably from Allosaurus in functional anatomy by having a taller, narrower skull with large, broad teeth.[46] Allosaurus was itself a potential food item to other carnivores, as illustrated by an Allosaurus pubic foot marked by the teeth of another theropod, probably Ceratosaurus or Torvosaurus. The location of the bone in the body (along the bottom margin of the torso and partially shielded by the legs), and the fact that it was among the most massive in the skeleton, indicates that the Allosaurus was being scavenged.[88]",
			"color": "black|0.90828 pale|0.079882 golden|0.079882 rod|0.079882  "
		}
	}
}
