{
	"add": {
		"doc": {
			"id": "4c71e4fad1ab979f4209e88fe6db449444d4b27d5f8f765ad15bc4ae0710756e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Mohammed_kaaba_1315.jpg/220px-Mohammed_kaaba_1315.jpg",
				"previous": "Muhammad was born about the year 570[8] and his birthday is believed to be in the month of Rabi' al-awwal.[50] He belonged to the Banu Hashim clan, one of Mecca's prominent families, although it appears less prosperous during Muhammad's early lifetime.[14][51] The Banu Hashim clan was part of the Quraysh tribe. Tradition places the year of Muhammad's birth as corresponding with the Year of the Elephant, which is named after the failed destruction of Mecca that year by the Aksumite king Abraha who supplemented his army with elephants. An outbreak of smallpox among the Aksumites may explain the failure of the invading army.[52] 20th century scholarship has suggested alternative dates for this event, such as 568 or 569.[53]",
				"after": "His father, Abdullah, died almost six months before Muhammad was born.[55] According to Islamic tradition, soon after Muhammad's birth he was sent to live with a Bedouin family in the desert, as desert life was considered healthier for infants.[56] Muhammad stayed with his foster-mother, Halimah bint Abi Dhuayb, and her husband until he was two years old.[10] Some western scholars of Islam have rejected the historicity of this tradition.[56] At the age of six, Muhammad lost his biological mother Amina to illness and he became orphaned.[10][57] For the next two years, he was under the guardianship of his paternal grandfather Abd al-Muttalib, of the Banu Hashim clan, but when Muhammad was eight, his grandfather also died. He then came under the care of his uncle Abu Talib, the new leader of Banu Hashim.[10][53] According to Islamic historian William Montgomery Watt there was a general disregard by guardians in taking care of weaker members of the tribes in Mecca during the 6th century, \"Muhammad's guardians saw that he did not starve to death, but it was hard for them to do more for him, especially as the fortunes of the clan of Hashim seem to have been declining at that time.\"[58]",
			"color": "brown|0.27322 rosy|0.22383 brown|0.22383 black|0.21104 indian|0.071672 red|0.071672 sienna|0.058376 dark|0.034414 salmon|0.034414  "
		}
	}
}
