{
	"add": {
		"doc": {
			"id": "4cabce7c4ed6878236d030575d6176b9543a1879b1fedee7ff87a7b84b882419",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/ORCapSteps.JPG/220px-ORCapSteps.JPG",
				"previous": "Oregon's House chamber floor is covered with a custom carpet; the carpet's pattern incorporates a depiction of the state tree, Douglas-fir, representative of forestry. The furniture and paneling of the chamber is made of golden oak. A large mural painted by Faulkner, depicting the 1843 Champoeg Meetings at which the provisional government was formed, is behind the desk of the Speaker of the House. The Senate chambers use black walnut for the paneling and furniture. Another custom carpet lines the floor, featuring chinook salmon and wheat, representative of fishing and agriculture. The Senate's large mural was painted by Schwarz and depicts a street scene showing news of statehood reaching Salem. Lining the walls of both chambers are 158 names, inscribed in friezes, of prominent people in Oregon's history. On the second floor of the capitol is the Governor's suite, consisting of a ceremonial office and private offices for the state's chief executive. As in the Senate chamber, the paneling is of black walnut. The ceremonial office includes a fireplace with a painting by Faulkner. In the suite's reception area is a table made of 40 tree species.[16] This table is inlaid with a replica of Oregon's second capitol building, the state flower (Oregon-grape), and the state bird (Western Meadowlark).[32]",
				"after": "A variety of artwork is displayed on the exterior of the building. Sculptor Leo Friedlander used Vermont marble for the large relief sculptures on both sides of the main entrance. One sculpture depicts Meriwether Lewis, William Clark, and Sacagawea, with a map of their expedition's route on the reverse; the other (Covered Wagon) shows pioneers and a covered wagon, with a map of the Oregon Trail on the reverse. Additionally, Ellerhusen created five marble relief sculptures on the exterior, and a metal sculpture by Tom Morandi sits above the south entrance. Ellerhusen also cast six bronze sculptures arranged above the building's main entrance, three on the inside and three on the outside.[16]",
			"color": "slate|0.27733 gray|0.27733 dim|0.27257 gray|0.27257 dim|0.27257 grey|0.27257 light|0.21467 slate|0.21467 gray|0.21467 gray|0.12111 grey|0.12111 black|0.090735 dark|0.014208 gray|0.014208 dark|0.014208 grey|0.014208 dark|0.0072588 slate|0.0072588 gray|0.0072588  "
		}
	}
}
