{
	"add": {
		"doc": {
			"id": "4cbc5b77f1514ebec5c2a0ad858d8dba182e4d4d18a1df5eac93f9c1c08f5588",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Easyjet_a319_interior_in_flight_arp.jpg/220px-Easyjet_a319_interior_in_flight_arp.jpg",
				"previous": "In December 2001, EasyJet switched from a third-party reservation system to an in-house system designed and developed for them by BulletProof Technologies, Inc.[66] Internet bookings were priced cheaper than booking over the phone, to reflect the reduced call centre costs and the aircraft were repainted with the web address. Within a year over 50% of bookings were made using the web site; by April 2004 the figure had jumped to 98%. Now, flights can be booked either via the Internet, or by phone within 3 months of the flight.[16]",
			"after": [
				"EasyJet's aircraft cabins are configured in a single class, high density layout.[67]",
				"The airline's main fleet, comprising Airbus A319 and A320 aircraft, carry up to 156 and 180 passengers respectively, depending on layout. A typical Airbus A319 carries approximately 140 passengers in a single class configuration, but as EasyJet does not serve meals on its shorter flights, the airline opted for smaller galleys and had a lavatory installed in unused space at the rear of the aircraft. The space saved by having smaller galleys allowed for the installation of 156 seats. Due to this seating arrangement, EasyJet's Airbus A319 aircraft have two pairs of overwing exits, instead of the standard one pair configuration found on most Airbus A319 aircraft, to satisfy safety requirements.[51][59][60]"
			],
			"color": "black|0.38036 dark|0.096813 gray|0.096813 dark|0.096813 grey|0.096813 dim|0.084627 gray|0.084627 dim|0.084627 grey|0.084627 silver|0.064579 light|0.036728 steel|0.036728 blue|0.036728 gray|0.031014 grey|0.031014 lavender|0.02885 thistle|0.027643 light|0.026314 gray|0.026314 light|0.026314 grey|0.026314 slate|0.025832 gray|0.025832 dark|0.0201 slate|0.0201 gray|0.0201 light|0.017669 slate|0.017669 gray|0.017669 tomato|0.015841 gainsboro|0.013614 brown|0.010474 orange|0.0093679 red|0.0093679 indian|0.0093617 red|0.0093617 firebrick|0.0092757 rosy|0.0088515 brown|0.0088515  "
		}
	}
}
