{
	"add": {
		"doc": {
			"id": "4ce12fec28d051dda559c7e36aeb744fa56b9f0640a710b9f90f01caa2b3e22a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Boeing_737-200_planform_view.jpg/220px-Boeing_737-200_planform_view.jpg",
				"previous": "The original engine nacelles incorporated thrust reversers taken from the 727 outboard nacelles. Unfortunately they proved to be relatively ineffective and apparently tended to lift the aircraft up off the runway when deployed. This reduced the downforce on the main wheels thereby reducing the effectiveness of the wheel brakes. In 1968, an improvement to the thrust reversal system was introduced. A 48-inch tailpipe extension was added and new, target-style, thrust reversers were incorporated. The thrust reverser doors were set 35 degrees away from the vertical to allow the exhaust to be deflected inboard and over the wings and outboard and under the wings.[30] The improvement became standard on all aircraft after March 1969, and a retrofit was provided for active aircraft. Boeing fixed the drag issue by introducing new longer nacelle/wing fairings, and improved the airflow over the flaps and slats. The production line also introduced an improvement to the flap system, allowing increased use during takeoff and landing. All these changes gave the aircraft a boost to payload and range, and improved short-field performance.[24] In May 1971, after aircraft #135, all improvements, including more powerful engines and a greater fuel capacity, were incorporated into the 737-200, giving it a 15% increase in payload and range over the original -200s.[26] This became known as the 737-200 Advanced, which became the production standard in June 1971.[31]",
				"after": "In 1970, Boeing received only 37 orders. Facing financial difficulties, Boeing considered closing the 737 production-line and selling the design to Japanese aviation companies.[13] After the cancellation of the Boeing Supersonic Transport, and scaling back of 747 production, enough funds were freed up to continue the project.[32] In a bid to increase sales by offering a variety of options, Boeing offered a 737C (Convertible) model in both -100 and -200 lengths. This model featured a 340 cm × 221 cm (134 in × 87 in) freight door just behind the cockpit, and a strengthened floor with rollers, which allowed for palletized cargo. A 737QC (Quick Change) version with palletized seating allowed for faster configuration changes between cargo and passenger flights.[33] With the improved short-field capabilities of the 737, Boeing offered the option on the -200 of the gravel kit, which enables this aircraft to operate on remote, unpaved runways.[34][35] Until retiring its -200 fleet in 2007, Alaska Airlines used this option for some of its rural operations in Alaska.[36] Northern Canadian operators Air Inuit, Air North, Canadian North, First Air and Nolinor Aviation still operate the gravel kit aircraft in Northern Canada, where gravel runways are common.",
			"color": "dark|0.64048 gray|0.64048 dark|0.64048 grey|0.64048 silver|0.31165 gray|0.020461 grey|0.020461 dim|0.011007 gray|0.011007 dim|0.011007 grey|0.011007 black|0.0075762 light|0.0051678 gray|0.0051678 light|0.0051678 grey|0.0051678  "
		}
	}
}
