{
	"add": {
		"doc": {
			"id": "4d0b9513a8a34106256e7eb4c30141f5f6c5239c10376114838965a989a17713",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Panellus_stipticus_26818.jpg/220px-Panellus_stipticus_26818.jpg",
			"previous": [],
				"after": "The fungus normally exists unseen, in the form of a mass of threadlike vegetative cells called a mycelium, inhabiting rotting wood; only when suitable environmental conditions of temperature, moisture, and nutrient availability are achieved does the fungus produce the reproductive structures known as fruit bodies, or mushrooms. The cap of the fruit body is kidney- or clamshell-shaped, convex to roughly flat, with dimensions of 1.2 to 3.2 cm (0.5 to 1.3 in) by 1.2 to 2.5 cm (0.5 to 1.0 in).[28] The edges of the caps are scalloped with small rounded teeth, and curved slightly inward. The cap surface is dry, with a pattern of block-like areas similar to cracked dried mud; the surface is also covered with small fine hairs that give it a somewhat woolly consistency. It may have several concentric ridges or zones. Fresh fruit bodies range in color from yellowish-orange to buff to cinnamon; when dried they may be various shades of tan, brown or clay. The faded colors of dried fruit bodies tend to revive when moistened. On the underside of the cap, the gills are narrow and spaced closely together, often forked, buff-colored, and with numerous interconnecting cross-veins. Holding the cap in position is a stem that is 0.6 to 1.2 cm (0.2 to 0.5 in) long by 0.3 to 0.8 cm (0.1 to 0.3 in) thick, and has an off-center attachment to the cap, either at or near the cap side. The dull-white stem is covered with minute silk-like fibers, and is narrower at the base where it attaches to the substrate. Fruit bodies do not have any distinctive odor.[15] The flesh is thin and tough, and dark yellow-brown to cream-colored.[29]",
			"color": "black|0.36529 peru|0.087852 tan|0.087175 burly|0.066177 wood|0.066177 sienna|0.043329 saddle|0.023791 brown|0.023791 pale|0.020882 golden|0.020882 rod|0.020882 chocolate|0.017987 wheat|0.017638 sandy|0.014681 brown|0.014681 khaki|0.014105 dark|0.012513 khaki|0.012513 light|0.012047 gray|0.012047 light|0.012047 grey|0.012047 silver|0.011509 gainsboro|0.010314 rosy|0.010126 brown|0.010126 navajo|0.0083686 white|0.0083686 dark|0.0082323 gray|0.0082323 dark|0.0082323 grey|0.0082323 dark|0.0077795 salmon|0.0077795 moccasin|0.0076972 golden|0.0072993 rod|0.0072993 lavender|0.0070553 antique|0.0069029 white|0.0069029 lemon|0.006704 chiffon|0.006704 light|0.0066551 golden|0.0066551 rod|0.0066551 yellow|0.0066551 beige|0.0066067 peach|0.0065351 puff|0.0065351  "
		}
	}
}
