{
	"add": {
		"doc": {
			"id": "4d0f08edce96d83056a48bbc68550661e0a8a17b74289fd8816a186fcdc6ea13",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/QANTASLINK_717_VH-YQT.JPG/220px-QANTASLINK_717_VH-YQT.JPG",
				"previous": "Within a few months, however, the abilities of the 717 became clear. It is roomier and faster than the BAe 146, cheaper to operate, and achieved a higher dispatch reliability, over 99%, than competing aircraft.[13] Maintenance costs are very low: a C check inspection, for example, takes three days and is required once every 6,000 flying hours.[citation needed] (For comparison, its predecessor, the DC-9 needed 21 days for a C check.) The new Rolls-Royce BR715 engine design is highly modular: none of the line-replaceable units takes more than an hour to exchange.[citation needed] Many 717 operators, even accidental ones like Qantas, became converts to the plane. Qantas bought more 717s, and other significant orders came from Hawaiian Airlines and Midwest Airlines.",
				"after": "Boeing actively marketed the 717 to a number of large airlines, including Lufthansa and Northwest (who already operated a large fleet of DC-9 aircraft). Boeing also studied a stretched, higher-capacity version of the 717, to have been called 717-300, but decided against proceeding with the new model, fearing that it would encroach on the company's 737-700 model. Production of the original 717 continued. Boeing continued to believe that the 100-passenger market would be lucrative enough to support both the 717 and the 737-600, the smallest of the Next-Generation 737 series. While the aircraft were similar in overall size, the 737-600 was better suited to long-distance routes, while the lighter 717 was more efficient on shorter, regional routes.",
			"color": "steel|0.28661 blue|0.28661 dim|0.27722 gray|0.27722 dim|0.27722 grey|0.27722 slate|0.12508 gray|0.12508 black|0.08356 gray|0.082875 grey|0.082875 light|0.068954 slate|0.068954 gray|0.068954 dark|0.044511 slate|0.044511 gray|0.044511 light|0.022883 steel|0.022883 blue|0.022883  "
		}
	}
}
