{
	"add": {
		"doc": {
			"id": "4d11afc0e5c441c112e2ade32299429d642ba80e52cc13211a47d6f56caeec68",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Pottery_well.JPG/220px-Pottery_well.JPG",
				"previous": "Officials at the court of Emperor Ai of Han (r. 7–1 BC) attempted to implement reforms limiting the amount of land nobles and wealthy landowners could own legally, but were unsuccessful.[27] When Wang Mang took control of the government in 9 AD, he abolished the purchase and sale of land in a system called King's Fields (王田). This was a variation of the well-field system, where the government owned the land and assured every peasant an equal share to cultivate.[28] Within three years, complaints from wealthy landowners and nobles forced Wang Mang to repeal the reform.[28] After Gengshi (r. 23–25 AD) and Guangwu (r. 25–57 AD) restored the Han dynasty, they relied on the service of great landholding families to secure their position in society. Many of their government officials also became wealthy landowners.[29]",
				"after": "By the late Eastern Han period, the peasantry had become largely landless and served wealthy landowners. This cost the government significant tax revenue.[29] Although the central government under Emperor He of Han (r. 88–105 AD) reduced taxes in times of natural disaster and distress without much effect upon the treasury, successive rulers became less able to cope with major crises. The government soon relied upon local administrations to conduct relief efforts.[30] After the central government failed to provide local governments with provisions during both a locust swarm and the flooding of the Yellow River in 153 AD, many landless peasants became retainers of large landowners in exchange for aid.[31] Patricia Ebrey writes that the Eastern Han was the \"transitional period\" between the Western Han—when small independent farmers were the vast majority—and the Three Kingdoms (220–265 AD) and later Sixteen Kingdoms (304–439 AD), when large family estates used unfree labor.[32]",
			"color": "tan|0.53481 burly|0.27947 wood|0.27947 navajo|0.049791 white|0.049791 wheat|0.049239 moccasin|0.031548 peach|0.018242 puff|0.018242 black|0.010074 bisque|0.0096714  "
		}
	}
}
