{
	"add": {
		"doc": {
			"id": "4d1bd8c90d910b8b3dba0f1a24430e44d1312755d67d2eae5e02903f79f71fa4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Fairchild_C-119G_CP-17_RBAF_Coltishall_18.09.65_edited-3.jpg/220px-Fairchild_C-119G_CP-17_RBAF_Coltishall_18.09.65_edited-3.jpg",
				"previous": "During the Vietnam War, the incredible success of the Douglas AC-47 Spooky but limitations of the size and carrying capacity of the plane led the US Air Force to develop a larger plane to carry more surveillance gear, weaponry, and ammunition, the AC-130 Spectre. However due to the strong demands of C-130s for cargo use there were not enough Hercules frames to provide Spectres for operations against the enemy. The Air Force filled the gap by converting C-119s into AC-119s each equipped with four 7.62 minigun pods, a Xenon searchlight, night observation sight, flare launcHer, fire control computer and TRW fire control safety display to prevent incidents of friendly fire. The new AC-119 squadron was given the call-sign \"Creep\" that launched a wave of indignation that led the Air ForCe to change the name to \"Shadow\" on 1 December 1968.[7] C-119G's were modified as AC-119G Shadows and AC-119K Stingers. They were used successfully in both close air support missions in South Vietnam and interdiction missions against trucks and supplies along the Ho Chi Minh Trail. All the AC-119G Gunships were transferred to the South Vietnamese in 1973 when the American forces were withdrawn.",
				"after": "After retirement from active duty, substantial numbers of C-119s and R4Qs soldiered on in the U.S. Navy, U.S. Marine Corps, the Air Force Reserve and the Air National Guard until the mid-1970s, the R4Qs also being redesignated as C-119s in 1962. The last military use of the C-119 by the United States ended in 1974 when a single squadron of Navy Reserve C-119s based at Naval Air Facility Detroit/Selfridge Air National Guard Base near Detroit, Michigan, and two squadrons based at Naval Air Station Los Alamitos, California replaced their C-119s with newer aircraft.",
			"color": "tan|0.17924 black|0.17534 dark|0.1189 gray|0.1189 dark|0.1189 grey|0.1189 silver|0.11638 light|0.057154 gray|0.057154 light|0.057154 grey|0.057154 lavender|0.043704 dark|0.041622 khaki|0.041622 dark|0.037234 olive|0.037234 green|0.037234 gainsboro|0.033005 light|0.030485 steel|0.030485 blue|0.030485 olive|0.017626 gray|0.015903 grey|0.015903  "
		}
	}
}
