{
	"add": {
		"doc": {
			"id": "4d51f5c48e79dd6abd0aef0cd4547da78587115e3d049c2e6b116365534c0d2f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Junkers_Ju-52_single-engine.JPG/220px-Junkers_Ju-52_single-engine.JPG",
				"previous": "In its original configuration, designated the Ju 52/1m, the Ju 52 was a single-engined aircraft, powered by either a BMW or Junkers liquid-cooled engine. However, the single-engine model was underpowered, and after seven prototypes had been completed, all subsequent Ju 52s were built with three radial engines as the Ju 52/3m (drei motoren - \"three engines\"). Originally powered by three Pratt & Whitney Hornet radial engines, later production models mainly received 574 kW (770 hp) BMW 132 engines, a licence-built refinement of the Pratt & Whitney design. Export models were also built with 447 kW (600 hp) Pratt & Whitney Wasp R-1340 and 578 kW (775 hp) Bristol Pegasus VI engines. The two wing-mounted radial engines of the Ju 52/3m had half-chord cowlings and in planform view (from above/below) appeared to be splayed outwards, being mounted at an almost perpendicular angle to the tapered wing's sweptback leading edge. The central engine had a cowling like a Townend ring as the fuselage behind it was increasing in diameter, though some later aircraft had deeper cowlings. Production Ju 52/3m aircraft flown by Luft Hansa before World War II, as well as Luftwaffe-flown Ju 52s flown during the war, usually used an air start system to turn over their trio of radial engines, using a common compressed air supply that also operated the main wheels' brakes.",
			"after": [],
			"color": "dark|0.11541 gray|0.11541 dark|0.11541 grey|0.11541 dim|0.083411 gray|0.083411 dim|0.083411 grey|0.083411 gray|0.078335 grey|0.078335 silver|0.076845 light|0.072161 gray|0.072161 light|0.072161 grey|0.072161 gainsboro|0.064343 white|0.052326 smoke|0.052326 alice|0.051141 blue|0.051141 ghost|0.050719 white|0.050719 lavender|0.050132 blush|0.050132 snow|0.044119 white|0.039609 sea|0.038494 shell|0.038494 lavender|0.03109 mint|0.030414 cream|0.030414 floral|0.029375 white|0.029375 azure|0.027473 linen|0.013552 light|0.013054 slate|0.013054 gray|0.013054 slate|0.012139 gray|0.012139 dark|0.01056 slate|0.01056 gray|0.01056 black|0.0081498  "
		}
	}
}
