{
	"add": {
		"doc": {
			"id": "4d564c6742d9bf9d011893b38957e8f3b78e71b6114bf854a5b204017a48a2e6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Martinair_Cargo_MD-11F%3B_PH-MCY%40LAX%3B18.04.2007_463ml_%284271146430%29.jpg/220px-Martinair_Cargo_MD-11F%3B_PH-MCY%40LAX%3B18.04.2007_463ml_%284271146430%29.jpg",
				"previous": "In 2006 Martinair purchased four Boeing 747-400s from Singapore Airlines. These passenger planes were converted to freighters to replace the older Boeing 747-200Fs. In 2009 three out of the four 747s were stored because of the economic crisis. In the end of 2010 two of the 747-400s were leased to Air Cargo Germany.[28][29] The remaining 747 (PH-MPS) returned into service in May 2011 with an untitled colour scheme, because Martinair wasn't sure yet if the plane would remain operating for them.[30] As of January 2015 the PH-MPS remains active in Martinair's fleet as the only 747BCF. The two ex-ACG planes are stored and the remaining 747BCF is currently operating for Saudi Arabian Airlines",
				"after": "The first McDonnell Douglas MD-11 was delivered in December 1994. Throughout the next three years six other brand-new MD-11's were delivered to Martinair. In total four McDonnell Douglas MD-11CFs (Convertible Freighter) and two full freighters were delivered.[31][32] Martinair was the launch customer of the convertible freighter. In 2004 another MD-11F was added to the fleet, this one was previously owned by Swissair and then converted to full freighter.[33] From 1995 to 2006 some of the convertible MD-11 were reconfigured to transport passengers in the high passenger peaks during the summer period. The passenger configuration was fitted with 390 seats.[34] After 2006 the demand lowered and Martinair did not need extra seats anymore. The lowering of the demand continued until after 53 years of Dutch service Martinair ceased all their passenger flights.",
			"color": "light|0.66167 steel|0.66167 blue|0.66167 light|0.030129 sky|0.030129 blue|0.030129 gray|0.021978 grey|0.021978 light|0.020012 blue|0.020012 dim|0.019967 gray|0.019967 dim|0.019967 grey|0.019967 dark|0.019928 gray|0.019928 dark|0.019928 grey|0.019928 sky|0.0181 blue|0.0181 black|0.01458 light|0.011456 slate|0.011456 gray|0.011456 silver|0.010256 light|0.010027 gray|0.010027 light|0.010027 grey|0.010027 lavender|0.0094294 gainsboro|0.009424 alice|0.008932 blue|0.008932 white|0.0087194 smoke|0.0087194 ghost|0.0086049 white|0.0086049 slate|0.0079805 gray|0.0079805 firebrick|0.0074741 snow|0.0072967 dark|0.0071699 slate|0.0071699 gray|0.0071699 lavender|0.0067829 blush|0.0067829 white|0.006693 red|0.0065797 sea|0.0058055 shell|0.0058055 mint|0.0056212 cream|0.0056212 azure|0.0055219 maroon|0.0049457 rosy|0.0048309 brown|0.0048309 floral|0.0046577 white|0.0046577  "
		}
	}
}
