{
	"add": {
		"doc": {
			"id": "4d5adbda29c77e8ef5f1cb9e015336a4c4d28f0ad78a1491b3ce799daa8c6209",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Aviaco_MD-88_EC-FGM_MAD_1993-09-11.png/220px-Aviaco_MD-88_EC-FGM_MAD_1993-09-11.png",
				"previous": "At March 1980 (1980-03), the company had more than 1200 employees and it was 90%-owned by INI.[19] Early in the decade, Aviaco incorporated five DC-8-63s that were phased out from Iberia's mainline fleet due to a renewal programme.[20] Flight International informed in 1983 that the company had an initial order for 20 CN-235s,[21]:1497 and that the order was boosted to 22 aircraft of the type late that year.[22] By March 1985 (1985-03), the number of employees had grown to 1,751; the fleet comprised two DC-8-50Fs, 16 DC-9-30s, four DC-9-30Fs and nine Fokker F27-600s; the 22 CN-235s were still on order.[23] During the decade, most of Aviaco shares were acquired by its competitor Iberia. From that time, Aviaco ran the less important domestic routes while Iberia served the international destinations and the most important national routes, such as the shuttle service Madrid-Barcelona. All the Aviaco technical, marketing and financial resources were transferred to Iberia. During this time, Aviaco had a fleet of Douglas DC-9 planes, which were painted in blue and white livery.",
				"after": "During the 1990s, the Asturias–London Stansted, Valladolid–Paris, Zaragoza–London Stansted and Zaragoza–Paris routes were added to the existing ones radiating from Madrid and serving Almeria, Badajoz, Barcelona, Bilbao, Fuerteventura, Granada, Ibiza, Jerez, La Coruña, Lanzarote, Las Palmas, Málaga, Mallorca, Menorca, Murcia, Oviedo, Palma, Pamplona, Reus, San Sebastian, Santander, Seville, Tenerife, Valencia, Valladolid, Vigo, Vitoria and Zaragoza. At March 1994 (1994-03), Aviaco had 1,696 employees and a fleet of eight Fokker F-27s, 20 McDonnell Douglas DC-9s and 13 MD-88s.[24] Iberia's shareholding in Aviaco was boosted from 33% to 100% in 1998,[25] when the Spanish flag carrier took control of 67% of the shares that were held by the SEPI.[26][27] Since then, Iberia plans for Aviaco were to absorb it;[27] this occurred on 1 September 1999 (1999-09-01).[28]",
			"color": "tan|0.50969 burly|0.21433 wood|0.21433 dim|0.08741 gray|0.08741 dim|0.08741 grey|0.08741 black|0.017594 gray|0.01626 grey|0.01626 dark|0.012721 gray|0.012721 dark|0.012721 grey|0.012721 light|0.011867 slate|0.011867 gray|0.011867 slate|0.01012 gray|0.01012 sea|0.0088405 shell|0.0088405 floral|0.00829 white|0.00829 white|0.0082387 smoke|0.0082387 snow|0.007799 white|0.0072158 mint|0.007027 cream|0.007027 linen|0.0066371 ghost|0.0063061 white|0.0063061 silver|0.006161 antique|0.0054527 white|0.0054527  "
		}
	}
}
