{
	"add": {
		"doc": {
			"id": "4d668bd4a681a478a72b3e330215861053d67fcb616e20ea94cca57f49f27eb3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Akashi_Gidayu_writing_his_death_poem_before_committing_Seppuku.jpg/220px-Akashi_Gidayu_writing_his_death_poem_before_committing_Seppuku.jpg",
				"previous": "In the 13th century, Hōjō Shigetoki (1198–1261 AD) wrote: \"When one is serving officially or in the master's court, he should not think of a hundred or a thousand people, but should consider only the importance of the master.\"[10] Carl Steenstrup noted that 13th and 14th century warrior writings (gunki) \"portrayed the bushi in their natural element, war, eulogizing such virtues as reckless bravery, fierce family pride, and selfless, at times senseless devotion of master and man\".[11] Feudal lords such as Shiba Yoshimasa (1350–1410 AD) stated that a warrior looked forward to a glorious death in the service of a military leader or the emperor: \"It is a matter of regret to let the moment when one should die pass by....First, a man whose profession is the use of arms should think and then act upon not only his own fame, but also that of his descendants. He should not scandalize his name forever by holding his one and only life too dear....One's main purpose in throwing away his life is to do so either for the sake of the Emperor or in some great undertaking of a military general. It is that exactly that will be the great fame of one's descendants.\"[12]",
				"after": "In 1412 AD, Imagawa Sadayo wrote a letter of admonishment to his brother stressing the importance of duty to one's master. Imagawa was admired for his balance of military and administrative skills during his lifetime and his writings became widespread. The letters became central to Tokugawa-era laws and were a required study for traditional Japanese until World War II:[citation needed]",
			"color": "golden|0.70395 rod|0.70395 dark|0.072368 khaki|0.072368 burly|0.069079 wood|0.069079 dark|0.065789 golden|0.065789 rod|0.065789 tan|0.049342 khaki|0.039474  "
		}
	}
}
