{
	"add": {
		"doc": {
			"id": "4d661a659e2d8856ca38b04c0e6219e8c90b86b9507931fce268ba489cca4908",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Potala_palace21.jpg/220px-Potala_palace21.jpg",
				"previous": "The most distinctive feature of Tibetan architecture is that many of the houses and monasteries are built on elevated, sunny sites facing the south, and are often made out of a mixture of rocks, wood, cement and earth. Little fuel is available for heat or lighting, so flat roofs are built to conserve heat, and multiple windows are constructed to let in sunlight. Walls are usually sloped inwards at 10 degrees as a precaution against the frequent earthquakes in this mountainous area.",
				"after": "Standing at 117 meters in height and 360 meters in width, the Potala Palace is the most important example of Tibetan architecture. Formerly the residence of the Dalai Lama, it contains over one thousand rooms within thirteen stories, and houses portraits of the past Dalai Lamas and statues of the Buddha. It is divided between the outer White Palace, which serves as the administrative quarters, and the inner Red Quarters, which houses the assembly hall of the Lamas, chapels, 10,000 shrines, and a vast library of Buddhist scriptures. The Potala Palace is a World Heritage Site, as is Norbulingka, the former summer residence of the Dalai Lama.",
			"color": "black|0.141 dark|0.066828 gray|0.066828 dark|0.066828 grey|0.066828 light|0.065927 gray|0.065927 light|0.065927 grey|0.065927 silver|0.065253 rosy|0.059362 brown|0.059362 gray|0.056112 grey|0.056112 dim|0.048028 gray|0.048028 dim|0.048028 grey|0.048028 gainsboro|0.04487 misty|0.041224 rose|0.041224 antique|0.029249 white|0.029249 linen|0.029008 sea|0.023217 shell|0.023217 tan|0.019573 old|0.018599 lace|0.018599 floral|0.01854 white|0.01854 white|0.017506 smoke|0.017506 steel|0.016608 blue|0.016608 snow|0.015834 lavender|0.015506 blush|0.015506 white|0.011076 ivory|0.01042 mint|0.0091237 cream|0.0091237 dark|0.0090278 olive|0.0090278 green|0.0090278  "
		}
	}
}
