{
	"add": {
		"doc": {
			"id": "4d7252441786e035c2a43c124abf87daf521e0b1c5b8a34d74ea872502e234c7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Sculpture_at_Siddhesvara_temple_at_Haveri.JPG/150px-Sculpture_at_Siddhesvara_temple_at_Haveri.JPG",
				"previous": "An important feature of Western Chalukya roof art is the use of domical ceilings (not to be confused with the European types that are built of voussoirs with radiating joints) and square ceilings. Both types of ceilings originate from the square formed in the ceiling by the four beams that rest on four pillars. The dome above the four central pillars is normally the most attractive.[26] The dome is constructed of ring upon ring of stones, each horizontally bedded ring smaller than the one below. The top is closed by a single stone slab. The rings are not cemented but held in place by the immense weight of the roofing material above them pressing down on the haunches of the dome.[26] The triangular spaces created when the dome springs from the centre of the square are filled with arabesques. In the case of square ceilings, the ceiling is divided into compartments with images of lotus rosettes or other images from Hindu mythology.[26]",
				"after": "Pillars are a major part of Western Chalukya architecture and were produced in two main types: pillars with alternate square blocks and a sculptured cylindrical section with a plain square-block base, and bell-shaped lathe-turned pillars. The former type is more vigorous and stronger than the bell-shaped type, which is made of soapstone and has a quality of its own.[30] Inventive workmanship was used on soapstone shafts, roughly carved into the required shapes using a lathe. Instead of laboriously rotating a shaft to obtain the final finish, workers added the final touches to an upright shaft by using sharp tools. Some pillars were left unpolished, as evidenced by the presence of fine grooves made by the pointed end of the tool. In other cases, polishing resulted in pillars with fine reflective properties such as the pillars in the temples at Bankapura, Itagi and Hangal.[30] This pillar art reached its zenith in the temples at Gadag, specifically the Sarasvati Temple in Gadag city.[55]",
			"color": "gray|0.2428 grey|0.2428 dim|0.15428 gray|0.15428 dim|0.15428 grey|0.15428 dark|0.13427 gray|0.13427 dark|0.13427 grey|0.13427 silver|0.11983 rosy|0.11068 brown|0.11068 light|0.069199 gray|0.069199 light|0.069199 grey|0.069199 thistle|0.042031 gainsboro|0.037186 misty|0.022485 rose|0.022485 lavender|0.013076 blush|0.013076 lavender|0.008607 white|0.0057734 smoke|0.0057734 ghost|0.004941 white|0.004941 slate|0.0047038 gray|0.0047038  "
		}
	}
}
