{
	"add": {
		"doc": {
			"id": "4da50f03aa734addc6dbb8614c36c5ef6df0e560d8791768f6e3c172e46e1371",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Tampabaybucsrock.JPG/220px-Tampabaybucsrock.JPG",
				"previous": "In 1975, the Buccaneers built a small practice complex with offices near Tampa International Airport called One Buccaneer Place. As other NFL teams upgraded their facilities, Bucs players and coaches stepped up their complaints about the aircraft noise, cramped offices, small locker rooms and run-down condition of One Buc Place. Even then-head coach Jon Gruden has sarcastically referred to the facility as \"The Woodshed.\" For much of the team's existence, the Bucs held training camp on the University of Tampa campus, then at the expansive and better-equipped Disney's Wide World of Sports Complex near Orlando (2002—2008).",
				"after": "In August 2006, the Bucs unveiled their new training facility. Conveniently located across the street from Raymond James Stadium (on the former site of Tampa Bay Center), this state-of-the-art complex (145,000-square-foot (13,500 m2) facility on 33 acres (13 ha)) is the largest in the NFL. Its features include offices and meeting rooms, three natural grass practice fields, a theatre for meetings and press conferences, an expanded weight room, a fully equipped kitchen and dining room, a rehabilitation center with three separate pools and a locker room twice the size of the former location. The building is capped off with a giant five-story glass and steel football as a key design element. A third practice field, featuring artificial turf, was also planned. In 2009, the team began holding training camp at the new upgraded facilities in Tampa.",
			"color": "light|0.17702 gray|0.17702 light|0.17702 grey|0.17702 silver|0.16416 gainsboro|0.15216 dim|0.10203 gray|0.10203 dim|0.10203 grey|0.10203 dark|0.096271 gray|0.096271 dark|0.096271 grey|0.096271 black|0.087462 gray|0.038919 grey|0.038919 tomato|0.034238 white|0.027777 smoke|0.027777 linen|0.021685 brown|0.016475 sea|0.012268 shell|0.012268  "
		}
	}
}
