{
	"add": {
		"doc": {
			"id": "4db9c0711251b1f7719cdc304560af07cb958719ab18e07ee5876cd492dbd002",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Castle_and_Merriam_Peaks.JPG/275px-Castle_and_Merriam_Peaks.JPG",
				"previous": "In 1960, Democrat Frank Church, a U.S. Senator from Idaho, first introduced legislation for a feasibility study to survey the area for national park status.[10][11] While Church allowed the 1960 feasibility study legislation to die, he introduced a bill in 1963 to create Sawtooth Wilderness National Park, which would primarily encompass the existing Sawtooth Primitive Area. Although the 1963 bill also was not voted on, Church admitted that it was not designed to pass but rather to encourage thorough feasibility studies by both the Forest Service and National Park Service. A 1965 joint report by the two agencies recommended either a national park administered by the National Park Service or a national recreation area managed by the Forest Service. In April 1966, Church introduced two bills, one to establish Sawtooth National Park and another to establish the Sawtooth National Recreation Area (SNRA). The SNRA bill was cosponsored by Republican Leonard B. Jordan, another Senator from Idaho, because it preserved the area while also permitting traditional uses such as logging, hunting, and grazing. The legislation was not supported by Idaho's members of the U.S. House of Representatives.[10]",
				"after": "In 1968 the American Smelting and Refining Company (ASARCO) discovered a molybdenum deposit at the base of Castle Peak, the highest peak in the White Cloud Mountains. ASARCO filed paperwork with the Forest Service to construct roads and to allow for an open pit mine below Castle Peak to extract the ore. The proposed mine would have been 350 ft (110 m) deep, 700 ft (210 m) wide, and 7,000 ft (2,100 m) long. About 20,000 short tons (18,000 t) of material would be processed daily with 99.5 percent being deposited in waste piles and settling ponds. ASARCO estimated that the mine would create 350 jobs and $1 million ($6.78 million today[12]) in taxes per year, while the roads would open up opportunities for further exploration. The Forest Service would not be able to stop mining and protect the White Cloud Mountains because the General Mining Act of 1872 gave mining rights to anyone who had located a lode or placer.[11] Nationally, opposition to the mine mounted, while in 1970 Republican Idaho Governor Don Samuelson voiced support for the mine, saying that ASARCO was not, \"going to tear down mountains. They are only going to dig a hole.\" He also characterized Castle Peak as, \"nothing but sagebrush on one side and scraggly trees on the other.\"[10] Samuelson lost reelection in 1970 to Cecil D. Andrus, a Democrat and supporter of preserving the forest who later (1977-81) served as U.S. interior secretary in the Carter Administration.[10]",
			"color": "dark|0.34507 olive|0.34507 green|0.34507 dark|0.12475 gray|0.12475 dark|0.12475 grey|0.12475 black|0.10033 gray|0.083049 grey|0.083049 dim|0.082614 gray|0.082614 dim|0.082614 grey|0.082614 silver|0.050791 slate|0.041458 gray|0.041458 light|0.038273 slate|0.038273 gray|0.038273 light|0.022085 gray|0.022085 light|0.022085 grey|0.022085 dark|0.020269 slate|0.020269 gray|0.020269 gainsboro|0.014729 dark|0.01083 sea|0.01083 green|0.01083 white|0.0072171 smoke|0.0072171  "
		}
	}
}
