{
	"add": {
		"doc": {
			"id": "4db9f3f80d1b0222053b95b61fca1db26e1bfa3bc31c2507cbd06e5defe44f54",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Amsterdam_Concertgebouw.jpg/220px-Amsterdam_Concertgebouw.jpg",
				"previous": "The Heineken Music Hall is also host to many electronic dance music festivals, alongside many other venues. Armin van Buuren and Tiesto, some of the world's leading Trance DJ's hail from the Netherlands and perform frequently in Amsterdam. Each year in October, the city hosts the Amsterdam Dance Event (ADE) which is one of the leading electronic music conferences and one of the biggest club festivals for electronic music in the world. Another popular dance festival is 5daysoff, which takes place in the venues Paradiso and Melkweg. In summer time there are several big outdoor dance parties in or nearby Amsterdam, such as Awakenings, Dance Valley, Mystery Land, Loveland, A Day at the Park, Welcome to the Future, and Valtifest.",
				"after": "Amsterdam has a world-class symphony orchestra, the Royal Concertgebouw Orchestra. Their home is the Concertgebouw, which is across the Van Baerlestraat from the Museum Square. It is considered by critics to be a concert hall with some of the best acoustics in the world. The building contains three halls, Grote Zaal, Kleine Zaal, and Spiegelzaal. Some nine hundred concerts and other events per year take place in the Concertgebouw, for a public of over 700,000, making it one of the most-visited concert halls in the world.[118] The opera house of Amsterdam is situated adjacent to the city hall. Therefore, the two buildings combined are often called the Stopera, (a word originally coined by protesters against it very construction: Stop the Opera[-house]). This huge modern complex, opened in 1986, lies in the former Jewish neighbourhood at Waterlooplein next to the river Amstel. The Stopera is the homebase of Dutch National Opera, Dutch National Ballet and the Holland Symfonia. Muziekgebouw aan 't IJ is a concert hall, which is situated in the IJ near the central station. Its concerts perform mostly modern classical music. Located adjacent to it, is the Bimhuis, a concert hall for improvised and Jazz music.",
			"color": "dark|0.27573 gray|0.27573 dark|0.27573 grey|0.27573 silver|0.22067 dim|0.19429 gray|0.19429 dim|0.19429 grey|0.19429 gray|0.080272 grey|0.080272 dark|0.044361 slate|0.044361 gray|0.044361 black|0.043409 slate|0.034514 gray|0.034514 light|0.026433 gray|0.026433 light|0.026433 grey|0.026433 light|0.025323 slate|0.025323 gray|0.025323 dark|0.013966 olive|0.013966 green|0.013966 cadet|0.01248 blue|0.01248 gainsboro|0.0087803  "
		}
	}
}
