{
	"add": {
		"doc": {
			"id": "4dcc1f1992f5b1ef6b92fdc68fb59dcac8fa379848836f2895eb2a10dcc14e38",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Milit%C3%A4rbefehlshaber.jpg/200px-Milit%C3%A4rbefehlshaber.jpg",
			"previous": [],
				"after": "The territory of Serbia was the only area of the Kingdom of Yugoslavia in which the Germans imposed a military government of occupation, largely due to the key transport routes and important resources located in the territory. Despite prior agreement with the Italians that they would establish an 'independent Serbia', Serbia in fact had a puppet government, Germany accorded it no status in international law except that of a fully occupied country, and it did not enjoy formal diplomatic status with the Axis powers and their satellites as the Independent State of Croatia did.[41] The occupation arrangements underwent a series of changes between April 1941 and 1944, however throughout the German occupation, the military commander in Serbia was the head of the occupation regime. This position underwent a number of title changes during the occupation. The day-to-day administration of the occupation was conducted by the chief of the military administration branch responsible to the military commander in Serbia. The puppet governments established by the Germans were responsible to the chief of military administration, although multiple and often parallel chains of German command and control meant that the puppet government was responsible to different German functionaries for different aspects of the occupation regime, such as the special plenipotentiary for economic affairs and the Higher SS and Police Leader.[78] For example, the plenipotentiary for economic affairs, Franz Neuhausen, who was Göring's personal representative in the occupied territory, was directly responsible to the Reichsmarshall for aspects of the German Four Year Plan, and had complete control over the Serbian economy.[79]",
			"color": "black|0.20349 white|0.067641 mint|0.067508 cream|0.067508 snow|0.067507 ghost|0.066879 white|0.066879 white|0.066415 smoke|0.066415 azure|0.066161 alice|0.064493 blue|0.064493 sea|0.064192 shell|0.064192 floral|0.064182 white|0.064182 lavender|0.059039 blush|0.059039 dark|0.01919 gray|0.01919 dark|0.01919 grey|0.01919 silver|0.018423 dim|0.014613 gray|0.014613 dim|0.014613 grey|0.014613 gray|0.013062 grey|0.013062 light|0.010325 gray|0.010325 light|0.010325 grey|0.010325 gainsboro|0.010087 firebrick|0.0074855 ivory|0.00499 brown|0.0044498 maroon|0.0042901 light|0.0039899 coral|0.0039899 linen|0.0037754  "
		}
	}
}
