{
	"add": {
		"doc": {
			"id": "4de71b11b039e1a03d0b70267c9f6be54290355a2d26bec25c9deba3cef84baf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Kochadaiiyaan_Rajini.jpg/99px-Kochadaiiyaan_Rajini.jpg",
			"previous": [
				"",
				"(later...) From what I can tell after looking into this briefly is that a short comedic film was make in 2009, The Borghilde Project (note the spelling) and everything comes from that. It doesn't appear to have been a hoax, in that no one I can see was trying to fool anyone -- maybe it's a meme? I don't know, but since both the article, and the sources it uses, don't even seem aware of the film there's something seriously wrong in the presentation. I'm sorry to seem harsh but while it's OK for an article to have gaps, this really leaves the reader with a complete misimpression of the nature of this ... whatever it is. EEng (talk) 19:53, 3 April 2015 (UTC)"
			],
			"after": [
				"Created by Skr15081997 (talk) and Kailash29792 (talk). Nominated by Skr15081997 (talk) at 11:44, 13 April 2015 (UTC).",
				"",
				"Create a subpage for your new DYK suggestion and then list the page below under the date the article was created or the expansion began (not the date you submit it here), with the newest dates at the bottom. Any registered user may nominate a DYK suggestion (if you are not a registered user, please leave a message at the bottom of the DYK project talk page with the details of the article you would like to nominate and the hook you would like to propose); self-nominations are permitted and encouraged. Thanks for participating and please remember to check back for comments on your nomination (consider watchlisting your nomination page)."
			],
			"color": "sienna|0.086515 peru|0.078907 wheat|0.078169 lemon|0.071181 chiffon|0.071181 blanched|0.068323 almond|0.068323 moccasin|0.06632 sandy|0.066098 brown|0.066098 light|0.064439 golden|0.064439 rod|0.064439 yellow|0.064439 bisque|0.060726 corn|0.046249 silk|0.046249 papaya|0.046094 whip|0.046094 navajo|0.042305 white|0.042305 light|0.039198 yellow|0.039198 saddle|0.033792 brown|0.033792 beige|0.028173 black|0.018641 burly|0.016811 wood|0.016811 peach|0.015942 puff|0.015942 tan|0.011244 antique|0.0081313 white|0.0081313 dim|0.0077696 gray|0.0077696 dim|0.0077696 grey|0.0077696 dark|0.0061704 salmon|0.0061704 light|0.0061543 salmon|0.0061543 gray|0.0059928 grey|0.0059928 old|0.0056035 lace|0.0056035 ivory|0.0055207  "
		}
	}
}
