{
	"add": {
		"doc": {
			"id": "4dee2360c3b5691e0c0d842e8c06768e47ce94b18e20d308d0a5a6085ef6755f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Ranger_L-440.jpg/220px-Ranger_L-440.jpg",
			"previous": [],
				"after": "This type of engine has cylinders lined up in one row. It typically has an even number of cylinders, but there are instances of three- and five- cylinder engines. The greatest advantage of an inline engine is that it allows the aircraft to be designed with a low frontal area to minimise drag. If the engine crankshaft is located above the cylinders, it is called an inverted inline engine: this allows the propeller to be mounted high up to increase ground clearance, enabling shorter landing gear. The disadvantages of an inline engine include a poor power-to-weight ratio, because the crankcase and crankshaft are long and thus heavy. An in-line engine may be either air-cooled or liquid-cooled, but liquid-cooling is more common because it is difficult to get enough air-flow to cool the rear cylinders directly. Inline engines were common in early aircraft; one was used in the Wright Flyer, the aircraft that made the first controlled powered flight. However, the inherent disadvantages of the design soon became apparent, and the inline design was abandoned, becoming a rarity in modern aviation.",
			"color": "tan|0.28137 burly|0.083713 wood|0.083713 wheat|0.059513 black|0.051292 peach|0.039745 puff|0.039745 bisque|0.037437 antique|0.032592 white|0.032592 blanched|0.031878 almond|0.031878 moccasin|0.028735 papaya|0.027739 whip|0.027739 navajo|0.027213 white|0.027213 old|0.023539 lace|0.023539 linen|0.020709 corn|0.020575 silk|0.020575 beige|0.019509 floral|0.017868 white|0.017868 ivory|0.017279 sea|0.016457 shell|0.016457 rosy|0.015237 brown|0.015237 dark|0.013787 gray|0.013787 dark|0.013787 grey|0.013787 light|0.012868 yellow|0.012868 light|0.012646 golden|0.012646 rod|0.012646 yellow|0.012646 lemon|0.01251 chiffon|0.01251 dark|0.010905 khaki|0.010905 snow|0.010314 white|0.010184 smoke|0.010184  "
		}
	}
}
