{
	"add": {
		"doc": {
			"id": "4df8def534c65707cfe49e31031c75b8c6b973be9eb84da7dd916aaaadff82cf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Antarctic-Postal-Services.jpg/220px-Antarctic-Postal-Services.jpg",
				"previous": "Although coal, hydrocarbons, iron ore, platinum, copper, chromium, nickel, gold and other minerals have been found, they have not been in large enough quantities to exploit. The 1991 Protocol on Environmental Protection to the Antarctic Treaty also restricts a struggle for resources. In 1998, a compromise agreement was reached to place an indefinite ban on mining, to be reviewed in 2048, further limiting economic development and exploitation. The primary economic activity is the capture and offshore trading of fish. Antarctic fisheries in 2000–01 reported landing 112,934 tonnes.",
				"after": "Small-scale \"expedition tourism\" has existed since 1957 and is currently subject to Antarctic Treaty and Environmental Protocol provisions, but in effect self-regulated by the International Association of Antarctica Tour Operators (IAATO). Not all vessels associated with Antarctic tourism are members of IAATO, but IAATO members account for 95% of the tourist activity. Travel is largely by small or medium ship, focusing on specific scenic locations with accessible concentrations of iconic wildlife. A total of 37,506 tourists visited during the 2006–07 Austral summer with nearly all of them coming from commercial ships. The number was predicted to increase to over 80,000 by 2010.[93][94]",
			"color": "light|0.46457 steel|0.46457 blue|0.46457 silver|0.13905 dark|0.12196 gray|0.12196 dark|0.12196 grey|0.12196 light|0.070452 slate|0.070452 gray|0.070452 light|0.055968 blue|0.055968 dark|0.036508 golden|0.036508 rod|0.036508 gray|0.030644 grey|0.030644 light|0.030571 gray|0.030571 light|0.030571 grey|0.030571 slate|0.018803 gray|0.018803 golden|0.009595 rod|0.009595 tan|0.0063394 dim|0.0032919 gray|0.0032919 dim|0.0032919 grey|0.0032919 powder|0.0031827 blue|0.0031827  "
		}
	}
}
