{
	"add": {
		"doc": {
			"id": "4e00f1c9aca65b7953ca1bdd60833296601d544585f33032816ab713253b379f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Pan_Am_Boeing_737-200_at_Zurich_Airport_in_May_1985.jpg/220px-Pan_Am_Boeing_737-200_at_Zurich_Airport_in_May_1985.jpg",
				"previous": "In order to acquire domestic routes, Pan Am, under president Seawell, set its eyes on National Airlines. Pan Am wound up in a bidding war with Frank Lorenzo, which greatly raised the price of National's stock. Nevertheless, Pan Am was granted permission to buy National in 1980 in what was described as the \"Coup of the Decade.\" The acquisition of National Airlines for $437 million further burdened Pan Am's balance sheet, which was already under strain as a result of financing the large number of Boeing 747s that were ordered in the mid-1960s. This acquisition did little to improve Pan Am's competitive position in relation to nimbler, lower-cost competitors in a deregulated industry as National's North-South route structure provided insufficient feed at Pan Am's transatlantic and transpacific gateways in New York and Los Angeles respectively. In addition, both airlines had incompatible fleets (apart from the Boeing 727) and corporate cultures (partly as a result of the former being perceived by some Pan Am employees as mainly a regional \"backwoods\" carrier with few trunk routes), and the integration was poorly handled by Pan Am management who presided over an increase in labor costs as a result of harmonizing National's pay scales with Pan Am's.[87] Although revenues increased by 62% from 1979 to 1980, fuel costs from the merger increased by 157% during a weak economic climate. Further \"miscellaneous expenses\" increased by 74%.[88][89]",
			"after": [],
			"color": "dim|0.11037 gray|0.11037 dim|0.11037 grey|0.11037 dark|0.081122 gray|0.081122 dark|0.081122 grey|0.081122 black|0.072644 light|0.056092 slate|0.056092 gray|0.056092 dark|0.055972 slate|0.055972 gray|0.055972 slate|0.054022 gray|0.054022 gray|0.048878 grey|0.048878 light|0.048243 gray|0.048243 light|0.048243 grey|0.048243 gainsboro|0.046115 silver|0.045641 light|0.040945 steel|0.040945 blue|0.040945 dark|0.038836 olive|0.038836 green|0.038836 alice|0.034884 blue|0.034884 white|0.0336 smoke|0.0336 ghost|0.03332 white|0.03332 lavender|0.03275 snow|0.027678 lavender|0.025322 blush|0.025322 white|0.025214 azure|0.02164 sea|0.0201 shell|0.0201 mint|0.019626 cream|0.019626 floral|0.013868 white|0.013868  "
		}
	}
}
