{
	"add": {
		"doc": {
			"id": "4e01103963645a66747b79c79789d54e5b4d54a8862f169c28f618710d28c1d0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Attenuation.svg/220px-Attenuation.svg.png",
				"previous": "X-ray photons carry enough energy to ionize atoms and disrupt molecular bonds. This makes it a type of ionizing radiation, and therefore harmful to living tissue. A very high radiation dose over a short amount of time causes radiation sickness, while lower doses can give an increased risk of radiation-induced cancer. In medical imaging this increased cancer risk is generally greatly outweighed by the benefits of the examination. The ionizing capability of X-rays can be utilized in cancer treatment to kill malignant cells using radiation therapy. It is also used for material characterization using X-ray spectroscopy.",
				"after": "Hard X-rays can traverse relatively thick objects without being much absorbed or scattered. For this reason, X-rays are widely used to image the inside of visually opaque objects. The most often seen applications are in medical radiography and airport security scanners, but similar techniques are also important in industry (e.g. industrial radiography and industrial CT scanning) and research (e.g. small animal CT). The penetration depth varies with several orders of magnitude over the X-ray spectrum. This allows the photon energy to be adjusted for the application so as to give sufficient transmission through the object and at the same time good contrast in the image.",
			"color": "white|0.096978 smoke|0.096978 white|0.096969 snow|0.096834 mint|0.096476 cream|0.096476 ghost|0.096435 white|0.096435 sea|0.096245 shell|0.096245 floral|0.096135 white|0.096135 azure|0.096056 alice|0.095991 blue|0.095991 lavender|0.093207 blush|0.093207 blue|0.012846 ivory|0.0035922 lavender|0.0033756 light|0.0031219 gray|0.0031219 light|0.0031219 grey|0.0031219 dark|0.003059 gray|0.003059 dark|0.003059 grey|0.003059 silver|0.0030473 gainsboro|0.002611  "
		}
	}
}
