{
	"add": {
		"doc": {
			"id": "4e0f224664a9e93c5384d0cfb3d8280e1bdd1cabc6b343ec4f0fad6af8f01b15",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Tyrannosaur_arm_104.JPG/220px-Tyrannosaur_arm_104.JPG",
				"previous": "When Tyrannosaurus rex was first discovered, the humerus was the only element of the forelimb known.[66] For the initial mounted skeleton as seen by the public in 1915, Osborn substituted longer, three-fingered forelimbs like those of Allosaurus.[67] However, a year earlier, Lawrence Lambe described the short, two-fingered forelimbs of the closely related Gorgosaurus.[68] This strongly suggested that Tyrannosaurus rex had similar forelimbs, but this hypothesis was not confirmed until the first complete Tyrannosaurus rex forelimbs were identified in 1989, belonging to MOR 555 (the \"Wankel rex\").[69] The remains of \"Sue\" also include complete forelimbs.[20] Tyrannosaurus rex arms are very small relative to overall body size, measuring only 1 metre (3.3 ft) long, and some scholars have labelled them as vestigial. However, the bones show large areas for muscle attachment, indicating considerable strength. This was recognized as early as 1906 by Osborn, who speculated that the forelimbs may have been used to grasp a mate during copulation.[70] It has also been suggested that the forelimbs were used to assist the animal in rising from a prone position.[63]",
				"after": "Another possibility is that the forelimbs held struggling prey while it was killed by the tyrannosaur's enormous jaws. This hypothesis may be supported by biomechanical analysis. Tyrannosaurus rex forelimb bones exhibit extremely thick cortical bone, which have been interpreted as evidence that they were developed to withstand heavy loads. The biceps brachii muscle of a full-grown Tyrannosaurus rex was capable of lifting 199 kilograms (439 lb) by itself; other muscles such as the brachialis would work along with the biceps to make elbow flexion even more powerful. The M. biceps muscle of T. rex was 3.5 times as powerful as the human equivalent. A Tyrannosaurus rex forearm had a limited range of motion, with the shoulder and elbow joints allowing only 40 and 45 degrees of motion, respectively. In contrast, the same two joints in Deinonychus allow up to 88 and 130 degrees of motion, respectively, while a human arm can rotate 360 degrees at the shoulder and move through 165 degrees at the elbow. The heavy build of the arm bones, strength of the muscles, and limited range of motion may indicate a system evolved to hold fast despite the stresses of a struggling prey animal. In the first detailed scientific description of Tyrannosaurus forelimbs, paleontologists Kenneth Carpenter and Matt Smith dismissed notions that the forelimbs were useless or that Tyrannosaurus rex was an obligate scavenger.[71]",
			"color": "black|0.29073 dim|0.20203 gray|0.20203 dim|0.20203 grey|0.20203 white|0.041963 snow|0.04125 white|0.04113 smoke|0.04113 ghost|0.039929 white|0.039929 mint|0.039392 cream|0.039392 alice|0.038461 blue|0.038461 sea|0.038393 shell|0.038393 gray|0.038002 grey|0.038002 azure|0.037675 floral|0.037388 white|0.037388 lavender|0.028218 blush|0.028218 dark|0.025682 gray|0.025682 dark|0.025682 grey|0.025682 silver|0.018661 light|0.014353 gray|0.014353 light|0.014353 grey|0.014353 gainsboro|0.012108 ivory|0.0079277 linen|0.0058362  "
		}
	}
}
