{
	"add": {
		"doc": {
			"id": "4e26d0ea896d75c3a8b0b95c15b8e896476a95146b6bd598bdb940d6eb521d91",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Dragonair.Airbus_A330-300.Economy_class.2010.JPG/220px-Dragonair.Airbus_A330-300.Economy_class.2010.JPG",
				"previous": "The wing-to-fuselage mating of the first A330, the tenth airframe of the A330 and A340 line, began in mid-February 1992. This aircraft, coated with anti-corrosion paint, was rolled out on 31 March without its General Electric CF6-80E1 engines, which were installed by August. During a static test, the wing failed just below requirement, BAe engineers later solved the problem.[39] At the 1992 Farnborough Airshow, Northwest deferred delivery of sixteen A330s to 1994, following the cancellation of its A340 orders.[40]",
				"after": "The first completed A330 was rolled out on 14 October 1992, with the maiden flight following on 2 November. Weighing 181,840 kg (401,000 lb), including 20,980 kg (46,300 lb) of test equipment,[39] the A330 became the biggest twinjet to have flown, until the later first flight of the Boeing 777. The flight lasted five hours and fifteen minutes during which speed, height, and other flight configurations were tested. Airbus intended the test flight programme to comprise six aircraft flying a total of 1,800 hours.[39] On 21 October 1993, the Airbus A330 received the European Joint Aviation Authorities (JAA) and US Federal Aviation Administration (FAA) certifications simultaneously after 1,114 cumulative airborne test hours and 426 test flights. At the same time, weight tests came in favourable, showing the plane was 500 kg (1,100 lb) under weight.[41]",
			"color": "maroon|0.27472 saddle|0.21629 brown|0.21629 dark|0.066611 red|0.066611 brown|0.06206 black|0.035472 khaki|0.029033 royal|0.026261 blue|0.026261 dodger|0.023161 blue|0.023161 dark|0.021134 khaki|0.021134 indian|0.020568 red|0.020568 corn|0.020299 flower|0.020299 blue|0.020299 firebrick|0.017378 dark|0.015828 golden|0.015828 rod|0.015828 sienna|0.015441 dark|0.015381 slate|0.015381 blue|0.015381 steel|0.015083 blue|0.015083 light|0.013617 slate|0.013617 gray|0.013617 slate|0.013279 gray|0.013279 midnight|0.01091 blue|0.01091 light|0.0096081 steel|0.0096081 blue|0.0096081  "
		}
	}
}
