{
	"add": {
		"doc": {
			"id": "4e2a512d89dcb3bfc7e904e723965866cc278103238e0373f693d835373b4582",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Haras_in_Saint-L%C3%B4_%2C_Normandi%C3%AB%2C_France.jpg/220px-Haras_in_Saint-L%C3%B4_%2C_Normandi%C3%AB%2C_France.jpg",
			"previous": [],
				"after": "The Percheron breed originated in the Huisne river valley in France,[6] which arises in Orne, part of the former Perche province, from which the breed gets its name. Several theories have been put forth as to the ancestry of the breed, though its exact origins are unknown. One source of foundation bloodstock may have been mares captured by Clovis I from the Bretons some time after 496 AD, and another may have been Arabian stallions brought to the area by Muslim invaders in the 8th century. Other possibilities are captured Moorish cavalry horses from the Battle of Poitiers in 732 AD, some of which were taken by warriors from Perche. A final theory posits that the Percheron and the Boulonnais breed are closely related, and that the Boulonnais influenced the Percheron when they were brought to Brittany as reinforcements for the legions of Caesar. It is known that during the 8th century, Arabian stallions were crossed with mares native to the area, and more Oriental horse blood was introduced by the Comte de Perche upon his return from the Crusades and expeditions into territory claimed by Spain. Blood from Spanish breeds was added when the Comte de Rotrou imported horses from Castile.[7] No matter the theory of origin, breed historians agree that the terrain and climate of the Perche area had the greatest influence on the development of the breed.[8] A possible reference to the horse is made in the 13th-century romance Guillaume de Dole, in which the titular character asks for \"the Count of Perche's horse\" to be made ready, possibly indicating the \"'great horse,' which could accommodate an armored knight\" and was bred in the geographical setting of the poem.[9]",
			"color": "black|0.30302 silver|0.19912 dark|0.17411 gray|0.17411 dark|0.17411 grey|0.17411 gray|0.082042 grey|0.082042 dim|0.079707 gray|0.079707 dim|0.079707 grey|0.079707 light|0.043619 gray|0.043619 light|0.043619 grey|0.043619 gainsboro|0.021603 antique|0.016604 white|0.016604  "
		}
	}
}
