{
	"add": {
		"doc": {
			"id": "4e35e33033dc5bc02209df72143e629e4cacde4be8674c74c1e9d32ec075e0b4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Royal_Air_Maroc_Caravelle_Haafke.jpg/220px-Royal_Air_Maroc_Caravelle_Haafke.jpg",
			"previous": [],
				"after": "Royal Air Maroc—Compagnie Nationale de Transports Aériens was formed in July 1953 (1953-07) as a result of the merger of Compagnie Chérifienne de'l Air (Air Atlas) —setup in 1946 with Junkers Ju-52s— and Compagnie Chérifienne de Transports Aériens Air Maroc, that was founded in 1947 and commenced scheduled operations in 1949.[7] The fleet of the newly formed airline included six Bretagnes, four Commandos, five DC-3s and two Languedocs.[8] These aircraft worked on routes previously served by the predecessor companies, plus Frankfurt, Geneva and Paris.[9] The name Royal Air Maroc (RAM) was adopted on 28 June 1957,[nb 1] with the government of Morocco having a 67.73% stake.[10] Hajj flights commenced in 1957.[9] The carrier's fleet comprised 16 aircraft by April 1958 (1958-04), including four DC-4s, three DC-3s, seven Bretagnes and two C-46s.[11] In May 1958 (1958-05), the airline ordered two Caravelles.[6]:101 In July, a number of long-haul routes were launched using four Lockheed L-749 Constellations leased from Air France, and the coastal Oran–Oujda run —which had been suspended in May— was reopened. Also in 1958, the carrier started flying to Gibraltar. The arrival of the Constellations enabled the airline to withdraw the DC-4s from service.[9]",
			"color": "dark|0.44068 gray|0.44068 dark|0.44068 grey|0.44068 silver|0.31698 gray|0.053198 grey|0.053198 dim|0.041818 gray|0.041818 dim|0.041818 grey|0.041818 light|0.034509 gray|0.034509 light|0.034509 grey|0.034509 black|0.027252 gainsboro|0.024358 light|0.0074582 slate|0.0074582 gray|0.0074582 slate|0.0072347 gray|0.0072347 white|0.0060098 smoke|0.0060098 alice|0.0039494 blue|0.0039494 snow|0.0037797 ghost|0.0037204 white|0.0037204 sea|0.003574 shell|0.003574 white|0.0031428 light|0.0031194 steel|0.0031194 blue|0.0031194 lavender|0.002918  "
		}
	}
}
