{
	"add": {
		"doc": {
			"id": "4e3fbd13e4dd556e99bc635c51fb3bf285ab8fe15f6af84f435e68a68d1d6a2e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Golden_law_1888_Brazilian_senate.jpg/250px-Golden_law_1888_Brazilian_senate.jpg",
				"previous": "After their experience of the perils and obstacles of government, the political figures who had arisen during the 1830s became wary of taking on a greater role in ruling the nation. They looked to the Emperor as providing a fundamental and useful source of authority essential both for governing and for national survival. Pedro II's natural ability and proficiency as a ruler encouraged greater deference as time passed. The political establishment \"perceived him as the key to the successful working of the [political] system, someone whose reputation and authority protected him from all discussion.\"[44] These elder statesmen began to die off or retire from government until, by the 1880s, they had almost entirely been replaced by a younger generation of politicians who had no experience of the Regency and early years of Pedro II's reign, when external and internal dangers threatened the nation's existence. They had only known a stable administration and prosperity.[44] In sharp contrast those of the previous era, the young politicians saw no reason to uphold and defend the Imperial office as a unifying force beneficial to the nation.[45] Pedro II's role in achieving an era of national unity, stability and good government now went unremembered and unconsidered by the ruling elites. By his very success, \"Pedro II had made himself redundant as emperor\".[46]",
				"after": "The lack of an heir who could feasibly provide a new direction for the nation also diminished the long-term prospects for continuation of the Brazilian monarchy. The Emperor loved his daughter Isabel, and respected her strong character. However, he considered the idea of a female successor as antithetical to the role required of Brazil's ruler. \"Destiny had spoken in the loss of his two male heirs and the lack, after their death, of any more sons.\"[47] That view was also shared by the political establishment, who continued to harbor reservations when it came to any thought of accepting a female ruler.[48] Isabel's children were also discounted as heirs. Pedro II had not raised them as possible successors to the throne, but rather in hopes that they would become worthy citizens.[49] The consensus was that a suitable successor \"had to be a man\", that is, a male of the Braganza line.[50]",
			"color": "tan|0.1652 antique|0.11199 white|0.11199 papaya|0.083538 whip|0.083538 wheat|0.080639 blanched|0.080356 almond|0.080356 beige|0.070264 old|0.059436 lace|0.059436 linen|0.053195 bisque|0.04806 corn|0.045213 silk|0.045213 floral|0.033312 white|0.033312 sea|0.032755 shell|0.032755 ivory|0.026785 misty|0.01808 rose|0.01808 white|0.01709 smoke|0.01709 gainsboro|0.016335 light|0.012297 yellow|0.012297 snow|0.0096619 light|0.0094649 golden|0.0094649 rod|0.0094649 yellow|0.0094649  "
		}
	}
}
