{
	"add": {
		"doc": {
			"id": "4e440ce8a2c3adb32816569bbfb97a8c8190f63e0aed1254210d421b7311d0fc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Rutgers_University_Geology_museum_stone_tools_exhibit.JPG/220px-Rutgers_University_Geology_museum_stone_tools_exhibit.JPG",
				"previous": "Six years later, the college's board of trustees decided to erect a building to house the college's new scientific programs.[1]:p.101 At this time, Rutgers was celebrating the centennial anniversary of its second charter (1770) and college president William Henry Campbell (1808–1890) solicited donations from alumni and other supporters in an extensive fundraising effort aimed at supporting these new programs.[3] With these funds, the trustees commissioned a design for a Geological Hall from Henry Janeway Hardenbergh (1847–1918), a young architect from New Brunswick.[1]:p.101[5] Hardenbergh received these contracts through family connections, as several members of his family were graduates, trustees, or associated with the school. His great-great-grandfather, the Rev. Jacob Rutsen Hardenbergh (1736–1790), was Rutgers' first president and one of its founders, and his grandfather, Rev. Jacob Janeway served as vice president of the college and had turned down the post of president in 1840.[5][6]",
				"after": "Hardenbergh's design was described as employing both Gothic elements and classical forms that preceded the extreme eclecticism that was to mark a later Victorian Gothic Revival period.[7] The original plans called for the building to be constructed out of red brick,[7] but the final execution was mostly in sandstone quarried in Connecticut, with some examples of stone from Newark.[8] Geology Hall, built on the south side of Old Queens, was the second of three projects that Hardenberg designed for the college, following an addition to a building (now Alexander Johnston Hall) that housed the college's grammar school (now Rutgers Preparatory School) the year before. The third project, Kirkpatrick Chapel (1873), was designed to complement the simple Gothic Revival style of Geology Hall and was erected on the north side of Old Queens.[5]",
			"color": "dark|0.13567 gray|0.13567 dark|0.13567 grey|0.13567 light|0.10901 slate|0.10901 gray|0.10901 gray|0.083483 grey|0.083483 slate|0.08186 gray|0.08186 silver|0.069732 light|0.047983 gray|0.047983 light|0.047983 grey|0.047983 dark|0.042707 slate|0.042707 gray|0.042707 dim|0.041057 gray|0.041057 dim|0.041057 grey|0.041057 beige|0.034483 steel|0.032098 blue|0.032098 gainsboro|0.02947 antique|0.020054 white|0.020054 old|0.019742 lace|0.019742 ivory|0.018716 corn|0.018392 silk|0.018392 floral|0.017331 white|0.017331 black|0.01643 linen|0.016114 papaya|0.01493 whip|0.01493 honeydew|0.014471 light|0.014096 yellow|0.014096 sea|0.01323 shell|0.01323 mint|0.0122 cream|0.0122 light|0.011456 golden|0.011456 rod|0.011456 yellow|0.011456 white|0.010675 smoke|0.010675 blanched|0.0090397 almond|0.0090397 light|0.0089948 steel|0.0089948 blue|0.0089948 white|0.0088439 snow|0.0088309  "
		}
	}
}
