{
	"add": {
		"doc": {
			"id": "4e4a7f02ed7533282c39a0feafd8d2e164747a0270e38c3eccc619f2c11159cf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Barbara_Stanwyck_and_Gary_Cooper_in_Ball_of_Fire_trailer_2.jpg/260px-Barbara_Stanwyck_and_Gary_Cooper_in_Ball_of_Fire_trailer_2.jpg",
				"previous": "That same year, Cooper made two films with director and good friend Howard Hawks.[177] In the biographical film Sergeant York, Cooper portrays war hero Alvin C. York,[178] one of the most decorated American soldiers in World War I.[179] The film chronicles York's early backwoods days in Tennessee, his religious conversion and subsequent piety, his stand as a conscientious objector, and finally his heroic actions at the Battle of the Argonne Forest, which earned him the Medal of Honor.[178][180] Initially, Cooper was nervous and uncertain about playing a living hero, so he traveled to Tennessee to visit York at his home, and the two quiet men established an immediate rapport and discovered they had much in common.[181] Inspired by York's encouragement, Cooper delivered a performance that Howard Barnes of the New York Herald Tribune called \"one of extraordinary conviction and versatility\", and that Archer Winston of the New York Post called \"one of his best\".[182] After the film's release, Cooper was awarded the Distinguished Citizenship Medal by the Veterans of Foreign Wars for his \"powerful contribution to the promotion of patriotism and loyalty\".[183] York admired Cooper's performance and helped promote the film for Warner Bros.[184] Sergeant York became the top-grossing film of the year and was nominated for eleven Academy Awards.[183][185] Accepting his first Academy Award for Best Actor from his friend James Stewart, Cooper said, \"It was Sergeant Alvin York who won this award. Shucks, I've been in the business sixteen years and sometimes dreamed I might get one of these. That's all I can say ... Funny when I was dreaming I always made a better speech.\"[185]",
				"after": "Cooper concluded the year back at Goldwyn with Howard Hawks to make the romantic comedy Ball of Fire with Barbara Stanwyck.[186] In the film, Cooper plays a shy linguistics professor who leads a team of seven scholars who are writing an encyclopedia. While researching slang, he meets Stanwyck's flirtatious burlesque stripper Sugerpuss O'Shea who blows the dust off their staid life of books.[187] The screenplay by Charles Brackett and Billy Wilder provided Cooper the opportunity to exercise the full range of his light comedy skills.[187] In his review for the New York Herald Tribune, Howard Barnes wrote that Cooper handled the role with \"great skill and comic emphasis\" and that his performance was \"utterly delightful\".[188] Though small in scale, Ball of Fire was one of the top-grossing films of the year[189]—Cooper's fourth consecutive picture to make the top twenty.[189]",
			"color": "dark|0.23108 gray|0.23108 dark|0.23108 grey|0.23108 silver|0.22426 light|0.15922 gray|0.15922 light|0.15922 grey|0.15922 gray|0.11358 grey|0.11358 gainsboro|0.10351 dim|0.064415 gray|0.064415 dim|0.064415 grey|0.064415 white|0.01689 smoke|0.01689 lavender|0.016657 blush|0.016657 ghost|0.011748 white|0.011748 alice|0.010452 blue|0.010452 snow|0.0091935 lavender|0.0088039 sea|0.00815 shell|0.00815 linen|0.007354 white|0.0056873 floral|0.0030845 white|0.0030845  "
		}
	}
}
