{
	"add": {
		"doc": {
			"id": "4e4a844390189491bac0edc52a2fb96b46175d07e0cd71605f71aa6c650cb8ba",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Christ_Church_Lutheran_1.jpg/170px-Christ_Church_Lutheran_1.jpg",
				"previous": "The Dakota people, the original inhabitants of the area where Minneapolis now stands, believed in the Great Spirit and were surprised that not all European settlers were religious.[114] Over fifty denominations and religions and some well known churches have since been established in Minneapolis. Those who arrived from New England were for the most part Christian Protestants, Quakers, and Universalists.[114] The oldest continuously used church in the city, Our Lady of Lourdes Catholic Church in the Nicollet Island/East Bank neighborhood, was built in 1856 by Universalists and soon afterward was acquired by a French Catholic congregation.[115] The first Jewish congregation in Minneapolis was formed in 1878 as Shaarai Tov (though it has been known since 1920 as Temple Israel); in 1928, it built the synagogue in East Isles.[54] St. Mary's Orthodox Cathedral was founded in 1887, opened a missionary school in 1897 and in 1905 created the first Russian Orthodox seminary in the U.S.[116] Edwin Hawley Hewitt designed both St. Mark's Episcopal Cathedral and Hennepin Avenue United Methodist Church on Hennepin Avenue just south of downtown.[117] The first basilica in the United States, and Co-Cathedral of the Roman Catholic Archdiocese of Saint Paul and Minneapolis, the Basilica of Saint Mary near Loring Park was named by Pope Pius XI in 1926.[114]",
				"after": "The Billy Graham Evangelistic Association, Decision magazine, and World Wide Pictures film and television distribution were headquartered in Minneapolis for about fifty of the years between the late 1940s into the 2000s.[118] Jim Bakker and Tammy Faye met while attending the Pentecostal North Central University and began a television ministry that by the 1980s reached 13.5 million households.[119] Today, Mount Olivet Lutheran Church in southwest Minneapolis with about 6,000 attendees is the world's largest Lutheran congregation.[120] Christ Church Lutheran in the Longfellow neighborhood is among the finest work by architect Eliel Saarinen. The congregation later added an education building designed by his son Eero Saarinen.[121]",
			"color": "black|0.34867 dim|0.26175 gray|0.26175 dim|0.26175 grey|0.26175 dark|0.11449 slate|0.11449 gray|0.11449 slate|0.099446 gray|0.099446 light|0.076344 slate|0.076344 gray|0.076344 steel|0.048618 blue|0.048618 saddle|0.034329 brown|0.034329  "
		}
	}
}
