{
	"add": {
		"doc": {
			"id": "4e4c1f6b64c994dbb9bf232e4361a0d9438048b135368714f4bdb928589ecac0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Sawtooth_Range_ID1.jpg/410px-Sawtooth_Range_ID1.jpg",
			"previous": [],
				"after": "The Forest Reserve Act of 1891 gave the President the authority to establish forest reserves in the U.S. Department of the Interior.[3][6] After passage of the Transfer Act of 1905, forest reserves became part of the U.S. Department of Agriculture in the newly created U.S. Forest Service.[7] Sawtooth National Forest was created as the Sawtooth Forest Reserve in the Department of Agriculture by proclamation of President Theodore Roosevelt on May 29, 1905. The forest's initial area was 1,947,520 acres (788,130 ha), and it was named after the Sawtooth Mountains in the northwestern part of the forest.[3][8] On November 6, 1906, President Roosevelt announced the addition of 1,392,640 acres (563,580 ha) to the Sawtooth Forest Reserve, which then also constituted much of the present-day Salmon-Challis and Boise National Forests. These lands were split into separate National Forests by executive order on June 26 and July 1, 1908.[9]:12 The forest's area underwent a number of smaller changes in the early 20th century.[9]:13 The Fairfield Ranger District was established in 1906 and merged with the Shake Creek Ranger District in 1972 to form the present-day Fairfield District.[3] The Cassia Forest Reserve was established on June 12, 1905 and the Raft River Forest Reserve on November 5, 1906.[8] The names of the forest reserves were changed to national forests on March 4, 1907. Formed from the consolidation of Cassia and Raft River National Forests, the Minidoka National Forest was created on July 1, 1908 and then added to Sawtooth National Forest on July 1, 1953.[8]",
			"color": "light|0.546 steel|0.546 blue|0.546 lavender|0.13724 light|0.071961 gray|0.071961 light|0.071961 grey|0.071961 gainsboro|0.059943 tan|0.031708 dark|0.031245 gray|0.031245 dark|0.031245 grey|0.031245 silver|0.015867 gray|0.015204 grey|0.015204 light|0.01344 slate|0.01344 gray|0.01344 slate|0.012103 gray|0.012103 dim|0.0085223 gray|0.0085223 dim|0.0085223 grey|0.0085223 black|0.0075191 alice|0.0071592 blue|0.0071592 ghost|0.0061426 white|0.0061426  "
		}
	}
}
