{
	"add": {
		"doc": {
			"id": "4e58611dbb293332905a8f164549ca92df8212f600f8cd969171f7b837bb56a8",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/2b/Lindow_Man_reconstructed_face.jpg/170px-Lindow_Man_reconstructed_face.jpg",
				"previous": "Lindow Man and Lindow III were found to have elevated levels of copper on their skin. The cause for this was uncertain as there could have been natural causes, although a study by Pyatt et al proposed that the bodies may have been painted with a copper-based pigment.[28] To test this, skin samples were taken from places likely to be painted and tested against samples from areas where painting was unlikely. It was found that the copper content of the skin of the torso was higher than the control areas, suggesting that the theory of Pyatt et al may have been correct. However, the conclusion was ambiguous as the overall content was above that expected of a male, and variations across the body may have been due to environmental factors.[29] Similarly, green deposits were found in the hair, originally thought to be a copper-based pigment used for decoration, but it was later found to be the result of a reaction between the keratin in the hair and the acid of the peat bog.[24]",
				"after": "Dating Lindow Man is problematic as samples from the body and surrounding peat have produced dates spanning a 900-year period. Although the peat encasing Lindow Man has been radiocarbon dated to about 300 BC, Lindow Man himself has a different date.[32] Early tests at different laboratories returned conflicting dates for the body; later tests suggested a date between 2 BC and 119 AD.[33][34] There has been a tendency to ascribe the body to the Iron Age period rather than Roman due to the interpretation that Lindow Man's death may have been a ritual sacrifice or execution.[34] Explanations for why the peat in which he was found is much older have been sought. Archaeologist P. C. Buckland suggests that as the stratigraphy of the peat appears undisturbed, Lindow Man may have been deposited into a pool that was already some 300 years old.[35] Geographer K. E. Barber has argued against this hypothesis, saying that pools at Lindow Moss would have been too shallow, and suggests that the peat may have been peeled back to allow the burial and then replaced, leaving the stratigraphy apparently undisturbed.[36]",
			"color": "burly|0.4228 wood|0.4228 black|0.20296 tan|0.11406 saddle|0.071667 brown|0.071667 dim|0.064155 gray|0.064155 dim|0.064155 grey|0.064155 gray|0.042611 grey|0.042611  "
		}
	}
}
