{
	"add": {
		"doc": {
			"id": "4e5fbe1a0f2692d2cd0c0a8e82b6f5fdc0a7d9068cda42537f897cdd1d3b8301",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Clock_of_al_Jazari_before_1206.jpg/220px-Clock_of_al_Jazari_before_1206.jpg",
				"previous": "The Greek and Roman civilizations are credited for initially advancing water clock design to include complex gearing, which was connected to fanciful automata and also resulted in improved accuracy. These advances were passed on through Byzantium and Islamic times, eventually making their way back to Europe. Independently, the Chinese developed their own advanced water clocks（水鐘）in 725 A.D., passing their ideas on to Korea and Japan.",
				"after": "Some water clock designs were developed independently and some knowledge was transferred through the spread of trade. Pre-modern societies do not have the same precise timekeeping requirements that exist in modern industrial societies, where every hour of work or rest is monitored, and work may start or finish at any time regardless of external conditions. Instead, water clocks in ancient societies were used mainly for astrological reasons. These early water clocks were calibrated with a sundial. While never reaching the level of accuracy of a modern timepiece, the water clock was the most accurate and commonly used timekeeping device for millennia, until it was replaced by the more accurate pendulum clock in 17th-century Europe.",
			"color": "black|0.091138 peach|0.075786 puff|0.075786 dark|0.074579 salmon|0.074579 peru|0.070649 burly|0.05679 wood|0.05679 sandy|0.056489 brown|0.056489 bisque|0.035921 wheat|0.035159 saddle|0.032639 brown|0.032639 sienna|0.031799 navajo|0.03146 white|0.03146 tan|0.031218 light|0.030599 salmon|0.030599 firebrick|0.029194 moccasin|0.02334 golden|0.02217 rod|0.02217 blanched|0.017787 almond|0.017787 dark|0.015045 red|0.015045 chocolate|0.01434 gray|0.01431 grey|0.01431 maroon|0.013295 khaki|0.01212 brown|0.011915 rosy|0.01104 brown|0.01104 pale|0.010771 golden|0.010771 rod|0.010771 antique|0.010439 white|0.010439 papaya|0.010082 whip|0.010082 crimson|0.0099898 dark|0.0085498 golden|0.0085498 rod|0.0085498  "
		}
	}
}
