{
	"add": {
		"doc": {
			"id": "4e68701e6b7c27065c76e13ff46da002c610c5eff1c2d574aa99a0cde3d2bdc0",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/b/b0/Mechanical_filter_torsional_equivalent_circuit.svg/300px-Mechanical_filter_torsional_equivalent_circuit.svg.png",
			"previous": [],
				"after": "There are a great many combinations of resonators and transducers that can be used to construct a mechanical filter. A selection of some of these is shown in the diagrams. Figure 6 shows a filter using disc flexural resonators and magnetostrictive transducers. The transducer drives the centre of the first resonator, causing it to vibrate. The edges of the disc move in antiphase to the centre when the driving signal is at, or close to, resonance, and the signal is transmitted through the connecting rods to the next resonator. When the driving signal is not close to resonance, there is little movement at the edges, and the filter rejects (does not pass) the signal.[40] Figure 7 shows a similar idea involving longitudinal resonators connected together in a chain by connecting rods. In this diagram, the filter is driven by piezoelectric transducers. It could equally well have used magnetostrictive transducers.[30] Figure 8 shows a filter using torsional resonators. In this diagram, the input has a torsional piezoelectric transducer and the output has a magnetostrictive transducer. This would be quite unusual in a real design, as both input and output usually have the same type of transducer. The magnetostrictive transducer is only shown here to demonstrate how longitudinal vibrations may be converted to torsional vibrations and vice versa.[30][38][41] Figure 9 shows a filter using drumhead mode resonators. The edges of the discs are fixed to the casing of the filter (not shown in the diagram) so the vibration of the disc is in the same modes as the membrane of a drum. Collins calls this type of filter a disc wire filter.[38]",
			"color": "dark|0.099358 gray|0.099358 dark|0.099358 grey|0.099358 gainsboro|0.084415 gray|0.073945 grey|0.073945 white|0.068642 smoke|0.068642 lavender|0.067061 blush|0.067061 ghost|0.066001 white|0.066001 alice|0.0656 blue|0.0656 silver|0.065107 snow|0.064117 sea|0.062082 shell|0.062082 white|0.060842 azure|0.058616 light|0.051997 gray|0.051997 light|0.051997 grey|0.051997 linen|0.043731 dim|0.022511 gray|0.022511 dim|0.022511 grey|0.022511 mint|0.022491 cream|0.022491 floral|0.013049 white|0.013049 lavender|0.0073466 black|0.0030841  "
		}
	}
}
