{
	"add": {
		"doc": {
			"id": "4e6fa4d8b5f2bd7034219296a63a7c1f02174e712b5925a4f8200c05043dedbf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Great_Lake_at_Karnak_Temple.jpg/220px-Great_Lake_at_Karnak_Temple.jpg",
				"previous": "Outside the temple building proper was the temple enclosure, surrounded by a rectangular brick wall that symbolically protected the sacred space from outside disorder.[109] On occasion this function was more than symbolic, especially during the last native dynasties in the fourth century BC, when the walls were fully fortified in case of Persian invasion.[110] In late temples these walls frequently had alternating concave and convex courses of bricks, so that the top of the wall undulated vertically. This pattern may have been meant to evoke the mythological waters of chaos.[111]",
				"after": "The walls enclosed many buildings related to the temple's function. Some enclosures contain satellite chapels dedicated to deities associated with the temple god, including mammisis celebrating the birth of the god's mythological child. The sacred lakes found in many temple enclosures served as reservoirs for the water used in rituals, as places for the priests to ritually cleanse themselves, and as representations of the water from which the world emerged.[96] Mortuary temples sometimes contain a palace for the spirit of the king to whom the temple was dedicated, built against the temple building proper.[112] The temple of Seti I at Abydos incorporates an unusual underground structure, the Osireion, which may have served as a symbolic tomb for the king.[113] Sanatoria in some temples provided a place for the sick to await healing dreams sent by the god. Other temple buildings included kitchens, workshops, and storehouses to supply the temple's needs.[114] Especially important was the pr-ˁnḫ or \"house of life\", where the temple edited, copied, and stored its religious texts, including those used for temple rituals. The house of life also functioned as a general center of learning, containing works on non-religious subjects such as history, geography, astronomy, and medicine.[115] Although these outlying buildings were devoted to more mundane purposes than the temple itself, they still had religious significance; even granaries might be used for specific ceremonies.[114]",
			"color": "dark|0.24209 slate|0.24209 gray|0.24209 slate|0.23429 gray|0.23429 light|0.22949 slate|0.22949 gray|0.22949 dark|0.12636 gray|0.12636 dark|0.12636 grey|0.12636 gray|0.089858 grey|0.089858 dim|0.061287 gray|0.061287 dim|0.061287 grey|0.061287 silver|0.008807 tan|0.0058339  "
		}
	}
}
