{
	"add": {
		"doc": {
			"id": "4e710e580bc91d01f0f6fe5fcc8780a15e255deae0354cbdf1fddca9fcb87630",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Oriel_College_Senior_Library.jpg/220px-Oriel_College_Senior_Library.jpg",
				"previous": "Originally a garden, the demand for more accommodation for undergraduates in the early 18th century resulted in two free-standing blocks being built. The first block erected was the Robinson Building on the east side, built in 1720 by Bishop Robinson at the suggestion of his wife, as the inscription over the door records. Its twin block, the Carter Building, was erected on the west side in 1729, as a result of a benefaction by Provost Carter. The two buildings stood for nearly a hundred years as detached blocks in the garden, and the architectural elements of the First quad are repeated on them — only here the seven gables are all alike. Between 1817 and 1819,[12] they were joined up to the Front quad with their present, rather incongruous connecting links. In the link to the Robinson Building, two purpose-built rooms have been incorporated - the Champneys Room, designed by Weldon Champneys, the nephew of Basil Champneys, and the Benefactors Room, a panelled room honouring benefactors of the college. A Gothic oriel window, belonging to the Provost's Lodgings, was added to the Carter Building in 1826.[12]",
				"after": "The north range houses the library and senior common rooms; designed in the Neoclassical style by James Wyatt, it was built between 1788 and 1796 to accommodate the books bequested by Edward, Baron Leigh, formerly High Steward of the University and an Orielensis, whose gift had doubled the size of the library.[23] The two-storey building has rusticated arches on the ground floor and a row of Ionic columns above, dividing the façade into seven bays — the ground floor contains the first purpose built senior common rooms in Oxford, above is the library.[3]",
			"color": "black|0.46911 dark|0.028383 slate|0.028383 gray|0.028383 snow|0.025516 white|0.025502 smoke|0.025502 sea|0.025034 shell|0.025034 floral|0.02431 white|0.02431 white|0.023967 lavender|0.023261 blush|0.023261 mint|0.021654 cream|0.021654 ghost|0.021378 white|0.021378 misty|0.019132 rose|0.019132 alice|0.017343 blue|0.017343 azure|0.016194 ivory|0.014235 linen|0.013561 rosy|0.013128 brown|0.013128 dim|0.012251 gray|0.012251 dim|0.012251 grey|0.012251 dark|0.011622 gray|0.011622 dark|0.011622 grey|0.011622 silver|0.010605 thistle|0.0097823 light|0.0097006 gray|0.0097006 light|0.0097006 grey|0.0097006 old|0.0095583 lace|0.0095583 pale|0.0087887 golden|0.0087887 rod|0.0087887 lavender|0.00866 gainsboro|0.0081446  "
		}
	}
}
