{
	"add": {
		"doc": {
			"id": "4e8d1a12c8ff361837fb500ecbc9fdf72e3cbb7577e943fd2922230ecf889650",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Uelen_residents_1913.JPG/220px-Uelen_residents_1913.JPG",
				"previous": "Bartlett's initial plan had been for the group to rest briefly on Wrangel Island and then to move on together to the Siberian coast. However, because three men—Mamen, Malloch and Maurer—were injured, and others were weak and frostbitten, Bartlett decided that the main party should remain on the island while he went for help taking only Kataktovik.[76] The pair started off on 18 March, with seven dogs and provisions for 48 days (30 days for the dogs),[77] and took an extended route round the island's southern shores to look for signs of Anderson's or Mackay's parties.[78] After finding nothing, they headed across the ice towards Siberia, but progress was slow over a surface that was frequently shifting and breaking up to form leads of open water. More time was lost digging out their provisions from the steadily drifting snow. As they drew nearer to the mainland, Kataktovik became nervous; he had heard that the Alaskan Inuit were disliked in Siberia by the native Chukchi people, and feared for his life. Bartlett did his best to reassure him as they moved slowly forward.[79]",
				"after": "On 4 April the pair reached land near Cape Jakan, west of Cape North on the northern Siberian coast. The presence of sledge marks in the snow showed they had landed in an inhabited area.[80] They followed these tracks for a day, before arriving at a small Chukchi village. Here, contrary to Kataktovik's fears, they were received hospitably, and given shelter and food.[81] On 7 April they set out for East Cape and the villages on the Bering coast. Bartlett had not previously experienced such relentlessly cold weather, with blizzards, hurricane force winds, and temperatures often below −50 °C (−58 °F). On the way they passed through other Chukchi villages, where Bartlett traded goods for necessary supplies—he exchanged his Colt revolver for a young, strong dog.[82] Bartlett was touched by the kindness and generosity shown by many of those they encountered on the way, \"typical of the true humanity of these kindly people\".[81] On 24 April they arrived at Emma Town, a settlement a few miles west of East Cape. Bartlett calculated that in the 37 days since leaving Wrangel Island, he and Kataktovik had travelled about 700 miles (1,100 km), all but the last stage on foot.[83]",
			"color": "dark|0.27344 gray|0.27344 dark|0.27344 grey|0.27344 gray|0.24502 grey|0.24502 dim|0.21205 gray|0.21205 dim|0.21205 grey|0.21205 black|0.11858 silver|0.081767 light|0.021449 gray|0.021449 light|0.021449 grey|0.021449 gainsboro|0.013637 beige|0.011125 antique|0.0091224 white|0.0091224  "
		}
	}
}
