{
	"add": {
		"doc": {
			"id": "4eb4fe37e55e3c4ff73fa941fa0d1b0375d1f31d569aa08e04c08f80195eb532",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/MalsplendS532-1.jpg/220px-MalsplendS532-1.jpg",
				"previous": "Several courtship displays by splendid fairywren males have been recorded; the 'sea horse flight,' so named for the similarity of movements to those by a seahorse, is an exaggerated undulating flight where the male, with his neck extended and his head feathers erect, flies and tilts his body from horizontal to vertical and by rapidly beating wings is able to descend slowly and spring upwards after alighting on the ground.[42] The 'face fan' display may be seen as a part of aggressive or sexual display behaviours; it involves the flaring of the blue ear tufts by erecting the feathers.[43]",
				"after": "Another interesting habit of males of this and other fairywren species during the reproductive season is to pluck petals (in this species, predominantly pink and purple ones which contrast with their plumage) and show them to female fairywrens.[3] Petals often form part of a courtship display and are presented to a female in the male fairywren's own or another territory. Outside the breeding season males may sometimes still show petals to females in other territories, presumably to promote themselves.[44] It is notable that fairywrens are socially monogamous and sexually promiscuous: pairs will bond for life,[45] but regularly mate with other individuals; a proportion of young will have been fathered by males from outside the group. Young are often raised not by the pair alone, but with other males who also mated with the pair's female assisting. Thus, petal-carrying might be a behaviour that strengthens the pair-bond. Petal carrying might also be a way for extra males to gain matings with the female. In either case, the data does not strongly link petal-carrying and presenting to a copulation soon thereafter.",
			"color": "dark|0.58832 slate|0.58832 gray|0.58832 black|0.16525 dim|0.15233 gray|0.15233 dim|0.15233 grey|0.15233 gray|0.028965 grey|0.028965 slate|0.0164 gray|0.0164  "
		}
	}
}
