{
	"add": {
		"doc": {
			"id": "4ebe62e582e945f60016c9a15d1d8b99bffeab156a1a490ec0ee8ad6434e297b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Typhoon_Chataan_11_july_2002_0120Z.jpg/220px-Typhoon_Chataan_11_july_2002_0120Z.jpg",
				"previous": "Only July 1, the system's circulation became broad, with most of the convection located west of the center.[3] The next day, Chataan briefly weakened to an intensity of 85 km/h (50 mph), although it began strengthening steadily on July 3,[6] when its center passed very near Weno in Chuck State in the FSM. At 1800 UTC that night, the JTWC upgraded Chataan to a typhoon,[3] and about 24 hours later the JMA followed suit while the storm was approaching Guam from the southeast.[6] At about 2130 UTC on July 4, the eye of Chataan moved across northern Guam in about two hours, although the center of the eye passed north of the island.[3]",
				"after": "After affecting Guam, Chataan continued toward the northwest and gradually intensified. At 0000 UTC on July 8, the typhoon reached its peak intensity of 175 km/h (110 mph 10-minute sustained) while located near the Japanese island of Okinotorishima.[6] The JTWC assessed that Chataan had reached its peak intensity of 240 km/h (150 mph 1-minute sustained) about six hours earlier; on that basis, the agency classified the system as a super typhoon. On July 8, Chataan turned toward the north around the subtropical ridge while maintaining its peak winds for about 18 hours.[5] On July 9 the typhoon turned to the northeast, and late that day it weakened to a severe tropical storm. At around 1530 UTC on July 10, Chataan made landfall on the Bōsō Peninsula in Honshu with winds of about 100 km/h (65 mph 10-minute sustained). The storm briefly moved offshore before making a second landfall on eastern Hokkaido at 1200 UTC on July 11;[6] this marked the first occasion of a July landfall on the island in 28 years.[7] A few hours later, Chataan became an extratropical cyclone in the Sea of Okhotsk, where the remnants stalled before dissipating on July 13 near Sakhalin.[6]",
			"color": "dark|0.18493 gray|0.18493 dark|0.18493 grey|0.18493 dim|0.14171 gray|0.14171 dim|0.14171 grey|0.14171 silver|0.12008 gray|0.11664 grey|0.11664 light|0.0945 gray|0.0945 light|0.0945 grey|0.0945 gainsboro|0.079018 slate|0.03346 gray|0.03346 white|0.032311 smoke|0.032311 light|0.022059 slate|0.022059 gray|0.022059 lavender|0.021947 blush|0.021947 ghost|0.02166 white|0.02166 alice|0.021391 blue|0.021391 snow|0.019406 sea|0.019139 shell|0.019139 linen|0.017312 white|0.015571 floral|0.01094 white|0.01094 mint|0.0092329 cream|0.0092329 black|0.0085512 azure|0.0056529 lavender|0.0034206  "
		}
	}
}
