{
	"add": {
		"doc": {
			"id": "4ebf80927fbb34e433345ad75466020757542712a3592ffef8836df550a4e404",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/4/45/Everglades_Pinelands.jpg/220px-Everglades_Pinelands.jpg",
				"previous": "The commission was also tasked with proposing a method to raise the money to purchase the land.[72] The search coincided with the arrival of the Great Depression in the United States, and money for land purchase was scarce.[73] The U.S. House of Representatives authorized the creation of the new national park on May 30, 1934, but it passed only with a rider that ensured no money would be allotted to the project for at least five years.[72] Coe's passion and U.S. Senator Spessard Holland's politicking helped to fully establish the park, after Holland was able to negotiate 1,300,000 acres (5,300 km2) of the park, leaving out Big Cypress, Key Largo, the Turner River area, and a 22,000-acre (89 km2) tract of land called \"The Hole in the Donut\" that was too highly valued for agriculture. Miami Herald editor John Pennekamp was instrumental in pushing the Florida Legislature to raise $2 million to purchase the private land inside the park boundaries.[74] It was dedicated by President Harry Truman on December 6, 1947, one month after Douglas' book was released.[75] In the same year, several tropical storms struck South Florida, prompting the construction of 1,400 miles (2,300 km) of canals, sending water unwanted by farmers and residents to the ocean.[73]",
				"after": "The Central and Southern Florida Flood Control Project (C&SF) was authorized by Congress to construct more than a thousand miles of canals and flood control structures across South Florida. The C&SF, run by the U.S. Army Corps of Engineers, established an agricultural area directly south of Lake Okeechobee, and three water conservation areas, all bordered by canals that diverted excess water either to urban areas or into the Atlantic Ocean, Gulf of Mexico or Florida Bay. South of these manmade regions was Everglades National Park, which had been effectively cut off from its water supply. By the 1960s, the park was visibly suffering. Although the C&SF was directed to provide enough water to sustain the park, it did not follow through.[76] A proposed airport that would have dire environment effects on Everglades National Park became the center of a battle that helped to initiate the environmental movement into local and national politics. The airport proposal was eventually abandoned and in 1972 a bill was introduced to curb development in South Florida and ensure the national park would receive the amount of water it needed. Efforts turned to repairing the damage wrought by decades of mismanagement: the Army Corps of Engineers changed its focus in 1990 from constructing dams and canals to constructing \"purely environmental projects\".[77]",
			"color": "dim|0.34153 gray|0.34153 dim|0.34153 grey|0.34153 gray|0.21787 grey|0.21787 dark|0.14998 gray|0.14998 dark|0.14998 grey|0.14998 silver|0.088304 light|0.058427 gray|0.058427 light|0.058427 grey|0.058427 gainsboro|0.039468 light|0.022122 steel|0.022122 blue|0.022122 slate|0.015132 gray|0.015132 light|0.015093 slate|0.015093 gray|0.015093 dark|0.013107 slate|0.013107 gray|0.013107 dark|0.0097868 olive|0.0097868 green|0.0097868 lavender|0.0075185  "
		}
	}
}
