{
	"add": {
		"doc": {
			"id": "4eca83b6b6632d3dbef4dbe1ee46781e91a29d6cce898f449f88370afbf71c8e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Edmontosaurus_BW.jpg/220px-Edmontosaurus_BW.jpg",
				"previous": "The number of vertebrae differs between specimens. E. regalis had thirteen neck vertebrae, eighteen back vertebrae, nine hip vertebrae, and an unknown number of tail vertebrae.[14] A specimen once identified as belonging to Anatosaurus edmontoni (now considered to be the same as E. regalis) is reported as having an additional back vertebra and 85 tail vertebrae, with an undisclosed amount of restoration.[14] Other hadrosaurids are only reported as having 50 to 70 tail vertebrae,[8] so this appears to have been an overestimate. The anterior back was curved toward the ground, with the neck flexed upward and the rest of the back and tail held horizontally.[8] Most of the back and tail were lined by ossified tendons arranged in a latticework along the neural spines of the vertebrae. This condition has been described as making the back and at least part of the tail \"ramrod\" straight.[20][21] The ossified tendons are interpreted as having strengthened the vertebral column against gravitational stress, incurred through being a large animal with a horizontal vertebral column otherwise supported mostly by the hind legs and hips.[20]",
				"after": "The shoulder blades were long flat blade-like bones, held roughly parallel to the vertebral column. The hips were composed of three elements each: an elongate ilium above the articulation with the leg, an ischium below and behind with a long thin rod, and a pubis in front that flared into a plate-like structure. The structure of the hip hindered the animal from standing with its back erect, because in such a position the thigh bone would have pushed against the joint of the ilium and pubis, instead of pushing only against the solid ilium. The nine fused hip vertebrae provided support for the hip.[5]",
			"color": "sea|0.081865 shell|0.081865 white|0.08113 smoke|0.08113 floral|0.080701 white|0.080701 snow|0.078719 mint|0.078357 cream|0.078357 white|0.077722 azure|0.070215 ghost|0.068194 white|0.068194 alice|0.063386 blue|0.063386 lavender|0.044588 blush|0.044588 ivory|0.034229 dark|0.031771 gray|0.031771 dark|0.031771 grey|0.031771 linen|0.025571 silver|0.024813 light|0.022575 gray|0.022575 light|0.022575 grey|0.022575 gainsboro|0.018452 gray|0.017472 grey|0.017472 old|0.016901 lace|0.016901 black|0.014306 dim|0.010607 gray|0.010607 dim|0.010607 grey|0.010607 honeydew|0.009168 antique|0.0089384 white|0.0089384  "
		}
	}
}
