{
	"add": {
		"doc": {
			"id": "4ed473d34f06c5f3f805b9bc87014e1c8c71b5a41ef334e7f64aeae2b120f6cc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Baltimore_Soldiers_Sailors.jpg/170px-Baltimore_Soldiers_Sailors.jpg",
				"previous": "Weinman's obverse bears a resemblance to Oscar Roty's \"Sower\" design for French coins; according to numismatic historian Roger Burdette, \"Weinman has taken the ideal of a nineteenth century provincial figure and turned it into an American icon.\"[a] [24] Burdette ties both the appearance of the head of Liberty and of the branches which she carries to Baltimore's Union Soldiers and Sailors' Monument, designed by Weinman.[25] The sculptor may also have drawn inspiration from a 1913 bust he did of his tenant, Elsie Stevens, wife of lawyer and poet Wallace Stevens. Elsie Stevens is generally believed to have been a model for Weinman's Mercury dime; her daughter Holly wrote in 1966 that her mother had been the model for both coins.[26] The reverse is similar to Weinman's medal for the American Institute of Architects, although the sculptor replaced the laurel on the medal with a pine sapling. Weinman's work on the medal had been widely admired for the power of the depicted eagle.[25]",
				"after": "Breen, in his comprehensive volume on US coins, said of the half dollar, \"Ms. Liberty wears the American flag, anticipating a rebellious counterculture by half a century.\"[27] Though admiring the piece generally, he noted that Liberty is striding towards the east, that is towards war-torn Europe, and wrote, \"she points into the sky at nothing visible (perhaps aiming a warning at German warplanes?)\"[27] Breen objects to the use of the mountain pine on the reverse, calling it not particularly American nor especially notable except for an ability to thrive near the tree line.[27]",
			"color": "black|0.67797 dim|0.1478 gray|0.1478 dim|0.1478 grey|0.1478 gray|0.082887 grey|0.082887 dark|0.041487 gray|0.041487 dark|0.041487 grey|0.041487 silver|0.014426 light|0.0064985 gray|0.0064985 light|0.0064985 grey|0.0064985 dark|0.0064433 slate|0.0064433 gray|0.0064433 gainsboro|0.0041987  "
		}
	}
}
