{
	"add": {
		"doc": {
			"id": "4ed58c16ee1cbdddc9c18d8ad55d57b5d04d6e33c6e52ec31b0df39b3129fc97",
			"url": "https://upload.wikimedia.org/wikipedia/commons/6/6b/LockeEducation1693.jpg",
				"previous": "Some theories propose that all individuals benefit from a variety of learning modalities, while others suggest that individuals may have preferred learning styles, learning more easily through visual or kinesthetic experiences.[52] A consequence of the latter theory is that effective teaching should present a variety of teaching methods which cover all three learning modalities so that different students have equal opportunities to learn in a way that is effective for them.[53] Guy Claxton has questioned the extent that learning styles such as Visual, Auditory and Kinesthetic(VAK) are helpful, particularly as they can have a tendency to label children and therefore restrict learning.[54][55] Recent research has argued \"there is no adequate evidence base to justify incorporating learning styles assessments into general educational practice.\"[56]",
				"after": "As an academic field, philosophy of education is \"the philosophical study of education and its problems (...) its central subject matter is education, and its methods are those of philosophy\".[57] \"The philosophy of education may be either the philosophy of the process of education or the philosophy of the discipline of education. That is, it may be part of the discipline in the sense of being concerned with the aims, forms, methods, or results of the process of educating or being educated; or it may be metadisciplinary in the sense of being concerned with the concepts, aims, and methods of the discipline.\"[58] As such, it is both part of the field of education and a field of applied philosophy, drawing from fields of metaphysics, epistemology, axiology and the philosophical approaches (speculative, prescriptive, and/or analytic) to address questions in and about pedagogy, education policy, and curriculum, as well as the process of learning, to name a few.[59] For example, it might study what constitutes upbringing and education, the values and norms revealed through upbringing and educational practices, the limits and legitimization of education as an academic discipline, and the relation between education theory and practice.",
			"color": " "
		}
	}
}
