{
	"add": {
		"doc": {
			"id": "4ee52dff5f8160d63506afc0ba1944ccbcafc54b3ed8c00f96eaad4c05e3e49c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Chattahoochee_River_National_Recreation.jpg/220px-Chattahoochee_River_National_Recreation.jpg",
			"previous": [],
				"after": "Atlanta's 343 parks, nature preserves, and gardens cover 3,622 acres (14.66 km2),[170] which amounts to only 5.6% of the city's total acreage, compared to the national average of just over 10%.[171][172] However, 64% of Atlantans live within a 10-minute walk of a park, a percentage equal to the national average.[173] Furthermore, in its 2013 ParkScore ranking, the The Trust for Public Land, a national land conservation organization, reported that among the park systems of the 50 most populous U.S. cities, Atlanta's park system received a ranking of 31.[174] Piedmont Park, located in Midtown is Atlanta's most iconic green space. The park, which has undergone a major renovation and expansion in recent years, attracts visitors from across the region and hosts cultural events throughout the year. Other notable city parks include Centennial Olympic Park, a legacy of the 1996 Summer Olympics that forms the centerpiece of the city's tourist district; Woodruff Park, which anchors the campus of Georgia State University; Grant Park, home to both Zoo Atlanta and the Atlanta Cyclorama & Civil War Museum; and Chastain Park, which houses an amphitheater used for live music concerts. The Chattahoochee River National Recreation Area, located in the northwestern corner of the city, preserves a 48 mi (77 km) stretch of the river for public recreation opportunities. The Atlanta Botanical Garden, adjacent to Piedmont Park, contains formal gardens, including a Japanese garden and a rose garden, woodland areas, and a conservatory that includes indoor exhibits of plants from tropical rainforests and deserts. The BeltLine, a former rail corridor that forms a 22 mi (35 km) loop around Atlanta's core, will eventually be transformed into a series of parks, connected by a multi-use trail, increasing Atlanta's park space by 40%.[175]",
			"color": "dark|0.55529 olive|0.55529 green|0.55529 black|0.22198 dark|0.10523 slate|0.10523 gray|0.10523 olive|0.039189 drab|0.039189 dim|0.020629 gray|0.020629 dim|0.020629 grey|0.020629 gray|0.018323 grey|0.018323  "
		}
	}
}
