{
	"add": {
		"doc": {
			"id": "4eed63f09507866381880cc60dbb1276489bce0e27d0971ba634fa5809b60012",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Paddlefish_c-section.webm/260px--Paddlefish_c-section.webm.jpg",
			"previous": [],
				"after": "The artificial propagation of American paddlefish began with the efforts of the Missouri Department of Conservation during the early 1960s, and focused primarily on maintenance of the sport fishery.[31] However, it was the growing importance of American paddlefish for their meat and roe that became the catalyst for further development of culture techniques for aquaculture in the United States.[31] Artificial propagation requires broodstock which, because of the late sexual maturation of American paddlefish, are initially obtained from the wild and brought into a hatchery environment.[32] The fish are injected with LH-RH hormone to stimulate spawning. The number of eggs a female may produce depends on the size of the fish and can range anywhere from 70,000–300,000 eggs. Unlike most teleosts, the oviduct branches of American paddlefish and sturgeons are not directly attached to the ovaries; rather, they open dorsally into the body cavity. In order to determine status of progression toward maturation, ova staging is performed. The process begins with a minor procedure that involves a small abdominal incision from which to extract a few sample oocytes. The oocytes are boiled in water for a few minutes until the yolk is hardened, and then they are cut in half to expose the nucleus. The exposed nucleus is examined under a microscope to determine stage of maturity.[31]",
			"color": "black|0.23947 rosy|0.099556 brown|0.099556 dark|0.076178 gray|0.076178 dark|0.076178 grey|0.076178 gray|0.066523 grey|0.066523 dim|0.054385 gray|0.054385 dim|0.054385 grey|0.054385 light|0.041685 gray|0.041685 light|0.041685 grey|0.041685 silver|0.041536 gainsboro|0.037768 white|0.028446 smoke|0.028446 sea|0.023933 shell|0.023933 slate|0.022849 gray|0.022849 light|0.022375 slate|0.022375 gray|0.022375 snow|0.02088 alice|0.020483 blue|0.020483 ghost|0.020124 white|0.020124 lavender|0.020098 blush|0.020098 white|0.017572 mint|0.017544 cream|0.017544 azure|0.016703 floral|0.016167 white|0.016167 linen|0.014936 light|0.014064 steel|0.014064 blue|0.014064 dark|0.013452 slate|0.013452 blue|0.013452  "
		}
	}
}
