{
	"add": {
		"doc": {
			"id": "4ef49fe0e0b04fd7962efafa69ea2e66f08762ded84f2bac6f71b2a29488d6ae",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Association_against_BB.jpg/220px-Association_against_BB.jpg",
				"previous": "Following the end of World War I and the formation of the Kingdom of Serbs, Croats and Slovenes, pro-Bulgarian sentiment was rife in Macedonia, which was referred to as \"Southern Serbia\" by the Belgrade government. Extensive measures were undertaken to \"serbianise\" Macedonia, including closing Bulgarian Orthodox Church schools, revising history textbooks, dismissing \"unreliable\" teachers, banning the use of the Bulgarian language,[31] and imposing lengthy jail terms for those convicted of anti-state activities. Hundreds of Bulgarian activists were murdered and thousands arrested in the period immediately following the war, and around 50,000 troops were stationed in Macedonia. Bands of Serbian Chetniks, including one led by Babunski, were organised to terrorise the population, kill pro-Bulgarian resistance leaders and recruit the local population into forced labour for the army. Resistance by IMRO was met with further terror, which included the formation in 1922 of the Association against Bulgarian Bandits led by Pećanac and Ilija Trifunović-Lune, based out of Štip in eastern Macedonia. This organisation quickly garnered a reputation for indiscriminate terrorisation of the Macedonian populace. Pećanac and his Chetniks were also active in fighting those resisting the Serb and Montenegrin \"colonisation\" of Kosovo.[32]",
				"after": "The Chetnik movement also functioned as a civilian organization during the interwar period, initially as the \"Chetnik Association for the Freedom and Honor of the Fatherland\" (Udruženje Četnika za slobodu i čast Otadžbine), a Chetnik veteran organisation formed in Belgrade in 1921. The aims of the organisation were to foster Chetnik history, spread Chetnik ideas, and to care for disabled Chetniks and the widows and orphans of fallen Chetniks. Initially the organisation was aligned with the Democratic Party, but the increasing influence of the Serbian Radical Party resulted in a split of the organisation in 1924.[33] The pro-Radical Party, Greater Serbia elements of the organisation formed two new organisations; the \"Association of Serbian Chetniks for King and Fatherland\" (Udruženje srpskih četnika za Kralja i Otadžbinu) led by Puniša Račić, and the \"Association of Serbian Chetniks \"Petar Mrkonjić\"\" (Udruženje srpskih četnika Petar Mrkonjić). Around a year later these two organisations amalgamated as the \"Association of Serbian Chetniks \"Petar Mrkonjić\" for King and Fatherland\" with Račić presiding over a great deal of dissension until 1928 when the organisation ceased to operate. After the imposition of royal dictatorship by King Alexander in 1929, the \"Petar Mrkonjić\" association was dissolved, and the former dissidents re-joined the original \"Chetnik Association for the Freedom and Honor of the Fatherland\".[34]",
			"color": " "
		}
	}
}
