{
	"add": {
		"doc": {
			"id": "4ef5d39427b95102d5da5b7407dc5400e538eb4cca4500362a40eafdea16f09f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Election_campaign_March_2005.jpg/220px-Election_campaign_March_2005.jpg",
				"previous": "General elections were again held in Zimbabwe on 30 March 2008.[77] The official results required a runoff between Mugabe and Morgan Tsvangirai, the opposition leader; the MDC challenged these results, claiming widespread election fraud by the Mugabe government.[78] The run-off was scheduled for 27 June 2008. On 22 June, citing the continuing unfairness of the process and refusing to participate in a \"violent, illegitimate sham of an election process\", Tsvangirai pulled out of the presidential run-off, the ZEC held the run-off and President Mugabe received a landslide majority.[79]",
				"after": "The MDC-T led by Morgan Tsvangirai is now the majority in the Lower chamber of Parliament. The MDC split into two factions. One faction (MDC-M), now led by Arthur Mutambara contested the elections to the Senate, while the other, led by Morgan Tsvangirai, opposed to contesting the elections, stating that participation in a rigged election is tantamount to endorsing Mugabe's claim that past elections were free and fair. The opposition parties have resumed participation in national and local elections as recently as 2006. The two MDC camps had their congresses in 2006 with Morgan Tsvangirai being elected to lead MDC-T, which has become more popular than the other group.[80]",
			"color": "gray|0.24415 grey|0.24415 dim|0.22375 gray|0.22375 dim|0.22375 grey|0.22375 dark|0.13783 gray|0.13783 dark|0.13783 grey|0.13783 black|0.13702 light|0.095913 slate|0.095913 gray|0.095913 slate|0.053559 gray|0.053559 silver|0.027104 firebrick|0.013968 rosy|0.01393 brown|0.01393 brown|0.010994 light|0.0095331 gray|0.0095331 light|0.0095331 grey|0.0095331 light|0.0079348 steel|0.0079348 blue|0.0079348 dark|0.0061388 red|0.0061388 gainsboro|0.0050713 maroon|0.0044257  "
		}
	}
}
