{
	"add": {
		"doc": {
			"id": "4f0eba01b88fbf3514615286b1486830e8250433c21cfcb873ad11e67e74abf2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Central_Park_Statue.JPG/220px-Central_Park_Statue.JPG",
				"previous": "In response to Barber's letter, Preston wrote to Saint-Gaudens, \"there are no presses anywhere, in mints or in use among silversmiths, which can bring up your proposed relief at a single stroke.\"[23] When the models were brought to the Mint, Barber examined and rejected them. It was only after considerable discussion that he agreed to experiment.[24] At that time, the Mint was intensely busy generating designs for new coinage for Cuba and the Philippines, and Barber was reluctant to waste time on what he considered an experimental piece which would never be coined for circulation.[25] Experimental dies were made from the plaster model.[24] Approximately 24 pieces were struck as patterns; even though the Mint used a medal press, set for maximum pressure, it still took up to nine strokes of the press to fully bring out the design.[18] These patterns are today known as the \"Ultra High Relief\" or \"Extra High Relief\" pieces, and only about 20 are known[26]—one sold in a 2005 auction for $2,990,000.[27] On May 8, 1907, the President wrote Saint-Gaudens, \"It has proved hitherto impossible to strike them by one blow, which is necessary under the conditions of making coins of the present day.\"[28] On May 11, 1907, Saint-Gaudens replied, \"I am grieved that the striking of the die did not bring better results. Evidently it is no trifling matter to make Greek art conform with modern numismatics.\"[29]",
				"after": "A second set of dies was produced with the relief reduced somewhat, but still proved too high relief for practical coining, requiring three strokes of the press to fully bring out the design.[30] Saint-Gaudens had produced the models for these dies under the misapprehension that the first pieces had been struck on a production press, rather than on the Mint's only medal press, and therefore only slight adjustment need be made.[31] When Saint-Gaudens died on August 3, 1907, Hering was working on a third model. Uncertain where to find Hering, Roosevelt ordered the new Secretary of the Treasury, George Cortelyou, to have the Mint finalize the design and put the coin in circulation by September 1.[30] Barber was recalled from his vacation in Ocean Grove, New Jersey, to comply with the President's order.[32] Barber wrote Philadelphia Mint Superintendent John Landis on August 14 that what Roosevelt wanted was impossible; he had no dies nor any clear idea of how Saint-Gaudens had planned to reduce the relief. The Mint chief engraver alleged that he could take no action with respect to the double eagle.[30] On September 28, Hering finally appeared at the Mint with a new set of models, which Barber again quickly rejected.[33] Barber wrote to Preston, \"Upon examination it was found that the relief of the models was so great that it would be a waste of time to make reductions for coinage, as it would be quite impossible to coin when the dies are made.\"[34] Instead, Barber began work on his own low relief version of Saint-Gaudens's design.[35]",
			"color": "black|0.70368 tan|0.058966 burly|0.029773 wood|0.029773 dim|0.024993 gray|0.024993 dim|0.024993 grey|0.024993 dark|0.022062 olive|0.022062 green|0.022062 saddle|0.019293 brown|0.019293  "
		}
	}
}
