{
	"add": {
		"doc": {
			"id": "4f118f710174cd2180945e3c92ea59bb93dbb3710dd292a41c031fe6c8001c7a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Shuttle_mate_demate_facility.jpg/220px-Shuttle_mate_demate_facility.jpg",
				"previous": "The aircraft was extensively modified by Boeing in 1976.[2] While first-class seats were kept for NASA passengers, its main cabin and insulation were stripped,[3] mounting struts were added, and the fuselage was strengthened. Vertical stabilizers were added to the tail to aid stability when the Orbiter was being carried. The avionics and engines were also upgraded, and an escape tunnel system similar to that used on Boeing's first 747 test flights was added. The flight crew escape tunnel system was later removed following the completion of the Approach and Landing Tests (ALT) due to concerns over possible engine ingestion of an escaping crew member.",
				"after": "Flying with the additional drag and weight of the Orbiter imposed significant fuel and altitude penalties. The range was reduced to 1,000 nautical miles (1,850 km), compared to an unladen range of 5500 nautical miles (10,100 km), requiring an SCA to stop several times to refuel on a transcontinental flight.[4] Without the Orbiter, the SCA needed to carry ballast to balance out its center of gravity.[3] The SCA had an altitude ceiling of 15,000 feet and a maximum cruise speed of Mach 0.6 with the orbiter attached.[4] A crew of 170 took a week to prepare the shuttle and SCA for flight.[5]",
			"color": "black|0.72971 dim|0.037683 gray|0.037683 dim|0.037683 grey|0.037683 gray|0.025221 grey|0.025221 dark|0.023964 gray|0.023964 dark|0.023964 grey|0.023964 burly|0.022978 wood|0.022978 tan|0.018029 silver|0.016929 light|0.012724 gray|0.012724 light|0.012724 grey|0.012724 navajo|0.010614 white|0.010614 wheat|0.010561 gainsboro|0.0091948 moccasin|0.0088991 bisque|0.0063394 lemon|0.0053524 chiffon|0.0053524 pale|0.0053411 golden|0.0053411 rod|0.0053411 peach|0.0048908 puff|0.0048908 blanched|0.0048041 almond|0.0048041  "
		}
	}
}
