{
	"add": {
		"doc": {
			"id": "4f1796ef87e84109bdff29a0f5f37dc70cf1f7db034622c21f1c0f7771e0506c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/%C4%9Cerimandrado.svg/220px-%C4%9Cerimandrado.svg.png",
				"previous": "Senators face reelection every six years, and representatives every two. Reelections encourage candidates to focus their publicity efforts at their home states or districts.[54] Running for reelection can be a grueling process of distant travel and fund-raising which distracts senators and representatives from paying attention to governing, according to some critics[123][123] although others respond that the process is necessary to keep members of Congress in touch with voters.",
				"after": "Nevertheless, incumbent members of Congress running for reelection have strong advantages over challengers.[42] They raise more money[47] because donors expect incumbents to win, they give their funds to them rather than challengers.[45][124] And donations are vital for winning elections.[125] One critic compared being elected to Congress to receiving life tenure at a university.[124] Another advantage for representatives is the practice of gerrymandering.[126][127] After each ten-year census, states are allocated representatives based on population, and officials in power can choose how to draw the congressional district boundaries to support candidates from their party. As a result, reelection rates of members of Congress hover around 90 percent,[6] causing some critics to accuse them of being a privileged class.[5] Academics such as Princeton's Stephen Macedo have proposed solutions to fix gerrymandering. Both senators and representatives enjoy free mailing privileges called franking privileges.",
			"color": "blue|0.36674 red|0.34916 light|0.089296 pink|0.089296 pink|0.073224 rosy|0.023692 brown|0.023692 medium|0.021099 slate|0.021099 blue|0.021099 dim|0.018506 gray|0.018506 dim|0.018506 grey|0.018506 plum|0.014971 pale|0.011402 violet|0.011402 red|0.011402 light|0.010762 coral|0.010762 salmon|0.0072815 crimson|0.0072105 gray|0.0052214 grey|0.0052214  "
		}
	}
}
