{
	"add": {
		"doc": {
			"id": "4f36d5dff78254b4c5c4107237b367e641c797ecf961d20f4ea27c213190124a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/KeepTheTinTech.png/220px-KeepTheTinTech.png",
				"previous": "Today, stealing the 'T' is prohibited and is officially punishable with expulsion, although this has not happened in practice. After a Georgia Tech visitor was accidentally killed while climbing the Alexander Memorial Coliseum in 1999,[60] Institute President G. Wayne Clough banned stealing of the 'T' and the climbing of any Institute building, due to the risk of fatal falls and the potential for damage to the building.[49] Clough also expressed concern over the \"incredibly expensive liability litigation\" Georgia Tech could face in the event of an accident.[44] To discourage climbing, security features such as pressure-sensitive roof tiling, fiber optic cabling running throughout the letters, and an audible alarm have been added to the 'T' to help prevent its theft.[61]",
				"after": "In 2011, the Georgia Tech Student Government Association (SGA) launched a \"Keep the 'T' in Tech\" campaign to discourage thefts of 'T's from signage around the campus. The week-long campaign took place from September 26–30 and included an online petition to be published in The Technique, an open forum for discussing the issue, an amnesty day for returning stolen 'T's, and \"Live the True Tradition,\" an evening event focused on the tradition of stealing the 'T' from Tech Tower.[58]",
			"color": "white|0.071651 smoke|0.071651 ghost|0.067056 white|0.067056 snow|0.066942 alice|0.066913 blue|0.066913 sea|0.066819 shell|0.066819 white|0.065451 mint|0.063963 cream|0.063963 floral|0.06231 white|0.06231 dark|0.061848 gray|0.061848 dark|0.061848 grey|0.061848 azure|0.06064 lavender|0.06015 blush|0.06015 silver|0.055665 black|0.048889 gray|0.043973 grey|0.043973 light|0.040286 gray|0.040286 light|0.040286 grey|0.040286 dim|0.035551 gray|0.035551 dim|0.035551 grey|0.035551 gainsboro|0.033251 golden|0.011845 rod|0.011845 linen|0.0098995 ivory|0.0064813  "
		}
	}
}
