{
	"add": {
		"doc": {
			"id": "4f413a8c85a5c40e30056291bb78ce868ef2229fdd26db7e8ec2c9c33b54e3b9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/HoxneMap.jpg/254px-HoxneMap.jpg",
				"previous": "Hoxne, where the hoard was discovered, is located in Suffolk in modern-day East Anglia. Although no large, aristocratic villa has been located in the Hoxne area, there was a Roman settlement nearby from the first through fourth centuries at Scole, about 3.2 km (2 mi) north–west of Hoxne, at the intersection of two Roman roads. One of these, Pye Road, (today's A140), linked Venta Icenorum (Caistor St Edmund) to Camulodunum (Colchester) and Londinium (London).[11][113][114]",
				"after": "The field in which the hoard was discovered was shown by the 1994 excavation to probably have been cleared by the early Bronze Age, when it began to be used for agriculture and settlement. Some settlement activity occurred near the hoard findspot by the first half of the first millennium BC,[22] but there is no evidence of Roman buildings in the immediate vicinity. The field where the hoard was deposited may have been in cultivation during the early phase of the Roman period but the apparent absence of fourth-century coins suggests that it may have been converted to pasture or else had reverted to woodland by that time.[22]",
			"color": "gray|0.12909 grey|0.12909 dark|0.12883 sea|0.12883 green|0.12883 dark|0.11733 gray|0.11733 dark|0.11733 grey|0.11733 tan|0.086656 silver|0.054703 dim|0.042945 gray|0.042945 dim|0.042945 grey|0.042945 thistle|0.03681 rosy|0.029141 brown|0.029141 light|0.025894 gray|0.025894 light|0.025894 grey|0.025894 beige|0.024104 burly|0.022239 wood|0.022239 white|0.021639 smoke|0.021639 honeydew|0.021054 gainsboro|0.018614 sea|0.018338 shell|0.018338 floral|0.018034 white|0.018034 linen|0.017398 mint|0.017091 cream|0.017091 snow|0.016974 lavender|0.014984 blush|0.014984 old|0.014243 lace|0.014243 white|0.01382 misty|0.013446 rose|0.013446 ivory|0.013302 ghost|0.011401 white|0.011401 lavender|0.011093 alice|0.0096102 blue|0.0096102  "
		}
	}
}
