{
	"add": {
		"doc": {
			"id": "4f442a577f4fa370015a8ad99ea803faa627ca5ec9da229347048264dc7c76e9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Bouts_Entombment_detail.jpg/300px-Bouts_Entombment_detail.jpg",
				"previous": "The Pharisee Nicodemus supports Christ as he is lowered, and can be identified by his similarity to Simon the Pharisee in another canvas attributed to Bouts, Christ in the House of Simon.[10] The Virgin wears a white headdress and a dark blue dress with a yellowish mantle, and holds Christ's arm just above his wrist as if afraid to let go of her dead son. She is supported by John the Evangelist, who wears a red robe. Dressed in green robes, Mary Salome stands to the Virgin's left, wiping tears from her face with the fold of her white headdress. Mary of Clopas is behind them, holding a red cloth over her mouth, while the Magdalen is in the foreground at Christ's feet, dressed in a heavily folded cloak. The man in the brown–green tabard at the feet of Christ is probably Joseph of Arimathea, who, according to Gospel, brought Christ's body to Golgotha from Pontius Pilate.[10]",
				"after": "The Entombment is painted on linen tightly woven with 20 to 22 vertical and between 19 to 22 horizontal threads per centimetre.[11] The cloth is Z-spun (tightly spun) and tabby woven[12] with flax perhaps combined with cotton.[7] The cloth support is lined, unusually, with similar but more finely woven linen mounted on a wooden stretcher. Before the paint was applied, the linen was first mounted on a temporary stretcher and outlined with a brown border – now visible on the lower border – which was used as a guide to cut the picture down before framing.[13] Glue-sizing consists of creating a distemper by mixing pigments in water and then using a glue-base derived from boiled animal skin and other tissues as a binder.[14] The pigments were applied to a linen cloth, treated with the same glue sizing, fixed in turn to its frame by glue.[6] The paint saturated the cloth, often leaving an image on the reverse side, which was lined with an additional cloth.[15]",
			"color": " "
		}
	}
}
