{
	"add": {
		"doc": {
			"id": "4f49b90ed1f7fd3826a81131e64e8c20f8b0e700472757d919d23b6129a41de0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/YC-121F_MATS.jpg/220px-YC-121F_MATS.jpg",
				"previous": "In November 1951, an idea came about to build a turbine-powered version of the R7O-1. This new aircraft was designated L-1249A by Lockheed. In 1954, two R7O-1s (then designated R7V-1) were pulled off the assembly line for conversion into prototypes for the new L-1249A. The landing gear was strengthened along with the fuselage and wings of the aircraft. Extra fuel tanks were also added on the wingtips of the two aircraft, increasing the fuel capacity to 7,360 gallons. The wings were also shortened from 123 ft 9 in (37.719 m) to 117 ft 7 in (35.84 m). Finally, four Pratt & Whitney YT-34-P-12A turboprop engines, rated at 5,500 bhp (4,100 kW) each, were installed in place of the usual Wright R-3350 Duplex-Cyclone radial engines. The new aircraft was designated R7V-2, and first flew on 1 September 1954. The R7V-2 reached 412 mph (663.05 km/h) making it the fastest transport aircraft in the world at the time. The two R7V-2 aircraft were delivered to the Navy on 10 September the same year.",
				"after": "In 1953, the United States Air Force became interested in the L-1249A project. Two R7V-1 aircraft were again taken off the production lines in 1955 and converted to L-1249A standards. These aircraft, designated YC-121F, were identical to the R7V-2s in service with the Navy. The YC-121F was able to carry a crew of four and 87-106 passengers, depending on the conditions of the flight (transoceanic and overland). Lockheed also had a planned medical evacuation version, able to carry 73 Stretcher cases and a crew of 15. The R7V-2 and YC-121F both had a cabin similar to the R7V-1 and C-121C. The first YC-121F flew on 5 April 1955 and was delivered to the Air Force in July 1955. The aircraft were put into service with the Test Squadron of the 1700th Air Transport Group of the Military Air Transport Service, based at Kelly Air Force Base, Texas. Other aircraft in the Squadron included the YC-97J Stratofreighter and YC-124B Globemaster II, both also powered by T34 engines.[4][5] After undergoing brief testing, the YC-121F was used on regular basis transportation flights. On one occasion, Lockheed test pilot Roy Wimmer managed to reach a top speed of 479 mph (770.88 km/h) in the YC-121F during a 20 degree dive.",
			"color": " "
		}
	}
}
