{
	"add": {
		"doc": {
			"id": "4f4e37c6e55f1747f2e5076c0dcc99a5a0f609ae067fcaf6e4be304dc1018a75",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Whale_skeleton.png/300px-Whale_skeleton.png",
				"previous": "Adaptation may cause either the gain of a new feature, or the loss of an ancestral feature. An example that shows both types of change is bacterial adaptation to antibiotic selection, with genetic changes causing antibiotic resistance by both modifying the target of the drug, or increasing the activity of transporters that pump the drug out of the cell.[175] Other striking examples are the bacteria Escherichia coli evolving the ability to use citric acid as a nutrient in a long-term laboratory experiment,[176] Flavobacterium evolving a novel enzyme that allows these bacteria to grow on the by-products of nylon manufacturing,[177][178] and the soil bacterium Sphingobium evolving an entirely new metabolic pathway that degrades the synthetic pesticide pentachlorophenol.[179][180] An interesting but still controversial idea is that some adaptations might increase the ability of organisms to generate genetic diversity and adapt by natural selection (increasing organisms' evolvability).[181][182][183][184][185]",
				"after": "Adaptation occurs through the gradual modification of existing structures. Consequently, structures with similar internal organisation may have different functions in related organisms. This is the result of a single ancestral structure being adapted to function in different ways. The bones within bat wings, for example, are very similar to those in mice feet and primate hands, due to the descent of all these structures from a common mammalian ancestor.[187] However, since all living organisms are related to some extent,[188] even organs that appear to have little or no structural similarity, such as arthropod, squid and vertebrate eyes, or the limbs and wings of arthropods and vertebrates, can depend on a common set of homologous genes that control their assembly and function; this is called deep homology.[189][190]",
			"color": " "
		}
	}
}
