{
	"add": {
		"doc": {
			"id": "4f5410f2c2412f57fc11c08976ea782953e35751e57b401e72ef912707e73630",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Gold_ray_dam.jpg/220px-Gold_ray_dam.jpg",
				"previous": "Other dams have impeded fish passage at one time or another between the William L. Jess Dam and Grants Pass. After decades of controversy about water rights, costs, migratory fish, and environmental impacts, removal or modification of remaining middle-reach dams as well as a partly finished dam on Elk Creek, a major tributary of the Rogue, began in 2008. The de-construction projects were all meant to improve salmon runs by allowing more fish to reach suitable spawning grounds.[88]",
				"after": "In 1904, brothers C.R. and Frank Ray built the Gold Ray Dam, a log structure, to generate electricity near Gold Hill.[89] They installed a fish ladder.[89] The California-Oregon Power Company, which later became Pacific Power, acquired the dam in 1921.[89] Replacing the log dam in 1941 with a concrete structure 35 feet (11 m) high, it added a new fish ladder and a fish-counting station.[89] The company closed the hydroelectric plant in 1972, although the fish ladder remained, and biologists from the Oregon Department of Fish and Wildlife used the station to count migrating salmon and steelhead.[89] Jackson County, which owned the dam, had it removed with the help of a $5 million federal grant approved in June 2009.[90] The dam was demolished in the summer of 2010.[91]",
			"color": "dark|0.14821 gray|0.14821 dark|0.14821 grey|0.14821 silver|0.12248 light|0.11857 gray|0.11857 light|0.11857 grey|0.11857 dim|0.10315 gray|0.10315 dim|0.10315 grey|0.10315 gainsboro|0.097064 gray|0.094943 grey|0.094943 dark|0.050683 olive|0.050683 green|0.050683 light|0.045972 steel|0.045972 blue|0.045972 light|0.043002 slate|0.043002 gray|0.043002 black|0.04208 slate|0.02622 gray|0.02622 linen|0.017161 white|0.014539 smoke|0.014539 lavender|0.0096843 blush|0.0096843 sea|0.009329 shell|0.009329 misty|0.0076025 rose|0.0076025  "
		}
	}
}
