{
	"add": {
		"doc": {
			"id": "4f587715e73f8e6fa749be3b97867db4dfa3d9727915693895445ccf770fb881",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Border_monument_2008.JPG/220px-Border_monument_2008.JPG",
			"previous": [],
			"after": [
				"On March 23, 1648, France and the Dutch Republic agreed to divide the island between their two territories, with the signing of the Treaty of Concordia.",
				"Folklore surrounds the history of the once ever-changing border division between St. Martin and Sint Maarten, and a popular story among locals narrates that \"to divide the island into two sections, [in 1648] the inhabitants were told to choose two walkers, one chosen by the French-dominated community and the other one by the Dutch-dominated community, who were put back to back in one extreme of the island, making them walk in opposite directions while stuck to the littoral line, and not allowing them to run. The point where they eventually met was set as the other extreme of the island, and the subsequently created line was chosen as the frontier, dividing Saint-Martin from Sint Maarten. Seemingly, the French walker had walked more than his Dutch counterpart (each one earned his land, respectively, 54 km² and 32 km²). As the first man chose wine as his stimulant prior to the race, while the latter chose Jenever (Dutch Gin), the difference between such beverages' lightness was said to be the cause of the territorial differences by French locals, while Dutch locals tended to blame the French walker for running.\"[9][10]"
			],
			"color": "dim|0.23822 gray|0.23822 dim|0.23822 grey|0.23822 black|0.12897 gray|0.090901 grey|0.090901 dark|0.074823 gray|0.074823 dark|0.074823 grey|0.074823 silver|0.064811 light|0.049938 gray|0.049938 light|0.049938 grey|0.049938 gainsboro|0.041299 white|0.03019 smoke|0.03019 alice|0.026805 blue|0.026805 ghost|0.025933 white|0.025933 snow|0.02472 white|0.023037 mint|0.02228 cream|0.02228 azure|0.022179 sea|0.021368 shell|0.021368 slate|0.021224 gray|0.021224 floral|0.01803 white|0.01803 lavender|0.016418 blush|0.016418 dark|0.01049 slate|0.01049 gray|0.01049 light|0.0097445 slate|0.0097445 gray|0.0097445 lavender|0.007735 linen|0.00735  "
		}
	}
}
