{
	"add": {
		"doc": {
			"id": "4f68f6f571f642ec93439b8deb1c17ee2213380546f6c799729faa3843b1aaf3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Cal_band.JPG/220px-Cal_band.JPG",
				"previous": "Berkeley also features an assortment of student-run magazines, most notably Caliber Magazine. Founded in 2008, Caliber Magazine promotes itself as \"the everything magazine\" by featuring articles and blogs on a wide range of topics. It has been voted \"Best Magazine on Campus\" by the readers of the Daily Cal[136] as well as \"Best Publication on Campus\" by the ASUC. The magazine comes either in hard copy available at Cal Dining locations or in a digital copy that can be found at their website, calibermag.org.",
			"after": [
				"UC Berkeley has over 1700 established student groups.[citation needed]",
				"UC Berkeley has a reputation for student activism, stemming from the 1960s and the Free Speech Movement. Today, Berkeley is known as a lively campus with activism in many forms, from email petitions, presentations on Sproul Plaza and volunteering, to the occasional protest. During the 2006–07 school year, there were 94 political student groups on campus including MEChXA de UC Berkeley, Berkeley American Civil Liberties Union, Berkeley Students for Life, Campus Greens, The Sustainability Team (STEAM), the Berkeley Student Food Collective, Students for Sensible Drug Policy, Cal Berkeley Democrats, and the Berkeley College Republicans. Berkeley sends the most students to the Peace Corps of any university in the nation.[137]"
			],
			"color": "dim|0.25668 gray|0.25668 dim|0.25668 grey|0.25668 gray|0.19346 grey|0.19346 black|0.1248 slate|0.050272 gray|0.050272 dark|0.044638 gray|0.044638 dark|0.044638 grey|0.044638 light|0.034765 slate|0.034765 gray|0.034765 light|0.032022 gray|0.032022 light|0.032022 grey|0.032022 silver|0.03089 gainsboro|0.030535 white|0.018005 smoke|0.018005 rosy|0.017976 brown|0.017976 lavender|0.017634 lavender|0.015979 blush|0.015979 ghost|0.015901 white|0.015901 alice|0.015055 blue|0.015055 snow|0.013681 white|0.010905 sea|0.010072 shell|0.010072 azure|0.0069905 mint|0.0067212 cream|0.0067212 linen|0.0061825 floral|0.0061063 white|0.0061063  "
		}
	}
}
