{
	"add": {
		"doc": {
			"id": "4f6c105887049dd974da4caf47c4d420490aa2d5938e229ccbfd48a6686634d5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/AppareilCarr%C3%A9.jpg/220px-AppareilCarr%C3%A9.jpg",
				"previous": "The first practical vapor compression refrigeration system was built by James Harrison, a British journalist who had emigrated to Australia. His 1856 patent was for a vapour compression system using ether, alcohol or ammonia. He built a mechanical ice-making machine in 1851 on the banks of the Barwon River at Rocky Point in Geelong, Victoria, and his first commercial ice-making machine followed in 1854. Harrison also introduced commercial vapour-compression refrigeration to breweries and meat packing houses, and by 1861, a dozen of his systems were in operation. He later entered the debate of how to compete against the American advantage of unrefrigerated beef sales to the United Kingdom. In 1873 he prepared the sailing ship Norfolk for an experimental beef shipment to the United Kingdom, which used a cold room system instead of a refrigeration system. The venture was a failure as the ice was consumed faster than expected.",
				"after": "The first gas absorption refrigeration system using gaseous ammonia dissolved in water (referred to as \"aqua ammonia\") was developed by Ferdinand Carré of France in 1859 and patented in 1860. Carl von Linde, an engineer specializing in steam locomotives and professor of engineering at the Technological University of Munich in Germany, began researching refrigeration in the 1860s and 70s in response to demand from brewers for a technology that would allow year-round, large-scale production of lager; he patented an improved method of liquefying gases in 1876.[12] His new process made possible using gases such as ammonia, sulfur dioxide (SO2) and methyl chloride (CH3Cl) as refrigerants and they were widely used for that purpose until the late 1920s.",
			"color": "dark|0.28694 gray|0.28694 dark|0.28694 grey|0.28694 gray|0.19402 grey|0.19402 dim|0.11933 gray|0.11933 dim|0.11933 grey|0.11933 silver|0.11818 light|0.070718 gray|0.070718 light|0.070718 grey|0.070718 gainsboro|0.053962 white|0.017733 smoke|0.017733 sea|0.013888 shell|0.013888 linen|0.01305 snow|0.012523 floral|0.011786 white|0.011786 mint|0.011422 cream|0.011422 white|0.010927 alice|0.010202 blue|0.010202 ghost|0.010095 white|0.010095 slate|0.0093747 gray|0.0093747 azure|0.007997 light|0.0070917 slate|0.0070917 gray|0.0070917 lavender|0.0046748 blush|0.0046748 old|0.0040488 lace|0.0040488 ivory|0.003516  "
		}
	}
}
