{
	"add": {
		"doc": {
			"id": "4f704513a50cc2047ac31c4a43d1ae0b09e1d92e6bd8471cdd9097754395af94",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Swedish_Empire_%281560-1815%29_en2.png/220px-Swedish_Empire_%281560-1815%29_en2.png",
				"previous": "However, the Swedes began to resent the monopoly trading position of the Hansa (mostly German citizens), and to resent the income they felt they lost to the Hansa. Consequently, when Gustav Vasa or Gustav I broke the monopoly power of the Hanseatic League he was regarded as a hero by the Swedish people.[33] History now views Gustav I as the father of the modern Swedish nation. The foundations laid by Gustav would take time to develop. Furthermore, when Sweden did develop, freed itself from the Hanseatic League, and entered its golden era, the fact that the peasantry had traditionally been free meant that more of the economic benefits flowed back to them rather than going to a feudal landowning class.[34]",
				"after": "During the 17th century Sweden emerged as a European great power. Before the emergence of the Swedish Empire, Sweden was a poor and scarcely populated country on the fringe of European civilisation, with no significant power or reputation. Sweden rose to prominence on a continental scale during the tenure of king Gustavus Adolphus, seizing territories from Russia and Poland–Lithuania in multiple conflicts, including the Thirty Years' War.",
			"color": "khaki|0.40625 dark|0.041181 khaki|0.041181 white|0.040086 smoke|0.040086 alice|0.038504 blue|0.038504 ghost|0.038419 white|0.038419 sea|0.038282 shell|0.038282 snow|0.038143 white|0.037834 mint|0.037503 cream|0.037503 floral|0.036554 white|0.036554 azure|0.036377 lavender|0.03488 blush|0.03488 dark|0.031154 gray|0.031154 dark|0.031154 grey|0.031154 gray|0.029463 grey|0.029463 dim|0.021975 gray|0.021975 dim|0.021975 grey|0.021975 silver|0.020277 light|0.014006 gray|0.014006 light|0.014006 grey|0.014006 forest|0.012095 green|0.012095 gainsboro|0.011589 pale|0.0085065 golden|0.0085065 rod|0.0085065 ivory|0.0039207 linen|0.0034072 green|0.0028133 dark|0.0027247 green|0.0027247  "
		}
	}
}
