{
	"add": {
		"doc": {
			"id": "4f795a0e00ae93b8fc093373afb96b260adfe10e8cd7ea74cb3795f8dd3ed8fc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Phoenix-international-raceway.svg/180px-Phoenix-international-raceway.svg.png",
			"previous": [],
				"after": "The 2010 Kobalt Tools 500 was a NASCAR Sprint Cup Series stock car race that was held on November 14, 2010, at Phoenix International Raceway in Avondale, Arizona. Contested over 312 laps, it was the thirty-fifth, and the ninth race in the Chase for the Sprint Cup during the 2010 NASCAR Sprint Cup Series season. The race was won by Carl Edwards, for the Roush Fenway Racing team. Ryan Newman finished second, and Joey Logano clinched third. Pole position driver Edwards maintained his lead on the first lap to begin the race, as Newman, who started in the second position on the grid, remained behind him. On the seventh lap, Kurt Busch became the leader of the race. Hamlin, the points leader before the race, led the most laps with a total of 190. On lap 298, Hamlin pitted and fell a lap behind. He didn't return to the first ten positions afterward. Edwards maintained the lead to win the race. There were five cautions and 14 lead changes among six different drivers throughout the course of the race. It was Edwards' first win in the 2010 season, and the 18th of his career. The result kept Edwards in fourth in the Drivers' Championship, 264 points behind Denny Hamlin and 47 ahead of Matt Kenseth. Chevrolet maintained its lead in the Manufacturers' Championship, 42 points ahead of Toyota and 88 ahead of Ford, with one race remaining in the season. A total of 75,000 people attended the race, while 4.201 million watched it on television.",
			"color": "black|0.12184 white|0.081014 smoke|0.081014 ghost|0.079691 white|0.079691 snow|0.079671 white|0.07952 alice|0.079071 blue|0.079071 mint|0.078994 cream|0.078994 sea|0.078771 shell|0.078771 floral|0.078271 white|0.078271 azure|0.078168 lavender|0.074713 blush|0.074713 dim|0.019503 gray|0.019503 dim|0.019503 grey|0.019503 gray|0.016304 grey|0.016304 dark|0.016029 gray|0.016029 dark|0.016029 grey|0.016029 silver|0.011265 light|0.010298 gray|0.010298 light|0.010298 grey|0.010298 gainsboro|0.00941 ivory|0.0039486  "
		}
	}
}
