{
	"add": {
		"doc": {
			"id": "4f928c53817c089ef065f836ae878d54aa986056541aa5d7ace94f41190bdaef",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Rio_tinto_river_CarolStoker_NASA_Ames_Research_Center.jpg/200px-Rio_tinto_river_CarolStoker_NASA_Ames_Research_Center.jpg",
			"previous": [
				"A superphylum - TACK - has been proposed that includes the Thaumarchaeota, Aigarchaeota, Crenarchaeota, and Korarchaeota.[21] This superphylum may be related to the origin of eukaryotes.",
				"The classification of archaea, and of prokaryotes in general, is a rapidly moving and contentious field. Current classification systems aim to organize archaea into groups of organisms that share structural features and common ancestors.[14] These classifications rely heavily on the use of the sequence of ribosomal RNA genes to reveal relationships between organisms (molecular phylogenetics).[15] Most of the culturable and well-investigated species of archaea are members of two main phyla, the Euryarchaeota and Crenarchaeota. Other groups have been tentatively created. For example, the peculiar species Nanoarchaeum equitans, which was discovered in 2003, has been given its own phylum, the Nanoarchaeota.[16] A new phylum Korarchaeota has also been proposed. It contains a small group of unusual thermophilic species that shares features of both of the main phyla, but is most closely related to the Crenarchaeota.[17][18] Other recently detected species of archaea are only distantly related to any of these groups, such as the Archaeal Richmond Mine acidophilic nanoorganisms (ARMAN), which were discovered in 2006[19] and are some of the smallest organisms known.[20]"
			],
				"after": "The classification of archaea into species is also controversial. Biology defines a species as a group of related organisms. The familiar exclusive breeding criterion (organisms that can breed with each other but not with others) is of no help because archaea reproduce asexually.[22]",
			"color": "tan|0.13386 black|0.11743 peru|0.1092 dim|0.10081 gray|0.10081 dim|0.10081 grey|0.10081 gray|0.081273 grey|0.081273 chocolate|0.061617 rosy|0.048559 brown|0.048559 dark|0.046453 gray|0.046453 dark|0.046453 grey|0.046453 burly|0.038753 wood|0.038753 sandy|0.035084 brown|0.035084 silver|0.027416 sienna|0.024024 light|0.017478 gray|0.017478 light|0.017478 grey|0.017478 saddle|0.017379 brown|0.017379 peach|0.016474 puff|0.016474 dark|0.015869 salmon|0.015869 gainsboro|0.011341 antique|0.0096087 white|0.0096087  "
		}
	}
}
