{
	"add": {
		"doc": {
			"id": "4f9ae0ecd8b32bcb0f02a73e3a433bbf04abf380cbf53d566a3257bafa297757",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Japanese_aircraft_carrier_H%C5%8Dsh%C5%8D_Tokyo_Bay.jpg/220px-Japanese_aircraft_carrier_H%C5%8Dsh%C5%8D_Tokyo_Bay.jpg",
				"previous": "The 1903 advent of heavier-than-air fixed-wing aircraft was closely followed in 1910 by the first experimental take-off of an airplane, made from the deck of a United States Navy vessel (cruiser USS Birmingham), and the first experimental landings were conducted in 1911. On 9 May 1912 the first airplane take-off from a ship underway was made from the deck of the British Royal Navy's HMS Hibernia.[7][8] Seaplane tender support ships came next, with the French Foudre of 1911. In September 1914 the Imperial Japanese Navy Wakamiya conducted the world's first successful ship-launched air raid:[9][10] on 6 September 1914 a Farman aircraft launched by Wakamiya attacked the Austro-Hungarian cruiser Kaiserin Elisabeth and the German gunboat Jaguar in Kiaochow Bay off Tsingtao; neither was hit.[11][12]",
				"after": "The development of flattop vessels produced the first large fleet ships. In 1918, HMS Argus became the world's first carrier capable of launching and recovering naval aircraft.[13] As a result of the Washington Naval Treaty of 1922, which limited the construction of new heavy surface combat ships, most early aircraft carriers were conversions of ships that were laid down (or had served) as different ship types: cargo ships, cruisers, battle cruisers, or battleships. These conversions gave rise to Lexington-class aircraft carriers (1927), Akagi and Courageous-class. Specialist carrier evolution was well underway, with several navies ordering and building warships that were purposefully designed to function as aircraft carriers by the mid-1920s, resulting in the commissioning of ships such as Hōshō (1922), HMS Hermes (1924), and Béarn (1927). During World War II, these ships would become the backbone of the carrier forces of the United States, British, and Japanese navies, known as fleet carriers.",
			"color": "dim|0.60734 gray|0.60734 dim|0.60734 grey|0.60734 gray|0.22151 grey|0.22151 dark|0.072257 gray|0.072257 dark|0.072257 grey|0.072257 slate|0.070952 gray|0.070952 light|0.014651 slate|0.014651 gray|0.014651 black|0.0052808 silver|0.0046877  "
		}
	}
}
