{
	"add": {
		"doc": {
			"id": "4fb87f03be4c4acb137100a07250121215ded8f43309ce4d6571e2e2174959a4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Ap8-S68-56531.jpg/220px-Ap8-S68-56531.jpg",
				"previous": "Borman was selected in late 1966 to command the third manned Apollo mission, planned as an elliptical medium Earth orbit test of the second manned Lunar Module (LM) on the first manned launch of the Saturn V lunar rocket sometime in 1967 or early 1968. However in January 1967, the crew of the first manned Apollo mission Apollo 1 (then designated \"AS-204\"), Virgil I. \"Gus\" Grissom, Ed White, and Roger B. Chaffee were killed in a fire aboard their Command Module, delaying the Apollo program. Following this deadly accident, the AS-204 Accident Review Board was charged with investigating the root causes of the fire and recommending corrective measures – Borman was chosen as the only astronaut to serve on the review board. In April 1967, while serving on the board, Borman was one of five astronauts who testified before a United States Senate committee investigating the Apollo 1 fire. His testimony helped convince U.S. Congress that Apollo would be safe to fly again.",
				"after": "Borman was then reassigned to his LM test mission, now planned to fly as \"Apollo 9\" in early 1969 after a first, low Earth orbit LM flight commanded by McDivitt in December 1968. But the LM was not ready for its first flight, leading NASA management to decide to replace Borman's mission with a lunar orbit flight using just the Command/Service Module as Apollo 8 in December, making McDivitt's flight Apollo 9 in March 1969. Borman's \"Lunar Module Pilot\" (and spacecraft systems engineer) was William Anders. The Command Module Pilot and navigator, Michael Collins, had to have back surgery and was replaced by his backup, James Lovell, reuniting Borman with his Gemini 7 crewmate. Apollo 8 went into lunar orbit on December 24 and made ten orbits of the Moon in 20 hours before returning to Earth.",
			"color": "black|0.61806 light|0.064236 gray|0.064236 light|0.064236 grey|0.064236 silver|0.060122 dark|0.059345 gray|0.059345 dark|0.059345 grey|0.059345 gainsboro|0.049864 gray|0.031455 grey|0.031455 rosy|0.019566 brown|0.019566 dim|0.018952 gray|0.018952 dim|0.018952 grey|0.018952 powder|0.010198 blue|0.010198 light|0.0076997 cyan|0.0076997 tan|0.0073519 azure|0.0055631 white|0.0054474 smoke|0.0054474  "
		}
	}
}
