{
	"add": {
		"doc": {
			"id": "4fcfbd52e45cc6982ebf4bc4ee79f5ca0843a02df88ae074ddc32e16fcc4773b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Apatosaurus_and_trackway.jpg/170px-Apatosaurus_and_trackway.jpg",
				"previous": "The Glen Rose Formation of central Texas preserves many dinosaur footprints, including large, three-toed theropod prints. The most famous of these trackways was discovered along the Paluxy River in Dinosaur Valley State Park, a section of which is now on exhibit in the American Museum of Natural History in New York City,[32] although several other sites around the state have been described in the literature.[33][34] It is impossible to say what animal made the prints, since no fossil bones have been associated with the trackways. However, scientists have long considered it likely that the footprints belong to Acrocanthosaurus.[35] A 2001 study compared the Glen Rose footprints to the feet of various large theropods but could not confidently assign them to any particular genus. However, the study noted that the tracks were within the ranges of size and shape expected for Acrocanthosaurus. Because the Glen Rose Formation is close to the Antlers and Twin Mountains Formations in both geographical location and geological age, and the only large theropod known from those formations is Acrocanthosaurus, the study concluded that Acrocanthosaurus was most likely to have made the tracks.[36]",
				"after": "The famous Glen Rose trackway on display in New York City includes theropod footprints belonging to several individuals which moved in the same direction as up to twelve sauropod dinosaurs. The theropod prints are sometimes found on top of the sauropod footprints, indicating that they were formed later. This has been put forth as evidence that a small pack of Acrocanthosaurus was stalking a herd of sauropods.[32] While interesting and plausible, this hypothesis is difficult to prove and other explanations exist. For example, several solitary theropods may have moved through in the same direction at different times after the sauropods had passed, creating the appearance of a pack stalking its prey. The same can be said for the purported \"herd\" of sauropods, who also may or may not have been moving as a group.[37] At a point where it crosses the path of one of the sauropods, one of the theropod trackways is missing a footprint, which has been cited as evidence of an attack.[38] However, other scientists doubt the validity of this interpretation because the sauropod did not change gait, as would be expected if a large predator were hanging onto its side.[37]",
			"color": "black|0.68116 dim|0.084814 gray|0.084814 dim|0.084814 grey|0.084814 gray|0.044045 grey|0.044045 dark|0.035264 gray|0.035264 dark|0.035264 grey|0.035264 dark|0.033243 slate|0.033243 gray|0.033243 slate|0.023451 gray|0.023451 light|0.023312 slate|0.023312 gray|0.023312 light|0.020524 steel|0.020524 blue|0.020524 light|0.016482 blue|0.016482  "
		}
	}
}
