{
	"add": {
		"doc": {
			"id": "4fd02fab16137d27a1906a62f640feeb532e61b405aace31a0a78a4dbed82986",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Valenzuela-City-1.jpg/220px-Valenzuela-City-1.jpg",
				"previous": "In 1587, the Tagalog cabeza de barangay of Catanghalan Tassi Bassi joined the chieftain of Tondo Magat Salamat in planning an insurrection against Spanish colonizers in Maynila.[23] The rebels were blood-related noblemen or maharlikas of Maynila including Juan Banal, another Tondo chief and Salamat’s brother-in-law; Gerónimo Basi and Gabriel Tuambacar, brothers of Agustín de Legazpi; Pedro Balinguit, the chief of Pandacan and other chiefs of Tondo. The \"revolution\", however, was foiled by its discovery by Spanish authorities.[24]",
				"after": "When Manila became an archdiocese on 14 August 1595 based on Pope Gregory XIII's Papal order, the regular friars who had already established permanent churches in Catanghalan decided that the attached sitio of Polo be separated from the town and have its own church to better cater to its increasing population's spiritual needs. Through successive efforts of Franciscan Fray Juan Taranco and Don Juan Monsod, sitio Polo was successfully separated from Catanghalan on 12 November 1623, the feast day of the town's new patron, San Diego de Alcala. Thus, the first cabeza de barangay of the new town of Polo was Monsod while Taranco run the parish which would become the present-day San Diego de Alcalá parish on a small tavern.[25] The separation was made upon the orders of Governor-General Alonso Fajardo de Entenza when Polo was still under the provincial government of Bulacan. (However, historical records in Errecciones de los Pueblos at the Philippine National Archives show the first parochial records of Polo has been existing as early as 7 November 1621.)[26] Later, the date of 12 November is adopted as the foundation day of the city.[2][3]",
			"color": "black|0.62504 maroon|0.11192 dark|0.055668 red|0.055668 gray|0.049992 grey|0.049992 dim|0.043782 gray|0.043782 dim|0.043782 grey|0.043782 dark|0.027642 gray|0.027642 dark|0.027642 grey|0.027642 light|0.021059 slate|0.021059 gray|0.021059 slate|0.016234 gray|0.016234  "
		}
	}
}
