{
	"add": {
		"doc": {
			"id": "4fd250c18944f1187dff7814382f5aee8bfb9ed42d3bd0df0682aad6b8e6b706",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/View_of_Austin_From_Congress_Street_Bridge.jpg/220px-View_of_Austin_From_Congress_Street_Bridge.jpg",
			"previous": [],
				"after": "The Greater Austin metropolitan statistical area had a Gross Domestic Product of $86 billion in 2010.[83] Austin is considered to be a major center for high tech.[84] Thousands of graduates each year from the engineering and computer science programs at the University of Texas at Austin provide a steady source of employees that help to fuel Austin's technology and defense industry sectors. The region's rapid growth has led Forbes to rank the Austin metropolitan area number one among all big cities for jobs for 2012 in their annual survey and WSJ Marketwatch to rank the area number one for growing businesses.[85][86] By 2013, Austin ranked No. 14 on Forbes' list of the Best Places for Business and Careers (directly below Dallas, No. 13 on the list).[87] As a result of the high concentration of high-tech companies in the region, Austin was strongly affected by the dot-com boom in the late 1990s and subsequent bust.[84] Austin's largest employers include the Austin Independent School District, the City of Austin, Dell, the U.S. Federal Government, Freescale Semiconductor (spun off from Motorola in 2004), IBM, St. David's Healthcare Partnership, Seton Family of Hospitals, the State of Texas, the Texas State University, and the University of Texas at Austin.[84] Other high-tech companies with operations in Austin include 3M, Apple, Hewlett-Packard, Google, Qualcomm, Inc., AMD, Applied Materials, Cirrus Logic, ARM Holdings, Cisco Systems, Electronic Arts, Flextronics, Facebook, eBay/PayPal, Bioware, Blizzard Entertainment, Hoover's, Intel Corporation, National Instruments, Nvidia, Rackspace, RetailMeNot, Rooster Teeth, Spansion, Troux Technologies, Buffalo Technology, Silicon Laboratories, Xerox, Oracle, Hostgator, Samsung Group, HomeAway, and United Devices. In 2010, Facebook accepted a grant to build a downtown office that could bring as many as 200 jobs to the city.[88] The proliferation of technology companies has led to the region's nickname, \"the Silicon Hills\", and spurred development that greatly expanded the city.",
			"color": "dim|0.40578 gray|0.40578 dim|0.40578 grey|0.40578 gray|0.26718 grey|0.26718 dark|0.13945 slate|0.13945 gray|0.13945 dark|0.093077 gray|0.093077 dark|0.093077 grey|0.093077 silver|0.024088 slate|0.017767 gray|0.017767 light|0.012413 slate|0.012413 gray|0.012413 cadet|0.010922 blue|0.010922 light|0.0081205 gray|0.0081205 light|0.0081205 grey|0.0081205  "
		}
	}
}
