{
	"add": {
		"doc": {
			"id": "4fd74657ae95fbb7b18714a571beed892efa0e66faa19e45a0c7e8ffcab5bf6f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Dublin_castle.JPG/220px-Dublin_castle.JPG",
				"previous": "Dublin was established as a Viking settlement in the 10th century and, despite a number of rebellions by the native Irish, it remained largely under Viking control until the Norman invasion of Ireland was launched from Wales in 1169.[15] The King of Leinster, Diarmait Mac Murchada, enlisted the help of Strongbow, the Earl of Pembroke, to conquer Dublin. Following Mac Murrough's death, Strongbow declared himself King of Leinster after gaining control of the city. In response to Strongbow's successful invasion, King Henry II of England reaffirmed his sovereignty by mounting a larger invasion in 1171 and pronounced himself Lord of Ireland.[16] Around this time, the county of the City of Dublin was established along with certain liberties adjacent to the city proper. This continued down to 1840 when the barony of Dublin City was separated from the barony of Dublin. Since 2001, both baronies have been redesignated the City of Dublin.",
				"after": "Dublin Castle, which became the centre of Norman power in Ireland, was founded in 1204 as a major defensive work on the orders of King John of England.[17] Following the appointment of the first Lord Mayor of Dublin in 1229, the city expanded and had a population of 8,000 by the end of the 13th century. Dublin prospered as a trade centre, despite an attempt by King Robert I of Scotland to capture the city in 1317.[16] It remained a relatively small walled medieval town during the 14th century and was under constant threat from the surrounding native clans. In 1348, the Black Death, a lethal plague which had ravaged Europe, took hold in Dublin and killed thousands over the following decade.[18][19]",
			"color": "black|0.19879 tan|0.14862 antique|0.068294 white|0.068294 dim|0.065378 gray|0.065378 dim|0.065378 grey|0.065378 dark|0.064856 gray|0.064856 dark|0.064856 grey|0.064856 gray|0.064535 grey|0.064535 silver|0.045792 misty|0.044319 rose|0.044319 peach|0.039606 puff|0.039606 linen|0.031027 light|0.027991 gray|0.027991 light|0.027991 grey|0.027991 bisque|0.027055 papaya|0.026892 whip|0.026892 blanched|0.021668 almond|0.021668 old|0.021406 lace|0.021406 sea|0.017496 shell|0.017496 gainsboro|0.016819 floral|0.012857 white|0.012857  "
		}
	}
}
