{
	"add": {
		"doc": {
			"id": "4fdfdbe2d46c09089ff30021dafa5179df36fbb1211c9d001e9bea69615e59d2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Tasmanian_Devil_roadsign.jpg/220px-Tasmanian_Devil_roadsign.jpg",
			"previous": [],
				"after": "Motor vehicles are a threat to localised populations of non-abundant Tasmanian mammals,[127][128] and a 2010 study showed that devils were particularly vulnerable. A study of nine species, mostly marsupials of a similar size, showed that devils were more difficult for drivers to detect and thus avoid. At high beam, devils had the lowest detection distance, 40% closer than the median. This requires a 20% reduction in speed for a motorist to avoid the devil. For low beam, the devils are the seventh worst in terms of detection distance, 16% below the median. For avoidance of roadkill to be feasible, motorists would have to drive at around half the current speed limit in rural areas.[127] A study in the 1990s on a localised population of devils in a national park in Tasmania recorded a halving of the population after a hitherto gravel access road was upgraded, surfaced with bitumen and widened. At the same time, there was a large increase in deaths caused by vehicles along the new road; there had been none in the preceding six months.[128] The vast majority of deaths occurred in the sealed portion of the road, believed to be due to an increase in speeds.[128] It was also conjectured that the animals were harder to see against the dark bitumen instead of the light gravel.[128] The devil and quoll are especially vulnerable as they often try to retrieve roadkill for food and travel along the road. To alleviate the problem, traffic slowing measures, man-made pathways that offer alternative routes for devils, education campaigns, and the installation of light reflectors to indicate oncoming vehicles have been implemented. They are credited with decreases in roadkill.[128] Devils have often been victims of roadkill when they are retrieving other roadkill. Work by scientist Menna Jones and a group of conservation volunteers to remove dead animals from the road resulted in a significant reduction in devil traffic deaths.[83] It was estimated that 3,392 devils, or between 3.8 and 5.7% of the population, were being killed annually by vehicles in 2001–04.[56]",
			"color": "dark|0.42923 golden|0.42923 rod|0.42923 dim|0.18782 gray|0.18782 dim|0.18782 grey|0.18782 golden|0.13846 rod|0.13846 black|0.11817 gray|0.089867 grey|0.089867 dark|0.020088 gray|0.020088 dark|0.020088 grey|0.020088  "
		}
	}
}
