{
	"add": {
		"doc": {
			"id": "5006d58ab3b0f085667c6ee4c49b9e0c19a9b22b421b14a380b09a6031be9151",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Stanford-bikes.jpg/220px-Stanford-bikes.jpg",
			"previous": [],
				"after": "Eighty-nine percent of undergraduate students live in on-campus university housing. First-year students are required to live on campus, and all undergraduates are guaranteed housing for all four undergraduate years.[127][169] According to the Stanford Housing Assignments Office, undergraduates live in 80 different houses, including dormitories, co-ops, row houses, fraternities and sororities.[170] At Manzanita Park, 118 mobile homes were installed as \"temporary\" housing from 1969 to 1991, but it is now the site of modern dorms Castano, Kimball, and Lantana.[171] Most student residences are located just outside the campus core, within ten minutes (on foot or bike) of most classrooms and libraries. Some are for freshmen only; others give priority to sophomores, others to both freshmen and sophomores; some are for upperclass students only, and some are open to all four classes. Most residences are co-ed; seven are all-male fraternities, three are all-female sororities, and there is also one all-female non-sorority house, Roth House. In most residences, men and women live on the same floor, but a few dorms are configured for men and women to live on separate floors (single-gender floors), including all Wilbur dorms except for Arroyo and Okada.[172] Beginning in 2009–10, the University's housing plan anticipates that all freshmen desiring to live in all-freshman dorms will be accommodated. In the 2009–10 year, almost two-thirds of freshmen will be housed in Stern and Wilbur Halls. The one-third who requested four-class housing will be located in other dormitories throughout campus, including Florence Moore (FloMo).[173] Stanford hosts incoming freshmen in freshmen dorms with upperclass residence assistants. In April 2008, Stanford unveiled a new pilot plan to test out gender-neutral housing in five campus residences, allowing males and females to live in the same room. This was after concerted student pressure, as well as the institution of similar policies at peer institutions such as Wesleyan, Oberlin, Clark, Dartmouth, Brown, and UPenn.[174]",
			"color": "silver|0.20198 dim|0.1906 gray|0.1906 dim|0.1906 grey|0.1906 dark|0.149 gray|0.149 dark|0.149 grey|0.149 gray|0.13979 grey|0.13979 black|0.097734 light|0.089535 gray|0.089535 light|0.089535 grey|0.089535 gainsboro|0.040776 misty|0.017404 rose|0.017404 slate|0.0087353 gray|0.0087353 linen|0.008269 light|0.0072646 slate|0.0072646 gray|0.0072646 antique|0.0064652 white|0.0064652 dark|0.0053292 slate|0.0053292 gray|0.0053292  "
		}
	}
}
