{
	"add": {
		"doc": {
			"id": "5027e84897f533bb57c186f62d65dbbd360e156a4c5d2b5c569f42e57bca5dbb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Kentucky_Derby_2014_finish.jpg/260px-Kentucky_Derby_2014_finish.jpg",
				"previous": "The colt arrived at Churchill Downs in Louisville, Kentucky, on April 28, 2014, and was one of the last Derby contenders to arrive. He was flown in from California, his first time on a plane, and traveled quietly. Once the plane landed, however, his travel idiosyncrasy was discovered by the waiting press when he refused to be unloaded until he was turned around and backed down the ramp; Alan Sherman explained later that this was also his typical manner of egress from ground-based transportation.[58] Upon arrival at Churchill Downs, the horses entered in the Kentucky Derby each were given a special saddle cloth to wear while exercising on the track, identifying them as Derby contenders and including their name.[104] The one given to California Chrome contained a typographical error, with California misspelled as \"Califorina\".[105] He wore it the first day and then the track management obtained one with the correct spelling.[104] Critics commented that bringing the horse in late and not giving him a full workout on the track was a mistake,[106] but Sherman's strategy was backed by Lukas.[100] In the days leading up to the race, California Chrome galloped on the track,[107] was walked in the saddling paddock, and became familiar with the starting gate.[108] Willie Delgado later remarked that the horse did not particularly like that particular track, saying \"he never actually felt comfortable on it.\"[109]",
				"after": "California Chrome's connections drew post position five for the race. He was the morning line favorite at odds of 5–2.[110] The press suggested that the number five spot, relatively close to the inside rail, could be a problem owing to the \"speed horses\" that would go to the front early in the race, surrounding him on both sides,[25] especially if the colt was slow out of the gate.[111][112] Espinoza countered by pointing out that he won the 2002 Kentucky Derby on War Emblem from the same post position.[113]",
			"color": "silver|0.21387 dark|0.20692 gray|0.20692 dark|0.20692 grey|0.20692 gray|0.099747 grey|0.099747 light|0.061056 gray|0.061056 light|0.061056 grey|0.061056 dark|0.056873 slate|0.056873 gray|0.056873 thistle|0.053601 dark|0.045038 khaki|0.045038 dim|0.044259 gray|0.044259 dim|0.044259 grey|0.044259 rosy|0.03062 brown|0.03062 tan|0.026762 gainsboro|0.023645 light|0.016449 slate|0.016449 gray|0.016449 slate|0.011878 gray|0.011878  "
		}
	}
}
