{
	"add": {
		"doc": {
			"id": "5039a1eab00a5dfb25243319bead8b2abe921178be873dc2c4739d311f453e8b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/SYRIAN.VIE.jpg/220px-SYRIAN.VIE.jpg",
			"previous": [],
				"after": "Syrian Airlines was established in autumn 1946, with two propeller aircraft and started to fly between Damascus, Aleppo and Deir ez-Zour and Al-Qamishli. Operations began in 1947. Financial difficulties caused the suspension of services in 1948, but after receiving government support operations were resumed in 1951. The airline expanded during the next years to include Beirut, Baghdad, and Jerusalem, then Cairo and Kuwait then Doha, in addition to flights during the hajj. The airline started its operations in June 1947 using two Beech D-18s and three Douglas DC-3 (C-47 Dakotas). The Dakotas had been acquired from Pan American World Airways (PAA), which provided technical assistance to Syrian Airways during the very first years of operation. The airline's domestic network linked Damascus, Aleppo, Latakia, Kamishly and Palmyra. Syrian Airways also operated a regional network, with flights to Beirut, Baghdad, Jerusalem, Amman; followed by Cairo, Kuwait, Doha and Jeddah. In May 1948, the war in Palestine and financial difficulties led to the withdrawal of PAA and to the suspension of service until the summer of 1952. On December 21, 1953, one of the airline's Douglas planes crashed near Damascus killing all nine aboard. The airline's operating permit was cancelled following the crash. The airline was allowed to fly again in 1954. The D-18s had been returned to the Syrian Air Force in 1949, while four additional Dakotas were acquired between 1952 and 1956.",
			"color": "light|0.095715 gray|0.095715 light|0.095715 grey|0.095715 gainsboro|0.086647 silver|0.081923 black|0.079792 dim|0.074306 gray|0.074306 dim|0.074306 grey|0.074306 light|0.072176 steel|0.072176 blue|0.072176 dark|0.060668 gray|0.060668 dark|0.060668 grey|0.060668 gray|0.044147 grey|0.044147 linen|0.037591 white|0.032822 smoke|0.032822 sea|0.029108 shell|0.029108 lavender|0.023294 blush|0.023294 midnight|0.022418 blue|0.022418 misty|0.022216 rose|0.022216 snow|0.022034 floral|0.020689 white|0.020689 light|0.019125 slate|0.019125 gray|0.019125 slate|0.017715 gray|0.017715 ghost|0.016623 white|0.016623 old|0.015702 lace|0.015702 white|0.015175 mint|0.012362 cream|0.012362  "
		}
	}
}
