{
	"add": {
		"doc": {
			"id": "50497c9a1330fbff2a89c7e26cf164999650e99a2c95d848f70c29bfc2d0758c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Hand_of_an_Iguanodon_28-12-2007_15-22-03.jpg/170px-Hand_of_an_Iguanodon_28-12-2007_15-22-03.jpg",
				"previous": "Iguanodon teeth are, as the name suggests, like those of an iguana, but larger. Unlike hadrosaurids, which had columns of replacement teeth, Iguanodon only had one replacement tooth at a time for each position. The upper jaw held up to 29 teeth per side, with none at the front of the jaw, and the lower jaw 25; the numbers differ because teeth in the lower jaw are broader than those in the upper.[9] Because the tooth rows are deeply inset from the outside of the jaws, and because of other anatomical details, it is believed that, as with most other ornithischians, Iguanodon had some sort of cheek-like structure, muscular or non-muscular, to retain food in the mouth.[16][17]",
				"after": "The skull was structured in such a way that as it closed, the bones holding the teeth in the upper jaw would bow out. This would cause the lower surfaces of the upper jaw teeth to rub against the upper surface of the lower jaw's teeth, grinding anything caught in between and providing an action that is the rough equivalent of mammalian chewing.[18] Because the teeth were always replaced, the animal could have used this mechanism throughout its life, and could eat tough plant material.[19] Additionally, the front ends of the animal's jaws were toothless and tipped with bony nodes, both upper and lower,[2] providing a rough margin that was likely covered and lengthened by a keratinous material to form a cropping beak for biting off twigs and shoots.[5] Its food gathering would have been aided by its flexible little finger, which could have been used to manipulate objects, unlike the other fingers.[2]",
			"color": "dim|0.3046 gray|0.3046 dim|0.3046 grey|0.3046 gray|0.18601 grey|0.18601 black|0.14753 tan|0.1409 peach|0.053343 puff|0.053343 bisque|0.039575 antique|0.02132 white|0.02132 blanched|0.019334 almond|0.019334 dark|0.016827 gray|0.016827 dark|0.016827 grey|0.016827 papaya|0.013378 whip|0.013378  "
		}
	}
}
