{
	"add": {
		"doc": {
			"id": "5056c6d75f47dae35681677a28a20f82ae74f37c14549bb1f40a7da0ec23642a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Dodo-Skeleton_Natural_History_Museum_London_England.jpg/170px-Dodo-Skeleton_Natural_History_Museum_London_England.jpg",
			"previous": [],
				"after": "Until 1860, the only known dodo remains were the four incomplete 17th-century specimens. Philip Burnard Ayres found the first subfossil bones in 1860, which were sent to Richard Owen at the British Museum, who did not publish the findings. In 1863, Owen requested the Mauritian Bishop Vincent Ryan to spread word that he should be informed if any dodo bones were found.[3] In 1865, George Clark, the government schoolmaster at Mahébourg, finally found an abundance of subfossil dodo bones in the swamp of Mare aux Songes in Southern Mauritius, after a 30-year search inspired by Strickland and Melville's monograph.[2] In 1866, Clark explained his procedure to The Ibis, an ornithology journal: he had sent his coolies to wade through the centre of the swamp, feeling for bones with their feet. At first they found few bones, until they cut away herbage that covered the deepest part of the swamp, where they found many fossils.[104] The swamp yielded the remains of over 300 dodos, but very few skull and wing bones, possibly because the upper bodies were washed away or scavenged while the lower body was trapped. The situation is similar to many finds of moa remains in New Zealand marshes.[105] Most dodo remains from the Mare aux Songes have a medium to dark brown colouration.[73]",
			"color": "black|0.11012 dim|0.081605 gray|0.081605 dim|0.081605 grey|0.081605 gray|0.062723 grey|0.062723 brown|0.060591 gainsboro|0.046187 light|0.042871 blue|0.042871 indian|0.041402 red|0.041402 dark|0.040727 gray|0.040727 dark|0.040727 grey|0.040727 light|0.040316 gray|0.040316 light|0.040316 grey|0.040316 alice|0.037751 blue|0.037751 lavender|0.035365 white|0.032315 smoke|0.032315 dark|0.028974 slate|0.028974 gray|0.028974 light|0.026276 steel|0.026276 blue|0.026276 azure|0.025256 mint|0.024521 cream|0.024521 silver|0.024229 ghost|0.023028 white|0.023028 snow|0.022566 sea|0.022237 shell|0.022237 white|0.020571 floral|0.020249 white|0.020249 light|0.016534 cyan|0.016534 linen|0.014957  "
		}
	}
}
