{
	"add": {
		"doc": {
			"id": "5063a1161bc1b59ed799187d27d59b82dfeecf786de3686da69326c130189ba4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Strigops_habroptilus%2C_face.jpg/220px-Strigops_habroptilus%2C_face.jpg",
				"previous": "The upper parts of the kakapo have yellowish moss-green feathers barred or mottled with black or dark brownish grey, blending well with native vegetation. Individuals may have strongly varying degrees of mottling and colour tone and intensity – museum specimens show that some birds had completely yellow colouring. The breast and flank are yellowish-green streaked with yellow. The belly, undertail, neck and face are predominantly yellowish, streaked with pale green and weakly mottled with brownish-grey. Because the feathers do not need the strength and stiffness required for flight, they are exceptionally soft, giving rise to the specific epithet habroptilus. The kakapo has a conspicuous facial disc of fine feathers, resembling the face of an owl; thus, early European settlers called it the \"owl parrot\". The beak is surrounded by delicate vibrissae or \"whiskers\", which the bird uses to sense the ground for navigation as it walks with its head lowered. The mandible is mostly ivory-coloured, with part of the upper mandible being bluish-grey. The eyes are dark brown. Kakapo feet are large, scaly, and, as in all parrots, zygodactyl (two toes face forward and two backward). The pronounced claws are particularly useful for climbing. The ends of the tail feathers often become worn from being continually dragged on the ground.[3]",
				"after": "The female is easily distinguished from the male: she has a more narrow and less domed head, her beak is narrower and proportionally longer, her cere and nostrils smaller, her legs and feet more slender and pinkish grey, and her tail proportionally longer. While her plumage colour is not very different from that of the male, the toning is more subtle, with less yellow and mottling. She tends to resist more and be more aggressive than the male when handled. A nesting female also has a brood patch on the bare skin of the belly.[3]",
			"color": "black|0.64751 tan|0.12915 dark|0.070298 khaki|0.070298 olive|0.052806  "
		}
	}
}
