{
	"add": {
		"doc": {
			"id": "50631cc48eaac69117d6e121813e78972a1322e5435b8f455a325a703fed021a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Entomyzon_cyanotis_-near_Eumundi%2C_Queensland%2C_Australia_-juvenile-8.jpg/220px-Entomyzon_cyanotis_-near_Eumundi%2C_Queensland%2C_Australia_-juvenile-8.jpg",
			"previous": [],
				"after": "A large honeyeater ranging from 26 to 32 cm (9–13 in) and averaging 29.5 cm (11.6 in) in length, the adult blue-faced honeyeater has a wingspan of 44 cm (17 in) and weighs around 105 g (3.7 oz).[16] In general shape, it has broad wings with rounded tips and a medium squarish tail. The sturdy slightly downcurved bill is shorter than the skull, and measures 3 to 3.5 cm (1.2–1.4 in) in length.[23] It is easily recognised by the bare blue skin around its eyes. The head and throat are otherwise predominantly blackish with a white stripe around the nape and another from the cheek. The upperparts, including mantle, back and wings, are a golden-olive colour, and the margins of the primary and secondary coverts a darker olive-brown, while the underparts are white. Juveniles that have just fledged have grey head, chin and central parts of their breasts, and brown upperparts, and otherwise white underparts. After their next moult, they more closely resemble adults and have similar plumage, but are distinguished by their facial patches.[25] The bare facial skin of birds just fledged is yellow, sometimes with a small patch of blue in front of the eyes, while the skin of birds six months and older has usually become more greenish, and turn darker blue beneath the eye, before assuming the adult blue facial patch by around 16 months of age.[23] The blue-faced honeyeater begins its moult in October or November, starting with its primary flight feathers, replacing them by February. It replaces its body feathers anywhere from December to June, and tail feathers between December and July.[25] 422 blue-faced honeyeaters have been banded between 1953 and 1997 to monitor movements and longevity. Of these, 109 were eventually recovered, 107 of which were within 10 km (6 mi) of their point of banding.[26] The record for longevity was a bird banded in May 1990 in Kingaroy in central Queensland was found dead on a road after 8 years and 3.5 months at in September 1998, around 2 km (1.2 mi) away.[27]",
			"color": "dark|0.14535 olive|0.14535 green|0.14535 dark|0.10125 gray|0.10125 dark|0.10125 grey|0.10125 olive|0.0971 drab|0.0971 silver|0.091956 light|0.080718 gray|0.080718 light|0.080718 grey|0.080718 dim|0.080225 gray|0.080225 dim|0.080225 grey|0.080225 gainsboro|0.059614 olive|0.054506 gray|0.041561 grey|0.041561 black|0.032607 dark|0.032006 khaki|0.032006 white|0.01579 smoke|0.01579 linen|0.014901 sea|0.011611 shell|0.011611 tan|0.010588 floral|0.0093865 white|0.0093865 snow|0.0093296  "
		}
	}
}
