{
	"add": {
		"doc": {
			"id": "5065e5ea9529ca6b56e6d9fbcb2c88805bfad46fea634e81568b2eb05cea2e4b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Corrientes-oceanicas.png/220px-Corrientes-oceanicas.png",
				"previous": "Wind blowing over the surface of the sea causes friction at the interface between air and sea. Not only does this cause waves to form but it also makes the surface seawater move in the same direction as the wind. Although winds are variable, in any one place they predominantly blow from a single direction and thus a surface current can be formed. Westerly winds are most frequent in the mid-latitudes while easterlies dominate the tropics.[62] When water moves in this way, other water flows in to fill the gap and a circular movement of surface currents known as a gyre is formed. There are five main gyres in the world's oceans: two in the Pacific, two in the Atlantic, and one in the Indian Ocean. The North Atlantic gyre that produces the Sargasso Sea accumulates salinity levels as high as 38‰.[5] Other smaller gyres are found in lesser seas and a single gyre flows around Antarctica. These gyres have followed the same routes for millennia, guided by the topography of the land, the wind direction, and the Coriolis effect. The surface currents flow in a clockwise direction in the Northern Hemisphere and anticlockwise in the Southern Hemisphere. The water moving away from the equator is warm, while that flowing towards it has lost most of its heat. These currents tend to moderate the Earth's climate, cooling the equatorial region, and warming regions at higher latitudes.[63] Global climate and weather forecasts are powerfully affected by the world ocean, so global climate modelling makes use of ocean circulation models as well as models of other major components such as the atmosphere, land surfaces, aerosols, and sea ice.[64] Ocean models make use of a branch of physics, geophysical fluid dynamics, that describes the large-scale flow of fluids such as seawater.[65]",
				"after": "Surface currents only affect the top few hundred meters (yards) of the sea, but there are also large-scale flows in the ocean depths caused by the movement of deep water masses. A main deep ocean current flows through all the world's oceans and is known as the thermohaline circulation or global conveyor belt. This movement is slow and is driven by differences in density of the water caused by variations in salinity and temperature.[66] At high latitudes, the water is chilled by the low atmospheric temperature and becomes saltier as sea ice crystallizes out. Both these factors make it denser and the water sinks. From the deep sea near Greenland, such water flows southwards between the continental landmasses on either side of the Atlantic. When it reaches the Antarctic, it is joined by further masses of cold, sinking water and flows eastwards. It then splits into two streams that move northwards into the Indian and Pacific Oceans. Here it is gradually warmed, becomes less dense, rises towards the surface, and loops back on itself. Some flows back into the Atlantic. It takes a thousand years for this circulation pattern to be completed.[63]",
			"color": "peach|0.61487 puff|0.61487 light|0.093316 gray|0.093316 light|0.093316 grey|0.093316 gainsboro|0.080007 lavender|0.038858 white|0.030491 smoke|0.030491 alice|0.029397 blue|0.029397 ghost|0.025794 white|0.025794 silver|0.021474 misty|0.011138 rose|0.011138 dark|0.010807 gray|0.010807 dark|0.010807 grey|0.010807 dark|0.0101 salmon|0.0101 bisque|0.0074028 dim|0.0055831 gray|0.0055831 dim|0.0055831 grey|0.0055831  "
		}
	}
}
