{
	"add": {
		"doc": {
			"id": "50925650275daa267bc74bc999a5d74c5cf87bb12ba7dbe0ee3cdec77ce58abc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/NeverlandRides.jpg/220px-NeverlandRides.jpg",
				"previous": "In September 2007, Jackson was reportedly still working with will.i.am, but the album was apparently never completed.[242] However, in 2008, Jackson and Sony released Thriller 25 to mark the 25th anniversary of the original Thriller. This album featured the previously unreleased song \"For All Time\" (an outtake from the original sessions) as well as remixes, where Jackson collaborated with younger artists who had been inspired by his work.[243] Two of the remixes were released as singles with only modest success: \"The Girl Is Mine 2008\" (with will.i.am) and \"Wanna Be Startin' Somethin' 2008\" (with Akon). The first single was based on an early demo version, without Paul McCartney. The album itself was a hit, however.[243][244][245][246] In anticipation of Jackson's 50th birthday, Sony BMG released a series of greatest-hits albums called King of Pop. Slightly different versions were released in various countries, based on polls of local fans.[247] King of Pop reached the top 10 in most countries where it was issued, and also sold well as an import in other countries (such as the United States.)[248][249]",
				"after": "In late 2008, Fortress Investments threatened to foreclose on Neverland Ranch, which Jackson used as collateral for loans running into many tens of millions of dollars. However, Fortress opted to sell Jackson's debts to Colony Capital LLC. In November, Jackson transferred Neverland Ranch's title to Sycamore Valley Ranch Company LLC, which was a joint venture between Jackson and Colony Capital LLC. This deal cleared Jackson's debt, and he reportedly even gained an extra $35 million from the venture. At the time of his death, Jackson still owned a stake in Neverland/Sycamore Valley, but it was not announced how large that stake was.[250][251][252] In September 2008, Jackson entered negotiations with Julien's Auction House to display and auction a large collection of memorabilia amounting to approximately 1,390 lots. The auction was scheduled to take place between April 22 and 25.[253] An exhibition of the lots opened as scheduled on April 14, but the actual auction was eventually cancelled at Jackson's request.[254]",
			"color": "black|0.29315 silver|0.11517 light|0.088144 gray|0.088144 light|0.088144 grey|0.088144 dark|0.082493 gray|0.082493 dark|0.082493 grey|0.082493 dim|0.074987 gray|0.074987 dim|0.074987 grey|0.074987 gainsboro|0.057891 gray|0.056973 grey|0.056973 tan|0.038224 linen|0.020984 antique|0.020716 white|0.020716 sea|0.013585 shell|0.013585 old|0.013047 lace|0.013047 white|0.011666 smoke|0.011666 floral|0.011168 white|0.011168 beige|0.0090549 snow|0.0074411  "
		}
	}
}
