{
	"add": {
		"doc": {
			"id": "50a612e90f7407659e011d0ede977d7158120ed7222a855f13fe97cf5109955d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Pas-de-Quatre.jpg/220px-Pas-de-Quatre.jpg",
				"previous": "Lumley engaged Michael Balfe to conduct the orchestra[39] and entered negotiations with Felix Mendelssohn for a new opera. Jenny Lind had made her English début on 4 May 1847 in the role of Alice in Giacomo Meyerbeer's Robert le Diable, in the presence of the Royal family and the composer Felix Mendelssohn. Such was the press of people around the theatre that many \"arrived at last with dresses crushed and torn, and coats hanging in shreds, having suffered bruises and blows in the struggle\".[40] She performed for a number of acclaimed seasons at the theatre, interspersed with national tours, becoming known as the Swedish Nightingale.[40] The secession of the orchestra to Covent Garden was a blow, and the theatre closed in 1852, re-opening in 1856, when a fire closed its rival.[5] After the reopening, Lumley presented two more British premières of Verdi operas: La traviata in 1856 and Luisa Miller in 1858.[37]",
				"after": "From the early 1830s until the late 1840s, Her Majesty's Theatre played host to the heyday of the era of the romantic ballet, in which the ballet company, known as the Ballet of Her Majesty's Theatre, was the most renowned troupe in Europe aside from the Ballet du Théâtre de l'Académie Royale de Musique. The great ballet master Jules Perrot began staging ballet at the theatre in 1830. Lumley engaged him as Premier Maître de Ballet (chief choreographer) to the theatre in 1842.[41] Among the works of ballet that he staged were Ondine, ou La Naïade (1843), La Esmeralda (1844), and Catarina, ou La Fille du Bandit (1846), as well as the celebrated divertissement Pas de Quatre (1845). Other ballet masters created works for the ballet of Her Majesty's Theatre throughout the period of the romantic ballet, most notably Paul Taglioni (son of Filippo Taglioni), who staged ballets including Coralia, ou Le Chevalier inconstant (1847) and Electra (1849, the first production of a ballet to make use of electric lighting).[41] Arthur Saint-Léon staged such works as La Vivandière (1844), Le Violin du Diable (1849), and Le Jugement de Pâris (1850), which was considered a sequel of sorts to Pas de Quatre.[41]",
			"color": "black|0.31083 dim|0.27798 gray|0.27798 dim|0.27798 grey|0.27798 gray|0.23357 grey|0.23357 dark|0.10213 gray|0.10213 dark|0.10213 grey|0.10213 silver|0.024867 slate|0.012433 gray|0.012433 light|0.0083481 gray|0.0083481 light|0.0083481 grey|0.0083481 gainsboro|0.0069469  "
		}
	}
}
