{
	"add": {
		"doc": {
			"id": "50a7c9fc20084a6f1def973cee52b6b36f09fc755c094c00fe2c949b704fcfa9",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/8/81/Bihydoxide.png/150px-Bihydoxide.png",
				"previous": "has a value close to 10−14 at 25 °C, so the concentration of hydroxide ions in pure water is close to 10−7 mol∙dm−3, in order to satisfy the equal charge constraint. The pH of a solution is equal to the decimal cologarithm of the hydrogen cation concentration;[note 2] the pH of pure water is close to 7 at ambient temperatures. The concentration of hydroxide ions can be expressed in terms of pOH, which is close to 14 − pH,[note 3] so pOH of pure water is also close to 7. Addition of a base to water will reduce the hydrogen cation concentration and therefore increase the hydroxide ion concentration (increase pH, decrease pOH) even if the base does not itself contain hydroxide. For example, ammonia solutions have a pH greater than 7 due to the reaction NH3 + H+ NH4+, which results in a decrease in hydrogen cation concentration and an increase in hydroxide ion concentration. pOH can be kept at a nearly constant value with various buffer solutions.",
				"after": "In aqueous solution[3] the hydroxide ion is a base in the Brønsted–Lowry sense as it can accept a proton[note 4] from a Brønsted–Lowry acid to form a water molecule. It can also act as a Lewis base by donating a pair of electrons to a Lewis acid. In aqueous solution both hydrogen and hydroxide ions are strongly solvated, with hydrogen bonds between oxygen and hydrogen atoms. Indeed, the bihydroxide ion H3O2− has been characterized in the solid state. This compound is centrosymmetric and has a very short hydrogen bond (114.5 pm) that is similar to the length in the bifluoride ion HF2− (114 pm).[2] In aqueous solution the hydroxide ion forms strong hydrogen bonds with water molecules. A consequence of this is that concentrated solutions of sodium hydroxide have high viscosity due to the formation of an extended network of hydrogen bonds as in hydrogen fluoride solutions.",
			"color": " "
		}
	}
}
