{
	"add": {
		"doc": {
			"id": "50b7d396bdf643c481197c76a58fd48a15eee44c044d8992a872e50b11d5e669",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Ceskoslovenske_Aerolinie_Tu-134A_OK-EFK.jpg/220px-Ceskoslovenske_Aerolinie_Tu-134A_OK-EFK.jpg",
				"previous": "In 1950, CSA became the world's first victim of a triple hijacking. The three Czechoslovak airliners flown to the American air base in Erding, near Munich, stirred the world on both sides of the \"burnt through\" Iron Curtain and the case intensified the Cold war between East and West overnight. Three Douglas Dakota airliners landed in the morning of 24 March near Munich instead of at Prague. The first one, from Brno, at 08:20, the second one from Moravská Ostrava at 08:40 and the third one from Bratislava at 09:20. Two thirds of the people on board were involuntary passengers who later returned to Czechoslovakia. The Czechoslovak communist government commissioned a 'flight to freedom' book, stage play and film (all bearing the name \"Kidnap to Erding\") which celebrated the kidnapped returnees as heroes who had not allowed themselves to be swayed by promises of capitalist opulence. The non returnees who requested political asylum in the American zone of West Germany were, on the other hand, proclaimed criminals and the Prague regime vigorously requested their extradition – although in vain. The pilot from Brno was Josef Klesnil,[7] a former Royal Air Force pilot with 311 squadron, who flew from Brno to Erding with a pistol at his head.[8]",
				"after": "In 1957 CSA became the third of the world's airlines to fly jet services, taking delivery/putting in service the first Tupolev Tu-104A in 1957. CSA was the only airline other than Aeroflot to operate the Tu-104 which was the world's first successful jet airliner. The service operated by the Tu-104A from 1957 between Prague and Moscow was the first jet-only connection (other airlines used both jets and piston/turboprop aircraft simultaneously).[4] The first transatlantic services started on 3 February 1962 with a flight to Havana,[5] using a Bristol Britannia turboprop leased from Cubana de Aviación. CSA's transatlantic flights were code-shared with Cubana's own services to Prague, and Cubana's crews provided initial training and assistance in the operation of the Britannias.",
			"color": "light|0.19146 slate|0.19146 gray|0.19146 black|0.12292 dark|0.048582 gray|0.048582 dark|0.048582 grey|0.048582 silver|0.036202 gray|0.032977 grey|0.032977 tan|0.03178 light|0.031565 gray|0.031565 light|0.031565 grey|0.031565 slate|0.028899 gray|0.028899 gainsboro|0.024658 antique|0.02134 white|0.02134 floral|0.01935 white|0.01935 sea|0.019072 shell|0.019072 white|0.018847 smoke|0.018847 linen|0.018729 firebrick|0.017464 snow|0.016916 old|0.016081 lace|0.016081 dark|0.015873 salmon|0.015873 white|0.015303 peach|0.014706 puff|0.014706 mint|0.014414 cream|0.014414 dark|0.013916 red|0.013916 papaya|0.013739 whip|0.013739 ghost|0.013012 white|0.013012 ivory|0.012514 alice|0.012169 blue|0.012169 blanched|0.012136 almond|0.012136 beige|0.01207 bisque|0.011741 brown|0.011332 sienna|0.011283 lavender|0.011272 blush|0.011272 corn|0.010053 silk|0.010053 azure|0.0095656 maroon|0.0092593 misty|0.0091991 rose|0.0091991  "
		}
	}
}
