{
	"add": {
		"doc": {
			"id": "50c19a5c42e7bf3f113050d72a6bb20d034768cb8a6fa60db255e523c83bc1a3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Vultur_gryphus_MWNH_0718.JPG/220px-Vultur_gryphus_MWNH_0718.JPG",
				"previous": "The Andean condor is a scavenger, feeding mainly on carrion.[35] Wild condors inhabit large territories, often traveling more than 200 km (120 mi) a day in search of carrion.[24] In inland areas, they prefer large carcasses. Naturally, they feed on the largest carcasses available, which can include llamas (Lama glama), alpacas (Vicugna pacos), rheas (Rhea ssp.), guanacos (Lama guanicoe), deer and armadillos. However, most inland condors now live largely off of domestic animals, which are now more widespread in South America, such as cattle (Bos primigenius taurus), horses (Equus ferus caballus), donkeys (Equus africanus asinus), mules, sheep (Ovis aries), pigs (Sus scrofa domesticus), goats (Capra aegagrus hircus) and dogs (Canis lupus familiaris). They also feed on the carcasses of introduced game species such as wild boars (Sus scrofa), rabbits (Oryctolagus cuniculus), foxes (Vulpes vulpes) and red deer (Cervus elaphus). For condors who live around the coast, the diet consists mainly of beached carcasses of marine mammals, largely cetaceans.[28][39] They will also raid the nests of smaller birds to feed on the eggs.[40] Andean condors have been observed to do some hunting of small, live animals, such as rodents, birds and rabbits, which (given their lack of powerful, grasping feet or developed hunting technique) they usually kill by jabbing repeatedly with their bill.[39] Coastal areas provide a constant food supply, and in particularly plentiful areas, some Andean condors limit their foraging area to several kilometers of beach-front land.[33] They locate carrion by spotting it or by following other scavengers, such as corvids or other vultures.[41] It may follow New World vultures of the genus Cathartes—the turkey vulture (C. aura), the lesser yellow-headed vulture (C. burrovianus), and the greater yellow-headed vulture (C. melambrotus)—to carcasses. The Cathartes vultures forage by smell, detecting the scent of ethyl mercaptan, a gas produced by the beginnings of decay in dead animals. These smaller vultures cannot rip through the tougher hides of these larger animals with the efficiency of the larger condor, and their interactions are often an example of mutual dependence between species.[42] Black vultures (Coragyps atratus), king vultures (Sarcoramphus papa) and even mammalian scavengers may sometimes track Cathartes vultures for carcasses but the condor is invariably dominant among the scavengers in its range.[43][44] Andean condors are intermittent eaters in the wild, often going for a few days without eating, then gorging themselves on several pounds at once, sometimes to the point of being unable to lift off the ground. Because its feet and talons are not adapted to grasping, it must feed while on the ground.[24] Like other carrion-feeders, it plays an important role in its ecosystem by disposing of carrion which would otherwise be a breeding ground for disease.[45]",
			"after": [],
			"color": "black|0.27714 light|0.10433 gray|0.10433 light|0.10433 grey|0.10433 gainsboro|0.094029 linen|0.064083 sea|0.04856 shell|0.04856 old|0.047652 lace|0.047652 white|0.044965 smoke|0.044965 floral|0.043148 white|0.043148 antique|0.041316 white|0.041316 silver|0.036264 snow|0.033046 mint|0.026621 cream|0.026621 ivory|0.024636 white|0.021757 rosy|0.018046 brown|0.018046 misty|0.011878 rose|0.011878 dark|0.011309 gray|0.011309 dark|0.011309 grey|0.011309 azure|0.0097088 ghost|0.0087002 white|0.0087002 lavender|0.0072969 blush|0.0072969 beige|0.0066656 gray|0.0065348 grey|0.0065348 dim|0.0051809 gray|0.0051809 dim|0.0051809 grey|0.0051809 alice|0.0035808 blue|0.0035808  "
		}
	}
}
