{
	"add": {
		"doc": {
			"id": "50cabd73eb88c21e8a6d2021729f91517f70bd755d8c1a02c5ddd17c502fd128",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/EastHanSeismograph.JPG/170px-EastHanSeismograph.JPG",
				"previous": "Modern archaeology has led to the discovery of Han artwork portraying inventions which were otherwise absent in Han literary sources. As observed in Han miniature tomb models, but not in literary sources, the crank handle was used to operate the fans of winnowing machines that separated grain from chaff.[258] The odometer cart, invented during Han, measured journey lengths, using mechanical figures banging drums and gongs to indicate each distance traveled.[259] This invention is depicted in Han artwork by the 2nd century AD, yet detailed written descriptions were not offered until the 3rd century AD.[260] Modern archaeologists have also unearthed specimens of devices used during the Han dynasty, for example a pair of sliding metal calipers used by craftsmen for making minute measurements. These calipers contain inscriptions of the exact day and year they were manufactured. These tools are not mentioned in any Han literary sources.[261]",
				"after": "The waterwheel appeared in Chinese records during the Han. As mentioned by Huan Tan in about 20 AD, they were used to turn gears that lifted iron trip hammers, and were used in pounding, threshing and polishing grain.[262] However, there is no sufficient evidence for the watermill in China until about the 5th century.[263] The Nanyang Commandery Administrator Du Shi (d. 38 AD) created a waterwheel-powered reciprocator that worked the bellows for the smelting of iron.[264] Waterwheels were also used to power chain pumps that lifted water to raised irrigation ditches. The chain pump was first mentioned in China by the philosopher Wang Chong in his 1st-century-AD Balanced Discourse.[265]",
			"color": "black|0.31641 dim|0.19886 gray|0.19886 dim|0.19886 grey|0.19886 dark|0.10991 gray|0.10991 dark|0.10991 grey|0.10991 gray|0.10809 grey|0.10809 tan|0.052606 silver|0.038239 slate|0.022858 gray|0.022858 light|0.018257 slate|0.018257 gray|0.018257 light|0.014863 gray|0.014863 light|0.014863 grey|0.014863 antique|0.01226 white|0.01226  "
		}
	}
}
