{
	"add": {
		"doc": {
			"id": "50f397d05f75063edbab7a81c03ae2fb0e6a534adf03456d47a0c63b71ca398c",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/c/cb/Ucrscilibr.jpg/220px-Ucrscilibr.jpg",
			"previous": [],
				"after": "Total library collections at UCR comprise more than 2 million volumes, 14,017 electronic journals, 23,000 serial subscriptions, and 1.7 million microformats.[78] Two large, four-story libraries house most of the physical collections. The 179,595 ft (54,741 m) Rivera library was constructed in 1954 and named after Tomás Rivera in 1985. It seats a capacity of 956 and houses general humanities and social science collections, as well as special collections, including the world's largest collection of science fiction, horror and fantasy literature, the 110,000-volume Eaton Collection.[79] The Rivera Library also hosts the only U.S. Patent and Trademark Depository based on a UC campus.[80] The 125,752 ft (38,329 m) Raymond L. Orbach Science Library, built in 1998, seats a capacity of 1,360 and houses 533,000 volumes in the physical, natural, agricultural, biomedical, engineering and computer sciences, with special strengths in the areas of citrus and sub-tropical horticulture, entomology, and arid lands agriculture.[81] On November 3, 2009, the Science library was officially renamed the Raymond L. Orbach Science Library in honor of former Chancellor Raymond L. Orbach. Smaller libraries include the Media and Cultural Library, the Music Library, and a branch digital library in Palm Desert.[82] The UCR Library is one of 116 members of the Association of Research Libraries, and is ranked 93rd in this group.[78]",
			"color": "black|0.43255 burly|0.1316 wood|0.1316 dim|0.12018 gray|0.12018 dim|0.12018 grey|0.12018 dark|0.068805 olive|0.068805 green|0.068805 gray|0.048979 grey|0.048979 tan|0.048601 dark|0.024544 gray|0.024544 dark|0.024544 grey|0.024544 slate|0.023811 gray|0.023811 peach|0.021475 puff|0.021475 navajo|0.016982 white|0.016982 light|0.010222 slate|0.010222 gray|0.010222  "
		}
	}
}
