{
	"add": {
		"doc": {
			"id": "50f6427ad92b0700b6485fed83aebb9b6691a6664ed581adb060b1ffa7e66a8c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Tonan_Maru_no._2_%281937%29.jpg/220px-Tonan_Maru_no._2_%281937%29.jpg",
				"previous": "Humans in East Asia were consuming large amounts of freshwater fish around 40 000 years ago.[174] Spearfishing with barbed harpoons along the coast was widespread by the Palaeolithic.[175] Fish ponds surrounded Sumerian temples by 2 500 BC and a Chinese classical text credited to the 5th-century BC businessman Fan Li[176] is the earliest known work on fish farming.[177] A surviving fragment of Isidore of Charax's 1st-century Parthian itinerary describes locals freediving for pearls in the Persian Gulf,[178] and Oppian's 2nd-century Halieutics relates the four main Greek and Roman fishing methods as hook-and-line, netting, passive traps, and trident.[179] Traditional fishing boats operate in near-shore waters but, during the late Middle Ages and early Modern period, fishing on the open sea—particularly cod—became important to the economic and naval development of Northern Europe, New England, and Canada.[180] Overfishing along the coasts of the North Sea spurred the development of deep-sea fishers such as the Brixham[181] and otter trawlers, which might serve as motherships for longlining dories;[182] in the 19th century, advances such as rail transport, canning, and refrigeration allowed fishing to become a full-fledged industry. Improvements in sonar during the world wars were adapted as fishfinders and, during the 1950s, great factory ships caught and processed as many fish in an hour as earlier trawlers had in a season.[182] By the 1960s, the North Atlantic and North Pacific fisheries were close to maximal exploitation. After the catch from wild marine fisheries grew from 18 million metric tons (20 million tons) in 1950 to around 85 million metric tons (93 1⁄2 million tons) by the late 1980s, it has remained essentially constant since.[183][i] Chinese economic reform led to massive growth of its fishing production, from 7% of the world total in 1961 to 35% by 2010.[183] Scientific studies of population dynamics and nationalization of formerly shared waters are both helping to cope with overexploitation but the success of modern commercial fishing has required major corrective actions: the collapse of the Grand Banks cod fishery to less than 1% of its historic levels required a complete moratorium by Canada in 1992[184] and China has enforced a zero-growth policy in its wild catch since 2000, redirecting its industry towards aquaculture;[185] its annual months-long bans on fishing in disputed areas of the South China Sea is enforced over the protest of neighboring states.[186]",
				"after": "As of 2006, there were an estimated 43.5 million people involved in capturing or raising seafood, 85.5% of whom lived in Asia. About  3⁄4 were fishers and the remainder fish farmers.[188] In 2012, total global production of fish, crustaceans, molluscs, and other aquatic animals was a record 158 million metric tons (174 million tons), of which 91.3 million metric tons (100 million tons) were caught in the wild.[189] This is also a record if ignoring the Peruvian anchovy,[189] whose population can vary dramatically with the El Niño cycle.[190][191] The overall trend remains increasing, but due to expanding aquaculture in inland waters and mariculture in the sea rather than higher catches in the wild. The exclusive economic zones around coastal countries under the UNCLOS regime have permitted states to institute quota and other management systems[192] over the most productive regions of the sea, accounting for around 87% of the annual harvest.[193] The results are sometimes dramatic—the lull in fishing over the course of the First World War saw the North Sea's 1919 catch double 1913's[182]—and sometimes much less so: two decades on, the levels of cod in the Grand Banks remain only 10% of their peak. At present, the species most frequently landed are herring, cod, anchovy, tuna, flounder, mullet, squid, and salmon. A number of these, as well as large predatory fish,[194] remain well below historical levels.[195]",
			"color": "dim|0.3052 gray|0.3052 dim|0.3052 grey|0.3052 gray|0.25806 grey|0.25806 dark|0.17817 gray|0.17817 dark|0.17817 grey|0.17817 silver|0.078047 black|0.074534 light|0.03828 gray|0.03828 light|0.03828 grey|0.03828 gainsboro|0.025102 slate|0.018713 gray|0.018713  "
		}
	}
}
