{
	"add": {
		"doc": {
			"id": "50ff92131b9f3c2671509c564b9a8355b630edeb370fbfb8b93524711a1a7837",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/IPad_2_Smart_Cover_at_unveiling_crop.jpg/220px-IPad_2_Smart_Cover_at_unveiling_crop.jpg",
				"previous": "Apple sells a camera connection kit that consists of two separate adapters for the dock connector, one to USB Type A, the other an SD card reader. Adapter can be used to transfer photos and videos and to plug USB audio card or MIDI keyboard.[86] A third party sells an adapter that includes USB, SD, and microSD on a single unit.[87] An adapter to VGA connectors allows the iPad to work with external monitors and projectors. Another adapter mirrors the screen onto HDMI compatible devices in 1080p and works with all apps and rotations. Unlike other adapters, it allows the iPad to charge through another dock connector.[88] While the HDMI adapter was released with and advertised for the iPad 2, it also works with the first-generation iPad, the iPhone 4, and the fourth generation iPod Touch.[89]",
				"after": "Smart Covers are screen protectors that magnetically attach and align to the face of the iPad 2, 3, or 4. The cover has three folds which allow it to convert into a stand, which is also held together by magnets.[90] While original iPad owners could purchase a black case that included a similarly folding cover, the Smart Cover is meant to be more minimal, easily detachable, and protects only the screen. Smart Covers have a microfiber bottom that cleans the front of the iPad, which wakes up when the cover is removed. There are five different colors of both polyurethane and leather, with leather being more expensive. Smart Covers are not compatible with the original iPad.[91] In June 2012, Apple started selling the Smart Case - a case with the combined function of a smart cover and a back protection case which is compatible with the iPad 2, and iPad 3rd & 4th generation devices.[92]",
			"color": "black|0.2686 burly|0.24799 wood|0.24799 tan|0.14398 navajo|0.075228 white|0.075228 moccasin|0.056512 wheat|0.053943 peach|0.015685 puff|0.015685 rosy|0.012775 brown|0.012775 dark|0.0079385 slate|0.0079385 gray|0.0079385 antique|0.0073314 white|0.0073314 bisque|0.0068038 dim|0.0067854 gray|0.0067854 dim|0.0067854 grey|0.0067854  "
		}
	}
}
