{
	"add": {
		"doc": {
			"id": "510672e86ce9eea30d20f12e50a1c18fdf4637468fa0e735b75bfbc290ea46ea",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/GolGumbaz2.jpg/190px-GolGumbaz2.jpg",
				"previous": "By virtue of its varied geography and long history, Karnataka hosts numerous spots of interest for tourists. There is an array of ancient sculptured temples, modern cities, scenic hill ranges, unexplored forests and endless beaches. Karnataka has been ranked as the fourth most popular destination for tourism among the states of India.[133] Karnataka has the second highest number of nationally protected monuments in India, second only to Uttar Pradesh,[134] in addition to 752 monuments protected by the State Directorate of Archaeology and Museums. Another 25,000 monuments are yet to receive protection.[135][136]",
				"after": "The districts of the Western Ghats and the southern districts of the state have popular eco-tourism locations including Kudremukh, Madikeri and Agumbe. Karnataka has 25 wildlife sanctuaries and five national parks. Popular among them are Bandipur National Park, Bannerghatta National Park and Nagarhole National Park. The ruins of the Vijayanagara Empire at Hampi and the monuments of Pattadakal are on the list of UNESCO's World Heritage Sites. The cave temples at Badami and the rock-cut temples at Aihole representing the Badami Chalukyan style of architecture are also popular tourist destinations. The Hoysala temples at Belur and Halebidu, which were built with Chloritic schist (soapstone) are proposed UNESCO World Heritage sites.[137] The Gol Gumbaz and Ibrahim Rauza are famous examples of the Deccan Sultanate style of architecture. The monolith of Gomateshwara Bahubali at Shravanabelagola is the tallest sculpted monolith in the world, attracting tens of thousands of pilgrims during the Mahamastakabhisheka festival.[138]",
			"color": "dim|0.30452 gray|0.30452 dim|0.30452 grey|0.30452 black|0.10162 tan|0.08497 gray|0.075273 grey|0.075273 dark|0.064679 khaki|0.064679 antique|0.041576 white|0.041576 bisque|0.035569 dark|0.032834 gray|0.032834 dark|0.032834 grey|0.032834 blanched|0.031966 almond|0.031966 papaya|0.031023 whip|0.031023  "
		}
	}
}
