{
	"add": {
		"doc": {
			"id": "511000fd8c8fabe6d528b231858da79fb0a072109904807c5ac70dd08c420481",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Rochester_Castle_keep_plan.JPG/220px-Rochester_Castle_keep_plan.JPG",
				"previous": "The castle built by Bishop Gundulf in the late 12th century was enclosed by a stone wall. Situated in the south-west corner of the city, the castle used the remains of the Roman town walls as foundations. The circuit had at least one tower; it was replaced in the 14th century. The original gateway was radically altered in the 13th or 14th century.[67] From across the River Medway, the twin landmarks of Rochester's castle and cathedral would have dominated the medieval landscape, symbolic of the authority of the church and nobility in the period.[68] Most castles were built by secular nobles, but the work by Gundulf and his successor Corbeil provide examples of the role of the church in castle building.[69]",
				"after": "According to military historian Allen Brown Rochester's keep is \"among the finest and oldest in all England\".[70] Since its construction it underwent limited alteration, aside from the rebuilding of one corner, and although now in a state of ruin it remains significantly intact and is considered one of the most important surviving 12th-century keeps in England and France.[71] The keep was richly decorated with hangings and furnishings.[72] Dating from the second quarter of the 12th century, it is Rochester Castle's dominant feature. It had a square plan, and measures 70 by 70 feet (21 by 21 m) externally with pilaster buttresses at each corner. The keep was built in the castle's southern corner, close to the curtain wall. The primary building material was local Kentish Ragstone, although Caen stone used to face the keep was imported from Normandy.[73] The same material was imported for the Tower of London's White Tower in the 11th century.[74] The tops of the turrets rise 125 feet (38 m) above the ground, 12 ft above the battlements. Below the latter are rectangular holes, marking where wooden hoarding would have been attached. Though 12 ft thick at the base, the walls of the keep taper to 10 ft at the top.[75] It is the tallest keep in England, and only those at Dover, the Tower of London, Colchester, and Norwich are larger.[71] During John's siege of Rochester in 1215, the south-east corner collapsed; during Henry III's reign it was rebuilt as a cylinder. The windows increase in size higher up the walls, although only the uppermost were decorated.[76] A spiral staircase in the north-east corner provided access to all floors, and another in the south-west corner went from the first floor to the top floor.[77] The north-west corner tower contains small chambers, and the south-east probably had a similar layout before it was rebuilt.[14]",
			"color": "black|0.63442 dim|0.095517 gray|0.095517 dim|0.095517 grey|0.095517 dark|0.091698 gray|0.091698 dark|0.091698 grey|0.091698 gray|0.086781 grey|0.086781 silver|0.042635 light|0.0175 gray|0.0175 light|0.0175 grey|0.0175 gainsboro|0.010835  "
		}
	}
}
