{
	"add": {
		"doc": {
			"id": "5128635192d7270a755b1f39e4d104122377d1c7b5ed0598e88817ee1522f122",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Rolls-Royce_Merlin.jpg/187px-Rolls-Royce_Merlin.jpg",
				"previous": "Portal:Technology/Selected articles/20",
				"after": "The Rolls-Royce Merlin is a British, liquid-cooled, 27-litre (1,650 cu in) capacity, V-12 piston aero engine, designed and built by Rolls-Royce Limited. Initially known as the PV-12, Rolls-Royce named the engine the Merlin following the company convention of naming its piston aero engines after birds of prey. The PV-12 first ran in 1933, and a series of rapidly applied developments brought about by wartime needs improved the engine's performance markedly. The first operational aircraft to enter service using the Merlin were the Fairey Battle, Hawker Hurricane and Supermarine Spitfire. More Merlins were made for the four-engined Avro Lancaster heavy bomber than any other aircraft; however, the engine is most closely associated with the Spitfire and powered its maiden flight in 1936. Considered a British icon, the Merlin was one of the most successful aircraft engines of the World War II era, and many variants were built by Rolls-Royce in Derby, Crewe and Glasgow, as well as by Ford of Britain in Trafford Park, Manchester. The Packard V-1650 was a version of the Merlin built in the United States. Production ceased in 1950 after a total of almost 150,000 engines had been delivered, the later variants being used for airliners and military transport aircraft. In military use the Merlin was superseded by its larger capacity stablemate, the Rolls-Royce Griffon. Merlin engines remain in Royal Air Force service today with the Battle of Britain Memorial Flight, and power many restored aircraft in private ownership worldwide.",
			"color": "black|0.4411 dim|0.16191 gray|0.16191 dim|0.16191 grey|0.16191 gray|0.10648 grey|0.10648 dark|0.064115 gray|0.064115 dark|0.064115 grey|0.064115 silver|0.027962 slate|0.01777 gray|0.01777 light|0.016369 gray|0.016369 light|0.016369 grey|0.016369 light|0.011901 slate|0.011901 gray|0.011901 gainsboro|0.011582 chocolate|0.0091752 peru|0.0076254 linen|0.0070243 tan|0.0068872 pale|0.006688 golden|0.006688 rod|0.006688 antique|0.0066801 white|0.0066801 saddle|0.0063483 brown|0.0063483 old|0.0059445 lace|0.0059445  "
		}
	}
}
