{
	"add": {
		"doc": {
			"id": "516727cf714862af67e2793c76d50ec6ff23f0aaec013ae56a386571dfb01774",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Old_Faithful_Geyser_Yellowstone_National_Park.jpg/120px-Old_Faithful_Geyser_Yellowstone_National_Park.jpg",
				"previous": "Portal:Geography/Featured article/2",
				"after": "Yellowstone National Park is a national park located in the U.S. states of Wyoming, Montana, and Idaho. Yellowstone, widely held to be the first national park in the world, was established in 1872 by the United States Congress and is known for its wildlife and its many geothermal features, especially Old Faithful Geyser, one of the most popular features in the park. It has many types of ecosystems, but the subalpine forest is dominant. Yellowstone National Park spans an area of 3,468.4 square miles (8,983 km2), comprising lakes, canyons, rivers, and mountain ranges. Yellowstone Lake is one of the largest high-altitude lakes in North America and is centered over the Yellowstone Caldera, the largest supervolcano on the continent. The caldera is considered an active volcano. It has erupted with tremendous force several times in the last two million years. Half of the world's geothermal features are in Yellowstone, fueled by this ongoing volcanism. Hundreds of species of mammals, birds, fish and reptiles have been documented, including several that are either endangered or threatened. The vast forests and grasslands also include unique species of plants. Yellowstone Park is the largest and most famous megafauna location in the continental United States.",
			"color": "dark|0.18867 gray|0.18867 dark|0.18867 grey|0.18867 silver|0.15732 light|0.1272 gray|0.1272 light|0.1272 grey|0.1272 gray|0.10918 grey|0.10918 gainsboro|0.098124 lavender|0.06533 dim|0.06391 gray|0.06391 dim|0.06391 grey|0.06391 black|0.036386 lavender|0.026841 blush|0.026841 ghost|0.019902 white|0.019902 alice|0.016562 blue|0.016562 white|0.015801 smoke|0.015801 thistle|0.012739 light|0.010212 steel|0.010212 blue|0.010212 rosy|0.0088498 brown|0.0088498 misty|0.0088335 rose|0.0088335 snow|0.0084639  "
		}
	}
}
