{
	"add": {
		"doc": {
			"id": "516f74acecfd6b5b085ab775f1824cd28c8ca7ce25d165964b2ba14365b7b5c7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Saint-Gaudens_Inaugural_medal_reverse_cutout.jpg/170px-Saint-Gaudens_Inaugural_medal_reverse_cutout.jpg",
				"previous": "In 1905, Mint Engraver Charles E. Barber engraved the obverse of Roosevelt's inauguration medal, while his assistant, George T. Morgan, engraved the reverse. Roosevelt disliked the work, and engaged Saint-Gaudens to design an unofficial medal commemorating the inauguration.[5] Saint-Gaudens foresaw resistance from Barber on the question of the new coinage; he wrote to his brother, Louis Saint-Gaudens, \"Barber is a S.O.A.B. [son of a bitch] but I had a talk with the President who ordered Secretary Shaw in my presence to cut Barber's head off if he didn't do our bidding\".[6]",
				"after": "Roosevelt was impressed by some models Saint-Gaudens had prepared for the cent showing a head of Liberty. In early 1907, he wrote to Saint-Gaudens proposing that a Native American or Indian headdress be added to the obverse of the cent: \"I feel very strongly that on at least one coin we ought to have the Indian feather headdress. It is distinctly American, and very picturesque. Couldn't you have just such a head as you have now, but with the feather headdress?\"[7] Numismatic historian Walter Breen described this as \"the absurd addition of a feathered warbonnet, such as neither Ms. Liberty nor any Native American woman would ever have worn\".[8] Art historian Cornelius Vermeule stated that the Indian Head eagle \"missed being a great coin because Roosevelt interfered with the choice of headdress (or no headdress) for Liberty\".[9]",
			"color": "black|0.23848 dark|0.10807 gray|0.10807 dark|0.10807 grey|0.10807 silver|0.10411 antique|0.066941 white|0.066941 gray|0.061409 grey|0.061409 dim|0.060836 gray|0.060836 dim|0.060836 grey|0.060836 light|0.054724 gray|0.054724 light|0.054724 grey|0.054724 tan|0.05239  "
		}
	}
}
