{
	"add": {
		"doc": {
			"id": "5180c25762c441d875621243c2ed335d082c857648ee1ce13d5c184d19bad258",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/British_Battlecruiser_HMS_Hood_circa_1932.jpg/220px-British_Battlecruiser_HMS_Hood_circa_1932.jpg",
				"previous": "In the inter-war period, the Royal Navy was stripped of much of its power. The Washington and London Naval Treaties imposed the scrapping of some capital ships and limitations on new construction. In 1932, the Invergordon Mutiny took place over a proposed 25% pay cut, which was eventually reduced to 10%. International tensions increased in the mid-1930s and the Second London Naval Treaty of 1935 failed to halt the development of a naval arms race. By 1938, treaty limits were effectively being ignored. The re-armament of the Royal Navy was well under way by this point; the Royal Navy had begun construction of the still treaty affected and undergunned new battleships and its first full-sized purpose-built aircraft carriers. In addition to new construction, several existing old battleships (whose gun power offset to a significant extent the weakly armed new battleships), battlecruisers and heavy cruisers were reconstructed, and anti-aircraft weaponry reinforced, while new technologies, such as ASDIC, Huff-Duff and hydrophones, were developed. The Navy had lost control of naval aviation when the Royal Naval Air Service was merged with the Royal Flying Corps to form the Royal Air Force in 1918, but regained control of ship-board aircraft with the return of the Fleet Air Arm to Naval control in 1937. However, the effectiveness of its aircraft lagged far behind its rivals, and around this time the Imperial Japanese Navy and the United States Navy began to surpass the Royal Navy in air power.",
				"after": "At the start of Second World War in 1939, the Royal Navy was still the largest in the world, consisting of 15 battleships and battlecruisers with five under construction, seven aircraft carriers, 66 cruisers with 23 more under construction, 184 destroyers with 52 under construction, 45 escort and patrol vessels with nine under construction and one on order, and 60 submarines with nine under construction.[59] During the early phases of the Second World War, the Royal Navy provided critical cover during British evacuations from Dunkirk. At the Battle of Taranto, Admiral Cunningham commanded a fleet that launched the first all-aircraft naval attack in history. Later, Cunningham was determined that as many Allied soldiers as possible should be evacuated after their defeat on Crete. When army generals feared he would lose too many ships, he famously said, \"It takes the Navy three years to build a new ship. It will take three hundred years to build a new tradition. The evacuation will continue.\"[60]",
			"color": " "
		}
	}
}
