{
	"add": {
		"doc": {
			"id": "518182fca4b7450a4aecdc015515e326ca39c5c1edc746ac57a87c4e69191e17",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/A_high_cross_and_round_tower_at_Monasterboice%2C_Ireland.jpg/220px-A_high_cross_and_round_tower_at_Monasterboice%2C_Ireland.jpg",
				"previous": "Ireland has a wealth of structures,[133] surviving in various states of preservation, from the Neolithic period, such as Brú na Bóinne, Poulnabrone dolmen, Castlestrange stone, Turoe stone, and Drombeg stone circle.[134] As the Romans never conquered Ireland, architecture of Greco-Roman origin is extremely rare. The country instead had an extended period of Iron Age architecture.[135] The Irish round tower originated during the Early Medieval period.",
				"after": "Christianity introduced simple monastic houses, such as Clonmacnoise, Skellig Michael and Scattery Island. A stylistic similarity has been remarked between these double monasteries and those of the Copts of Egypt.[136] Gaelic kings and aristocrats occupied ringforts or crannógs.[137] Church reforms during the 12th century via the Cistercians stimulated continental influence, with the Romanesque styled Mellifont, Boyle and Tintern abbeys.[138] Gaelic settlement had been limited to the Monastic proto-towns, such as Kells, where the current street pattern preserves the original circular settlement outline to some extent.[139] Significant urban settlements only developed following the period of Viking invasions.[137] The major Hiberno-Norse Longphorts were located on the coast, but with minor inland fluvial settlements, such as the eponymous Longford.",
			"color": "black|0.399 dim|0.32066 gray|0.32066 dim|0.32066 grey|0.32066 gray|0.18861 grey|0.18861 dark|0.035155 gray|0.035155 dark|0.035155 grey|0.035155 dark|0.012846 olive|0.012846 green|0.012846 slate|0.010781 gray|0.010781 silver|0.0086049 light|0.0079107 slate|0.0079107 gray|0.0079107 dark|0.0073856 slate|0.0073856 gray|0.0073856  "
		}
	}
}
