{
	"add": {
		"doc": {
			"id": "518d959f5f7136c6ba3a4ee379a24d8448dc8c7766ea5f71055e51961fbbb5a2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Perihelion_precession.jpg/220px-Perihelion_precession.jpg",
				"previous": "The semantic view of theories, which identifies scientific theories with models rather than propositions, has replaced the received view as the dominant position in theory formulation in the philosophy of science.[33][34][35] A model is a logical framework intended to represent reality (a \"model of reality\"), similar to the way that a map is a graphical model that represents the territory of a city or country.[36][37]",
				"after": "In this approach, theories are a specific category of models which fulfill the necessary criteria (see above). One can use language to describe a model; however, the theory is the model (or a collection of similar models), and not the description of the model. A model of the solar system, for example, might consist of abstract objects that represent the sun and the planets. These objects have associated properties, e.g., positions, velocities, and masses. The model parameters, e.g., Newton's Law of Gravitation, determine how the positions and velocities change with time. This model can then be tested to see whether it accurately predicts future observations; astronomers can verify that the positions of the model's objects over time match the actual positions of the planets. For most planets, the Newtonian model's predictions are accurate; for Mercury, it is slightly inaccurate and the model of general relativity must be used instead.",
			"color": "gray|0.189 grey|0.189 dim|0.11494 gray|0.11494 dim|0.11494 grey|0.11494 dark|0.10572 gray|0.10572 dark|0.10572 grey|0.10572 silver|0.037389 floral|0.032333 white|0.032333 sea|0.030369 shell|0.030369 linen|0.028785 ivory|0.027863 old|0.026416 lace|0.026416 white|0.02498 smoke|0.02498 mint|0.024725 cream|0.024725 snow|0.02422 white|0.022642 tan|0.019078 beige|0.018108 antique|0.018097 white|0.018097 light|0.017482 gray|0.017482 light|0.017482 grey|0.017482 burly|0.0171 wood|0.0171 corn|0.016739 silk|0.016739 navajo|0.016379 white|0.016379 wheat|0.016175 papaya|0.015337 whip|0.015337 moccasin|0.014589 blanched|0.012713 almond|0.012713 light|0.012437 yellow|0.012437 gainsboro|0.012402 ghost|0.012246 white|0.012246 honeydew|0.011554 azure|0.011535 lemon|0.010389 chiffon|0.010389 pale|0.010365 golden|0.010365 rod|0.010365 light|0.009987 golden|0.009987 rod|0.009987 yellow|0.009987 bisque|0.0081621 alice|0.0077153 blue|0.0077153 lavender|0.0060586 blush|0.0060586 brown|0.0036673  "
		}
	}
}
