{
	"add": {
		"doc": {
			"id": "51a550ffb0bbc62fc44440be308ee49f0fc68b1c678ea6cce66746bf6ba763f3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Istanbul-precipitation.png/220px-Istanbul-precipitation.png",
			"previous": [],
				"after": "According to the Köppen–Geiger classification system, Istanbul has a borderline Mediterranean climate (Csa), humid subtropical climate (Cfa) and oceanic climate (Cfb), due to its location in a transitional climatic zone. Since precipitation in summer months, ranges from 20 to 65 mm (1 to 3 in), depending on location, the city cannot be classified as solely Mediterranean or humid subtropical.[83][84][85] Due to its size, diverse topography, maritime location and most importantly having a coastline to two different bodies of water to the north and south, Istanbul exhibits microclimates. Northern half of the city, as well as the Bosporus coastline, express characteristics of oceanic and humid subtropical climates, because of humidity from the Black Sea and the relatively high concentration of vegetation. The climate in the populated areas of the city to the south, located on the Sea of Marmara, is warmer, drier and less affected by humidity.[86] The annual precipitation in the northern half can be twice as much (Bahçeköy, 1166.6 mm), than it is in the southern, Marmara coast (Florya 635.0 mm).[87] There is a significant difference between annual mean temperatures between the north and south coasts as well, Bahçeköy 12.8 °C (55.0 °F), Kartal 15.03 °C (59.05 °F).[88] Parts of the province, that are away from both seas exhibit considerable continental influences, with much more pronounced night-day and summer-winter temperature differences. In winter some regions of the province average at or below freezing at night.",
			"color": "silver|0.31335 light|0.28646 gray|0.28646 light|0.28646 grey|0.28646 gainsboro|0.204 dark|0.07678 gray|0.07678 dark|0.07678 grey|0.07678 medium|0.0094533 spring|0.0094533 green|0.0094533 green|0.0088666 yellow|0.0088666 yellow|0.0085732 aqua|0.0074866 cyan|0.0074866 deep|0.0072584 sky|0.0072584 blue|0.0072584 gold|0.0061718 light|0.0051957 steel|0.0051957 blue|0.0051957 dodger|0.004618 blue|0.004618 medium|0.0039407 aqua|0.0039407 marine|0.0039407 orange|0.0036455  "
		}
	}
}
