{
	"add": {
		"doc": {
			"id": "51af7dc56b891fefe7c5340de4f38c7f13acf15d4e73d4521ec5f854635026bd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Clay_banks.jpg/220px-Clay_banks.jpg",
				"previous": "The geographical area of modern-day Manitoba was inhabited by the First Nations people shortly after the last ice age glaciers retreated in the southwest approximately 10,000 years ago; the first exposed land was the Turtle Mountain area.[32] The Ojibwe, Cree, Dene, Sioux, Mandan, and Assiniboine peoples founded settlements, and other tribes entered the area to trade. In Northern Manitoba, quartz was mined to make arrowheads. The first farming in Manitoba was along the Red River, where corn and other seed crops were planted before contact with Europeans.[33]",
				"after": "In 1611, Henry Hudson was one of the first Europeans to sail into what is now known as Hudson Bay, where he was abandoned by his crew.[34] The first European to reach present-day central and southern Manitoba was Sir Thomas Button, who travelled upstream along the Nelson River to Lake Winnipeg in 1612 in an unsuccessful attempt to find and rescue Hudson.[35] The Nonsuch, a British ship, sailed into Hudson Bay in 1668–1669, becoming the first trading vessel to reach the area; that voyage led to the formation of the Hudson's Bay Company, which was given absolute control of the entire Hudson Bay watershed by the British government. This watershed was named Rupert's Land, after Prince Rupert, who helped to subsidize the Hudson's Bay Company.[36] York Factory was founded in 1684 after the original fort of the Hudson's Bay Company, Fort Nelson (built in 1682), was destroyed by rival French traders.[37]",
			"color": "dim|0.42262 gray|0.42262 dim|0.42262 grey|0.42262 gray|0.20913 grey|0.20913 dark|0.11287 gray|0.11287 dark|0.11287 grey|0.11287 silver|0.063121 light|0.049384 gray|0.049384 light|0.049384 grey|0.049384 gainsboro|0.038205 black|0.030104 misty|0.01454 rose|0.01454 linen|0.010179 lavender|0.0091551 blush|0.0091551 white|0.0079551 smoke|0.0079551 sea|0.0070351 shell|0.0070351 slate|0.0055029 gray|0.0055029  "
		}
	}
}
