{
	"add": {
		"doc": {
			"id": "51b2c7e226f23ce56b7220b4e66e0ba85f61990e96e01abeaf526f28b9928ccb",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/a/ac/British_fifty_pence_Scouting_coin.jpg/170px-British_fifty_pence_Scouting_coin.jpg",
				"previous": "On his return to England, Baden-Powell noticed that boys showed considerable interest in Aids to Scouting, which was unexpectedly used by teachers and youth organizations as their first Scouting handbook.[21] He was urged to rewrite this book for boys, especially during an inspection of the Boys' Brigade, a large youth movement drilled with military precision. Baden-Powell thought this would not be attractive and suggested that the Boys' Brigade could grow much larger were scouting to be used.[22] He studied other schemes, parts of which he used for Scouting.",
				"after": "In July 1906, Ernest Thompson Seton sent Baden-Powell a copy of his 1902 book The Birchbark Roll of the Woodcraft Indians.[23] Seton, a British-born Canadian-American living in the United States, met Baden-Powell in October 1906, and they shared ideas about youth training programs.[24][25] In 1907 Baden-Powell wrote a draft called Boy Patrols. In the same year, to test his ideas, he gathered 21 boys of mixed social backgrounds (from boy's schools in the London area and a section of boys from the Poole, Parkstone, Hamworthy, Bournemouth, and Winton Boys' Brigade units) and held a week-long camp in August on Brownsea Island in Poole Harbour, Dorset, England.[26] His organizational method, now known as the Patrol System and a key part of Scouting training, allowed the boys to organize themselves into small groups with an elected patrol leader.[27]",
			"color": "black|0.33824 dark|0.13823 gray|0.13823 dark|0.13823 grey|0.13823 silver|0.11106 gray|0.10305 grey|0.10305 dim|0.087513 gray|0.087513 dim|0.087513 grey|0.087513 light|0.082139 gray|0.082139 light|0.082139 grey|0.082139 gainsboro|0.061534 white|0.013353 smoke|0.013353 linen|0.0077083 sea|0.0076969 shell|0.0076969 snow|0.007203 ghost|0.0063881 white|0.0063881 alice|0.0060312 blue|0.0060312 mint|0.0059888 cream|0.0059888 white|0.0058281 floral|0.0053484 white|0.0053484 azure|0.0045577 lavender|0.0031108 blush|0.0031108  "
		}
	}
}
