{
	"add": {
		"doc": {
			"id": "51b3d10759741258e695d2c495f5641b8d8d754e4fe67be3d539319100727e24",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/MORDRED.jpg/220px-MORDRED.jpg",
			"previous": [],
				"after": "The first narrative account of Arthur's life is found in Geoffrey of Monmouth's Latin work Historia Regum Britanniae (History of the Kings of Britain).[57] This work, completed c. 1138, is an imaginative and fanciful account of British kings from the legendary Trojan exile Brutus to the 7th-century Welsh king Cadwallader. Geoffrey places Arthur in the same post-Roman period as do Historia Brittonum and Annales Cambriae. He incorporates Arthur's father, Uther Pendragon, his magician advisor Merlin, and the story of Arthur's conception, in which Uther, disguised as his enemy Gorlois by Merlin's magic, sleeps with Gorlois's wife Igerna at Tintagel, and she conceives Arthur. On Uther's death, the fifteen-year-old Arthur succeeds him as King of Britain and fights a series of battles, similar to those in the Historia Brittonum, culminating in the Battle of Bath. He then defeats the Picts and Scots before creating an Arthurian empire through his conquests of Ireland, Iceland and the Orkney Islands. After twelve years of peace, Arthur sets out to expand his empire once more, taking control of Norway, Denmark and Gaul. Gaul is still held by the Roman Empire when it is conquered, and Arthur's victory naturally leads to a further confrontation between his empire and Rome's. Arthur and his warriors, including Kaius (Kay), Beduerus (Bedivere) and Gualguanus (Gawain), defeat the Roman emperor Lucius Tiberius in Gaul but, as he prepares to march on Rome, Arthur hears that his nephew Modredus (Mordred)—whom he had left in charge of Britain—has married his wife Guenhuuara (Guinevere) and seized the throne. Arthur returns to Britain and defeats and kills Modredus on the river Camblam in Cornwall, but he is mortally wounded. He hands the crown to his kinsman Constantine and is taken to the isle of Avalon to be healed of his wounds, never to be seen again.[58]",
			"color": " "
		}
	}
}
