{
	"add": {
		"doc": {
			"id": "51b7954e5763204d468f915b9e547be1450bf6aa3eb13b6f10ca32d06140f5fc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/02ARRahman_Sydney_Concert_2010.jpg/220px-02ARRahman_Sydney_Concert_2010.jpg",
				"previous": "In 1999, Rahman partnered with choreographers Shobana and Prabhu Deva and a Tamil film-dancing troupe to perform with Michael Jackson in Munich, Germany at his Michael Jackson and Friends concert.[74] In 2002 he composed the music for his first stage production, Bombay Dreams, which was commissioned by Andrew Lloyd Webber.[75] The Finnish folk-music band Värttinä collaborated with Rahman on the Toronto production of The Lord of the Rings, and in 2004[76] he composed \"Raga's Dance\" for Vanessa-Mae's album Choreography (performed by Mae and the Royal Philharmonic Orchestra).[77]",
				"after": "Since 2004 Rahman has performed three successful world tours before audiences in Singapore, Australia, Malaysia, Dubai, the United Kingdom, Canada, the United States and India,[76][78] and has been collaborating with Karen David on her upcoming studio album. A two-disc CD, Introducing A. R. Rahman (featuring 25 of his Tamil film-score pieces), was released in May 2006[79] and his non-film album Connections was released on 12 December 2008.[80] Rahman performed at a White House state dinner arranged by US President Barack Obama during an official visit by Indian Prime Minister Manmohan Singh on 24 November 2009.[81] He is one of over 70 artists on \"We Are the World 25 for Haiti\", a charity single to raise relief funds in the wake of the 2010 Haiti earthquake.[82] In 2010, Rahman composed \"Jai Jai Garvi Gujarat\" in honour of the 50th anniversary of the formation of Gujarat State,[83] \"Semmozhiyaana Thamizh Mozhiyaam\" as part of the World Classical Tamil Conference 2010,[84] and the theme song for the 2010 Commonwealth Games, \"Jiyo Utho Bado Jeeto\".[85] Rahman began his first world tour, (A. R. Rahman Jai Ho Concert: The Journey Home World Tour) on 11 June 2010 at Nassau Coliseum in New York; 16 cities worldwide were scheduled.[86]",
			"color": "tan|0.3283 wheat|0.15393 floral|0.03901 white|0.03901 sea|0.03818 shell|0.03818 mint|0.037538 cream|0.037538 white|0.037443 smoke|0.037443 white|0.037109 snow|0.037049 azure|0.033373 ghost|0.031708 white|0.031708 alice|0.027702 blue|0.027702 bisque|0.025561 blanched|0.02095 almond|0.02095 lavender|0.020682 blush|0.020682 ivory|0.017829 linen|0.012993 papaya|0.012629 whip|0.012629 antique|0.012569 white|0.012569 old|0.0091761 lace|0.0091761 dark|0.0082763 gray|0.0082763 dark|0.0082763 grey|0.0082763 beige|0.0075398 silver|0.0068433 light|0.0066218 gray|0.0066218 light|0.0066218 grey|0.0066218 gray|0.0051179 grey|0.0051179 gainsboro|0.005089 honeydew|0.0050857 corn|0.0049546 silk|0.0049546  "
		}
	}
}
