{
	"add": {
		"doc": {
			"id": "51e0a0da120b542a9ab5e9cd822ea49911d92e8a469b9f4461ea1d0b51331557",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Cherdik_-_John_Speed.JPG/220px-Cherdik_-_John_Speed.JPG",
			"previous": [],
				"after": "According to the Anglo-Saxon Chronicle, Wessex was founded by Cerdic and Cynric, chieftains of a clan known as the Gewisse, who were said to have landed on the Hampshire coast and conquered the surrounding area, including the Isle of Wight. However, the specific events given by the Chronicle are in some doubt: archæological evidence points instead to a considerable early Anglo-Saxon presence in the upper valley of the river Thames, the Cotswolds area and from The Wash along the Icknield Way.[1] The centre of gravity of Wessex in the late 6th and early 7th century seems to have lain farther to the north than in later periods, following successful expansion to the south and west. Bede stated that the Isle of Wight was settled not by Saxons but by Jutes, who also settled on the Hampshire coast, where they were known as the Meonwara, and that these areas were only acquired by Wessex in the later 7th century. It is therefore possible that the Chronicle's account is a product of the circumstances of the 8th and 9th centuries being projected back into the past to create an origin story of the ruling kinship appropriate to the contemporary form of the kingdom.[2]",
			"color": "pale|0.15456 golden|0.15456 rod|0.15456 lemon|0.076631 chiffon|0.076631 dark|0.075215 khaki|0.075215 light|0.064803 golden|0.064803 rod|0.064803 yellow|0.064803 khaki|0.060832 wheat|0.055034 tan|0.054873 blanched|0.046565 almond|0.046565 corn|0.042628 silk|0.042628 light|0.041407 yellow|0.041407 moccasin|0.040557 papaya|0.039326 whip|0.039326 burly|0.038367 wood|0.038367 beige|0.034316 coral|0.026975 bisque|0.024909 navajo|0.022554 white|0.022554 antique|0.021454 white|0.021454 tomato|0.017273 sienna|0.0078505 old|0.0073275 lace|0.0073275 dark|0.0066046 olive|0.0066046 green|0.0066046 peach|0.0064857 puff|0.0064857 peru|0.0052377  "
		}
	}
}
