{
	"add": {
		"doc": {
			"id": "51ee813be7a8e099ad4a938c955d60719bb813ec4259fd4fa935ec798dd4172c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Oregon_Trail_postal_card.jpg/450px-Oregon_Trail_postal_card.jpg",
				"previous": "In the past, numismatic writers have described the Association and its activities harshly. Bowers states that the Oregon Trail coins \"are beautiful, but circumstances surrounding their issuance leave much to be desired\".[6] Slabaugh noted that \"Artistically, this is my favorite commemorative coin. But from an ethical standpoint, it is not.\"[46] Swiatek and Breen wrote that the Association's \"activities in exploiting coin collectors and the general public eventually led to the unpopularity of commemoratives in Congress and ultimately to adamant Treasury Department opposition to any further commemorative issues, no matter how worthy the cause to be memorialized, no matter who represented the sponsoring commissions\".[28] According to Bowers, \"as far as I know, the financial benefits which provided the reason for issuing the half dollars, 'to rescue the various important points along the old trail from oblivion,' to erect 'suitable monuments, memorial and otherwise,' etc., never came to pass, at least not from money provided by the sale of the coins.\"[c][71] These, however, did not have the benefit of examining OTMA records. Following the opening of Driggs's papers for research at Southern Utah University,[66] an October 2013 article in The Numismatist concluded that though many documents, such as the arrangements with Scott's, are missing from his records, what there is \"seems consistent with Driggs wanting to use the coins to finance the marking of the Oregon Trail, not to line his own pockets\".[64]",
				"after": "A small number of coins from each year and mint were put aside for inspection by the following year's Assay Commission, the above figures include such pieces. This accounts for the variance from the even thousand mintages in 1933 and after.[50]",
			"color": "burly|0.33651 wood|0.33651 pale|0.19507 golden|0.19507 rod|0.19507 navajo|0.19445 white|0.19445 wheat|0.087698 moccasin|0.055992 tan|0.048498 lemon|0.026715 chiffon|0.026715 light|0.016477 golden|0.016477 rod|0.016477 yellow|0.016477 black|0.0054063 blanched|0.0048043 almond|0.0048043 bisque|0.0041671  "
		}
	}
}
