{
	"add": {
		"doc": {
			"id": "5206d3927046ea4fcffe6d09c2e314db3b91615c33ff1b37c511ef825a810ae6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Peter_Max_-_IAH.jpg/220px-Peter_Max_-_IAH.jpg",
			"previous": [],
				"after": "On March 1, 2001, Continental launched non-stop service from Newark to Hong Kong, operating over the North circumpolar route. This service was the first non-stop long-haul route for any airline with flying duration exceeding 16 hours. The SARS outbreak in Asia caused service to be suspended until August 1, 2003. The launch in 2001 initiated a brief battle between Continental, United Airlines and Cathay Pacific over rights to non-stop flights between Hong Kong and New York.[30] In 2003 non-stop daily services were started between Newark and Geneva, Switzerland and between Newark and Port of Spain, Trinidad and Tobago. On September 13, 2004 Continental entered SkyTeam alliance along with Northwest/KLM and CSA.[31] Continental introduced new non-stop services to Oslo, Norway and Edinburgh, Scotland in 2004. In 2005, Continental expanded service from Newark to Beijing after being awarded the China route. During the same year, five new European destinations were added: Stockholm in Sweden, Belfast and Bristol in the United Kingdom, and Hamburg and Berlin in Germany. Services were added to Copenhagen, Denmark and Cologne, Germany in 2006, and to Athens, Greece in 2007. Among U.S. airlines, only Delta (with its extensive network of legacy routes dating from Delta's acquisition of Pan American's European network) serves more European destinations than Continental.",
			"color": "gray|0.15205 grey|0.15205 dim|0.13247 gray|0.13247 dim|0.13247 grey|0.13247 dark|0.11389 gray|0.11389 dark|0.11389 grey|0.11389 dark|0.11266 slate|0.11266 gray|0.11266 silver|0.09772 light|0.071643 slate|0.071643 gray|0.071643 dark|0.071448 olive|0.071448 green|0.071448 slate|0.070074 gray|0.070074 light|0.050798 gray|0.050798 light|0.050798 grey|0.050798 gainsboro|0.032757 light|0.016964 steel|0.016964 blue|0.016964 black|0.015655 steel|0.015387 blue|0.015387 lavender|0.0073943 white|0.0054976 smoke|0.0054976  "
		}
	}
}
