{
	"add": {
		"doc": {
			"id": "52155776a7785dbfd7851cb088766fcc5013cc8c253529313f9458e11c26b3e9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Victor_Tatin_aeroplane_1879.jpg/200px-Victor_Tatin_aeroplane_1879.jpg",
				"previous": "Alphonse Pénaud, a Frenchman living from 1850 to 1880, advanced the theory of wing contours and aerodynamics and constructed successful models of aeroplanes, helicopters and ornithopters. In 1871 he flew the first aerodynamically stable fixed-wing aeroplane, a model monoplane he called the \"Planophore\", a distance of 40 m (130 ft). Pénaud's model incorporated several of Cayley's discoveries, including the use of a tail, wing dihedral for inherent stability, and rubber power. The planophore also had longitudinal stability, being trimmed such that the tailplane was set at a smaller angle of incidence than the wings, an original and important contribution to the theory of aeronautics.[44] Pénaud's later project for an amphibian aeroplane, although never built, incorporated other modern features. A tailless monoplane with a single vertical fin and twin tractor propellers, it also featured hinged rear elevator and rudder surfaces, retractable undercarriage and a fully enclosed, instrumented cockpit.",
				"after": "Equally authoritative as a theorist was Pénaud's fellow countryman Victor Tatin. In 1879 he flew a model which, like Pénaud's project, was a monoplane with twin tractor propellers but also had a separate horizontal tail. It was powered by compressed air. Flown tethered to a pole, this was the first model to take off under its own power.",
			"color": "black|0.4828 dim|0.075617 gray|0.075617 dim|0.075617 grey|0.075617 gray|0.06917 grey|0.06917 dark|0.038136 gray|0.038136 dark|0.038136 grey|0.038136 antique|0.022374 white|0.022374 old|0.021779 lace|0.021779 floral|0.020814 white|0.020814 linen|0.020477 ivory|0.019696 beige|0.017893 sea|0.017647 shell|0.017647 papaya|0.014735 whip|0.014735 corn|0.014673 silk|0.014673 mint|0.013938 cream|0.013938 blanched|0.012099 almond|0.012099 honeydew|0.011877 white|0.011747 smoke|0.011747 snow|0.011236 white|0.011065 light|0.010214 yellow|0.010214 tan|0.0094536 bisque|0.007904 silver|0.0075231  "
		}
	}
}
