{
	"add": {
		"doc": {
			"id": "52233a97448abef5aa94d438c15ef2584f492f2994f149ca11c6580affc6d529",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Banksia_epica_purp_foll_email.jpg/220px-Banksia_epica_purp_foll_email.jpg",
				"previous": "These two localities are unusual in having cliff-top dunes of siliceous sand: cliff-top dunes are an unusual topographic formation, and nearly all soil in the area is calcareous. As Banksia species are intolerant of calcareous soils, and are not adapted to long range seed dispersal, the two populations of B. epica appear to be reproductively isolated. Nelson has suggested that there was once a continuous strip of siliceous sand along the coast, providing an extensive and unfragmented habitat for B. epica; rises in the sea level had submerged this strip, leaving only the cliff-top dunes as suitable habitat. The fact that the resultant isolated populations have not perceptibly speciated since then suggests that the species has been fragmented for only a short time, perhaps only since the Last Glacial Maximum.[6]",
				"after": "Pollinators of B. epica include Phylidonyris novaehollandiae (New Holland Honeyeater) and Acanthiza chrysorrhoa (Yellow-rumped Thornbill).[15] No other pollinators have been recorded, but the species is poorly surveyed, and studies of other Banksia species have consistently indicated a wide range of invertebrate and vertebrate pollinators. For example, a survey of the closely related and co-occurring B. media found that \"honeyeater birds and marsupial nectarivores were abundant in the study area and most carried the pollen of Banksia media while it flowered.… Self-pollination and pollination by insects clearly also play major roles in seed production.\"[16]",
			"color": "black|0.14428 tan|0.14089 rosy|0.13509 brown|0.13509 peach|0.080802 puff|0.080802 dark|0.052639 salmon|0.052639 sienna|0.049756 antique|0.044914 white|0.044914 misty|0.041774 rose|0.041774 bisque|0.039405 blanched|0.025192 almond|0.025192 papaya|0.025126 whip|0.025126 linen|0.02187 old|0.017825 lace|0.017825 dark|0.017644 gray|0.017644 dark|0.017644 grey|0.017644  "
		}
	}
}
