{
	"add": {
		"doc": {
			"id": "522a03d71dd50376f8180dab7dda658cabe1268c576f2634cb8bf0964e8a447b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Ficusindicamaxima.jpg/220px-Ficusindicamaxima.jpg",
				"previous": "With about 750 species, Ficus (Moraceae) is one of the largest angiosperm genera (David Frodin of Chelsea Physic Garden ranked it as the 31st largest genus).[8] Ficus aurea is classified in the subgenus Urostigma (the strangler figs) and the section Americana.[4] Recent molecular phylogenies have shown that subgenus Urostigma is polyphyletic, but have strongly supported the validity of section Americana as a discrete group (although its exact relationship to section Galoglychia is unclear).[9]",
				"after": "Thomas Nuttall described the species in the second volume of the his 1846 work The North American Sylva[10] with specific epithet aurea ('golden' in Latin).[11] In 1768, Scottish botanist Philip Miller described Ficus maxima, citing Carl Linnaeus' Hortus Cliffortianus (1738) and Hans Sloane's Catalogus plantarum quæ in insula Jamaica (1696). Sloane's illustration of the species, published in 1725, depicted it with figs borne singly, a characteristic of the Ficus subgenus Pharmacosycea.[12] As a member of the subgenus Urostigma, F. aurea has paired figs. However, a closer examination of Sloane's description led Cornelis Berg to conclude that the illustration depicted a member of the subgenus Urostigma (since it had other diagnostic of that subgenus), almost certainly F. aurea, and that the illustration of singly borne figs was probably artistic license. Berg located the plant collection upon which Sloane's illustration was based and concluded that Miller's F. maxima was, in fact, F. aurea.[10] In his description of F. aurea, which was based on plant material collected in Florida, Thomas Nuttall considered the possibility that his plants belonged to the species that Sloane had described, but came to the conclusion that it was a new species.[10] Under the rules of botanical nomenclature, the name F. maxima has priority over F. aurea since Miller's description was published in 1768, while Nuttall's description was published in 1846.",
			"color": " "
		}
	}
}
