{
	"add": {
		"doc": {
			"id": "52518cdafdd573b0d8a82b4fd11420b2548fe835bb2901014a8766814c527115",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Truman%2C_Bush_and_Conant.jpg/300px-Truman%2C_Bush_and_Conant.jpg",
				"previous": "The Atomic Energy Act of 1946 replaced the wartime Manhattan Project with the Atomic Energy Commission (AEC) on January 1, 1947. The Act also established the General Advisory Committee (GAC) within the AEC to provide it with scientific and technical advice. It was widely expected that Conant would chair the GAC, but the position went to Robert Oppenheimer, the wartime director of the Los Alamos National Laboratory that had designed and developed the first atomic bombs. At the same time, the Joint Research and Development Board (JRDC) was established to coordinate defense research, and Bush asked Conant to head its atomic energy subcommittee, on which Oppenheimer also served.[113] When the new AEC chairman David E. Lilienthal raised security concerns about Oppenheimer's relationships with communists, including Oppenheimer's brother Frank Oppenheimer, his wife Kitty and his former girlfriend Jean Tatlock, Bush and Conant reassured Lilienthal that they had known about it when they had placed Oppenheimer in charge at Los Alamos in 1942. With such expressions of support, AEC issued Oppenheimer a Q clearance, granting him access to atomic secrets.[114]",
				"after": "By September 1948, the Red Scare began to take hold, and Conant called for a ban on hiring teachers who were communists, although not for the dismissal of those who had already been hired. A debate ensued over whether communist educators could teach apolitical subjects.[115] Conant was a member of the Educational Policies Commission (EPC), a body to which he had been appointed in 1941.[116] When it next met in March 1949, Conant's push for a ban was supported by the president of Columbia University, General of the Army Dwight D. Eisenhower. The two found common ground in their belief in ideology-based education,[117] which Conant called \"democratic education\". He did not see public education as a side effect of American democracy, but as one of its principal driving forces,[118] and he disapproved of the public funding of denominational schools that he observed in Australia during his visit there in 1951.[119] He called for increased federal spending on education, and higher taxes to redistribute wealth.[118] His thinking was outlined in his books Education in a Divided World in 1948,[120] and Education and Liberty in 1951.[121] In 1952, he went further and endorsed the dismissal of academics who invoked the Fifth under questioning by the House Un-American Activities Committee.[122]",
			"color": " "
		}
	}
}
