{
	"add": {
		"doc": {
			"id": "525ee5e281e37f014629af850e5af51e6a1ef9d97dfdbf99852ede693096d5a5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Juan_pablo_duarte_diez.jpg/150px-Juan_pablo_duarte_diez.jpg",
				"previous": "From 1795 to 1822 the city changed hands several times along with the colony it headed. The city was ceded to France in 1795 after years of struggles, it was briefly captured by Haitian rebels in 1801, recovered by France in 1802, and was once again reclaimed by Spain in 1809. In 1821 Santo Domingo became the capital of an independent nation after the Criollo bourgeois within the country, led by José Núñez de Cáceres, overthrew the Spanish crown. The nation was unified with Haiti just two months later. The city and the colony lost much of their Spanish-born peninsular population as a result of these events which caused a great deal of instability and unrest.[12][14][15]",
				"after": "On February 27, 1844 Santo Domingo was again the capital of a free nation, when it gained its independence from Haitian occupation, led by Dominican nationalist Juan Pablo Duarte. The city was a prize fought over by various political factions over the succeeding decades of instability. In addition, the country had to fight multiple battles with Haiti; the Battle of March 19, Battle of March 30, Battle of Las Carreras, and Battle of Beler, are a few of the most prominent encounters, mentioned in the national anthem and with city streets named after them.[16] In 1861 Spain returned to the country, having struck a bargain with Dominican dictator Pedro Santana whereby the latter was granted several honorific titles and privileges, in exchange for annexing the young nation back to Spanish rule. The Dominican Restoration War began in 1863 however, and in 1865 the country was free again after Spain withdrew.",
			"color": "tan|0.29146 burly|0.25129 wood|0.25129 navajo|0.090085 white|0.090085 wheat|0.086121 pale|0.077514 golden|0.077514 rod|0.077514 moccasin|0.065674 rosy|0.0466 brown|0.0466  "
		}
	}
}
