{
	"add": {
		"doc": {
			"id": "52675fccaee79a857263674f6439db8cb8979ba8dae0ce25d8e571f87e2d4a29",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Phoebastria_albatrus1.jpg/220px-Phoebastria_albatrus1.jpg",
				"previous": "Albatrosses, along with all Procellariiformes, have a need to excrete the salts they ingest in drinking sea water and eating marine invertebrates. All birds have an enlarged nasal gland at the base of the bill, above their eyes. This gland is inactive in species that do not require it, but in the Procellariiformes it acts as a salt gland. Scientists are uncertain as to its exact processes, but do know in general terms that it removes salt by secreting a 5% saline solution that drips out of their nose or is forcibly ejected in some birds.[15]",
				"after": "The adult plumage of most of the albatrosses is usually some variation of dark upper-wing and back, white undersides, often compared to that of a gull.[14] Of these, the species range from the southern royal albatross which is almost completely white except for the ends and trailing edges of the wings in fully mature males, to the Amsterdam albatross which has an almost juvenile-like breeding plumage with a great deal of brown, particularly a strong brown band around the chest. Several species of mollymawks and North Pacific albatrosses have face markings like eye patches or have grey or yellow on the head and nape. Three albatross species, the black-footed albatross and the two sooty albatrosses, vary completely from the usual patterns and are almost entirely dark brown (or dark grey in places in the case of the light-mantled albatross). Albatrosses take several years to get their full adult breeding plumage.[3]",
			"color": "dark|0.31402 gray|0.31402 dark|0.31402 grey|0.31402 silver|0.2101 dim|0.090818 gray|0.090818 dim|0.090818 grey|0.090818 black|0.088672 light|0.078528 gray|0.078528 light|0.078528 grey|0.078528 gray|0.065857 grey|0.065857 gainsboro|0.04224 cadet|0.036656 blue|0.036656 slate|0.025232 gray|0.025232 dark|0.024894 slate|0.024894 gray|0.024894  "
		}
	}
}
