{
	"add": {
		"doc": {
			"id": "52762ebcd1545d6be7174cb8a25da348dee9835f04a5b33b8229327a395e9b88",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/CountryLink_XPT_2018_at_Junee.jpg/250px-CountryLink_XPT_2018_at_Junee.jpg",
				"previous": "The number of cross border railways expanded with the passing of the 1922 Border Railways Act,[42] with the Benalla – Yarrawonga branch line extended to Oaklands in 1938, both lines meeting standard gauge lines that were subsequently closed. Victorian Railways commenced construction of a railway from Robinvale to Koorakee and Lette in New South Wales in 1924 (the Lette railway line), but this railway was never completed. The Murray River bridge between Robinvale and Euston was instead converted to a road bridge, which will be demolished when the new road bridge currently under construction is completed. The Stony Crossing railway line was built from Kerang to Murrabit in 1924 and Stony Crossing (originally called Poonboon) in 1928 under an agreement with New South Wales.[43] No passenger services were carried on the section beyond Murrabit after 1932 and it was closed about 1943.[44]",
				"after": "Standard gauge rail services from Sydney came with the extension of the Main Southern railway line to Cootamundra and Junee in 1878 and the construction of the Murrumbidgee River Railway Bridge in 1881[45] allowed the line to be extended past Wagga Wagga to Henty and Albury later that year.[46] A branch line was constructed to Temora in 1893 and extended to Barellan in 1908, Griffith in 1916 and Hillston in 1923.[47] Further south, a branch line was completed from Junee to Narrandera in 1881 and extended to Hay by 1882.[48] Another branch pushed south from Narrandera toward the Victorian border reaching Jerilderie in 1884 and the Murray at Tocumwal in 1898.[49]",
			"color": "black|0.32695 midnight|0.15901 blue|0.15901 dim|0.1067 gray|0.1067 dim|0.1067 grey|0.1067 light|0.092889 slate|0.092889 gray|0.092889 slate|0.059832 gray|0.059832 dark|0.057684 golden|0.057684 rod|0.057684 gray|0.041146 grey|0.041146 dark|0.039057 slate|0.039057 gray|0.039057 light|0.0332 steel|0.0332 blue|0.0332 dark|0.031261 gray|0.031261 dark|0.031261 grey|0.031261 golden|0.012007 rod|0.012007 silver|0.010401 dark|0.010381 slate|0.010381 blue|0.010381  "
		}
	}
}
