{
	"add": {
		"doc": {
			"id": "528d56c1617237fb1a53751b98c4941d428697b78ead6f0668734c5c389e4dfb",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/1/1f/1BelmondoDoesBogey.jpg/250px-1BelmondoDoesBogey.jpg",
				"previous": "While it is hard to draw a line between some of the noir films of the early 1960s such as Blast of Silence (1961) and Cape Fear (1962) and the noirs of the late 1950s, new trends emerged in the post-classic era. The Manchurian Candidate (1962), directed by John Frankenheimer, Shock Corridor (1962), directed by Samuel Fuller, and Brainstorm (1965), directed by experienced noir character actor William Conrad, all treat the theme of mental dispossession within stylistic and tonal frameworks derived from classic film noir. The Manchurian Candidate examined the situation of American prisoners of war (POWs) during the Korean War. These incidents that occurred during the war as well as post-war incidents that ensued, functioned as an inspiration for a whole other \"subgenre of Cold War Noir\".[92][93] The television series The Fugitive (1963–67) brought classic noir themes and mood to the small screen for an extended run.[94]",
				"after": "In a different vein, films began to appear that self-consciously acknowledged the conventions of classic film noir as historical archetypes to be revived, rejected, or reimagined. These efforts typify what came to be known as neo-noir.[96] Though several late classic noirs, Kiss Me Deadly in particular, were deeply self-knowing and post-traditional in conception, none tipped its hand so evidently as to be remarked on by American critics at the time.[97] The first major film to overtly work this angle was French director Jean-Luc Godard's À bout de souffle (Breathless; 1960), which pays its literal respects to Bogart and his crime films while brandishing a bold new style for a new day.[98] In the United States, Arthur Penn (Mickey One [1964], drawing inspiration from Truffaut's Tirez sur le pianiste and other French New Wave films), John Boorman (Point Blank [1967], similarly caught up, though in the Nouvelle vague's deeper waters), and Alan J. Pakula (Klute [1971]) directed films that knowingly related themselves to the original film noirs, inviting audiences in on the game.[99]",
			"color": "dark|0.17731 gray|0.17731 dark|0.17731 grey|0.17731 silver|0.093973 gray|0.071687 grey|0.071687 light|0.063798 gray|0.063798 light|0.063798 grey|0.063798 white|0.059376 smoke|0.059376 sea|0.052972 shell|0.052972 snow|0.051396 gainsboro|0.050404 mint|0.049428 cream|0.049428 floral|0.049133 white|0.049133 white|0.048822 ghost|0.047575 white|0.047575 azure|0.045285 alice|0.043217 blue|0.043217 linen|0.024595 lavender|0.022377 blush|0.022377 ivory|0.020651 dim|0.019773 gray|0.019773 dim|0.019773 grey|0.019773 old|0.0052098 lace|0.0052098  "
		}
	}
}
