{
	"add": {
		"doc": {
			"id": "52a12315b196f8572c3353087de36c52f6e18f5769e34f55e2b828384227ee14",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Lockheed_Martin_F-22.jpg/220px-Lockheed_Martin_F-22.jpg",
				"previous": "The fifth generation was ushered in by the Lockheed Martin/Boeing F-22 Raptor in late 2005. Currently the cutting edge of fighter design, fifth-generation fighters are characterized by being designed from the start to operate in a network-centric combat environment, and to feature extremely low, all-aspect, multi-spectral signatures employing advanced materials and shaping techniques. They have multifunction AESA radars with high-bandwidth, low-probability of intercept (LPI) data transmission capabilities. The Infra-red search and track sensors incorporated for air-to-air combat as well as for air-to-ground weapons delivery in the 4.5th generation fighters are now fused in with other sensors for Situational Awareness IRST or SAIRST, which constantly tracks all targets of interest around the aircraft so the pilot need not guess when he glances. These sensors, along with advanced avionics, glass cockpits, helmet-mounted sights (not currently on F-22), and improved secure, jamming-resistant LPI datalinks are highly integrated to provide multi-platform, multi-sensor data fusion for vastly improved situational awareness while easing the pilot's workload.[21] Avionics suites rely on extensive use of very high-speed integrated circuit (VHSIC) technology, common modules, and high-speed data buses. Overall, the integration of all these elements is claimed to provide fifth-generation fighters with a \"first-look, first-shot, first-kill capability\".",
				"after": "The AESA radar offers unique capabilities for fighters (and it is also quickly becoming essential for Generation 4.5 aircraft designs, as well as being retrofitted onto some fourth-generation aircraft). In addition to its high resistance to ECM and LPI features, it enables the fighter to function as a sort of \"mini-AWACS,\" providing high-gain electronic support measures (ESM) and electronic warfare (EW) jamming functions.",
			"color": "dark|0.18355 gray|0.18355 dark|0.18355 grey|0.18355 gray|0.18041 grey|0.18041 dim|0.16231 gray|0.16231 dim|0.16231 grey|0.16231 dark|0.13065 slate|0.13065 gray|0.13065 slate|0.082184 gray|0.082184 silver|0.06703 black|0.047808 light|0.036479 slate|0.036479 gray|0.036479 light|0.033938 gray|0.033938 light|0.033938 grey|0.033938 gainsboro|0.023843 white|0.0062529 smoke|0.0062529 sea|0.0050752 shell|0.0050752  "
		}
	}
}
