{
	"add": {
		"doc": {
			"id": "52b1c1125527df1377a6f8d640a720f8c1e65d7adbafa8dfe553c42d6c40a6dd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Empress_Elisabeth_of_Austria.jpg/200px-Empress_Elisabeth_of_Austria.jpg",
				"previous": "The Gaelic Irish (both men and women)[28] took great pride in their long hair—for example, a person could be heavily fined for cutting a man's hair short against his will.[29] When the Anglo-Normans and the English colonized Ireland, hair length came to signify one's allegiance. Irishmen who cut their hair short were deemed to be forsaking their Irish heritage. Likewise, English colonists who wore their hair long in the back were deemed to be forsaking their role as English subjects and giving in to the Irish life. Thus, hair length was one of the most common ways of judging a true Englishman in this period. Muslims in Christian areas were ordered to keep their hair short and parted, as their longer style was considered rebellious and barbaric.[30]",
				"after": "The long hair tradition was widespread among English and French men in the 11th and 12th centuries, though it was considered, mostly because of endorsement of the Roman Catholic Church, acceptable for men also to have shorter hair. The tradition was largely brought about by monarchs who rejected the shorter hairstyle, causing the people to follow. Wulfstan, a religious leader, worried that those with longer hair would fight like women, and be unable to protect England from foreign invasion. This idea can be found in later military leaders as well, such as those of the American Confederacy.[31] Knights and rulers would also sometimes cut or pull out their hair in order to show penitence and mourning, and a squire's hair was generally shorter than a knight's. Married women who let their hair flow out in public were frowned upon, as this was normally reserved for the unwed, although they were allowed to let it out in mourning, to show their distressed state. Through these centuries it was expected of Eastern Christians to wear long hair as well as long beards, which was especially expected from clergy and monks.",
			"color": "dark|0.41052 olive|0.41052 green|0.41052 black|0.22026 dark|0.068691 khaki|0.068691 beige|0.040029 pale|0.030988 golden|0.030988 rod|0.030988 wheat|0.029041 antique|0.018719 white|0.018719 light|0.018269 golden|0.018269 rod|0.018269 yellow|0.018269 corn|0.01632 silk|0.01632 papaya|0.014336 whip|0.014336 light|0.011616 yellow|0.011616 lemon|0.011379 chiffon|0.011379 old|0.011132 lace|0.011132 moccasin|0.010329 blanched|0.010228 almond|0.010228  "
		}
	}
}
