{
	"add": {
		"doc": {
			"id": "52b6ee0237defe3e3447a9b09f26aebb09052ac89b702026db12c8532e94c8a2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Bowie_knife_1.jpg/300px-Bowie_knife_1.jpg",
				"previous": "Bowie became internationally famous as a result of a feud with Norris Wright, the sheriff of Rapides Parish. Bowie had supported Wright's opponent in the race for sheriff, and Wright, a bank director, had been instrumental in turning down a Bowie loan application.[29] After a confrontation in Alexandria one afternoon, Wright fired a shot at Bowie, after which Bowie resolved to carry his hunting knife at all times.[30] The knife he carried had a blade that was 9.25 inches (23.5 cm) long and 1.5 inches (3.8 cm) wide.[31]",
				"after": "The following year, on September 19, 1827, Bowie and Wright attended a duel on a sandbar outside of Natchez, Mississippi. Bowie supported duellist Samuel Levi Wells III, while Wright supported Wells's opponent, Dr. Thomas Harris Maddox. The duellists each fired two shots and, as neither man had been injured, resolved their duel with a handshake.[32][33] Other members of the groups, who had various reasons for disliking each other, began fighting. Bowie was shot in the hip; after regaining his feet he drew a knife, described as a butcher knife, and charged his attacker, who hit Bowie over the head with his empty pistol, breaking the pistol and knocking Bowie to the ground. Wright shot at and missed the prone Bowie, who returned fire and possibly hit Wright. Wright then drew his sword cane and impaled Bowie. When Wright attempted to retrieve his blade by placing his foot on Bowie's chest and tugging, Bowie pulled him down and disemboweled Wright with his large knife.[34][35] Wright died instantly, and Bowie, with Wright's sword still protruding from his chest, was shot again and stabbed by another member of the group. The doctors who had been present for the duel retrieved the bullets and patched Bowie's other wounds.[36]",
			"color": "light|0.23072 steel|0.23072 blue|0.23072 light|0.21126 slate|0.21126 gray|0.21126 slate|0.19471 gray|0.19471 light|0.11453 blue|0.11453 black|0.049616 dim|0.039343 gray|0.039343 dim|0.039343 grey|0.039343 gray|0.033114 grey|0.033114 powder|0.028675 blue|0.028675 lavender|0.023155 alice|0.016091 blue|0.016091 dark|0.011912 gray|0.011912 dark|0.011912 grey|0.011912 ghost|0.0091551 white|0.0091551  "
		}
	}
}
