{
	"add": {
		"doc": {
			"id": "52c8857d2ffc3d58e1f8cf02eb069b1e3dd319bcf5846bc3dc9fd5d50d0e6ae5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Flickr_-_%E2%80%A6trialsanderrors_-_Terrific_flights_over_ponderous_elephants%2C_poster_for_Forepaugh_%5E_Sells_Brothers%2C_ca._1899.jpg/220px-Flickr_-_%E2%80%A6trialsanderrors_-_Terrific_flights_over_ponderous_elephants%2C_poster_for_Forepaugh_%5E_Sells_Brothers%2C_ca._1899.jpg",
				"previous": "Elephants were historically kept for display in the menageries of Ancient Egypt, China, Greece and Rome. The Romans in particular pitted them against humans and other animals in gladiator events. In the modern era, elephants have traditionally been a major part of zoos and circuses around the world. In circuses, they are trained to perform tricks. The most famous circus elephant was probably Jumbo (1861 – 15 September 1885), who was a major attraction in the Barnum & Bailey Circus.[162] These animals do not reproduce well in captivity, due to the difficulty of handling musth bulls and limited understanding of female oestrous cycles. Asian elephants were always more common than their African counterparts in modern zoos and circuses. After CITES listed the Asian elephant under Appendix I in 1975, the number of African elephants in zoos increased in the 1980s, although the import of Asians continued. Subsequently, the US received many of its captive African elephants from Zimbabwe, which had an overabundance of the animals.[163] As of 2000, around 1,200 Asian and 700 African elephants were kept in zoos and circuses. The largest captive population is in North America, which has an estimated 370 Asian and 350 African elephants. About 380 Asians and 190 Africans are known to exist in Europe, and Japan has around 70 Asians and 67 Africans.[163]",
			"after": [],
			"color": "black|0.13225 navajo|0.089519 white|0.089519 gold|0.070271 dark|0.048936 golden|0.048936 rod|0.048936 burly|0.048611 wood|0.048611 golden|0.047617 rod|0.047617 olive|0.04757 khaki|0.039704 dark|0.034005 slate|0.034005 gray|0.034005 dark|0.032027 olive|0.032027 green|0.032027 moccasin|0.031006 dim|0.030755 gray|0.030755 dim|0.030755 grey|0.030755 pale|0.025484 golden|0.025484 rod|0.025484 tan|0.024738 saddle|0.022654 brown|0.022654 dark|0.017474 salmon|0.017474 yellow|0.01639 wheat|0.015955 gray|0.015527 grey|0.015527 peach|0.015476 puff|0.015476 dark|0.013282 khaki|0.013282  "
		}
	}
}
