{
	"add": {
		"doc": {
			"id": "52da56117db5589def53e96961e1dcb9c1fb0432b89068b4e74f8f882787cd4b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Mammoth_family.jpg/220px-Mammoth_family.jpg",
				"previous": "Woolly mammoth fossils have been found in many different types of deposits, including former rivers and lakes, and also in \"Doggerland\" in the North Sea, which was dry at times during the ice age. Such fossils are usually fragmentary and contain no soft tissue. Accumulations of modern elephant remains have been termed \"elephants' graveyards\", as these sites were erroneously thought to be where old elephants went to die. Similar accumulations of woolly mammoth bones have been found; it is thought these are the result of individuals dying near or in the rivers over thousands of years, and their bones eventually being brought together by the streams. Some accumulations are also thought to be the remains of herds that died together at the same time, perhaps due to flooding. Natural traps, such as kettle holes, sink holes, as well as mud, have also trapped mammoths in separate events over time.[101]",
				"after": "Apart from frozen remains, the only soft tissue known is from a specimen that was preserved in a petroleum seep in Starunia, Poland. Frozen remains of woolly mammoths have been found in the northern parts of Siberia and Alaska, with far fewer finds in the latter. Such remains are mostly found above the Arctic Circle, in permafrost. It appears that soft tissue was less likely to be preserved between 30,000 and 15,000 years ago, perhaps because the climate was milder during that period. Most specimens have partially degraded prior to discovery, due to exposure or to being scavenged. This \"natural mummification\" required the animal to have been buried rapidly in liquid or semi-solids such as silt, mud and icy water, which then froze.[102]",
			"color": "dim|0.27179 gray|0.27179 dim|0.27179 grey|0.27179 gray|0.22859 grey|0.22859 black|0.1469 dark|0.12818 gray|0.12818 dark|0.12818 grey|0.12818 silver|0.038407 light|0.025158 gray|0.025158 light|0.025158 grey|0.025158 gainsboro|0.018719 slate|0.016391 gray|0.016391 linen|0.011019 light|0.0096323 slate|0.0096323 gray|0.0096323 sea|0.0094228 shell|0.0094228 floral|0.0085065 white|0.0085065 white|0.008252 smoke|0.008252 antique|0.0074527 white|0.0074527 old|0.0069958 lace|0.0069958 snow|0.0065562 mint|0.006345 cream|0.006345  "
		}
	}
}
