{
	"add": {
		"doc": {
			"id": "52dfdec8feff7d252de8cdfec9dcd38226a22c48a10f47b6cf37340a8d73893c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Mig_29_firing_AA-10.JPG/220px-Mig_29_firing_AA-10.JPG",
				"previous": "Combat aircraft, or \"Warplanes\", are divided broadly into multi-role, fighters, bombers, and attackers, with several variations between them, including fighter-bombers, such as the MiG-23, ground-attack aircraft, such as the Soviet Ilyushin Il-2 Shturmovik.[citation needed] Also included among combat aircraft are long-range maritime patrol aircraft, such as the Hawker Siddeley Nimrod and the S-3 Viking that are often equipped to attack with anti-ship missiles and anti-submarine weapons.",
				"after": "The main role of fighters is destroying enemy aircraft in air-to-air combat, offensive or defensive. Many are fast and highly maneuverable. Escorting bombers or other aircraft is also a common task.[citation needed] They are capable of carrying a variety of weapons, including machine guns,[citation needed] cannons, rockets and guided missiles. Many modern fighters can attack enemy fighters from a great distance, before the enemy even sees them. Examples of air superiority fighters include the F-22 Raptor . WWII fighters include the British Spitfire; the American P-51 Mustang; and German Bf 109. An example of an interceptor (a fighter designed to take-off and quickly intercept and shoot down enemy planes) would be the MiG-25. An example of a heavy fighter is the Messerschmitt Bf 110. The term \"fighter\" is also sometimes applied to aircraft that have virtually no air-air capability – for example the A-10 ground-attack aircraft is operated by USAF \"Fighter\" squadrons.[citation needed]",
			"color": "slate|0.43831 gray|0.43831 light|0.2475 slate|0.2475 gray|0.2475 dark|0.070009 gray|0.070009 dark|0.070009 grey|0.070009 silver|0.056913 gray|0.047756 grey|0.047756 light|0.031972 gray|0.031972 light|0.031972 grey|0.031972 dim|0.024787 gray|0.024787 dim|0.024787 grey|0.024787 black|0.021505 gainsboro|0.021151  "
		}
	}
}
