{
	"add": {
		"doc": {
			"id": "53049ab82ccd86ffec17ea6acfc116af6091ec96883464f17817fe5d470679ef",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Kano_Hideyori_-_Maple_Viewers_-_Google_Art_Project.jpg/600px-Kano_Hideyori_-_Maple_Viewers_-_Google_Art_Project.jpg",
				"previous": "Since antiquity, Japanese art had found patrons in the aristocracy, military governments, and religious authorities.[2] Until the 16th century, the lives of the common people had not been a main subject of painting, and even when they were included, the works were luxury items made for the ruling samurai and rich merchant classes.[3] Later works appeared by and for townspeople, including inexpensive monochromatic paintings of beautiful women and scenes of the theatre and pleasure districts. The hand-produced nature of these shikomi-e limited the scale of their production, a limit that was soon overcome by genres that turned to mass-produced woodblock printing.[4]",
				"after": "During a prolonged period of civil war in the 16th century, a class of politically powerful merchants had developed. These machishū[a] were allied with the court and had power over local communities; they were also patrons of the arts, and their patronage encouraged a revivial in the classical arts in the late 16th and early 17th centuries.[5] In the early 17th century Tokugawa Ieyasu (1543–1616) unified the country and was appointed Shogun with supreme power over Japan. He consolidated his government in the village of Edo (modern Tokyo),[6] and required the territorial lords to assemble there in alternate years with their entourages. The demands of the growing capital drew many male laborers from the country, so that males came to make up nearly seventy percent of the population.[7] The village grew during the Edo period (1603–1867) from a population of 1800 to in excess of a million in the 19th century.[6]",
			"color": "tan|0.62957 dim|0.13139 gray|0.13139 dim|0.13139 grey|0.13139 gray|0.054771 grey|0.054771 dark|0.020772 slate|0.020772 gray|0.020772 dark|0.020573 gray|0.020573 dark|0.020573 grey|0.020573 light|0.020513 gray|0.020513 light|0.020513 grey|0.020513 silver|0.018608 indian|0.01534 red|0.01534 gainsboro|0.015105 slate|0.015011 gray|0.015011  "
		}
	}
}
