{
	"add": {
		"doc": {
			"id": "5309a80ac7d5f4f8782ae35f779f03c94318a92ca04467aa8f01e0fd409865dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Puijila_BW.jpg/220px-Puijila_BW.jpg",
			"previous": [],
				"after": "One popular hypothesis suggested that pinnipeds are diphyletic (descended from two ancestral lines), with walruses and otariids sharing a recent common ancestor with bears and phocids sharing one with Musteloidea. However, morphological and molecular evidence support a monophyletic origin.[11] Nevertheless there is some dispute as to whether pinnipeds are more closely related to bears or musteloids, as some studies support the former theory[17][18][19] and others the latter.[14][20][21] Pinnipeds split from other caniforms 50 million years ago (mya) during the Eocene.[22] Their evolutionary link to terrestrial mammals was unknown until the 2007 discovery of Puijila darwini in early Miocene deposits in Nunavut, Canada. Like a modern otter, Puijila had a long tail, short limbs and webbed feet instead of flippers. However, its limbs and shoulders were more robust and Puijila likely had been a quadrupedal swimmer–retaining a form of aquatic locomotion that give rise to the major swimming types employed by modern pinnipeds. The researchers who found Puijila placed it in a clade with Potamotherium (traditionally considered a mustelid) and Enaliarctos. Of the three, Puijila was the least specialized for aquatic life. The discovery of Puijila in a lake deposit suggests that pinniped evolution went through a freshwater transitional phase.[23]",
			"color": "dark|0.30299 gray|0.30299 dark|0.30299 grey|0.30299 gray|0.19968 grey|0.19968 dim|0.1631 gray|0.1631 dim|0.1631 grey|0.1631 silver|0.11207 light|0.044326 gray|0.044326 light|0.044326 grey|0.044326 gainsboro|0.032283 black|0.021455 slate|0.015665 gray|0.015665 white|0.013295 smoke|0.013295 snow|0.0094862 linen|0.0093893 ghost|0.0093251 white|0.0093251 sea|0.0091556 shell|0.0091556  "
		}
	}
}
