{
	"add": {
		"doc": {
			"id": "53262fce38bf93ac310293d21719a986a0fd16f1d23766ac7313e3ef4460d50d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Bufo_bufo_couple_during_migration%282005%29.jpg/220px-Bufo_bufo_couple_during_migration%282005%29.jpg",
				"previous": "Among prolonged breeders, males usually arrive at the breeding site first and remain there for some time whereas females tend to arrive later and depart soon after they have spawned. This means that males outnumber females at the water's edge and defend territories from which they expel other males. They advertise their presence by calling, often alternating their croaks with neighbouring frogs. Larger, stronger males tend to have deeper calls and maintain higher quality territories. Females select their mates at least partly on the basis of the depth of their voice.[109] In some species there are satellite males who have no territory and do not call. They may intercept females that are approaching a calling male or take over a vacated territory. Calling is an energy-sapping activity. Sometimes the two roles are reversed and a calling male gives up its territory and becomes a satellite.[108]",
				"after": "In explosive breeders, the first male that finds a suitable breeding location, such as a temporary pool, calls loudly and other frogs of both sexes converge on the pool. Explosive breeders tend to call in unison creating a chorus that can be heard from far away. The spadefoot toads (Scaphiopus spp.) of North America fall into this category. Mate selection and courtship is not as important as speed in reproduction. In some years, suitable conditions may not occur and the frogs may go for two or more years without breeding.[108] Some female New Mexico spadefoot toads (Spea multiplicata) only spawn half of the available eggs at a time, perhaps retaining some in case a better reproductive opportunity arises later.[110]",
			"color": "black|0.26731 dim|0.16921 gray|0.16921 dim|0.16921 grey|0.16921 gray|0.16308 grey|0.16308 dark|0.10131 gray|0.10131 dark|0.10131 grey|0.10131 tan|0.086482 silver|0.037357 antique|0.013706 white|0.013706 light|0.013453 gray|0.013453 light|0.013453 grey|0.013453 wheat|0.013251 blanched|0.012993 almond|0.012993  "
		}
	}
}
