{
	"add": {
		"doc": {
			"id": "5335ba02aa59d35df915598e283e09e8126b906a96e9dbad7fda14344b9c6c8c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Arkansas_%28BB33%29._Port_side%2C_underway%2C_10-15-1912_-_NARA_-_513003.tif/lossy-page1-220px-Arkansas_%28BB33%29._Port_side%2C_underway%2C_10-15-1912_-_NARA_-_513003.tif.jpg",
				"previous": "In early 1914, an international incident with Mexico culminated in the American occupation of Veracruz. Arkansas participated in the occupation, contributing four companies of naval infantry, which amounted to 17 officers and 313 enlisted men. The American forces fought their way through the city until they secured it. Two of Arkansas‍ '​s crewmen were killed in the fighting, and another two, John Grady and Jonas H. Ingram, received the Medal of Honor for actions during the occupation. The ship's detachment returned on 30 April; Arkansas remained in Mexican waters until she departed on 30 September to return to the United States. While stationed in Veracruz, the ship was visited by Captain Franz von Papen, the German military attaché to the United States and Mexico, and Rear Admiral Christopher Cradock, the commander of the British 4th Cruiser Squadron, on 10 May and 30 May 1914, respectively.[1]",
				"after": "Arkansas arrived in Hampton Roads, Virginia on 7 October, after which she took part in exercises for a week. She then sailed to the New York Navy Yard for periodic maintenance. After repairs were completed, the ship steamed down to the Virginia Capes area for training maneuvers. She returned to the New York Navy Yard on 12 December for additional maintenance. The repairs were completed within a month, and on 16 January 1915, Arkansas departed for the Virginia Capes for exercises on 19–21 January. The ship then steamed down to Guantánamo Bay, Cuba for exercises with the fleet. Arkansas returned for training off Hampton Roads on 7 April, followed by another maintenance period at the New York Navy Yard, starting on 23 April.[1]",
			"color": " "
		}
	}
}
