{
	"add": {
		"doc": {
			"id": "5336480276ccb8bb7dd9a045ca1b5c7536655c400e6da7bb4b71aa5c79471193",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Boletus_edulis_herkkutatti_halki.jpg/220px-Boletus_edulis_herkkutatti_halki.jpg",
			"previous": [],
				"after": "The cap of this mushroom is 7–30 cm (3–12 in) broad at maturity. Slightly sticky to touch, it is convex in shape when young and flattens with age. The colour is generally reddish-brown fading to white in areas near the margin, and continues to darken as it matures. The stipe, or stem, is 8–25 cm (3.5–10 in) in height, and up to 7 cm (2.8 in) thick—rather large in comparison to the cap;[31] it is club-shaped, or bulges out in the middle. It is finely reticulate on the upper portion, but smooth or irregularly ridged on the lower part. The under surface of the cap is made of thin tubes, the site of spore production; they are 1 to 2 cm (0.4 to 0.8 in) deep, and whitish in colour when young, but mature to a greenish-yellow.[32] The angular pores, which do not stain when bruised, are small — roughly 2 to 3 pores per millimetre.[33] In youth, the pores are white and appear as if stuffed with cotton (which are actually mycelia); as they age, they change colour to yellow and later to brown. The spore print is olive brown. The flesh of the fruit body is white, thick and firm when young, but becomes somewhat spongy with age. When bruised or cut, it either does not change colour, or turns a very light brown or light red.[34] Fully mature specimens can weigh about 1 kg (2.2 lb); a huge specimen collected on the Isle of Skye, Scotland, in 1995 bore a cap of 42 cm (16.5 in), with a stipe 18 cm (7.1 in) in height and 14 cm (5.5 in) wide, and weighed 3.2 kg (7.1 lb).[31] A similarly sized specimen found in Poland in 2013 made international news.[35]",
			"color": "black|0.2134 dark|0.20953 gray|0.20953 dark|0.20953 grey|0.20953 silver|0.18797 light|0.11926 gray|0.11926 light|0.11926 grey|0.11926 gainsboro|0.082617 gray|0.074311 grey|0.074311 dim|0.019579 gray|0.019579 dim|0.019579 grey|0.019579 linen|0.019115 white|0.015288 smoke|0.015288 sea|0.010481 shell|0.010481 floral|0.0073312 white|0.0073312 old|0.0073001 lace|0.0073001 snow|0.0060054 mint|0.0049486 cream|0.0049486 antique|0.0043351 white|0.0043351 white|0.0033173  "
		}
	}
}
