{
	"add": {
		"doc": {
			"id": "5336da680c0d1fd7e028177ceb001a64525977675b833d91ec8e21d4b3f6dc57",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/U.S._Patent_D11023.jpeg/170px-U.S._Patent_D11023.jpeg",
				"previous": "The origin of the Statue of Liberty project is sometimes traced to a comment made by French law professor and politician Édouard René de Laboulaye in mid-1865. In after-dinner conversation at his home near Versailles, Laboulaye, an ardent supporter of the Union in the American Civil War, is supposed to have said: \"If a monument should rise in the United States, as a memorial to their independence, I should think it only natural if it were built by united effort—a common work of both our nations.\"[7] The National Park Service, in a 2000 report, however, deemed this a legend traced to an 1885 fundraising pamphlet, and that the statue was most likely conceived in 1870.[8] In another essay on their website, the Park Service suggested that Laboulaye was minded to honor the Union victory and its consequences, \"With the abolition of slavery and the Union's victory in the Civil War in 1865, Laboulaye's wishes of freedom and democracy were turning into a reality in the United States. In order to honor these achievements, Laboulaye proposed that a gift be built for the United States on behalf of France. Laboulaye hoped that by calling attention to the recent achievements of the United States, the French people would be inspired to call for their own democracy in the face of a repressive monarchy.\"[9]",
				"after": "According to sculptor Frédéric Auguste Bartholdi, who later recounted the story, Laboulaye's comment was not intended as a proposal, but it inspired Bartholdi.[7] Given the repressive nature of the regime of Napoleon III, Bartholdi took no immediate action on the idea except to discuss it with Laboulaye. Bartholdi was in any event busy with other possible projects; in the late 1860s, he approached Isma'il Pasha, Khedive of Egypt, with a plan to build a huge lighthouse in the form of an ancient Egyptian female fellah or peasant, robed and holding a torch aloft, at the northern entrance to the Suez Canal in Port Said. Sketches and models were made of the proposed work, though it was never erected. There was a classical precedent for the Suez proposal, the Colossus of Rhodes: an ancient bronze statue of the Greek god of the sun, Helios. This statue is believed to have been over 100 feet (30 m) high, and it similarly stood at a harbor entrance and carried a light to guide ships.[10]",
			"color": " "
		}
	}
}
