{
	"add": {
		"doc": {
			"id": "5352d2e183b9ba5f5861698df1424df282e68cd69964045132bc73bd1450942d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Btselem-south_israel2.jpg/220px-Btselem-south_israel2.jpg",
				"previous": "Israel sought a ceasefire but refused to accept Hamas's condition that Palestinians arrested in the West Bank crackdown be released.[124] In a meeting held on 2 July to discuss the crisis, Hamas reportedly tried but failed to persuade armed factions in Gaza to uphold the truce with Israel.[193] Following escalating rocket fire from Gaza, Israel issued a warning on 4 July that it \"would only be able to sustain militant rocket fire for another 24, or maximum 48, hours before undertaking a major military offensive.\"[194] Hamas declared it was prepared to halt the rocket fire in exchange for an agreement by Israel to stop airstrikes. Netanyahu said Israel would only act against further rocket attacks.[195] On 5 July, Hamas official Osama Hamdan said rocket fire would continue until Israel lifted its import restrictions on Gaza and the Palestinian Authority transferred money to pay Hamas civil servants.[196] Between 4 and 6 July, a total of 62 rockets where fired from Gaza and the IAF attacked several targets in Gaza.[197][198][199] The following day, Hamas assumed formal responsibility for launching rocket attacks on Israel.[32] Hamas increased rocket attacks on Israel,[116] and by 7 July had fired 100 rockets from Gaza at Israeli territory; at the same time, the Israeli Air Force had bombed several sites in Gaza.[200][201][202] Early on 8 July, the IAF bombed 50 targets in the Gaza Strip.[203] Israel's military also stopped a militant infiltration from the sea.[203] Brigadier General Moti Almoz, the chief spokesman of the Israeli military, said: \"We have been instructed by the political echelon to hit Hamas hard.\"[113] Hamas insisted that Israel end all attacks on Gaza, release those re-arrested during the crackdown in the West Bank, lift the blockade on Gaza and return to the cease-fire conditions of 2012 as conditions for a ceasefire.[204]",
			"after": [],
			"color": "dim|0.29462 gray|0.29462 dim|0.29462 grey|0.29462 gray|0.27331 grey|0.27331 black|0.13593 dark|0.095626 gray|0.095626 dark|0.095626 grey|0.095626 silver|0.058885 light|0.041911 gray|0.041911 light|0.041911 grey|0.041911 slate|0.035115 gray|0.035115 light|0.032102 slate|0.032102 gray|0.032102 gainsboro|0.024326  "
		}
	}
}
