{
	"add": {
		"doc": {
			"id": "535247f14f271f138edb7ec520ff1d7e5fa5aebfa17ad0183f128414179d8854",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/De_Havilland_Comet_1_BOAC_Heathrow_G-ALYX_1953.jpg/220px-De_Havilland_Comet_1_BOAC_Heathrow_G-ALYX_1953.jpg",
				"previous": "On 26 October 1952, the Comet suffered its first hull loss when a BOAC flight departing Rome's Ciampino airport failed to become airborne and ran into rough ground at the end of the runway. Two passengers sustained minor injuries, and the aircraft, G-ALYZ, was a total loss. On 3 March 1953, a new Canadian Pacific Airlines Comet 1A, registered CF-CUN and named Empress of Hawaii, failed to become airborne while attempting a night takeoff from Karachi, Pakistan, on a delivery flight to Australia. The aircraft plunged into a dry drainage canal and collided with an embankment, killing all five crew and six passengers on board.[85][86] The accident was the first fatal jetliner crash, as well as the Comet's first accident to result in fatalities.[81] In response, Canadian Pacific cancelled its remaining order for a second Comet 1A and never operated the type in commercial service.[81]",
				"after": "Both early accidents were originally attributed to pilot error, as over-rotation had led to a loss of lift from the leading edge of the aircraft's wings. It was later determined that the Comet's wing profile experienced a loss of lift at a high angle of attack, and its engine inlets also suffered a lack of pressure recovery in the same conditions. As a result, de Havilland re-profiled the wings' leading edge with a pronounced \"droop\",[87] and wing fences were added to control spanwise flow.[88] A fictionalised investigation into the Comet's takeoff accidents was the subject of the 1959 novel Cone of Silence by Arthur David Beaty, a former BOAC captain. Cone of Silence was made into a film in 1960, and Beaty also recounted the story of the Comet's takeoff accidents in a chapter of his 1984 non-fiction work, Strange Encounters: Mysteries of the Air.[89]",
			"color": " "
		}
	}
}
