{
	"add": {
		"doc": {
			"id": "535e98f939af9d779c82adfc7b50ae39492b82fa1d83ed9c34e2a521a130ed45",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/African_Forest_Elephant.jpg/170px-African_Forest_Elephant.jpg",
				"previous": "Swedish zoologist Carl Linnaeus first described the genus Elephas and an elephant from Sri Lanka (then known as Ceylon) under the binomial Elephas maximus in 1758. In 1798, Georges Cuvier classified the Indian elephant under the binomial Elephas indicus. Dutch zoologist Coenraad Jacob Temminck described the Sumatran elephant in 1847 under the binomial Elephas sumatranus. English zoologist Frederick Nutter Chasen classified all three as subspecies of the Asian elephant in 1940.[14] Asian elephants vary geographically in their colour and amount of depigmentation. The Sri Lankan elephant (Elephas maximus maximus) inhabits Sri Lanka, the Indian elephant (E. m. indicus) is native to mainland Asia (on the Indian subcontinent and Indochina), and the Sumatran elephant (E. m. sumatranus) is found in Sumatra.[13] One disputed subspecies, the Borneo elephant, lives in northern Borneo and is smaller than all the other subspecies. It has larger ears, a longer tail, and straighter tusks than the typical elephant. Sri Lankan zoologist Paules Edward Pieris Deraniyagala described it in 1950 under the trinomial Elephas maximus borneensis, taking as his type an illustration in National Geographic.[15] It was subsequently subsumed under either E. m. indicus or E. m. sumatranus. Results of a 2003 genetic analysis indicate its ancestors separated from the mainland population about 300,000 years ago.[16] A 2008 study found that Borneo elephants are not indigenous to the island but were brought there before 1521 by the Sultan of Sulu from Java, where elephants are now extinct.[15]",
				"after": "The African elephant was first named by German naturalist Johann Friedrich Blumenbach in 1797 as Elephas africana.[17] The genus Loxodonta was commonly believed to have been named by Georges Cuvier in 1825. Cuvier spelled it Loxodonte and an anonymous author romanised the spelling to Loxodonta; the International Code of Zoological Nomenclature recognises this as the proper authority.[18] In 1942, 18 subspecies of African elephant were recognised by Henry Fairfield Osborn, but further morphological data has reduced the number of classified subspecies,[19] and by the 1990s, only two were recognised, the savannah or bush elephant (L. a. africana) and the forest elephant (L. a. cyclotis);[20] the latter has smaller and more rounded ears and thinner and straighter tusks, and is limited to the forested areas of western and Central Africa.[21] A 2000 study argued for the elevation of the two forms into separate species (L. africana and L. cyclotis respectively) based on differences in skull morphology.[22] DNA studies published in 2001 and 2007 also suggested they were distinct species,[23][24] while studies in 2002 and 2005 concluded that they were the same species.[25][26] Further studies (2010 and 2011) have supported African savannah and forest elephants' status as separate species.[27][28] As of 2011, the taxonomic designations of African elephants were still debated.[28] The third edition of Mammal Species of the World lists the two forms as full species[18] and does not list any subspecies in its entry for Loxodonta africana.[18] This approach is not taken by the United Nations Environment Programme's World Conservation Monitoring Centre nor by the IUCN, both of which list L. cyclotis as a synonym of L. africana.[29][30] Some evidence suggests that elephants of western Africa are a separate species,[31] although this is disputed.[26][28] The pygmy elephants of the Congo Basin, which have been suggested to be a separate species (Loxodonta pumilio) are probably forest elephants whose small size and/or early maturity are due to environmental conditions.[32]",
			"color": "dim|0.34242 gray|0.34242 dim|0.34242 grey|0.34242 gray|0.19452 grey|0.19452 dark|0.17155 gray|0.17155 dark|0.17155 grey|0.17155 black|0.098965 silver|0.079795 light|0.031616 gray|0.031616 light|0.031616 grey|0.031616 gainsboro|0.019176 light|0.012143 slate|0.012143 gray|0.012143 slate|0.010646 gray|0.010646 dark|0.0087839 olive|0.0087839 green|0.0087839  "
		}
	}
}
