{
	"add": {
		"doc": {
			"id": "536c1d6acaf70b3b73dc7c23de074cdb43d7f648ef0d5c3132fdc856268a4159",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Black_bear_large.jpg/170px-Black_bear_large.jpg",
				"previous": "In the wake of the Pig-faced Lady scare of 1814–15, exhibits on the subject of pig-faced women became popular at fairs. William Wilde records that a print of The Wonderful Mrs Atkinson was a popular exhibit at an early 19th century Irish fair,[59] while larger fairs included exhibits of pig-faced women moulded in papier-mâché or wax.[36] There is some evidence that a living pig-faced woman was exhibited at Bartholomew Fair in 1828, and possibly also in previous years.[60] (The pig-faced woman exhibited in Wakefield in 1828–29, recalled by George Lloyd in 1861, may have been the same one shown at Bartholomew Fair in 1828.[60]) At an 1843 fair in Hyde Park, \"Madam Steevens, the Wonderful Pig-faced Lady\" was exhibited, and would grunt to give replies to questions from the audience.[60]",
				"after": "The pig-faced women exhibited at fairs were not genuine. Showmen would drug a bear into a stupor by feeding it large amounts of strong beer, and then shave it.[60] Once shaved, the drunken bear would be fitted with padded artificial breasts, and dressed in women's clothing and a wig. Shoes would be attached to the bear's hind paws, and stuffed gloves to the front paws. The bear would then be placed in a chair with a hole in the back, and securely tied to the chair.[33]",
			"color": "black|0.65107 honeydew|0.073882 dim|0.03142 gray|0.03142 dim|0.03142 grey|0.03142 silver|0.030634 dark|0.02902 gray|0.02902 dark|0.02902 grey|0.02902 mint|0.024658 cream|0.024658 light|0.022133 cyan|0.022133 gray|0.021194 grey|0.021194 light|0.021117 gray|0.021117 light|0.021117 grey|0.021117 gainsboro|0.018146 azure|0.015297 dark|0.012425 slate|0.012425 gray|0.012425 dark|0.012082 sea|0.012082 green|0.012082 slate|0.0083405 gray|0.0083405 beige|0.0077061 ivory|0.0066392 light|0.0063982 slate|0.0063982 gray|0.0063982  "
		}
	}
}
