{
	"add": {
		"doc": {
			"id": "537ee0cd7eace8f159ab5986d444ea74f0abb1a50512e93cf010fbe943f69936",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Daspletosaurus_juvenle.jpg/220px-Daspletosaurus_juvenle.jpg",
				"previous": "Paleontologist Gregory Erickson and colleagues have studied the growth and life history of tyrannosaurids. Analysis of bone histology can determine the age of a specimen when it died. Growth rates can be examined when the age of various individuals are plotted against their size on a graph. Erickson has shown that after a long time as juveniles, tyrannosaurs underwent tremendous growth spurts for about four years midway through their lives. After the rapid growth phase ended with sexual maturity, growth slowed down considerably in adult animals. Erickson only examined Daspletosaurus from the Dinosaur Park Formation, but these specimens show the same pattern. Compared to albertosaurines, Daspletosaurus showed a faster growth rate during the rapid growth period due to its higher adult weight. The maximum growth rate in Daspletosaurus was 180 kilograms (400 lb) per year, based on a mass estimate of 1800 kilograms (2 tons) in adults. Other authors have suggested higher adult weights for Daspletosaurus; this would change the magnitude of the growth rate but not the overall pattern.[4]",
				"after": "By tabulating the number of specimens of each age group, Erickson and his colleagues were able to draw conclusions about life history in a population of Albertosaurus. Their analysis showed that while juveniles were rare in the fossil record, subadults in the rapid growth phase and adults were far more common. While this could be due to preservation or collection biases, Erickson hypothesized that the difference was due to low mortality among juveniles over a certain size, which is also seen in some modern large mammals like elephants. This low mortality may have resulted from a lack of predation, since tyrannosaurs surpassed all contemporaneous predators in size by the age of two. Paleontologists have not found enough Daspletosaurus remains for a similar analysis, but Erickson notes that the same general trend seems to apply.[32]",
			"color": "dim|0.27273 gray|0.27273 dim|0.27273 grey|0.27273 dark|0.20716 gray|0.20716 dark|0.20716 grey|0.20716 gray|0.19429 grey|0.19429 silver|0.086469 black|0.058022 slate|0.035085 gray|0.035085 light|0.029771 gray|0.029771 light|0.029771 grey|0.029771 tan|0.027494 light|0.024564 slate|0.024564 gray|0.024564 gainsboro|0.014703 antique|0.013115 white|0.013115 dark|0.0064106 slate|0.0064106 gray|0.0064106 bisque|0.0063828  "
		}
	}
}
