{
	"add": {
		"doc": {
			"id": "53866d52a5b72a8e8d6be55eff7d7bbefe56099867bea8268eb4e335cc095c62",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Fortticonderoga_inside.jpg/220px-Fortticonderoga_inside.jpg",
				"previous": "The Pell family, a politically important clan with influence throughout American history (from William C. C. Claiborne, the first Governor of Louisiana, to a Senator from Rhode Island, Claiborne Pell), restored the fort in 1909 and formally opened it to the public. The ceremonies, which commemorated the 300th anniversary of the discovery of Lake Champlain by European explorers, were attended by President William Howard Taft.[75] Stephen Hyatt Pell, who spearheaded the restoration effort, founded the Fort Ticonderoga Association in 1931, which is now responsible for the fort.[76] Funding for the restoration also came from Robert M. Thompson, father of Steven's wife Sarah Gibbs Thompson.[77] Between 1900 and 1950, the historically important lands around the fort, including Mount Defiance, Mount Independence, and much of Mount Hope, were also acquired by the foundation.[78] The fort was rearmed with fourteen 24-pound cannons provided by the British government. These cannons had been cast in England for use during the Revolution, but the war ended before they were shipped over.[79]",
				"after": "The fort is now a tourist attraction, early American military museum, and research center. The fort opens around May 10, the anniversary of the 1775 capture, every year, closing in late October.[80] It has been on a watchlist of National Historic Landmarks since 1998, because of the poor condition of some of the walls and the 19th-century pavilion constructed by William Ferris Pell.[2] The pavilion is, as of early 2009, undergoing restoration. In 2008, the powder magazine destroyed by the French in 1759 was reconstructed by Tonetti Associates Architects,[81] based in part on the original 1755 plans.[82] Also in 2008, the withdrawal of a major backer's financial support forced the museum, facing significant budget deficits, to consider selling one of its major art works, Thomas Cole's Gelyna, View near Ticonderoga. However, fundraising activities succeeded in making this unnecessary.[83]",
			"color": "dim|0.25598 gray|0.25598 dim|0.25598 grey|0.25598 gray|0.20832 grey|0.20832 dark|0.20825 gray|0.20825 dark|0.20825 grey|0.20825 silver|0.11214 black|0.087615 light|0.045421 gray|0.045421 light|0.045421 grey|0.045421 gainsboro|0.022752 slate|0.02094 gray|0.02094 light|0.015218 slate|0.015218 gray|0.015218 rosy|0.012041 brown|0.012041  "
		}
	}
}
