{
	"add": {
		"doc": {
			"id": "5392e52c5b41cb9c6dd6bb364ef118d6b7f7d258843002c494e27bddaa2c0dce",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/American_Life_New_York_2.jpg/220px-American_Life_New_York_2.jpg",
			"previous": [],
				"after": "\"American Life\" was met with generally negative reception from music critics. Sal Cinquemani from Slant Magazine labeled it a \"trite, self-aggrandizing and often awkward song about privilege\" and a \"dour and robotic\" track.[12] Stylus Magazine gave a negative review and said that when one of the world's richest women complains about commercialism and the emptiness of entertainment culture, it seems hypocritical rather than insightful. He also noted that in the song, she's raging against the life she herself is leading.[13] Chuck Taylor of Billboard gave a negative review for the song, criticizing Madonna's rapping and calling the song \"a blurry snarl of style and composition that's sounds more like a disjointed medley than a song.\"[14] Alexis Petridis from The Guardian was disappointed by the lyrics saying that \"what on earth might her extreme point of view involve? That the world is ruled by a shadowy cabal of super-intelligent lizards?... Sadly not. Her extreme point of view turns out to be that money can't buy you happiness and that fame isn't all it's cracked up to be.\" He also panned the lyric \"I like to express my extreme point of view\", saying that it's difficult to hear that line without feeling a prickle of excitement.[15]",
			"color": "lavender|0.19359 dim|0.11855 gray|0.11855 dim|0.11855 grey|0.11855 black|0.10708 lavender|0.092903 blush|0.092903 thistle|0.065542 plum|0.058049 gray|0.056127 grey|0.056127 dark|0.054412 slate|0.054412 gray|0.054412 gainsboro|0.031354 ghost|0.029185 white|0.029185 slate|0.027491 gray|0.027491 dark|0.027085 gray|0.027085 dark|0.027085 grey|0.027085 light|0.020968 slate|0.020968 gray|0.020968 misty|0.016343 rose|0.016343 light|0.015281 gray|0.015281 light|0.015281 grey|0.015281 alice|0.014897 blue|0.014897 silver|0.013567 light|0.013203 steel|0.013203 blue|0.013203 white|0.012997 smoke|0.012997 cadet|0.0078563 blue|0.0078563 snow|0.0074086  "
		}
	}
}
