{
	"add": {
		"doc": {
			"id": "539397c1d687e0222cdf06bf7872ed44809f3b8319ce12c7f5991fb7a4f5f365",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Sea_otters_Lisbon.JPG/220px-Sea_otters_Lisbon.JPG",
				"previous": "For many maritime indigenous cultures throughout the North Pacific, especially the Ainu in the Kuril Islands, the Koryaks and Itelmen of Kamchatka, the Aleut in the Aleutian Islands, the Haida of Haida Gwaii[167] and a host of tribes on the Pacific coast of North America, the sea otter has played an important role as a cultural, as well as material, resource. In these cultures, many of which have strongly animist traditions full of legends and stories in which many aspects of the natural world are associated with spirits, the sea otter was considered particularly kin to humans. The Nuu-chah-nulth, Haida, and other First Nations of coastal British Columbia used the warm and luxurious pelts as chiefs' regalia. Sea otter pelts were given in potlatches to mark coming-of-age ceremonies, weddings, and funerals.[58] The Aleuts carved sea otter bones for use as ornaments and in games, and used powdered sea otter baculum as a medicine for fever.[168]",
				"after": "Among the Ainu, the otter is portrayed as an occasional messenger between humans and the creator.[169] The sea otter is a recurring figure in Ainu folklore. A major Ainu epic, the Kutune Shirka, tells the tale of wars and struggles over a golden sea otter. Versions of a widespread Aleut legend tell of lovers or despairing women who plunge into the sea and become otters.[170] These links have been associated with the many human-like behavioral features of the sea otter, including apparent playfulness, strong mother-pup bonds and tool use, yielding to ready anthropomorphism.[171] The beginning of commercial exploitation had a great impact on the human, as well as animal, populations  the Ainu and Aleuts have been displaced or their numbers are dwindling, while the coastal tribes of North America, where the otter is in any case greatly depleted, no longer rely as intimately on sea mammals for survival.[172]",
			"color": "black|0.19308 dim|0.18545 gray|0.18545 dim|0.18545 grey|0.18545 slate|0.15414 gray|0.15414 light|0.12328 slate|0.12328 gray|0.12328 gray|0.079809 grey|0.079809 dark|0.062725 gray|0.062725 dark|0.062725 grey|0.062725 dark|0.049773 slate|0.049773 gray|0.049773 silver|0.035068 light|0.022596 steel|0.022596 blue|0.022596 light|0.021045 gray|0.021045 light|0.021045 grey|0.021045 gainsboro|0.014434 tan|0.010019  "
		}
	}
}
