{
	"add": {
		"doc": {
			"id": "539cdbc624b4539182b207587199c234221b648723ebbcf825f5ad61007a1b26",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Anouk_at_fesival_mundial_2008.JPG/220px-Anouk_at_fesival_mundial_2008.JPG",
				"previous": "The Netherlands has multiple music traditions. Traditional Dutch music is a genre known as \"Levenslied\", meaning Song of life, to an extent comparable to a French Chanson or a German Schlager. These songs typically have a simple melody and rhythm, and a straightforward structure of couplets and refrains. Themes can be light, but are often sentimental and include love, death and loneliness. Traditional musical instruments such as the accordion and the barrel organ are a staple of levenslied music, though in recent years many artists also use synthesizers and guitars. Artists in this genre include Jan Smit, Frans Bauer and André Hazes.",
				"after": "Contemporary Dutch rock and pop music (Nederpop) originated in the 1960s, heavily influenced by popular music from the United States and Britain. In the 1960s and 1970s the lyrics were mostly in English, and some tracks were instrumental. Bands such as Shocking Blue, (the) Golden Earring and Focus enjoyed international success. As of the 1980s, more and more pop musicians started working in the Dutch language, partly inspired by the huge success of the band Doe Maar. Today Dutch rock and pop music thrives in both languages, with some artists recording in either. Current symphonic metal bands Epica and Within Temptation as well as jazz / pop singer Caro Emerald are having some international success. Contemporary local heroes include pop singer Anouk, country pop singer Ilse DeLange, in South Guelderish dialect singing folk band Rowwen Hèze, rock band BLØF [nb 1] and Dutch language duo Nick & Simon.",
			"color": "black|0.83627 rosy|0.063452 brown|0.063452 dim|0.02327 gray|0.02327 dim|0.02327 grey|0.02327 sienna|0.014587 tan|0.013447 slate|0.012345 gray|0.012345  "
		}
	}
}
