{
	"add": {
		"doc": {
			"id": "53a17947f69eb987548f976f27659aaf91bb85c9281275fbe568787d47d6d8d4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/RIAN_archive_613694_Red_Army_men_are_on_offensive_near_Bryansk.jpg/220px-RIAN_archive_613694_Red_Army_men_are_on_offensive_near_Bryansk.jpg",
			"previous": [
				"In the Americas these included: Martinique, Guadeloupe, French Guiana and Saint Pierre and Miquelon.",
				"In Asia these included: French Polynesia, Wallis and Futuna, New Caledonia, the New Hebrides, French Indochina, French India, the mandates of Greater Lebanon and French Syria. The French government in 1936 attempted to grant independence to its mandate of Syria in the Franco-Syrian Treaty of Independence of 1936 signed by France and Syria. However opposition to the treaty grew in France and the treaty was not ratified. Syria had become an official republic in 1930 and was largely self-governing. In 1941, a British-led invasion supported by Free French forces expelled Vichy French forces in operation Exporter."
			],
				"after": "General Secretary Joseph Stalin and the government of the Soviet Union justified the Soviet war effort that resulted from the German invasion of the Soviet Union with Operation Barbarossa on 22 June 1941, as a defensive war being fought by patriotic Soviet people for their survival.[19] Stalin had supported popular front movements of anti-fascists including communists and non-communists from 1935 to 1939.[20] The popular front strategy was terminated from 1939 to 1941 when the Soviet Union cooperated with Germany in 1939 in the occupation and partitioning of Poland while the Soviet Union refused to endorse either the Allies or the Axis from 1939 to 1941, as it called the Allied-Axis conflict an \"imperialist war\".[20] After the invasion of the Soviet Union in 1941, Stalin endorsed the Western Allies as part of a renewed popular front strategy against Germany and called for the international communist movement to make a coalition with all those who opposed the Nazis.[20]",
			"color": " "
		}
	}
}
