{
	"add": {
		"doc": {
			"id": "53ae34b366d52cda1c59c6239debc1277ae84be509aa054bd4a768b7a7213e91",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Texas_governors_mansion.jpg/220px-Texas_governors_mansion.jpg",
				"previous": "Ima Hogg was born in Mineola, Texas in 1882 to Jim Hogg and Sarah Ann \"Sallie\" Stinson. She was the second of four children, including brothers William Clifford Hogg (1875–1930), Michael Hogg (1885–1941), and Thomas Elisha Hogg (1887–1949).[11] The Hogg family had long been active in public service. Her great-grandfather, Thomas Hogg, served in the state legislatures of Georgia, Alabama, and Mississippi. Her grandfather, Joseph Lewis Hogg, served in the Congress of the Republic of Texas and helped to write the Texas State Constitution.[21] At the time of her birth, Hogg's father was the district attorney of the Seventh District in Texas.[22] His term expired in 1884, and the family moved to Tyler, where he practiced law. Two years later, Jim Hogg was elected Texas Attorney General and the Hogg family moved to the state capital, Austin, where Ima began attending kindergarten.[23] When Jim Hogg was elected the first native-born Governor of Texas four years later,[22] Ima accompanied her mother and elder brother to the swearing-in ceremony and inauguration ball in January 1891, thus witnessing the first inauguration in the newly erected Texas State Capitol.[24] The family moved into the Governor's Mansion. Built in 1855, the building was in poor condition, with cracked walls and dilapidated furnishings. Ima and her siblings were expected to help renovate the building to a liveable state—she was required, among other things, to pry chewing gum from the furniture and door moldings.[25]",
				"after": "Hogg and her younger brothers were rambunctious. She recalled that they particularly enjoyed sliding down the banisters in the Governor's Mansion. Hogg's parents allowed this to continue until Thomas cut his chin, after which Jim Hogg nailed tacks along the center of the railing to curb the activity through fear of bloodied posteriors; the holes from the tacks remained visible in the banister for many decades after the Hogg family moved from the home.[26] Hogg's mother attempted to teach her ladylike skills such as needlework, but Hogg claimed that she \"never had the patience to succeed\".[26] Her mother also encouraged Hogg to learn German. Hogg and her siblings were frequently taken to the Millet Opera House in Austin to enjoy the performances.[27]",
			"color": "light|0.15432 steel|0.15432 blue|0.15432 light|0.10273 slate|0.10273 gray|0.10273 slate|0.092101 gray|0.092101 dim|0.091367 gray|0.091367 dim|0.091367 grey|0.091367 black|0.07476 dark|0.057684 gray|0.057684 dark|0.057684 grey|0.057684 lavender|0.049852 gray|0.041373 grey|0.041373 silver|0.034006 alice|0.030927 blue|0.030927 light|0.028769 blue|0.028769 gainsboro|0.026712 light|0.025019 gray|0.025019 light|0.025019 grey|0.025019 yellow|0.022497 green|0.022497 ghost|0.021682 white|0.021682 olive|0.021621 drab|0.021621 white|0.017472 smoke|0.017472 azure|0.017031 dark|0.014485 olive|0.014485 green|0.014485 mint|0.012256 cream|0.012256 white|0.011947 snow|0.0111 light|0.01108 cyan|0.01108 floral|0.0065575 white|0.0065575 sea|0.0050365 shell|0.0050365  "
		}
	}
}
