{
	"add": {
		"doc": {
			"id": "53b3f29cd88a72a0cabb8379342ac946cec75fed3ef826d9dd6c9818b43b11da",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Christ_Magdeburg_Cathedral_Met_41.100.157.jpg/150px-Christ_Magdeburg_Cathedral_Met_41.100.157.jpg",
				"previous": "Missionary efforts to Scandinavia during the 9th and 10th centuries helped strengthen the growth of kingdoms such as Sweden, Denmark, and Norway, which gained power and territory. Some kings converted to Christianity, although not all by 1000. Scandinavians also expanded and colonised throughout Europe. Besides the settlements in Ireland, England, and Normandy, further settlement took place in what became Russia and in Iceland. Swedish traders and raiders ranged down the rivers of the Russian steppe, and even attempted to seize Constantinople in 860 and 907.[124] Christian Spain, initially driven into a small section of the peninsula in the north, expanded slowly south during the 9th and 10th centuries, establishing the kingdoms of Asturias and León.[125]",
				"after": "In Eastern Europe, Byzantium revived its fortunes under Emperor Basil I (r. 867–886) and his successors Leo VI (r. 886–912) and Constantine VII (r. 913–959), members of the Macedonian dynasty. Commerce revived and the emperors oversaw the extension of a uniform administration to all the provinces. The military was reorganised, which allowed the emperors John I (r. 969–976) and Basil II (r. 976–1025) to expand the frontiers of the empire on all fronts. The imperial court was the centre of a revival of classical learning, a process known as the Macedonian Renaissance. Writers such as John Geometres (fl. early 10th century) composed new hymns, poems, and other works.[126] Missionary efforts by both eastern and western clergy resulted in the conversion of the Moravians, Bulgars, Bohemians, Poles, Magyars, and Slavic inhabitants of the Kievan Rus'. These conversions contributed to the founding of political states in the lands of those peoples—the states of Moravia, Bulgaria, Bohemia, Poland, Hungary, and the Kievan Rus'.[127] Bulgaria, which was founded around 680, at its height reached from Budapest to the Black Sea and from the Dnieper River in modern Ukraine to the Adriatic Sea.[128] By 1018, the last Bulgarian nobles had surrendered to the Byzantine Empire.[129]",
			"color": "black|0.30942 dark|0.23436 gray|0.23436 dark|0.23436 grey|0.23436 silver|0.20191 light|0.084407 gray|0.084407 light|0.084407 grey|0.084407 tan|0.050221 gainsboro|0.04368 gray|0.020879 grey|0.020879  "
		}
	}
}
