{
	"add": {
		"doc": {
			"id": "53c2300ac4687ef6e068d05ad94c90a09d848a47febfc36bcad30c5052578552",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Tsutaya_J%C5%ABzabur%C5%8D_seal.jpg/220px-Tsutaya_J%C5%ABzabur%C5%8D_seal.jpg",
				"previous": "The ukiyo-e print was a commercial art form, and the publisher played an important role.[186] Publishing was highly competitive; over a thousand publishers are known from the whole period. The number peaked at around 250 in the 1840s and 1850s[187]—200 in Edo alone[188]—and slowly shrank following the opening of Japan until about 40 remained at the opening of the 20th century. The publishers owned the woodblocks and copyrights, and from the late 18th century enforced copyrights[187] through the Picture Book and Print Publishers Guild.[k][189] Prints that went through several pressings were particularly profitable, as the publisher could reuse the woodblocks without further payment to the artist or woodblock cutter. The woodblocks were also traded or sold to other publishers or pawnshops.[190] Publishers were usually also vendors, and commonly sold each other's wares in their shops.[189] In addition to the artist's seal, publishers marked the prints with their own seals—some a simple logo, others quite elaborate, incorporating an address or other information.[191]",
				"after": "Print designers went through apprenticeship before being granted the right to produce prints of their own that they could sign with their own names.[192] Young designers could be expected to cover part or all of the costs of cutting the woodblocks. As they gained fame publishers usually covered these costs, and artists could demand higher fees.[193]",
			"color": "antique|0.10995 white|0.10995 beige|0.10743 papaya|0.10556 whip|0.10556 corn|0.1038 silk|0.1038 blanched|0.1023 almond|0.1023 light|0.092836 yellow|0.092836 old|0.08903 lace|0.08903 linen|0.05558 bisque|0.055084 light|0.049203 golden|0.049203 rod|0.049203 yellow|0.049203 gray|0.021749 grey|0.021749 dark|0.020769 gray|0.020769 dark|0.020769 grey|0.020769 ivory|0.019761 dim|0.019037 gray|0.019037 dim|0.019037 grey|0.019037 silver|0.012637 light|0.0077345 gray|0.0077345 light|0.0077345 grey|0.0077345 floral|0.0069888 white|0.0069888 gainsboro|0.0051936 sea|0.0037388 shell|0.0037388 honeydew|0.0030859  "
		}
	}
}
