{
	"add": {
		"doc": {
			"id": "53cc358760ae374bb83e6c70a59be5243362b7a60be628b1145c6b34252314aa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/UA_Flight_175_hits_WTC_south_tower_9-11_edit.jpeg/220px-UA_Flight_175_hits_WTC_south_tower_9-11_edit.jpeg",
				"previous": "The Stonewall riots were a series of spontaneous, violent demonstrations by members of the gay community against a police raid that took place in the early morning hours of June 28, 1969, at the Stonewall Inn in the Greenwich Village neighborhood of Lower Manhattan. They are widely considered to constitute the single most important event leading to the gay liberation movement and the modern fight for LGBT rights in the United States.[111][112]",
				"after": "In the 1970s, job losses due to industrial restructuring caused New York City to suffer from economic problems and rising crime rates.[113] While a resurgence in the financial industry greatly improved the city's economic health in the 1980s, New York's crime rate continued to increase through the decade and into the beginning of the 1990s.[114] By the 1990s, crime rates started to drop dramatically due to revised police strategies, improving economic opportunities, gentrification, and new residents, both American transplants and new immigrants from Asia and Latin America. Important new sectors, such as Silicon Alley, emerged in the city's economy. New York's population reached all-time highs in the 2000 Census and then again in the 2010 Census.",
			"color": "light|0.30652 steel|0.30652 blue|0.30652 gray|0.23703 grey|0.23703 dim|0.16142 gray|0.16142 dim|0.16142 grey|0.16142 light|0.12696 blue|0.12696 dark|0.041794 slate|0.041794 gray|0.041794 slate|0.025594 gray|0.025594 light|0.014963 gray|0.014963 light|0.014963 grey|0.014963 light|0.014647 slate|0.014647 gray|0.014647 dark|0.012044 gray|0.012044 dark|0.012044 grey|0.012044 sandy|0.010719 brown|0.010719 gainsboro|0.008513 dark|0.0069656 salmon|0.0069656 tan|0.004445 light|0.003944 salmon|0.003944 silver|0.0033689  "
		}
	}
}
