{
	"add": {
		"doc": {
			"id": "53cff63bdccb07adf29fcd4c4e17045891ad866f325c602a4037044e89af39ac",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Bandera_CNT-FAI.svg/220px-Bandera_CNT-FAI.svg.png",
				"previous": "The first secretaries of the International included the famed writer and activist Rudolph Rocker, along with Augustin Souchy and Alexander Schapiro. Following the first congress, other groups affiliated from France, Austria, Denmark, Belgium, Switzerland, Bulgaria, Poland and Romania. Later, a bloc of unions in the USA, Colombia, Peru, Ecuador, Guatemala, Cuba, Costa Rica and El Salvador also shared the IWA's statutes. The biggest syndicalist union in the USA, the IWW, considered joining but eventually ruled out affiliation in 1936, citing the IWA's policies on religious and political affiliation.[14] The Industrial Workers of the World (IWW), although not anarcho-syndicalist, were informed by developments in the broader revolutionary syndicalist milieu at the turn of the 20th century. At its founding congress in 1905, influential members with strong anarchist or anarcho-syndicalist sympathies like Thomas J. Hagerty, William Trautmann, and Lucy Parsons contributed to the union's overall revolutionary syndicalist orientation.[15] Although the terms anarcho-syndicalism and revolutionary syndicalism are often used interchangeably, the anarcho-syndicalist label was not widely used until the early 1920s. “The term ‘anarcho-syndicalist’ only came into wide use in 1921–1922 when it was applied polemically as a pejorative term by communists to any syndicalists...who opposed increased control of syndicalism by the communist parties.”[16] In fact, the original statement of aims and principles of the International Workers Association (drafted in 1922) refers not to anarcho-syndicalism, but to revolutionary syndicalism or revolutionary unionism,[17][18] depending on the translation.",
				"after": "The Biennio Rosso (English: \"Red Biennium\") was a two-year period, between 1919 and 1920, of intense social conflict in Italy, following the first world war.[19] The Biennio Rosso took place in a context of economic crisis at the end of the war, with high unemployment and political instability. It was characterized by mass strikes, worker manifestations as well as self-management experiments through land and factories occupations.[19] In Turin and Milan, workers councils were formed and many factory occupations took place under the leadership of anarcho-syndicalists. The agitations also extended to the agricultural areas of the Padan plain and were accompanied by peasant strikes, rural unrests and guerilla conflicts between left-wing and right-wing militias. According to libcom.org, the anarcho-syndicalist trade union Unione Sindacale Italiana \"grew to 800,000 members and the influence of the Italian Anarchist Union (20,000 members plus Umanita Nova, its daily paper) grew accordingly ... Anarchists were the first to suggest occupying workplaces.[20]",
			"color": "gray|0.10106 grey|0.10106 misty|0.085498 rose|0.085498 dim|0.077979 gray|0.077979 dim|0.077979 grey|0.077979 light|0.069557 pink|0.069557 light|0.068933 coral|0.068933 dark|0.067166 gray|0.067166 dark|0.067166 grey|0.067166 pink|0.067062 lavender|0.048411 blush|0.048411 silver|0.041797 light|0.040268 gray|0.040268 light|0.040268 grey|0.040268 gainsboro|0.039727 sea|0.034717 shell|0.034717 white|0.034172 smoke|0.034172 snow|0.031473 ghost|0.027895 white|0.027895 linen|0.025517 white|0.024501 salmon|0.024017 alice|0.02397 blue|0.02397 floral|0.019658 white|0.019658 mint|0.018762 cream|0.018762 azure|0.012024 black|0.0099813  "
		}
	}
}
