{
	"add": {
		"doc": {
			"id": "53ff7ac3599f5877395e10256b8a81c10df12036732e03145e15e4f4da36f53e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/F.G.Abberline.jpg/100px-F.G.Abberline.jpg",
			"previous": [],
				"after": "On Friday 31 August, prostitute Mary Ann Nichols was murdered in Buck's Row (since renamed Durward Street), a back street in Whitechapel. Her body was discovered by cart driver Charles Cross at 3:45 am on the ground in front of a gated stable entrance. Her throat had been slit twice from left to right and her abdomen was mutilated by a deep jagged wound. Several shallower incisions across the abdomen, and three or four similar cuts on the right side were caused by the same knife used violently and downwards.[23] As the murder occurred in the territory of the J or Bethnal Green Division of the Metropolitan Police, it was at first investigated by the local detectives. On the same day, James Monro resigned as the head of the Criminal Investigation Department (CID) over differences with Chief Commissioner of the Metropolitan Police Sir Charles Warren.[24] Initial investigations into the murder had little success, although elements of the press linked it to the two previous murders and suggested the killing might have been perpetrated by a gang, as in the case of Smith.[25] The Star newspaper suggested instead that a single killer was responsible and other newspapers took up their storyline.[26] Suspicions of a serial killer at large in London led to the secondment of Detective Inspectors Frederick Abberline, Henry Moore and Walter Andrews from the Central Office at Scotland Yard.[27] On the available evidence, Coroner Baxter concluded that Nichols was murdered at just after 3 am where she was found. In his summing up, he dismissed the possibility that her murder was connected with those of Smith and Tabram, as the lethal weapons were different in those cases, and neither of the earlier cases involved a slash to the throat.[28] However, by the time the inquest into Nichols' death had concluded, a fourth woman had been murdered, and Baxter noted \"The similarity of the injuries in the two cases is considerable.\"[29]",
			"color": "lavender|0.09492 lavender|0.091893 blush|0.091893 thistle|0.076916 gainsboro|0.075214 ghost|0.069138 white|0.069138 light|0.065423 gray|0.065423 light|0.065423 grey|0.065423 white|0.057644 smoke|0.057644 dark|0.055626 gray|0.055626 dark|0.055626 grey|0.055626 snow|0.053714 alice|0.052643 blue|0.052643 silver|0.048584 black|0.048448 white|0.042862 sea|0.036108 shell|0.036108 gray|0.034634 grey|0.034634 dim|0.024882 gray|0.024882 dim|0.024882 grey|0.024882 floral|0.017957 white|0.017957 azure|0.016459 mint|0.016423 cream|0.016423 linen|0.010264 misty|0.0099682 rose|0.0099682  "
		}
	}
}
