{
	"add": {
		"doc": {
			"id": "54082bf15c1e6a65f94799a38f3b3ec4c880ac7469740bb7c0c1eb7fcab065a2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/SuperGuppy-F-BPPA.jpg/220px-SuperGuppy-F-BPPA.jpg",
				"previous": "Several major aircraft manufacturers are multinational, and it is not unusual for them to have plants in widely separated locations. Airbus is unique in that it is a consortium formed by the major British, French, German, and Spanish aerospace companies. The geographic location of Airbus manufacturing is not only influenced by cost and convenience; it is also a matter of aviation history and national interest. Each of the Airbus partners makes an entire aircraft section, which must be transported to a central location for final assembly. The details vary from one model to another, but the general arrangement is for the wings and landing gear to be made in the UK, the tail and doors in Spain, the fuselage in Germany, and the nose and centre-section in France, with final assembly in either Toulouse, France; Hamburg, Germany; or Seville, Spain.",
				"after": "When Airbus started in 1970, the first few components were delivered by road, but growing production soon necessitated a switch to air transport. From 1972 onwards, a fleet of four highly modified \"Super Guppies\" took over. These were former Boeing Stratocruisers from the 1940s, converted with custom fuselages and turbine engines to carry large volume loads for the 1960s NASA space program, leading to the jest that \"every Airbus is delivered on the wings of a Boeing\". As time went by, the Super Guppies grew increasingly unsatisfactory for Airbus's ferrying needs: their age meant that operating expenses were high and ever-increasing, and growing Airbus production required greater capacity.",
			"color": "silver|0.20435 light|0.14461 gray|0.14461 light|0.14461 grey|0.14461 light|0.11354 slate|0.11354 gray|0.11354 dark|0.09756 gray|0.09756 dark|0.09756 grey|0.09756 slate|0.083214 gray|0.083214 gray|0.078445 grey|0.078445 gainsboro|0.059506 dim|0.05593 gray|0.05593 dim|0.05593 grey|0.05593 black|0.045961 light|0.027775 steel|0.027775 blue|0.027775 dark|0.026361 slate|0.026361 gray|0.026361 lavender|0.0093492 white|0.0058608 smoke|0.0058608 ghost|0.0054508 white|0.0054508 alice|0.0051676 blue|0.0051676 lavender|0.0049375 blush|0.0049375 snow|0.0046624 white|0.0042775 azure|0.0039083 sea|0.0039011 shell|0.0039011 mint|0.0037697 cream|0.0037697 floral|0.0033987 white|0.0033987  "
		}
	}
}
