{
	"add": {
		"doc": {
			"id": "540d5f0ae1315edc1c77d203ada96065857489b46a74e86fc9ba7ba1046b223d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Rhodes_bowling_side.jpg/220px-Rhodes_bowling_side.jpg",
			"previous": [],
				"after": "As a bowler, Rhodes was recognised by critics as one of the greatest slow bowlers of all time. Very effective at dismissing batsmen on difficult pitches, it was difficult to score runs from his bowling even on a good batting surface. He could make the ball turn if the pitch offered the slightest assistance, particularly if it had been affected by rain.[184] Cricket writer E. W. Swanton described how Rhodes had \"a beautifully controlled, economical and rhythmical action which ensured supreme accuracy of length and direction. He was a master of the stock left-hander's spin and could vary it with the ball that came on with the arm.\"[185] In his early years as a bowler, Rhodes was able to spin the ball very sharply,[24] and while this ability decreased in later years, he became expert at working out a batsman's weaknesses.[180] Critics considered him expert at flighting the ball; Neville Cardus wrote that \"Flight was his secret. Flight and the curving line, now higher, now lower, tempting, inimical; every ball like every other ball, yet somehow unlike; each over in collusion with the others, part of a plot ...\"[186] In the early part of his career, his bowling partnership with Hirst, who shared Rhodes's Kirkheaton birthplace, was particularly effective and established a formidable reputation.[187] As time passed, his accuracy increased to the extent that it seemed every ball landed in exactly the same place.[188] In his first five seasons, he was top of the national bowling averages twice and in second place three times, while in the first six seasons after the war, he was first four times and second once. In his whole career, he only fell outside the top 20 in the bowling averages in four seasons.[64]",
			"color": "silver|0.4 dark|0.26667 gray|0.26667 dark|0.26667 grey|0.26667 light|0.2 gray|0.2 light|0.2 grey|0.2 gainsboro|0.13333  "
		}
	}
}
