{
	"add": {
		"doc": {
			"id": "54213a80e438b0980a8c6830d4729d289502a3f562808fc2ec27d8e12fdbf915",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/1891_Telegraph_Lines.jpg/333px-1891_Telegraph_Lines.jpg",
				"previous": "John Watkins Brett, an engineer from Bristol, sought and obtained permission from Louis-Philippe in 1847 to establish telegraphic communication between France and England. The first undersea cable was laid in 1850 and connected London with Paris. After an initial exchange of greetings between Queen Victoria and President Napoleon, it was almost immediately severed by a French fishing vessel.[34] The line was relaid the next year[34] and then followed by connections to Ireland and the Low Countries.",
				"after": "The Atlantic Telegraph Company was formed in London in 1856 to undertake to construct a commercial telegraph cable across the Atlantic Ocean. It was successfully completed on 18 July 1866 by the ship SS Great Eastern, captained by Sir James Anderson after many mishaps along the way.[35] Earlier transatlantic submarine cables installations were attempted in 1857, 1858 and 1865. The 1857 cable only operated intermittently for a few days or weeks before it failed. The study of underwater telegraph cables accelerated interest in mathematical analysis of very long transmission lines. An overland telegraph from Britain to India was first connected in 1866 but was unreliable so a submarine telegraph cable was connected in 1870.[36] Several telegraph companies were combined to form the Eastern Telegraph Company in 1872.",
			"color": "antique|0.11209 white|0.11209 beige|0.085132 linen|0.083049 old|0.082227 lace|0.082227 papaya|0.066923 whip|0.066923 corn|0.066275 silk|0.066275 floral|0.064497 white|0.064497 ivory|0.064141 sea|0.049347 shell|0.049347 dark|0.042669 gray|0.042669 dark|0.042669 grey|0.042669 silver|0.039883 honeydew|0.034867 light|0.033634 yellow|0.033634 light|0.028215 gray|0.028215 light|0.028215 grey|0.028215 gray|0.025878 grey|0.025878 dim|0.021759 gray|0.021759 dim|0.021759 grey|0.021759 blanched|0.020503 almond|0.020503 gainsboro|0.018177 rosy|0.014202 brown|0.014202 mint|0.010215 cream|0.010215 white|0.0068745 smoke|0.0068745 misty|0.0061998 rose|0.0061998 black|0.0056319 snow|0.00536  "
		}
	}
}
