{
	"add": {
		"doc": {
			"id": "544173c14aeb274bbd930700fe188860cf44a179904aba5f0a46576f3e79f0af",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Batu_caves.jpg/170px-Batu_caves.jpg",
				"previous": "Significant Tamil emigration began in the 18th century, when the British colonial government sent many poor Tamils as indentured labourers to far-off parts of the Empire, especially Malaya, South Africa, Fiji, Mauritius and the Caribbean. At about the same time, many Tamil businessmen also migrated to other parts of the British Empire, particularly to Burma and East Africa.[97]",
				"after": "Many Tamils still live in these countries, and the Tamil communities in Singapore, Reunion Island, Malaysia and South Africa have retained much of their original culture and language. Many Malaysian children attend Tamil schools, and a significant portion of Tamil children are brought up with Tamil as their first language. In Singapore, Mauritius and Reunion, Tamil students learn Tamil as their second language in school, with English as the first. In Singapore, to preserve the Tamil language, the government has made it an official language despite Tamils comprising only about 5% of the population, and has also introduced compulsory instruction of the language for Tamils. Other Tamil communities, such as those in South Africa and Fiji, no longer speak Tamil as a first language, but still retain a strong Tamil identity, and are able to understand the language, while most elders speak it as a first language.[98] There is a very small Tamil community in Pakistan, notably settled since the partition in 1947.[99]",
			"color": "tan|0.11863 dark|0.11248 gray|0.11248 dark|0.11248 grey|0.11248 dim|0.10253 gray|0.10253 dim|0.10253 grey|0.10253 gray|0.098672 grey|0.098672 burly|0.07005 wood|0.07005 silver|0.046257 pale|0.044211 golden|0.044211 rod|0.044211 wheat|0.039142 navajo|0.031003 white|0.031003 moccasin|0.030332 khaki|0.029121 light|0.023163 gray|0.023163 light|0.023163 grey|0.023163 dark|0.02239 slate|0.02239 gray|0.02239 dark|0.020673 khaki|0.020673 gainsboro|0.015887 black|0.015797 light|0.014595 slate|0.014595 gray|0.014595 slate|0.012603 gray|0.012603 lemon|0.012436 chiffon|0.012436 rosy|0.011676 brown|0.011676 bisque|0.011335 blanched|0.009387 almond|0.009387 light|0.0080357 steel|0.0080357 blue|0.0080357 light|0.0078846 golden|0.0078846 rod|0.0078846 yellow|0.0078846 light|0.0074348 blue|0.0074348 peach|0.0073447 puff|0.0073447  "
		}
	}
}
