{
	"add": {
		"doc": {
			"id": "544fbbca44b78d8a9c7c4ea82be91f2762e78a5a54f94de2da42c10958aaea74",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/I.M._Pei.JPG/120px-I.M._Pei.JPG",
				"previous": "Portal:Arts/Featured biography/18",
				"after": "I. M. Pei (born 1917) is a Chinese American architect, often called a master of modern architecture. Born in Guangzhou, in 1935 he moved to the United States. While enrolled at Massachusetts Institute of Technology, he became unhappy with the school's focus on Beaux-Arts architecture, and spent his free time researching the emerging architects, especially Le Corbusier. After graduating, he joined the Harvard Graduate School of Design and formed a friendship with the Bauhaus architects Walter Gropius and Marcel Breuer. Pei spent ten years working with New York real estate magnate William Zeckendorf before establishing his own independent design firm that eventually became Pei Cobb Freed & Partners. Among the early projects on which Pei took the lead were the L'Enfant Plaza Hotel in Washington, DC, and the Green Building at MIT. His first major recognition came with the National Center for Atmospheric Research in Colorado; his new stature led to his selection as chief architect for the John F. Kennedy Library in Massachusetts. He went on to design Dallas City Hall and the East Building of the National Gallery of Art. In the early 1980s, Pei was the focus of controversy when he designed a glass-and-steel pyramid for the Louvre museum in Paris. Pei has won a wide variety of prizes and awards in the field of architecture, including the 1983 Pritzker Prize, sometimes called the Nobel Prize of architecture.",
			"color": "dim|0.17777 gray|0.17777 dim|0.17777 grey|0.17777 tan|0.10957 light|0.09968 steel|0.09968 blue|0.09968 light|0.093905 gray|0.093905 light|0.093905 grey|0.093905 gainsboro|0.08463 lavender|0.077733 brown|0.062959 silver|0.051721 dark|0.035706 gray|0.035706 dark|0.035706 grey|0.035706 misty|0.025889 rose|0.025889 linen|0.019246 rosy|0.016866 brown|0.016866 indian|0.014313 red|0.014313 antique|0.010083 white|0.010083 lavender|0.0097229 blush|0.0097229 firebrick|0.0089562 white|0.0089452 smoke|0.0089452 gray|0.0082273 grey|0.0082273 pink|0.0072194 light|0.0062324 blue|0.0062324 peach|0.0055561 puff|0.0055561 sea|0.0054463 shell|0.0054463 old|0.0052766 lace|0.0052766  "
		}
	}
}
