{
	"add": {
		"doc": {
			"id": "545e23e60e5bee496c6840f3ef966c9fa4e575f5adcf151c010c12043073694d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/TTC_1515.JPG/220px-TTC_1515.JPG",
				"previous": "Studies have shown that there is a strong inverse correlation between urban population density and energy consumption per capita, and that public transport could facilitate increased urban population densities, and thus reduce travel distances and fossil fuel consumption.[42]",
				"after": "Supporters of the green movement usually advocate public transportation, because it offers decreased airborne pollution compared to automobiles. A study conducted in Milan, Italy in 2004 during and after a transportation strike serves to illustrate the impact that mass transportation has on the environment. Air samples were taken between 2 and 9 January, and then tested for Methane, Carbon Monoxide, non-methane Hydrocarbons (NMHCs), and other gases identified as harmful to the environment. The figure below is a computer simulation showing the results of the study \"with 2 January showing the lowest concentrations as a result of decreased activity in the city during the holiday season. 9 January showed the highest NMHC concentrations because of increased vehicular activity in the city due to a public transportation strike.\"[43]",
			"color": "dark|0.20439 gray|0.20439 dark|0.20439 grey|0.20439 silver|0.19553 black|0.16223 light|0.11932 gray|0.11932 light|0.11932 grey|0.11932 gray|0.063414 grey|0.063414 gainsboro|0.059082 dim|0.058705 gray|0.058705 dim|0.058705 grey|0.058705 rosy|0.015696 brown|0.015696 dark|0.015421 slate|0.015421 gray|0.015421 white|0.010172 smoke|0.010172 sea|0.0080374 shell|0.0080374 misty|0.0078872 rose|0.0078872 snow|0.0074747 lavender|0.0074398 blush|0.0074398 ghost|0.0070096 white|0.0070096 linen|0.0066011 white|0.0061121 alice|0.006006 blue|0.006006 floral|0.0058771 white|0.0058771 mint|0.0050984 cream|0.0050984 slate|0.0050084 gray|0.0050084  "
		}
	}
}
