{
	"add": {
		"doc": {
			"id": "5462e14c60345b2c76103507e1439c0c5883aa4056e41da07012ee2dca058590",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Allosaurus-fragilis-Klauen.JPG/220px-Allosaurus-fragilis-Klauen.JPG",
				"previous": "Allosaurus had nine vertebrae in the neck, 14 in the back, and five in the sacrum supporting the hips.[14] The number of tail vertebrae is unknown and varied with individual size; James Madsen estimated about 50,[4] while Gregory S. Paul considered that to be too many and suggested 45 or less.[10] There were hollow spaces in the neck and anterior back vertebrae.[4] Such spaces, which are also found in modern theropods (that is, the birds), are interpreted as having held air sacs used in respiration.[15] The rib cage was broad, giving it a barrel chest, especially in comparison to less derived theropods like Ceratosaurus.[16] Allosaurus had gastralia (belly ribs), but these are not common findings,[4] and they may have ossified poorly.[10] In one published case, the gastralia show evidence of injury during life.[17] A furcula (wishbone) was also present, but has only been recognized since 1996; in some cases furculae were confused with gastralia.[17][18] The ilium, the main hip bone, was massive, and the pubic bone had a prominent foot that may have been used for both muscle attachment and as a prop for resting the body on the ground. Madsen noted that in about half of the individuals from the Cleveland-Lloyd Dinosaur Quarry, independent of size, the pubes had not fused to each other at their foot ends. He suggested that this was a sexual characteristic, with females lacking fused bones to make egg-laying easier.[4] This proposal has not attracted further attention, however.",
				"after": "The forelimbs of Allosaurus were short in comparison to the hindlimbs (only about 35% the length of the hindlimbs in adults)[19] and had three fingers per hand, tipped with large, strongly curved and pointed claws.[4] The arms were powerful,[10] and the forearm was somewhat shorter than the upper arm (1:1.2 ulna/humerus ratio).[20] The wrist had a version of the semilunate carpal[21] also found in more derived theropods like maniraptorans. Of the three fingers, the innermost (or thumb) was the largest,[10] and diverged from the others.[20] The phalangeal formula is 2-3-4-0-0, meaning that the innermost finger (phalange) has two bones, the next has three, and the third finger has four.[22] The legs were not as long or suited for speed as those of tyrannosaurids, and the claws of the toes were less developed and more hoof-like than those of earlier theropods.[10] Each foot had three weight-bearing toes and an inner dewclaw, which Madsen suggested could have been used for grasping in juveniles.[4] There was also what is interpreted as the splint-like remnant of a fifth (outermost) metatarsal, perhaps used as a lever between the Achilles tendon and foot.[23]",
			"color": "burly|0.38405 wood|0.38405 tan|0.34022 black|0.14561 wheat|0.031847 navajo|0.022805 white|0.022805 dim|0.020215 gray|0.020215 dim|0.020215 grey|0.020215 pale|0.019602 golden|0.019602 rod|0.019602 moccasin|0.016576  "
		}
	}
}
