{
	"add": {
		"doc": {
			"id": "547de367d97d12a3807f826506d4ea4a0a9f99abe76a895e82d8fbb248d23971",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/AG208-AA-158-NN-1-1338.jpg/220px-AG208-AA-158-NN-1-1338.jpg",
				"previous": "Almirante Latorre was sent to the United Kingdom for a modernization at the Devonport Dockyard in 1929. Departing Chile on 15 May, she traveled past Balboa before traversing the Panama Canal nine days later. After refueling at Port of Spain on 28 May, the dreadnought continued across the Atlantic, passing the Azores before arriving in Plymouth on 24 June.[32] Major alterations included rebuilding the bridge, updating the main battery fire control to more modern standards and adding it for the secondary armament for the first time, and replacing her steam turbine engines. Also added were a new mast between the third and fourth turrets, anti-torpedo bulges similar to the British Queen Elizabeth-class battleships, and new anti-aircraft guns.[18] Nearly two years after the modernization began, Almirante Latorre sailed back to Valparaíso on 5 March 1931 and put in on 12 April. Two 33-long-ton (34 t) tug boats which had been acquired for use in the harbors of Punta Arenas and Valparaíso were carried on the battleship's deck during her voyage back to Chile.[32]",
				"after": "Despite the goodwill brought on by the removal of the \"strongman\"[33] President Carlos Ibáñez del Campo in July 1931, Chile could not overcome the Great Depression's severe economic effects, and wages for civil servants making over 3,000 pesos a year were cut by 12–30 percent to reduce government expenditures. This triggered a severe reaction among the sailors of the navy, who had already suffered a 10 percent salary cut and 50 percent loss in overseas bonuses. Various members of the crew on board Almirante Latorre, but no officers, met on 31 August and decided that a mutiny was the best course of action.[34][35][36]",
			"color": "dim|0.30276 gray|0.30276 dim|0.30276 grey|0.30276 dark|0.14764 gray|0.14764 dark|0.14764 grey|0.14764 gray|0.11235 grey|0.11235 silver|0.10464 light|0.087128 gray|0.087128 light|0.087128 grey|0.087128 gainsboro|0.066756 slate|0.046817 gray|0.046817 light|0.038108 slate|0.038108 gray|0.038108 lavender|0.029244 alice|0.011792 blue|0.011792 white|0.010893 smoke|0.010893 ghost|0.010762 white|0.010762 black|0.010173 lavender|0.0094205 blush|0.0094205 snow|0.0056285  "
		}
	}
}
