{
	"add": {
		"doc": {
			"id": "5487cebbd51a1c3e672c79b5e19d3a9f42e9a67d4a9a40819ac3b8115df82b6e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Ranavalona_III_of_Madagascar.jpg/100px-Ranavalona_III_of_Madagascar.jpg",
				"previous": "edit",
				"after": "Ranavalona III (1861–1917) was the last sovereign of the Kingdom of Madagascar. Her reign from 1883 to 1897 was marked by ultimately futile efforts to resist the colonial designs of the government of France. She entered into a political marriage with Rainilaiarivony who, in his role as Prime Minister of Madagascar, largely oversaw the day-to-day governance of the kingdom and managed its foreign affairs. Throughout her reign, Ranavalona tried to stave off colonization by strengthening trade and diplomatic relations with the United States and Great Britain. However, French attacks ultimately led to the capture of the royal palace in 1895, ending Madagascar's autonomy. The newly installed French colonial government initially permitted Ranavalona and her court to remain as symbolic figureheads until the outbreak of a popular resistance movement led the French to send her into exile. The queen, her family and the servants accompanying her were provided an allowance and enjoyed a comfortable standard of living, but she was never permitted to return to Madagascar despite her requests. She died at her villa in Algiers at the age of 55; her remains were returned to Madagascar in 1938.",
			"color": "dim|0.15393 gray|0.15393 dim|0.15393 grey|0.15393 gray|0.10824 grey|0.10824 antique|0.088154 white|0.088154 bisque|0.08336 blanched|0.082838 almond|0.082838 papaya|0.078057 whip|0.078057 corn|0.055116 silk|0.055116 peach|0.050411 puff|0.050411 dark|0.049006 gray|0.049006 dark|0.049006 grey|0.049006 beige|0.043724 old|0.032727 lace|0.032727 light|0.031013 yellow|0.031013 wheat|0.029936 light|0.026793 golden|0.026793 rod|0.026793 yellow|0.026793 lemon|0.022468 chiffon|0.022468 linen|0.013689 silver|0.013264 moccasin|0.011423 ivory|0.0067184 light|0.0041608 gray|0.0041608 light|0.0041608 grey|0.0041608  "
		}
	}
}
