{
	"add": {
		"doc": {
			"id": "54a3734969c1fa729a6904bd6c63b4234581f72d061b9f26b5fde0f93d11a706",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/c/ca/Square_floorplan_with_five_projections.svg/220px-Square_floorplan_with_five_projections.svg.png",
				"previous": "The 11th-century temple-building boom continued in the 12th century with the addition of new features. The Mahadeva Temple at Itagi and the Siddhesvara Temple in Haveri are standard constructions incorporating these developments. Based on the general plan of the Amrtesvara Temple at Annigeri, the Mahadeva Temple was built in 1112 CE and has the same architectural components as its predecessor. There are however differences in their articulation; the sala roof (roof under the finial of the superstructure) and the miniature towers on pilasters are chiseled instead of moulded.[40] The difference between the two temples, built fifty years apart, is the more rigid modelling and decoration found in many components of the Mahadeva Temple. The voluptuous carvings of the 11th century were replaced with a more severe chiselling.[41]",
				"after": "As developments progressed, the Chalukyan builders modified the pure dravida tower by reducing the height of each stepped storey and multiplying their number. From base to top, the succeeding storeys get smaller in circumference and the topmost storey is capped with a crown holding the kalasa, a finial in the shape of a decorative water pot. Each storey is so richly decorated that the original dravida character becomes almost invisible. In the nagara tower the architects modified the central panels and niches on each storey, forming a more-or-less continuous vertical band and simulating the vertical bands up the centre of each face of the typical northern style tower.[35] Old and new architectural components were juxtaposed but introduced separately.[40] Some superstructures are essentially a combination of southern dravida and northern nagara structures and is termed \"Vesara Sikhara\" (also called Kadamba Sikhara).[29]",
			"color": "dim|0.30594 gray|0.30594 dim|0.30594 grey|0.30594 gray|0.27532 grey|0.27532 dark|0.23786 gray|0.23786 dark|0.23786 grey|0.23786 silver|0.10934 light|0.043963 gray|0.043963 light|0.043963 grey|0.043963 gainsboro|0.02649  "
		}
	}
}
