{
	"add": {
		"doc": {
			"id": "54bcc1c771376fd880d3a89e0f869170440d0fa7d5df491e04161d4770dd6cc1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Bundesarchiv_Bild_183-1986-1015-004%2C_Auszubildende_mit_Stuten.jpg/170px-Bundesarchiv_Bild_183-1986-1015-004%2C_Auszubildende_mit_Stuten.jpg",
				"previous": "After World War II, Haflinger breeding programs almost collapsed as the military stopped buying horses and government-run breeding centers were closed. Breeders continued to emphasize those features necessary for pack horses (the largest use by the military), but neglected other key Haflinger characteristics. Haflinger breeding had to change to create a horse that better fit modern trends toward recreational use. Around this time, all small breed cooperatives were combined into the Haflinger Breeders' Association of Tyrol.[30] Post-World War II Tyrol, including the breeding center at Zams, was under the control of American forces, who slaughtered many horses to provide meat for hospitals. However, the troops did allow the breeding director to choose 30 stallions to be kept for breeding purposes. Those horses were relocated to the French-occupied Kops Alm high pasture in Vorarlberg, but they were subsequently stolen and never seen again. In other areas of Tyrol, all one- to three-year-old colts had been requisitioned by military breeding centers, and therefore it was necessary to treat colts not even a year old as potential breeding stallions.[31] In the years after World War II, some observers feared that the breed was dying out because of indiscriminate crossing with other breeds.[5]",
				"after": "At conferences in 1946 and 1947, the decision was made to breed Haflinger horses from pure bloodlines, creating a closed stud book with no new blood being introduced. The Tyrolean Haflinger Breeders' Association established its own stallion center and prohibited private breeders from keeping stallions, thus ensuring that the association maintained 100 percent control of breeding stallions. In Bavaria, several young stallions had been saved and breeders could privately own stallions. Bavarian and Tyrolean breeders maintained close ties and cooperated extensively. North Tyrolean breeders were also able to acquire several high-quality older stallions and lower-quality young stallions from South Tyrol. In 1947, the Federation of Austrian Haflinger Breeders was established as a governing organization for the provincial associations. At this time a large-scale breed show was held, attended by visitors from Switzerland, who soon after their return home sent a purchasing commission to Austria and were instrumental in founding the Haflinger population in Switzerland. Southern Tyrol had no difficulty in selling its horses, as all of Italy was in the market to purchase horses, and breeding populations spread as far south as Sicily.[32]",
			"color": " "
		}
	}
}
