{
	"add": {
		"doc": {
			"id": "54dc408a980b177874282bd1a54b6fef74f9e7f86f8a051f860d5c33d3ccb708",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Wolf_Mine_Shaft.jpg/220px-Wolf_Mine_Shaft.jpg",
				"previous": "Travels by fur trappers and adventurers, such as Manuel Lisa and Jim Bridger from 1807 to 1840, completed the exploration of the region. With the decline of the fur trade in the late 1840s and much of the prized beaver long since made scarce by over-trapping, few white explorers entered the forest over the next few decades.[14] The first federally financed expedition which passed through portions of Shoshone National Forest was the Raynolds Expedition of 1860, led by topographical engineer Captain William F. Raynolds.[16] The expedition included geologist and naturalist Ferdinand Vandeveer Hayden and was guided by mountain man Jim Bridger. Though the Raynolds Expedition was focused on exploration of the Yellowstone region, several efforts to enter what later became Yellowstone National Park were impeded by heavy snows across the mountain passes such as Two Ocean Pass. The expedition finally crossed the northern Wind River Range at a pass they named Union Pass and entered Jackson Hole valley to the south of Yellowstone.[16] Hayden led another expedition through the region in 1871. Hayden was primarily interested in documenting the Yellowstone country west of the forest, but his expedition also established that the forest was a prime resource that merited protection. Travels in the forest in the 1880s by later U.S. President Theodore Roosevelt, who was also a strong advocate of land conservation, as well as by General Philip Sheridan, provided the impetus that subsequently established the Yellowstone Timberland Reserve in 1891, creating the first national forest in the U.S.[5][17]",
				"after": "In 1902, President Roosevelt first greatly expanded the reserve and then divided the reserve into four separate units, with Shoshone being the largest. Upon the creation of the U.S. Forest Service in 1905, the reserve was designated a National Forest, but the current wording and title were formulated forty years later in 1945. A remnant of the earliest years of the forest management is the Wapiti Ranger Station which is located west of Cody, Wyoming. The station was built in 1903 and is the oldest surviving ranger station in any national forest, and is now designated a National Historic Landmark.[18]",
			"color": "black|0.36026 dark|0.086339 gray|0.086339 dark|0.086339 grey|0.086339 dim|0.063649 gray|0.063649 dim|0.063649 grey|0.063649 dark|0.059536 slate|0.059536 gray|0.059536 gray|0.046527 grey|0.046527 silver|0.036241 azure|0.028654 light|0.027449 gray|0.027449 light|0.027449 grey|0.027449 gainsboro|0.025808 light|0.025165 cyan|0.025165 alice|0.024225 blue|0.024225 mint|0.023616 cream|0.023616 white|0.020696 smoke|0.020696 powder|0.016649 blue|0.016649 slate|0.014867 gray|0.014867 white|0.014351 honeydew|0.013515 floral|0.013437 white|0.013437 snow|0.012966 light|0.012028 slate|0.012028 gray|0.012028 light|0.011382 blue|0.011382 ghost|0.01123 white|0.01123 cadet|0.010696 blue|0.010696 sea|0.0098589 shell|0.0098589 ivory|0.0083481 linen|0.0070793  "
		}
	}
}
