{
	"add": {
		"doc": {
			"id": "54e0d55d7b3ad853398f00d767e89b05e9de53346c9da1acaa693b26db157429",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Quehanna_Trail_2.jpg/220px-Quehanna_Trail_2.jpg",
				"previous": "Consequently, within a wild area, no new permanent camp leases, mines, wells, roads, or rights-of-way for utility lines are allowed, although existing camps, roads, and rights-of-way may remain. Vehicles are allowed only on public roads; trails are limited to hikers, bicyclists, equestrians, and wheelchairs, and only primitive camping by backpackers is allowed.[63] Quehanna has two paved roads open to vehicles, and is crossed by rights-of-way for three electrical power lines and two natural gas pipelines.[55] It is one of the largest areas in Pennsylvania without permanent inhabitants.[37]",
				"after": "The state forest system also has natural areas, with more restricted usage. According to the Bureau of Forestry, \"A natural area is an area of unique scenic, historic, geologic or ecological value that will be maintained in a natural condition by allowing physical and biological processes to operate, usually without direct human intervention.\"[63] Quehanna Wild Area contains two state forest natural areas: the 1,215-acre (492 ha) Wykoff Run Natural Area in the center,[66] and the 917-acre (371 ha) Marion Brooks Natural Area on the northwest edge.[67] Marion Brooks Natural Area, known for its 22-acre (8.9 ha) stand of white birch, was formerly known as Paige Run Natural Area; in 1975 it was renamed for Marion E. Brooks, a pioneering environmentalist from Elk County.[7][28][68] Quehanna Wild Area also has two wildlife viewing areas with blinds for observing elk and other animals: Beaver Run Dam's pond and wetlands and Hoover Farm's fields and feeding plots.[67]",
			"color": "black|0.81906 dark|0.12795 slate|0.12795 gray|0.12795 dark|0.011807 olive|0.011807 green|0.011807 dim|0.011395 gray|0.011395 dim|0.011395 grey|0.011395  "
		}
	}
}
