{
	"add": {
		"doc": {
			"id": "54e497a1a7693f5060f872b5677dc3502546eac0f30e9221fa189f262739646b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/B-17_Schweinfurt.jpg/220px-B-17_Schweinfurt.jpg",
				"previous": "As a result, the B-17s' loss rate was up to 25% on some early missions (60 of 291 B-17s were lost in combat on the second Raid on Schweinfurt[121]), and it was not until the advent of long-range fighter escorts (particularly the North American P-51 Mustang) resulting in the degradation of the Luftwaffe as an effective interceptor force between February and June 1944, that the B-17 became strategically potent.",
				"after": "The B-17 was noted for its ability to absorb battle damage, still reach its target and bring its crew home safely. Wally Hoffman, a B-17 pilot with the Eighth Air Force during World War II, said, \"The plane can be cut and slashed almost to pieces by enemy fire and bring its crew home.\"[122] Martin Caidin reported one instance in which a B-17 suffered a mid-air collision with a Focke-Wulf Fw 190, losing an engine and suffering serious damage to both the starboard horizontal stabilizer and the vertical stabilizer, and being knocked out of formation by the impact. The B-17 was reported as shot down by observers, but it survived and brought its crew home without injury.[123] Its toughness was compensation for its shorter range and lighter bomb load compared to the B-24 and British Avro Lancaster heavy bombers.[clarification needed] Stories abound of B-17s returning to base with tails having been destroyed, with only a single engine functioning or even with large portions of wings having been damaged by flak.[124] This durability, together with the large operational numbers in the Eighth Air Force and the fame achieved by the Memphis Belle, made the B-17 a key bomber aircraft of the war. Other factors such as combat effectiveness and political issues also contributed to the B-17's success.[125]",
			"color": " "
		}
	}
}
