{
	"add": {
		"doc": {
			"id": "601c586446fd3f0a0ce29cb0a06f02ff1c1d39cc4c6422df67c07eff36301ff2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/St_finbarres_cathedral1.jpg/170px-St_finbarres_cathedral1.jpg",
				"previous": "St. Patrick's Street, the main street of the city which was remodelled in the mid-2000s, is known for the architecture of the buildings along its pedestrian-friendly route and is the main shopping thoroughfare. The reason for its curved shape is that it originally was a channel of the River Lee that was built over on arches.[33] The General Post Office, with its limestone façade, is one of the most prominent buildings on the street and the focal point of much pedestrian activity. The original building on this site, the Theatre Royal was built in 1760 and burned down in 1840. The English circus proprietor Pablo Fanque, who enjoyed fame again in the 20th Century when The Beatles referenced him in a song, rebuilt an amphitheatre on this spot in 1850, which was subsequently transformed into a theatre and then into the present General Post Office in 1877.[34] [35] The adjacent Grand Parade is a tree-lined avenue, home to offices, shops and financial institutions. The old financial centre is the South Mall, with several banks whose interior derive from the 19th century, such as the Allied Irish Bank's which was once an exchange.",
				"after": "Many of the city's buildings are in the Georgian style, although there are a number of examples of modern landmark structures, such as County Hall tower, which was, at one time the tallest building in Ireland[36] until being superseded by another Cork City building: The Elysian. Across the river from County Hall is Ireland's longest building; built in Victorian times, Our Lady's Psychiatric Hospital has now been renovated and converted into a residential housing complex called Atkins Hall, after its architect William Atkins.",
			"color": "rosy|0.49639 brown|0.49639 black|0.23364 dim|0.068564 gray|0.068564 dim|0.068564 grey|0.068564 gray|0.04259 grey|0.04259 peru|0.024343 sandy|0.017259 brown|0.017259  "
		}
	}
}
