{
	"add": {
		"doc": {
			"id": "601d653b6cb114c3f82201bfecd64d1509c58e45a303f6357453fd31b9bb3ac4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/World_Trade_Center%2C_New_York_City_-_aerial_view_%28March_2001%29.jpg/85px-World_Trade_Center%2C_New_York_City_-_aerial_view_%28March_2001%29.jpg",
				"previous": "Portal:Technology/Selected articles/16",
				"after": "The construction of the World Trade Center started as a post-World War II urban renewal project, spearheaded by David Rockefeller, to help revitalize Lower Manhattan. The project was developed by the Port Authority of New York and New Jersey, which hired architect Minoru Yamasaki who came up with the specific idea for twin towers. The towers were designed as framed tube structures, which provided tenants with open floor plans, uninterrupted by columns or walls. This was accomplished using numerous, closely-spaced perimeter columns to provide much of the strength to the structure, along with gravity load shared with the core columns. The elevator system, which made use of sky lobbies and a system of express and local elevators, allowed substantial floor space to be freed up for use as office space by making the structural core smaller. The design and construction of the World Trade Center twin towers involved many other innovative techniques, such as the slurry wall for digging the foundation, and wind tunnel experiments. Construction of the World Trade Center's North Tower began in August 1968, and the South Tower in 1969. Extensive use of prefabricated components helped to speed up the construction process. The first tenants moved into the North Tower in December 1970 and into the South Tower in January 1972. Four other, low-level buildings were constructed as part of the World Trade Center in the 1970s, and a seventh building was constructed in the mid-1980s.",
			"color": "black|0.19567 dark|0.15937 gray|0.15937 dark|0.15937 grey|0.15937 silver|0.14798 dim|0.10945 gray|0.10945 dim|0.10945 grey|0.10945 gray|0.099474 grey|0.099474 tan|0.070375 dark|0.06627 slate|0.06627 gray|0.06627 light|0.026734 gray|0.026734 light|0.026734 grey|0.026734 wheat|0.012085 antique|0.0099689 white|0.0099689 gainsboro|0.0084527 slate|0.0080959 gray|0.0080959  "
		}
	}
}
