{
	"add": {
		"doc": {
			"id": "602ce4e0c88688a62e9334634c25c89fb56aa3ae66ca2ee5873b48fabaeb9af3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Auriscalpium_vulgare_137307.jpg/220px-Auriscalpium_vulgare_137307.jpg",
			"previous": [],
				"after": "Spore deposits are white. Viewed under a light microscope, the spores appear hyaline (translucent), covered with minute wart-like bumps, and are spherical or nearly so, with dimensions of 4.6–5.5 by 4–5 µm. They are amyloid (reacting to Melzer's reagent) and cyanophilous (staining in methyl blue).[13] The basidia (spore-bearing cells of the hymenium) are four-spored with basal clamps, and measure 15–24 by 3–4 µm, and sterigmata (extensions of the basidia that bear the spores) are swollen at the base and roughly 3 µm long. The hyphal system is dimitic, comprising both generative (undifferentiated) and skeletal (structural) hyphae. The thin-walled generative hyphae are hyaline, and have clamp connections; the thick-walled skeletal hyphae are thicker overall and lack such connections. The cortex (the tougher outer layer of flesh) is made of parallel unbranched generative hyphae that are brown, thick-walled, clumped together, and frequently clamped. The internal flesh is made of interwoven generative and skeletal hyphae. Gloeoplerous hyphae (containing oily or granular contents) are also present, protruding into the hymenium as club-like or sharp-pointed gloeocystidia.[19]",
			"color": "black|0.1041 sea|0.078184 shell|0.078184 white|0.077703 smoke|0.077703 floral|0.075678 white|0.075678 snow|0.07524 white|0.069656 ghost|0.065297 white|0.065297 mint|0.063145 cream|0.063145 linen|0.060264 alice|0.053502 blue|0.053502 lavender|0.045869 blush|0.045869 azure|0.043528 saddle|0.025312 brown|0.025312 old|0.025145 lace|0.025145 gainsboro|0.019661 ivory|0.013334 dim|0.012607 gray|0.012607 dim|0.012607 grey|0.012607 antique|0.010627 white|0.010627 gray|0.0085036 grey|0.0085036 misty|0.0083431 rose|0.0083431 light|0.0069639 gray|0.0069639 light|0.0069639 grey|0.0069639  "
		}
	}
}
