{
	"add": {
		"doc": {
			"id": "603b2107a093a55eb3a96317f31453027225a2e2d5803bcb6297d9d8b280c79c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Le_Rhone_9C.jpg/220px-Le_Rhone_9C.jpg",
				"previous": "In military aircraft designs, the large frontal area of the engine acted as an extra layer of armor for the pilot. Also air-cooled engines, without vulnerable radiators, are slightly less prone to battle damage, and on occasion would continue running even with one or more cylinders shot away. However, the large frontal area also resulted in an aircraft with an aerodynamically inefficient increased frontal area.",
				"after": "Rotary engines have the cylinders in a circle around the crankcase, as in a radial engine, (see above), but the crankshaft is fixed to the airframe and the propeller is fixed to the engine case, so that the crankcase and cylinders rotate. The advantage of this arrangement is that a satisfactory flow of cooling air is maintained even at low airspeeds, retaining the weight advantage and simplicity of a conventional air-cooled engine without one of their major drawbacks. The first practical rotary engine was the Gnome Omega designed by the Seguin brothers and first flown in 1909. Its relative reliability and good power to weight ratio changed aviation dramatically. [10] Before the first World War most speed records were gained using Gnome-engined aircraft, and in the early years of the war rotary engines were dominant in aircraft types for which speed and agility were paramount. To increase power, engines with two rows of cylinders were built.",
			"color": "black|0.28664 dark|0.1801 slate|0.1801 gray|0.1801 dim|0.10543 gray|0.10543 dim|0.10543 grey|0.10543 gray|0.095958 grey|0.095958 dark|0.043741 gray|0.043741 dark|0.043741 grey|0.043741 silver|0.030706 tan|0.02865 saddle|0.021937 brown|0.021937 light|0.021689 gray|0.021689 light|0.021689 grey|0.021689 antique|0.015209 white|0.015209 gainsboro|0.014833 linen|0.01374 old|0.010953 lace|0.010953 sea|0.009287 shell|0.009287 floral|0.0090631 white|0.0090631 slate|0.0087725 gray|0.0087725 bisque|0.0087091  "
		}
	}
}
