{
	"add": {
		"doc": {
			"id": "605ca77d14eb002faa549223a5c4a821375149bf505886038c1f3ab39c09406b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Bundesarchiv_Bild_101I-445-1861-19%2C_Nordafrika%2C_Arbeit_an_Bordwaffen_einer_Me_210-410.jpg/220px-Bundesarchiv_Bild_101I-445-1861-19%2C_Nordafrika%2C_Arbeit_an_Bordwaffen_einer_Me_210-410.jpg",
				"previous": "Not all turret designs put the gunner in the turret along with the armament. Both the Americans and Germans produced aircraft with remote controlled turrets. In the US, the large, purpose-built Northrop P-61 Black Widow night fighter was produced with a remotely operated dorsal turret that had a wide range of fire though in practice it was generally fired directly forward under control of the pilot. For the last Douglas-built production blocks of the B-17F (the \"B-17F-xx-DL\" designated blocks), and for all versions of the B-17G Flying Fortress a twin-gun remotely operated \"chin\" turret, designed by Bendix and first used on the experimental YB-40 \"gunship\" version of the Fortress, was added to give more forward defence. Specifically designed to be compact and not obstruct the bombardier, it was operated by a swing-away diagonal column possessing a yoke to traverse the turret, and aimed by a reflector sight mounted in the windscreen.",
				"after": "The intended replacement for the German Bf 110 heavy fighter, the Messerschmitt Me 210, possessed twin half-teardrop-shaped, remotely operated Ferngerichtete Drehringseitenlafette FDSL 131/1B turrets, one on each side \"flank\" of the rear fuselage to defend the rear of the aircraft, controlled from the rear area of the cockpit. By 1942, the German He 177A Greif heavy bomber would feature a Fernbedienbare Drehlafette FDL 131Z remotely operated forward dorsal turret, armed with twin 13mm MG 131 machine guns on the top of the fuselage, which was operated from a hemispherical, clear rotating \"astrodome\" just behind the cockpit glazing and offset to starboard atop the fuselage — a second, manned powered Hydraulische Drehlafette HDL 131 dorsal turret, further aft on the fuselage with a single MG 131 was also used on most examples.",
			"color": " "
		}
	}
}
