{
	"add": {
		"doc": {
			"id": "606af4e0f95f44c1b8c4dff2bce9a1f73a341d9e2d188689b21ded82c2ade219",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/1_epcot_spaceship_earth_2010a.JPG/220px-1_epcot_spaceship_earth_2010a.JPG",
			"previous": [
				"",
				"Coincidentally, Disneyland is in Orange County in California and Walt Disney World is in Orange County in Florida.",
				"Designed to supplement Disneyland in Anaheim, California, which had opened in 1955, the complex was developed by Walt Disney in the 1960s. \"The Florida Project\", as he called it, was originally to be built in hopes of differential in design and scheme from Disneyland with its own diverse set of rides. Walt Disney's original plans also called for the inclusion of an \"Experimental Prototype Community of Tomorrow\", a planned community that would serve as a test bed for new innovations for city living. After extensive lobbying, the Government of Florida created the Reedy Creek Improvement District, a special government district that essentially gave The Walt Disney Company the standard powers and autonomy of an incorporated city. However, Disney died on December 15, 1966, before construction began. Without the mind of Disney spearheading the construction of Walt Disney World, the Disney Company instead created the resort very similar to Disneyland, just on a much larger scale, along with abandoning his concept of an experimental planned community."
			],
				"after": "In 1959, Walt Disney Productions began looking for land for a second park to supplement Disneyland, which opened in Anaheim, California, in 1955. Market surveys revealed that only 5% of Disneyland's visitors came from east of the Mississippi River, where 75% of the population of the United States lived. Additionally, Walt Disney disliked the businesses that had sprung up around Disneyland and wanted control of a much larger area of land for the new project.[2]",
			"color": "gray|0.18632 grey|0.18632 dim|0.18542 gray|0.18542 dim|0.18542 grey|0.18542 dark|0.1759 gray|0.1759 dark|0.1759 grey|0.1759 black|0.097489 olive|0.082274 silver|0.055312 light|0.037143 slate|0.037143 gray|0.037143 light|0.025588 gray|0.025588 light|0.025588 grey|0.025588 slate|0.025354 gray|0.025354 dark|0.024235 olive|0.024235 green|0.024235 light|0.022025 steel|0.022025 blue|0.022025 gainsboro|0.016505 rosy|0.01023 brown|0.01023  "
		}
	}
}
