{
	"add": {
		"doc": {
			"id": "606c94316e6b4505f6e61a07702f357b118f344d7c1f879e42cb72393f15c25c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Sellosaurus.jpg/220px-Sellosaurus.jpg",
			"previous": [],
				"after": "The taxonomic history of Plateosaurus is \"long and confusing\", a \"chaotic tangle of names\".[R] As of 2011, only two species are universally accepted as valid:[3][16] the type species P. engelhardti and P. gracilis, previously assigned to its own genus Sellosaurus. British palaeontologist Peter Galton showed clearly that all cranial material from Trossingen, Halberstadt and Frick pertains to one species.[8] Moser performed the most extensive and detailed investigation of all plateosaurid material from Germany and Switzerland, concluding that all Plateosaurus and most other prosauropod material from the Keuper stems from the same species as the type material of Plateosaurus engelhardti.[3] Moser considered Sellosaurus to be the same genus as Plateosaurus, but did not discuss whether S. gracilis and P. engelhardti belong to the same species.[S] Palaeontologist Adam Yates of the University of the Witwatersrand cast further doubt on the generic separation. He included the type material of Sellosaurus gracilis in Plateosaurus as P. gracilis and reintroduced the old name Efraasia for some material that had been assigned to Sellosaurus.[16] In 1926, von Huene had already concluded the two genera were the same.[T]",
			"color": "black|0.15558 dark|0.11055 gray|0.11055 dark|0.11055 grey|0.11055 white|0.062734 smoke|0.062734 sea|0.060896 shell|0.060896 snow|0.060791 white|0.060071 mint|0.05967 cream|0.05967 floral|0.059197 white|0.059197 ghost|0.058218 white|0.058218 azure|0.057162 alice|0.055889 blue|0.055889 lavender|0.045192 blush|0.045192 silver|0.03581 gray|0.028055 grey|0.028055 light|0.01966 gray|0.01966 light|0.01966 grey|0.01966 dim|0.018314 gray|0.018314 dim|0.018314 grey|0.018314 gainsboro|0.016506 ivory|0.013269 linen|0.01052 dark|0.0044396 khaki|0.0044396  "
		}
	}
}
