{
	"add": {
		"doc": {
			"id": "60704e68687aa667a8bf2c538e7e63e22ed1ee1b2209b2a90114e9c3c014e0f1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Embraer-g-erjc.jpg/220px-Embraer-g-erjc.jpg",
				"previous": "This was addressed by Bombardier's twin-engine Canadair Regional Jet, which became a best-seller. The CRJ's range is enough to fill mid-range routes as well, routes previously served by larger aircraft such as the Boeing 737 and DC-9. These aircraft were originally intended to be used for direct airport-to-airport flights, bypassing hubs, and led to industry-wide discussions about the decline of the hub-and-spoke model. Although not as economical as the turboprop, by flying directly to and from smaller airports, they reduced the need for low-cost regional airliners. And although turboprops are quiet to outside observers, propwash makes them very noisy inside.[1] Passengers greatly preferred jets, both for real and perception reasons.",
				"after": "As had happened with the turboprops of only a few years earlier, the success of the CRJ led to the introduction of a host of competitors. The only successful example[citation needed] is the Embraer ERJ 145, which has seen excellent sales and has competed strongly with the CRJ in most markets. Bombardier and Embraer have been locked in a series of counter-lawsuits over export taxes and subsidies ever since. The ERJ's success led to a totally new version, the Embraer E-Jets series. Bombardier plans to build competing aircraft in response, the CSeries. It is currently in its developing stages.",
			"color": "dark|0.59035 olive|0.59035 green|0.59035 dim|0.13386 gray|0.13386 dim|0.13386 grey|0.13386 gray|0.075508 grey|0.075508 dark|0.044005 gray|0.044005 dark|0.044005 grey|0.044005 black|0.027829 silver|0.018847 light|0.012925 gray|0.012925 light|0.012925 grey|0.012925 slate|0.010338 gray|0.010338 gainsboro|0.010191 light|0.008566 slate|0.008566 gray|0.008566 white|0.0074 smoke|0.0074 snow|0.0062098 sea|0.0060483 shell|0.0060483 ghost|0.0060188 white|0.0060188 white|0.0056356 alice|0.0054568 blue|0.0054568 floral|0.004728 white|0.004728 mint|0.0047219 cream|0.0047219  "
		}
	}
}
