{
	"add": {
		"doc": {
			"id": "609f311b1e829d0dfb3942a2f411a87a03902fdd7d3485d79662d380b24885e1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Agaricus_tigrinus%2C_Schaefer_1762.jpg/220px-Agaricus_tigrinus%2C_Schaefer_1762.jpg",
			"previous": [],
				"after": "Christiaan Hendrik Persoon described this species as Agaricus myomyces var. pardinus in 1801, although he queried whether it was a distinct species.[2] However, the German naturalist Jacob Christian Schäffer had in 1762 published Fungorum qui in Bavaria et Palatinatu circa Ratisbonam nascuntur Icones,[3] in which he described a mushroom he called Agaricus tigrinus. The illustration accompanying the name fits what we now know as Tricholoma pardinum, although the description is less clear.[4] To confuse matters further, Elias Magnus Fries used the name Agaricus tigrinus in his 1821 work Systema Mycologicum,[5] in accordance with Bulliard's 1782 description, which now corresponds with Lentinus tigrinus.[4] In his 1838 work Epicrisis systematis mycologici: seu synopsis hymenomycetum, Fries assigned a different fungus again to the binomial name and linked it to Schäffer's 1762 description.[6] French mycologist Lucien Quélet reclassified it as a species in 1873, giving it its current binomial name.[7] Italian mycologist Alfredo Riva has noted that Swiss mycologist Louis Secretan provided a description forty years before Quélet, in his 1833 work Mycographie Suisse,[8] and queried why it was ignored. He has proposed the fungus be written as Tricholoma pardinum (Secr.) Quél.[4] However, Secretan's works are generally not recognised for nomenclatural purposes because he did not use binomial nomenclature consistently.[9][10]",
			"color": "black|0.14853 dark|0.085296 gray|0.085296 dark|0.085296 grey|0.085296 silver|0.070394 gray|0.064086 grey|0.064086 dim|0.05837 gray|0.05837 dim|0.05837 grey|0.05837 light|0.053927 gray|0.053927 light|0.053927 grey|0.053927 antique|0.050519 white|0.050519 linen|0.049028 gainsboro|0.0447 old|0.038018 lace|0.038018 sea|0.037394 shell|0.037394 floral|0.035023 white|0.035023 white|0.029686 smoke|0.029686 snow|0.02394 ivory|0.022318 mint|0.02078 cream|0.02078 papaya|0.020396 whip|0.020396 beige|0.01936 white|0.018076 blanched|0.014469 almond|0.014469 bisque|0.012175 tan|0.012103 ghost|0.01047 white|0.01047 corn|0.009093 silk|0.009093 azure|0.0078045 misty|0.0073466 rose|0.0073466 alice|0.0056909 blue|0.0056909 honeydew|0.0054978  "
		}
	}
}
