{
	"add": {
		"doc": {
			"id": "60a15675ecb8c18e50b6fd6fbbb321741460dd3171712e288db33031503bae6a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/US_Navy_Boeing_FA-18F_Super_Hornet_AVV_Creek.jpg/220px-US_Navy_Boeing_FA-18F_Super_Hornet_AVV_Creek.jpg",
				"previous": "The United States Marine Corps has avoided the Super Hornet program and their resistance is so high that they would rather fly former Navy F/A-18Cs that have been replaced with Super Hornets. This is said to be because they fear that any Super Hornet buys will be at the cost of the F-35B STOVL fighters that they intend to operate from amphibious ships.[111] As a concession, the Marine Corps has agreed to eventually equip five Marine fighter-attack squadrons (VMFA) with the F-35C carrier variant to continue to augment Navy carrier air wings as they currently do with the F/A-18C.[112]",
				"after": "Boeing offered Malaysia the Super Hornets as part of a buy-back package for its existing F/A-18 Hornets in 2002. However, the Super Hornet procurement was halted in 2007 after the government decided to purchase the Sukhoi Su-30MKM instead. But Chief Gen. Datuk Nik Ismail Nik Mohamaed of the Royal Malaysian Air Force (RMAF) indicated that the air force had not planned to end procurement of the Super Hornets, instead saying that it needed such fighters.[113] In a separate deal, the RMAF's MiG-29 will be replaced in 2015. The F/A-18F Super Hornet is one of the leading contenders for the MiG-29 replacement MRCA program. Under the program, the RMAF is looking to equip three squadrons with 36 to 40 new fighter aircraft with an estimated budget of RM6 billion to RM8 billion (US$1.84 billion to US$2.46 billion). The other competitors are the Eurofighter Typhoon, Dassault Rafale and Saab JAS 39 Gripen.[114]",
			"color": "steel|0.76812 blue|0.76812 black|0.084646 dim|0.030848 gray|0.030848 dim|0.030848 grey|0.030848 dark|0.016134 gray|0.016134 dark|0.016134 grey|0.016134 gray|0.012516 grey|0.012516 light|0.012098 slate|0.012098 gray|0.012098 slate|0.01194 gray|0.01194 silver|0.010446 light|0.0081807 gray|0.0081807 light|0.0081807 grey|0.0081807 gainsboro|0.0067379 light|0.0061942 steel|0.0061942 blue|0.0061942  "
		}
	}
}
