{
	"add": {
		"doc": {
			"id": "60a354318424db7d7205868c9a7f3bf446ac9ac1fe874ad2eea331a07ccf011e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/%C4%B0stanbul_radio1.JPG/220px-%C4%B0stanbul_radio1.JPG",
				"previous": "Today, Istanbul hosts a wide variety of periodicals. Most nationwide newspapers are based in Istanbul, with simultaneous Ankara and İzmir editions.[246] Istanbul-based Zaman, although only founded in 1986, is Turkey's most widely circulated paper, with a weekly distribution of more than one million, twice that of its nearest competitor. Posta, Hürriyet, and Sözcü, which round out the country's top four papers, are all headquartered in Istanbul, boasting more than 300,000 weekly sales each. Hürriyet's English-language edition, The Hürriyet Daily News, has been printed since 1961, but the English-language Today's Zaman, first published by Zaman in 2007, has overtaken it in circulation. Several smaller newspapers, including popular publications like Habertürk and Milliyet, are also based in Istanbul.[246][247]",
				"after": "Radio broadcasts in Istanbul date back to 1927, when Turkey's first radio transmission came from atop the Central Post Office in Eminönü. Control of this transmission, and other radio stations established in the following decades, ultimately came under the state-run Turkish Radio and Television Corporation (TRT), which held a monopoly on radio and television broadcasts between its founding in 1964 and 1990.[248] Today, TRT runs four national radio stations; while these stations have transmitters across the country so each can reach over 90 percent of the country's population, only one—Radio 2—is based in Istanbul. Offering a range of content from educational programming to coverage of sporting events, Radio 2 is the most popular radio station in Turkey.[248] Istanbul's airwaves are the busiest in Turkey, primarily featuring either Turkish-language or English-language content. One of the rare exceptions, offering both, is Açık Radyo (94.9 FM). Among Turkey's first private stations, and the first featuring foreign popular music, was Istanbul's Metro FM (97.2 FM). The state-run Radio 3, although based in Ankara, also features English-language popular music, while English-language news programming is provided on NTV Radyo (102.8 FM).[249]",
			"color": "black|0.32866 light|0.085372 gray|0.085372 light|0.085372 grey|0.085372 gainsboro|0.078869 silver|0.070759 dark|0.070616 gray|0.070616 dark|0.070616 grey|0.070616 dim|0.049616 gray|0.049616 dim|0.049616 grey|0.049616 gray|0.04887 grey|0.04887 lavender|0.031444 blush|0.031444 white|0.03108 smoke|0.03108 lavender|0.025896 ghost|0.024814 white|0.024814 alice|0.021937 blue|0.021937 snow|0.020597 light|0.015226 slate|0.015226 gray|0.015226 sea|0.014034 shell|0.014034 linen|0.013635 white|0.011286 slate|0.0086966 gray|0.0086966 misty|0.0073986 rose|0.0073986 floral|0.0063624 white|0.0063624 light|0.0062638 steel|0.0062638 blue|0.0062638 brown|0.0048939 mint|0.0041778 cream|0.0041778  "
		}
	}
}
