{
	"add": {
		"doc": {
			"id": "60ac51fb0ea1bad5e8d1f6df37fc61c9e91c33846601fce115779edffc488d6f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Nasikabatrachus_sahyadrensis.jpg/220px-Nasikabatrachus_sahyadrensis.jpg",
				"previous": "Some frogs have become adapted for burrowing and a life underground. They tend to have rounded bodies, short limbs, small heads with bulging eyes, and hind feet adapted for excavation. An extreme example of this is the purple frog (Nasikabatrachus sahyadrensis) from southern India which feeds on termites and spends almost its whole life underground. It emerges briefly during the monsoon to mate and breed in temporary pools. It has a tiny head with a pointed snout and a plump, rounded body. Because of this fossorial existence, it was first described in 2003, being new to the scientific community at that time, although previously known to local people.[96]",
				"after": "The spadefoot toads of North America are also adapted to underground life. The plains spadefoot toad (Spea bombifrons) is typical and has a flap of keratinised bone attached to one of the metatarsals of the hind feet which it uses to dig itself backwards into the ground. As it digs, the toad wriggles its hips from side to side to sink into the loose soil. It has a shallow burrow in the summer from which it emerges at night to forage. In winter, it digs much deeper and has been recorded at a depth of 4.5 m (15 ft).[97] The tunnel is filled with soil and the toad hibernates in a small chamber at the end. During this time, urea accumulates in its tissues and water is drawn in from the surrounding damp soil by osmosis to supply the toad's needs.[97] Spadefoot toads are \"explosive breeders\", all emerging from their burrows at the same time and converging on temporary pools, attracted to one of these by the calling of the first male to find a suitable breeding location.[98]",
			"color": "dim|0.41419 gray|0.41419 dim|0.41419 grey|0.41419 gray|0.31594 grey|0.31594 dark|0.11875 gray|0.11875 dark|0.11875 grey|0.11875 rosy|0.052086 brown|0.052086 silver|0.030663 light|0.012697 gray|0.012697 light|0.012697 grey|0.012697 gainsboro|0.0081392 misty|0.0075505 rose|0.0075505  "
		}
	}
}
