{
	"add": {
		"doc": {
			"id": "60bb9a6a9b1d811f2ad0ce65f9221d71a7a287791ea3f6f565f84751ce82d524",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Red_Arrows%2C_Southport_Airshow_2009_%2801%29.jpg/220px-Red_Arrows%2C_Southport_Airshow_2009_%2801%29.jpg",
				"previous": "As well as the nine pilots, 'Red 10', who is the Team Supervisor, is a fully qualified Hawk pilot who flies the tenth aircraft when the Red Arrows are away from base. This means the team have a reserve aircraft at the display site. Red 10's duties include co-ordination of all practices and displays and acting as the team's Ground Safety Officer. Red 10 often flies TV cameramen and photographers for air-to-air pictures of the Red Arrows and also provides the commentary for all of the team's displays.[11]",
				"after": "On 13 May 2009, it was announced that the Red Arrows would include their first female display pilot. Flt Lt Kirsty Moore (née Stewart) joined for the 2010 season alongside fellow newcomer Flt Lt Ben Plank. Wing Commander Jas Hawker concluded his three-year tour of duty as 'The Boss' and was replaced by 2009 Red Six, Squadron Leader Ben Murphy.[12] Flt Lt Moore was not the first female to apply to become a Red Arrow, but was the first to be taken forward to the intense final selection process. She joined the RAF in 1998 and was a Qualified Flying Instructor on the Hawk aircraft at RAF Valley. Prior to joining the team she flew the Tornado GR4 at RAF Marham.[13] Flt Lt Plank previously flew the Harrier GR9 at RAF Cottesmore.",
			"color": "lavender|0.32829 alice|0.15225 blue|0.15225 light|0.13342 blue|0.13342 ghost|0.062269 white|0.062269 azure|0.043775 light|0.040947 cyan|0.040947 gainsboro|0.037093 light|0.032843 steel|0.032843 blue|0.032843 black|0.029111 white|0.025988 smoke|0.025988 powder|0.020193 blue|0.020193 light|0.016563 gray|0.016563 light|0.016563 grey|0.016563 mint|0.010401 cream|0.010401 silver|0.010216 white|0.0070136 snow|0.0048386 dark|0.0036971 gray|0.0036971 dark|0.0036971 grey|0.0036971 firebrick|0.0031135 pale|0.0028922 turquoise|0.0028922 maroon|0.0027882  "
		}
	}
}
