{
	"add": {
		"doc": {
			"id": "60c419c5658c7cb538ffacec8d9be44a7d9b999bdc14adfb466a83ac9edf8de2",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5d/Macnaghten_memorandum.JPG/170px-Macnaghten_memorandum.JPG",
				"previous": "Shortly after Kelly's murder, stories that the Ripper had drowned in the Thames began to circulate.[27] In February 1891, the MP for West Dorset, Henry Richard Farquharson, announced that Jack the Ripper was \"the son of a surgeon\" who had committed suicide on the night of the last murder. Although Farquharson did not name his suspect, the description resembles Druitt. Farquharson lived 10 miles (16 km) from the Druitt family and was part of the same social class.[78] The Victorian journalist George R. Sims noted in his memoirs, The Mysteries of Modern London (1906): \"[the Ripper's] body was found in the Thames after it had been in the river for about a month\".[79] Similar comments were made by Sir John Moylan, Assistant Under-Secretary of the Home Office: \"[the Ripper] escaped justice by committing suicide at the end of 1888\" and Sir Basil Thomson, made Assistant Commissioner of the CID in 1913: \"[the Ripper was] an insane Russian doctor [who] escaped arrest by committing suicide in the Thames at the end of 1888\".[80] Neither Moylan nor Thomson was involved in the Ripper investigation.[81]",
				"after": "Assistant Chief Constable Sir Melville Macnaghten named Druitt as a suspect in the case in a private handwritten memorandum of 23 February 1894. Macnaghten highlighted the coincidence between Druitt's disappearance and death shortly after the last of the five murders on 9 November 1888, and claimed to have unspecified \"private information\" that left \"little doubt\" Druitt's own family believed him to have been the murderer.[82] Macnaghten's memo was eventually discovered in his personal papers by his daughter, Lady Aberconway, who showed them to British broadcaster Dan Farson. A slightly different abridged copy of the memo found in the Metropolitan Police archive was released to the public in 1966.[83] Farson first revealed Druitt's initials \"MJD\" in a television programme in November 1959.[84]",
			"color": "light|0.23916 gray|0.23916 light|0.23916 grey|0.23916 gainsboro|0.23218 silver|0.1628 dark|0.076161 gray|0.076161 dark|0.076161 grey|0.076161 gray|0.058231 grey|0.058231 white|0.055403 smoke|0.055403 dim|0.037637 gray|0.037637 dim|0.037637 grey|0.037637 lavender|0.022324 blush|0.022324 alice|0.022254 blue|0.022254 ghost|0.020618 white|0.020618 snow|0.014704 sea|0.01243 shell|0.01243 white|0.010167 linen|0.0091508 lavender|0.0082003 mint|0.0059093 cream|0.0059093 azure|0.0057695 floral|0.003871 white|0.003871  "
		}
	}
}
