{
	"add": {
		"doc": {
			"id": "60c5cef7264b529bf682a03df1bc3d2416b84f2fb6d9900127f0d3184a79ea69",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Skanderbeg%2C_De_Romanorum_Magistratibus.jpg/220px-Skanderbeg%2C_De_Romanorum_Magistratibus.jpg",
				"previous": "The only legitimate daughter of Duke Ferrante, Irene Castriota Scanderbeg, born to Andreana Acquaviva d'Aragona from the Nardò dukes, inherited the paternal estate, bringing the Duchy of Galatina and County of Soleto into the Sanseverino family after her marriage with Prince Pietrantonio Sanseverino (1508–1559). They had a son, Nicolò Bernardino Sanseverino (1541–1606), but the male line of descendants was lost after Irenece Castriota. Through the female lines, his descendants include the ruling (or former ruling) families of Belgium, Luxembourg, Austria-Hungary, Prussia, Serbia, and some members of the British royal family. Other prominent modern descendants include Filippo Castriota, collaborator of Ismail Qemali, founder of modern Albania and author Giorgio Maria Castriota.[citation needed]",
				"after": "The Ottoman Empire's expansion ground to a halt during the time that Skanderbeg's forces resisted. He has been credited with being one of the main reasons for the delay of Ottoman expansion into Western Europe, giving the Italian principalities more time to better prepare for the Ottoman arrival.[53][130] While the Albanian resistance certainly played a vital role, it was one of numerous relevant events that played out in the mid-15th century. Much credit must also go to the successful resistance mounted by Vlad III Dracula in Wallachia and Stephen III the Great of Moldavia, who dealt the Ottomans their worst defeat at Vaslui, among many others, as well as the defeats inflicted upon the Ottomans by Hunyadi and his Hungarian forces.[131] Along with Skanderbeg, Stephen III the Great and Hunyadi achieved the title of Athletae Christi (Christ's champions). The distinguishing characteristic of Skanderbeg was the maintenance of such an effective resistance for a long period of time (25 years) against one of the 15th century's strongest powers while possessing very limited economic and human resources. His political, diplomatic, and military abilities were the main factors enabling the small Albanian principalities to achieve such a success.",
			"color": " "
		}
	}
}
