{
	"add": {
		"doc": {
			"id": "60c5fb62efb8e373a0e8afc2812dde9e879ef0ac9eff827ce011ddfd6e3e3abc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/James_Cagney_and_Joan_Blondell_in_Footlight_Parade_trailer.jpg/237px-James_Cagney_and_Joan_Blondell_in_Footlight_Parade_trailer.jpg",
				"previous": "With the collapse of the market for musicals, Warner Bros., under Zanuck turned to more socially realistic storylines. For its many films about gangsters;[18] Warner Bros. soon became known as a \"gangster studio\".[19] The studio's first gangster film, Little Caesar, was a great box office success[HBTN 25] and Edward G. Robinson starred in many of the subsequent Warner gangster films.[cph 20] The studio's next effort, The Public Enemy,[HBTN 26] made James Cagney arguably the studio's new top star,[cph 21] and Warner Bros. made more gangster films.[HBTN 26]",
				"after": "Another gangster film the studio produced was the critically acclaimed I Am a Fugitive from a Chain Gang, based on a true story and starring Paul Muni,[cph 22] joining Cagney and Robinson as one the studio's top gangster stars[HBTN 27] after appearing in the successful film,[HBTN 26] which convinced audiences to question the American legal system.[20] By January 1933, the film's protagonist Robert Elliot Burns – still imprisoned in New Jersey – and other chain gang prisoners nationwide appealed and were released.[21] In January 1933, Georgia chain gang warden J. Harold Hardy – who was also made into a character in the film – sued the studio for displaying \"vicious, untrue and false attacks\" against him in the film.[22] After appearing in the Warner's film The Man Who Played God, Bette Davis became a top star.[cph 23]",
			"color": "black|0.39498 silver|0.12359 dark|0.10536 gray|0.10536 dark|0.10536 grey|0.10536 light|0.09928 gray|0.09928 light|0.09928 grey|0.09928 gainsboro|0.078525 dim|0.074272 gray|0.074272 dim|0.074272 grey|0.074272 gray|0.067855 grey|0.067855 white|0.011296 smoke|0.011296 lavender|0.0060265 blush|0.0060265 sea|0.0053851 shell|0.0053851 linen|0.0053719 ghost|0.005114 white|0.005114 snow|0.0048652 alice|0.0048412 blue|0.0048412 white|0.0035599 floral|0.0033283 white|0.0033283  "
		}
	}
}
