{
	"add": {
		"doc": {
			"id": "60c6cf0445dcc71227fe1deceb2cadee0dd1e8ef9a7d28703b439e00797ab7b0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Rosa_Bonheur_-_La_foire_du_cheval.jpg/330px-Rosa_Bonheur_-_La_foire_du_cheval.jpg",
			"previous": [],
				"after": "Arabian stallions were made available to Percheron breeders for use in breeding army mounts, beginning in 1760 at the royal stud at Le Pin.[10][12] Between 1789 and the early 1800s, the Percheron was in danger of becoming extinct as horse breeding was suppressed during the French Revolution and its aftermath. Early histories of the breed point to two gray Arabian stallions from Le Pin, Godolphin and Gallipoly, as the blood that helped to restart Percheron breeding. However, later research found that Godolphin was a chestnut Arabian of ordinary conformation and no special worth, while Gallipoly was a gray saddle horse of unknown breeding. Modern breed historians contest that there was enough breeding stock left after the early 19th century to restart the breed without further Arabian influence, and state that it is unlikely that two horses of unremarkable breeding and conformation had a significant influence on the breed.[13] Jean le Blanc, a founding stallion of the Percheron breed, was foaled in 1823. Today, all Percherons trace their ancestry to this stallion.[10] At this time the breed also became larger, with horses from other French districts being imported to Perche to change the Percheron from a coach horse averaging 1,200 to 1,400 pounds (540 to 640 kg) to a draft horse averaging 2,000 pounds (910 kg).[13] In 1893, the first Percheron stud book was created in France.[7] By 1910, French registrations had risen to almost 32,000 horses. Between 1880 and 1920, Percheron breeders in France exported horses all over the world, including South Africa, South America, Australia and North America.[12]",
			"color": "black|0.68173 beige|0.041137 light|0.035229 gray|0.035229 light|0.035229 grey|0.035229 gainsboro|0.034909 dim|0.029917 gray|0.029917 dim|0.029917 grey|0.029917  "
		}
	}
}
