{
	"add": {
		"doc": {
			"id": "60c89a6ca181146f1b8e9a9c622c778a4e42ea4d7eb6d405d30342449a964374",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Like_A_Prayer_Seattle_cropped.jpg/220px-Like_A_Prayer_Seattle_cropped.jpg",
				"previous": "A dance version of the song, mixed with fragments of the dance track \"Feels Like Home\" by Meck, was performed in the 2008–09 Sticky & Sweet Tour as part of the rave segment. Madonna's line \"feels like home\" was replaced by the same line from Meck’s song. In the rave segment, Madonna appeared wearing a breastplate and a short wig.[106] She danced energetically around the whole stage as backup singer Nicki Richards provided vocals during the intermediate solo. Screens displayed a message of equality of religions, as symbols and texts from different scriptures flashed by, including messages from the Bible, Qur'an, Torah and Talmud.[107] The performance ended with the line \"We all come from the Light and to it shall we return\", as a circular screen covered Madonna to give way to the next song, \"Ray of Light\".[108] Helen Brown from The Daily Telegraph declared the performance as one of the highlights of the tour,[109] while Joey Guerra from Houston Chronicle compared the sequences of Madonna rising on a platform with that of a superhero.[110] The performance was included both in the CD and DVD of the live release of the tour, titled Sticky & Sweet Tour, filmed in Buenos Aires, Argentina from December 4–7, 2008.[108] In January 2010, Madonna performed an acoustic version of the song live during the Hope For Haiti telethon. Jon Caramanica of The New York Times commented: \"For 20 years, that song has been the symbol of one of the most tumultuous and controversial periods in Madonna's life. But for five minutes tonight, it was pure, put in service of something bigger than the singer.\"[111]",
				"after": "For The MDNA Tour in 2012, a modernized gospel version of \"Like a Prayer\" was performed as the second-to-last song of the show.[112] This version featured Madonna and 36 of her back-up singers, who played the role of a choir and wore church robes, energetically performing the song as images of a gothic church and Hebrew letters appeared on the backdrops.[113][114] Critical response towards the performance was generally positive, with many reviewers deeming it a highlight of the show.[115] Jim Harrington from The Oakland Tribune gave the overall concert a negative review but stated that \"It wasn't until the last two songs—\"Like a Prayer\" and \"Celebration\"—that the whole deal finally clicked\".[112] Timothy Finn from The Kansas City Star was particularly impressed with the backing choir, calling it \"the best use of one since Foreigner’s \"I Want to Know What Love Is\".[115] The performance of the song at the November 19–20, 2012 shows in Miami, at the American Airlines Arena, were recorded and released in Madonna's fourth live album, MDNA World Tour.[116][117]",
			"color": "black|0.27997 thistle|0.12129 dark|0.075804 gray|0.075804 dark|0.075804 grey|0.075804 gray|0.068508 grey|0.068508 dim|0.06164 gray|0.06164 dim|0.06164 grey|0.06164 silver|0.060145 light|0.044431 gray|0.044431 light|0.044431 grey|0.044431 plum|0.040014 gainsboro|0.034711 lavender|0.025115 white|0.015161 smoke|0.015161 light|0.01381 steel|0.01381 blue|0.01381 sea|0.012672 shell|0.012672 snow|0.012076 floral|0.011584 white|0.011584 linen|0.011528 white|0.010721 ghost|0.010609 white|0.010609 mint|0.010315 cream|0.010315 lavender|0.010008 blush|0.010008 alice|0.0084588 blue|0.0084588 old|0.0080452 lace|0.0080452 ivory|0.0074249 azure|0.0066011 antique|0.0052304 white|0.0052304  "
		}
	}
}
