{
	"add": {
		"doc": {
			"id": "60ca004b24f4c8217b50a75fa9e4f46c218cb0a1032cbc9a90dadbea840b91d7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Bath_Abbey_Nave_Fan_Vaulting%2C_Somerset%2C_UK_-_Diliff.jpg/170px-Bath_Abbey_Nave_Fan_Vaulting%2C_Somerset%2C_UK_-_Diliff.jpg",
				"previous": "The Circus consists of three long, curved terraces designed by the elder John Wood to form a circular space or theatre intended for civic functions and games. The games give a clue to the design, the inspiration behind which was the Colosseum in Rome.[86] Like the Colosseum, the three façades have a different order of architecture on each floor: Doric on the ground level, then Ionic on the piano nobile and finishing with Corinthian on the upper floor, the style of the building thus becoming progressively more ornate as it rises.[86] Wood never lived to see his unique example of town planning completed, as he died five days after personally laying the foundation stone on 18 May 1754.[86]",
				"after": "The most spectacular of Bath's terraces is the Royal Crescent, built between 1767 and 1774 and designed by the younger John Wood.[87] But all is not what it seems; while Wood designed the great curved façade of what appears to be about 30 houses with Ionic columns on a rusticated ground floor, that was the extent of his input. Each purchaser bought a certain length of the façade, and then employed their own architect to build a house to their own specifications behind it; hence what appears to be two houses is sometimes one. This system of town planning is betrayed at the rear of the crescent: while the front is completely uniform and symmetrical, the rear is a mixture of differing roof heights, juxtapositions and fenestration. This \"Queen Anne fronts and Mary-Anne backs\" architecture occurs repeatedly in Bath.[88] Other fine terraces elsewhere in the city include Lansdown Crescent[89] and Somerset Place on the northern hill.[90]",
			"color": "black|0.41211 dim|0.31152 gray|0.31152 dim|0.31152 grey|0.31152 gray|0.1359 grey|0.1359 dark|0.067448 gray|0.067448 dark|0.067448 grey|0.067448 silver|0.034075 light|0.012701 gray|0.012701 light|0.012701 grey|0.012701  "
		}
	}
}
