{
	"add": {
		"doc": {
			"id": "60d3727b5ca0207da4a5aa76a9a3bda95ff4ff6c93177947f6157515225d251c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Colour_avrocar_59.jpg/151px-Colour_avrocar_59.jpg",
				"previous": "Portal:Technology/Selected articles/55",
				"after": "The Avro Canada VZ-9 Avrocar was a VTOL aircraft developed by Avro Aircraft Ltd. (Canada) as part of a secret U.S. military project carried out in the early years of the Cold War. The Avrocar intended to exploit the Coandă effect to provide lift and thrust from a single \"turborotor\" blowing exhaust out the rim of the disk-shaped aircraft to provide anticipated VTOL-like performance. In the air, it would have resembled a flying saucer. Originally designed as a fighter-like aircraft capable of very high speeds and altitudes, the project was repeatedly scaled back over time and the U.S. Air Force eventually abandoned it. Development was then taken up by the U.S. Army for a tactical combat aircraft requirement, a sort of high-performance helicopter. In flight testing, the Avrocar proved to have unresolved thrust and stability problems that limited it to a degraded, low-performance flight envelope; subsequently, the project was cancelled in September 1961. Through the history of the program, the project was referred to by a number of different names. Avro referred to the efforts as Project Y, with individual vehicles known as Spade and Omega. Project Y-2 was later funded by the U.S. Air Force, who referred to it as WS-606A, Project 1794 and Project Silver Bug. When the U.S. Army joined the efforts it took on its final name \"Avrocar\", and the designation \"VZ-9\", part of the U.S. Army's VTOL projects in the VZ series.",
			"color": "black|0.31244 light|0.093259 steel|0.093259 blue|0.093259 lavender|0.050597 beige|0.044586 white|0.033583 smoke|0.033583 gainsboro|0.031472 light|0.031378 slate|0.031378 gray|0.031378 alice|0.02808 blue|0.02808 mint|0.026712 cream|0.026712 ghost|0.025671 white|0.025671 snow|0.025053 azure|0.024255 honeydew|0.023456 floral|0.023165 white|0.023165 sea|0.022923 shell|0.022923 light|0.022164 gray|0.022164 light|0.022164 grey|0.022164 white|0.021915 slate|0.02164 gray|0.02164 linen|0.01953 old|0.01719 lace|0.01719 lavender|0.015944 blush|0.015944 dark|0.015235 gray|0.015235 dark|0.015235 grey|0.015235 silver|0.014095 ivory|0.012802 dim|0.0092332 gray|0.0092332 dim|0.0092332 grey|0.0092332 gray|0.0072784 grey|0.0072784 steel|0.0065354 blue|0.0065354  "
		}
	}
}
