{
	"add": {
		"doc": {
			"id": "60e1e5507ac029702186f6e173175803a0d7d2d9655e9e41e1c340cebb9871ee",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Cuban_crocodile.jpg/220px-Cuban_crocodile.jpg",
				"previous": "Crocodilians are excellent swimmers. During aquatic locomotion, the muscular tail undulates from side to side to drive the animal through the water while the limbs are held close to the body to reduce drag.[18][26] When the animal needs to stop, steer, or manoeuvre in a different direction, the limbs are splayed out.[18] Crocodilians generally cruise slowly on the surface or underwater with gentle sinuous movements of the tail, but when pursued or when chasing prey they can move rapidly.[27] Crocodilians are less well-adapted for moving on land, and are unusual among vertebrates in having two different means of terrestrial locomotion: the \"high walk\" and the \"low walk\".[13] Their ankle joints flex in a different way from those of other reptiles, a feature they share with some early archosaurs. One of the upper row of ankle bones, the astragalus, moves with the tibia and fibula. The other, the calcaneum, is functionally part of the foot, and has a socket into which a peg from the astragalus fits. The result is that the legs can be held almost vertically beneath the body when on land, and the foot can swivel during locomotion with a twisting movement at the ankle.[28]",
				"after": "The high walk of crocodilians, with the belly and most of the tail being held off the ground, is unique among living reptiles. It somewhat resembles the walk of a mammal, with the same sequence of limb movements: left fore, right hind, right fore, left hind.[27] The low walk is similar to the high walk, but without the body being raised, and is quite different from the sprawling walk of salamanders and lizards. The animal can change from one walk to the other instantaneously, but the high walk is the usual means of locomotion on land. The animal may push its body up and use this form immediately, or may take one or two strides of low walk before raising the body higher. Unlike most other land vertebrates, when crocodilians increase their pace of travel they increase the speed at which the lower half of each limb (rather than the whole leg) swings forward; by this means, stride length increases while stride duration decreases.[29]",
			"color": "black|0.18277 light|0.099961 gray|0.099961 light|0.099961 grey|0.099961 gainsboro|0.08742 silver|0.074053 dim|0.047379 gray|0.047379 dim|0.047379 grey|0.047379 misty|0.045443 rose|0.045443 linen|0.042992 rosy|0.041487 brown|0.041487 dark|0.038987 gray|0.038987 dark|0.038987 grey|0.038987 gray|0.033511 grey|0.033511 sea|0.030426 shell|0.030426 white|0.030085 smoke|0.030085 antique|0.02496 white|0.02496 floral|0.023385 white|0.023385 old|0.022978 lace|0.022978 snow|0.018964 lavender|0.016218 blush|0.016218 mint|0.014526 cream|0.014526 tan|0.01225 white|0.012042 ivory|0.011819 ghost|0.0090855 white|0.0090855 honeydew|0.0089554 alice|0.0076162 blue|0.0076162 beige|0.0074192 azure|0.0073369 papaya|0.0055413 whip|0.0055413 thistle|0.0055207  "
		}
	}
}
