{
	"add": {
		"doc": {
			"id": "60e9999c8423cfefa731c5f5e79440b14c5e44557a5e116c7eef53421f2cb324",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Little_Thetford_Ferry_c._1905.jpg/220px-Little_Thetford_Ferry_c._1905.jpg",
				"previous": "A middle Saxon pendant dating from 601–700 AD was discovered in a field in Little Thetford in 1952. This 3-centimetre (1.18 in) diameter by 1-centimetre (0.39 in) thick pendant, made from rock-crystal, gold, garnet, and amethyst coloured-glass, has been worked in a lathe. The workmanship is not of a high standard.[16] Æthelberht of Kent was said to have built a church at Cratendune around 600 AD, about a mile from what is now Ely Cathedral. In 673 AD, Æthelthryth considered restoring this church, thought to have been destroyed by Penda of Mercia, but instead made what is now Ely Cathedral the site of her monastery.[17] An early Anglo-Saxon cemetery, used at some point between 410–1065 AD, was uncovered around 1945 near Little Thetford (52.376N, 0.2375E), and was thought to be this lost village of Cratendune.[2][3] A deserted Saxon settlement, 410–1065 AD, examined in 1999 in Ely, may also be a candidate for this lost site of worship.[18][19]",
				"after": "Little Thetford means little public or people's ford—Old English lȳtel Thiutforda (c. 972) and Liteltedford [sic] (1086)—compare with Thetford, Norfolk—Old English Thēodford (late 9th century) and Tedfort (1086).[20] The online Domesday Book records the settlement under the name Liteltetford [sic].[nb 1][21] The first written evidence that Ely Abbey had inherited the Little Thetford lands was in the 12th-century chronicle, Liber Eliensis. The will of Ælfwaru (d. 1007), an Anglo-Saxon noblewoman, granted estates in Cambridgeshire and Norfolk to the Abbey, which included \"... that land at Thetford[22] and fisheries around those marshes\".[23] In 1110, Hervey le Breton, Bishop of Ely, granted the manor to William Brito, his Archdeacon and also his nephew.[24] Chapel Hill in the village, near the river, commemorates the site of Harrimere Chapel, used since 1381.[15] Some of the stone from this chapel, dismantled in 1571, was used in the building of St George's Church. By 1539, the Little Thetford manor and its estates contained arable land, pasture, gardens, and orchards.[25] In the mid-16th century, the antiquary William Bowyer owned the farm.[26]",
			"color": " "
		}
	}
}
