{
	"add": {
		"doc": {
			"id": "60fd4c7201aa64a192c6fb315ba5179618a457a1eefc51379a1139ddfd75cd8f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Dewoitine_D26_HB-RAI_1.jpg/220px-Dewoitine_D26_HB-RAI_1.jpg",
				"previous": "The primary driver of fighter innovation, right up to the period of rapid re-armament in the late 1930s, were not military budgets, but civilian aircraft racing. Aircraft designed for these races introduced innovations like streamlining and more powerful engines that would find their way into the fighters of World War II. The most significant of these was the Schneider Cup races, where competition grew so fierce, only national governments could afford to enter.",
				"after": "At the very end of the inter-war period in Europe came the Spanish Civil War. This was just the opportunity the German Luftwaffe, Italian Regia Aeronautica, and the Soviet Union's Red Air Force needed to test their latest aircraft. Each party sent numerous aircraft types to support their sides in the conflict. In the dogfights over Spain, the latest Messerschmitt Bf 109 fighters did well, as did the Soviet Polikarpov I-16. The German design had considerably more room for development however and the lessons learned led to greatly improved models in World War II. The Russians, whose side lost, failed to keep up and despite newer models coming into service, I-16s were outfought by the improved Bf 109s in World War II, while remaining the most common Soviet front-line fighter into 1942. For their part, the Italians developed several monoplanes such as the Fiat G.50, but being short on funds, were forced to continue operating obsolete Fiat CR.42 biplanes.",
			"color": "dark|0.82429 slate|0.82429 gray|0.82429 dim|0.067749 gray|0.067749 dim|0.067749 grey|0.067749 gray|0.03747 grey|0.03747 dark|0.022855 gray|0.022855 dark|0.022855 grey|0.022855 black|0.015944 silver|0.011342 light|0.0064398 gray|0.0064398 light|0.0064398 grey|0.0064398 gainsboro|0.0047285  "
		}
	}
}
