{
	"add": {
		"doc": {
			"id": "611ffe3bc442f7aca9479bb1dc45a3ad5be37b3b482ef4d3b63acf3b0cefa16c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Archaeoindris_fontoynonti.jpg/220px-Archaeoindris_fontoynonti.jpg",
				"previous": "Their skeletons suggest that most subfossil lemurs were tree-dwellers, adapted for living in forests and possibly limited to such habitats.[6][8][9] Unlike some of the living species, the subfossil lemurs lacked adaptations for leaping. Instead, suspension, used by some indriids and ruffed lemurs, was extensively used in some lineages. Although living lemurs are known to visit the ground to varying extents, only the extinct archaeolemurids exhibit adaptations for semiterrestrial locomotion. Due to the size of the extinct subfossil lemurs, all were likely to travel on the ground between trees.[8] They had shorter, more robust limbs, heavily built axial skeletons (trunks), and large heads[10] and are thought to have shared the common lemur trait of low basal metabolic rates, making them slow-moving.[9] Studies of their semicircular canals confirm this assumption, showing that koala lemurs moved slower than orangutans, monkey lemurs were less agile than Old World monkeys, and sloth lemurs exhibited slow movements like those of lorises and sloths.[11]",
				"after": "The sloth lemurs (family Palaeopropithecidae) were the most species-rich group of the subfossil lemurs, with four genera and eight species. The common name is due to strong similarities in morphology with arboreal sloths,[9] or in the case of Archaeoindris, with giant ground sloths.[12] They ranged in size from some of the smallest of the subfossil lemurs, such as Mesopropithecus, weighing as little as 10 kg (22 lb),[12] to the largest, Archaeoindris, weighing approximately 160 kg (350 lb).[4] Their characteristic curved finger and toe bones (phalanges) suggest slow suspensory movement, similar to that of an orangutan or a loris, making them some of the most specialized mammals for suspension.[9][13] Their day vision was very poor, and they had relatively small brains and short tails.[8] Their diet consisted mostly of leaves, seeds, and fruit,[8][9] although dental wear analysis suggests they were primarily folivorous seed-predators.[14]",
			"color": "dim|0.40085 gray|0.40085 dim|0.40085 grey|0.40085 gray|0.15365 grey|0.15365 dark|0.068749 gray|0.068749 dark|0.068749 grey|0.068749 silver|0.032465 white|0.031669 smoke|0.031669 sea|0.030915 shell|0.030915 snow|0.030686 floral|0.03043 white|0.03043 white|0.030404 mint|0.030115 cream|0.030115 ghost|0.030059 white|0.030059 alice|0.029032 blue|0.029032 azure|0.028823 lavender|0.023114 blush|0.023114 black|0.012762 light|0.012668 gray|0.012668 light|0.012668 grey|0.012668 gainsboro|0.0077683 ivory|0.0061653 linen|0.0054589  "
		}
	}
}
