{
	"add": {
		"doc": {
			"id": "61416a9d0db08b01344aef99f0d0b62acb19f75986663705bd734f1997b64c56",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Flag_of_Manitoba.svg/200px-Flag_of_Manitoba.svg.png",
			"previous": [],
			"after": [
				"Manitoba's capital is the city of Winnipeg.",
				"The name Manitoba comes from the aboriginal word \"manitou\" which means \"Great spirit\". Winnipeg, along with other regions in the province, has been known as the \"Gateway to the West\". Lake Winnipeg is the 11th largest lake in the world and 5th largest in Canada, and along with the sizable Lake Manitoba and Lake Winnipegosis, makes up much of the province's nearly 100,000 km² of water area. Manitoba's most widely-used symbol is the Bison, used by the Province of Manitoba along with many sports teams and businesses located within the province. The animal used to roam freely over the vast prairie lands in southern Manitoba and was historically an integral part of trade between many Manitoba First Nations. Another symbol of the area is the Red River ox cart, used throughout most of the 19th century in the fur trade. One of the province's most historical locations is The Forks, the area located in downtown Winnipeg at the confluence of the Red River from the south and the Assiniboine River from the west, which for millennia was a meeting place for aboriginal groups in the area. The province has produced many well-known and successful hockey players, musicians, authors, and artists. Manitoba and its capital city have also been featured in many feature films and television shows, including recent films My Winnipeg and The Stone Angel, as well as The Simpsons episode \"Midnight Rx\"."
			],
			"color": "lavender|0.12068 pale|0.091531 golden|0.091531 rod|0.091531 golden|0.063841 rod|0.063841 dark|0.05791 red|0.05791 navajo|0.046398 white|0.046398 maroon|0.044872 light|0.043825 steel|0.043825 blue|0.043825 dark|0.041078 golden|0.041078 rod|0.041078 misty|0.033509 rose|0.033509 pink|0.032182 brown|0.026426 saddle|0.024594 brown|0.024594 light|0.022109 coral|0.022109 light|0.021455 pink|0.021455 light|0.020083 gray|0.020083 light|0.020083 grey|0.020083 lavender|0.018455 blush|0.018455 white|0.017868 smoke|0.017868 ghost|0.017781 white|0.017781 sea|0.016533 shell|0.016533 firebrick|0.016527 silver|0.016484 snow|0.016281 gainsboro|0.015926 alice|0.015717 blue|0.015717 white|0.015624 indian|0.013736 red|0.013736 moccasin|0.012515 floral|0.012506 white|0.012506 mint|0.01148 cream|0.01148 azure|0.01101 linen|0.0095733 dark|0.0091575 olive|0.0091575 green|0.0091575  "
		}
	}
}
