{
	"add": {
		"doc": {
			"id": "614baeab490e957f61e372034635a0b9da2035c4f357e96ca373d49f34907232",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Liberty_by_Seashore_20c.jpg/220px-Liberty_by_Seashore_20c.jpg",
				"previous": "In anticipation of the approval of the legislation, Mint Director Linderman had pattern coins prepared. In August 1874, Philadelphia Mint Superintendent James Pollock sent him patterns with an obverse showing a seated Liberty by Philadelphia sculptor Joseph A. Bailly with a reverse by Chief Engraver William Barber. Pollock did not approve Bailly's proposal, deeming it too similar to the Seated Liberty design which was then on all domestic silver coinage, and so the new coin would too closely resemble the quarter. On March 31, 1875, after the enactment of Jones's bill, Pollock sent Linderman additional patterns, all by Barber, and even more on April 12. Pollock deprecated a reverse design with a shield, but Linderman liked it and stated that it would have been adopted but for the law requiring an eagle to appear on silver pieces larger than the dime. Linderman selected an obverse design near-identical to the other silver coinage (until 1916, the silver coins were given similar appearances).[15][16] That design, by the late chief engraver, Christian Gobrecht, following a concept by Thomas Sully and Titian Peale, was first used in 1836 and by 1840 was on all denominations of silver coins then being struck.[17] The right-facing eagle is near-identical to the one which Barber had rendered for the Trade dollar, which had debuted in 1873.[18] Linderman had realized that the difference in size between new coin and quarter was small, and thought a scaled-down version of the Trade dollar suitable for the twenty-cent piece; he got his way on the reverse.[19] The eagle carries the arrows of war in its right, or dominant claw, and the olive branch of peace in the left, in heraldry preferring war over peace.[20]",
				"after": "Art historian Cornelius Vermeule described the twenty-cent piece's obverse as \"a pleasing synthesis of traditional elements\".[18] He was less complimentary about the eagle on the reverse, calling it awkward and a fatter version of the eagle on 18th-century American coinage. Vermeule admired the pattern designs made by Barber, especially the \"Liberty by the Seashore\" motif, which the historian believes owe a debt to the British copper coins of that period depicting Britannia—Barber was an Englishman by birth. He deemed it appropriate that the ship that is visible is powered by steam.[18] Numismatist Yancey Rayburn, in his 1970 article, wrote that the twenty-cent piece is bare of much of the lettering common on US coins: neither \"In God We Trust\" nor \"E Pluribus Unum\" appears on it.[21] At the time, \"E Pluribus Unum\" was required on American coins under the 1873 act; \"In God We Trust\" was included on different coins at the discretion of the Secretary of the Treasury.[22] The mottos were excluded as the coin was considered too small to contain them.[23] The act creating the twenty-cent piece did not dictate its design, but provided that the new coin was to be subject to the terms of the 1873 act.[24] Rayburn also admired that the full denomination, \"TWENTY CENTS\", was spelled out; at that time the quarter and fifty-cent piece had the word \"dollar\" abbreviated as \"DOL.\"[25]",
			"color": "dark|0.37633 gray|0.37633 dark|0.37633 grey|0.37633 gray|0.16725 grey|0.16725 silver|0.13417 light|0.052235 gray|0.052235 light|0.052235 grey|0.052235 gainsboro|0.027028 sea|0.020535 shell|0.020535 floral|0.01922 white|0.01922 white|0.017709 smoke|0.017709 snow|0.016536 antique|0.015911 white|0.015911 mint|0.01495 cream|0.01495 dim|0.014922 gray|0.014922 dim|0.014922 grey|0.014922 white|0.014877 linen|0.014313 ghost|0.012597 white|0.012597 azure|0.012274 alice|0.011403 blue|0.011403 lavender|0.0099311 blush|0.0099311 old|0.0095471 lace|0.0095471 ivory|0.0086176 tan|0.0061287 misty|0.0053708 rose|0.0053708 papaya|0.0039321 whip|0.0039321 beige|0.0035969  "
		}
	}
}
