{
	"add": {
		"doc": {
			"id": "614d476896d106faef75b0e50704dbb31d09f07381beb9039c1ff4238f414c71",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Manuel_Godoy_Spain.jpg/220px-Manuel_Godoy_Spain.jpg",
				"previous": "Under the guise of reinforcing the Spanish armies, 23,000 French troops entered Spain unopposed in November 1807.[7] Even when Napoleon's intentions became clear the following February, the occupying forces found little resistance apart from isolated actions in disconnected areas, including Saragossa.[8] Napoleon's principal commander, Marshal Joachim Murat, believed that Spain would benefit from rulers more progressive and competent than the Bourbons, and Napoleon's brother Joseph Bonaparte was to be made king.[9] After Napoleon convinced Ferdinand to return Spanish rule to Charles IV, the latter was left with no choice but to abdicate, on 19 March 1808, in favor of Joseph Bonaparte.",
				"after": "Although the Spanish people had accepted foreign monarchs in the past, they deeply resented the new French ruler. On 2 May 1808, provoked by news of the planned removal to France of the last members of the Spanish royal family, the people of Madrid rebelled in the Dos de Mayo Uprising. A proclamation issued that day to his troops by Marshal Murat read: \"The population of Madrid, led astray, has given itself to revolt and murder. French blood has flowed. It demands vengeance. All those arrested in the uprising, arms in hand, will be shot.\"[10] Goya commemorated the uprising in his The Second of May, which depicts a cavalry charge against the rebels in the Puerta del Sol square in the center of Madrid, the site of several hours of fierce combat.[11] Much the better known of the pair, The Third of May illustrates the French reprisals: before dawn the next day hundreds of Spaniards were rounded up and shot, at a number of locations around Madrid. Civilian Spanish opposition persisted as a feature of the ensuing five-year Peninsular War, the first to be called guerrilla war.[9] Irregular Spanish forces considerably aided the Spanish, Portuguese, and British armies jointly led by Sir Arthur Wellesley, who first landed in Portugal in August 1808. By the time of the painting's conception, the public imagination had made the rioters symbols of heroism and patriotism.[12]",
			"color": "black|0.8255 dim|0.025566 gray|0.025566 dim|0.025566 grey|0.025566 peru|0.020361 sienna|0.017873 saddle|0.017359 brown|0.017359 tan|0.014322 gray|0.010581 grey|0.010581  "
		}
	}
}
