{
	"add": {
		"doc": {
			"id": "6162fdb2ec16622386f2d1cf2cf30942aa695d3c9e66a9ee44acec28721f2801",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Trial_by_Jury_-_Chaos_in_the_Courtroom.png/220px-Trial_by_Jury_-_Chaos_in_the_Courtroom.png",
				"previous": "In 1874, Gilbert wrote a short libretto on commission from producer–conductor Carl Rosa, whose wife would have played the leading role, but her death in childbirth cancelled the project. Not long afterwards, Richard D'Oyly Carte was managing the Royalty Theatre, and he needed a short opera to be played as an afterpiece to Offenbach's La Périchole. Gilbert already had available the libretto he had written for Rosa, and Carte suggested that Sullivan write the score. The composer was delighted with it, and Trial by Jury was composed in a matter of weeks.[25]",
				"after": "The piece is one of Gilbert's humorous spoofs of the law and the legal profession, based on his short experience as a barrister. It concerns a breach of promise of marriage suit. The defendant argues that damages should be slight, since \"he is such a very bad lot,\" while the plaintiff argues that she loves the defendant fervently and seeks \"substantial damages.\" After much argument, the judge resolves the case by marrying the lovely plaintiff himself. With Sullivan's brother, Fred, as the Learned Judge, the opera was a runaway hit, outlasting the run of La Périchole. Provincial tours and productions at other theatres quickly followed.[26]",
			"color": "gray|0.2345 grey|0.2345 dim|0.20267 gray|0.20267 dim|0.20267 grey|0.20267 dark|0.17907 gray|0.17907 dark|0.17907 grey|0.17907 silver|0.10063 light|0.066364 gray|0.066364 light|0.066364 grey|0.066364 gainsboro|0.051927 white|0.021663 smoke|0.021663 black|0.017803 alice|0.01529 blue|0.01529 lavender|0.015259 blush|0.015259 ghost|0.014988 white|0.014988 sea|0.014707 shell|0.014707 snow|0.014458 white|0.012952 mint|0.011342 cream|0.011342 floral|0.0093457 white|0.0093457 linen|0.0084395 azure|0.0083525  "
		}
	}
}
