{
	"add": {
		"doc": {
			"id": "616d66e4832e775aa7d1c519372ff01083554235f6dc594aaea37266c29901b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Fingleton_Bradman.jpg/220px-Fingleton_Bradman.jpg",
			"previous": [],
				"after": "Throughout his career as player and journalist, Fingleton persistently came into personal conflict with Don Bradman, one of the captains under whom Fingleton played, damaging the reputations of both. Bradman characteristically held his silence during Fingleton's lifetime.[1] Bradman was known for his reserved personality, did not drink and often eschewed social activities with teammates, preferring to privately listen to music or read. Combined with his success, he gained a reputation for cockiness. In the 1930s, Australia had been divided along sectarian lines, with those of Irish descent such as Fingleton being Catholic and Anglo-Australians such as Bradman being predominantly Protestant, leading to speculation that the tension was fuelled by religion. During the 1936–37 Ashes series in Australia, four Catholics, leading bowler Bill O'Reilly, leading batsman and vice-captain Stan McCabe along with Leo O'Brien and Chuck Fleetwood-Smith were summoned by the Board of Control to respond to allegations that they were undermining Bradman. Fingleton was not invited, speculated to be due to his journalistic background, but Bradman later alleged that he was the ringleader. After that, Bradman's relationship with O'Reilly and Fingleton never recovered. When Bradman was dismissed in his final Test innings in 1948 for a duck, Fingleton and O'Reilly were reported to be laughing hysterically in the pressbox. E W Swanton said that \"I thought they were going to have stroke\".[110] Bradman later wrote after both had died: \"With these fellows out of the way, the loyalty of my 1948 side was a big joy and made a big contribution to the outstanding success of that tour\".[110]",
			"color": "tan|0.22565 bisque|0.18591 blanched|0.1712 almond|0.1712 antique|0.14081 white|0.14081 papaya|0.10779 whip|0.10779 wheat|0.084813 beige|0.032647 corn|0.025077 silk|0.025077  "
		}
	}
}
