{
	"add": {
		"doc": {
			"id": "618dd364a95b7c9f96bdfd5f51f8c0ab55cd4989e379cb65c3c865281c537a48",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/The_British_Empire.png/250px-The_British_Empire.png",
				"previous": "The UK entered World War II by declaring war on Germany in 1939, after it had invaded Poland and Czechoslovakia. In 1940, Winston Churchill became prime minister and head of a coalition government. Despite the defeat of its European allies in the first year of the war, the UK continued the fight alone against Germany. In 1940, the RAF defeated the German Luftwaffe in a struggle for control of the skies in the Battle of Britain. The UK suffered heavy bombing during the Blitz. There were also eventual hard-fought victories in the Battle of the Atlantic, the North Africa campaign and Burma campaign. UK forces played an important role in the Normandy landings of 1944, achieved with its ally the US. After Germany's defeat, the UK was one of the Big Three powers who met to plan the post-war world; it was an original signatory to the Declaration of the United Nations. The UK became one of the five permanent members of the United Nations Security Council. However, the war left the UK severely weakened and depending financially on Marshall Aid and loans from the United States.[96]",
				"after": "In the immediate post-war years, the Labour government initiated a radical programme of reforms, which had a significant effect on British society in the following decades.[97] Major industries and public utilities were nationalised, a Welfare State was established, and a comprehensive, publicly funded healthcare system, the National Health Service, was created.[98] The rise of nationalism in the colonies coincided with Britain's now much-diminished economic position, so that a policy of decolonisation was unavoidable. Independence was granted to India and Pakistan in 1947.[99] Over the next three decades, most colonies of the British Empire gained their independence. Many became members of the Commonwealth of Nations.[100]",
			"color": "silver|0.2489 dark|0.23966 gray|0.23966 dark|0.23966 grey|0.23966 pink|0.1525 light|0.10063 pink|0.10063 light|0.074561 gray|0.074561 light|0.074561 grey|0.074561 rosy|0.031155 brown|0.031155 misty|0.027937 rose|0.027937 gray|0.025713 grey|0.025713 gainsboro|0.021692 dim|0.01765 gray|0.01765 dim|0.01765 grey|0.01765 lavender|0.0092147 blush|0.0092147 white|0.0068692 smoke|0.0068692 sea|0.0066785 shell|0.0066785 snow|0.0056717 ghost|0.0052427 white|0.0052427 white|0.004737 floral|0.0046218 white|0.0046218 alice|0.0044625 blue|0.0044625 linen|0.004236 mint|0.0037562 cream|0.0037562 azure|0.0029357  "
		}
	}
}
