{
	"add": {
		"doc": {
			"id": "618e6ed585a739562dd3640b17a5d656295f9e689d45675e179e3896a89b10dc",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/0/0a/Kerryedwards.JPG/220px-Kerryedwards.JPG",
			"previous": [],
				"after": "In the 2004 Democratic presidential primaries, John Kerry defeated several Democratic rivals, including Sen. John Edwards (D-North Carolina.), former Vermont Governor Howard Dean and retired Army General Wesley Clark. His victory in the Iowa caucuses is widely believed to be the tipping point where Kerry revived his sagging campaign in New Hampshire and the February 3, 2004, primary states like Arizona, South Carolina and New Mexico. Kerry then went on to win landslide victories in Nevada and Wisconsin. Kerry thus won the Democratic nomination to run for President of the United States against incumbent George W. Bush. On July 6, 2004, he announced his selection of John Edwards as his running mate. Democratic strategist Bob Shrum, who was Kerry's 2004 campaign adviser, wrote an article in Time magazine claiming that after the election, Kerry had said that he wished he'd never picked Edwards, and that the two have since stopped speaking to each other.[111] In a subsequent appearance on ABC's This Week, Kerry refused to respond to Shrum's allegation, calling it a \"ridiculous waste of time.\"[112]",
			"color": "dark|0.084039 slate|0.084039 blue|0.084039 firebrick|0.064469 white|0.052068 smoke|0.052068 white|0.050768 alice|0.050644 blue|0.050644 snow|0.049993 ghost|0.048872 white|0.048872 mint|0.048357 cream|0.048357 azure|0.046498 light|0.046096 steel|0.046096 blue|0.046096 floral|0.042239 white|0.042239 dark|0.039722 red|0.039722 midnight|0.039316 blue|0.039316 sea|0.039174 shell|0.039174 brown|0.032272 lavender|0.031456 maroon|0.027247 lavender|0.026155 blush|0.026155 ivory|0.020687 misty|0.018041 rose|0.018041 linen|0.014426 light|0.014015 cyan|0.014015 honeydew|0.013203 old|0.010685 lace|0.010685 indian|0.010668 red|0.010668 rosy|0.0083274 brown|0.0083274  "
		}
	}
}
