{
	"add": {
		"doc": {
			"id": "61911404e3fae2b6f6cf022829d80a481ccac72c1344b78bae65463c73efab28",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Angkor_Wat%2C_Camboya%2C_2013-08-15%2C_DD_029.JPG/220px-Angkor_Wat%2C_Camboya%2C_2013-08-15%2C_DD_029.JPG",
				"previous": "Beyond, the second and inner galleries are connected to each other and to two flanking libraries by another cruciform terrace, again a later addition. From the second level upwards, devatas abound on the walls, singly or in groups of up to four. The second-level enclosure is 100 by 115 m, and may originally have been flooded to represent the ocean around Mount Meru.[33] Three sets of steps on each side lead up to the corner towers and gopuras of the inner gallery. The very steep stairways represent the difficulty of ascending to the kingdom of the gods.[34] This inner gallery, called the Bakan, is a 60 m square with axial galleries connecting each gopura with the central shrine, and subsidiary shrines located below the corner towers. The roofings of the galleries are decorated with the motif of the body of a snake ending in the heads of lions or garudas. Carved lintels and pediments decorate the entrances to the galleries and to the shrines. The tower above the central shrine rises 43 m to a height of 65 m above the ground; unlike those of previous temple mountains, the central tower is raised above the surrounding four.[35] The shrine itself, originally occupied by a statue of Vishnu and open on each side, was walled in when the temple was converted to Theravada Buddhism, the new walls featuring standing Buddhas. In 1934, the conservator George Trouvé excavated the pit beneath the central shrine: filled with sand and water it had already been robbed of its treasure, but he did find a sacred foundation deposit of gold leaf two metres above ground level.[36]",
				"after": "Integrated with the architecture of the building, and one of the causes for its fame is Angkor Wat's extensive decoration, which predominantly takes the form of bas-relief friezes. The inner walls of the outer gallery bear a series of large-scale scenes mainly depicting episodes from the Hindu epics the Ramayana and the Mahabharata. Higham has called these, \"the greatest known linear arrangement of stone carving\".[37] From the north-west corner anti-clockwise, the western gallery shows the Battle of Lanka (from the Ramayana, in which Rama defeats Ravana) and the Battle of Kurukshetra (from the Mahabharata, showing the mutual annihilation of the Kaurava and Pandava clans). On the southern gallery follow the only historical scene, a procession of Suryavarman II, then the 32 hells and 37 heavens of Hindu mythology.",
			"color": "dark|0.30657 gray|0.30657 dark|0.30657 grey|0.30657 gray|0.29214 grey|0.29214 dim|0.13989 gray|0.13989 dim|0.13989 grey|0.13989 silver|0.11104 light|0.055163 gray|0.055163 light|0.055163 grey|0.055163 gainsboro|0.037538 white|0.0084871 smoke|0.0084871 linen|0.0082172 sea|0.0061322 shell|0.0061322 snow|0.0047868 floral|0.0045439 white|0.0045439 black|0.0038631 mint|0.0037662 cream|0.0037662 ghost|0.0035704 white|0.0035704 white|0.0033309 alice|0.0028188 blue|0.0028188  "
		}
	}
}
