{
	"add": {
		"doc": {
			"id": "61ab7707e3e57966277ec14838705f875cbe0cee72362db2a0f4b10f80f1f0b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Northwest_Airlines_Cargo%2C_Boeing_747.jpg/220px-Northwest_Airlines_Cargo%2C_Boeing_747.jpg",
				"previous": "As of 2006, Northwest Airlines Cargo was the largest cargo carrier among U.S. combination passenger and cargo airlines. NWA Cargo's fleet of dedicated Boeing 747 freighter aircraft flew from some key cities in the United States and East Asia, as well as Amsterdam, connecting with the carrier's cargo hub in Anchorage, Alaska (Ted Stevens Anchorage International Airport), facilitating the quick transfer of cargo between large cities on both sides of the Pacific. NWA Cargo also transports freight aboard the passenger fleet of Northwest Airlines to more than 250 cities worldwide. Delta announced that the NWA Cargo hub will be shut down by the end of 2009. As of early 2008, NWA's largest cargo client was DHL International. In December 2007, NWA announced that DHL International would terminate its cargo agreement with the airline effective late 2008. According to NWA Chief Financial Officer Dave Davis, the loss of its largest cargo client would bring significant changes to the division. Further changes to the NWA Cargo division continued into 2009 as it was merged into the Delta Cargo service. NWA Cargo ended all operations on December 28, 2009. On July 30, 2010, Northwest pleaded guilty to one count of felony price fixing for fixing prices for cargo shipping via NWA Cargo.[29]",
			"after": [],
			"color": "light|0.21899 slate|0.21899 gray|0.21899 slate|0.18503 gray|0.18503 gray|0.1191 grey|0.1191 dark|0.10129 gray|0.10129 dark|0.10129 grey|0.10129 silver|0.086835 dim|0.067514 gray|0.067514 dim|0.067514 grey|0.067514 tan|0.046294 burly|0.033114 wood|0.033114 light|0.02357 gray|0.02357 light|0.02357 grey|0.02357 black|0.014774 navajo|0.013458 white|0.013458 wheat|0.012174 peach|0.011 puff|0.011 moccasin|0.0097389 gainsboro|0.0078922 bisque|0.0054243 antique|0.0041831 white|0.0041831 pale|0.0033257 golden|0.0033257 rod|0.0033257  "
		}
	}
}
