{
	"add": {
		"doc": {
			"id": "61c4ee1ca4f2f2b63c57a67d3578573016e4bdf65767932ae1497e85ef08b6de",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Procyon_lotor_7_-_am_Wasser.jpg/170px-Procyon_lotor_7_-_am_Wasser.jpg",
			"previous": [],
				"after": "One aspect of raccoon behavior is so well known that it gives the animal part of its scientific name, Procyon lotor; \"lotor\" is neo-Latin for \"washer\". In the wild, raccoons often dabble for underwater food near the shore-line. They then often pick up the food item with their front paws to examine it and rub the item, sometimes to remove unwanted parts. This gives the appearance of the raccoon \"washing\" the food. The tactile sensitivity of raccoons' paws is increased if this rubbing action is performed underwater, since the water softens the hard layer covering the paws.[125] However, the behavior observed in captive raccoons in which they carry their food to water to \"wash\" or douse it before eating has not been observed in the wild.[126] Naturalist Georges-Louis Leclerc, Comte de Buffon, believed that raccoons do not have adequate saliva production to moisten food thereby necessitating dousing, but this hypothesis is now considered to be incorrect.[127] Captive raccoons douse their food more frequently when a watering hole with a layout similar to a stream is not farther away than 3 m (10 ft).[128] The widely accepted theory is that dousing in captive raccoons is a fixed action pattern from the dabbling behavior performed when foraging at shores for aquatic foods.[129] This is supported by the observation that aquatic foods are doused more frequently. Cleaning dirty food does not seem to be a reason for \"washing\".[128] Experts have cast doubt on the veracity of observations of wild raccoons dousing food.[130]",
			"color": "gray|0.24691 grey|0.24691 dim|0.21418 gray|0.21418 dim|0.21418 grey|0.21418 dark|0.17658 gray|0.17658 dark|0.17658 grey|0.17658 silver|0.081369 light|0.041872 gray|0.041872 light|0.041872 grey|0.041872 gainsboro|0.0283 linen|0.019009 antique|0.017634 white|0.017634 sea|0.016 shell|0.016 floral|0.014871 white|0.014871 old|0.0145 lace|0.0145 white|0.014143 smoke|0.014143 black|0.011191 snow|0.011043 mint|0.010227 cream|0.010227 ivory|0.010166 white|0.0089143 beige|0.0085212 ghost|0.0060268 white|0.0060268 papaya|0.0057964 whip|0.0057964  "
		}
	}
}
