{
	"add": {
		"doc": {
			"id": "61c8889bf289589e881a8a77b393a92c95473c96c7ced93a8f961237b5a2e26c",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/c/c9/Oneworld_10_Years_Anniversary.svg/100px-Oneworld_10_Years_Anniversary.svg.png",
				"previous": "In 2008, the alliance lost another two affiliate members as British Airways continued the strategy of reducing its UK franchises. The first franchisee, GB Airways, exited the alliance on 30 March 2008, following its purchase by EasyJet. British Airways intended to start services from London Heathrow to Faro, Portugal, and Málaga, Spain, and from London Gatwick to Faro, Gibraltar, Ibiza, Málaga, Palma, and Tunis, which were operated under the franchise.[66][67] The alliance bid farewell to one of its affiliate member Japan Asia Airways on 31 March 2008, following the airline's consolidation into its parent, Japan Airlines.[68] The second British Airways franchisee, Loganair, left the alliance on 25 October 2008, following the ending of its franchise agreement with the airline. A separate agreement for codesharing on some Loganair services replaced the previous franchise, for British Airways passengers connecting through Aberdeen, Edinburgh and Glasgow.[67][69]",
				"after": "In February 2009, Oneworld celebrated its tenth anniversary with its ten-member airlines—American Airlines, British Airways, Cathay Pacific, Finnair, Iberia Airlines, Japan Airlines, LAN, Malév, Qantas, and Royal Jordanian. In the past decade, membership has doubled from an initial five members to ten members now; its member airlines carried a total of 2.5 billion passengers and generated almost $500 billion, €450 million in revenue from passenger activities. Alliance fares and sales products generated $5 billion, €2.5 billion in revenue alone, with two-thirds or almost $3 billion, €1.5 billion would not have been generated if the alliance did not exist.[70][71] As part of the celebration and to increase awareness of the 10‑member alliance, all the alliance member airlines decorated a proportion of their aircraft fleets in a new standard Oneworld livery—around 40 aircraft in total, mainly types that fly on international routes. The alliance also unveiled a special version of its logo, featuring the text \"10 years\" printed behind the word Oneworld as a watermark on its round blue orb.",
			"color": "dark|0.42428 slate|0.42428 blue|0.42428 light|0.32582 steel|0.32582 blue|0.32582 lavender|0.074588 alice|0.021501 blue|0.021501 ghost|0.020386 white|0.020386 thistle|0.016822 white|0.016603 smoke|0.016603 snow|0.01452 lavender|0.014267 blush|0.014267 white|0.013611  "
		}
	}
}
