{
	"add": {
		"doc": {
			"id": "61ce4763682329a5fd44d7ad57f746d9387c56d9cb402590c9b25b8ce64c7f13",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Beaver_floatplane.jpg/220px-Beaver_floatplane.jpg",
				"previous": "The Beaver was designed for flight in rugged and remote areas of the world. Its short takeoff and landing capability made it ideal for areas normally only accessible by canoe or foot. Because it often flies to remote locations, often in cold climates, its oil reservoir filler is located in the cockpit and oil can be filled in flight. A series of upgrades to the basic design were incorporated. One major customer introduced the use of flat steps replacing the earlier tubes, a feature that is now almost universal. In 1987, the Canadian Engineering Centennial Board named the DHC-2 one of the top ten Canadian engineering achievements of the 20th century.[2]",
				"after": "At one point in its production, plans to license and build the type in New Zealand were proposed. The remaining tooling was purchased by Viking Air of Victoria, Canada, which manufactures replacement parts for most of the early de Havilland line. On 24 February 2006, Viking purchased the type certificates from Bombardier Aerospace for all the original de Havilland designs.[3] The ownership of the certificates gives Viking the exclusive right to manufacture new Beavers. Viking now sells a remanufactured and rebuilt DHC-2T Turbo Beaver upgraded with a Pratt & Whitney Canada PT6A-34 680 hp (507 kW) turboprop engine. With a maximum gross takeoff weight increased to 6,000 lb (2,700 kg) it can carry 2,450 lb (1,110 kg) of freight.[4] However, Viking Turbo Beavers are only rebuilt from existing air frames, and are not new-builds, unlike Viking's own DHC-6 Series 400 Twin Otter, which is manufactured from a completely new airframe.",
			"color": "dark|0.1551 olive|0.1551 green|0.1551 dark|0.15278 gray|0.15278 dark|0.15278 grey|0.15278 black|0.10489 silver|0.077012 gray|0.07081 grey|0.07081 dim|0.070522 gray|0.070522 dim|0.070522 grey|0.070522 firebrick|0.041077 saddle|0.029956 brown|0.029956 dark|0.028077 red|0.028077 lavender|0.027131 maroon|0.025885 light|0.024191 gray|0.024191 light|0.024191 grey|0.024191 gainsboro|0.016272 dark|0.015261 golden|0.015261 rod|0.015261 light|0.013168 steel|0.013168 blue|0.013168 khaki|0.012078 brown|0.011458  "
		}
	}
}
