{
	"add": {
		"doc": {
			"id": "61dd3db5f91fcccba7b295833f0be2ccda6b9453a16cb4c2c9494e20ed2d61e8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Memorial_Park.jpg/220px-Memorial_Park.jpg",
				"previous": "The region's most popular park, Finlay Park has hosted just about everything from festivals and political rallies to road races and Easter Sunrise services. This 18-acre (73,000 m2) park has had two lives; first dedicated in 1859 as Sidney Park, named in honor of Algernon Sidney Johnson, a Columbia City Councilman, the park experienced an illustrious but short tenure. The park fell into disrepair after the Civil War and served as a site for commercial ventures until the late 20th century. In 1990, the park was reopened. It serves as the site for such events as Kids Day, The Summer Concert Series, plus many more activities. In 1992, the park was renamed Finlay Park, in honor of Kirkman Finlay, a past mayor of Columbia who had a vision to reenergize the historic Congaree Vista district, between Main Street and the river, and recreate the site that was formerly known as Sidney Park.",
				"after": "Memorial Park is a 4-acre (16,000 m2) tract of land in the Congaree Vista between Main Street and the river. The property is bordered by Hampton, Gadsden, Washington, and Wayne Streets and is one block south of Finlay Park. This park was created to serve as a memorial to those who served their country and presently has monuments honoring the USS Columbia warship and those that served with her during World War II, the China-Burma-India Theater Veterans of WWII, casualties of the Pearl Harbor attack of December 7, 1941, who were from South Carolina, Holocaust survivors who live in South Carolina as well as concentration camp liberators from South Carolina, and the State Vietnam War Veterans. The park was dedicated in November 1986 along with the unveiling of the South Carolina Vietnam Monument. In June 2000, the Korean War Memorial was dedicated at Memorial Park. In November 2014, Columbia native and resident of Boston, Henry Crede, gave a bronze statue and plaza in the park dedicated to his WWII comrades who served in the Navy from South Carolina.",
			"color": "antique|0.11737 white|0.11737 blanched|0.087241 almond|0.087241 bisque|0.087066 papaya|0.078349 whip|0.078349 gray|0.065966 grey|0.065966 wheat|0.063101 peach|0.052852 puff|0.052852 dark|0.04603 gray|0.04603 dark|0.04603 grey|0.04603 beige|0.045909 tan|0.039618 corn|0.039361 silk|0.039361 old|0.035562 lace|0.035562 silver|0.032267 linen|0.031807 dim|0.030997 gray|0.030997 dim|0.030997 grey|0.030997 light|0.017687 gray|0.017687 light|0.017687 grey|0.017687 floral|0.012906 white|0.012906 ivory|0.011993 dark|0.011193 khaki|0.011193 light|0.011037 yellow|0.011037 sea|0.011005 shell|0.011005 moccasin|0.010302 burly|0.010118 wood|0.010118 black|0.0097848 gainsboro|0.0094718  "
		}
	}
}
