{
	"add": {
		"doc": {
			"id": "61e722b9743a2ab956fe33e8737092c27cbb001edf79d47dda4084f5650fd20f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Market_Taverns%2C_Norwich%2C_Edwin_Edwards.jpg/220px-Market_Taverns%2C_Norwich%2C_Edwin_Edwards.jpg",
				"previous": "In the wake of the First World War the council's Markets Committee began a programme of gradually buying back all the privately owned stalls, with the intention of encouraging demobilised servicemen to work on the market. Within a few years the market was entirely publicly owned, and the council took responsibility for the upkeep of the market.[44] The city also bought out and closed many of the 30 or more inns in the area, transferring their licences to the growing suburbs.[49]",
				"after": "Meanwhile, the Guildhall, designed to serve the post-plague city with a population of around 6,000, was hopelessly inadequate as the administrative centre of a major modern city. As an interim solution the row of buildings dividing the upper and main markets had mostly been taken into public ownership and converted into civic offices,[44] and in January 1914 the 1860 fish market had also been enlarged and converted into offices. The Liberal welfare reforms of the early 20th century and the Local Government Act 1929 had greatly increased the role of local government in public health and welfare, and by the 1930s Norwich council was suffering from a severe lack of office space.[44]",
			"color": "dim|0.098333 gray|0.098333 dim|0.098333 grey|0.098333 gray|0.096418 grey|0.096418 dark|0.093896 gray|0.093896 dark|0.093896 grey|0.093896 silver|0.065708 light|0.060391 gray|0.060391 light|0.060391 grey|0.060391 black|0.058028 white|0.054929 smoke|0.054929 gainsboro|0.053587 sea|0.049126 shell|0.049126 snow|0.046723 floral|0.044029 white|0.044029 white|0.043821 mint|0.043415 cream|0.043415 ghost|0.039173 white|0.039173 azure|0.035837 alice|0.03492 blue|0.03492 linen|0.034307 lavender|0.02213 blush|0.02213 ivory|0.013029 old|0.010404 lace|0.010404  "
		}
	}
}
