{
	"add": {
		"doc": {
			"id": "61f02d9b068293a50f42109a2c92a7735ba03627ebb8debdcf28b7e3e7b1b80c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/A380_teststation_fb06rs.jpg/220px-A380_teststation_fb06rs.jpg",
				"previous": "On 1 December 2005, the A380 achieved its maximum design speed of Mach 0.96, over its design cruise speed of Mach 0.85, in a shallow dive, completing the opening of the flight envelope.[35] In 2006, the A380 flew its first high-altitude test at Bole International Airport, Addis Ababa. It conducted its second high-altitude test at the same airport in 2009.[40] On 10 January 2006, it flew to José María Córdova International Airport in Colombia, accomplishing the transatlantic testing, and then it went to El Dorado International Airport to test the engine operation in high-altitude airports. It arrived in North America on 6 February 2006, landing in Iqaluit, Nunavut in Canada for cold-weather testing.[41]",
				"after": "On 14 February 2006, during the destructive wing strength certification test on MSN5000, the test wing of the A380 failed at 145% of the limit load, short of the required 150% level. Airbus announced modifications adding 30 kg to the wing to provide the required strength.[42] On 26 March 2006, the A380 underwent evacuation certification in Hamburg. With 8 of the 16 exits arbitrarily blocked, 853 mixed passengers and 20 crew left the darkened aircraft in 78 seconds, less than the 90 seconds required for certification.[43][44] Three days later, the A380 received European Aviation Safety Agency (EASA) and United States Federal Aviation Administration (FAA) approval to carry up to 853 passengers.[45]",
			"color": "light|0.27542 slate|0.27542 gray|0.27542 slate|0.24002 gray|0.24002 black|0.14908 dim|0.085102 gray|0.085102 dim|0.085102 grey|0.085102 gray|0.084295 grey|0.084295 dark|0.059761 gray|0.059761 dark|0.059761 grey|0.059761 silver|0.018968 dark|0.0096006 slate|0.0096006 gray|0.0096006 light|0.0078467 gray|0.0078467 light|0.0078467 grey|0.0078467 gainsboro|0.0053802  "
		}
	}
}
