{
	"add": {
		"doc": {
			"id": "61fa1015009e09d30a466f83e1248ff29260aaa5c660429e5949ec5d3e741425",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Carshia01.jpg/390px-Carshia01.jpg",
				"previous": "Historical monuments in Pristina are made up of 21 monuments out of a total of 426 protected monuments all over Kosovo.[82] A large number of these monuments date back to the Byzantine and Ottoman periods.[83] Since 1945, the Yugoslav authorities followed the idea of constructing a modern Pristina by relying in the urban development motto “destroy the old, build the new”[84] and this resulted with major changes in the structure of the buildings, their function and their surrounding environment.[85] However, numerous types of monuments have been preserved, including four mosques, a restored orthodox church, an Ottoman bath, a public fountain, a clock tower, several traditional houses as well as European-influenced architecture buildings such as Kosovo Museum.[86] These symbolize the historical and cultural character of Pristina as it was developed throughout centuries in the spirit of conquering empires (Roman, Byzantine, Ottoman and Austro-Hungarian).[83]",
				"after": "The Bazaar of Pristina was the core merchandising center of the Old Pristina since the 15th century, when it was built.[87] It played a significant role in the physical, economic, and social development of Pristina. The Old Bazaar was destroyed during the 1950s and 1960s, following the modernization slogan of \"Destroy the old, build the new\". In its place, buildings of Kosovo Assembly, Municipality of Pristina, PTT, and Brotherhood and Unity socialist square were built. Nowadays, instead of PTT building resides the Government of Kosovo building. Only few historical buildings, such as the Bazaar Mosque and ruins of the Bazaar Hammam have remained from the Bazaar complex.[88] Since then, Pristina has lost part of its identity, and its cultural heritage has been scattered.",
			"color": " "
		}
	}
}
