{
	"add": {
		"doc": {
			"id": "61fd9c4887e26efd91d0161b2f8781a3dc9011a70526a9e5bf5d77ea45100865",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Rajendra_map_new.svg/220px-Rajendra_map_new.svg.png",
				"previous": "Although the Pallava records can be traced from the 2nd century AD, they did not rise to prominence as an imperial dynasty until the 6th century.[43] They transformed the institution of the kingship into an imperial one, and sought to bring vast amounts of territory under their direct rule. The Pallavas were followers of Hinduism, though for a short while one of their kings embraced Jainism and later converted to Hinduism.[44] The Bhakti movement in Hinduism was founded at this time, and rose along with the growing influence of Jainism and Buddhism.[45] The Pallavas pioneered the building of large, ornate temples in stone which formed the basis of the Dravidian temple architecture. They came into conflict with the Kannada Chalukyas of Badami. During this period, The great Badami Chalukya King Pulakesi II extended the Chalukya Empire up to the northern extents of the Pallava kingdom and defeated the Pallavas in several battles.[46] Pallava Narasimhavarman however reversed this victory in 642 by attacking and occupying Badami temporarily.[47] However a later Chalukya King Vikramaditya II took revenge by repeated invasions of the territory of Tondaimandalam and his subsequent victories over Pallava Nandivarman II and the annexation of Kanchipuram.[48] The Pallava dynasty was overthrown in the 9th century by the imperial Kannada Rashtrakutas who ruled from Gulbarga. King Krishna III, the last great Rashtrakuta king consolidated the empire so that it stretched from the Narmada River to Kaveri River and included the northern Tamil country (Tondaimandalam) while levying tribute on the king of Ceylon.[49]",
				"after": "Under Rajaraja Chola and his son Rajendra Chola, the Cholas became dominant in the 10th century and established an empire covering most of South India and Sri Lanka.[43] The empire had strong trading links with Chinese Song Dynasty and Southeast Asia.[50][51] The Cholas defeated the Eastern Chalukya and expanded their empire to the Ganges. They conquered the coastal areas around the Bay of Bengal and turned it to Chola lake. Rajendra Chola improved his father's fleet and created the first notable marine of the Indian subcontinent. The Chola navy conquered the Sri Vijaya Empire of Indonesia and the Malaysia and secured the sea trade route to China.[43] Cholas exacted tribute from Thailand and the Khmer Kingdom of Cambodia.[52] The power of the Cholas declined around the 13th century and the Pandyan Empire enjoyed a brief period of resurgence thereafter during the rule of Sundara Pandya.[43] The Pandyan Dynasty reached its peak in the 13th century during the reign of Sadayavarman Sundara Pandyan I and Maravarman Kulasekara Pandyan I. The Pandyan Empire was threatened by the constant Islamic invasions of South India. In the early 14th Century, Madurai, the capital of Pandyans was conquered by Jalaluddin Ahsan Khan and an independent Madurai Sultanate was established. The short-lived Madurai Sultanate was captured in 1378 by the Vijayanagara Empire. During the 15th and 16th century the Vijayanagara Empire became the dominant power of South India. After the decline of the Vijayanagara Empire in 1646, Tamil Nadu was dominated by small states like the Madurai Nayaks.",
			"color": "pink|0.23316 light|0.14297 sky|0.14297 blue|0.14297 light|0.12877 steel|0.12877 blue|0.12877 light|0.052389 blue|0.052389 gray|0.043466 grey|0.043466 thistle|0.03886 red|0.025907 dim|0.024372 gray|0.024372 dim|0.024372 grey|0.024372  "
		}
	}
}
