{
	"add": {
		"doc": {
			"id": "61fdc97bbf0993a326754aa6568cea841ab891f0df3be28f62229bf5c0387e3a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Feucht_reverse.jpg/220px-Feucht_reverse.jpg",
				"previous": "The cent was the first official United States coin to be struck at the Philadelphia Mint in 1793.[1] These pieces, today known as large cents, were made of pure copper and were about the size of a half dollar.[2] They were struck every year, except 1815 due to a shortage of metal, but were slow to become established in commerce. Worn Spanish colonial silver pieces were then commonly used as money throughout the United States.[3]",
				"after": "The Mint then struck silver or gold in response to deposits by those holding bullion, and made little profit from those transactions. By the 1840s, profits, or seignorage, from monetizing copper into cents helped fund the Mint. In 1849, copper prices rose sharply, causing the Department of the Treasury to investigate possible alternatives to the large one-cent pieces.[4] The cent was unpopular in trade; as it was not a legal tender, nobody had to take it, and banks and merchants often refused it.[5] The cent was disliked for its large size as well. In 1837, the eccentric New York chemist Lewis Feuchtwanger had experimented with a smaller cent size in making model coins as part of a plan to sell his alloy (similar to base-metal German silver) to the government for use in coinage. His pieces circulated as hard times tokens in the recession years of the late 1830s and early 1840s.[5]",
			"color": "black|0.31906 dark|0.075712 gray|0.075712 dark|0.075712 grey|0.075712 gray|0.07084 grey|0.07084 dim|0.069106 gray|0.069106 dim|0.069106 grey|0.069106 antique|0.062518 white|0.062518 silver|0.060001 light|0.052199 gray|0.052199 light|0.052199 grey|0.052199 beige|0.036478 gainsboro|0.03497 linen|0.03144 old|0.029539 lace|0.029539 papaya|0.019846 whip|0.019846 floral|0.019804 white|0.019804 ivory|0.01898 sea|0.017167 shell|0.017167 corn|0.015099 silk|0.015099  "
		}
	}
}
