{
	"add": {
		"doc": {
			"id": "62024a621a4091d18a4803bac2cfb457c5a6b84ab6db2528cac1b21bb477bfee",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Half_Shekel.jpg/220px-Half_Shekel.jpg",
				"previous": "In 63 BCE, Pompey the Great intervened in a struggle for the Hasmonean throne and captured Jerusalem, extending the influence of the Roman Republic over Judea.[102] Following a short invasion by Parthians, backing the rival Hasmonean rulers, Judea became a scene of struggle between pro-Roman and pro-Parthian forces, eventually leading to the emergence of an Edomite named Herod.",
				"after": "As Rome became stronger, it installed Herod as a Jewish client king. Herod the Great, as he was known, devoted himself to developing and beautifying the city. He built walls, towers and palaces, and expanded the Temple Mount, buttressing the courtyard with blocks of stone weighing up to 100 tons. Under Herod, the area of the Temple Mount doubled in size.[84][103][104] Shortly after Herod's death, in 6 CE Judea came under direct Roman rule as the Iudaea Province,[105] although the Herodian dynasty through Agrippa II remained client kings of neighbouring territories until 96 CE. Roman rule over Jerusalem and the region was challenged in the First Jewish–Roman War, which ended with a Roman victory. The Second Temple was destroyed in 70 CE, and the entire city was destroyed in the war. The contemporary Jewish historian Josephus wrote that the city \"was so thoroughly razed to the ground by those that demolished it to its foundations, that nothing was left that could ever persuade visitors that it had once been a place of habitation.\"[106] Roman rule was again challenged during the Bar Kokhba revolt, beginning in 132 CE and suppressed by the Romans in 135 CE.",
			"color": "dark|0.27058 gray|0.27058 dark|0.27058 grey|0.27058 gray|0.18698 grey|0.18698 silver|0.14558 dim|0.11022 gray|0.11022 dim|0.11022 grey|0.11022 black|0.10687 light|0.068655 gray|0.068655 light|0.068655 grey|0.068655 gainsboro|0.041411 linen|0.011964 sea|0.0076654 shell|0.0076654 white|0.0074873 smoke|0.0074873 old|0.0062964 lace|0.0062964 floral|0.0062642 white|0.0062642 snow|0.0052332 antique|0.0044398 white|0.0044398 mint|0.0038325 cream|0.0038325 white|0.0038267 ivory|0.0034194  "
		}
	}
}
