{
	"add": {
		"doc": {
			"id": "62197d9b9785fd89a9bcaddbfe2bbd283e48f6aa3ad33743ac95ab40d5258ab5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Alhazen%2C_the_Persian.gif/170px-Alhazen%2C_the_Persian.gif",
			"previous": [],
				"after": "During late antiquity and the early Middle Ages, the Aristotelian approach to inquiries on natural phenomena was used. Some ancient knowledge was lost, or in some cases kept in obscurity, during the fall of the Roman Empire and periodic political struggles. However, the general fields of science, or natural philosophy as it was called, and much of the general knowledge from the ancient world remained preserved though the works of the early Latin encyclopedists like Isidore of Seville. Also, in the Byzantine empire, many Greek science texts were preserved in Syriac translations done by groups such as Nestorians and Monophysites.[18] Many of these were translated later on into Arabic under the Caliphate, during which many types of classical learning were preserved and in some cases improved upon.[18][19] The House of Wisdom was established in Abbasid-era Baghdad, Iraq.[20] It is considered to have been a major intellectual center, during the Islamic Golden Age, where Muslim scholars such as al-Kindi and Ibn Sahl in Baghdad, and Ibn al-Haytham in Cairo, flourished from the ninth to the thirteenth centuries, until the Mongol sack of Baghdad. Ibn al-Haytham, known later to the West as Alhazen, furthered the Aristotelian viewpoint,[21] by emphasizing experimental data and the reproducibility of its results.[nb 2] In the later medieval period, as demand for translations grew, for example from the Toledo School of Translators, Western Europeans began collecting texts written not only in Latin, but also Latin translations from Greek, Arabic, and Hebrew. The texts of Aristotle, Ptolemy,[22] and Euclid, preserved in the Houses of Wisdom, were sought amongst Catholic scholars. In Europe, Alhazen's De Aspectibus directly influenced Roger Bacon (13th century) in England, who argued for more experimental science, as demonstrated by Alhazen. By the late Middle Ages, a synthesis of Catholicism and Aristotelianism known as Scholasticism was flourishing in Western Europe, which had become a new geographic center of science, but all aspects of scholasticism were criticized in the 15th and 16th centuries.",
			"color": " "
		}
	}
}
