{
	"add": {
		"doc": {
			"id": "621e7bc4d68658f5f99046d352be9fb3d8280c48843da30396d30c163876215d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Calyptorhynchus_funereus_Bruny.jpg/170px-Calyptorhynchus_funereus_Bruny.jpg",
				"previous": "An all-yellow bird lacking in black pigment was recorded in Wauchope, New South Wales, in December 1996, and it remained a part of the local group of cockatoos for four years. Birds with part-yellow plumage have been recorded from different areas in Victoria.[21] These birds are likely cases of xanthochromism. An image of one such bird can be found here.",
				"after": "The yellow-tailed black cockatoo is found up to 2000 m (6500 ft) AMSL over southeastern Australia including the island of Tasmania and the islands of the Bass Strait (King, Flinders, Cape Barren islands), and also on Kangaroo Island.[20] On Tasmania and the islands of the Bass Strait it is the only native black-coloured cockatoo.[20] On the mainland, it is found from the vicinity of Gin Gin and Gympie in south and central eastern Queensland, south through New South Wales, where it occurs along the Great Dividing Range and to the coast, and into and across most of Victoria bar the northern and northwestern corner, to the Coorong and Mount Lofty Ranges in southeastern South Australia.[15] A tiny population numbering 30 to 40 birds inhabits the Eyre Peninsula. There they are found in sugar gum (Eucalyptus cladocalyx) woodland in the lower peninsula and migrate to the mallee areas in the northern peninsula after breeding.[22] There is evidence that birds on the New South Wales south coast move from elevated areas to lower lying areas towards the coast in winter. They are generally common or locally very common in a wide range of habits, although they tend to be locally rare at the limits of their range.[20] Their breeding range is restricted to areas with large old trees.[20]",
			"color": "black|0.69256 dim|0.091578 gray|0.091578 dim|0.091578 grey|0.091578 gray|0.055672 grey|0.055672 dark|0.025064 gray|0.025064 dark|0.025064 grey|0.025064 pale|0.014333 golden|0.014333 rod|0.014333 silver|0.0096875  "
		}
	}
}
