{
	"add": {
		"doc": {
			"id": "6238b675ecfb567105fdbbfe9fd80fd3e7a049698afb8b092ab0c620cbc36479",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/U%C5%BEovka_obojkov%C3%A1_s_%C3%BAlovkem_%2804%29.jpg/220px-U%C5%BEovka_obojkov%C3%A1_s_%C3%BAlovkem_%2804%29.jpg",
			"previous": [],
				"after": "The common toad usually moves by walking rather slowly or in short shuffling jumps involving all four legs. It spends the day concealed in a lair that it has hollowed out under foliage or beneath a root or a stone where its colouring makes it inconspicuous. It emerges at dusk and may travel some distance in the dark while hunting. It is most active in wet weather. By morning it has returned to its base and may occupy the same place for several months. It is voracious and eats woodlice, slugs, beetles, caterpillars, flies, earthworms and even small mice.[21][22] Small, fast moving prey may be caught by a flick of the tongue while larger items are grabbed with the jaws. Having no teeth, it swallows food whole in a series of gulps.[21] It does not recognise its prey as such but will try to consume any small, dark coloured, moving object it encounters at night. A research study showed that it would snap at a moving 1 cm (0.4 in) piece of black paper as if it were prey but would disregard a larger moving piece.[23] Toads seem to use visual cues for feeding and can see their prey at very low light intensities where humans are unable to discern anything.[24] Periodically, the common toad sheds its skin. This comes away in tattered pieces and is then consumed.[21]",
			"color": "dark|0.17403 gray|0.17403 dark|0.17403 grey|0.17403 gray|0.1417 grey|0.1417 dim|0.13895 gray|0.13895 dim|0.13895 grey|0.13895 black|0.10912 silver|0.10572 light|0.067546 gray|0.067546 light|0.067546 grey|0.067546 gainsboro|0.048134 white|0.019503 smoke|0.019503 sea|0.017037 shell|0.017037 snow|0.015603 lavender|0.015327 blush|0.015327 linen|0.014396 ghost|0.013682 white|0.013682 floral|0.013381 white|0.013381 white|0.012755 alice|0.010918 blue|0.010918 light|0.010623 slate|0.010623 gray|0.010623 mint|0.010327 cream|0.010327 slate|0.0099335 gray|0.0099335 misty|0.0087443 rose|0.0087443 azure|0.0070325 old|0.0058427 lace|0.0058427 lavender|0.0044134 ivory|0.0042166 rosy|0.0041571 brown|0.0041571 antique|0.0038708 white|0.0038708  "
		}
	}
}
