{
	"add": {
		"doc": {
			"id": "623ad0827ad1ea5a1acfd6b19aefd819d78fd0f4b8b11aef7e1221c7032c9df9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/RIAN_archive_386859_KHL_finals_-_Ak_Bars_vs._Lokomotiv_Yaroslavl_1-0.jpg/220px-RIAN_archive_386859_KHL_finals_-_Ak_Bars_vs._Lokomotiv_Yaroslavl_1-0.jpg",
				"previous": "Combining the total medals of Soviet Union and Russia, the country is second among all nations by number of gold medals both at the Summer Olympics and at the Winter Olympics. Soviet and later Russian athletes have always been in the top three for the number of gold medals collected at the Summer Olympics. Soviet gymnasts, track-and-field athletes, weight lifters, wrestlers, boxers, fencers, shooters, cross country skiers, biathletes, speed skaters and figure skaters were consistently among the best in the world, along with Soviet basketball, handball, volleyball and ice hockey players.[303] The 1980 Summer Olympics were held in Moscow while the 2014 Winter Olympics were hosted in Sochi.",
				"after": "Although ice hockey was only introduced during the Soviet era, the national team managed to win gold at almost all the Olympics and World Championships they contested. Russian players Valery Kharlamov, Sergei Makarov, Vyacheslav Fetisov and Vladislav Tretiak hold four of six positions in the IIHF Team of the Century.[304] Russia has not won the Olympic ice hockey tournament since the Unified Team won gold in 1992. Recently Russia won the 2008, 2009,[305] 2012 and the 2014 IIHF World Championships. Russia dominated the 2012 tournament, winning all of its ten matches—the first time any team had done so since the Soviet Union in 1989.[306]",
			"color": "black|0.13717 light|0.11112 gray|0.11112 light|0.11112 grey|0.11112 gainsboro|0.095253 dim|0.090459 gray|0.090459 dim|0.090459 grey|0.090459 dark|0.075158 gray|0.075158 dark|0.075158 grey|0.075158 silver|0.074429 gray|0.068806 grey|0.068806 dark|0.053183 slate|0.053183 gray|0.053183 rosy|0.021034 brown|0.021034 white|0.019972 smoke|0.019972 slate|0.015977 gray|0.015977 alice|0.014113 blue|0.014113 ghost|0.012822 white|0.012822 snow|0.012315 mint|0.011887 cream|0.011887 sea|0.011111 shell|0.011111 linen|0.010793 azure|0.010695 lavender|0.010627 blush|0.010627 white|0.010483 light|0.010423 slate|0.010423 gray|0.010423 lavender|0.0089376 firebrick|0.0084567 honeydew|0.0083228 floral|0.0082573 white|0.0082573 tan|0.0081595 brown|0.0077523 thistle|0.0066245 light|0.0062605 cyan|0.0062605  "
		}
	}
}
