{
	"add": {
		"doc": {
			"id": "624d7e407d7d24d23155ed94f55b7e914dc18fde5eb2fef7a43624c5a3866091",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/A364%2C_Lone_Pine_Koala_Sanctuary%2C_Queensland%2C_Australia%2C_koala%2C_2007.png/110px-A364%2C_Lone_Pine_Koala_Sanctuary%2C_Queensland%2C_Australia%2C_koala%2C_2007.png",
				"previous": "Despite the growing movement to protect native species, the poverty brought about by the drought of 1926–28 led to the killing of another 600,000 koalas during a one-month open season in August 1927.[149] In 1934, Frederick Lewis, the Chief Inspector of Game in Victoria, said that the once abundant animal had been brought to near extinction in that state, suggesting that only 500–1000 remained.[150]",
				"after": "The first successful efforts at conserving the species were initiated by the establishment of Brisbane's Lone Pine Koala Sanctuary and Sydney's Koala Park Sanctuary in the 1920s and 1930s. The owner of the latter park, Noel Burnet, became the first to successfully breed koalas and earned a reputation as the foremost contemporary authority on the marsupial.[151] In 1934, David Fleay, curator of Australian mammals at the Melbourne Zoo, established the first Australian faunal enclosure at an Australian zoo, and featured the koala. This arrangement allowed him to undertake a detailed study of its diet in captivity. Fleay later continued his conservation efforts at Healesville Sanctuary and the David Fleay Wildlife Park.[152]",
			"color": "dark|0.24862 gray|0.24862 dark|0.24862 grey|0.24862 gray|0.17942 grey|0.17942 dim|0.15635 gray|0.15635 dim|0.15635 grey|0.15635 silver|0.12059 light|0.07588 gray|0.07588 light|0.07588 grey|0.07588 tan|0.054843 gainsboro|0.048688 light|0.03145 steel|0.03145 blue|0.03145 light|0.019639 slate|0.019639 gray|0.019639 black|0.019541 white|0.0087548 smoke|0.0087548 slate|0.0085281 gray|0.0085281 lavender|0.0047493 lavender|0.0042263 blush|0.0042263 alice|0.0037925 blue|0.0037925  "
		}
	}
}
