{
	"add": {
		"doc": {
			"id": "62643ac15926f4b18664fe0f1ee2eb011cb681fb0fa756e9d3e63996bcd55156",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/AARDUT.jpg/220px-AARDUT.jpg",
				"previous": "American also closed its Kansas City overhaul base, inherited from TWA. On August 13, 2008, The Kansas City Star reported that American would move some overhaul work from the base, with repairs on Boeing 757s moved to Tulsa, Oklahoma along with one or two Boeing 767 repair lines; the city's aviation department offered to upgrade repair facilities on condition that the airline maintain at least 700 jobs.[40] On October 28, 2009, American notified its employees that it would close the Kansas City base in September 2010, and would also close or make cutbacks at five smaller maintenance stations, resulting in the loss of up to 700 jobs.[41] American closed its maintenance base at Kansas City (MCI) on September 24, 2010.[42]",
				"after": "American had repeated run-ins with the FAA regarding maintenance of its MD-80 fleet, canceling 1,000 flights to inspect wire bundles over three days in April 2008 to make sure they complied with government safety regulations.[43] In September 2009, the Associated Press and The Wall Street Journal reported that American was accused of hiding repeated maintenance lapses on at least 16 MD-80s from the FAA. Repair issues included such items as faulty emergency slides, improper engine coatings, incorrectly drilled holes, and other examples of shoddy workmanship. The most serious alleged lapse is a failure to repair cracks to pressure bulkheads; the rupture of a bulkhead could lead to cabin depressurization. It is also alleged that the airline retired one airplane in order to hide it from FAA inspectors.[44][45] American began the process of replacing its older MD-80 jets with Boeing 737s and Airbus A319s and A321s.",
			"color": "dark|0.38687 olive|0.38687 green|0.38687 dark|0.22237 slate|0.22237 gray|0.22237 dim|0.080879 gray|0.080879 dim|0.080879 grey|0.080879 dark|0.076449 gray|0.076449 dark|0.076449 grey|0.076449 gray|0.073119 grey|0.073119 silver|0.034234 light|0.022297 gray|0.022297 light|0.022297 grey|0.022297 gainsboro|0.016166  "
		}
	}
}
