{
	"add": {
		"doc": {
			"id": "627346725889ae2360b7605a10b52e033c6d5ec32eaec2f1502651fe27a51abb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Polandmap_cia.png/140px-Polandmap_cia.png",
			"previous": [],
				"after": "Poland is a country in Central Europe, bordered by Germany to the west; the Czech Republic and Slovakia to the south; Ukraine, Belarus and Lithuania to the east; and the Baltic Sea and Russia's Kaliningrad Oblast to the north. It is an ancient nation whose history as a state began near the middle of the 10th century. Its golden age occurred in the 16th century when it united with the Grand Duchy of Lithuania to form the Polish–Lithuanian Commonwealth. During the following century, the strengthening of the gentry and internal disorders weakened the nation. In a series of agreements in the late 18th century, Russia, Prussia and Austria partitioned Poland amongst themselves. It regained independence as the Second Polish Republic in the aftermath of World War I only to lose it again when it was occupied by Nazi Germany and the Soviet Union in World War II. The nation lost over six million citizens in the war, following which it emerged as the communist People's Republic of Poland under strong Soviet influence within the Eastern Bloc. A westward border shift followed by forced population transfers after the war turned a once multiethnic country into a mostly homogeneous nation state. Labor turmoil in 1980 led to the formation of the independent trade union called Solidarity (Solidarność) that over time became a political force which by 1990 had swept parliamentary elections and the presidency. A shock therapy program during the early 1990s enabled the country to transform its economy into one of the most robust in Central Europe. With its transformation to a democratic, market-oriented country largely completed, Poland is an increasingly active member of NATO and the European Union.",
			"color": "antique|0.091452 white|0.091452 linen|0.089559 old|0.08802 lace|0.08802 beige|0.086654 sea|0.085637 shell|0.085637 floral|0.085279 white|0.085279 ivory|0.084399 papaya|0.084265 whip|0.084265 corn|0.084095 silk|0.084095 light|0.071892 yellow|0.071892 dark|0.048558 gray|0.048558 dark|0.048558 grey|0.048558 silver|0.033445 gray|0.019375 grey|0.019375 light|0.018161 gray|0.018161 light|0.018161 grey|0.018161 blanched|0.0090673 almond|0.0090673 gainsboro|0.0069707 honeydew|0.0050574 dim|0.0049039 gray|0.0049039 dim|0.0049039 grey|0.0049039  "
		}
	}
}
