{
	"add": {
		"doc": {
			"id": "62834050ada461fe942935ef39b187b05e9d1e1b52dec72f62db3f8350f62a0e",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/95/Boeing_JSF_X-32_on_tarmac.jpg/220px-Boeing_JSF_X-32_on_tarmac.jpg",
				"previous": "The first flight of the X-32A (designed for CTOL and carrier trials) took place on 18 September 2000, from Boeing's Palmdale plant to Edwards Air Force Base. The X-32B demonstrated STOVL flight, first flying in March 2001. The X-32 achieved STOVL flight in much the same way as the AV-8B Harrier II with thrust vectoring of the jet and fan exhaust. The Lockheed Martin team used a riskier alternative, a shaft-driven lift fan powered by the main engine which was designed to generate more thrust than possible with only direct exhaust gases. A successful design would have greater payload, and thus longer range than a simple thrust vectored turbofan. Flight testing of both companies' aircraft continued until July 2001.",
			"after": [
				"On 26 October 2001, the Department of Defense announced that the Lockheed Martin X-35 won the JSF competition. The X-35 would be developed into the production Lockheed Martin F-35 Lightning II.[4]",
				"The loss of the JSF contract to Lockheed Martin in 2001 was a major blow to Boeing, as it represented the most important international fighter aircraft project since the Lightweight Fighter program competition of the 1960s and 1970s, which had led to the F-16 Fighting Falcon and F/A-18 Hornet. At the time, the production run of the JSF was estimated at anywhere between 3,000 and 5,000.[7] Prior to the awarding of the contract, many lawmakers pushed the idea of retaining the losing competitor as a sub-contractor, however the \"winner takes all\" principle was not changed. Nonetheless, Boeing views its work on the X-32 as a strategic investment, yielding important technologies which it has been able to adopt in the Boeing F/A-18E/F Super Hornet and other studies.[8]"
			],
			"color": "black|0.51579 light|0.15692 slate|0.15692 gray|0.15692 slate|0.14695 gray|0.14695 dark|0.078154 gray|0.078154 dark|0.078154 grey|0.078154 silver|0.026193 gray|0.01996 grey|0.01996 dim|0.01111 gray|0.01111 dim|0.01111 grey|0.01111 light|0.0079473 gray|0.0079473 light|0.0079473 grey|0.0079473 antique|0.0056291 white|0.0056291 gainsboro|0.0036749 dark|0.0035059 slate|0.0035059 gray|0.0035059  "
		}
	}
}
