{
	"add": {
		"doc": {
			"id": "62a208f6c5fbbdd55e26572716de226d6662a8459c29fa7db1d2e117a42703d9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/TrophicWeb.jpg/220px-TrophicWeb.jpg",
				"previous": "After metamorphosis, young adults may disperse into terrestrial habitats or continue to live in water. Almost all species of frogs are carnivorous as adults, preying on invertebrates, including arthropods, worms, snails, and slugs. A few of the larger ones may eat other frogs, small mammals, and fish. Some frogs use their sticky tongues to catch fast-moving prey, while others push food into their mouths with their hands. A few species also eat plant matter; the tree frog Xenohyla truncata is partly herbivorous, its diet including a large proportion of fruit,[127] Leptodactylus mystaceus has been found to eat plants,[128][129] and folivory occurs in Euphlyctis hexadactylus, with plants constituting 79.5% of its diet by volume.[130] Adult frogs are themselves attacked by many predators. The northern leopard frog (Rana pipiens) is eaten by herons, hawks, fish, large salamanders, snakes, raccoons, skunks, mink, bullfrogs, and other animals.[131]",
				"after": "Frogs are primary predators and an important part of the food web. Being cold-blooded, they make efficient use of the food they eat with little energy being used for metabolic processes, while the rest is transformed into biomass. They are themselves eaten by secondary predators and are the primary terrestrial consumers of invertebrates, most of which feed on plants. By reducing herbivory, they play a part in increasing the growth of plants and are thus part of a delicately balanced ecosystem.[132]",
			"color": "dark|0.11322 sea|0.11322 green|0.11322 black|0.1053 light|0.099904 green|0.099904 dark|0.073199 gray|0.073199 dark|0.073199 grey|0.073199 gray|0.062125 grey|0.062125 dim|0.043875 gray|0.043875 dim|0.043875 grey|0.043875 silver|0.043056 tan|0.037159 wheat|0.029995 light|0.027798 gray|0.027798 light|0.027798 grey|0.027798 pale|0.022157 golden|0.022157 rod|0.022157 firebrick|0.021578 burly|0.019227 wood|0.019227 gainsboro|0.01907 beige|0.017454 rosy|0.016791 brown|0.016791 dark|0.016551 olive|0.016551 green|0.016551 light|0.013474 golden|0.013474 rod|0.013474 yellow|0.013474 brown|0.013083 antique|0.012388 white|0.012388 blanched|0.010896 almond|0.010896 crimson|0.010134 lemon|0.010033 chiffon|0.010033 papaya|0.0095192 whip|0.0095192 peach|0.0092213 puff|0.0092213 linen|0.0090159  "
		}
	}
}
