{
	"add": {
		"doc": {
			"id": "62b9f51fd736ed51aa3e141e38305626fdebc7cdc7e1f38a3b402b9c357e1b73",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Bilingual_railway_sign_-_geograph.org.uk_-_33133.jpg/220px-Bilingual_railway_sign_-_geograph.org.uk_-_33133.jpg",
			"previous": [],
				"after": "Cardiff has a chequered linguistic history with Welsh, English, Latin, Norse and Norman French preponderant at different times. Welsh was the majority language in Cardiff from the 13th century until the city's explosive growth in the Victorian era.[90] As late as 1850, five of the 12 Anglican churches within the current city boundaries conducted their services exclusively in the Welsh language, while only two worshipped exclusively in English.[90] By 1891, the percentage of Welsh speakers had dropped to 27.9% and only Lisvane, Llanedeyrn and Creigiau remained as majority Welsh-speaking communities.[91] The Welsh language became grouped around a small cluster of chapels and churches, the most notable of which is Tabernacl in the city centre, one of four UK churches chosen to hold official services to commemorate the new millennium. Following the establishment of the city's first Welsh School (Ysgol Gymraeg Bryntaf) in the 1950s, Welsh has slowly regained some ground.[92] Aided by Welsh-medium education and migration from other parts of Wales, the number of Welsh speakers in Cardiff rose by 14,451 between 1991 and 2001; Welsh is now spoken by 11% of Cardiffians. The highest percentage of Welsh speakers is in Pentyrch, where 15.9% of the population speak the language.[93]",
			"color": "dark|0.3282 gray|0.3282 dark|0.3282 grey|0.3282 light|0.28094 steel|0.28094 blue|0.28094 gray|0.13233 grey|0.13233 silver|0.063364 slate|0.037164 gray|0.037164 dim|0.028773 gray|0.028773 dim|0.028773 grey|0.028773 light|0.028066 slate|0.028066 gray|0.028066 dark|0.022238 slate|0.022238 gray|0.022238 black|0.018896 light|0.016353 gray|0.016353 light|0.016353 grey|0.016353 gainsboro|0.0093001 lavender|0.0068974 steel|0.0065987 blue|0.0065987 corn|0.0062773 flower|0.0062773 blue|0.0062773  "
		}
	}
}
