{
	"add": {
		"doc": {
			"id": "62c1b9ac919a3a97d5f39c7035c0e62e5d20107ec7c296ac98bd31c2eec1517c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_German_Reich_%281935%E2%80%931945%29.svg/220px-Flag_of_German_Reich_%281935%E2%80%931945%29.svg.png",
				"previous": "The Second Sino-Japanese War had seen tensions rise between Imperial Japan and the United States; events such as the Panay incident and the Nanking Massacre turned American public opinion against Japan. With the occupation of French Indochina in the years of 1940–41, and with the continuing war in China, the United States placed embargoes on Japan of strategic materials such as scrap metal and oil, which were vitally needed for the war effort. The Japanese were faced with the option of either withdrawing from China and losing face or seizing and securing new sources of raw materials in the resource-rich, European-controlled colonies of South East Asia—specifically British Malaya and the Dutch East Indies (modern-day Indonesia). In 1940, Imperial Japan signed the Tripartite Pact with Nazi Germany and Fascist Italy.",
				"after": "The Second World War was a global military conflict that took place in 1939–1945. It was the largest and deadliest war in history, culminating in the Holocaust and ending with the dropping of the atom bomb.",
			"color": "black|0.36068 white|0.058331 smoke|0.058331 snow|0.057908 ghost|0.057763 white|0.057763 white|0.05751 alice|0.057336 blue|0.057336 sea|0.057089 shell|0.057089 mint|0.056552 cream|0.056552 floral|0.056208 white|0.056208 azure|0.05554 lavender|0.0534 blush|0.0534 dim|0.01137 gray|0.01137 dim|0.01137 grey|0.01137 dark|0.0083852 gray|0.0083852 dark|0.0083852 grey|0.0083852 gray|0.0077342 grey|0.0077342 silver|0.0068006 light|0.0052289 coral|0.0052289 misty|0.0049892 rose|0.0049892 light|0.0047091 gray|0.0047091 light|0.0047091 grey|0.0047091 ivory|0.0046225 light|0.0042782 pink|0.0042782 pink|0.0038671 gainsboro|0.0036291 linen|0.0030424  "
		}
	}
}
