{
	"add": {
		"doc": {
			"id": "62c8951246100aff931758194a5b31a31f69a2af2d6e3d6b9c9e0c74822406a7",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/9f/Stripline_butterfly_stub_filter.svg/110px-Stripline_butterfly_stub_filter.svg.png",
				"previous": "As mentioned above, stubs lend themselves to band-pass designs. General forms of these are similar to stub low-pass filters except that the main line is no longer a narrow high impedance line. Designers have many different topologies of stub filters to choose from, some of which produce identical responses. An example stub filter is shown in figure 12; it consists of a row of λ/4 short-circuit stubs coupled together by λ/4 impedance transformers. The stubs in the body of the filter are double paralleled stubs while the stubs on the end sections are only singles, an arrangement that has impedance matching advantages. The impedance transformers have the effect of transforming the row of shunt anti-resonators into a ladder of series resonators and shunt anti-resonators. A filter with similar properties can be constructed with λ/4 open-circuit stubs placed in series with the line and coupled together with λ/4 impedance transformers, although this structure is not possible in planar technologies.[63]",
				"after": "Yet another structure available is λ/2 open-circuit stubs across the line coupled with λ/4 impedance transformers. This topology has both low-pass and band-pass characteristics. Because it will pass DC, it is possible to transmit biasing voltages to active components without the need for blocking capacitors. Also, since short-circuit links are not required, no assembly operations other than the board printing are required when implemented as stripline. The disadvantages are (i) the filter will take up more board real estate than the corresponding λ/4 stub filter, since the stubs are all twice as long; (ii) the first spurious passband is at 2ω0, as opposed to 3ω0 for the λ/4 stub filter.[64]",
			"color": "gainsboro|0.092555 white|0.092277 smoke|0.092277 lavender|0.09013 blush|0.09013 alice|0.089933 blue|0.089933 ghost|0.0899 white|0.0899 snow|0.089831 sea|0.089607 shell|0.089607 white|0.088446 linen|0.087373 light|0.085884 gray|0.085884 light|0.085884 grey|0.085884 navajo|0.026455 white|0.026455 burly|0.015555 wood|0.015555 tan|0.012299 mint|0.012181 cream|0.012181 wheat|0.0084894 moccasin|0.0067879 azure|0.0057809 floral|0.0057703 white|0.0057703 antique|0.0046267 white|0.0046267  "
		}
	}
}
