{
	"add": {
		"doc": {
			"id": "62cf343496f37b402a24b133363578f3dd427c4c29cc9df41cf254a48c43dae8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Bronzebeile.JPG/220px-Bronzebeile.JPG",
				"previous": "The use of alloys by humans started with the use of meteoric iron, a naturally occurring alloy of nickel and iron. It is the main constituent of iron meteorites which occasionally fall down on Earth from outer space. As no metallurgic processes were used to separate iron from nickel, the alloy was used as it was.[9] Meteoric iron could be forged from a red heat to make objects such as tools, weapons, and nails. In many cultures it was shaped by cold hammering into knives and arrowheads. They were often used as anvils. Meteoric iron was very rare and valuable, and difficult for ancient people to work.[10]",
				"after": "Iron is usually found as iron ore on Earth, except for one deposit of native iron in Greenland, which was used by the Inuit people.[11] Native copper, however, was found worldwide, along with silver, gold and platinum, which were also used to make tools, jewelry, and other objects since Neolithic times. Copper was the hardest of these metals, and the most widely distributed. It became one of the most important metals to the ancients. Eventually, humans learned to smelt metals such as copper and tin from ore, and, around 2500 BC, began alloying the two metals to form bronze, which is much harder than its ingredients. Tin was rare, however, being found mostly in Great Britain. In the Middle East, people began alloying copper with zinc to form brass.[12] Ancient civilizations took into account the mixture and the various properties it produced, such as hardness, toughness and melting point, under various conditions of temperature and work hardening, developing much of the information contained in modern alloy phase diagrams.[13] Arrowheads from the Chinese Qin dynasty (around 200 BC) were often constructed with a hard bronze-head, but a softer bronze-tang, combining the alloys to prevent both dulling and breaking during use.[14]",
			"color": "gray|0.36352 grey|0.36352 dark|0.19328 gray|0.19328 dark|0.19328 grey|0.19328 dark|0.14277 slate|0.14277 gray|0.14277 dim|0.094909 gray|0.094909 dim|0.094909 grey|0.094909 light|0.060651 blue|0.060651 sky|0.038657 blue|0.038657 slate|0.024399 gray|0.024399 light|0.022847 slate|0.022847 gray|0.022847 powder|0.018128 blue|0.018128 light|0.012142 steel|0.012142 blue|0.012142 light|0.0097925 sky|0.0097925 blue|0.0097925  "
		}
	}
}
