{
	"add": {
		"doc": {
			"id": "62de04362d049552cd62a5b795e430b8db51d6717f9ed8739639dc697d67b4ae",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Falkland_Islands_-_Governor%27s_House.jpg/133px-Falkland_Islands_-_Governor%27s_House.jpg",
			"previous": [],
				"after": "The Falkland Islands (Spanish: Islas Malvinas) are a 4,700-square-mile (12,200 km2) archipelago of hundreds of islands in the South Atlantic Ocean on the Patagonian Shelf. East and West Falkland, the two largest islands, are about 300 miles (500 km) east of South America's southern Patagonian coast, at a latitude of about 52°S. The Falklands have internal self-government, with the United Kingdom taking responsibility for their defence and foreign affairs. The islands' capital is Stanley on East Falkland (Government House pictured). At various times, the islands have had French, British, Spanish, and Argentine settlements. Britain reasserted its rule in 1833, although Argentina maintained its claim to the islands. In April 1982, Argentine forces occupied the islands. British administration was restored two months later at the end of the Falklands War. The population (2,932 inhabitants in 2012) primarily consists of native Falkland Islanders, the majority of British descent. Other ethnicities include French, Gibraltarian and Scandinavian. Immigration from the United Kingdom, the South Atlantic island of Saint Helena, and Chile has reversed a population decline. Falkland Islanders have been full British citizens since 1983. Local trades include fishing, tourism and sheep farming. (Full article...)",
			"color": "dark|0.63272 olive|0.63272 green|0.63272 dark|0.056014 gray|0.056014 dark|0.056014 grey|0.056014 gray|0.048308 grey|0.048308 dim|0.036127 gray|0.036127 dim|0.036127 grey|0.036127 dark|0.03039 slate|0.03039 gray|0.03039 slate|0.025564 gray|0.025564 black|0.025535 light|0.024538 slate|0.024538 gray|0.024538 silver|0.023818 light|0.014893 gray|0.014893 light|0.014893 grey|0.014893 gainsboro|0.011106 white|0.0066695 smoke|0.0066695  "
		}
	}
}
