{
	"add": {
		"doc": {
			"id": "62eb71f9bd28cd6544cce11f93f514ef9e96e0210948a47026ae78111616bfca",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Depka.jpg/220px-Depka.jpg",
				"previous": "The Caribbean monk seal was killed and exploited by Europeans settlers and their descendants since 1494, starting with Christopher Columbus himself. The seals were easy targets for organized sealers, fishermen, turtle hunters and buccaneers because they evolved with little pressure from terrestrial predators and were thus \"genetically tame\". In the Bahamas, as many as 100 seals were slaughtered in one night. In the mid-nineteenth century, the species was thought to have gone extinct until a small colony was found near the Yucatán Peninsula in 1886. Seal killings continued, and the last reliable report of the animal alive was in 1952. The IUCN declared it extinct in 1996.[159] The Japanese sea lion was common around the Japanese islands, but overexploitation and competition from fisheries drastically decreased the population in the 1930s. The last recorded individual was a juvenile in 1974.[160]",
				"after": "Some species have become so numerous that they conflict with local people. In the United States, pinnipeds and other marine mammals are protected under the Marine Mammal Protection Act of 1972 (MMPA). Since that year, California sea lion populations have risen to 250,000. These animals began exploiting more man-made environments, like docks, for haul-out sites. Many docks are not designed to withstand the weight of several resting sea lions, which causes major tilting and other problems. Wildlife managers have used various methods to control the animals, and some city officials have redesigned docks so they can better withstand them.[161][162] Sea lions also conflict with fisherman since both depend on the same fish stocks.[163] In 2007, MMPA was amended to permit the lethal removal of sea lions from salmon runs at Bonneville Dam.[164] The 2007 law seeks to relieve pressure on the crashing Pacific Northwest salmon populations.[165] Wildlife officials have unsuccessfully attempted to ward off the sea lions using bombs, rubber bullets and bean bags.[166] Efforts to chase sea lions away from the area have also proven ineffective.[167] Critics like the Humane Society object to the killing of the sea lions, claiming that hydroelectric dams pose a greater threat to the salmon.[166] Similar conflicts have existed in South Africa with brown fur seals. In the 1980s and 1990s, South African politicians and fisherman demanded that the fur seals be culled, believing that the animals competed with commercial fisheries. Scientific studies found that culling fur seals would actually have a negative effect on the fishing industry, and the culling option was dropped in 1993.[168]",
			"color": "dim|0.32319 gray|0.32319 dim|0.32319 grey|0.32319 gray|0.30834 grey|0.30834 slate|0.11315 gray|0.11315 light|0.066984 slate|0.066984 gray|0.066984 black|0.059024 light|0.056748 steel|0.056748 blue|0.056748 dark|0.018613 gray|0.018613 dark|0.018613 grey|0.018613 chocolate|0.018587 steel|0.01047 blue|0.01047 rosy|0.0078143 brown|0.0078143  "
		}
	}
}
