{
	"add": {
		"doc": {
			"id": "6320009e25b71e2908617d8b387d17ac47f461127bca70e24233c5e61b17d02e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Ultimate_Dinosaurs_Majungasaurus.jpg/220px-Ultimate_Dinosaurs_Majungasaurus.jpg",
				"previous": "Abelisaurids, especially Majungasaurus, may instead have been adapted for a feeding strategy more similar to modern felids, with short and broad snouts, that bite once and hold on until the prey is subdued. Majungasaurus had an even broader snout than other abelisaurids, and other aspects of its anatomy may also support the bite-and-hold hypothesis. The neck was strengthened, with robust vertebrae, interlocking ribs and ossified tendons, as well as reinforced muscle attachment sites on the vertebrae and the back of the skull. These muscles would have been able to hold the head steady despite the struggles of its prey. Abelisaurid skulls were also strengthened in many areas by bone mineralized out of the skin, creating the characteristic rough texture of the bones. This is particularly true of Majungasaurus, where the nasal bones were fused and thickened for strength. On the other hand, the lower jaw of Majungasaurus sported a large fenestra (opening) on each side, as seen in other ceratosaurs, as well as synovial joints between certain bones that allowed a high degree of flexibility in the lower jaw, although not to the extent seen in snakes. This may have been an adaptation to prevent the fracture of the lower jaw when holding onto a struggling prey animal. The front teeth of the upper jaw were more robust than the rest, to provide an anchor point for the bite, while the low crown height of Majungasaurus teeth prevented them from breaking off during a struggle. Finally, unlike the teeth of Allosaurus and most other theropods, which were curved on both the front and back, abelisaurids like Majungasaurus had teeth curved on the front edge but straighter on the back (cutting) edge. This structure may have served to prevent slicing, and instead holding the teeth in place when biting.[2]",
				"after": "Majungasaurus was the largest predator in its environment, while the only known large herbivores at the time were sauropods like Rapetosaurus. Scientists have suggested that Majungasaurus, and perhaps other abelisaurids, specialized on hunting sauropods. Adaptations to strengthen the head and neck for a bite-and-hold type of attack might have been very useful against sauropods, which would have been tremendously powerful animals. This hypothesis may also be supported by the hindlegs of Majungasaurus, which were short and stocky, as opposed to the longer and more slender legs of most other theropods. While Majungasaurus would not have moved as fast as other similar-sized theropods, it would have had no trouble keeping up with slow-moving sauropods. The robust hindlimb bones suggest very powerful legs, and their shorter length would have lowered the animal's center of gravity. Thus Majungasaurus may have sacrificed speed for power.[2] Majungasaurus tooth marks on Rapetosaurus bones confirm that it at least fed on these sauropods, whether or not it actually killed them.[25]",
			"color": "black|0.53467 tan|0.063702 burly|0.061386 wood|0.061386 peru|0.046601 dim|0.031082 gray|0.031082 dim|0.031082 grey|0.031082 gray|0.028869 grey|0.028869 dark|0.024713 gray|0.024713 dark|0.024713 grey|0.024713 sandy|0.019858 brown|0.019858 navajo|0.016849 white|0.016849 wheat|0.015604 silver|0.014427 peach|0.012076 puff|0.012076 dark|0.010587 slate|0.010587 gray|0.010587 moccasin|0.010202  "
		}
	}
}
