{
	"add": {
		"doc": {
			"id": "6335f2d81cd442b9ec1a5375c84b88497b12aaca1763cb91c404c56f436ec4e4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Chetwynd_Ol_Baldy.jpg/220px-Chetwynd_Ol_Baldy.jpg",
				"previous": "The Little Prairie Heritage Museum, located in one of the town's oldest buildings (a converted post office dating to 1949) displays artifacts and re-creations of the town's frontier times, and nostalgia pieces from the construction of infrastructure through the Rocky Mountains. A public art program, started in 1987, showcases over 50 chainsaw carvings spread throughout town with a downtown monument that declares Chetwynd the \"Chainsaw Sculpture Capitol of the World\". The town's first annual chainsaw carving contest was held in June 2005. A regular contestant in the Communities in Bloom contest, the District built four wind turbines in 2004 to power decorative lights on 25 large trees along its boulevard as an entry to the WinterLights Celebration contest.[36] A statue of a lumberjack entitled \"Chetwynd, the Little Giant of the Great Peace\", measuring 2.7 metres (9 ft) tall and located alongside the highway, has stood in the town since 1967. The statue has been periodically altered by replacing the ax with other accessories, such as a lasso, rifle, gold pan and pitchfork, or dressed in other outfits, like a Santa suit.[4] In 2009 the original statue was replaced with a wood carving facsimile, intended to reflect the popularity of the annual chainsaw carving event.",
				"after": "For outdoor recreation, a community forest on Mount Baldy provides residents with trails for walking, hiking, cycling, and cross-country skiing close to home. There is downhill skiing about 100 km (60 mi) west of town (and closer to the Rocky Mountains) at the Powder King Mountain Resort. Nearby provincial parks include Gwillim Lake Provincial Park (56 km, 35 mi southeast), Moberly Lake Provincial Park (25 km, 16 mi northwest), Pine River Breaks Provincial Park (15 km, 9 mi east), and East Pine Provincial Park (30 km, 19 mi east). Chetwynd has a large indoor rodeo facility, an outdoor speed skating oval, and a general recreation complex with an ice arena, wave pool, six-lane curling rink, two baseball diamonds, and a skateboard park. It has recently been renovated and now contains a rock climbing wall, indoor walking track and fitness center. Smart Growth BC ranked the town as one of BC's most livable municipalities in 2004, due mainly to its large park spaces.[37]",
			"color": "dim|0.84857 gray|0.84857 dim|0.84857 grey|0.84857 gray|0.12251 grey|0.12251 corn|0.028793 flower|0.028793 blue|0.028793  "
		}
	}
}
