{
	"add": {
		"doc": {
			"id": "634e079c4749efa9089cdeed171d983f17227e3afd8624c9bca55b1595620068",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Mary_Anning_painting.jpg/120px-Mary_Anning_painting.jpg",
				"previous": "Portal:Geography/Featured biography/12",
				"after": "Mary Anning was a British fossil collector, dealer and palaeontologist who became known around the world for important finds she made in the Jurassic marine fossil beds at Lyme Regis where she lived. Her work contributed to fundamental changes in scientific thinking about prehistoric life and the history of the earth. Her discoveries included the first ichthyosaur skeleton to be correctly identified, found when she was just twelve years old; the first two plesiosaur skeletons ever found; the first pterosaur skeleton located outside Germany; and important fish fossils. Her observations were critical to the discovery that coprolites were fossilised faeces. Geologist Henry De la Beche'd Duria Antiquior, the first widely circulated pictorial representation of a scene from prehistoric life derived from fossil reconstructions, was based largely on fossils Anning had found. Her gender and social class prevented her from fully participating in the scientific community of 19th-century Britain, prevented her from joining the Geological Society of London, and prevented her from getting full credit for her work during her lifetime. After her death her unusual life story attracted increasing interest. In 2010 the Royal Society included Anning in a list of the ten British women who have most influenced the history of science.",
			"color": "silver|0.17499 dark|0.15755 gray|0.15755 dark|0.15755 grey|0.15755 light|0.13343 gray|0.13343 light|0.13343 grey|0.13343 black|0.11951 gainsboro|0.10554 lavender|0.047583 light|0.033712 steel|0.033712 blue|0.033712 dim|0.018817 gray|0.018817 dim|0.018817 grey|0.018817 white|0.018447 smoke|0.018447 gray|0.016416 grey|0.016416 linen|0.014295 alice|0.013198 blue|0.013198 antique|0.010314 white|0.010314 old|0.010277 lace|0.010277 ghost|0.010154 white|0.010154 tan|0.010146 beige|0.0099908 sea|0.0084319 shell|0.0084319 floral|0.0080598 white|0.0080598 ivory|0.0070904 corn|0.0067917 silk|0.0067917 lavender|0.0066246 blush|0.0066246 snow|0.0063394 papaya|0.0061935 whip|0.0061935 honeydew|0.0053417 mint|0.005281 cream|0.005281 light|0.0048007 yellow|0.0048007 dark|0.0044595 slate|0.0044595 gray|0.0044595  "
		}
	}
}
