{
	"add": {
		"doc": {
			"id": "635847e71dac561275c30fac0ee9ed7cefa2980134cd8cb6c30ecd2b49e50bbc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Kent_seasons.png/220px-Kent_seasons.png",
			"previous": [],
				"after": "Kent's climate is classified as a humid continental climate in the Dfa Köppen climate classification meaning it typically has very warm, humid summers and cold, snowy winters with moderate and variable spring and autumn seasons. The record high temperature is 103 °F (39 °C), set on July 7, 1988, with the record low of −22 °F (−30 °C) recorded January 17, 1982.[44][45] During the spring and summer months, thunderstorms are fairly common and the area is susceptible to tornadoes, though the last recorded tornado in Kent occurred in 1973.[46][47] Effects from tropical systems can also be felt, usually taking the form of increased humidity, rain, and wind, such as with the remnants of Hurricane Ike in September 2008.[48] During the winter months, snowfall is common and can occur in large quantities with considerable cloud cover. Kent is not considered part of the Lake Erie snowbelt, though lake-effect snow does occur at times. The city is in what is referred to as the \"secondary snowbelt\", meaning it will receive heavier snowfall totals from lake-effect snow when certain wind directions are more prevalent, but typically sees far less snowfall than areas to the north closer to Lake Erie.[49] While temperatures below the freezing point are typical in the winter months, thaw periods where temperatures exceed 50 °F (10 °C) and even 60 °F (16 °C) are not uncommon in January and February.[45]",
			"color": "corn|0.1721 flower|0.1721 blue|0.1721 dark|0.11205 golden|0.11205 rod|0.11205 dark|0.068863 gray|0.068863 dark|0.068863 grey|0.068863 silver|0.062132 dim|0.061093 gray|0.061093 dim|0.061093 grey|0.061093 black|0.054399 golden|0.048219 rod|0.048219 steel|0.046435 blue|0.046435 dark|0.044143 olive|0.044143 green|0.044143 gray|0.034169 grey|0.034169 light|0.031692 gray|0.031692 light|0.031692 grey|0.031692 dark|0.023368 slate|0.023368 gray|0.023368 slate|0.02174 gray|0.02174 light|0.020431 steel|0.020431 blue|0.020431 light|0.020368 slate|0.020368 gray|0.020368 gainsboro|0.019652 light|0.018906 blue|0.018906 light|0.017344 sky|0.017344 blue|0.017344 sky|0.015666 blue|0.015666 powder|0.011828 blue|0.011828 tan|0.0099463  "
		}
	}
}
