{
	"add": {
		"doc": {
			"id": "63679f2d00766eef29c9309c4d2fa79b27ac601acd47814ff679905aac5dff61",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Italy_400bC_en.svg/300px-Italy_400bC_en.svg.png",
				"previous": "Other magistracies in the Republic include tribunes, quaestors, aediles, praetors and censors.[31] The magistracies were originally restricted to patricians, but were later opened to common people, or plebeians.[32] Republican voting assemblies included the comitia centuriata (centuriate assembly), which voted on matters of war and peace and elected men to the most important offices, and the comitia tributa (tribal assembly), which elected less important offices.[33]",
				"after": "In the 4th century BC Rome had come under attack by the Gauls, now extending their power in the Italian peninsula beyond the Po Valley and through Etruria. On 16 July 390 BC, a Gallic army under the leadership of a tribal chieftain named Brennus, met the Romans on the banks of the small Allia River just ten miles north of Rome. Brennus defeated the Romans, and the Gauls marched directly to Rome. Most Romans had fled the city, but some barricaded themselves upon the Capitoline Hill for a last stand. The Gauls looted and burned the city, then laid siege to the Capitoline Hill. The siege lasted seven months, the Gauls then agreed to give the Romans peace in exchange for 1,000 pounds (450 kg) of gold.[34] (According to later legend, the Roman supervising the weighing noticed that the Gauls were using false scales. The Romans then took up arms and defeated the Gauls; their victorious general Camillus remarked \"With iron, not with gold, Rome buys her freedom.\")[35]",
			"color": "sky|0.27565 blue|0.27565 lime|0.25115 firebrick|0.16189 coral|0.11764 gold|0.069856 cadet|0.015415 blue|0.015415 sea|0.013418 green|0.013418 purple|0.0081942 dark|0.0068626 magenta|0.0068626 lime|0.0064529 green|0.0064529 sienna|0.0062481 brown|0.0055823 dark|0.0048141 slate|0.0048141 gray|0.0048141 light|0.0045751 blue|0.0045751 saddle|0.0040971 brown|0.0040971 dark|0.0038922 sea|0.0038922 green|0.0038922 dim|0.0037386 gray|0.0037386 dim|0.0037386 grey|0.0037386 indian|0.0036874 red|0.0036874 steel|0.003585 blue|0.003585  "
		}
	}
}
