{
	"add": {
		"doc": {
			"id": "6386ba5e8a5ad6e1986be4f8e709eee6d3058ef09b3caa61f5667c7688f7a103",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/South.african.b747-400.zs-sax.arp.jpg/220px-South.african.b747-400.zs-sax.arp.jpg",
				"previous": "On 20 June 2008, the Association of Tennis Professionals (ATP) agreed to extend South African Airways' sponsorship of the organisation another 3 and a half years. This sponsorship extension succeeds two years of co-operation that \"have seen a successful partnership blossom between SAA and the ATP\".[57] The deal is worth $20 million, and runs until the end of 2012. On the same day it was announced that a new ATP World Tour tournament would be held in South Africa in 2009. In 2010, the company sought to recover $4 million from then-CEO Khaya Ngqula, for allegedly spending the money on his friends and awarding business deals with organisations and individual in which he had an interest. Among them are ATP and professional golfer Ángel Cabrera.[58]",
				"after": "In February 2010, the airline appointed Siza Mzimela as its first female CEO. This came after \"an extensive and thorough process to find a suitable candidate\" for Khaya Ngqula,[59] who was accused for mismanagement, and has therefore quit. Mzimela was previously CEO of SAA's domestic partner airline, South African Express (SA Express). She took over the position from Chris Smyth on 1 April that year,[60] who has been acting CEO ever since Khaya Ngqula left since March 2009.[61][62]",
			"color": "dark|0.33014 gray|0.33014 dark|0.33014 grey|0.33014 gray|0.10572 grey|0.10572 silver|0.091313 dim|0.090509 gray|0.090509 dim|0.090509 grey|0.090509 light|0.051419 slate|0.051419 gray|0.051419 light|0.050025 steel|0.050025 blue|0.050025 slate|0.041877 gray|0.041877 black|0.031412 lavender|0.026496 light|0.02522 gray|0.02522 light|0.02522 grey|0.02522 gainsboro|0.02088 alice|0.015439 blue|0.015439 ghost|0.014087 white|0.014087 white|0.013888 smoke|0.013888 snow|0.011067 white|0.010536 azure|0.010227 mint|0.0094052 cream|0.0094052 lavender|0.0084865 blush|0.0084865 sea|0.0083356 shell|0.0083356 floral|0.0071576 white|0.0071576  "
		}
	}
}
