{
	"add": {
		"doc": {
			"id": "6388c2f11f2cd8dfcb0b263337d65e5e720cdd65c13e562b85a30460320e56f0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Prado_-_Los_Disparates_%281864%29_-_No._13_-_Modo_de_volar.jpg/220px-Prado_-_Los_Disparates_%281864%29_-_No._13_-_Modo_de_volar.jpg",
				"previous": "The Disasters of War is the second of Goya's four major print series, which constitute almost all of his most important work in the medium. He also created 35 prints early in his career—many of which are reproductions of his portraits and other works—and about 16 lithographs while living in France.[61] Goya created his first series, the 80-plate Caprichos, between 1797 and 1799 to document \"the innumerable foibles and follies to be found in any civilized society, and ... the common prejudices and deceitful practices which custom, ignorance, or self-interest have made usual.\"[62] Caprichos was put on sale in 1799, but was almost immediately withdrawn after threats from the Inquisition.[63] In The Disasters of War‍ '​s first two groups of prints, Goya largely departs from the imaginative, synthetic approach of Caprichos to realistically depict life-and-death scenes of war. In the last group, the Caprichos sense of the fantastic returns.",
				"after": "Between 1815 and 1816, Goya produced the Tauromachia, a series of 33 bullfighting scenes, during a break from The Disasters of War. Tauromachia was not politically sensitive, and was published at the end of 1816 in an edition of 320—for sale individually or in sets—without incident. It did not meet with critical or commercial success.[64] In France, Goya completed a set of four larger lithographs, Los toros de Burdeos (The Bulls of Bordeaux).[65] His final series, known as Los Disparates (The Follies), Proverbios (Proverbs), or Sueños (Dreams), contains 22 large plates and at least five drawings that are seemingly part of the series but which were never etched. All these were left in Madrid—apparently incomplete and with only a handful of proofs printed—when Goya went to France in 1823. One plate is known to have been etched in 1816, but little else is established about the chronology of the works, or Goya's plans for the set.[66]",
			"color": "black|0.75248 dim|0.051775 gray|0.051775 dim|0.051775 grey|0.051775 antique|0.051283 white|0.051283 gray|0.045496 grey|0.045496  "
		}
	}
}
