{
	"add": {
		"doc": {
			"id": "63942290f96342248efd858b2f36839529df6a428cffc903fea4b8efa298dc29",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Map_of_Celtic_Nations.svg/175px-Map_of_Celtic_Nations.svg.png",
				"previous": "The distinction of Celtic into these four sub-families most likely occurred about 900 BC according to Gray and Atkinson[41][42] but, because of estimation uncertainty, it could be any time between 1200 and 800 BC. However, they only considered Gaelic and Brythonic. The controversial paper by Forster and Toth[43] included Gaulish and put the break-up much earlier at 3200 BC ± 1500 years. They support the Insular Celtic hypothesis. The early Celts were commonly associated with the archaeological Urnfield culture, the Hallstatt culture, and the La Tène culture, though the earlier assumption of association between language and culture is now considered to be less strong.[44][45]",
				"after": "There are legitimate scholarly arguments in favour of both the Insular Celtic hypothesis and the P-Celtic/Q-Celtic hypothesis. Proponents of each schema dispute the accuracy and usefulness of the other's categories. However, since the 1970s the division into Insular and Continental Celtic has become the more widely held view (Cowgill 1975; McCone 1991, 1992; Schrijver 1995), but in the middle of the 1980s, the P-Celtic/Q-Celtic hypothesis found new supporters (Lambert 1994), because of the inscription on the Larzac piece of lead (1983), the analysis of which reveals another common phonetical innovation -nm- > -nu (Gaelic ainm / Gaulish anuana, Old Welsh enuein \"names\"), that is less accidental than only one. The discovery of a third common innovation, would allow the specialists to come to the conclusion of a Gallo-Brittonic dialect (Schmidt 1986; Fleuriot 1986).",
			"color": "slate|0.25398 blue|0.25398 medium|0.22076 orchid|0.22076 medium|0.21908 slate|0.21908 blue|0.21908 royal|0.18861 blue|0.18861 light|0.027097 steel|0.027097 blue|0.027097 thistle|0.016738 dark|0.016534 sea|0.016534 green|0.016534 khaki|0.0064299 orchid|0.0064299 lavender|0.0063264 pale|0.0061237 golden|0.0061237 rod|0.0061237  "
		}
	}
}
