{
	"add": {
		"doc": {
			"id": "63ab6c3cd55ca7598acf33a39dcd84a203b8f94114e93a64c5f859d93125bf6d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Nullah_Road_HK.jpg/220px-Nullah_Road_HK.jpg",
				"previous": "People with higher education, past experience of living in English-speaking countries, or who constantly interact with Hong Kong's English-speaking expatriate communities, generally speak an acquired form of English. Accent and spelling preference may vary from person to person, depending on the people they have interacted with and the country they have studied in. For most ordinary local Hong Kongers however, the English spoken is generally typical of foreign language learners: Cantonese-influenced pronunciation with some acquired Received Pronunciation characteristics, and with vocabularies and sentence structure generally more formal than those of native speakers. For instance, contractions and slang are not used, and many idioms are alien to Hongkongers as they do not pertain to English-speaking countries' cultures. The falling English proficiency of local English teachers has come under criticism.[1] In response, the Education Bureau has required English teachers without English language undergraduate degrees to submit to an assessment, called \"LPAT\", to ensure that their English was of sufficiently high calibre. Those failing LPAT are no longer permitted to teach English. Unless hired by the government, even native English speakers were to undergo LPAT screening. Few opted to retire to avoid the LPAT process[citation needed], while others failed the test[citation needed].",
				"after": "Some words and phrases widely understood in Hong Kong are rare or unheard of elsewhere. These often derive from Chinese, Anglo-Indian or Portuguese/Macanese.",
			"color": "dim|0.44017 gray|0.44017 dim|0.44017 grey|0.44017 gray|0.18348 grey|0.18348 dark|0.079057 slate|0.079057 gray|0.079057 dark|0.067737 gray|0.067737 dark|0.067737 grey|0.067737 slate|0.048558 gray|0.048558 silver|0.027481 light|0.025992 slate|0.025992 gray|0.025992 black|0.018756 light|0.018545 gray|0.018545 light|0.018545 grey|0.018545 gainsboro|0.014781 rosy|0.0062151 brown|0.0062151 white|0.0059838 smoke|0.0059838 alice|0.0049999 blue|0.0049999 azure|0.0042619 mint|0.0041768 cream|0.0041768  "
		}
	}
}
