{
	"add": {
		"doc": {
			"id": "63c35feea464a96bc8e70410bcd1c12aa071acfa821d20e94e5c0388540c3881",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/QinEmpireWithOrdos.jpg/220px-QinEmpireWithOrdos.jpg",
				"previous": "The Yuezhi are usually identified with the Tókharoi (Τοχάριοι), named by Greek historians among the conquerors of the Greco-Bactrian Kingdom in the 2nd century BCE.[9] At the beginning of the 20th century, manuscripts were discovered in the northern Tarim Basin written in two hitherto-unknown Indo-European languages dating from the 6th to 8th centuries CE. Believing the authors to be the Tókharoi, Friedrich W. K. Müller called these languages the Tocharian languages. Although few scholars now accept Müller's identification, \"Tocharian\" remains the standard term for the languages of the Tarim Basin manuscripts and for the people who produced them.[10][11] Although the peoples who overran the Greco-Bactrian Kingdom are known to have spoken Bactrian, an Eastern Iranian language, other scholars have argued that the Yuezhi were originally Tocharian-speakers.[12][13] In support of this claim, Christopher Beckwith argues that the character 月, usually read as Old Chinese *ŋʷjat > Mod. yuè,[14] could have been pronounced in an archaic northwestern dialect as *tokwar or *togwar, a form that resembles the Bactrian name Toχοαρ (Toχwar ~ Tuχwar) and the medieval form Toχar ~ Toχâr.[15][16]",
				"after": "The Yuezhi are described in detail in Chinese historical accounts, in particular the 2nd–1st century BCE Records of the Great Historian, or Shiji, by Sima Qian:[1]",
			"color": "lavender|0.13009 dim|0.11895 gray|0.11895 dim|0.11895 grey|0.11895 alice|0.077491 blue|0.077491 ghost|0.076774 white|0.076774 white|0.064586 smoke|0.064586 lavender|0.062385 blush|0.062385 snow|0.058403 white|0.056533 gray|0.055403 grey|0.055403 azure|0.054696 mint|0.049904 cream|0.049904 sea|0.04575 shell|0.04575 floral|0.041289 white|0.041289 dark|0.020139 gray|0.020139 dark|0.020139 grey|0.020139 light|0.019256 steel|0.019256 blue|0.019256 gainsboro|0.016189 silver|0.013499 light|0.011805 gray|0.011805 light|0.011805 grey|0.011805 slate|0.007421 gray|0.007421 thistle|0.0070694 light|0.0069273 slate|0.0069273 gray|0.0069273  "
		}
	}
}
