{
	"add": {
		"doc": {
			"id": "63d0b474ef5bfa06726a8a65bfcbd7a50c42c85116fc5824ae32deb7426ea587",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/CilgwynQuarry.JPG/240px-CilgwynQuarry.JPG",
			"previous": [],
				"after": "Methusalem Jones, previously a quarryman at Cilgwyn, began to work the Diffwys quarry at Blaenau Ffestiniog in the 1760s, which became the first large quarry in the area.[15] The large landowners were initially content to issue \"take notes\", allowing individuals to quarry slates on their lands for a yearly rent of a few shillings and a royalty on the slates produced.[16] The first landowner to take over the working of slates on his land was the owner of the Penrhyn estate, Richard Pennant, later Baron Penrhyn. In 1782, the men working quarries on the estate were bought out or ejected, and Pennant appointed James Greenfield as agent. The same year, Lord Penrhyn opened a new quarry at Caebraichycafn near Bethesda, which as Penrhyn Quarry would become the largest slate quarry in the world.[17] By 1792, this quarry was employing 500 men and producing 15,000 tons of slate per year.[18] At Dinorwig, a single large partnership took over in 1787, and in 1809 the landowner, Thomas Assheton Smith of Vaynol, took the management of the quarry into his own hands. The Cilgwyn quarries were taken over by a company in 1800, and the scattered workings at all three locations were amalgamated into a single quarry.[19] The first steam engine to be used in the slate industry was a pump installed at the Hafodlas quarry in the Nantlle Valley in 1807, but most quarries relied on hydropower to drive machinery.[20]",
			"color": "dim|0.43728 gray|0.43728 dim|0.43728 grey|0.43728 gray|0.27323 grey|0.27323 dark|0.11291 gray|0.11291 dark|0.11291 grey|0.11291 slate|0.043982 gray|0.043982 light|0.030307 slate|0.030307 gray|0.030307 silver|0.024712 dark|0.020567 olive|0.020567 green|0.020567 dark|0.016572 slate|0.016572 gray|0.016572 rosy|0.016572 brown|0.016572 light|0.0059355 gray|0.0059355 light|0.0059355 grey|0.0059355  "
		}
	}
}
