{
	"add": {
		"doc": {
			"id": "63d48d77604715ef0150695fa3e996cb715319892be7cba03435116f517ee297",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Sunset_over_the_Grand_Tetons_2.JPG/220px-Sunset_over_the_Grand_Tetons_2.JPG",
			"previous": [],
				"after": "Grand Teton National Park is one of the ten most visited national parks in the U.S., with an average of 2.5 million visitors annually.[45] The National Park Service is a federal agency of the United States Department of the Interior and manages both Grand Teton National Park and the John D. Rockefeller, Jr. Memorial Parkway. Grand Teton National Park has an average of 100 permanent and 180 seasonal employees. The park also manages 27 concession contracts that provide services such as lodging, restaurants, mountaineering guides, dude ranching, fishing and a boat shuttle on Jenny Lake.[46] The National Park Service works closely with other federal agencies such as the U.S. Forest Service, the U.S. Fish and Wildlife Service, the Bureau of Reclamation, and also, in consequence of Jackson Hole Airport's presence in the park, the Federal Aviation Administration. Initial construction of the airstrip north of the town of Jackson was completed in the 1930s.[47] When Jackson Hole National Monument was designated, the airport was inside it. After the monument and park were combined, the Jackson Hole Airport became the only commercial airport within a U.S. National Park. Jackson Hole Airport has some of the strictest noise abatement regulations of any airport in the U.S.[47] The airport has night flight curfews and overflight restrictions, with pilots being expected to approach and depart the airport along the east, south or southwest flight corridors.[48] As of 2010, 110 privately owned property inholdings, many belonging to the state of Wyoming, are located within Grand Teton National Park. Efforts to purchase or trade these inholdings for other federal lands are ongoing and through partnerships with other entities, 10 million dollars is hoped to be raised to acquire private inholdings by 2016.[49] Some monies are allocated from congress via the Land and Water Conservation Fund, but Grand Teton National Park may not get all the money needed from the fund as it is divided up between four different federal agencies. Efforts to exchange federal land from other areas for inholdings were still in the negotiation phase in 2012.[50]",
			"color": "gray|0.27046 grey|0.27046 dim|0.12013 gray|0.12013 dim|0.12013 grey|0.12013 gainsboro|0.10434 light|0.1036 gray|0.1036 light|0.1036 grey|0.1036 black|0.077987 slate|0.076995 gray|0.076995 antique|0.067457 white|0.067457 dark|0.066601 gray|0.066601 dark|0.066601 grey|0.066601 linen|0.0324 peach|0.019066 puff|0.019066 bisque|0.017996 blanched|0.012897 almond|0.012897 silver|0.01049 papaya|0.0078519 whip|0.0078519 wheat|0.0055709  "
		}
	}
}
