{
	"add": {
		"doc": {
			"id": "63db2b0c6311222a9bffd456cc769147b8977a0135685b7790d19c0243a475c3",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f7/Apple_TV_5.2.jpg/220px-Apple_TV_5.2.jpg",
			"previous": [],
				"after": "1st Generation: The original Apple TV ran a modified build of Mac OS X v10.4Tiger[73] which was labeled as Apple TV software 1.0. This presented the user with an interface similar to that of Front Row. Like Front Row on the Mac, the \"TV Shows\" option allows the user to sort contents by show or date and the \"Movies\" option also allows the user to view movie trailers for new releases. All video content, including movies, TV shows, music videos, and video podcasts, includes bookmark functionality. Apple TV automatically bookmarks video content midstream to continue playback at a later time.[74] The \"Music\" submenu offers similar options to those found on an iPod, presenting the available music lsorted by artist, album, songs, genres, and composers, as well as offering a shuffle option and listing In February 2008, Apple released a major and free upgrade to the Apple TV, labelled \"Take Two\"(2.0). This update got rid of the front row interface and instead presented a new one in which content was organized in six groups (movies, TV shows, music, YouTube, podcasts, and photos) and presented in the initial menu along with a Settings option for configuration, including software updates.[75][76] The included Apple Remote was used to navigate through the menus by using the up or down buttons and selecting options with the play button. The left and right buttons were used to perform rewind and fast-forward functions while viewing video content and perform previous and next song functionality when selecting audio-only content. In October 2009, Apple released an upgrade for the Apple TV called Apple TV software 3.0. This update replaced the interface in version 2.0 with a new interface which presented seven horizontal columns across the top of the screen for the different categories of content(Movies, TV Shows, Music, Podcasts, Photos, Internet, and Settings). This update also added many new features such as content filtering, iTunes Extras, new fonts, and a new internet radio app. As categories are selected with the remote, animated album art is displayed on the side of the display for the contents of the selected category. While playing \"audio-only\" content such as music and audio podcasts, Apple TV periodically moves album art and content info on the TV display to prevent burn-in on video displays.[74]",
			"color": "black|0.24332 gray|0.083773 grey|0.083773 dim|0.072008 gray|0.072008 dim|0.072008 grey|0.072008 dark|0.057111 gray|0.057111 dark|0.057111 grey|0.057111 silver|0.05133 dark|0.035872 slate|0.035872 gray|0.035872 light|0.030036 gray|0.030036 light|0.030036 grey|0.030036 slate|0.028338 gray|0.028338 light|0.024305 slate|0.024305 gray|0.024305 cadet|0.021222 blue|0.021222 gainsboro|0.019394 gold|0.016617 light|0.016156 steel|0.016156 blue|0.016156 golden|0.015101 rod|0.015101 coral|0.014326 thistle|0.012595 steel|0.011375 blue|0.011375 tan|0.011084 brown|0.011031 rosy|0.010979 brown|0.010979 light|0.0097263 blue|0.0097263 burly|0.0079228 wood|0.0079228 dark|0.007814 khaki|0.007814 plum|0.0077151  "
		}
	}
}
