{
	"add": {
		"doc": {
			"id": "63eff8cce0d43bcf419d6c66626fb67d6a3b3a19f995fe8f01b9c858e327b08f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Il-28_bomb_rack.JPG/220px-Il-28_bomb_rack.JPG",
				"previous": "The Il-28 design was conventional in layout, with high, unswept wings and a swept horizontal tail and fin. The engines were carried in bulky engine nacelles slung directly under the wings. The nosewheel retracted rearwards, while the mainwheels retracted forwards into the engine nacelles. The crew of three were accommodated in separate, pressurised compartments. The navigator, who also acted as bombardier, was accommodated in the glazed nose compartment and was provided with an OPB-5 bombsight based on the American Norden bombsight of the Second World War, while the pilot sat under a sideways opening bubble canopy with an armoured windscreen. The gunner sat in a separate compartment at the rear of the fuselage, operating a power driven turret armed with two Nudelman-Suranov NS-23 23 mm cannons with 250 rounds each. In service, the turret was sometimes removed as a weight saving measure.[8] While the pilot and navigator sat on ejector seats, the gunner had to parachute out of a hatch in the floor in the event of an emergency. Two more fixed, forward-firing 23 mm cannon with 100 rounds each were mounted under the nose and fired by the pilot, while a bomb bay was located under the wing, capable of holding four 100 kg (220 lb) bombs in individual containers, or single large bombs of up to 3,000 kg (6,600 lb) slung from a beam in the bomb bay.[9][10]",
				"after": "One unusual design feature of the Il-28 was that the wings and tail were split horizontally through the centre of the wing, while the fuselage was split vertically at the centreline, allowing the separate parts to be built individually and fitted out with systems before being bolted together to complete assembly of the aircraft.[11] This slightly increased the weight of the aircraft structure, but eased manufacture and proved to be more economical.[12][13]",
			"color": "tan|0.074012 sea|0.058852 shell|0.058852 floral|0.057266 white|0.057266 white|0.052484 smoke|0.052484 snow|0.050876 white|0.047452 mint|0.045431 cream|0.045431 ghost|0.043072 white|0.043072 lavender|0.037554 blush|0.037554 alice|0.036874 blue|0.036874 linen|0.036589 azure|0.033893 antique|0.029997 white|0.029997 burly|0.02912 wood|0.02912 wheat|0.026914 old|0.026638 lace|0.026638 ivory|0.024782 papaya|0.021181 whip|0.021181 beige|0.019891 blanched|0.019561 almond|0.019561 dark|0.019355 gray|0.019355 dark|0.019355 grey|0.019355 light|0.018699 gray|0.018699 light|0.018699 grey|0.018699 silver|0.017886 gainsboro|0.017292 corn|0.017105 silk|0.017105 misty|0.014359 rose|0.014359 bisque|0.01399 gray|0.013402 grey|0.013402 moccasin|0.011728 light|0.010807 yellow|0.010807 peach|0.010644 puff|0.010644 dim|0.010331 gray|0.010331 dim|0.010331 grey|0.010331 navajo|0.01031 white|0.01031 light|0.0097949 golden|0.0097949 rod|0.0097949 yellow|0.0097949 lemon|0.0081435 chiffon|0.0081435  "
		}
	}
}
