{
	"add": {
		"doc": {
			"id": "641457a01cd1821103e203082c7c86020df7b20dab2fb3ee08a3a0e24295d193",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Seattle_Great_Wheel_in_October.JPG/220px-Seattle_Great_Wheel_in_October.JPG",
				"previous": "The Henry Art Gallery opened in 1927, the first public art museum in Washington.[171] The Seattle Art Museum (SAM) opened in 1933; SAM opened a museum downtown in 1991 (expanded and reopened 2007); since 1991, the 1933 building has been SAM's Seattle Asian Art Museum (SAAM).[172] SAM also operates the Olympic Sculpture Park (opened 2007) on the waterfront north of the downtown piers. The Frye Art Museum is a free museum on First Hill. Regional history collections are at the Loghouse Museum in Alki, Klondike Gold Rush National Historical Park, the Museum of History and Industry and the Burke Museum of Natural History and Culture. Industry collections are at the Center for Wooden Boats and the adjacent Northwest Seaport, the Seattle Metropolitan Police Museum, and the Museum of Flight. Regional ethnic collections include the Nordic Heritage Museum, the Wing Luke Asian Museum and the Northwest African American Museum. Seattle has artist-run galleries,[173] including 10-year veteran Soil Art Gallery,[174] and the newer Crawl Space Gallery.[175]",
				"after": "The Seattle Great Wheel, one of the largest Ferris wheels in the U.S., opened in June 2012 as a new, permanent attraction on the city's waterfront, at Pier 57, next to Downtown Seattle.[176] The city also has many community centers for recreation, including Rainier Beach, Van Asselt, Rainier, and Jefferson south of the Ship Canal and Green Lake, Laurelhurst, Loyal Heights north of the Canal, and Meadowbrook.[177]",
			"color": "black|0.39105 sky|0.16076 blue|0.16076 light|0.12272 blue|0.12272 powder|0.082311 blue|0.082311 steel|0.05163 blue|0.05163 light|0.035354 sky|0.035354 blue|0.035354 dim|0.02118 gray|0.02118 dim|0.02118 grey|0.02118 light|0.017311 steel|0.017311 blue|0.017311 light|0.016767 slate|0.016767 gray|0.016767 slate|0.015333 gray|0.015333 dark|0.014834 slate|0.014834 gray|0.014834 pale|0.013314 turquoise|0.013314 dark|0.0080895 gray|0.0080895 dark|0.0080895 grey|0.0080895 silver|0.007258 light|0.0057288 gray|0.0057288 light|0.0057288 grey|0.0057288 gray|0.0056574 grey|0.0056574 gainsboro|0.0047488  "
		}
	}
}
