{
	"add": {
		"doc": {
			"id": "64172cc5a790efbb109d006c0053a997ae161d0c4ddae9c1ab4cfb775813b69c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Britannialion.jpg/220px-Britannialion.jpg",
				"previous": "Propaganda can be classified according to the source and nature of the message. White propaganda generally comes from an openly identified source, and is characterized by gentler methods of persuasion, such as standard public relations techniques and one-sided presentation of an argument. Black propaganda is identified as being from one source, but is in fact from another. This is most commonly to disguise the true origins of the propaganda, be it from an enemy country or from an organization with a negative public image. Grey propaganda is propaganda without any identifiable source or author. A major application of grey propaganda is making enemies believe falsehoods using straw arguments: As phase one, to make someone believe \"A\", one releases as grey propaganda \"B\", the opposite of \"A\". In phase two, \"B\" is discredited using some strawman. The enemy will then assume \"A\" to be true.",
				"after": "In scale, these different types of propaganda can also be defined by the potential of true and correct information to compete with the propaganda. For example, opposition to white propaganda is often readily found and may slightly discredit the propaganda source. Opposition to grey propaganda, when revealed (often by an inside source), may create some level of public outcry. Opposition to black propaganda is often unavailable and may be dangerous to reveal, because public cognizance of black propaganda tactics and sources would undermine or backfire the very campaign the black propagandist supported.",
			"color": "antique|0.060841 white|0.060841 linen|0.060368 old|0.058278 lace|0.058278 floral|0.053158 white|0.053158 ivory|0.050974 beige|0.048736 sea|0.048439 shell|0.048439 tan|0.047468 corn|0.043973 silk|0.043973 honeydew|0.040415 papaya|0.029969 whip|0.029969 misty|0.029294 rose|0.029294 light|0.029064 yellow|0.029064 dark|0.028396 gray|0.028396 dark|0.028396 grey|0.028396 rosy|0.028363 brown|0.028363 mint|0.028276 cream|0.028276 wheat|0.025503 burly|0.025088 wood|0.025088 gray|0.023061 grey|0.023061 bisque|0.021433 silver|0.020741 dim|0.020253 gray|0.020253 dim|0.020253 grey|0.020253 blanched|0.019309 almond|0.019309 peach|0.018397 puff|0.018397 black|0.013986 white|0.013674 snow|0.013596 light|0.011619 gray|0.011619 light|0.011619 grey|0.011619 white|0.011305 smoke|0.011305 moccasin|0.010951 navajo|0.010162 white|0.010162 gainsboro|0.0086579 brown|0.0069282 dark|0.0050742 slate|0.0050742 blue|0.0050742 light|0.0049284 golden|0.0049284 rod|0.0049284 yellow|0.0049284  "
		}
	}
}
