{
	"add": {
		"doc": {
			"id": "641b27e7439e263fefa9df8562625bf2baddc90f86c405fd81bc9292ef5f70cd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Victory_Portsmouth_um_1900.jpg/220px-Victory_Portsmouth_um_1900.jpg",
			"previous": [],
				"after": "Naval warfare developed when humans first fought from water-borne vessels. Prior to the introduction of the cannon and ships with sufficient capacity to carry the large guns, navy warfare primarily involved ramming and boarding actions. In the time of ancient Greece and the Roman Empire, naval warfare centered on long, narrow vessels powered by banks of oarsmen (such as triremes and quinqueremes) designed to ram and sink enemy vessels or come alongside the enemy vessel so its occupants could be attacked hand-to-hand. Naval warfare continued in this vein through the Middle Ages until the cannon became commonplace and capable of being reloaded quickly enough to be reused in the same battle. The Chola Dynasty of medieval India was known as one of the greatest naval powers of its time from 300 BC to 1279 AD. The Chola Navy, Chola kadarpadai comprised the naval forces of the Chola Empire along with several other Naval-arms of the country. The Chola navy played a vital role in the expansion of the Chola Tamil kingdom, including the conquest of the Sri Lanka islands, Kadaaram (Present day Burma), Sri Vijaya (present day Southeast Asia), the spread of Hinduism, Tamil architecture and Tamil culture to Southeast Asia and in curbing the piracy in Southeast Asia in 900 CE. In ancient China, large naval battles were known since the Qin Dynasty (also see Battle of Red Cliffs, 208), employing the war junk during the Han Dynasty. However, China's first official standing navy was not established until the Southern Song Dynasty in the 12th century, a time when gunpowder was a revolutionary new application to warfare.",
			"color": "dim|0.13086 gray|0.13086 dim|0.13086 grey|0.13086 dark|0.11461 slate|0.11461 gray|0.11461 black|0.095005 gray|0.052205 grey|0.052205 dark|0.052064 gray|0.052064 dark|0.052064 grey|0.052064 light|0.046863 gray|0.046863 light|0.046863 grey|0.046863 silver|0.045742 slate|0.04172 gray|0.04172 gainsboro|0.040328 linen|0.036104 sea|0.033112 shell|0.033112 floral|0.030641 white|0.030641 old|0.02843 lace|0.02843 white|0.025617 smoke|0.025617 antique|0.025064 white|0.025064 light|0.023172 slate|0.023172 gray|0.023172 ivory|0.023072 snow|0.020732 beige|0.015157 mint|0.014051 cream|0.014051 white|0.013971 papaya|0.01373 whip|0.01373 corn|0.011253 silk|0.011253 misty|0.0093243 rose|0.0093243 ghost|0.0090947 white|0.0090947 lavender|0.0087842 blush|0.0087842 alice|0.0067219 blue|0.0067219 honeydew|0.0055378 azure|0.00498 tan|0.0042114 light|0.0042073 yellow|0.0042073 blanched|0.0038178 almond|0.0038178  "
		}
	}
}
