{
	"add": {
		"doc": {
			"id": "6421c679f86c1f791ca2981787304b8b0825cb1446c86aef252352fedd34d0e1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/BAC_1-11_G-AVOF_Cambrian_BAS_Ringway_18.08.70_edited-2.jpg/220px-BAC_1-11_G-AVOF_Cambrian_BAS_Ringway_18.08.70_edited-2.jpg",
				"previous": "The prototype (G-ASHG) rolled out of the Hurn assembly hall on 28 July 1963, at which point BAC had received orders for the type from a number of operators. On 20 August 1963, the prototype conducted its first flight, painted in BUA's livery. The first flight had taken place almost a year before the Douglas DC-9, a rival American jetliner; BAC considered the BAC to hold a technological edge.[17] The One-Eleven's lead was of significant importance commercially, since — as shown by the Bonanza Air Lines case — US authorities could refuse to approve sales of foreign aircraft to domestic airlines where an American alternative existed.",
				"after": "The One-Eleven prototype, flown by test pilot Mike Lithgow, crashed on 22 October during Stall testing, with the loss of all on board. The investigation led to the discovery of what became known as deep stall or superstall, a phenomenon caused by reduced airflow to the tailplane caused by the combined blanking effects of the wing and the aft-mounted engine nacelles at high angles of attack, which prevents recovery of normal (nose-down) flight.[18] To prevent such stalls, BAC designed and added devices known as stick shakers and stick pushers to the One-Eleven's control system.[19] It also redesigned the wing's leading edge to smooth airflow into the engines and over the tailplane. The specially modified aircraft used for testing this problem is at Brooklands Museum.",
			"color": "dim|0.217 gray|0.217 dim|0.217 grey|0.217 black|0.17803 gray|0.11316 grey|0.11316 dark|0.031317 gray|0.031317 dark|0.031317 grey|0.031317 white|0.030685 smoke|0.030685 sea|0.029307 shell|0.029307 snow|0.029243 white|0.028258 floral|0.027799 white|0.027799 mint|0.027693 cream|0.027693 ghost|0.026145 white|0.026145 alice|0.024801 blue|0.024801 azure|0.024412 lavender|0.021176 blush|0.021176 silver|0.01815 light|0.01738 gray|0.01738 light|0.01738 grey|0.01738 tan|0.015702 gainsboro|0.014582 linen|0.012381 firebrick|0.011314 antique|0.0099994 white|0.0099994 dark|0.0094353 red|0.0094353 sienna|0.0084704 ivory|0.0076284 brown|0.007404 misty|0.0067426 rose|0.0067426 old|0.0064468 lace|0.0064468 rosy|0.0060938 brown|0.0060938  "
		}
	}
}
