{
	"add": {
		"doc": {
			"id": "64222a9a24be8396ef3f05050347dd977fc27e822308bc1c8e1b670d25433b87",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Pakistangdphistory.jpg/300px-Pakistangdphistory.jpg",
				"previous": "The structure of the Pakistani economy has changed from a mainly agricultural to a strong service base. Agriculture as of 2010 accounts for only 21.2% of the GDP. Even so, according to the United Nations Food and Agriculture Organization, Pakistan produced 21,591,400 metric tons of wheat in 2005, more than all of Africa (20,304,585 metric tons) and nearly as much as all of South America (24,557,784 metric tons).[252] Between 2002 and 2007 there was substantial foreign investment in Pakistan's banking and energy sectors.[253] Other important industries include clothing and textiles (accounting for nearly 60% of exports), food processing, chemicals manufacture, iron and steel.[254] There is great potential for tourism in Pakistan, but it is severely affected by the country's instability.[255] Pakistan's cement is also fast growing mainly because of demand from Afghanistan and from the domestic real estate sector. In 2013 Pakistan exported 7,708,557 metric tons of cement.[256] Pakistan has an installed capacity of 44,768,250 metric tons of cement and 42,636,428 metric tons of clinker. In 2012 and 2013, the cement industry in Pakistan became the most profitable sector of the economy.[257]",
				"after": "The Foreign direct investment (FDI) in Pakistan soared by 180.6% year-on-year to US$2.22 billion and portfolio investment by 276.1% to US$407.4 million during the first nine months of fiscal year 2006, the State Bank of Pakistan (SBP) reported on 24 April. During July–March 2005–06, the FDI year-on-year increased to US$2.224 billion from only US$792.6 million and portfolio investment to US$407.4 million, whereas it was US$108.1 million in the corresponding period last year, according to the latest statistics released by the State Bank.[258] Pakistan has achieved FDI of almost US$8.4 billion in the financial year 2006-07, surpassing the government target of $4 billion.[259] Foreign investment had significantly declined by 2010, dropping by 54.6% due to Pakistan's political instability and weak law and order, according to the State Bank.[260]",
			"color": "white|0.087016 smoke|0.087016 snow|0.085433 white|0.084232 sea|0.08294 shell|0.08294 floral|0.081928 white|0.081928 mint|0.081174 cream|0.081174 ghost|0.073973 white|0.073973 azure|0.070907 alice|0.068971 blue|0.068971 lavender|0.049753 blush|0.049753 ivory|0.036025 linen|0.027995 rosy|0.020962 brown|0.020962 light|0.01876 steel|0.01876 blue|0.01876 old|0.017686 lace|0.017686 honeydew|0.012969 misty|0.012541 rose|0.012541 lavender|0.01232 gainsboro|0.011219 light|0.0090627 slate|0.0090627 gray|0.0090627 light|0.008893 gray|0.008893 light|0.008893 grey|0.008893 silver|0.0076832 dark|0.0065669 gray|0.0065669 dark|0.0065669 grey|0.0065669 light|0.0055379 cyan|0.0055379 antique|0.0050939 white|0.0050939 slate|0.0045977 gray|0.0045977 beige|0.0035586  "
		}
	}
}
