{
	"add": {
		"doc": {
			"id": "643dc51b8894555229999aae3ba0c8eec87c3711c68af703a962070065352e67",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Edw-century-circle-yc15-090429-02-8.jpg/220px-Edw-century-circle-yc15-090429-02-8.jpg",
				"previous": "The design team also chose to use externally blown flaps to increase lift. This system uses double-slotted flaps to direct part of the jet exhaust downwards, while the rest of the exhaust passed through the flap and then followed the downward curve due to the Coandă effect. Although the effects had been studied for some time at NASA, along with similar concepts, until the introduction of the turbofan the hot and concentrated exhaust of existing engines made the system difficult to use. By the time of the AMST project, engines had changed dramatically and now provided larger volumes of less-concentrated and much cooler air. For the YC-15, four engines were used, versions of the Pratt & Whitney JT8D-17 widely used on the Boeing 727 and Douglas DC-9. The YC-15 borrowed components from other McDonnell Douglas aircraft, with its nose gear coming from the Douglas DC-8 and the nose section & cockpit being derived from the Douglas DC-10.[3][4] Parts borrowed from other aircraft included the Universal Aerial Refueling Receptacle Slipway Installation (UARRSI), taken from a Fairchild A-10, anti-tipover stabilizer struts from the Lockheed C-141 Starlifter, pumps taken from the McDonnell Douglas F-15 Eagle, Lockheed C-5 Galaxy, DC-9 and C-141 and actuators taken from the C-5 Galaxy and DC-10. In addition, the environmental cooling system was composed of components taken from the DC-9, C-141 and Boeing KC-135.[5]",
				"after": "Two YC-15s were built, one with a wingspan of 110 feet (#72-1876) and one with 132 feet (#72-1875). Both were 124 feet (38 m) long and powered by four Pratt & Whitney JT8D-17 engines, each with 15,500 lbf (68.9 kN) of thrust.",
			"color": "black|0.16196 dim|0.11229 gray|0.11229 dim|0.11229 grey|0.11229 dark|0.11124 gray|0.11124 dark|0.11124 grey|0.11124 gray|0.1076 grey|0.1076 silver|0.10357 light|0.089757 gray|0.089757 light|0.089757 grey|0.089757 gainsboro|0.07463 white|0.026143 smoke|0.026143 linen|0.025597 tan|0.02397 sea|0.018754 shell|0.018754 slate|0.017146 gray|0.017146 light|0.016138 slate|0.016138 gray|0.016138 lavender|0.015257 blush|0.015257 snow|0.015141  "
		}
	}
}
