{
	"add": {
		"doc": {
			"id": "643e1fe6947718db952ce54039e036f91c3a4f25c6b5194217b2d89768c10ff2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Picturesque_New_Guinea_Plate_XXXIX_-_Group_and_Native_House%2C_Mairy_Pass.jpg/220px-Picturesque_New_Guinea_Plate_XXXIX_-_Group_and_Native_House%2C_Mairy_Pass.jpg",
				"previous": "In more recent millennia, another wave of people arrived on the shores of New Guinea. These were the Austronesian people, who had spread down from Taiwan, through the South-east Asian archipelago, colonising many of the islands on the way. The Austronesian people had technology and skills extremely well adapted to ocean voyaging and Austronesian language speaking people are present along much of the coastal areas and islands of New Guinea. These Austronesian migrants are considered the ancestors of most people in insular Southeast Asia, from Sumatra and Java to Borneo and Sulawesi, as well as coastal new Guinea.[30]",
				"after": "The western part of the island was in contact with kingdoms in other parts of modern-day Indonesia. Negarakertagama mentioned the region of Wanin in eastern Nusantara as part of Majapahit's tributary. This has been identified with the Onin Peninsula, part of the Bomberai Peninsula near the city of Fakfak.[31][32] The sultans of Tidore, in Maluku Islands, claimed sovereignty over various coastal parts of the island.[33] During Tidore's rule, the main exports of the island during this period were resins, spices, slaves and the highly priced feathers of the bird-of-paradise.[33] Sultan Nuku, one of the most famous Tidore sultans who rebelled against Dutch colonization, called himself \"Sultan of Tidore and Papua\",[34] during his revolt in 1780s. He commanded loyalty from both Moluccan and Papuan chiefs, especially those of Raja Ampat Islands. Following Tidore's defeat, much of the territory it claimed in western part of New Guinea come under Dutch rule as part of Dutch East Indies.[34]",
			"color": " "
		}
	}
}
