{
	"add": {
		"doc": {
			"id": "644b5a5f6eff8fcfe09c8bd1bb5d75638e3000d7b35fc768ee905415d1d8c39a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Citipati_IGM_100_979.jpg/220px-Citipati_IGM_100_979.jpg",
				"previous": "When laying eggs, females grow a special type of bone between the hard outer bone and the marrow of their limbs. This medullary bone, which is rich in calcium, is used to make eggshells. A discovery of features in a Tyrannosaurus rex skeleton provided evidence of medullary bone in extinct dinosaurs and, for the first time, allowed paleontologists to establish the sex of a fossil dinosaur specimen. Further research has found medullary bone in the carnosaur Allosaurus and the ornithopod Tenontosaurus. Because the line of dinosaurs that includes Allosaurus and Tyrannosaurus diverged from the line that led to Tenontosaurus very early in the evolution of dinosaurs, this suggests that the production of medullary tissue is a general characteristic of all dinosaurs.[97]",
				"after": "Another widespread trait among modern birds is parental care for young after hatching. Jack Horner's 1978 discovery of a Maiasaura (\"good mother lizard\") nesting ground in Montana demonstrated that parental care continued long after birth among ornithopods, suggesting this behavior might also have been common to all dinosaurs.[98] There is evidence that other non-theropod dinosaurs, like Patagonian titanosaurian sauropods (1997 discovery), also nested in large groups.[99] A specimen of the Mongolian oviraptorid Citipati osmolskae was discovered in a chicken-like brooding position in 1993,[100] which indicates that they had begun using an insulating layer of feathers to keep the eggs warm.[101] Parental care being a trait common to all dinosaurs is supported by other finds. For example, a dinosaur embryo (pertaining to the prosauropod Massospondylus) was found without teeth, indicating that some parental care was required to feed the young dinosaurs.[102] Trackways have also confirmed parental behavior among ornithopods from the Isle of Skye in northwestern Scotland.[103] Nests and eggs have been found for most major groups of dinosaurs, and it appears likely that all dinosaurs cared for their young to some extent either before or shortly after hatching.[104]",
			"color": "burly|0.52016 wood|0.52016 tan|0.16318 navajo|0.076861 white|0.076861 black|0.050042 saddle|0.043513 brown|0.043513 moccasin|0.031861 sienna|0.024115 wheat|0.023221 peru|0.018794 pale|0.016976 golden|0.016976 rod|0.016976  "
		}
	}
}
