{
	"add": {
		"doc": {
			"id": "644cbd78f7805b2eabb662cff27da0715c0f013e9f217b110369c36a92ecbca6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/566175main_columbia-opf.jpg/170px-566175main_columbia-opf.jpg",
				"previous": "Construction began on Columbia in 1975 at Rockwell International's (formerly North American Aviation/North American Rockwell) principal assembly facility in Palmdale, California, a suburb of Los Angeles. Columbia was named after the historical poetic name for the United States of America, like the explorer ship of Captain Robert Gray and the Command Module of Apollo 11, the first manned landing on another celestial body. Columbia was also the female symbol of the United States. After construction, the orbiter arrived at Kennedy Space Center on March 25, 1979, to prepare for its first launch. Columbia was originally scheduled to lift off in late 1979, however the launch date was delayed by problems with both the SSME components, as well as the thermal protection system (TPS).[2] On March 19, 1981, during preparations for a ground test, workers were asphyxiated while working in Columbia's nitrogen-purged aft engine compartment, resulting in (variously reported) two or three fatalities.[3][4]",
				"after": "The first flight of Columbia (STS-1) was commanded by John Young, a veteran from the Gemini and Apollo programs who was the ninth person to walk on the Moon in 1972, and piloted by Robert Crippen, a rookie astronaut originally selected to fly on the military's Manned Orbital Laboratory (MOL) spacecraft, but transferred to NASA after its cancellation, and served as a support crew member for the Skylab and Apollo-Soyuz missions.",
			"color": "dim|0.074634 gray|0.074634 dim|0.074634 grey|0.074634 slate|0.063542 gray|0.063542 dark|0.056501 slate|0.056501 gray|0.056501 light|0.042944 sky|0.042944 blue|0.042944 light|0.040114 slate|0.040114 gray|0.040114 dark|0.03945 gray|0.03945 dark|0.03945 grey|0.03945 gray|0.0382 grey|0.0382 alice|0.032093 blue|0.032093 azure|0.031626 white|0.031566 smoke|0.031566 mint|0.029279 cream|0.029279 ghost|0.028631 white|0.028631 white|0.028131 snow|0.027476 wheat|0.02746 silver|0.02478 tan|0.023201 floral|0.023046 white|0.023046 light|0.022884 blue|0.022884 sea|0.022819 shell|0.022819 steel|0.021897 blue|0.021897 light|0.021861 steel|0.021861 blue|0.021861 light|0.021745 cyan|0.021745 sky|0.021657 blue|0.021657 lavender|0.018152 blush|0.018152 black|0.017805 light|0.017653 gray|0.017653 light|0.017653 grey|0.017653 powder|0.016261 blue|0.016261 gainsboro|0.016042 lavender|0.014266 pale|0.011427 turquoise|0.011427  "
		}
	}
}
