{
	"add": {
		"doc": {
			"id": "644f5aac8b14e6e895eab879f6bc560738ab6a914a80d9633502a84db55d22cd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Blue_wren_gnangarra.jpg/220px-Blue_wren_gnangarra.jpg",
			"previous": [],
				"after": "The splendid fairywren is a small, long-tailed bird 14 cm (5.5 in) long. Exhibiting a high degree of sexual dimorphism, the breeding male is distinctive with a bright blue forehead and ear coverts, a violet throat and deeper rich blue back wings, chest and tail with a black bill, eye band and chest band. The blue breeding plumage of the male is often referred to as nuptial plumage. The non-breeding male is brown with blue in the wings and a bluish tail. The female resembles the non-breeding male but has a chestnut bill and eye-patch.[20] Immature males will moult into breeding plumage the first breeding season after hatching, though this may be incomplete with residual brownish plumage and may take another year or two to perfect.[21] Both sexes moult in autumn after breeding, with males assuming an eclipse non-breeding plumage. They will moult again into nuptial plumage in winter or spring.[22] Some older males have remained blue all year, moulting directly from one year's nuptial plumage to the next.[23] Breeding males' blue plumage, particularly the ear-coverts, is highly iridescent due to the flattened and twisted surface of the barbules.[24] The blue plumage also reflects ultraviolet light strongly, and so may be even more prominent to other fairywrens, whose colour vision extends into this part of the spectrum.[25] The call is described as a gushing reel;[20] this is harsher and louder than other fairywrens and varies from individual to individual.[26] A soft single trrt serves as a contact call within a foraging group, while the alarm call is a tsit. Cuckoos and other intruders may be greeted with a threat posture and churring threat.[27] Females emit a purr while brooding.[28]",
			"color": "dim|0.48692 gray|0.48692 dim|0.48692 grey|0.48692 gray|0.34395 grey|0.34395 dark|0.055327 gray|0.055327 dark|0.055327 grey|0.055327 slate|0.046494 gray|0.046494 light|0.029376 slate|0.029376 gray|0.029376 steel|0.0090386 blue|0.0090386 silver|0.007943 antique|0.006104 white|0.006104  "
		}
	}
}
