{
	"add": {
		"doc": {
			"id": "646c4b1a428898a67dd0e2c63389be7242ce0d7b520c1c609e7870426dd80062",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Northrop_P-61_green_airborne.jpg/220px-Northrop_P-61_green_airborne.jpg",
				"previous": "The British epitomized this shift. Their standard early war fighters mounted eight .303-inch (7.7 mm) calibre machine guns—whereas by mid-war they often featured a combination of machine guns and 20 mm cannons, and late in the war often only cannons. The Americans, in contrast, had problems designing a native cannon design, so instead placed multiple .50 caliber (12.7 mm) heavy machine guns on their fighters. Fighters were also increasingly fitted with bomb racks and air-to-surface ordnance such as bombs or rockets beneath their wings, and pressed into close air support roles as fighter-bombers. Although they carried less ordnance than light and medium bombers, and generally had a shorter range, they were cheaper to produce and maintain and their maneuverability made it easier for them to hit moving targets such as motorized vehicles. Moreover, if they encountered enemy fighters, their ordnance (which reduced lift and increased drag and therefore decreased performance) could be jettisoned and they could engage the enemy fighters, which eliminated the need for fighter escorts that bombers required. Heavily armed and sturdily constructed fighters such as Germany's Focke-Wulf Fw 190, Britain's Hawker Typhoon and Hawker Tempest, and America's P-40, Corsair, P-47 and P-38 all excelled as fighter-bombers, and since the Second World War ground attack has been an important secondary capability of many fighters.",
				"after": "World War II also saw the first use of airborne radar on fighters. The primary purpose of these radars was to help night fighters locate enemy bombers and fighters. Because of the bulkiness of these radar sets, they could not be carried on conventional single-engined fighters and instead were typically retrofitted to larger heavy fighters or light bombers such as Germany's Messerschmitt Bf 110 and Junkers Ju 88, Britain's Mosquito and Beaufighter, and America's A-20, which then served as night fighters. The Northrop P-61 Black Widow, a purpose-built night fighter, was the only fighter of the war that incorporated radar into its original design. Britain and America cooperated closely in the development of airborne radar, and Germany's radar technology generally lagged slightly behind Anglo-American efforts, while other combatants developed few radar-equipped fighters.",
			"color": "dark|0.25314 slate|0.25314 gray|0.25314 dim|0.23331 gray|0.23331 dim|0.23331 grey|0.23331 gray|0.17056 grey|0.17056 dark|0.12128 gray|0.12128 dark|0.12128 grey|0.12128 slate|0.045614 gray|0.045614 silver|0.044685 light|0.038584 slate|0.038584 gray|0.038584 black|0.023098 light|0.018424 gray|0.018424 light|0.018424 grey|0.018424 gainsboro|0.010588 tan|0.0076498 antique|0.0047342 white|0.0047342  "
		}
	}
}
