{
	"add": {
		"doc": {
			"id": "646e81df167794204f7ace73ef1d033369a294b3b11ffca6fc4f29baaa3b02fe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Gesiowka_commemorative_plaque_at_34_Anielewicza_Street.JPG/250px-Gesiowka_commemorative_plaque_at_34_Anielewicza_Street.JPG",
				"previous": "While the Home Army was largely untainted by collaboration with the Nazis during the Holocaust,[41] some historians have asserted that, due to antisemitism, the Home Army was reluctant to accept Jews into its ranks.[42][43][44] However, records confirm that numerous Jewish resistance fighters were Home Army members.[44][45] Notable Jewish members included Julian Aleksandrowicz,[46] Stanisław \"Shlomo\" Aronson,[47] Alicja Gołod-Gołębiowska,[48] Leon Kopelman,[49] Marceli Handelsman,[50] Jerzy Makowiecki[50] and Ludwik Widerszal[50] (some, like the last three, were Home Army headquarters staff[50]), while others, such as Ignacy Schwarzbart and Szmul Zygielbojm, held top leadership positions in the National Council of the Polish Government in Exile, to which the Home Army answered.[51] (However, there were no Jewish representatives in the Government Delegation for Poland.)[52]",
				"after": "In February 1942, the Home Army Operational Command's Office of Information and Propaganda set up a Section for Jewish Affairs, directed by Henryk Woliński.[53] This section collected data about the situation of the Jewish population, drafted reports, and sent information to London. It also centralized contacts between Polish and Jewish military organizations. The Home Army also supported the Relief Council for Jews in Poland (codenamed Żegota) as well as the formation of organizations of Jewish resistance under Nazi rule in Poland.[54][55][56] One Home Army member, Witold Pilecki, was the only person to volunteer to be imprisoned at Auschwitz. The information that he gathered proved crucial in convincing the Western Allies about the fate of the Jewish population.[10] In 1942 the Home Army sent Jan Karski on a secret mission to personally carry the first eyewitness accounts of the Holocaust to the mostly disbelieving Winston Churchill and Franklin Roosevelt. Before leaving, Karski visited the Warsaw Ghetto and a Nazi concentration camp.[52][57]",
			"color": "black|0.2339 dim|0.23206 gray|0.23206 dim|0.23206 grey|0.23206 gray|0.18892 grey|0.18892 dark|0.1185 gray|0.1185 dark|0.1185 grey|0.1185 silver|0.036319 light|0.025729 gray|0.025729 light|0.025729 grey|0.025729 gainsboro|0.024035 white|0.01803 smoke|0.01803 slate|0.016944 gray|0.016944 alice|0.012686 blue|0.012686 ghost|0.012405 white|0.012405 lavender|0.012155 blush|0.012155 sea|0.012026 shell|0.012026 snow|0.011756 linen|0.011389 white|0.0096349 light|0.008258 slate|0.008258 gray|0.008258 mint|0.0071914 cream|0.0071914  "
		}
	}
}
