{
	"add": {
		"doc": {
			"id": "6476966e929dd9c27043fb3602b564260da92ec6f48465bfc3d9fca21ab90608",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Pride_leader.jpg/220px-Pride_leader.jpg",
				"previous": "Lions spend much of their time resting and are inactive for about 20 hours per day.[61] Although lions can be active at any time, their activity generally peaks after dusk with a period of socializing, grooming, and defecating. Intermittent bursts of activity follow through the night hours until dawn, when hunting most often takes place. They spend an average of two hours a day walking and 50 minutes eating.[62]",
				"after": "Lions are the most socially inclined of all wild felids, most of which remain quite solitary in nature. The lion is a predatory carnivore with two types of social organization. Some lions are residents, living in groups centering around related lionesses, called prides.[63] Females form the stable social unit in a pride and do not tolerate outside females.[64] Membership only changes with the births and deaths of lionesses,[65] although some females do leave and become nomadic.[66] Although extremely large prides, consisting of up to 30 individuals, have been observed, the average pride consists of five or six females, their cubs of both sexes, and one or two males (known as a coalition if more than one) who mate with the adult females. The number of adult males in a coalition is usually two but may increase to as many as four before decreasing again over time.[66] The sole exception to this pattern is the Tsavo lion pride which always has just one adult male.[67] Male cubs are excluded from their maternal pride when they reach maturity at around 2–3 years of age.[66] The second organizational behaviour is labeled nomads, who range widely and move about sporadically, either singularly or in pairs.[63] Pairs are more frequent among related males who have been excluded from their birth pride. Note that a lion may switch lifestyles; nomads may become residents and vice versa. Males, as a rule, live at least some portion of their lives as nomads, and some are never able to join another pride. A female who becomes a nomad has much greater difficulty joining a new pride, as the females in a pride are related, and they reject most attempts by an unrelated female to join their family group.",
			"color": "gray|0.34764 grey|0.34764 dark|0.33678 gray|0.33678 dark|0.33678 grey|0.33678 dim|0.12187 gray|0.12187 dim|0.12187 grey|0.12187 silver|0.10585 light|0.037643 gray|0.037643 light|0.037643 grey|0.037643 gainsboro|0.017957 tan|0.0073116 black|0.0058113  "
		}
	}
}
