{
	"add": {
		"doc": {
			"id": "6481fd2cb948d2c4c6d4eb3da35d9cbcc0b98ed4845b2e2fd6634bda34d0c8a7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/NWAdc9YQR.jpg/170px-NWAdc9YQR.jpg",
				"previous": "During the 1950s Douglas Aircraft studied a short- to medium-range airliner to complement their higher capacity, long range DC-8. (DC stands for Douglas Commercial.)[1] A medium-range four-engine Model 2067 was studied but it did not receive enough interest from airlines and it was abandoned. In 1960, Douglas signed a two-year contract with Sud Aviation for technical cooperation. Douglas would market and support the Sud Aviation Caravelle and produce a licensed version if airlines ordered large numbers. None were ordered and Douglas returned to its design studies after the cooperation deal expired.[2]",
				"after": "In 1962, design studies were underway. The first version seated 63 passengers and had a gross weight of 69,000 lb (31,300 kg). This design was changed into what would be initial DC-9 variant.[2] Douglas gave approval to produce the DC-9 on April 8, 1963.[2] Unlike the competing but larger Boeing 727 trijet, which used as many 707 components as possible, the DC-9 was an all-new design. The DC-9 has two rear-mounted Pratt & Whitney JT8D turbofan engines, relatively small, efficient wings, and a T-tail.[3] The DC-9's takeoff weight was limited to 80,000 lb (36,300 kg) for a two-person flight crew by Federal Aviation Agency regulations at the time.[2] DC-9 aircraft have five seats across for economy seating. The airplane seats 80 to 135 passengers depending on version and seating arrangement.",
			"color": "dark|0.19038 gray|0.19038 dark|0.19038 grey|0.19038 gray|0.14344 grey|0.14344 silver|0.12943 light|0.11004 gray|0.11004 light|0.11004 grey|0.11004 dim|0.091632 gray|0.091632 dim|0.091632 grey|0.091632 gainsboro|0.081878 maroon|0.030243 black|0.02429 brown|0.022197 white|0.018202 smoke|0.018202 lavender|0.01712 alice|0.016109 blue|0.016109 dark|0.015568 red|0.015568 ghost|0.012417 white|0.012417 rosy|0.0091954 brown|0.0091954 azure|0.0089917 firebrick|0.0087219 snow|0.0068345 slate|0.0067845 gray|0.0067845 light|0.0064158 slate|0.0064158 gray|0.0064158 mint|0.0062138 cream|0.0062138  "
		}
	}
}
