{
	"add": {
		"doc": {
			"id": "6481ba6d33cfd092034b466ff6f5ee32d3eec448acad528abac9686855a5e3d6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/3rdMarineDivisionVietnam1968h.JPEG/220px-3rdMarineDivisionVietnam1968h.JPEG",
				"previous": "Technical fire control has been performed in various places, but mostly in firing batteries. However, in the 1930s, the French moved it to battalion level and combined it with some tactical fire control. This was copied by the US. Nevertheless, most armies seemed to have retained it within firing batteries, and some duplicated the technical fire control teams in a battery to give operational resilience and tactical flexibility. Computers reduced the number of men needed and enabled decentralisation of technical fire control to autonomous sub-battery fire units, such as platoons, troops, or sections, although some armies had sometimes done this with their manual methods. Computation on the gun or launcher, integrated with their laying system, is also possible. MLRS led the way in this.",
				"after": "A fire unit is the smallest artillery or mortar element, consisting of one or more weapon systems, capable of being employed to execute a fire assigned by a tactical fire controller. Generally it is a battery, but sub-divided batteries are quite common, and in some armies very common. On occasions a battery of 6 guns has been 6 fire units. Fire units may or may not occupy separate positions. Geographically dispersed fire units may or may not have an integral capability for technical fire control.",
			"color": "black|0.12382 gray|0.11857 grey|0.11857 dim|0.10933 gray|0.10933 dim|0.10933 grey|0.10933 dark|0.075898 gray|0.075898 dark|0.075898 grey|0.075898 silver|0.043297 sea|0.039064 shell|0.039064 white|0.038027 smoke|0.038027 floral|0.036792 white|0.036792 light|0.035461 gray|0.035461 light|0.035461 grey|0.035461 snow|0.035069 white|0.032079 linen|0.031357 mint|0.030622 cream|0.030622 gainsboro|0.02994 ghost|0.024189 white|0.024189 dark|0.022969 slate|0.022969 gray|0.022969 ivory|0.021034 azure|0.019751 old|0.019276 lace|0.019276 alice|0.018212 blue|0.018212 lavender|0.016737 blush|0.016737 misty|0.015052 rose|0.015052 antique|0.013377 white|0.013377 rosy|0.005952 brown|0.005952 honeydew|0.005943 papaya|0.0053043 whip|0.0053043 peach|0.0048047 puff|0.0048047 beige|0.0043339  "
		}
	}
}
