{
	"add": {
		"doc": {
			"id": "6486ecbc38be74f1a6e942cb3dd34de99739bc1ca7d6139996cdbcebe9a35514",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Macintosh_Portable-IMG_7541.jpg/220px-Macintosh_Portable-IMG_7541.jpg",
				"previous": "In 1987, Apple spun off its software business as Claris. It was given the code and rights to several applications that had been written within Apple, most notably MacWrite, MacPaint, and MacProject. In the late 1980s, Claris released a number of revamped software titles; the result was the \"Pro\" series, including MacDraw Pro, MacWrite Pro, and FileMaker Pro. To provide a complete office suite, Claris purchased the rights to the Informix Wingz spreadsheet program on the Mac, renaming it Claris Resolve, and added the new presentation software Claris Impact. By the early 1990s, Claris applications were shipping with the majority of consumer-level Macintoshes and were extremely popular. In 1991, Claris released ClarisWorks, which soon became their second best-selling application. When Claris was reincorporated back into Apple in 1998, ClarisWorks was renamed AppleWorks beginning with version 5.0.[55]",
				"after": "In 1988, Apple sued Microsoft and Hewlett-Packard on the grounds that they infringed Apple's copyrighted GUI, citing (among other things) the use of rectangular, overlapping, and resizable windows. After four years, the case was decided against Apple, as were later appeals. Apple's actions were criticized by some in the software community, including the Free Software Foundation (FSF), who felt Apple was trying to monopolize on GUIs in general, and boycotted GNU software for the Macintosh platform for seven years.[56][57]",
			"color": "dark|0.35908 gray|0.35908 dark|0.35908 grey|0.35908 gray|0.086549 grey|0.086549 silver|0.07721 dim|0.04211 gray|0.04211 dim|0.04211 grey|0.04211 sea|0.04075 shell|0.04075 white|0.040594 smoke|0.040594 floral|0.040267 white|0.040267 snow|0.039885 mint|0.039246 cream|0.039246 white|0.039226 ghost|0.036093 white|0.036093 azure|0.035798 alice|0.032892 blue|0.032892 lavender|0.02379 blush|0.02379 ivory|0.015634 black|0.011274 linen|0.010388 light|0.0099591 gray|0.0099591 light|0.0099591 grey|0.0099591 gainsboro|0.0070766 old|0.0059278 lace|0.0059278  "
		}
	}
}
