{
	"add": {
		"doc": {
			"id": "64979234e79a30a920b12c0d37e4614981000ca34a75013813735577ebbbf53c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/US_womens_earnings_and_employment_by_industry_2009.png/220px-US_womens_earnings_and_employment_by_industry_2009.png",
				"previous": "This method of economic analysis seeks to overcome gender bias by showing how men and women differ in their consumption, investment or saving behavior. Gender disaggregation strategies justify the separation of macroeconomic variables by gender. Korkut Ertürk and Nilüfer Çağatay show how the feminization of labor stimulates investment, while an increase in female activity in housework raises savings.[33] This model highlights how gender effects macroeconomic variables and shows that economies have a higher likelihood of recovering from downturns if women participate in the labor force more, instead of devoting their time to housework.[4]",
				"after": "This approach demonstrates the effects of gender inequalities by enhancing macroeconomic models. Bernard Walters shows that traditional neoclassical models fail to adequately assess work related to reproduction by assuming that the population and labor are determined exogenously.[34] That fails to account for the fact that inputs are produced through caring labor, which is disproportionately performed by women. Stephen Knowels et al. use a neoclassical growth model to show that women's education has a positive statistically significant effect on labor productivity, more robust than that of men's education.[35] In both of these cases, economists highlight and address the gender biases of macroeconomic variables to show that gender plays a significant role in models' outcomes.",
			"color": "white|0.096922 smoke|0.096922 alice|0.095335 blue|0.095335 sea|0.095326 shell|0.095326 ghost|0.095272 white|0.095272 snow|0.095268 white|0.094393 mint|0.093739 cream|0.093739 floral|0.09335 white|0.09335 lavender|0.093281 blush|0.093281 azure|0.092828 gainsboro|0.0080855 light|0.0072276 gray|0.0072276 light|0.0072276 grey|0.0072276 indian|0.0049963 red|0.0049963 linen|0.004696 lavender|0.0028023 silver|0.002789 ivory|0.002548  "
		}
	}
}
