{
	"add": {
		"doc": {
			"id": "64ba3a9332e9b30b13a83e99d2a455ae41ef9e527e98c1f671abc5a1f84b35dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Flag_of_Hong_Kong_%281959-1997%29.svg/220px-Flag_of_Hong_Kong_%281959-1997%29.svg.png",
				"previous": "During the Japanese occupation of Hong Kong, the Japanese army committed atrocities against civilians and POWs, such as the St. Stephen's College massacre. Local residents also suffered widespread food shortages, limited rationing and hyper-inflation arising from the forced exchange of currency from Hong Kong Dollars to Japanese military banknotes. The initial ratio of 2:1 was gradually devalued to 4:1 and ownership of Hong Kong Dollars was declared illegal and punishable by harsh torture. Due to starvation, mass executions, and forced deportation for slave labour to mainland China, the population of Hong Kong had dwindled from 1.6 million in 1941 to 600,000 in 1945, when Britain resumed control of the colony on 30 August 1945.[65]",
				"after": "Hong Kong's population recovered quickly after the war, as a wave of skilled migrants from China flooded in for refuge from the Chinese Civil War. When the Communists gained control of mainland China in 1949, even more skilled migrants fled across the open border for fear of persecution.[58] Many newcomers, especially those who had been based in the major port cities of Shanghai and Guangzhou, established corporations and small- to medium-sized businesses and shifted their base operations to British Hong Kong.[58] The Chinese Communist Party's establishment of a socialist state in China on 1 October 1949 caused the British colonial government to reconsider Hong Kong's open border to mainland China. In 1951, a boundary zone was demarked as a buffer zone against potential military attacks from communist China. Border posts in the north of Hong Kong began operation in 1953 to regulate the movement of people and goods into and out of British Hong Kong.",
			"color": "snow|0.071844 white|0.070981 white|0.07084 smoke|0.07084 mint|0.070537 cream|0.070537 sea|0.069598 shell|0.069598 floral|0.06895 white|0.06895 alice|0.067621 blue|0.067621 ghost|0.067489 white|0.067489 azure|0.067131 lavender|0.052564 blush|0.052564 ivory|0.020737 light|0.019805 steel|0.019805 blue|0.019805 golden|0.019305 rod|0.019305 pale|0.014659 golden|0.014659 rod|0.014659 wheat|0.013552 khaki|0.013245 dark|0.012428 green|0.012428 forest|0.011576 green|0.011576 gold|0.011508 green|0.011474 misty|0.011074 rose|0.011074 gainsboro|0.010039 linen|0.0098623 lavender|0.0096946 light|0.0077169 gray|0.0077169 light|0.0077169 grey|0.0077169 antique|0.0071931 white|0.0071931 moccasin|0.0069208 old|0.0066455 lace|0.0066455 blanched|0.0057575 almond|0.0057575 papaya|0.0057339 whip|0.0057339 beige|0.0054643 dark|0.0053796 khaki|0.0053796 cadet|0.0053796 blue|0.0053796 pink|0.0049711 navajo|0.0049609 white|0.0049609 bisque|0.004543 corn|0.0045426 silk|0.0045426 steel|0.0044944 blue|0.0044944 chocolate|0.0036091 crimson|0.003541  "
		}
	}
}
