{
	"add": {
		"doc": {
			"id": "64c45a975333916e35d1c5ad984c8cf87d4eaa038f3e76b825561e6444a59309",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Lion.ogv/220px--Lion.ogv.jpg",
				"previous": "The area a pride occupies is called a pride area, whereas that by a nomad is a range.[63] The males associated with a pride tend to stay on the fringes, patrolling their territory. Why sociality – the most pronounced in any cat species – has developed in lionesses is the subject of much debate. Increased hunting success appears an obvious reason, but this is less than sure upon examination: coordinated hunting does allow for more successful predation but also ensures that non-hunting members reduce per capita calorific intake; however, some take a role raising cubs, who may be left alone for extended periods of time. Members of the pride regularly tend to play the same role in hunts and hone their skills. The health of the hunters is the primary need for the survival of the pride, and they are the first to consume the prey at the site it is taken. Other benefits include possible kin selection (better to share food with a related lion than with a stranger), protection of the young, maintenance of territory, and individual insurance against injury and hunger.[25]",
				"after": "Lionesses do most of the hunting for their pride. They are more effective hunters, as they are smaller, swifter, and more agile than the males and unencumbered by the heavy and conspicuous mane, which causes overheating during exertion. They act as a coordinated group with members who perform the same role consistently in order to stalk and bring down the prey successfully. Smaller prey is eaten at the location of the hunt, thereby being shared among the hunters; when the kill is larger it often is dragged to the pride area. There is more sharing of larger kills,[68] although pride members often behave aggressively toward each other as each tries to consume as much food as possible. Near the conclusion of the hunt, males have a tendency to dominate the kill once the lionesses have succeeded. They are more likely to share this with the cubs than with the lionesses, but males rarely share food they have killed by themselves.",
			"color": "tan|1  "
		}
	}
}
