{
	"add": {
		"doc": {
			"id": "64e8be95891b110e026361df43206baf93a93265c84a15135f5052556cedec8e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Texas_Acrocanthosaurus_tracksites.png/220px-Texas_Acrocanthosaurus_tracksites.png",
			"previous": [],
				"after": "The Glen Rose Formation of central Texas preserves many dinosaur footprints, including large, three-toed theropod prints. The most famous of these trackways was discovered along the Paluxy River in Dinosaur Valley State Park, a section of which is now on exhibit in the American Museum of Natural History in New York City,[32] although several other sites around the state have been described in the literature.[33][34] It is impossible to say what animal made the prints, since no fossil bones have been associated with the trackways. However, scientists have long considered it likely that the footprints belong to Acrocanthosaurus.[35] A 2001 study compared the Glen Rose footprints to the feet of various large theropods but could not confidently assign them to any particular genus. However, the study noted that the tracks were within the ranges of size and shape expected for Acrocanthosaurus. Because the Glen Rose Formation is close to the Antlers and Twin Mountains Formations in both geographical location and geological age, and the only large theropod known from those formations is Acrocanthosaurus, the study concluded that Acrocanthosaurus was most likely to have made the tracks.[36]",
			"color": "red|0.14521 dark|0.067334 gray|0.067334 dark|0.067334 grey|0.067334 white|0.063432 smoke|0.063432 alice|0.058987 blue|0.058987 ghost|0.058644 white|0.058644 snow|0.058415 silver|0.058061 sea|0.057529 shell|0.057529 white|0.056706 mint|0.05569 cream|0.05569 floral|0.053594 white|0.053594 azure|0.05276 lavender|0.047939 blush|0.047939 light|0.044878 gray|0.044878 light|0.044878 grey|0.044878 gainsboro|0.036343 gray|0.017176 grey|0.017176 rosy|0.012013 brown|0.012013 firebrick|0.01124 ivory|0.0094532 linen|0.0080939 dim|0.0077977 gray|0.0077977 dim|0.0077977 grey|0.0077977 brown|0.0075518 indian|0.0046365 red|0.0046365  "
		}
	}
}
