{
	"add": {
		"doc": {
			"id": "64fdef7353a0ab353053b963088df88ef3d5d538ab4db0d7f9f1e240dac0684d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/08gorge2.jpeg/220px-08gorge2.jpeg",
				"previous": "On July 1, 2003, Christopher Swain of Portland, Oregon, became the first person to swim the Columbia River's entire length, in an effort to raise public awareness about the river's environmental health.[166][169][170]",
				"after": "Most of the Columbia's drainage basin (which, at 258,000 square miles or 670,000 square kilometres, is about the size of France)[171] lies roughly between the Rocky Mountains on the east and the Cascade Mountains on the west. In the United States and Canada the term watershed is often used to mean drainage basin. The term Columbia Basin is used to refer not only to the entire drainage basin but also to subsets of the river's full watershed, such as the relatively flat and unforested area in eastern Washington bounded by the Cascades, the Rocky Mountains, and the Blue Mountains.[172] Within the watershed are diverse landforms including mountains, arid plateaus, river valleys, rolling uplands, and deep gorges. Grand Teton National Park lies in the watershed, as well as parts of Yellowstone National Park, Glacier National Park, Mount Rainier National Park, and North Cascades National Park. Canadian National Parks in the watershed include Kootenay National Park, Yoho National Park, Glacier National Park, and Mount Revelstoke National Park. Hells Canyon, the deepest gorge in North America,[171] and the Columbia Gorge are in the watershed. Vegetation varies widely, ranging from western hemlock and western redcedar in the moist regions to sagebrush in the arid regions.[173] The watershed provides habitat for 609 known fish and wildlife species, including the bull trout, bald eagle, gray wolf, grizzly bear, and Canada lynx.[171]",
			"color": "black|0.54849 slate|0.13796 gray|0.13796 light|0.13484 slate|0.13484 gray|0.13484 dim|0.10401 gray|0.10401 dim|0.10401 grey|0.10401 gray|0.051571 grey|0.051571 steel|0.019522 blue|0.019522  "
		}
	}
}
