{
	"add": {
		"doc": {
			"id": "6512396667403697fab8fc4760749a84af8603ab2c29c587f1d6b005781dec66",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Carabane-H%C3%B4tel.JPG/220px-Carabane-H%C3%B4tel.JPG",
				"previous": "At the same time, national and even international controversy threatened the industry from the beginning. Those who opposed tourism in Senegal described it as a new form of colonialism while supporters saw it as a panacea that would cure the country of underdevelopment.[122] The idea of alternative tourism was discussed. Several towns in Basse Casamance, including Carabane, were selected to test an integrated agritourism managed by the villagers themselves. In the early 1970s, the agritourism promoter Christian Saglio, a young French sociologist who later became the director of the Leopold Sedar Senghor French Institute in Dakar, believed in Carabane's potential. He stated that he wanted to make the island the \"Gorée of Casamance\", using it as a hub for other camps. Saglio suggested the restoration of old buildings and canopy beds.[123]",
				"after": "Despite his fervour, Saglio's negotiations with the local people were unsuccessful. Niomoune and Carabane were the first two villages to attempt to apply this innovative approach, but both failed. The inhabitants were reluctant to participate, and the young inexperienced promoter had to abandon some of his ethnographic theories in favour of being careful to understand the daily realities of villages.[124] The project was eventually abandoned, and the Catholic missions house was transformed by the nuns themselves into a modern, functional building. Despite the failure of Saglio's initiative in Carabane, agritourist camps were set up over the following decade in a dozen other nearby towns.[note 8]",
			"color": "black|0.34205 gray|0.17012 grey|0.17012 dark|0.1344 gray|0.1344 dark|0.1344 grey|0.1344 dim|0.12933 gray|0.12933 dim|0.12933 grey|0.12933 light|0.095906 slate|0.095906 gray|0.095906 slate|0.04389 gray|0.04389 silver|0.028187 light|0.01823 gray|0.01823 light|0.01823 grey|0.01823 gainsboro|0.012885  "
		}
	}
}
