{
	"add": {
		"doc": {
			"id": "6520b37920909a7193d5e748437094b0bea140a6ab45f961345ea42d594486a2",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8b/NWA_WorldPerks_logo.png/150px-NWA_WorldPerks_logo.png",
			"previous": [],
				"after": "Northwest Airlines' frequent-flyer program, WorldPerks, offered regular travelers the ability to obtain free tickets, First Class upgrades on flights, discounted membership for its airport lounges (WorldClubs), or other types of rewards. Customers could accumulate miles from actual flight segments flown or through Northwest's partners, such as car rental companies, hotels, credit cards, and other vendors. WorldPerks' elite tiers were Silver Elite, Gold Elite and Platinum elite which allowed for more mileage bonuses, priority wait lists and standby and other benefits. Over the years, some details of the program changed, such as introducing capacity controlled awards (only a certain number of seats allocated for free travel), expiration of account if no activity occurred in three years, requirement of a Saturday-night stay for domestic coach awards, waiving of capacity controls for awards but requiring double the amount of miles for redemption, and adding several partner airlines for mileage accumulation and award redemption.[61] The original name of the WorldPerks program was the Northwest Orient Airlines Free Flight Plan, which began in 1981.[62] The original program used paper coupons and gave credit for flight segments. Upon renaming the program to \"WorldPerks\", a mileage-based system was used.",
			"color": "black|0.10281 dark|0.076814 gray|0.076814 dark|0.076814 grey|0.076814 silver|0.075493 light|0.073561 gray|0.073561 light|0.073561 grey|0.073561 dim|0.068945 gray|0.068945 dim|0.068945 grey|0.068945 gray|0.066585 grey|0.066585 gainsboro|0.059738 white|0.05467 smoke|0.05467 alice|0.046701 blue|0.046701 ghost|0.04655 white|0.04655 sea|0.046226 shell|0.046226 snow|0.045961 lavender|0.045279 blush|0.045279 white|0.043967 mint|0.041186 cream|0.041186 floral|0.038505 white|0.038505 azure|0.036044 linen|0.013002 red|0.0042635 misty|0.0032962 rose|0.0032962 light|0.0028614 coral|0.0028614  "
		}
	}
}
