{
	"add": {
		"doc": {
			"id": "6534bee1b2acf76f617dab27c03f7d9de5254940a4b2d6c9d0c7427584b277c0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Aerol%C3%ADneas_Argentinas_Boeing_747-200B_LV-LZD_LHR_1979-5-14.png/220px-Aerol%C3%ADneas_Argentinas_Boeing_747-200B_LV-LZD_LHR_1979-5-14.png",
				"previous": "By March 1970 (1970-03), Aerolíneas Argentinas had a fleet of six Boeing 707s that served routes to Europe and the United States, three Caravelles 6Rs and four Comet 4s that flew regional services, and 12 HS-748s that flew domestically, whereas six Boeing 737-200s were on order.[29] During the decade, the fleet saw the arrival of three different aircraft types from Boeing: the 727—the first example entered the fleet in December 1979 (1979-12) on lease from Hughes AirWest and three more were ordered directly from Boeing[30][31]—, the 737,[32] and the 747.[33] The incorporation of the Fokker F-28 into the fleet in the mid-1970s prompted the withdrawal of the last HS-748s, making the company to be the first South American airline in operating an all-jet aircraft park.[34] Frankfurt, Madrid and Rome became the first destinations to be served with the brand new 747s, starting January 1977 (1977-01).[35] Another milestone for the company took place in June 1980 (1980-06) with the first south polar scheduled service, linking Buenos Aires with Hong Kong via Auckland.[36] Late that year, a second-hand Boeing 747SP was acquired from Braniff for US$51,000,000 ($145,976,171 in 2015).[37]",
				"after": "The airline was assigned by law the monopoly of international operations from Argentina in 1971.[38] This meant no other Argentine airline was able to operate international flights, let alone the already created Austral. The carrier therefore became the flag carrier of the country. The same law also assigned Aerolíneas Argentinas a 50% of the domestic market share.[38] Following the acquisition of Austral by the Argentine government in 1980, both Aerolíneas Argentinas and Austral became government-owned, to the extent that some routes were simultaneously operated, even using similar equipment. However, there existed a state of continuous tension over salary differences between both companies that eventually led the Aerolíneas Argentinas' pilots to a three-week-long strike that started on 1 July 1986.[39] During this strike, the government leased pilots from the Argentine Air Force to operate some aircraft. Other companies took advantage from this situation and gained the market share Aerolíneas Argentinas lost, as domestic routes were operated by Austral, LADE and LAPA, and the government temporarily authorised foreign carriers to exploit the company's international routes.[40]",
			"color": "light|0.65038 steel|0.65038 blue|0.65038 dim|0.072598 gray|0.072598 dim|0.072598 grey|0.072598 black|0.037424 light|0.024518 slate|0.024518 gray|0.024518 gray|0.022889 grey|0.022889 dark|0.020957 gray|0.020957 dark|0.020957 grey|0.020957 slate|0.019287 gray|0.019287 silver|0.017977 light|0.016357 gray|0.016357 light|0.016357 grey|0.016357 gainsboro|0.012302 steel|0.012084 blue|0.012084 white|0.0087706 smoke|0.0087706 sea|0.0074992 shell|0.0074992 snow|0.0073977 light|0.0073189 blue|0.0073189 ghost|0.006914 white|0.006914 white|0.0067838 floral|0.0067084 white|0.0067084 mint|0.006704 cream|0.006704 alice|0.006671 blue|0.006671 lavender|0.0065762 blush|0.0065762 linen|0.0065306  "
		}
	}
}
