{
	"add": {
		"doc": {
			"id": "6534b0e76c4fa9901345f089004029bd19e4318a3eb4b87cfb10ea7fd3cdc275",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Takasago_Volunteer_Corps.JPG/220px-Takasago_Volunteer_Corps.JPG",
				"previous": "The Highland tribes were renowned for their skill in headhunting, which was a symbol of bravery and valor (Hsu 1991:29–36). Almost every tribe except the Yami (Tao) practiced headhunting. Once the victims had been dispatched the heads were taken then boiled and left to dry, often hanging from trees or shelves constructed for the purpose. A party returning with a head was cause for celebration, as it was believed to bring good luck. The Bunun people would often take prisoners and inscribe prayers or messages to their dead on arrows, then shoot their prisoner with the hope their prayers would be carried to the dead. Han settlers were often the victims of headhunting raids as they were considered by the aborigines to be liars and enemies. A headhunting raid would often strike at workers in the fields, or employ the ruse of setting a dwelling alight and then decapitating the inhabitants as they fled the burning structure. It was also customary to later raise the victim's surviving children as full members of the tribe. Often the heads themselves were ceremonially 'invited' to join the tribe as members, where they were supposed to watch over the tribe and keep them safe. The indigenous inhabitants of Taiwan accepted the convention and practice of headhunting as one of the calculated risks of tribal life. The last groups to practice headhunting were the Paiwan, Bunun, and Atayal groups (Montgomery-McGovern 1922). Japanese rule ended the practice by 1930, but some elder Taiwanese can recall the practice (Yeh 2003).",
				"after": "When the Treaty of Shimonoseki was finalized on 17 April 1895, Taiwan was ceded by the Qing Empire to Japan (Gold 1986:36). Taiwan's incorporation into the Japanese political orbit brought Taiwanese aborigines into contact with a new colonial structure, determined to define and locate indigenous people within the framework of a new, multi-ethnic empire (Kleeman 2003:19). The means of accomplishing this goal took three main forms: anthropological study of the natives of Taiwan, attempts to reshape the aborigines in the mould of the Japanese, and military suppression. The Aboriginals and Han joined together to violently revolt against Japanese rule in the 1907 Beipu Uprising and 1915 Tapani Incident.",
			"color": " "
		}
	}
}
