{
	"add": {
		"doc": {
			"id": "6538de80cc509d5ac3663fdfff010c983500d7919900cfd5e77dbbd7afa58663",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/British_Aerospace_Hawk_T1%2C_UK_-_Air_Force_AN1355498.jpg/220px-British_Aerospace_Hawk_T1%2C_UK_-_Air_Force_AN1355498.jpg",
				"previous": "The Royal Air Force Aerobatic Team (RAFAT), the formal name of the Red Arrows, began life at RAF Fairford in Gloucestershire, then a satellite of the Central Flying School (CFS).The Red Arrows moved to RAF Kemble in 1966 after RAF Fairford became the place of choice for BAE to run test flights for Concorde.[citation needed] When RAF Scampton became the CFS Headquarters in 1983, the Red Arrows moved there. As an economy measure, Scampton closed in 1995, so the Red Arrows moved just twenty miles to RAF Cranwell; however, as they still used the air space above Scampton, the emergency facilities and runways had to be maintained. Since 21 December 2000, the Red Arrows have been based again at RAF Scampton, near Lincoln.",
				"after": "The first team, led by Squadron Leader Lee Jones, had seven display pilots and flew the Folland Gnat T1 jet trainer. The first display in the UK was on 6 May 1965 at Little Rissington for a press day. At the subsequent National Air Day display, three days later, at Clermont Ferrand in France, one French journalist described the team as \"Les Fleches Rouges\", confirming the name \"The Red Arrows\". By the end of their first season, the Red Arrows had displayed 65 times in Britain, France, Italy, Holland, Germany and Belgium and were awarded the Britannia Trophy by the Royal Aero Club for their contribution to aviation.",
			"color": "dim|0.46707 gray|0.46707 dim|0.46707 grey|0.46707 gray|0.30925 grey|0.30925 indian|0.039219 red|0.039219 dark|0.022462 gray|0.022462 dark|0.022462 grey|0.022462 rosy|0.018166 brown|0.018166 black|0.016798 slate|0.012977 gray|0.012977 misty|0.011776 rose|0.011776 lavender|0.0066577 blush|0.0066577 gainsboro|0.0060125 white|0.0059117 smoke|0.0059117 light|0.0057272 slate|0.0057272 gray|0.0057272 sea|0.0054189 shell|0.0054189 linen|0.0054155  "
		}
	}
}
