{
	"add": {
		"doc": {
			"id": "65568e9f45595e34c6c18e667ef81b1342cb79e0a2225f65d92c5fe135db16ca",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/ESPN_identification_card.jpg/220px-ESPN_identification_card.jpg",
				"previous": "ABC dominated the American television landscape during the 1970s and early 1980s (by 1980, the three major networks represented 90% of all prime-time television viewership in the U.S.[127]). Several flagship series debuted on the network during this time including Dynasty, an opulent drama from Aaron Spelling that became a hit when it premiered as a midseason series in 1981, five months before Spelling other ABC hit Charlie's Angels ended its run. The network was also propelled during the early 1980s by the continued successes of Happy Days, Three's Company, Laverne & Shirley and Fantasy Island, and gained new hits in Too Close for Comfort, Soap spinoff Benson and Happy Days spinoff Mork & Mindy. In 1981, ABC (through its ABC Video Services division) launched the Alpha Repertory Television Service (ARTS), a cable channel operated as a joint venture with the Hearst Corporation offering cultural and arts programming, which aired as a nighttime service over the channel space of Nickelodeon.[128]",
				"after": "On August 9, 1982, ABC purchased a 10% stake in the Entertainment and Sports Programming Network (ESPN) for $20 million; in exchange of the interest, ESPN gained the U.S. television rights to the British Open, which ABC had not been able to broadcast in its entirety.[129] The purchase provided ABC the option of purchasing additional shares of up to 49% under certain conditions,[130] which included the option to purchase at least 10% of Getty Oil's shares in the channel prior to January 2, 1984.[130]",
			"color": "gainsboro|0.10645 light|0.096125 gray|0.096125 light|0.096125 grey|0.096125 white|0.072978 smoke|0.072978 snow|0.054055 mint|0.052267 cream|0.052267 white|0.050786 ghost|0.050277 white|0.050277 alice|0.050126 blue|0.050126 sea|0.049496 shell|0.049496 azure|0.047991 firebrick|0.047795 floral|0.045251 white|0.045251 lavender|0.034235 blush|0.034235 linen|0.028309 rosy|0.026298 brown|0.026298 ivory|0.023574 indian|0.023215 red|0.023215 lavender|0.017646 honeydew|0.017532 silver|0.017404 misty|0.016634 rose|0.016634 light|0.016585 cyan|0.016585 brown|0.01304 old|0.010206 lace|0.010206 light|0.0050807 coral|0.0050807 thistle|0.0045747  "
		}
	}
}
