{
	"add": {
		"doc": {
			"id": "655a8d959ad7e53727a56f63bb496d792bc934aed49ece1d5746b3515b88823a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/USAF_Hercules_MC-130E_Combat_Talon_I_at_RIAT_2010_arp.jpg/220px-USAF_Hercules_MC-130E_Combat_Talon_I_at_RIAT_2010_arp.jpg",
				"previous": "The Combat Talon was initially developed between December 1964 and January 1967 by Lockheed Air Services (LAS) at Ontario, California, as the result of a study by Big Safari, the USAF's program office responsible for modification and sustainment of special mission aircraft. From it, two highly classified test bed aircraft (originally serial no. 64-0506 and -0507, but with all numbers \"sanitized\" from the aircraft), were assigned to Project Thin Slice to develop a low level clandestine penetration aircraft suitable for Special Forces operations in Southeast Asia.[9] In 1964 Lockheed had modified six C-123B Providers for \"unconventional warfare\" under Project Duck Hook and then been tasked with adapting the C-130E when the Duck Hook aircraft proved inadequate for the newly launched MACV-SOG.[10] The modifications under Thin Slice and its August 1966 successor Heavy Chain were code named Rivet Yard, and the four C-130Es came to be known as \"Yards\".[9] Discrete modification tests were conducted by the 1198th Operational Evaluation and Training Squadron, out of Area II of Norton AFB at San Bernardino, California, 30 miles east of Ontario.[11][12]",
				"after": "As the Thin Slice aircraft were being developed, SOG requirements resulted in the procurement of 14 C-130Es in 1965 for similar modification. The first aircraft were production C-130Es without specialized equipment that were produced at Lockheed's facility in Marietta, Georgia. Production airplanes were modified with the installation of the Fulton STARS (then ARS) system, at the rate of three aircraft per month.[10] While awaiting installation of the ARS equipment, the C-130s were ferried to Greenville, South Carolina, for painting by Ling-Temco-Vought Electrosystems with a low-radar reflective paint that added 370 pounds to their weight. The velvet black and green scheme resulted in the aircraft being nicknamed \"Blackbirds\".[13] As installation was completed, the Blackbirds were returned to Ontario for installation of the electronics package, code-named Rivet Clamp. The aircraft modified became known as \"Clamps\" (two of the original 14, 64-0564 and -0565, were diverted to Heavy Chain in August 1966).[10] The aircraft collectively were assigned the designation Combat Talon in 1967.[14]",
			"color": "tan|0.28418 black|0.13911 light|0.1292 slate|0.1292 gray|0.1292 dark|0.12264 gray|0.12264 dark|0.12264 grey|0.12264 slate|0.12125 gray|0.12125 dim|0.044429 gray|0.044429 dim|0.044429 grey|0.044429 burly|0.03944 wood|0.03944 rosy|0.025573 brown|0.025573 gray|0.024936 grey|0.024936 dark|0.016294 khaki|0.016294 silver|0.016211 dark|0.0096875 slate|0.0096875 gray|0.0096875  "
		}
	}
}
