{
	"add": {
		"doc": {
			"id": "65778f6a562a8902689f9e1d8e5ac79ec752453b29605f17ae4a17d008468844",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Nickles_Arcade_Ann_Arbor.jpg/220px-Nickles_Arcade_Ann_Arbor.jpg",
				"previous": "The University of Michigan shapes Ann Arbor's economy significantly. It employs about 30,000 workers, including about 12,000 in the medical center.[55] Other employers are drawn to the area by the university's research and development money, and by its graduates. High tech, health services and biotechnology are other major components of the city's economy; numerous medical offices, laboratories, and associated companies are located in the city. Automobile manufacturers, such as General Motors and Visteon, also employ residents.[55]",
				"after": "High tech companies have located in the area since the 1930s, when International Radio Corporation introduced the first mass-produced AC/DC radio (the Kadette, in 1931) as well as the first pocket radio (the Kadette Jr., in 1933).[56] The Argus camera company, originally a subsidiary of International Radio, manufactured cameras in Ann Arbor from 1936 to the 1960s. Current firms include Arbor Networks (provider of Internet traffic engineering and security systems), Arbortext (provider of XML-based publishing software), JSTOR (the digital scholarly journal archive), MediaSpan (provider of software and online services for the media industries), Truven Health Analytics, and ProQuest, which includes UMI.[57] Ann Arbor Terminals manufactured a video-display terminal called the Ann Arbor Ambassador during the 1980s.[58] Barracuda Networks, which provides networking, security, and storage products based on network appliances and cloud services, opened an engineering office in Ann Arbor in 2008 on Depot St.[59] and recently announced it will move downtown to occupy the building previously used as the Borders headquarters.[60]",
			"color": "black|0.44784 dim|0.07275 gray|0.07275 dim|0.07275 grey|0.07275 gray|0.065483 grey|0.065483 dark|0.054939 slate|0.054939 gray|0.054939 dark|0.040345 olive|0.040345 green|0.040345 dark|0.027862 gray|0.027862 dark|0.027862 grey|0.027862 silver|0.021675 slate|0.018866 gray|0.018866 light|0.017368 slate|0.017368 gray|0.017368 light|0.015758 gray|0.015758 light|0.015758 grey|0.015758 gainsboro|0.012122 cadet|0.011398 blue|0.011398  "
		}
	}
}
