{
	"add": {
		"doc": {
			"id": "657c75ff655a219221d615f61d1e131d419f12e66099667334a60662776b9510",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/0/02/Drawing_for_Whaam%21.jpg/400px-Drawing_for_Whaam%21.jpg",
				"previous": "For José Pierre, Whaam! represents Lichtenstein's 1963 expansion \"into the 'epic' vein\".[69] Keith Roberts, in a 1968 Burlington Magazine article, described the explosion as combining \"art nouveau elegance with a nervous energy reminiscent of Abstract Expressionism\".[70] Wendy Steiner believes the work is Lichtenstein's most successful and harmonious comic-based composition. She sees the narrative and graphic elements as complementary: the action and spatial alignment lead the viewer's eye from left to right so as to emphasize the relationship between the action and its explosive consequence. The ellipses of the text balloon present a progression which culminates with a \"WHAAM!\". The \"coincidence of pictorial and verbal order\" are clear for the Western viewer with the explanatory text beginning in the upper left and action vector moving from the left foreground to the right background, culminating in a graphical explosion in tandem with a narrative exclamation.[71] Steiner says the striking incongruity of the two panels—the left panel appearing to be \"truncated\", while the right depicts a centralized explosion—enhances the work's narrative power.[71]",
				"after": "Lichtenstein's technique has been characterized by Ernst A. Busche as \"the enlargement and unification of his source material ... on the basis of strict artistic principles\".[62] Extracted from a larger narrative, the resulting stylized image became in some cases a \"virtual abstraction\". By recreating their minimalistic graphic techniques, Lichtenstein reinforced the artificial nature of comic strips and advertisements. Lichtenstein's magnification of his source material made his impersonally drawn motifs seem all the more empty. Busche also says that although a critique of modern industrial America may be read into these images, Lichtenstein \"would appear to accept the environment as revealed by his reference material as part of American capitalist industrial culture\".[62]",
			"color": " "
		}
	}
}
