{
	"add": {
		"doc": {
			"id": "65833ef21df4a1abe80cf967d29e394ba9d2ab6548903269d8add2c2876ffcbb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Flickr_-_dalbera_-_Sudheshna_Bhattacharya_%28mus%C3%A9e_Guimet%2C_Paris%29_%281%29.jpg/220px-Flickr_-_dalbera_-_Sudheshna_Bhattacharya_%28mus%C3%A9e_Guimet%2C_Paris%29_%281%29.jpg",
			"previous": [],
				"after": "Indian music ranges over various traditions and regional styles. Classical music encompasses two genres and their various folk offshoots: the northern Hindustani and southern Carnatic schools.[282] Regionalised popular forms include filmi and folk music; the syncretic tradition of the bauls is a well-known form of the latter. Indian dance also features diverse folk and classical forms. Among the better-known folk dances are the bhangra of Punjab, the bihu of Assam, the chhau of Odisha, West Bengal and Jharkhand, garba and dandiya of Gujarat, ghoomar of Rajasthan, and the lavani of Maharashtra. Eight dance forms, many with narrative forms and mythological elements, have been accorded classical dance status by India's National Academy of Music, Dance, and Drama. These are: bharatanatyam of the state of Tamil Nadu, kathak of Uttar Pradesh, kathakali and mohiniyattam of Kerala, kuchipudi of Andhra Pradesh, manipuri of Manipur, odissi of Odisha, and the sattriya of Assam.[283] Theatre in India melds music, dance, and improvised or written dialogue.[284] Often based on Hindu mythology, but also borrowing from medieval romances or social and political events, Indian theatre includes the bhavai of Gujarat, the jatra of West Bengal, the nautanki and ramlila of North India, tamasha of Maharashtra, burrakatha of Andhra Pradesh, terukkuttu of Tamil Nadu, and the yakshagana of Karnataka.[285]",
			"color": "firebrick|0.15164 black|0.10373 maroon|0.10319 dark|0.079065 red|0.079065 sienna|0.074861 brown|0.071156 saddle|0.058501 brown|0.058501 peru|0.049122 chocolate|0.046424 sandy|0.041927 brown|0.041927 pale|0.032675 golden|0.032675 rod|0.032675 coral|0.031392 burly|0.024344 wood|0.024344 tomato|0.023169 navajo|0.016574 white|0.016574 moccasin|0.01151 wheat|0.0094829 tan|0.0082284  "
		}
	}
}
