{
	"add": {
		"doc": {
			"id": "6597029b64ed66b49e824843fe2d7c7dcc5ec6a6737de73e2397ffd3f70005ab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Plateosaurus_quenstedti.jpg/220px-Plateosaurus_quenstedti.jpg",
			"previous": [],
				"after": "All named species of Plateosaurus except the type species and P. gracilis have turned out to be junior synonyms of the type species or invalid names.[3][16] Von Huene[26] practically erected a new species and sometimes a new genus for each relatively complete find from Trossingen (three species of Pachysaurus and seven of Plateosaurus) and Halberstadt (one species of Gresslyosaurus and eight of Plateosaurus).[12] Later, he merged several of these species, but remained convinced that more than one genus and more than one species of Plateosaurus was present in both localities. Jaekel also believed that the Halberstadt material included several plateosaurid dinosaurs, as well as non-plateosaurid prosauropods.[18] Systematic research by Galton drastically reduced the number of genera and species. Galton synonymised all cranial material,[8][47][48] and described differences between the syntypes of P. engelhardti and the Trossingen material, which he referred to P. longiceps.[49] Galton recognized P. trossingensis, P. fraasianus and P. integer to be identical to P. longiceps.[29] Markus Moser, however, showed that P. longiceps is itself a junior synonym of P. engelhardti.[3] Furthermore, a variety of species in other genera were created for material belonging to P. engelhardti, including Dimodosaurus poligniensis, Gresslyosaurus robustus, Gresslyosaurus torgeri, Pachysaurus ajax, Pachysaurus giganteus, Pachysaurus magnus and Pachysaurus wetzelianus.[W] The skull of AMNH FARB 6810, the best-preserved skull of Plateosaurus that has been taken apart during preparation and is thus available as separate bones, was described anew in 2011.[45] The authors of that publication, palaeontologists Albert Prieto-Márquez and Mark A. Norell, refer the skull to P. erlenbergensis, a species erected in 1905 by Friedrich von Huene. If the P. erlenbergensis holotype is diagnostic (i.e., has enough characters to be distinct from other material), it is the correct name for the material assigned to P. longiceps Jaekel, 1913.[45] However, according to the last detailed study of the holotype material of P. engelhardti by Markus Moser, P. erlenbergensis is a junior synonym of P. engelhardti.[X]",
			"color": "gray|0.44341 grey|0.44341 dark|0.23532 gray|0.23532 dark|0.23532 grey|0.23532 dim|0.18035 gray|0.18035 dim|0.18035 grey|0.18035 black|0.097728 silver|0.018592 slate|0.013491 gray|0.013491 light|0.010808 slate|0.010808 gray|0.010808  "
		}
	}
}
