{
	"add": {
		"doc": {
			"id": "659f01c9915e80ca2945db9254457d8f954475ad67ad924367c9fef910a983fc",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/1/12/Oh-father-pic_022.jpg/220px-Oh-father-pic_022.jpg",
			"previous": [],
				"after": "The music video was filmed during the last week of October 1989 at Culver Studios in Culver City, California, and was directed by David Fincher, who worked with Madonna in her video for \"Express Yourself\".[16] Described by Carol Clerk, author of Madonnastyle, as \"harrowingly autobiographical\", the video was shot entirely in black-and-white and recreates the death scene of a young woman, exploring the tempestuous relationship that ensues between the husband and the daughter she has left behind.[47] It begins with a young girl playing in the backyard as snow falls on the ground. The scene shifts to that of a bedside, where a young woman who has died, lies. Her husband covers her with a white sheet as a priest prays. Madonna, wearing a long, black coat, sings the song underneath a snow-covered, dead tree, as the young girl plays with her dead mother's jewelry. The husband comes and shouts at the girl, tearing away the woman's pearl necklace which drop at the little girl's feet. The adult Madonna is shown lying beside another man singing the song as the little girl visits her mother's grave. The man gets up and slaps Madonna in the face, as the little girl cries in front of the grave. She is taken away from the graveyard by her father, as interspersed scenes show the girl being kissed by her mother, her trying to reach the knob of a door, and Madonna powdering the bruise mark on her face. As the singer walks through a forest, the father is shown resorting to drinking in grief. A funeral scene follows, showing the girl walking up to her mother's wake. When she sees her mother's lips sealed with thread, she runs away from the wake. Madonna walks through a house, where shadows show the girl being scolded and shouted at by the father. Ultimately she walks to the graveyard and stands beside an old man, implying that she herself is the little girl portrayed. The video ends with the little girl dancing in front of her mother's grave as snow falls around her.",
			"color": "dark|0.13899 gray|0.13899 dark|0.13899 grey|0.13899 gray|0.11952 grey|0.11952 silver|0.09343 dim|0.07766 gray|0.07766 dim|0.07766 grey|0.07766 light|0.073879 gray|0.073879 light|0.073879 grey|0.073879 gainsboro|0.063115 white|0.048825 smoke|0.048825 sea|0.041581 shell|0.041581 snow|0.039492 ghost|0.039035 white|0.039035 floral|0.037985 white|0.037985 linen|0.037709 alice|0.037604 blue|0.037604 black|0.037493 white|0.033903 mint|0.030483 cream|0.030483 azure|0.024729 lavender|0.014459 blush|0.014459 ivory|0.0092582  "
		}
	}
}
