{
	"add": {
		"doc": {
			"id": "65a6d2e3f3122e69f56effc869f189be7e16e9a8fb99b129f95c10e80896ca8e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Penguinu.jpg/220px-Penguinu.jpg",
			"previous": [],
				"after": "Pursuit diving exerts greater pressures (both evolutionary and physiological) on seabirds, but the reward is a greater area in which to feed than is available to surface feeders. Propulsion underwater can be provided by wings (as used by penguins, auks, diving petrels and some other species of petrel) or feet (as used by cormorants, grebes, loons and several types of fish-eating ducks). Wing-propelled divers are generally faster than foot-propelled divers.[2] In both cases, the use of wings or feet for diving has limited their utility in other situations: loons and grebes walk with extreme difficulty (if at all), penguins cannot fly, and auks have sacrificed flight efficiency in favour of underwater diving. For example, the razorbill (an Atlantic auk) requires 64% more energy to fly than a petrel of equivalent size.[15] Many shearwaters are intermediate between the two, having longer wings than typical wing-propelled divers but heavier wing loadings than the other surface-feeding procellariids, leaving them capable of diving to considerable depths while still being efficient long-distance travellers. The most impressive diving exhibited by shearwaters is found in the short-tailed shearwater, which has been recorded diving below 70 m.[16] Some albatross species are also capable of some limited diving, with light-mantled sooty albatrosses holding the record at 12 m.[17] Of all the wing-propelled pursuit divers, the most efficient in the air are the albatrosses, and it is no coincidence that they are the poorest divers. This is the dominant guild in polar and subpolar environments, as it is energetically inefficient in warmer waters. With their poor flying ability, many wing-propelled pursuit divers are more limited in their foraging range than other guilds, especially during the breeding season when hungry chicks need regular feeding.",
			"color": "steel|0.1806 blue|0.1806 light|0.1341 steel|0.1341 blue|0.1341 black|0.11721 light|0.079223 slate|0.079223 gray|0.079223 slate|0.055198 gray|0.055198 dark|0.041209 slate|0.041209 gray|0.041209 light|0.025291 gray|0.025291 light|0.025291 grey|0.025291 gainsboro|0.025077 white|0.02369 smoke|0.02369 alice|0.022747 blue|0.022747 azure|0.021908 mint|0.021395 cream|0.021395 silver|0.021181 dark|0.019895 gray|0.019895 dark|0.019895 grey|0.019895 light|0.019859 blue|0.019859 white|0.018496 lavender|0.018427 ghost|0.017995 white|0.017995 snow|0.017844 floral|0.015053 white|0.015053 sea|0.014209 shell|0.014209 dim|0.013673 gray|0.013673 dim|0.013673 grey|0.013673 light|0.0096836 cyan|0.0096836 honeydew|0.0089439 gray|0.0087945 grey|0.0087945 ivory|0.0081907 powder|0.0080988 blue|0.0080988  "
		}
	}
}
