{
	"add": {
		"doc": {
			"id": "65ab3301fbe1ffd047f7809f5844973d08f0c4e928f12bc5c35df2eadcde2056",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/ACS_Learning_Spaces.jpg/220px-ACS_Learning_Spaces.jpg",
				"previous": "The building surrounds a courtyard with a large reflecting pool. The classrooms are oriented outward, to provide views of the surrounding forest. There are no interior passages in this part of the building; each class area has an exit to the outside, and students pass between rooms via the covered cloister, even in inclement weather. The design is meant to reinforce the \"home and school\" atmosphere that dates back to the Cottage School, with child-sized classrooms, ten working fireplaces, draperies, and other home-like details.[67]",
				"after": "Decorative tiles designed by Henry Chapman Mercer—one of the leading figures of the Arts and Crafts Movement in the U.S.—are placed throughout the building.[69] These tiles (known as Moravian tiles after Mercer's Moravian Pottery and Tile Works) feature deep colors and a handmade appearance that complement the simple brick buildings.[70] The tiles on the fireplaces and entry floors boast patterns in literary and educational themes, such as The Canterbury Tales in the old library. A large, tripartite tile mural on the north wall of the courtyard, also by Mercer, depicts the eastern and western hemispheres united by a ship on an allegorical journey of education.[71]",
			"color": "dark|0.16462 gray|0.16462 dark|0.16462 grey|0.16462 black|0.11454 silver|0.11312 golden|0.11198 rod|0.11198 gray|0.078117 grey|0.078117 light|0.068809 gray|0.068809 light|0.068809 grey|0.068809 dim|0.060101 gray|0.060101 dim|0.060101 grey|0.060101 dark|0.043117 golden|0.043117 rod|0.043117 gainsboro|0.041098 sea|0.03739 green|0.03739 antique|0.011071 white|0.011071 linen|0.010078 chocolate|0.009365 misty|0.0075705 rose|0.0075705 slate|0.007427 gray|0.007427 old|0.0073162 lace|0.0073162 sea|0.0065114 shell|0.0065114 rosy|0.005988 brown|0.005988 floral|0.0059275 white|0.0059275  "
		}
	}
}
