{
	"add": {
		"doc": {
			"id": "65b7185daa6950dc541a3b3d3b7b05d02937091be4ab4d8a17a541c634be531f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/EdVenture.jpg/220px-EdVenture.jpg",
				"previous": "Columbia's daily newspapers include The State and Cola Daily (coladaily.com), and its alternative newspapers include The Free Times, The Columbia Star, Columbia City Paper, Carolina Panorama Newspaper (www.carolinapanorama.net), and the SC Black News. Columbia Metropolitan Magazine is a bi-monthly publication about news and events in the metropolitan area. Greater Columbia Business Monthly highlights economic development, business, education, and the arts. Q-Notes, a bi-weekly newspaper serving the LGBT community and published in Charlotte, is distributed to locations in Columbia and via home delivery. Columbia is home to the headquarters and production facilities of South Carolina Educational Television and ETV Radio, the state's public television and public radio networks. Columbia is the 3rd largest TV market in South Carolina as ranked by number of households in the viewing area. The local radio stations are:",
			"after": [
				"Movies filmed in the Columbia area include The Program, Renaissance Man, Chasers, Death Sentence, A Guy Named Joe, and Accidental Love/Nailed.",
				"The region's most popular park, Finlay Park has hosted just about everything from festivals and political rallies to road races and Easter Sunrise services. This 18-acre (73,000 m2) park has had two lives; first dedicated in 1859 as Sidney Park, named in honor of Algernon Sidney Johnson, a Columbia City Councilman, the park experienced an illustrious but short tenure. The park fell into disrepair after the Civil War and served as a site for commercial ventures until the late 20th century. In 1990, the park was reopened. It serves as the site for such events as Kids Day, The Summer Concert Series, plus many more activities. In 1992, the park was renamed Finlay Park, in honor of Kirkman Finlay, a past mayor of Columbia who had a vision to reenergize the historic Congaree Vista district, between Main Street and the river, and recreate the site that was formerly known as Sidney Park."
			],
			"color": "dim|0.20101 gray|0.20101 dim|0.20101 grey|0.20101 gray|0.12945 grey|0.12945 dark|0.11895 gray|0.11895 dark|0.11895 grey|0.11895 black|0.093602 slate|0.074546 gray|0.074546 dark|0.07348 slate|0.07348 gray|0.07348 dark|0.065243 olive|0.065243 green|0.065243 olive|0.048499 drab|0.048499 light|0.026444 slate|0.026444 gray|0.026444 olive|0.017322 cadet|0.014842 blue|0.014842 silver|0.013228 tan|0.013208 dark|0.010278 salmon|0.010278  "
		}
	}
}
