{
	"add": {
		"doc": {
			"id": "65d5e0d7dddcce882cf0aaa7ba5a80beaa31e42e81983e4c9715cf75e4ee21e1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Chetniksinbelgrade1920.jpg/220px-Chetniksinbelgrade1920.jpg",
				"previous": "Following the end of World War I and the formation of the Kingdom of Serbs, Croats and Slovenes, pro-Bulgarian sentiment was rife in Macedonia, which was referred to as \"Southern Serbia\" by the Belgrade government. Extensive measures were undertaken to \"serbianise\" Macedonia, including closing Bulgarian Orthodox Church schools, revising history textbooks, dismissing \"unreliable\" teachers, banning the use of the Bulgarian language,[31] and imposing lengthy jail terms for those convicted of anti-state activities. Hundreds of Bulgarian activists were murdered and thousands arrested in the period immediately following the war, and around 50,000 troops were stationed in Macedonia. Bands of Serbian Chetniks, including one led by Babunski, were organised to terrorise the population, kill pro-Bulgarian resistance leaders and recruit the local population into forced labour for the army. Resistance by IMRO was met with further terror, which included the formation in 1922 of the Association against Bulgarian Bandits led by Pećanac and Ilija Trifunović-Lune, based out of Štip in eastern Macedonia. This organisation quickly garnered a reputation for indiscriminate terrorisation of the Macedonian populace. Pećanac and his Chetniks were also active in fighting those resisting the Serb and Montenegrin \"colonisation\" of Kosovo.[32]",
			"after": [],
			"color": "antique|0.1354 white|0.1354 blanched|0.11706 almond|0.11706 papaya|0.11478 whip|0.11478 bisque|0.094366 old|0.082151 lace|0.082151 linen|0.081065 tan|0.063044 corn|0.04968 silk|0.04968 misty|0.04867 rose|0.04867 peach|0.048449 puff|0.048449 sea|0.04779 shell|0.04779 beige|0.043773 floral|0.033225 white|0.033225 wheat|0.024694 ivory|0.0062341 light|0.0043022 yellow|0.0043022  "
		}
	}
}
