{
	"add": {
		"doc": {
			"id": "65d96db01980239bc6a2aae163cf52fdb2ce06a8fdc0ce9fcdf60426d6307c7d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Harghouse9.jpg/220px-Harghouse9.jpg",
				"previous": "The moral authority of Barre's government gradually eroded, as many Somalis had become disillusioned with life under military rule. By the mid-1980s, resistance movements supported by Ethiopia's communist Derg administration had sprung up across the country. Barre responded by ordering punitive measures against those he perceived as locally supporting the guerillas, especially in the northern regions. The clampdown included bombing of cities, with the northwestern administrative center of Hargeisa, a Somali National Movement (SNM) stronghold, among the targeted areas in 1988.[13][37] The bombardment was led by General Mohammed Said Hersi Morgan, Barre's son-in-law.[38]",
				"after": "Although the SNM at its inception had a unionist constitution, it eventually began to pursue independence, looking to secede from the rest of Somalia.[39] Under the leadership of Abdirahman Ahmed Ali Tuur, the local administration declared the northwestern Somali territories independent at a conference held in Burao between 27 April 1991 and 15 May 1991.[40] Tuur then became the newly established Somaliland polity's first President, but subsequently renounced the separatist platform in 1994 and began instead to publicly seek and advocate reconciliation with the rest of Somalia under a power-sharing federal system of governance.[39] Muhammad Haji Ibrahim Egal was appointed as Tuur's successor in 1993 by the Grand Conference of National Reconciliation in Borama, which met for four months, leading to a gradual improvement in security, as well as a consolidation of the new territory.[41] Egal was reappointed in 1997, and remained in power until his death on 3 May 2002. The vice president, Dahir Riyale Kahin, who was during the 1980s the highest-ranking National Security Service (NSS) officer in Berbera in Siad Barre's government, was sworn in as president shortly afterwards.[42] In 2003, Kahin became the first elected president of Somaliland.",
			"color": "tan|0.7125 dim|0.030147 gray|0.030147 dim|0.030147 grey|0.030147 blanched|0.02407 almond|0.02407 antique|0.021117 white|0.021117 beige|0.020151 papaya|0.020059 whip|0.020059 black|0.019683 wheat|0.018487 corn|0.017455 silk|0.017455 gray|0.017251 grey|0.017251 light|0.013999 golden|0.013999 rod|0.013999 yellow|0.013999  "
		}
	}
}
