{
	"add": {
		"doc": {
			"id": "65dd43ba4f6df177d80174147a635eeb54969a77d23474425619d975a411a459",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Atta.cephalotes.gamut.selection.jpg/220px-Atta.cephalotes.gamut.selection.jpg",
			"previous": [],
				"after": "In the colonies of a few ant species, there are physical castes—workers in distinct size-classes, called minor, median, and major workers. Often, the larger ants have disproportionately larger heads, and correspondingly stronger mandibles. Such individuals are sometimes called \"soldier\" ants because their stronger mandibles make them more effective in fighting, although they still are workers and their \"duties\" typically do not vary greatly from the minor or median workers. In a few species, the median workers are absent, creating a sharp divide between the minors and majors.[43] Weaver ants, for example, have a distinct bimodal size distribution.[44][45] Some other species show continuous variation in the size of workers. The smallest and largest workers in Pheidologeton diversus show nearly a 500-fold difference in their dry-weights.[46] Workers cannot mate; however, because of the haplodiploid sex-determination system in ants, workers of a number of species can lay unfertilised eggs that become fully fertile, haploid males. The role of workers may change with their age and in some species, such as honeypot ants, young workers are fed until their gasters are distended, and act as living food storage vessels. These food storage workers are called repletes.[47] For instance, these replete workers develop in the North American honeypot ant Myrmecocystus mexicanus. Rissing found that usually the largest workers in the colony develop into repletes, and if repletes are removed from the colony other workers become repletes, demonstrating the flexibility of this particular polymorphism.[48] This polymorphism in morphology and behaviour of workers initially was thought to be determined by environmental factors such as nutrition and hormones that led to different developmental paths; however, genetic differences between worker castes have been noted in Acromyrmex sp.[49] These polymorphisms are caused by relatively small genetic changes; differences in a single gene of Solenopsis invicta can decide whether the colony will have single or multiple queens.[50] The Australian jack jumper ant (Myrmecia pilosula) has only a single pair of chromosomes (with the males having just one chromosome as they are haploid), the lowest number known for any animal, making it an interesting subject for studies in the genetics and developmental biology of social insects.[51][52]",
			"color": "dark|0.087123 gray|0.087123 dark|0.087123 grey|0.087123 silver|0.059231 sea|0.058619 shell|0.058619 white|0.057122 smoke|0.057122 floral|0.056684 white|0.056684 snow|0.052723 mint|0.050614 cream|0.050614 white|0.049136 linen|0.048893 light|0.047506 gray|0.047506 light|0.047506 grey|0.047506 ivory|0.03937 gainsboro|0.03817 azure|0.033901 ghost|0.033165 white|0.033165 old|0.031585 lace|0.031585 gray|0.030136 grey|0.030136 alice|0.022949 blue|0.022949 pale|0.018356 golden|0.018356 rod|0.018356 black|0.018152 dim|0.01742 gray|0.01742 dim|0.01742 grey|0.01742 antique|0.014636 white|0.014636 lavender|0.012916 blush|0.012916 honeydew|0.0093882 beige|0.0086691 saddle|0.0083444 brown|0.0083444 papaya|0.0073532 whip|0.0073532 corn|0.0069335 silk|0.0069335 wheat|0.0068461 khaki|0.0066489 lemon|0.0064733 chiffon|0.0064733 moccasin|0.0064161 blanched|0.005871 almond|0.005871 navajo|0.0056834 white|0.0056834 light|0.0054829 golden|0.0054829 rod|0.0054829 yellow|0.0054829 light|0.0051465 yellow|0.0051465  "
		}
	}
}
