{
	"add": {
		"doc": {
			"id": "66235b463ef3549c23c0145e32a5d4dd54df665bd9e97f88ab2e0c07e719fd24",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Salusbury_Davenport.JPG/220px-Salusbury_Davenport.JPG",
				"previous": "Over the next decade the house was likely to have been let, as Maria Davenport preferred to live elsewhere. Her eldest son, William Davenport Davenport married firstly to Camilla Maria Gatt, then secondly to Diana Handley,[24] whom he lived with at Bramall for four years before the estate was passed to him. Maria moved to London where she lived with her youngest son, Charles, and died in 1866.[31] During William's tenure Bramall was regularly visited by members of the public, and the Chapel continued to be used for regular services of worship.[32] However, following his death in 1869, the property was rented out to Wakefield Christy of Christys & Co Hatting, therefore ending direct involvement from the Davenport family.[33] This occurred because William's son, John, was too young to inherit the estate.[34] John's whereabouts during Christy's seven-year tenure is unknown, though he was shown as a visitor at Bramall in 1871, and in 1874 became the first chairman of the Bramhall School Board. In 1876, shortly before he returned to the house, he was listed as living on Ack Lane in Bramhall.[35]",
				"after": "John Davenport returned to Bramall in 1876 at the age of 25, but on 24 January 1877 it was announced that the estate was to be sold. The furniture was auctioned,[36] while the house itself and rest of the Bramall estate (totalling 1,918 acres (7.8 km2)) was sold to the Freeholders Company Limited, a Manchester property development firm, on 3 August 1877 for £200,000 (about £16.4 million in 2015).[37] According to speculation, the sale was motivated by financial issues and a personal distaste of the building.[38] It remained empty until 1882 when it was purchased by Thomas Nevill, a local industrialist whose wealth came from calico printing, for his son, Charles.[39] While living in the house, Charles Nevill carried out substantial restoration and remodelling, making the interior more comfortable while retaining most of the building's external features.[40] The landscape of the grounds was redesigned,[41] and a new stable was built along with a west and east lodge, housing the coachman and head gardener respectively.[42][43] Another building, known as Hall Cottage, was also built in the vicinity, and housed the Sidebottom family.[44]",
			"color": "gray|0.33732 grey|0.33732 dim|0.33611 gray|0.33611 dim|0.33611 grey|0.33611 dark|0.17555 gray|0.17555 dark|0.17555 grey|0.17555 silver|0.052941 light|0.029509 gray|0.029509 light|0.029509 grey|0.029509 gainsboro|0.020856 white|0.0071259 smoke|0.0071259 linen|0.0066913 sea|0.0052625 shell|0.0052625 floral|0.004519 white|0.004519 snow|0.0043358 mint|0.0043006 cream|0.0043006 white|0.0034368 azure|0.0032965  "
		}
	}
}
