{
	"add": {
		"doc": {
			"id": "66284d7f7b88fd7b2d4f33000baf5cafc7801bedb8012c7c6a432f5d96b7b8ed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Battleship_Mikasa.jpg/220px-Battleship_Mikasa.jpg",
				"previous": "In 1906, the commissioning of HMS Dreadnought brought about the obsolescence of all existing battleships. Dreadnought, by scrapping the secondary battery, was able to carry ten 12-inch (305 mm) guns rather than four. She could fire eight heavy guns broadside, as opposed to four from a pre-dreadnought; and six guns ahead, as opposed to two.[44] The move to an 'all-big-gun' design was a logical conclusion of the increasingly long engagement ranges and heavier secondary batteries of the last pre-dreadnoughts; Japan and the USA had designed ships with a similar armament before Dreadnought, but were unable to complete them before the British ship.[45] It was felt that because of the longer distances at which battles could be fought, only the largest guns were effective in battle, and by mounting more 12-inch guns Dreadnought was two to three times more effective in combat than an existing battleship.[46]",
				"after": "The armament of the new breed of ships was not their only crucial advantage. Dreadnought used steam turbines for propulsion, giving her a top speed of 21 knots, against the 18 knots typical of the pre-dreadnought battleships. Able both to outgun and outmaneuver their opponents, the dreadnought battleships decisively outclassed earlier battleship designs.[4]",
			"color": "dark|0.15493 gray|0.15493 dark|0.15493 grey|0.15493 gainsboro|0.13673 light|0.13468 gray|0.13468 light|0.13468 grey|0.13468 silver|0.13424 dim|0.073931 gray|0.073931 dim|0.073931 grey|0.073931 gray|0.073143 grey|0.073143 white|0.051843 smoke|0.051843 linen|0.041424 sea|0.030785 shell|0.030785 snow|0.025632 alice|0.024475 blue|0.024475 ghost|0.02348 white|0.02348 lavender|0.020801 blush|0.020801 floral|0.017796 white|0.017796 white|0.012547 mint|0.010081 cream|0.010081 old|0.007533 lace|0.007533 black|0.006277 misty|0.0049077 rose|0.0049077 azure|0.003133 slate|0.0031314 gray|0.0031314 dark|0.0031171 slate|0.0031171 gray|0.0031171  "
		}
	}
}
