{
	"add": {
		"doc": {
			"id": "6630370154d2b0319a81ba29f2d8fcc89f88d4f05c5f36959921d800e4608215",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Disruption_forming_Free_Kirk.jpg/350px-Disruption_forming_Free_Kirk.jpg",
				"previous": "This period saw a process of rehabilitation for Highland culture. In the 1820s, as part of the Romantic revival, tartan and the kilt were adopted by members of the social elite, not just in Scotland, but across Europe,[92][93] prompted by the popularity of Macpherson's Ossian cycle[94][95] and then Walter Scott's Waverley novels.[96] However, the Highlands remained very poor and traditional.[97] The desire to improve agriculture and profits led to the Highland Clearances, in which much of the population of the Highlands suffered forced displacement as lands were enclosed, principally so that they could be used for sheep farming. The clearances followed patterns of agricultural change throughout Britain, but were particularly notorious as a result of the late timing, the lack of legal protection for year-by-year tenants under Scots law, the abruptness of the change from the traditional clan system, and the brutality of many evictions.[98] One result was a continuous exodus from the land—to the cities, or further afield to England, Canada, America or Australia.[99] The population of Scotland grew steadily in the 19th century, from 1,608,000 in the census of 1801 to 2,889,000 in 1851 and 4,472,000 in 1901.[100] Even with the development of industry there were not enough good jobs. As a result, during the period 1841–1931, about 2 million Scots migrated to North America and Australia, and another 750,000 Scots relocated to England.[101]",
				"after": "After prolonged years of struggle in the Kirk, in 1834 the Evangelicals gained control of the General Assembly and passed the Veto Act, which allowed congregations to reject unwanted \"intrusive\" presentations to livings by patrons. The following \"Ten Years' Conflict\" of legal and political wrangling ended in defeat for the non-intrusionists in the civil courts. The result was a schism from the church by some of the non-intrusionists led by Dr Thomas Chalmers, known as the Great Disruption of 1843. Roughly a third of the clergy, mainly from the North and Highlands, formed the separate Free Church of Scotland.[102] In the late 19th century growing divisions between fundamentalist Calvinists and theological liberals resulted in a further split in the Free Church as the rigid Calvinists broke away to form the Free Presbyterian Church in 1893.[103] Catholic Emancipation in 1829 and the influx of large numbers of Irish immigrants, particularly after the famine years of the late 1840s, mainly to the growing lowland centres like Glasgow, led to a transformation in the fortunes of Catholicism. In 1878, despite opposition, a Roman Catholic ecclesiastical hierarchy was restored to the country, and Catholicism became a significant denomination within Scotland.[103]",
			"color": " "
		}
	}
}
