{
	"add": {
		"doc": {
			"id": "6635ae19c37addd1fc4dc8b8684ee64ce573c970a768dbecc8837419db98e5f4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/9/97/Darwin%27s_finches.jpeg",
				"previous": "The third mechanism of speciation is parapatric speciation. This is similar to peripatric speciation in that a small population enters a new habitat, but differs in that there is no physical separation between these two populations. Instead, speciation results from the evolution of mechanisms that reduce gene flow between the two populations.[220] Generally this occurs when there has been a drastic change in the environment within the parental species' habitat. One example is the grass Anthoxanthum odoratum, which can undergo parapatric speciation in response to localised metal pollution from mines.[234] Here, plants evolve that have resistance to high levels of metals in the soil. Selection against interbreeding with the metal-sensitive parental population produced a gradual change in the flowering time of the metal-resistant plants, which eventually produced complete reproductive isolation. Selection against hybrids between the two populations may cause reinforcement, which is the evolution of traits that promote mating within a species, as well as character displacement, which is when two species become more distinct in appearance.[235]",
				"after": "Finally, in sympatric speciation species diverge without geographic isolation or changes in habitat. This form is rare since even a small amount of gene flow may remove genetic differences between parts of a population.[236] Generally, sympatric speciation in animals requires the evolution of both genetic differences and non-random mating, to allow reproductive isolation to evolve.[237]",
			"color": "dim|0.35303 gray|0.35303 dim|0.35303 grey|0.35303 gray|0.26114 grey|0.26114 dark|0.16797 gray|0.16797 dark|0.16797 grey|0.16797 silver|0.074014 black|0.053333 light|0.035742 gray|0.035742 light|0.035742 grey|0.035742 gainsboro|0.023564 white|0.0055075 smoke|0.0055075  "
		}
	}
}
