{
	"add": {
		"doc": {
			"id": "66396ca0409f5ec9dbb9a2f214fdc0664534593d797eb7223e03fbc45f690e23",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/4/4d/Hilllary_Rosen_testifies_on_Napster.jpg/220px-Hilllary_Rosen_testifies_on_Napster.jpg",
				"previous": "Also with respect to copyright, the American film industry helped to change the social construct of intellectual property via its trade organization, the Motion Picture Association of America. In amicus briefs in important cases, in lobbying before Congress, and in its statements to the public, the MPAA has advocated strong protection of intellectual-property rights. In framing its presentations, the association has claimed that people are entitled to the property that is produced by their labor. Additionally Congress's awareness of the position of the United States as the world's largest producer of films has made it convenient to expand the conception of intellectual property.[90] These doctrinal reforms have further strengthened the industry, lending the MPAA even more power and authority.[91]",
				"after": "The growth of the Internet, and particularly distributed search engines like Kazaa and Gnutella, have represented a challenge for copyright policy. The Recording Industry Association of America, in particular, has been on the front lines of the fight against copyright infringement, which the industry calls \"piracy\". The industry has had victories against some services, including a highly publicized case against the file-sharing company Napster, and some people have been prosecuted for sharing files in violation of copyright. The electronic age has seen an increase in the attempt to use software-based digital rights management tools to restrict the copying and use of digitally based works. Laws such as the Digital Millennium Copyright Act have been enacted, that use criminal law to prevent any circumvention of software used to enforce digital rights management systems. Equivalent provisions, to prevent circumvention of copyright protection have existed in EU for some time, and are being expanded in, for example, Article 6 and 7 the Copyright Directive. Other examples are Article 7 of the Software Directive of 1991 (91/250/EEC), and the Conditional Access Directive of 1998 (98/84/EEC). This can hinder legal uses, affecting public domain works, limitations and exceptions to copyright, or uses allowed by the copyright holder. Some copyleft licenses, like GNU GPL 3, are designed to counter that.[92] Laws may permit circumvention under specific conditions like when it is necessary to achieve interoperability with the circumventor's program, or for accessibility reasons; however, distribution of circumvention tools or instructions may be illegal.",
			"color": "dim|0.14391 gray|0.14391 dim|0.14391 grey|0.14391 misty|0.1085 rose|0.1085 rosy|0.099268 brown|0.099268 gainsboro|0.079152 linen|0.075456 antique|0.074911 white|0.074911 light|0.070869 gray|0.070869 light|0.070869 grey|0.070869 gray|0.06065 grey|0.06065 sea|0.054485 shell|0.054485 silver|0.049293 old|0.042259 lace|0.042259 lavender|0.027622 blush|0.027622 dark|0.025644 gray|0.025644 dark|0.025644 grey|0.025644 floral|0.02312 white|0.02312 white|0.014374 smoke|0.014374 snow|0.011348 papaya|0.010569 whip|0.010569 pink|0.0078484 ivory|0.0048447  "
		}
	}
}
