{
	"add": {
		"doc": {
			"id": "66484efbdbbdc82f9b36633a2f42c04a8e273fa1291a70477d188c07e1034ac6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Atelopus_zeteki1.jpg/220px-Atelopus_zeteki1.jpg",
				"previous": "The Anura include all modern frogs and any fossil species that fit within the anuran definition. The characteristics of anuran adults include: 9 or fewer presacral vertebrae, the presence of a urostyle formed of fused vertebrae, no tail, a long and forward-sloping ilium, shorter fore limbs than hind limbs, radius and ulna fused, tibia and fibula fused, elongated ankle bones, absence of a prefrontal bone, presence of a hyoid plate, a lower jaw without teeth (with the exception of Gastrotheca guentheri) consisting of three pairs of bones (angulosplenial, dentary, and mentomeckelian, with the last pair being absent in Pipoidea),[8] an unsupported tongue, lymph spaces underneath the skin, and a muscle, the protractor lentis, attached to the lens of the eye.[9] The anuran larva or tadpole has a single central respiratory spiracle and mouthparts consisting of keratinous beaks and denticles.[9]",
				"after": "Frogs and toads are broadly classified into three suborders: Archaeobatrachia, which includes four families of primitive frogs; Mesobatrachia, which includes five families of more evolutionary intermediate frogs; and Neobatrachia, by far the largest group, which contains the remaining 24 families of modern frogs, including most common species found throughout the world. The Neobatrachia suborder is further divided into the two superfamilies Hyloidea and Ranoidea.[10] This classification is based on such morphological features as the number of vertebrae, the structure of the pectoral girdle, and the morphology of tadpoles. While this classification is largely accepted, relationships among families of frogs are still debated.[11]",
			"color": "olive|0.78549 drab|0.78549 golden|0.098787 rod|0.098787 dark|0.03345 golden|0.03345 rod|0.03345 black|0.027484 olive|0.021386  "
		}
	}
}
