{
	"add": {
		"doc": {
			"id": "664bc60094c57a50c5fdade980648e9a368a240e1f34f25b8161dd2347b2a6b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Kampfl%C3%A4ufer_wei%C3%9F_070608.jpg/170px-Kampfl%C3%A4ufer_wei%C3%9F_070608.jpg",
				"previous": "The behaviour and appearance for an individual male remain constant through its adult life, and are determined by a simple genetic polymorphism.[33] Territorial behaviour and appearance is recessive to satellite behaviour and appearance.[38] It was originally thought that the difference between the two types of males was due to a sex-linked genetic factor, but in fact the genetic locus relevant for the mating strategy is located on an autosome, or non-sex chromosome. That means that both sexes can carry the two different forms of the gene, not just males. The non-territorial female does not normally show evidence of its genetic type, but when females are given testosterone implants, they display the male territorial behaviour corresponding to their genotype.[39]",
				"after": "Although satellite males are on average slightly smaller and lighter than residents, the nutrition of the chicks does not, as previously thought, influence mating strategy; rather, the inherited mating strategy influences body size. Resident-type chicks will, if provided with the same amount of food, grow heavier than satellite-type chicks. Satellite males do not have to expend energy to defend a territory, and can spend more time foraging, so they do not need to be as bulky as the residents; indeed, since they fly more, there would be a physiological cost to additional weight.[33]",
			"color": "dark|0.20173 gray|0.20173 dark|0.20173 grey|0.20173 olive|0.12848 drab|0.12848 dark|0.095631 khaki|0.095631 dark|0.066941 olive|0.066941 green|0.066941 silver|0.063493 light|0.054101 gray|0.054101 light|0.054101 grey|0.054101 gainsboro|0.044094 white|0.026975 smoke|0.026975 sea|0.025763 shell|0.025763 linen|0.024905 gray|0.024815 grey|0.024815 floral|0.023942 white|0.023942 snow|0.021663 mint|0.020726 cream|0.020726 white|0.019502 ghost|0.01482 white|0.01482 old|0.013987 lace|0.013987 azure|0.013535 ivory|0.013266 alice|0.012809 blue|0.012809 beige|0.0095053  "
		}
	}
}
