{
	"add": {
		"doc": {
			"id": "665c82a60ea29f2933b692bad44da0530835391964ee2523d2f80719ed6cb584",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Schematic_tourist_map_of_Mangalore.jpg/220px-Schematic_tourist_map_of_Mangalore.jpg",
				"previous": "Mangalore is located at 12°52′N 74°53′E﻿ / ﻿12.87°N 74.88°E﻿ / 12.87; 74.88 in the Dakshina Kannada district of Karnataka.[50] It has an average elevation of 22 metres (72 ft) above mean sea level.[51] It is the administrative headquarters of the Dakshina Kannada district, the largest urban coastal center of Karnataka, and the second largest city in the state.[52] Mangalore is situated on the west coast of India, and is bounded by the Arabian Sea to its west and the Western Ghats to its east. Mangalore city, as a municipal entity, spans an area of 200 km2 (77.22 sq mi).[53] Mangalore experiences moderate to gusty winds during day time and gentle winds at night.[54] The topography of the city is plain up to 30 km (18.64 mi) inside the coast and changes to undulating hilly terrain sharply towards the east in Western Ghats.[55] There are four hilly regions with natural valleys within the city. The geology of the city is characterised by hard laterite in hilly tracts and sandy soil along the seashore.[52] The Geological Survey of India has identified Mangalore as a moderately earthquake-prone urban centre and categorised the city in the Seismic III Zone.[56]",
				"after": "Mangalore lies on the backwaters of the Netravati and Gurupura rivers.[57] These rivers effectively encircle the city, with the Gurupura flowing around the north and the Netravti flowing around the south of the city. The rivers form an estuary at the south-western region of the city and subsequently flow into the Arabian sea.[58] The city is often used as a staging point for traffic along the Malabar Coast. The coastline of the city is dotted with several beaches, such as Mukka, Panambur, Tannirbavi, Suratkal, and Someshwara. Coconut trees, palm trees, and Ashoka trees comprise the primary vegetation of the city.",
			"color": "white|0.066495 smoke|0.066495 snow|0.062698 white|0.061049 ghost|0.060862 white|0.060862 sea|0.059748 shell|0.059748 dark|0.059151 gray|0.059151 dark|0.059151 grey|0.059151 alice|0.058917 blue|0.058917 mint|0.058682 cream|0.058682 floral|0.056516 white|0.056516 azure|0.053819 lavender|0.052466 blush|0.052466 dim|0.032506 gray|0.032506 dim|0.032506 grey|0.032506 salmon|0.02766 silver|0.027628 gray|0.025712 grey|0.025712 light|0.025037 gray|0.025037 light|0.025037 grey|0.025037 tomato|0.02357 gainsboro|0.022643 dark|0.020672 salmon|0.020672 light|0.017903 coral|0.017903 linen|0.015203 ivory|0.014863 misty|0.011256 rose|0.011256 honeydew|0.0099499 lavender|0.0085067 light|0.0060783 cyan|0.0060783 old|0.0057235 lace|0.0057235 indian|0.0054418 red|0.0054418 light|0.0036708 salmon|0.0036708 thistle|0.0035742 pink|0.0035742 beige|0.0035104  "
		}
	}
}
