{
	"add": {
		"doc": {
			"id": "66603887193997b36abfff0ee024fef429c3bbb1f43435a383fd8e36c1ecdeef",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Fountain_of_Creation.jpg/220px-Fountain_of_Creation.jpg",
				"previous": "In 1907, Taft had won the first commission from the Ferguson Fund to create the Fountain of the Great Lakes at the Art Institute of Chicago.[15] Immediately afterwards, inspired by Daniel Burnham's \"Make no little plans\" quote,[13] he begin lobbying for a grand Midway beautification plan. In 1912, Art Institute Trustee Frank G. Logan formally presented Taft's plans to the fund's administrators at the Art Institute of Chicago.[15] Taft's proposed Midway Plaisance beautification plan included two possible commemoration themes. His first choice was to honor the memory of the World's Columbian Exposition that had been held in Jackson Park in 1893. His alternative was to commemorate the centennial of the 1814 Treaty of Ghent \"marking a century of perfect understanding between England and America\". Since other plans to commemorate the Exposition were under way, the second theme choice was adopted as the justification for a second Taft commission from the Ferguson Fund.[16] Contemporary newspaper accounts anticipated that Taft's entire Midway beautification plan would be approved easily.[17]",
				"after": "Taft's initial commission from the trust was limited to the creation of a full-sized plaster model of Fountain of Time, under a five-year $10,000 ($238,620) annual installment contract signed on February 6, 1913. This would enable the model to be evaluated in 1918.[16] Taft first created a 20-foot (6.1 m) quarter-scale model which received the Trustees' approval in May 1915.[18][19] He eventually produced his full-scale plaster model, 100 feet (30.5 m) in width peaking in the center, with an equestrian warrior and a robed model of Father Time with a height of 20 feet (6.1 m).[18] The installation of this model near its intended location was delayed by Taft's World War I service with the Y.M.C.A. in France as part of a corps of entertainers and lecturers,[20] but was completed in 1920.[19][21] However, Taft's wider vision of a Chicago school of sculpture, analogous to other philosophical Chicago schools such as the contemporaneous Chicago school of architecture style,[22] had lost momentum after the 1913 dedication of his Fountain of the Great Lakes.[23] The Beaux Arts style had become dated;[24][25] instead of funding Taft's large-scale Midway Plaisance beautification plan, and providing the originally planned granite, bronze or Georgia marble materials, the trust only allocated sufficient funds and support for a concrete sculpture.[19]",
			"color": " "
		}
	}
}
