{
	"add": {
		"doc": {
			"id": "667e99ed37043a196944374ccf2438a952a79af62adaf227e7f6c10bf38aa264",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Freedom_Monument_Company_of_Guard_of_Honor%2C_Riga%2C_Latvia_-_Diliff.jpg/220px-Freedom_Monument_Company_of_Guard_of_Honor%2C_Riga%2C_Latvia_-_Diliff.jpg",
				"previous": "The monument was restored twice during the Soviet era (1962 and 1980–1981). In keeping with tradition the restorations and maintenance after the renewal of Latvia's independence are financed partly by private donations. The monument underwent major restoration in 1998–2001.[1] During this restoration the statue of Liberty and its stars were cleaned, restored and gilded anew.[13] The monument was formally re-opened on July 24, 2001.[14] The staircase, column, base and inside of the monument were restored, and the stone materials were cleaned and re-sealed. The supports of the monument were fixed to prevent subsidence. Although the restorers said at the time that the monument would withstand a hundred years without another major restoration, it was discovered a few years later that the gilding of the stars was damaged, due to the restoration technique used. The stars were restored again during maintenance and restoration in 2006; however, this restoration was rushed and there is no warranty of its quality.[15]",
				"after": "The guard of honor was present from the unveiling of the monument until 1940, when it was removed shortly after the occupation of Latvia.[1] It was renewed on November 11, 1992.[1] The guards are soldiers of The Company of Guard of Honor of the Headquarters Battalion of the National Armed Forces (Latvian: Nacionālo Bruņoto spēku Štāba bataljona Goda sardzes rota).[16] The guard is not required to be on duty in bad weather conditions and if the temperatures are below −10 °C (14 °F) or above 25 °C (77 °F).[17][18] The guards work in two weekly shifts, with three or four pairs of guards taking over from each other hourly in a ceremony commanded by the chief of the guard.[17][18] Besides them there also are two watchmen in each shift, who look out for the safety of the guards of honor.[18]",
			"color": "dim|0.41076 gray|0.41076 dim|0.41076 grey|0.41076 dark|0.12231 gray|0.12231 dark|0.12231 grey|0.12231 silver|0.11489 rosy|0.10926 brown|0.10926 gray|0.076779 grey|0.076779 light|0.061874 gray|0.061874 light|0.061874 grey|0.061874 gainsboro|0.030956 black|0.030655 slate|0.027187 gray|0.027187 light|0.010622 slate|0.010622 gray|0.010622  "
		}
	}
}
