{
	"add": {
		"doc": {
			"id": "668f51f68fc4249bd5d45574ae3e97fa35dfe89faafa6f65c8343d4fda09e078",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Maharaja_Birchandra_with_Maharani_Manamohini.jpg/220px-Maharaja_Birchandra_with_Maharani_Manamohini.jpg",
				"previous": "Although there is no evidence of lower or middle Paleolithic settlements in Tripura, Upper Paleolithic tools made of fossil wood have been found in the Haora and Khowai valleys.[14] The Indian epic, the Mahabharata; ancient religious texts, the Puranas; and the Edicts of Ashoka – stone pillar inscriptions of the emperor Ashoka dating from the third century BCE – all mention Tripura.[12] An ancient name of Tripura is Kirat Desh (English: \"The land of Kirat\"), probably referring to the Kirata Kingdoms or the more generic term Kirata.[15]:155 However, it is unclear whether the extent of modern Tripura is coterminous with Kirat Desh.[16] The region was under the rule of the Twipra Kingdom for centuries, although when this dates from is not documented. The Rajmala, a chronicle of Tripuri kings which was first written in the 15th century,[17] provides a list of 179 kings, from antiquity up to Krishna Kishore Manikya (1830–1850),[18]:3[19][20] but the reliability of the Rajmala has been doubted.[21]",
				"after": "The boundaries of the kingdom changed over the centuries. At various times, the borders reached south to the jungles of the Sundarbans on the Bay of Bengal; east to Burma; and north to the boundary of the Kamarupa kingdom in Assam.[17] There were several Muslim invasions of the region from the 13th century onward,[17] which culminated in Mughal dominance of the plains of the kingdom in 1733,[17] although their rule never extended to the hill regions.[17] The Mughals had influence over the appointment of the Tripuri kings.",
			"color": "dark|0.35834 gray|0.35834 dark|0.35834 grey|0.35834 gray|0.21753 grey|0.21753 silver|0.15645 dim|0.15635 gray|0.15635 dim|0.15635 grey|0.15635 black|0.096941 light|0.012645 gray|0.012645 light|0.012645 grey|0.012645  "
		}
	}
}
