{
	"add": {
		"doc": {
			"id": "66a0a8a0afe771b2f48d4c3718f860eb8e935bce3a403f846394390da406e110",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/TWA_Experimental_prop_plane.jpg/220px-TWA_Experimental_prop_plane.jpg",
				"previous": "In 1931, the airline nearly went out of business after TWA Flight 599, a Fokker F.10, shed a wing and crashed on March 31 near Bazaar, Kansas, killing all eight on board the plane, including University of Notre Dame football coach Knute Rockne. Investigation revealed that the wing's wooden structure had deteriorated, leading it to fail. In the wake of the crash, the Fokker F.10 was temporarily grounded, and a more frequent and rigorous inspection and maintenance regime was put in place, making it more expensive to operate. The F.10's public image, and that of all wooden-structured aircraft, also suffered badly from the crash. TWA needed a replacement.",
				"after": "The dominant manufacturer of the day was Bill Boeing, but his contract with United Air Lines did not allow him to sell his 247 to competing lines. Frye and other members of TWA approached several other manufacturers, including Donald Douglas, with specifications for a larger plane. On September 20, 1932, the contract was signed with Douglas and the DC-1 was delivered to TWA in December 1933, the one and only DC-1. This was followed by the delivery of 32 Douglas DC-2 aircraft that started operations in May 1934. Most were phased out by 1937 as the DC-3 started service, but several DC-2 would be operational through the early years of WWII.[11] Throughout 1934 Tomlinson and Richter tested the DC-1, and Tomlinson's extensive testing in 1934 and 1935 led to higher-altitude \"over-weather flying\" and cabin pressurization.",
			"color": "dark|0.39107 gray|0.39107 dark|0.39107 grey|0.39107 silver|0.30863 light|0.1147 gray|0.1147 light|0.1147 grey|0.1147 gainsboro|0.076914 gray|0.010776 grey|0.010776 dim|0.0098075 gray|0.0098075 dim|0.0098075 grey|0.0098075 white|0.0069998 smoke|0.0069998 black|0.0058367 light|0.0046494 steel|0.0046494 blue|0.0046494 light|0.0045761 slate|0.0045761 gray|0.0045761 alice|0.0040269 blue|0.0040269 ghost|0.0034215 white|0.0034215 firebrick|0.0033262 lavender|0.0031876 blush|0.0031876 snow|0.0031248 slate|0.0030681 gray|0.0030681 powder|0.0030012 blue|0.0030012 rosy|0.0028674 brown|0.0028674 mint|0.0028534 cream|0.0028534 azure|0.0027597  "
		}
	}
}
