{
	"add": {
		"doc": {
			"id": "66a4ca198dbfb18856381dd8f351b8f1729a18a030a6984dcc1f0ea5ea7f4dfb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Yuma_arizona_map.jpg/180px-Yuma_arizona_map.jpg",
				"previous": "At the lower end of Grand Canyon, the Colorado widens into Lake Mead, the largest reservoir in the continental United States, formed by Hoover Dam on the border of Arizona and Nevada. Situated southeast of metropolitan Las Vegas, the dam is an integral component for management of the Colorado River, controlling floods and storing water for farms and cities in the lower Colorado River basin.[27] Below the dam the river passes under the Mike O'Callaghan–Pat Tillman Memorial Bridge – which at nearly 900 feet (270 m) above the water is the highest concrete arch bridge in the Western Hemisphere[28] – and then turns due south towards Mexico, defining the Arizona–Nevada and Arizona–California borders.",
				"after": "After leaving the confines of the Black Canyon, the river emerges from the Colorado Plateau into the Lower Colorado River Valley (LCRV), a desert region dependent on irrigation agriculture and tourism and also home to several major Indian reservations.[29] The river widens here to a broad, moderately deep waterway averaging 500 to 1,000 feet (150 to 300 m) wide and reaching up to 1⁄4 mile (400 m) across, with depths ranging from 8 to 60 feet (2 to 20 m).[30][31] Before channelization of the Colorado in the 20th century, the lower river was subject to frequent course changes caused by seasonal flow variations. Joseph C. Ives, who surveyed the lower river in 1861, wrote that \"the shifting of the channel, the banks, the islands, the bars is so continual and rapid that a detailed description, derived from the experiences of one trip, would be found incorrect, not only during the subsequent year, but perhaps in the course of a week, or even a day.\"[32]",
			"color": "light|0.1362 gray|0.1362 light|0.1362 grey|0.1362 gainsboro|0.11727 silver|0.089511 antique|0.076593 white|0.076593 linen|0.062178 old|0.04492 lace|0.04492 dark|0.044118 olive|0.044118 green|0.044118 dark|0.042363 gray|0.042363 dark|0.042363 grey|0.042363 beige|0.040318 papaya|0.034663 whip|0.034663 sea|0.027937 shell|0.027937 gray|0.025735 grey|0.025735 corn|0.024145 silk|0.024145 dim|0.02367 gray|0.02367 dim|0.02367 grey|0.02367 thistle|0.023458 floral|0.022272 white|0.022272 misty|0.020289 rose|0.020289 blanched|0.019676 almond|0.019676 ivory|0.015783 white|0.014144 smoke|0.014144 slate|0.012423 gray|0.012423 light|0.010949 yellow|0.010949 lavender|0.010108 blush|0.010108 light|0.0097977 slate|0.0097977 gray|0.0097977 light|0.0064803 golden|0.0064803 rod|0.0064803 yellow|0.0064803 snow|0.006198 lavender|0.0057664 black|0.0051508  "
		}
	}
}
