{
	"add": {
		"doc": {
			"id": "66aef364e58ffd1d7c943381250f21783363c5c4ebdb6e9f61bd0675742ac532",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Thophasaccataface.jpg/220px-Thophasaccataface.jpg",
				"previous": "In 1838, Félix Édouard Guérin-Méneville pointed out that the double drummer is native to Australia and not China.[6] John Obadiah Westwood designated it the type species of the genus in 1843,[7][8] and it is also the type species for the tribe Thophini.[9] The common name is derived from the male cicada's sac-like tymbal covers (\"drums\") on either side of its abdomen.[10]",
				"after": "The adult double drummer is the largest Australian species of cicada, the male and female averaging 4.75 cm (1.88 in) and 5.12 cm (2.02 in) long respectively. The thorax is 2 cm (0.8 in) in diameter,[11] its sides distended when compared with the thorax of other Australian cicadas.[12] The forewings are 5–6.6 cm (2.2–2.4 in) long. The largest collected specimen has a wingspan of 15.1 cm (5.9 in),[2] while the average is 13.3 cm (5.2 in).[13] The average mass is 4.0 g (0.14 oz).[13] The sexes have similar markings, but males have large dark red-brown sac-like structures on each side of their abdomens.[11][14] These cover the tymbals—specialised structures composed of vertical ribs and a tymbal plate, which is buckled to produce the cicada's song.[15] The head is much broader than that of other cicadas, and is broader than the pronotum behind it. The head, antennae and postclypeus are black,[14] with a narrow broken pale brown transverse band across the vertex just behind the ocelli.[11] The eyes are black in young adult cicadas upon emerging, but turn brown with black pseudopupils at the posterior edge of the eye.[14] The ocelli are deep red.[11] The proboscis is 1.26 cm (0.50 in) in length—very long compared with other Australian cicada species.[13] The thorax is brown, becoming paler in older individuals.[14] The pronotum is rusty brown with black anterior borders, while the mesonotum is a little paler with prominent black markings,[11] with paired cone-shaped spots with bases towards the front on either side of a median stripe;[10] lateral to these spots are a pair of markings resembling a \"7\" on the right hand side of the mesonotum and its reverse on the left.[11] The abdomen is black between the tymbal covers and red-brown and black more posteriorly. The underparts of the double drummer are red-brown and black,[14] and covered in fine silvery velvety hairs.[11] The female's ovipositor is very long, measuring 1.76 cm (0.69 in).[13] The wings are vitreous (transparent) with light brown veins.[11] They have an array of cuticular nanostructures—conical protuberances with a spacing and height of about 200 nm, tipped with a spherical cap with a radius of curvature of around 25–45 nm—on the transparent panes of their wings.[16] These act as anti-wetting and anti-reflective surfaces.[16] The legs are dark brown and have grey velvety hairs.[11]",
			"color": "black|0.31011 tan|0.10779 dim|0.053504 gray|0.053504 dim|0.053504 grey|0.053504 burly|0.048897 wood|0.048897 rosy|0.038995 brown|0.038995 gray|0.034853 grey|0.034853 dark|0.031638 gray|0.031638 dark|0.031638 grey|0.031638 dark|0.023754 olive|0.023754 green|0.023754 wheat|0.023386 silver|0.023193 pale|0.021633 golden|0.021633 rod|0.021633 olive|0.017987 drab|0.017987 dark|0.014554 sea|0.014554 green|0.014554 thistle|0.014451 light|0.014277 gray|0.014277 light|0.014277 grey|0.014277 dark|0.012426 slate|0.012426 gray|0.012426 antique|0.012028 white|0.012028 bisque|0.011993 peach|0.011883 puff|0.011883  "
		}
	}
}
