{
	"add": {
		"doc": {
			"id": "66b7c116a6aea868f02f4bfb43d6e0977705e0b656848a52ed39cd17377628f6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/MadonnaDrownedWorld8_cropped.jpg/170px-MadonnaDrownedWorld8_cropped.jpg",
			"previous": [],
				"after": "Madonna's seventh studio album, Ray of Light, (1998) reflected a change in her perception and image.[116][117] She collaborated with electronica producer William Orbit and wanted to create a sound that could blend dance music with pop and British rock.[118] American music critic Ann Powers explained that what Madonna searched for with Orbit \"was a kind of a lushness that she wanted for this record. Techno and rave was happening in the 90's and had a lot of different forms. There was very experimental, more hard stuff like Aphex Twin. There was party stuff like Fatboy Slim. That's not what Madonna wanted for this. She wanted something more like a singer-songwriter, really. And William Orbit provided her with that.\"[118] The album garnered critical acclaim and Slant Magazine declared it as \"one of the great pop masterpieces of the '90s\".[119] Ray of Light was honored with four Grammy Awards, and Rolling Stone listed it among \"The 500 Greatest Albums of All Time\".[120][121] Commercially, the album peaked at number one in numerous countries and sold more than 16 million copies worldwide.[122] The album's first single, \"Frozen\", became Madonna's first single to debut at number one in the UK, while in the U.S. it became her sixth number-two single and set another record for Madonna as the artist with the most number two hits.[39][123] The second single, \"Ray of Light\", debuted at number five on the Billboard Hot 100.[124]",
			"color": "tan|0.28309 black|0.23787 sienna|0.069678 peach|0.057045 puff|0.057045 burly|0.054765 wood|0.054765 saddle|0.041326 brown|0.041326 bisque|0.029767 blanched|0.018913 almond|0.018913 wheat|0.018496 antique|0.015966 white|0.015966 light|0.015437 salmon|0.015437 papaya|0.015026 whip|0.015026 dark|0.014536 salmon|0.014536 old|0.0091977 lace|0.0091977 corn|0.009111 silk|0.009111  "
		}
	}
}
