{
	"add": {
		"doc": {
			"id": "66b8954b526579044a525cbe9f25813b13e76622a710d7987d2861036259d16e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Raphus_cucullatus_1.jpg/170px-Raphus_cucullatus_1.jpg",
				"previous": "Clark's reports about the finds rekindled interest in the bird. Sir Richard Owen and Alfred Newton both wanted to be first to describe the post-cranial anatomy of the dodo, and Owen bought a shipment of dodo bones originally meant for Newton, which led to rivalry between the two. Owen described the bones in Memoir on the Dodo in October 1866, but erroneously based his reconstruction on the Edwards's Dodo painting by Savery, making it too squat and obese. In 1869 he received more bones and corrected its stance, making it more upright. Newton moved his focus to the Réunion solitaire instead. The remaining bones not sold to Owen or Newton were auctioned off or donated to museums.[3] In 1889, Théodor Sauzier was commissioned to explore the \"historical souvenirs\" of Mauritius and find more dodo remains in the Mare aux Songes. He was successful, and also found remains of other extinct species.[106]",
				"after": "In October 2005, after a hundred years of neglect, a part of the Mare aux Songes swamp was excavated by an international team of researchers. To prevent malaria, the British had covered the swamp with hard core during their rule over Mauritius, which had to be removed. Many remains were found, including bones of at least 17 dodos in various stages of maturity (though no juveniles), and several bones obviously from the skeleton of one individual bird, which have been preserved in their natural position.[107] These findings were made public in December 2005 in the Naturalis museum in Leiden. 63% of the fossils found in the swamp belonged to turtles of the extinct Cylindraspis genus, and 7.1% belonged to dodos, which had been deposited within several centuries, 4,000 years ago.[108] Subsequent excavations suggested that dodos and other animals became mired in the Mare aux Songes while trying to reach water during a long period of severe drought about 4,200 years ago.[107] Furthermore, cyanobacteria thrived in the conditions created by the excrements of animals gathered around the swamp, which died of intoxication, dehydration, trampling, and miring.[109] Though many small skeletal elements were found during the recent excavations of the swamp, few were found during the 19th century, probably owing to the employment of less refined methods when collecting.[73] In June 2007, adventurers exploring a cave in Mauritius discovered the most complete and best-preserved dodo skeleton ever found. The specimen was nicknamed \"Fred\" after the finder.[110]",
			"color": "black|0.28666 peru|0.11304 dim|0.048141 gray|0.048141 dim|0.048141 grey|0.048141 dark|0.046788 khaki|0.046788 pale|0.037886 golden|0.037886 rod|0.037886 floral|0.027461 white|0.027461 mint|0.026759 cream|0.026759 sea|0.026728 shell|0.026728 white|0.02617 smoke|0.02617 snow|0.026034 white|0.026029 azure|0.02527 ghost|0.024217 white|0.024217 alice|0.023219 blue|0.023219 tan|0.021968 wheat|0.019029 lavender|0.017633 blush|0.017633 gray|0.016192 grey|0.016192 burly|0.015756 wood|0.015756 dark|0.014141 olive|0.014141 green|0.014141  "
		}
	}
}
