{
	"add": {
		"doc": {
			"id": "66c177244a2372ab522e480d3d632a3af5a10f6988fb5a3369977f09ea2caeb8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Greek_Army_during_Primavera_Offensive_Klisura_March_1941.JPG/260px-Greek_Army_during_Primavera_Offensive_Klisura_March_1941.JPG",
			"previous": [],
				"after": "Greece was eventually occupied by the Nazis who proceeded to administer Athens and Thessaloniki, while other regions of the country were given to Nazi Germany's partners, Fascist Italy and Bulgaria. The occupation brought about terrible hardships for the Greek civilian population. Over 100,000 civilians died of starvation during the winter of 1941–1942, tens of thousands more died because of reprisals by Nazis and collaborators, the country's economy was ruined and the great majority of Greek Jews were deported and murdered in Nazi concentration camps.[73][74] The Greek Resistance, one of the most effective resistance movements in Europe fought vehemently against the Nazis and their collaborators. The German occupiers committed series of atrocities, mass executions, wholesale slaughter of civilians and destruction of towns and villages in Greece. The most infamous examples are those of the village of Kommeno on 16 August 1943, where 317 inhabitants were executed by the 1. Gebirgs-Division and the village torched, the \"Holocaust of Viannos\" on 14–16 September 1943, in which over 500 civilians from several villages in the region of Viannos and Ierapetra in Crete were executed by the 22. Luftlande Infanterie-Division, the \"Massacre of Kalavryta\" on 13 December 1943, in which Wehrmacht troops of the 117th Jäger Division carried out the extermination of the entire male population and the subsequent total destruction of the town, the \"Distomo massacre\" on 10 June 1944, where units of the Waffen-SS Polizei Division looted and burned the village of Distomo in Boeotia resulting in the deaths of 218 civilians and the \"Holocaust of Kedros\" on 22 August 1944 in Crete, where 164 civilians were executed and nine villages were dynamited after being looted. At the same time, in the course of the concerted anti-guerrilla campaign, hundreds of villages were systematically torched and almost 1,000,000 Greeks left homeless.[74] In total, the Germans executed some 21,000 Greeks, the Bulgarians 40,000 and the Italians 9,000.[75]",
			"color": "dim|0.42065 gray|0.42065 dim|0.42065 grey|0.42065 gray|0.27126 grey|0.27126 black|0.11253 dark|0.10764 gray|0.10764 dark|0.10764 grey|0.10764 silver|0.037783 light|0.017518 gray|0.017518 light|0.017518 grey|0.017518 gainsboro|0.011361  "
		}
	}
}
