{
	"add": {
		"doc": {
			"id": "66e9043df1a87832db38b9d8b94ef6c94459247baba22892422e4211f047b4aa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Richard_Bancroft.png/220px-Richard_Bancroft.png",
			"previous": [],
				"after": "The original printing of the Authorized Version was published by Robert Barker, the King's Printer, in 1611 as a complete folio Bible.[55] It was sold looseleaf for ten shillings, or bound for twelve.[56] Robert Barker's father, Christopher, had, in 1589, been granted by Elizabeth I the title of royal Printer,[57] with the perpetual Royal Privilege to print Bibles in England.[b] Robert Barker invested very large sums in printing the new edition, and consequently ran into serious debt,[58] such that he was compelled to sub-lease the privilege to two rival London printers, Bonham Norton and John Bill.[59] It appears that it was initially intended that each printer would print a portion of the text, share printed sheets with the others, and split the proceeds. Bitter financial disputes broke out, as Barker accused Norton and Bill of concealing their profits, while Norton and Bill accused Barker of selling sheets properly due to them as partial Bibles for ready money.[60] There followed decades of continual litigation, and consequent imprisonment for debt for members of the Barker and Norton printing dynasties,[60] while each issued rival editions of the whole Bible. In 1629 the Universities of Oxford and Cambridge successfully managed to assert separate and prior royal licences for Bible printing, for their own university presses – and Cambridge University took the opportunity to print revised editions of the Authorized Version in 1629,[61] and 1638.[62] The editors of these editions included John Bois and John Ward from the original translators. This did not, however, impede the commercial rivalries of the London printers, especially as the Barker family refused to allow any other printers access to the authoritative manuscript of the Authorized Version.[63]",
			"color": "beige|0.16533 light|0.14561 golden|0.14561 rod|0.14561 yellow|0.14561 blanched|0.13198 almond|0.13198 corn|0.12794 silk|0.12794 papaya|0.12104 whip|0.12104 lemon|0.11669 chiffon|0.11669 light|0.11117 yellow|0.11117 wheat|0.04116  "
		}
	}
}
