{
	"add": {
		"doc": {
			"id": "6704f6fa7d3771c18bdbc19ccbb83be74e689a56df62b5d6f0d7cb2182b1c930",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/La_station_baleini%C3%A8re_du_Hvalfj%C3%B6r%C3%B0ur_%284%29.jpg/220px-La_station_baleini%C3%A8re_du_Hvalfj%C3%B6r%C3%B0ur_%284%29.jpg",
			"previous": [],
			"after": [
				"The fin whale is a filter-feeder, feeding on small schooling fish, squid and crustaceans including copepods and krill.",
				"In the North Pacific, they feed on euphausiids in the genera Euphausia, Thysanoessa, and Nyctiphanes, large copepods in the genus Neocalanus, small schooling fish (e.g. the genera Engraulis, Mallotus, Clupea, and Theragra), and squid. Based on stomach content analysis of over 19,500 fin whales caught by the Japanese whaling fleet in the North Pacific from 1952 to 1971, 64.1% contained only krill, 25.5% copepods, 5.0% fish, 3.4% krill and copepods and 1.7% squid.[100] Nemoto (1959) analyzed the stomach contents of about 7,500 fin whales caught in the northern North Pacific and Bering Sea from 1952 to 1958, found that they mainly preyed on euphausiids around the Aleutian Islands and in the Gulf of Alaska and schooling fish in the northern Bering Sea and off Kamchatka. In the northern Bering Sea (north of 58°N), their main prey species were capelin (Mallotus villosus), Alaska pollock (Theragra chalcogramma) and Pacific herring (Clupea pallasii); they also consumed saffron cod (Eleginus gracilis). Arctic krill (Thysanoessa raschii) was the only species of euphausiid found in the stomachs of fin whales in the northern Bering Sea. Off Kamchatka, they appeared to primarily feed on herring. They also took large quantities of the copepod Neocalanus cristatus around the Aleutian Islands and in Olyutorsky Bay off northeast Kamchatka, areas where the species was abundant. Five species of euphausiid (Euphausia pacifica, Thysanoessa spinifera, T. inermis, T. raschii, and T. longipes) were the predominant prey around the Aleutian Islands and in the Gulf of Alaska. Prey varied by region in the Kuril Islands area, with euphausiids (T. longipes, T. inermis, and T. raschii) and copepods (Neocalanus plumchrus and N. cristatus) being the main prey in the northern area and Japanese flying squid (Todarodes pacificus pacificus) and small schooling fish (e.g. Pacific saury, Cololabis saira; and Japanese anchovy, Engraulis japonicus) dominating the diet in the southern area.[101]"
			],
			"color": "black|0.4512 silver|0.10052 light|0.082673 gray|0.082673 light|0.082673 grey|0.082673 dark|0.078361 gray|0.078361 dark|0.078361 grey|0.078361 gainsboro|0.060815 gray|0.042185 grey|0.042185 dim|0.037404 gray|0.037404 dim|0.037404 grey|0.037404 light|0.023615 slate|0.023615 gray|0.023615 slate|0.015115 gray|0.015115 white|0.012393 smoke|0.012393 dark|0.012109 slate|0.012109 gray|0.012109 alice|0.007862 blue|0.007862 ghost|0.0074974 white|0.0074974 snow|0.0069698 linen|0.0066891 sea|0.0064903 shell|0.0064903 mint|0.0057176 cream|0.0057176 white|0.0057008 light|0.0055469 steel|0.0055469 blue|0.0055469 azure|0.0047359 lavender|0.0047246 blush|0.0047246  "
		}
	}
}
