{
	"add": {
		"doc": {
			"id": "6707a7d492a00b2d4ea6bbe757ad50579aab8e70e40fdf3cfae25af028fb451e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/MingXiaoling_ZLTS01_rotated.jpg/220px-MingXiaoling_ZLTS01_rotated.jpg",
				"previous": "Over the years, Kangxi kept constant watch over Yinreng and became aware of his son's many flaws, while their relationship gradually deteriorated. In 1707, Kangxi decided that he could no longer tolerate Yinreng's behavior, which he partially mentioned in the imperial edict as \"never obeying ancestors' virtues, never obliged to my order, only doing inhumanity and devilry, only showing maliciousness and lust\",[20] and decided to strip Yinreng of his position as crown prince. Kangxi placed his oldest surviving son, Yinzhi, in charge of overseeing Yinreng's house arrest. Yinzhi, an unfavored Shu son, knowing he had no chance of being selected, recommended the eighth prince, Yinsi, and requested his father to order Yinreng's execution. Kangxi was enraged and stripped Yinzhi of his titles. Kangxi commanded his subjects to cease debating the succession issue, but despite this and attempts to reduce rumours and speculation as to who the new crown prince might be, the imperial court's daily activities were disrupted. Yinzhi's actions caused Kangxi to suspect that Yinreng might have been framed, so he restored Yinreng as crown prince in 1709, with the support of the 4th and 13th princes, and on the excuse that Yinreng had previously acted under the influence of mental illness.",
				"after": "In 1712, during Kangxi's last inspection tour of the south, Yinreng, who was put in charge of state affairs during his father's absence, tried to vie for power again with his supporters. He allowed an attempt at forcing Kangxi to abdicate when his father returned to Beijing. However, Kangxi received news of the planned coup d'etat, and was so angry that he deposed Yinreng and placed him under house arrest again. After the incident, Kangxi announced that he would not appoint any of his sons as crown prince for the remainder of his reign. He stated that he would place his Imperial Valedictory Will inside a box in the Palace of Heavenly Purity, which would only be opened after his death.",
			"color": "light|0.21445 coral|0.21445 dark|0.19577 gray|0.19577 dark|0.19577 grey|0.19577 silver|0.16625 light|0.089523 gray|0.089523 light|0.089523 grey|0.089523 gray|0.071511 grey|0.071511 tan|0.056596 gainsboro|0.051028 dim|0.049843 gray|0.049843 dim|0.049843 grey|0.049843 salmon|0.034803 dark|0.018437 salmon|0.018437 rosy|0.011352 brown|0.011352 antique|0.010028 white|0.010028 burly|0.0061734 wood|0.0061734  "
		}
	}
}
