{
	"add": {
		"doc": {
			"id": "67111a20ede59416d1de004f927241fb18c51d4082f2eaa6d976a4df59d303fc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Cockatielmale.jpg/170px-Cockatielmale.jpg",
				"previous": "Cockatoos are often very affectionate with their owner and at times other people but can demand a great deal of attention. Furthermore, their intense curiosity means they must be given a steady supply of objects to tinker with, chew, dismantle and destroy. Parrots in captivity may suffer from boredom, which can lead to stereotypic behaviour patterns, such as feather-plucking. Feather plucking is likely to stem from psychological rather than physical causes.[113] Other major drawbacks include their painful bites,[114] and their piercing screeches.[115] The salmon-crested[116] and white cockatoo species are particular offenders.[117] All cockatoos have a fine powder on their feathers, which may induce allergies in certain people.[114] In general, the smaller cockatoo species such as Goffin's and quieter Galah's cockatoos are much easier to keep as pets.[118] The cockatiel is one of the most popular and easiest parrots to keep as a pet,[119][120] and many colour mutations are available in aviculture.[33]",
				"after": "The larger cockatoos can live 30–70 years depending on the species or occasionally longer and cockatiels can live for about 20 years. As pets they require a long-term commitment from their owners. Their longevity is considered a positive trait as it reduces instances of the loss of a pet.[6] The oldest cockatoo in captivity is a Major Mitchell's cockatoo named 'Cookie', residing at Brookfield Zoo in Chicago, which was 79 years old in June 2012.[121] A salmon-crested cockatoo named 'King Tut' who resided at San Diego Zoo was nearly 69 when he died in 1990 and a palm cockatoo reached 56 in London Zoo in 2000.[122] However, anecdotal reports describe birds of much greater ages.[122] 'Cocky Bennett' of Tom Ugly's Point in Sydney was a celebrated sulphur-crested cockatoo who was reported to have reached an age of 100 years or more. He had lost his feathers and was naked for much of his life.[123] A palm cockatoo was reported to have reached 80 or 90 years of age in an Australian zoo,[43] and a little corella that was removed from a nest in central Australia in 1904 was reported still alive in the late 1970s.[74] In February 2010, a white cockatoo named 'Arthur' was claimed to be 90 years old; he had lived with a family for generations in Dalaguete, Cebu, before being taken to Cebu City Zoo.[124]",
			"color": "black|0.34947 gray|0.15737 grey|0.15737 dark|0.154 gray|0.154 dark|0.154 grey|0.154 saddle|0.11462 brown|0.11462 dim|0.053707 gray|0.053707 dim|0.053707 grey|0.053707 sienna|0.049665 khaki|0.023137 silver|0.015564 dark|0.012265 khaki|0.012265 light|0.011738 gray|0.011738 light|0.011738 grey|0.011738  "
		}
	}
}
