{
	"add": {
		"doc": {
			"id": "671b179f89bcacd257d27cb3ad21f6499af774faa76abcdf25e5c0ceedce4b12",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Boer_War_Memorial%2C_Plymouth.jpg/220px-Boer_War_Memorial%2C_Plymouth.jpg",
				"previous": "Harold Lothrop Borden was the only son of Canada's Canadian Minister of Defence and Militia, Frederick William Borden. Serving in the Royal Canadian Dragoons, he became the most famous Canadian casualty of the Second Boer War.[93] Queen Victoria asked F. W. Borden for a photograph of his son, Prime Minister Wilfrid Laurier praised his services, tributes arrived from across Canada, and in his home town Canning, Nova Scotia, there is a monument (by Hamilton MacCarthy) erected to his memory.[93]",
				"after": "Sam Hughes - Senior Militia officer and later a Federally elected cabinet minister. As a very patriotic individual, Hughes became involved in the Boer war as a member of Brigadier-General Herbert Settle's expedition after Hughes unsuccessfully tried to raise his own brigade of soldiers.[83] Hughes was noted by his colleagues for having a dislike of professional soldiers and he was noted for being an exceptional leader of irregular soldiers, whom he preferred to lead in combat.[94] However, Hughes was dismissed and was sent home in the summer of 1900 for; sending letters back home which were published outlining British command incompetence, his impatience and boastfulness and his providing surrendering enemies favourable conditions. When he arrived back in Canada, Hughes became very active politically, and he would eventually start his political career with the Conservatives. When he became a member of parliament, Hughes would be in the position to become the Canadian Minister of Defence and Militia in 1911, just prior the outbreak of World War I. This was a position that Hughes would be dismissed from in 1916, due once again to his impatience, among other reasons.[94]",
			"color": "dark|0.25781 gray|0.25781 dark|0.25781 grey|0.25781 black|0.16195 light|0.11119 steel|0.11119 blue|0.11119 gray|0.056907 grey|0.056907 silver|0.049721 light|0.048767 gray|0.048767 light|0.048767 grey|0.048767 dim|0.038397 gray|0.038397 dim|0.038397 grey|0.038397 dark|0.036994 olive|0.036994 green|0.036994 gainsboro|0.036609 alice|0.019018 blue|0.019018 lavender|0.018875 white|0.018602 smoke|0.018602 ghost|0.017629 white|0.017629 rosy|0.016689 brown|0.016689 snow|0.01476 white|0.013955 azure|0.013185 mint|0.012967 cream|0.012967 sea|0.012321 shell|0.012321 floral|0.01024 white|0.01024 lavender|0.0093263 blush|0.0093263 linen|0.0048865  "
		}
	}
}
