{
	"add": {
		"doc": {
			"id": "6734c8a9e9d271605c427d6176019281b96859c052d200b34270299af95aa5d7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/AngloPoitevine.jpg/220px-AngloPoitevine.jpg",
				"previous": "In 1861, there were concerns that the old-style Poitevin was becoming extinct, and questions about whether the Poitou mule retained the quality that it previously had.[28] The large Poitevin mares became rarer, due to large amounts of crossbreeding and a lack of care shown towards breeding stock selection.[16] Thoroughbreds and Thoroughbred crosses, especially at the stud farms in St. Maixent and La Roche-sur-Yon, created the Anglo-Poitevin type, a half-blood used by the army. The continued draining of the marshes also influenced the breed.[21] Many Poitevins at this point were actually a mix of Breton and old-type Poitevin bloodstock. However, a distinction persisted between the real Poitevin and mixed-blood horses, and farmers who preferred the former preserved the type, which formed the base for the creation of the breed studbook.[16]",
				"after": "The studbook for the Poitevin horse was created by the Société Centrale d'Agriculture des Deux-Sèvres on June 26, 1884,[29] with a horse section and a donkey section.[30] The first edition was released December 31, 1885,[29] setting the physical criteria for the breeding and ending the practice of promoting crossbred horses as purebreds. It also marked the end of government intervention against the mule breeding industry, although bonuses were paid to encourage farmers to breed purebred horses.[16] In 1902, a breeding syndicate to promote Poitou mules was created, but disappeared after a lack of advertising by stock breeders. On August 6, 1912, the French government released a decree officially supporting the mule breeding industry, backed by the purchase of mules by the French National Stud and bonuses given to the best stallions.[31]",
			"color": "dim|0.29461 gray|0.29461 dim|0.29461 grey|0.29461 gray|0.20677 grey|0.20677 dark|0.14055 gray|0.14055 dark|0.14055 grey|0.14055 silver|0.073238 light|0.050848 gray|0.050848 light|0.050848 grey|0.050848 gainsboro|0.040656 slate|0.030363 gray|0.030363 white|0.021643 smoke|0.021643 alice|0.017697 blue|0.017697 ghost|0.017192 white|0.017192 snow|0.015799 sea|0.014968 shell|0.014968 lavender|0.014847 blush|0.014847 white|0.014426 mint|0.012768 cream|0.012768 azure|0.01267 floral|0.010348 white|0.010348 linen|0.0037992  "
		}
	}
}
