{
	"add": {
		"doc": {
			"id": "674ede0f9078999b848fb6726ae8200c4b974712fa5c27d5689e5e7c0e88c975",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Detail_of_the_elevation_of_the_court_side_of_the_de_l%27Orme_wing_of_the_Tuileries..jpg/220px-Detail_of_the_elevation_of_the_court_side_of_the_de_l%27Orme_wing_of_the_Tuileries..jpg",
				"previous": "After the death of Henry II, Catherine abandoned the palace of the Tournelles, where Henry had lain after a lance fatally pierced his eye and brain in a joust.[46] To replace the Tournelles, she decided in 1563 to build herself a new Paris residence on the site of some old tile kilns or tuileries. The site was close to the congested Louvre, where she kept her household. The grounds extended along the banks of the Seine and afforded a view of the countryside to the south and west.[47] The Tuileries was the first palace that Catherine had planned from the ground up. It was to grow into the largest royal building project of the last quarter of the sixteenth century in western Europe. Her massive building schemes would have transformed western Paris, as seen from the river, into a monumental complex.[48]",
				"after": "To design the new palace, Catherine brought back Philibert de l'Orme from disgrace. This arrogant genius had been sacked as superintendent of royal buildings at the end of Henry II's reign, after making too many enemies.[49] De l'Orme mentioned the project in his treatises on architecture, but his ideas are not fully known. It appears from the small amount of work carried out that his plans for the Tuileries departed from his known principles. De l'Orme is said to have \"taught France the classical style—lucid, rational and regular\".[50] He notes, however, that in this case he added rich materials and ornaments to please the queen.[51] The plans therefore include a decorative element that looks forward to Bullant's later work and to a less classical style of architecture.[52]",
			"color": " "
		}
	}
}
