{
	"add": {
		"doc": {
			"id": "6750bd810c6917d64bfd55b54086eb0ed46bd571640ddc9d15c1318f3504906f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/MIG_cut-away.svg/300px-MIG_cut-away.svg.png",
				"previous": "To perform gas metal arc welding, the basic necessary equipment is a welding gun, a wire feed unit, a welding power supply, a welding electrode wire, and a shielding gas supply.[10]",
				"after": "The typical GMAW welding gun has a number of key parts—a control switch, a contact tip, a power cable, a gas nozzle, an electrode conduit and liner, and a gas hose. The control switch, or trigger, when pressed by the operator, initiates the wire feed, electric power, and the shielding gas flow, causing an electric arc to be struck. The contact tip, normally made of copper and sometimes chemically treated to reduce spatter, is connected to the welding power source through the power cable and transmits the electrical energy to the electrode while directing it to the weld area. It must be firmly secured and properly sized, since it must allow the electrode to pass while maintaining electrical contact. On the way to the contact tip, the wire is protected and guided by the electrode conduit and liner, which help prevent buckling and maintain an uninterrupted wire feed. The gas nozzle directs the shielding gas evenly into the welding zone. Inconsistent flow may not adequately protect the weld area. Larger nozzles provide greater shielding gas flow, which is useful for high current welding operations that develop a larger molten weld pool. A gas hose from the tanks of shielding gas supplies the gas to the nozzle. Sometimes, a water hose is also built into the welding gun, cooling the gun in high heat operations.[11]",
			"color": "dark|0.27519 gray|0.27519 dark|0.27519 grey|0.27519 coral|0.13504 sienna|0.10441 light|0.070326 salmon|0.070326 red|0.04969 dark|0.036362 salmon|0.036362 yellow|0.034725 firebrick|0.029756 silver|0.025098 tomato|0.019759 brown|0.018005 gainsboro|0.016126 light|0.015064 gray|0.015064 light|0.015064 grey|0.015064 crimson|0.012393 sandy|0.010289 brown|0.010289 linen|0.009344 white|0.0092392 smoke|0.0092392 lavender|0.0089909 blush|0.0089909 sea|0.0086615 shell|0.0086615 snow|0.0082292 orange|0.0079504 red|0.0079504 ghost|0.007939 white|0.007939 floral|0.0078101 white|0.0078101 chocolate|0.0077166 alice|0.0074168 blue|0.0074168 white|0.0073249 maroon|0.0068397  "
		}
	}
}
