{
	"add": {
		"doc": {
			"id": "6755a0eeb02b161028e87021cd5cec5cf13a9d81fe97907bdb05e077b17ffa55",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Curzon_hall_front.jpg/220px-Curzon_hall_front.jpg",
				"previous": "Dhaka has the largest number of schools, colleges and universities of any Bangladeshi city. The education system is divided into 5 levels: Primary (from grades 1 to 5), Junior (from grades 6 to 8), Secondary (from grades 9 to 10), Higher Secondary (from grades 11 to 12) and tertiary.[93] The five years of Primary education concludes with a Primary Education Completion (PEC) Examination, the three years of Junior education concludes with Junior School Certificate (JSC) Examination, and next two years of Secondary education concludes with a Secondary School Certificate (SSC) Examination. Students who pass this examination proceed to two years of Higher Secondary or intermediate training, which culminate in a Higher Secondary School Certificate (HSC) Examination.[93] Education is mainly offered in Bengali, but English is also widely taught and used. A large number of Muslim families send their children to attend part-time courses or even to pursue full-time religious education alongside other subjects, which is imparted in Bengali and Arabic in schools, colleges and madrasas.[93]",
				"after": "There are 52 universities in Dhaka. The Dhaka College is the oldest institution of higher education in the city and amongst the earliest established in British India, founded in 1841. Since independence, Dhaka has seen the establishment of a large number of public and private colleges and universities that offer undergraduate and graduate degrees as well as a variety of doctoral programmes.[94] The University of Dhaka is one of the largest public university[95] in the nation with more than 30,000 students and 1,300 faculty staff. It was established in 1921 being the first university in the region. The university has 23 research centres and 70 departments, faculties and institutes.[96] Eminent seats of higher education include Jagannath University(JnU), Bangladesh University of Engineering and Technology (BUET), Bangabandhu Sheikh Mujib Medical University (BSMMU)and Sher-e-Bangla Agricultural University. Dhaka Medical College and Sir Salimullah Medical College are two famous medical colleges in the nation.[97][98] Protests and strikes, and violence amongst police, students and political groups frequently disrupt public university campuses.[99][100] There are two other renowned Government medical colleges; one is Shaheed Suhrawardy Medical College, and another Armed Forces Medical College, Dhaka, Bangladesh Two of the largest shopping malls in Dhaka and perhaps in the Indian subcontinent are Jamuna Future Park and Bashundhara city shopping mall.",
			"color": "black|0.30608 dim|0.29325 gray|0.29325 dim|0.29325 grey|0.29325 gray|0.21107 grey|0.21107 dark|0.068734 gray|0.068734 dark|0.068734 grey|0.068734 slate|0.041063 gray|0.041063 light|0.02869 slate|0.02869 gray|0.02869  "
		}
	}
}
