{
	"add": {
		"doc": {
			"id": "67660f136d6d94436bb54a70f3139bda6fcded1f3a45acaf965ce6d66dd52f82",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/China.Terracotta_statues006.jpg/220px-China.Terracotta_statues006.jpg",
				"previous": "Towards the end of the Han dynasty, the land tax rate was reduced to one-hundredth, with lost revenue recouped by increasing the poll and property tax rates.[43] The poll tax for most adults was 120 coins annually, 240 coins for merchants, and 20 coins for minors aged between three and fourteen years. The lower taxable threshold age for minors increased to seven years during the reign of Emperor Yuan of Han (r. 48–33 BC) and onwards.[44] Historian Charles Hucker writes that underreporting of the population by local authorities was deliberate and widespread, since this reduced their tax and labor service obligations rendered to the central government.[45]",
				"after": "Though requiring additional revenue to fund the Han–Xiongnu War, the government during Emperor Wu of Han's reign (141–87 BC) sought to avoid heavy taxation of small landowners. To increase revenue, the government imposed heavier taxes on merchants, confiscated land from nobles, sold offices and titles, and established government monopolies over the minting of coins, iron manufacture and salt mining.[38] New taxes were imposed on the ownership of boats, carts, carriages, wheelbarrows, shops and other properties. The overall property tax for merchants was raised in 119 BC from 120 coins for every 10,000 coins-worth of property owned to 120 coins for every 2,000 coins-worth of property owned.[46] Tax rates for almost all commodities are unknown, except for that of liquor. After the government monopoly on liquor was abolished in 81 BC, a property tax of 2 coins for every 0.2 litres (0.05 US gal) was levied on liquor merchants.[16]",
			"color": "dim|0.27957 gray|0.27957 dim|0.27957 grey|0.27957 black|0.12931 gray|0.11327 grey|0.11327 dark|0.074991 gray|0.074991 dark|0.074991 grey|0.074991 tan|0.051583 dark|0.048079 slate|0.048079 gray|0.048079 silver|0.036105 dark|0.024698 olive|0.024698 green|0.024698 light|0.019907 gray|0.019907 light|0.019907 grey|0.019907 rosy|0.019649 brown|0.019649  "
		}
	}
}
