{
	"add": {
		"doc": {
			"id": "676d959fd1c8f1da14e50be6081321b71ccfbe013e4eb28ffaaca95fe97cd2e5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Kent_Downtown_Development_2013.JPG/220px-Kent_Downtown_Development_2013.JPG",
				"previous": "In early May 1970, protests began on the campus of Kent State University over the United States' invasion of Cambodia in the Vietnam War. These protests and demonstrations, which included rioting in downtown Kent on May 2, culminated in the May 4, 1970 Kent State shootings, where four students were killed and nine were wounded by the Ohio Army National Guard.[19] Several memorials have been placed at the site over the years and commemorations have been held annually since 1971. In 2010 the entire site was listed on the National Register of Historic Places.[20] Also during the late 1960s and into the 1970s, construction of Haymaker Parkway, completed in 1975, brought changes to the city's layout while eliminating ongoing problems with traffic congestion and blocked rail crossings.[21]",
				"after": "In 1995, Kent received national attention when the city's water was named \"Best Tasting Municipality Water\" at the Berkeley Springs International Water Tasting. The water and mayor Kathleen Chandler were featured on the March 3 episode of The Tonight Show with Jay Leno. Since then, Kent has placed in the top five a total of six times with the most recent being a fifth place finish in 2011.[22] In 2003, the 1836 arch dam was bypassed to meet water quality standards set by the Ohio Environmental Protection Agency. To preserve the historic dam, a small park was built behind the dam and the river was rerouted through the old canal lock. During warm-weather months, water is pumped over the dam. The park, known as Heritage Park, was formally dedicated in May 2005.[23]",
			"color": "black|0.28767 dim|0.24182 gray|0.24182 dim|0.24182 grey|0.24182 sandy|0.10839 brown|0.10839 peru|0.085893 gray|0.054702 grey|0.054702 tan|0.050008 burly|0.045228 wood|0.045228 sienna|0.020034  "
		}
	}
}
