{
	"add": {
		"doc": {
			"id": "6789ab36d62f030815661f082a222f5b5c495712c2c48aa149e981e146415116",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Fordham_University_Keating_Hall.JPG/220px-Fordham_University_Keating_Hall.JPG",
				"previous": "Over 600,000 students are enrolled in New York City's over 120 higher education institutions, the highest number of any city in the United States, including over half million in the City University of New York (CUNY) system alone in 2014.[327] In 2005, three out of five Manhattan residents were college graduates, and one out of four had a postgraduate degree, forming one of the highest concentrations of highly educated people in any American city.[328] New York City is home to such notable private universities as Barnard College, Columbia University, Cooper Union, Fordham University, New York University, New York Institute of Technology, Pace University, and Yeshiva University. The public CUNY system is one of the largest universities in the nation, comprising 24 institutions across all five boroughs: senior colleges, community colleges, and other graduate/professional schools. The city also has other smaller private colleges and universities, including many religious and special-purpose institutions, such as St. John's University, The Juilliard School, Manhattan College, The College of Mount Saint Vincent, The New School, Pratt Institute, The School of Visual Arts, and Wagner College.",
				"after": "Much of the scientific research in the city is done in medicine and the life sciences. New York City has the most post-graduate life sciences degrees awarded annually in the United States, with 127 Nobel laureates having roots in local institutions as of 2004;[329] while in 2012, 43,523 licensed physicians were practicing in New York City.[330] Major biomedical research institutions include Memorial Sloan–Kettering Cancer Center, Rockefeller University, SUNY Downstate Medical Center, Albert Einstein College of Medicine, Mount Sinai School of Medicine, and Weill Cornell Medical College, being joined by the Cornell University/Technion-Israel Institute of Technology venture on Roosevelt Island.",
			"color": "black|0.48219 dark|0.26812 olive|0.26812 green|0.26812 gray|0.096844 grey|0.096844 dim|0.083919 gray|0.083919 dim|0.083919 grey|0.083919 dark|0.035959 gray|0.035959 dark|0.035959 grey|0.035959 dark|0.014819 slate|0.014819 gray|0.014819 silver|0.0078125  "
		}
	}
}
