{
	"add": {
		"doc": {
			"id": "67962b0434719a1f57f1f25ee71306d805c22caf2c0ded395c15b366e022b094",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Litoria_aurea_range_in_Australia.PNG/220px-Litoria_aurea_range_in_Australia.PNG",
				"previous": "Litorea aurea is equally and most closely related to Li. castanes and L. ranaformis. A microcomplement fixation technique using serum albumins has indicated the species closest to L. aurea is L. ranifomis. Albumin immunological distance data suggest no differentiation between the two, and the green and golden bell frog evolutionally separated from the other two species about 1.1 million years ago. A 1995 study of protein variations showed four of 19 protein systems had variation and only two had differentiation.[5] Scientists believe the different species can still hybridise, as their distribution areas still overlap, and both L. raniformis and L. aurea have been seen sharing ponds in the Gippsland area of Victoria.[5] However, little evidence of hybridisation actually occurring has been found. Although there have been reports of frogs of mixed appearance in Gippsland, analysis of proteins and sera of the frogs showed two distinct species.[6] Samples in other area of distribution have shown no evidence of hybridisation in spite of cohabitation.[6]",
				"after": "The green and golden bell frog is native to south-eastern Australia. Before its decline in population, its distribution ranged from Brunswick Heads, in northern New South Wales, to East Gippsland, in Victoria,[7] and west to Bathurst, Tumut and the Australian Capital Territory.[8]",
			"color": "white|0.092883 smoke|0.092883 sea|0.091719 shell|0.091719 snow|0.091525 alice|0.091479 blue|0.091479 ghost|0.091439 white|0.091439 white|0.090972 floral|0.090884 white|0.090884 mint|0.090823 cream|0.090823 azure|0.09006 lavender|0.089852 blush|0.089852 dark|0.02735 gray|0.02735 dark|0.02735 grey|0.02735 silver|0.021983 light|0.016081 gray|0.016081 light|0.016081 grey|0.016081 gainsboro|0.010144 gray|0.00581 grey|0.00581 linen|0.0030782  "
		}
	}
}
