{
	"add": {
		"doc": {
			"id": "6798896035ba43593c45fbf8571a9a4727d928f8e4029d22d84b82bfa432420e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Downtown_Chincoteague.jpg/220px-Downtown_Chincoteague.jpg",
				"previous": "Many souvenir shops and other tourist enterprises were built along Maddox Boulevard,[48] especially in the years after 1962.[49] At first, the motels were buildings converted from other uses, but by the late 1960s, purpose-built structures were being erected along Maddox Boulevard, some with swimming pools.[50] Although Misty died in 1972 at age 26,[51] the island continued to be publicized. By the 1990s, tourism was the island's principal business, bringing in more than $100 million annually. National hotel chains, including a Hampton Inn and a Comfort Suites, arrived with the 21st century.[52]",
				"after": "The changes to Chincoteague, including the sale of the Beebe Ranch for development in 1989 and the destruction by fire of the ranch house in 1996, brought local soul-searching. Islanders were divided by such questions as the establishment of a nudist beach on Assateague (outlawed by Accomack County ordinance in 1984) and the building of a McDonald's near the bridge between the two islands. The modest homes on Chincoteague Island were supplemented by townhouses and condominiums, many occupied by seasonal residents. With increased real estate prices, many from Chincoteague sold their land and moved to less expensive property on the mainland. The seafood industry ceased to be a major factor in the island's economy: most of the oyster-shucking houses, which had continued in operation using imported shellfish despite the local decline in oystering, finally closed in the 1980s and 1990s. The clam industry sought bivalves from deeper waters, and Chincoteague by then supplied few shellfish.[53]",
			"color": "dim|0.34845 gray|0.34845 dim|0.34845 grey|0.34845 gray|0.11851 grey|0.11851 gainsboro|0.064669 light|0.056353 gray|0.056353 light|0.056353 grey|0.056353 alice|0.046049 blue|0.046049 lavender|0.043315 white|0.04143 smoke|0.04143 ghost|0.040293 white|0.040293 dark|0.039901 gray|0.039901 dark|0.039901 grey|0.039901 azure|0.027973 silver|0.026134 snow|0.025355 lavender|0.023915 blush|0.023915 white|0.02322 mint|0.020106 cream|0.020106 sea|0.012862 shell|0.012862 light|0.010838 slate|0.010838 gray|0.010838 slate|0.009255 gray|0.009255 floral|0.0092303 white|0.0092303 black|0.007389  "
		}
	}
}
