{
	"add": {
		"doc": {
			"id": "679f7d7554e04dbc6db0091c97dc5cfb0bebf910f76374921ac6eca3eb3f63a4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Topographie_de_brest.jpg/220px-Topographie_de_brest.jpg",
				"previous": "A few kilometres out of town, there are more impressive landscapes, from sandy beaches to grottos to tall granite cliffs. Sunbathing, windsurfing, yachting and fishing are enjoyed in the area. Brest was an important warship-producing port during the Napoleonic wars. The naval port, which is in great part excavated in the rock, extends along both banks of the Penfeld river.",
			"after": [
				"Brest is located amidst a dramatic landscape near the entrance of the natural rade de Brest (Brest roadstead), at the west end of Brittany.",
				"It is situated to the north of a magnificent landlocked bay, and occupies the slopes of two hills divided by the river Penfeld. The part of the town on the left bank is regarded as Brest proper, while the part on the right is known as Recouvrance. There are also extensive suburbs to the east of the town. The hillsides are in some places so steep that the ascent from the lower to the upper town has to be effected by flights of steps and the second or third storey of one house is often on a level with the ground storey of the next."
			],
			"color": "olive|0.079323 drab|0.079323 medium|0.069523 sea|0.069523 green|0.069523 white|0.05516 smoke|0.05516 alice|0.052873 blue|0.052873 ghost|0.052837 white|0.052837 lavender|0.05283 blush|0.05283 sea|0.052713 shell|0.052713 snow|0.05259 white|0.051949 sea|0.051666 green|0.051666 mint|0.050806 cream|0.050806 floral|0.046483 white|0.046483 forest|0.043935 green|0.043935 azure|0.03652 cadet|0.034408 blue|0.034408 steel|0.026024 blue|0.026024 dark|0.022975 khaki|0.022975 dark|0.019926 slate|0.019926 gray|0.019926 linen|0.017007 teal|0.015897 gainsboro|0.013813 dark|0.013175 green|0.013175 dark|0.011868 cyan|0.011868 light|0.011542 sea|0.011542 green|0.011542 dark|0.011215 olive|0.011215 green|0.011215 dark|0.01078 slate|0.01078 blue|0.01078  "
		}
	}
}
