{
	"add": {
		"doc": {
			"id": "67a8dd63acbdfbe5f42f2196481628fa3778ba4020d0bb1446a01d279966d1c5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Money_of_the_world_portland.jpg/170px-Money_of_the_world_portland.jpg",
				"previous": "The Lewis and Clark Centennial and American Pacific Exposition and Oriental Fair opened in Portland on June 1, 1905. It was not designated as an international exposition, and did not draw much publicity – even within the United States. Nevertheless, two and a half million people visited the fair between Opening Day and the close on October 14. Sixteen foreign nations accepted invitations from organizers to mount exhibits at the exposition. There was the usual broad array of concessions and midway attractions to entertain visitors.[7] Among Americans who displayed exhibits at the fair were prominent cartoonist and animal fancier Homer Davenport[19] and long-lived pioneer Ezra Meeker. The exposition was one of the few of its kind to make a profit, and likely contributed to a major increase in Portland's population and economy between 1905 and 1912.[8]",
				"after": "Funds from the sale of the coin were designated for the completion of a statue to Sacagawea in a Portland park.[16] There was little mention of the dollar in the numismatic press. Q. David Bowers speculates that Dr. George F. Heath, editor of The Numismatist, who opposed such commemoratives, declined to run any press releases that Zerbe might have sent.[17] Nevertheless, an article appeared in the August 1905 issue, promoting the exhibit and dollar. As it quotes Zerbe and praises his efforts, it was likely written by him.[20] Zerbe concentrated on bulk sales to dealers, as well as casual ones at the fair at a price of $2; he enlisted Portland coin dealer D.M. Averill & Company to make retail sales by mail. There were also some banks and other businesses that sold coins directly to the public. Averill ran advertisements in the numismatic press, and in early 1905, raised prices on the 1904 pieces, claiming that they were near exhaustion. This was a lie: in fact the 1904-dated coins sold so badly that some 15,000 were melted at the San Francisco Mint.[17] Zerbe had Averill sell the 1905 issue at a discounted price of ten dollars for six pieces.[15] As he had for the Louisiana Purchase dollar, Zerbe made the coins available mounted in spoons or in jewelry. Little else is known regarding the distribution of the gold dollars.[17]",
			"color": " "
		}
	}
}
