{
	"add": {
		"doc": {
			"id": "67a80e80a21607851bc71b3d4757ae18e27e86678079bb3ed776a2f56b134343",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Hram_Svetog_Save_-_September_2006.jpg/200px-Hram_Svetog_Save_-_September_2006.jpg",
			"previous": [],
				"after": "Serbs are predominantly Orthodox Christians, and before Christianity they adhered to Slavic paganism. Serbs were Christianized at the beginning of the 9th century, and the Serbian Orthodox Church was established as the national church by Saint Sava in 1219. An autocephalous Church led by a Patriarch, and consisting of three Archbishoprics, six Metropolitanates and thirty-one dioceses, it has around 10 million adherents. Followers of the church form the largest religious group in Serbia and Montenegro, and the second-largest in Bosnia and Herzegovina and Croatia. The church has an archbishopric in Macedonia and dioceses in Western Europe, North America and Australia.[66] The identity of ethnic Serbs was historically largely based on Orthodox Christianity and on the Serbian Orthodox Church in particular, to the extent of the claims that those who are not its faithful are not Serbs. The conversion of the South Slavs from paganism to Christianity took place before the Great Schism, the split between the Greek East and the Catholic West. After the Schism, those who lived under the Orthodox sphere of influence became Orthodox and those who lived under the Catholic sphere of influence became Catholic. Some ethnologists consider that the distinct Serb and Croat identities relate to religion rather than ethnicity. With the arrival of the Ottoman Empire, some Serbs converted to Islam. This was particularly, but not wholly, the case in Bosnia. The most known Muslim Serbs include Mehmed Paša Sokolović and Meša Selimović. Since the second half of the 19th century, some Serbs converted to Protestantism, while historically some Serbs were Catholics (especially in Dalmatia; e.g. Serb-Catholic movement in Dubrovnik).[67] The remainder of Serbs remain predominantly Serbian Orthodox Christians.",
			"color": "gray|0.27803 grey|0.27803 dim|0.19072 gray|0.19072 dim|0.19072 grey|0.19072 slate|0.12061 gray|0.12061 black|0.091614 dark|0.07808 gray|0.07808 dark|0.07808 grey|0.07808 light|0.075138 steel|0.075138 blue|0.075138 light|0.051091 slate|0.051091 gray|0.051091 silver|0.031182 lavender|0.029289 light|0.01701 gray|0.01701 light|0.01701 grey|0.01701 gainsboro|0.010739 light|0.009845 blue|0.009845 dark|0.0064431 slate|0.0064431 gray|0.0064431  "
		}
	}
}
