{
	"add": {
		"doc": {
			"id": "67b25a86bc844fe0b3eb01b1696bf6603e348415316f3bcd27786e0a083b220a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/PBY_Catalina_airtanker.jpg/220px-PBY_Catalina_airtanker.jpg",
				"previous": "Airtankers or water bombers are fixed-wing aircraft fitted with tanks that can be filled on the ground at an air tanker base or, in the case of flying boats and amphibious aircraft, by skimming water from lakes, reservoirs, or large rivers.",
				"after": "Various aircraft have been used over the years for firefighting. In 1947, the United States Air Force and United States Forest Service experimented with World War II aircraft dropping water-filled bombs. The bombs were unsuccessful, and internal water tanks were used instead.[6] Though World War II and Korean War-era bombers were for a long time the mainstay of the aerial firefighting fleet, and are still in use[7] newer purpose-built tankers are coming online. The smallest are the Single Engine Air Tankers (SEATs). These are agricultural sprayers that generally drop about 800 US gallons (3,000 l) of water or retardant. An example is the Airtractor AT-802F, which can deliver around 800 US gallons (3,000 l) of water or fire retardant solution each drop. Another is the Ukrainian Antonov An-2 biplane which can be fitted with floats that can scoop water from the surface of a body of water. An advantage of the biplane is that it has a lower stall speed than a monoplane meaning it a can fly more slowly over a fire which enhances the accuracy of water or retardant drops. Medium aircraft include the S-2 Tracker (retrofitted with turboprop engines as the S-2T) as used by the California Department of Forestry & Fire Protection (CDF), as well as Conair Group Inc. of Abbotsford, British Columbia, while the Douglas DC-4, the DC-7, the Lockheed C-130 Hercules, P-2V Neptune, Lockheed P-3 Orion and its commercial equivalent, the Lockheed L-188 Electra, as used by Air Spray Ltd., of Red Deer, Alberta and others have been used as heavy tankers.",
			"color": "dark|0.25443 slate|0.25443 gray|0.25443 steel|0.18122 blue|0.18122 light|0.075782 slate|0.075782 gray|0.075782 slate|0.06555 gray|0.06555 dark|0.038028 gray|0.038028 dark|0.038028 grey|0.038028 dim|0.030805 gray|0.030805 dim|0.030805 grey|0.030805 light|0.030286 blue|0.030286 black|0.026921 light|0.024404 steel|0.024404 blue|0.024404  "
		}
	}
}
