{
	"add": {
		"doc": {
			"id": "67b5dfef38cb8918a8a9430999ef319cbef2b6d46714de9d25e8b9459edbfdc7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Yukagir_mammoth_leg.jpg/220px-Yukagir_mammoth_leg.jpg",
				"previous": "Adult woolly mammoths could effectively defend themselves from predators with their tusks, trunks and size, but juveniles and weakened adults were vulnerable to pack hunters such as wolves, cave hyenas and large felines. The tusks may also have been used in intra-species fighting, such as territorial fights or fights over mates. Display of the large tusks of males could also have been used to attract females, and to intimidate rivals. Because of their curvature, the tusks were not suitable for stabbing, but may have been used for hitting, as indicated by injuries to some fossil shoulder blades. The very long hairs on the tail probably compensated for the shortness of the tail, enabling its use as a flyswatter, similar to the tail on modern elephants. As in modern elephants, the sensitive and muscular trunk worked as a limb-like organ with many functions. It was used for manipulating objects, and in social interactions.[45] The well-preserved foot of the adult male \"Yukagir mammoth\" shows that the soles of the feet contained many cracks that would have helped in gripping surfaces during locomotion. Like modern elephants, woolly mammoths walked on their toes and had large, fleshy pads behind the toes.[33]",
				"after": "Like modern elephants, woolly mammoths were likely very social and lived in matriarchal (female led) family groups. This is supported by fossil assemblages and cave paintings showing groups. It is therefore probable that most of their other social behaviour was similar to that of modern elephants. It is unknown how many mammoths lived at one location at a time, as fossil deposits are often accumulations of individuals that died over long periods of time. It is likely that the amounts varied by season and life-cycle events. Modern elephants form large herds, sometimes consisting of multiple family groups, and these herds can include thousands of animals migrating together. Mammoths may have formed herds more often, as animals that live in open areas are more likely to do this than those in forested areas.[46] Trackways made by a woolly mammoth herd 11,300–11,000 years ago have been found in the St. Mary Reservoir in Canada, showing that there were in this case almost equal numbers of adults, sub-adults and juveniles. The adults had a stride of 2 m (6.6 ft), and the juveniles ran to keep up.[47]",
			"color": "gray|0.57723 grey|0.57723 dim|0.25628 gray|0.25628 dim|0.25628 grey|0.25628 dark|0.15671 gray|0.15671 dark|0.15671 grey|0.15671 silver|0.0090292  "
		}
	}
}
