{
	"add": {
		"doc": {
			"id": "67c1feb30bdaf5ce27a1a56145902efb7cb574e2b046253639cc76f6f0d89b4b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Raymond_James_Stadium03.jpg/220px-Raymond_James_Stadium03.jpg",
				"previous": "In August 2006, the Bucs unveiled their new training facility. Conveniently located across the street from Raymond James Stadium (on the former site of Tampa Bay Center), this state-of-the-art complex (145,000-square-foot (13,500 m2) facility on 33 acres (13 ha)) is the largest in the NFL. Its features include offices and meeting rooms, three natural grass practice fields, a theatre for meetings and press conferences, an expanded weight room, a fully equipped kitchen and dining room, a rehabilitation center with three separate pools and a locker room twice the size of the former location. The building is capped off with a giant five-story glass and steel football as a key design element. A third practice field, featuring artificial turf, was also planned. In 2009, the team began holding training camp at the new upgraded facilities in Tampa.",
				"after": "In the second week of September 2007, statues of important figures from the Bucs 2002 Championship season were moved into the lobby area in an exhibit called \"Moment of Victory\". The life-size statues included players Mike Alstott, Ronde Barber, Derrick Brooks, Brad Johnson, John Lynch, Shelton Quarles, Simeon Rice, Warren Sapp, and head coach Jon Gruden. The statues are modeled after images from the sideline towards the end of Super Bowl XXXVII.[29]",
			"color": "dark|0.10678 gray|0.10678 dark|0.10678 grey|0.10678 light|0.088156 gray|0.088156 light|0.088156 grey|0.088156 gainsboro|0.083939 rosy|0.075102 brown|0.075102 silver|0.057705 gray|0.057236 grey|0.057236 white|0.043634 smoke|0.043634 dim|0.039529 gray|0.039529 dim|0.039529 grey|0.039529 lavender|0.039479 alice|0.035896 blue|0.035896 ghost|0.035021 white|0.035021 lavender|0.033687 blush|0.033687 snow|0.029804 brown|0.026299 crimson|0.023107 sea|0.023105 shell|0.023105 indian|0.023081 red|0.023081 white|0.021534 linen|0.018635 black|0.016946 firebrick|0.012937 mint|0.012609 cream|0.012609 tan|0.01024 floral|0.0097541 white|0.0097541 azure|0.0093543 misty|0.0090364 rose|0.0090364 light|0.0064679 steel|0.0064679 blue|0.0064679 antique|0.0049754 white|0.0049754  "
		}
	}
}
