{
	"add": {
		"doc": {
			"id": "67cae83c1a3f8b8db4585d1dcc6f571fee43951102ebb933da12d2f6ff0024d8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Cartwheelrev.jpg/170px-Cartwheelrev.jpg",
				"previous": "Boulton spent much time in London lobbying for a contract to strike British coins, but in June 1790 the Pitt Government postponed a decision on recoinage indefinitely.[77] Meanwhile, the Soho Mint struck coins for the East India Company, Sierra Leone and Russia, while producing high-quality planchets, or blank coins, to be struck by national mints elsewhere.[70] The firm sent over 20 million blanks to Philadelphia, to be struck into cents and half-cents by the United States Mint[78]—Mint Director Elias Boudinot found them to be \"perfect and beautifully polished\".[70] The high-technology Soho Mint gained increasing and somewhat unwelcome attention: rivals attempted industrial espionage, while lobbying for Boulton's mint to be shut down.[70]",
				"after": "The national financial crisis reached its nadir in February 1797, when the Bank of England stopped redeeming its bills for gold. In an effort to get more money into circulation, the Government adopted a plan to issue large quantities of copper coins, and Lord Hawkesbury summoned Boulton to London on 3 March 1797, informing him of the Government's plan. Four days later, Boulton attended a meeting of the Privy Council, and was awarded a contract at the end of the month.[78] According to a proclamation dated 26 July 1797, King George III was \"graciously pleased to give directions that measures might be taken for an immediate supply of such copper coinage as might be best adapted to the payment of the laborious poor in the present exigency ... which should go and pass for one penny and two pennies\".[79] The proclamation required that the coins weigh one and two ounces respectively, bringing the intrinsic value of the coins close to their face value.[79] Boulton made efforts to frustrate counterfeiters. Designed by Heinrich Küchler, the coins featured a raised rim with incuse or sunken letters and numbers, features difficult for counterfeiters to match.[70] The twopenny coins measured exactly an inch and a half across; 16 pennies lined up would reach two feet.[70] The exact measurements and weights made it easy to detect lightweight counterfeits. Küchler also designed proportionate halfpennies and farthings; these were not authorised by the proclamation, and though pattern pieces were struck, they never officially entered circulation. The halfpenny measured ten to a foot, the farthing 12 to a foot.[70] The coins were nicknamed \"cartwheels\", both because of the size of the twopenny coin and in reference to the broad rims of both denominations.[80] The penny was the first of its denomination to be struck in copper.[81]",
			"color": "tan|0.53338 burly|0.24089 wood|0.24089  "
		}
	}
}
