{
	"add": {
		"doc": {
			"id": "67f1865342cbdc497c24eefc3821cbd35ddd0cbef36022ea5e3121f7f044c145",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Turmkessel02.png/250px-Turmkessel02.png",
				"previous": "Superheater operation is similar to that of the coils on an air conditioning unit, although for a different purpose. The steam piping is directed through the flue gas path in the boiler furnace. The temperature in this area is typically between 1,300 and 1,600 °C (2,372 and 2,912 °F). Some superheaters are radiant type; that is, they absorb heat by radiation. Others are convection type, absorbing heat from a fluid. Some are a combination of the two types. Through either method, the extreme heat in the flue gas path will also heat the superheater steam piping and the steam within. While the temperature of the steam in the superheater rises, the pressure of the steam does not and the pressure remains the same as that of the boiler.[9] Almost all steam superheater system designs remove droplets entrained in the steam to prevent damage to the turbine blading and associated piping.",
				"after": "Supercritical steam generators are frequently used for the production of electric power. They operate at supercritical pressure. In contrast to a \"subcritical boiler\", a supercritical steam generator operates at such a high pressure (over 3,200 psi or 22 MPa) that the physical turbulence that characterizes boiling ceases to occur; the fluid is neither liquid nor gas but a super-critical fluid. There is no generation of steam bubbles within the water, because the pressure is above the critical pressure point at which steam bubbles can form. As the fluid expands through the turbine stages, its thermodynamic state drops below the critical point as it does work turning the turbine which turns electrical generator from which power is ultimately extracted. The fluid at that point may be a mix of steam and liquid droplets as it passes into the condenser. This results in slightly less fuel use and therefore less greenhouse gas production. The term \"boiler\" should not be used for a supercritical pressure steam generator, as no \"boiling\" actually occurs in this device.",
			"color": "light|0.28138 blue|0.28138 powder|0.13829 blue|0.13829 light|0.10029 steel|0.10029 blue|0.10029 dark|0.060085 gray|0.060085 dark|0.060085 grey|0.060085 tan|0.054261 silver|0.054112 dark|0.04224 khaki|0.04224 dim|0.040053 gray|0.040053 dim|0.040053 grey|0.040053 light|0.040031 gray|0.040031 light|0.040031 grey|0.040031 gray|0.037099 grey|0.037099 gainsboro|0.028037 peach|0.012626 puff|0.012626 white|0.0097856 smoke|0.0097856 burly|0.0096789 wood|0.0096789 wheat|0.0086037 alice|0.0074173 blue|0.0074173 ghost|0.0070499 white|0.0070499 snow|0.0064742 sea|0.0063142 shell|0.0063142 dark|0.005952 sea|0.005952 green|0.005952 lavender|0.0057244 blush|0.0057244 white|0.0055519  "
		}
	}
}
