{
	"add": {
		"doc": {
			"id": "68280e99e970f7a67a80e2268f0e032438212532e48ccef133217a0896a48905",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/20100611_Trump_riverfront_park_and_riverwalk.JPG/220px-20100611_Trump_riverfront_park_and_riverwalk.JPG",
				"previous": "The building has 2,600,000 square feet (240,000 m2) of floor space, rises to 98 stories, and houses 486 luxury residential condominiums. These include studio apartments, a mixture of suites with one to four bedrooms, and five-bedroom penthouses. The tower also features a luxury hotel condominium with 339 guest rooms.[12] The building includes, from the ground up, retail space, a parking garage, a hotel, and condominiums.[1] The 3rd through 12th floors house lobbies, retail space, and the parking garage; the 14th floor and its mezzanine hosts a health club and spa. The 17th floor through the 27th-floor mezzanine contain hotel condominiums and executive lounges. The 28th through 85th floors have residential condominiums, and the 86th through 89th floors have penthouses.[12] A 1.2-acre (4,900 m2) riverfront park and riverwalk, along a 500-foot (150 m) space in the area adjacent to the building to the east,[12][13] was opened in the first half of 2010.[14] The park facilitates public assembly and entertainment activity while linking the building effectively with aquatic commuters.[15]",
				"after": "In 2011, the riverfront park landscaping surrounding the building, which is referred to as Trump Plaza and Riverwalk or sometimes just Trump Plaza, became the subject of controversy. In 2010, the Plaza had earned special recognition at the Mayor Daley's Landscape Awards. The press release noted the landscaping \"for their magnificent new civic landscape that is a poetic interpretation of native Illinois that seems at once sophisticated and familiar.\"[16] However, in 2011, the award-winning plantings of small sumac trees, ferns and native grasses with yellow, orange and red hues were removed and replaced with evergreens like junipers and boxwoods, pieces of gray stone, and purple perennials (catmint and salvia), which may require significantly less watering. To add to the controversy the planting was accompanied by a plan to light the trees to attract nighttime park visitors in conflict with the \"dark skies\" movement to reduce light pollution to facilitate better stargazing.[17]",
			"color": "dim|0.32067 gray|0.32067 dim|0.32067 grey|0.32067 dark|0.20159 slate|0.20159 gray|0.20159 gray|0.19999 grey|0.19999 dark|0.1132 gray|0.1132 dark|0.1132 grey|0.1132 black|0.027272 silver|0.026244 slate|0.024933 gray|0.024933 tan|0.024289 light|0.021359 slate|0.021359 gray|0.021359 dark|0.010378 olive|0.010378 green|0.010378 light|0.0068223 gray|0.0068223 light|0.0068223 grey|0.0068223  "
		}
	}
}
