{
	"add": {
		"doc": {
			"id": "684259e7a10b09685ee50c486a6340891421e707d866dcf04607eadc0e890d80",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Cane_Beagle.jpg/220px-Cane_Beagle.jpg",
				"previous": "Beagles were in the United States by the 1840s at the latest, but the first dogs were imported strictly for hunting and were of variable quality. Since Honeywood had only started breeding in the 1830s, it is unlikely these dogs were representative of the modern breed and the description of them as looking like straight-legged Dachshunds with weak heads has little resemblance to the standard. Serious attempts at establishing a quality bloodline began in the early 1870s when General Richard Rowett from Illinois imported some dogs from England and began breeding. Rowett's Beagles are believed to have formed the models for the first American standard, drawn up by Rowett, L. H. Twadell, and Norman Ellmore in 1887.[18] The Beagle was accepted as a breed by the American Kennel Club (AKC) in 1885.[19] In the 20th century the breed has spread worldwide.",
				"after": "On its formation, the Association of Masters of Harriers and Beagles took over the running of a regular show at Peterborough that had started in 1889, and the Beagle Club in the UK held its first show in 1896.[16] The regular showing of the breed led to the development of a uniform type, and the Beagle continued to prove a success up until the outbreak of World War I when all shows were suspended. After the war, the breed was again struggling for survival in the UK: the last of the Pocket Beagles was probably lost during this time, and registrations fell to an all-time low. A few breeders (notably Reynalton Kennels) managed to revive interest in the dog and by World War II, the breed was once again doing well. Registrations dropped again after the end of the war but almost immediately recovered.[20]",
			"color": "dark|0.13324 gray|0.13324 dark|0.13324 grey|0.13324 dark|0.11716 olive|0.11716 green|0.11716 black|0.076065 silver|0.068637 gray|0.053613 grey|0.053613 dim|0.051821 gray|0.051821 dim|0.051821 grey|0.051821 light|0.047852 gray|0.047852 light|0.047852 grey|0.047852 gainsboro|0.041874 light|0.040142 steel|0.040142 blue|0.040142 rosy|0.035515 brown|0.035515 tan|0.034608 lavender|0.029035 dark|0.02667 sea|0.02667 green|0.02667 white|0.023672 smoke|0.023672 ghost|0.0209 white|0.0209 alice|0.02077 blue|0.02077 lavender|0.020191 blush|0.020191 snow|0.01853 white|0.01633 sea|0.015776 shell|0.015776 light|0.013312 slate|0.013312 gray|0.013312 azure|0.01328  "
		}
	}
}
