{
	"add": {
		"doc": {
			"id": "685aded99683dba4661ca13b37c1dddecf3337965c4ad4b5a0c0d53ff494ffee",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Thylacine-sightings-western-australia.PNG/170px-Thylacine-sightings-western-australia.PNG",
				"previous": "The Australian Rare Fauna Research Association reports having 3,800 sightings on file from mainland Australia since the 1936 extinction date,[84] while the Mystery Animal Research Centre of Australia recorded 138 up to 1998, and the Department of Conservation and Land Management recorded 65 in Western Australia over the same period.[42] Independent thylacine researchers Buck and Joan Emburg of Tasmania report 360 Tasmanian and 269 mainland post-extinction 20th century sightings, figures compiled from a number of sources.[85] On the mainland, sightings are most frequently reported in Southern Victoria.[86]",
				"after": "Some sightings have generated a large amount of publicity. In 1973, Gary and Liz Doyle shot ten seconds of 8 mm film showing an unidentified animal running across a South Australian road. Attempts to positively identify the creature as a thylacine have been impossible due to the poor quality of the film.[87] In 1982 a researcher with the Tasmania Parks and Wildlife Service, Hans Naarding, observed what he believed to be a thylacine for three minutes during the night at a site near Arthur River in northwestern Tasmania. The sighting led to an extensive year-long government-funded search.[88] In 1985, Aboriginal tracker Kevin Cameron produced five photographs which appear to show a digging thylacine, which he stated he took in Western Australia.[89] In January 1995, a Parks and Wildlife officer reported observing a thylacine in the Pyengana region of northeastern Tasmania in the early hours of the morning. Later searches revealed no trace of the animal.[90] In 1997, it was reported that locals and missionaries near Mount Carstensz in Western New Guinea had sighted thylacines.[91][92] The locals had apparently known about them for many years but had not made an official report.[93] In February 2005 Klaus Emmerichs, a German tourist, claimed to have taken digital photographs of a thylacine he saw near the Lake St Clair National Park, but the authenticity of the photographs has not been established.[94] The photos were published in April 2006, fourteen months after the sighting. The photographs, which showed only the back of the animal, were said by those who studied them to be inconclusive as evidence of the thylacine's continued existence.[95] Due to the uncertainty of whether the species is still extant or not, the thylacine is sometimes regarded as a cryptid.[96][97]",
			"color": "dark|0.31681 gray|0.31681 dark|0.31681 grey|0.31681 gray|0.26388 grey|0.26388 dim|0.19514 gray|0.19514 dim|0.19514 grey|0.19514 silver|0.11038 light|0.032661 slate|0.032661 gray|0.032661 light|0.032591 gray|0.032591 light|0.032591 grey|0.032591 slate|0.028806 gray|0.028806 gainsboro|0.016508  "
		}
	}
}
