{
	"add": {
		"doc": {
			"id": "685e3d6850939c6ade4ca9bcbfca474e3f93652eff9aea6113138983d26f4c80",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Outwith.JPG/150px-Outwith.JPG",
				"previous": "Scotticisms are generally divided into two types:[25] covert Scotticisms, which generally go unnoticed as being particularly Scottish by those using them, and overt Scotticisms, usually used for stylistic effect, with those using them aware of their Scottish nature.",
			"after": [
				"Scottish English has inherited a number of lexical items from Scots,[26] which are comparatively rare in other forms of standard English.[citation needed]",
				"General items are wee, the Scots word for small (also common in New Zealand English); bairn for child (from Common Germanic,[27] cf modern Swedish, Norwegian, and Danish barn); bonnie for pretty, attractive, (or good looking, handsome, as in the case of Bonnie Prince Charlie); braw for fine; muckle for big; spail for splinter, snib for bolt, pinkie for little finger, janitor for school caretaker (these last two are also standard in American English), outwith, meaning 'outside of'; cowp for tip or spill, fankle for a tangled mess. Kirk for church has parallels in other Germanic languages (cf kirche which was also found in archaic names of some ancient churches in e.g. London). Examples of culturally specific items are Hogmanay; caber, haggis, bothy; scone; oatcake; tablet; rone (roof gutter); teuchter, ned, numpty (witless person) and landward (rural); It's your shot for \"It's your turn\"; and the once notorious but now redundant tawse."
			],
			"color": "black|0.11522 dark|0.081196 gray|0.081196 dark|0.081196 grey|0.081196 light|0.080679 slate|0.080679 gray|0.080679 slate|0.078594 gray|0.078594 dim|0.067275 gray|0.067275 dim|0.067275 grey|0.067275 gray|0.047265 grey|0.047265 brown|0.042587 firebrick|0.041045 silver|0.037207 white|0.028976 smoke|0.028976 light|0.028369 gray|0.028369 light|0.028369 grey|0.028369 sea|0.025831 shell|0.025831 gainsboro|0.025733 snow|0.025209 floral|0.02395 white|0.02395 ghost|0.02383 white|0.02383 white|0.022974 mint|0.021481 cream|0.021481 alice|0.020906 blue|0.020906 lavender|0.01819 blush|0.01819 azure|0.015902 linen|0.015451 light|0.011372 steel|0.011372 blue|0.011372 maroon|0.0093654 pale|0.008498 golden|0.008498 rod|0.008498 ivory|0.0084256 beige|0.0075661 dark|0.0071927 red|0.0071927  "
		}
	}
}
