{
	"add": {
		"doc": {
			"id": "6861f2193a0f800685315db9b0e3cc719e2fd771de8f13c2ed9313c41fc5ca99",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Rhodocene_dimerisation.svg/551px-Rhodocene_dimerisation.svg.png",
				"previous": "Rhodocene exists as [Rh(C5H5)2], a paramagnetic 19-valence electron radical monomer only at or below −196 °C (liquid nitrogen temperatures) or above 150 °C in the gas phase.[1][3][4] It is this monomeric form that displays the typical staggered metallocene sandwich structure. However, at room temperature (25 °C), the lifetime of the monomeric form in acetonitrile is less than two seconds;[1] instead, rhodocene forms [Rh(C5H5)2]2, a diamagnetic 18-valence electron bridged dimeric ansa-metallocene structure.[32] Electron spin resonance (ESR), nuclear magnetic resonance (NMR) and infrared spectroscopic (IR) measurements point to the presence of an equilibrium interconverting the monomeric and dimeric forms.[4] ESR evidence confirms that the monomer possesses a high order axis of symmetry (Cn, n > 2) with a mirror plane (σ) perpendicular to it as symmetry elements; this experimentally demonstrates that the monomer does possess the typical sandwich structure of a metallocene[3][Note 2] although the interpretation of the ESR data has been questioned.[32] The decomposition pathway of the monomer has also been studied by mass spectrometry.[33] The dimerisation is a redox process, the dimer being a rhodium(I) species whilst the monomer has a rhodium(II) metal centre.[Note 3] Rhodium typically occupies oxidation states +I or +III in its stable compounds.[34]",
				"after": "This dimerisation process has the overall effect of decreasing the electron count around the rhodium centre from 19 to 18. This occurs because the oxidative coupling of the two cyclopentadienyl ligands produces a new ligand with lower hapticity and which donates fewer electrons to the metal centre. The term hapticity is used to indicate the \"number of carbon (or other) atoms through which [a ligand] binds (n)\"[35] to a metal centre and is symbolised as ηn. For example, the ethylene ligand in Zeise's salt is bound to the platinum centre through both carbon atoms, and it hence formally has the formula K[PtCl3(η2-C2H4)]·H2O. The carbonyl ligands in nickel tetracarbonyl are each bound through only a carbon atom and are hence described as monohapto ligands, but η1-notations are typically omitted in formulae. The cyclopentadienyl ligands in many metallocene and half-sandwich compounds are pentahapto ligands, hence the formula [Rh(η5-C5H5)2] for the rhodocene monomer. In the rhodocene dimer, the coupled cyclopentadienyl ligands are 4-electron tetrahapto donors to each rhodium(I) metal centre, in contrast to the 6-electron[Note 4] pentahapto cyclopentadienyl donors. The increased stability of the 18-valence electron rhodium(I) dimer species as compared to the 19-valence electron rhodium(II) monomer likely explains why the monomer is only detected under extreme conditions.[1][4]",
			"color": "black|0.15312 white|0.073938 smoke|0.073938 ghost|0.072413 white|0.072413 alice|0.072413 blue|0.072413 lavender|0.072413 blush|0.072413 snow|0.07208 sea|0.07208 shell|0.07208 white|0.071771 mint|0.071353 cream|0.071353 floral|0.070523 white|0.070523 azure|0.069898 dim|0.028647 gray|0.028647 dim|0.028647 grey|0.028647 dark|0.027206 gray|0.027206 dark|0.027206 grey|0.027206 gray|0.024286 grey|0.024286 silver|0.019994 light|0.013312 gray|0.013312 light|0.013312 grey|0.013312 gainsboro|0.011843 linen|0.0027116  "
		}
	}
}
