{
	"add": {
		"doc": {
			"id": "68667c912f53a400a9878d9f8f9c07ef0debd2550f8cb1fe21a049e8d9dfdab5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/ASEM.PNG/300px-ASEM.PNG",
				"previous": "The Russian concept of “Eurasia” is very different from the European one. It is a view that has older roots than the European one - not surprisingly, considering Russia's geographic position[citation needed]. Russian politologists traditionally view Russia itself, being both European and Asian, as “Eurasian.” The geopolitical area of the Russian concept of “Eurasia” corresponded initially more or less to the land area of Imperial Russia in 1914, including parts of Eastern Europe.[10] There is undeniably an influence of Panslavism in this definition; originally the idea of “Eurasia” was more romantically rooted in natural geography. It was the idea that the people scattered across the land called “Eurasia” shared common spiritual values due to its geographic traits, such as a flat land with few coastlines but important rivers, a particular climate (continental, often harshly so), and a certain landscape (steppe, taiga, tundra). This idea was more or less realised, but with difficulty, during the last phases of the Russian Empire and was then realised again with the Soviet Union after 1945, though not stably enough for enduring success. Today, though this Russian geopolitical interest still exists, the physical area of the Russian “Eurasia” is now more realistically assessed. The Russian view today is that “Eurasia” consists of the land lying between Europe and Asia proper; namely, those made up of Western and Central Russia, Belarus, Ukraine, part of Caucasus, Uzbekistan, Kazakhstan, Tajikistan, and Kyrgyzstan (see Eurasian Economic Union). Just as in the case of the European concept of “Eurasia,” the Russian version of “Eurasia” is a geopolitical interest that underpins foreign policy in that part of the world. Thus, it is not surprising that today one of Russia's main geopolitical interests lies in ever closer integration with those countries that it considers part of “Eurasia.”[11]",
				"after": "Every two years since 1996 a meeting of most Asian and European countries is organised as the Asia-Europe Meeting (ASEM).",
			"color": "blue|0.98284 medium|0.014046 slate|0.014046 blue|0.014046  "
		}
	}
}
