{
	"add": {
		"doc": {
			"id": "687df67cf52c10e254e5d5070b8d125dbb83a55e9e31e5062ffdb185f8b43828",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Oryzomys_distribution_Goldman.png/500px-Oryzomys_distribution_Goldman.png",
				"previous": "Edward Alphonso Goldman revised North American Oryzomys in 1918 and consolidated many forms into a single species Oryzomys couesi, with ten subspecies distributed from southern Texas and western Mexico south to Costa Rica. He placed it in an Oryzomys palustris group with the marsh rice rat and several species with more limited distributions, which he regarded as related to O. couesi but distinctive enough to be classified as separate species.[17] In the 1930s, a few more forms related to O. couesi were described.[4] As then recognized, the ranges of the marsh rice rat, a United States species, and Oryzomys couesi meet in southern Texas. In 1960, Raymond Hall reviewed specimens from this contact zone and found no grounds on which to separate the two species; thus, he reduced O. couesi to a subspecies of the marsh rice rat.[18] Other workers continued this lumping and by 1971 all other species Goldman had placed in the O. palustris group were classified under the marsh rice rat, together with Oryzomys azuerensis from Panama, described as a species in 1937.[4]",
				"after": "Additional studies of the palustris–couesi contact zone in Texas published in 1979, using more specimens and characters, indicated that the two species are in fact easily distinguishable there; therefore, O. couesi has since been regarded as a species distinct from the marsh rice rat.[4] Afterward, some of the other forms synonymized under O. couesi or O. palustris were resurrected as separate species—Oryzomys nelsoni from the Marías Islands, western Mexico, and Oryzomys antillarum from Jamaica.[20] In 2009, Michael Carleton and Joaquin Arroyo-Cabrales reviewed western Mexican Oryzomys, reaffirmed the distinctness of O. nelsoni, and reinstated O. peninsulae from the tip of the Baja California Peninsula and O. albiventer from interior Mexico as species.[21] Still, O. couesi included 22 synonyms,[22] and Carleton and Arroyo-Cabrales wrote that further research on O. couesi and related species would certainly result in the recognition of additional species.[23]",
			"color": "wheat|0.59503 pale|0.22001 golden|0.22001 rod|0.22001 moccasin|0.11696 navajo|0.046141 white|0.046141 tan|0.021185  "
		}
	}
}
