{
	"add": {
		"doc": {
			"id": "688f4af6a6cf857c501cb686e9ab1ff79d8a642d1c4e2272e7c87efd0b1221bf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Gulfair.a340-300.a40-lj.arp.jpg/220px-Gulfair.a340-300.a40-lj.arp.jpg",
				"previous": "The new summer schedule commencing 28 April 2006 saw the complete withdrawal from Abu Dhabi as a hub following the decision on 13 September 2005 by the Emirate of Abu Dhabi to withdraw from Gulf Air and establish its own airline, Etihad Airways.[6] Gulf Air changed its operations to a dual hub basis between Bahrain and Muscat airports. The airline produced a series of adverts in local newspapers thanking Abu Dhabi for its contribution to Gulf Air. Due to the airline being the national carrier for the United Arab Emirates for over 35 years, it has a large customer base located in Abu Dhabi. Gulf Air endeavoured to show the continuing support for flights to Abu Dhabi from Bahrain and Muscat, connecting to the rest of the Gulf Air network, via advertisements placed in local newspapers.",
				"after": "James Hogan resigned as President and Chief Executive Officer as of 1 October 2006 and has since taken the position of CEO at rival airline Etihad. Ahmed Al Hammadi was named acting chief executive officer until Swiss national André Dosé, the former chief executive officer of Crossair and Swiss International Air Lines, began on 1 April 2007. A few days later, Dosé announced a BD310 million (USD825 million) restructuring plan that included originating or terminating all flights in Bahrain, ceasing routes to Johannesburg, Dublin, Jakarta, Singapore, Hong Kong and Sydney; eliminating all Boeing 767s from the fleet; phasing out the Airbus A340-300 from the fleet; introducing the Airbus A321 in July 2007 and the Airbus A330-300 in 2009; and terminating employees based on performance and without regard for nationality. This led to some employees applying for jobs in other airlines and, in less than a month, Gulf Air lost 500 persons from its workforce, prompting the airline to rule out mass layoffs as part of its recovery plan, except for performance reasons.",
			"color": "dark|0.60529 gray|0.60529 dark|0.60529 grey|0.60529 light|0.10346 slate|0.10346 gray|0.10346 dim|0.049427 gray|0.049427 dim|0.049427 grey|0.049427 light|0.043265 steel|0.043265 blue|0.043265 black|0.042485 gray|0.027523 grey|0.027523 silver|0.02613 light|0.017357 gray|0.017357 light|0.017357 grey|0.017357 gainsboro|0.014575 slate|0.0089117 gray|0.0089117 white|0.0077937 smoke|0.0077937 linen|0.0065742 sea|0.0062965 shell|0.0062965  "
		}
	}
}
