{
	"add": {
		"doc": {
			"id": "689285592d964fceb9a571e9ebb108f6b63c3cefc979c73ec4680206056d9159",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Antennaria_plantaginifolia.jpg/220px-Antennaria_plantaginifolia.jpg",
				"previous": "Stebbins was born in Lawrence, New York, the youngest of three children. His parents were George Ledyard Stebbins, a wealthy real estate financier who developed Seal Harbor, Maine and helped to establish Acadia National Park, and Edith Alden Candler Stebbins; both parents were native New Yorkers and Episcopalians. Stebbins was known throughout his life as Ledyard, to distinguish himself from his father. The family encouraged their sons' interest in natural history during their periodic journeys to Seal Harbor. In 1914, Edith contracted tuberculosis and the Stebbins moved to Santa Barbara, California to improve her health. In California, Stebbins was enrolled at the Cate School in Carpinteria where he became influenced by Ralph Hoffmann, an American natural history instructor and amateur ornithologist and botanist.[3] After graduating from high school, he embarked on a major in political studies at Harvard. By the third year of his undergraduate study, he had decided to major in botany.[4]",
				"after": "Stebbins started graduate studies at Harvard in 1928, initially working on flowering plant taxonomy and biogeography—particularly that of the flora of New England—with Merritt Lyndon Fernald. He completed his MA in 1929 and continued to work toward his Ph.D. He became interested in using chromosomes for taxonomic studies, a method that Fernald did not support. Stebbins chose to concentrate his doctoral work on the cytology of plant reproductive processes in the genus Antennaria, with cytologist E. C. Jeffrey as his supervisor and Fernald on his supervisory panel. During his Ph.D. candidature, Stebbins sought advice and supervision from geneticist Karl Sax. Sax identified several errors in Stebbins's work and disapproved of his interpretation of results that, while in accordance with Jeffrey's views, were inconsistent with the work of contemporary geneticists. Jeffrey and Sax argued over Stebbins's dissertation, and the thesis was revised numerous times to accommodate their differing views.[5]",
			"color": " "
		}
	}
}
