{
	"add": {
		"doc": {
			"id": "68986ecfb405e7b255b43a15c494c3772ef33a8120753755cb885a062993e957",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Bramall_19c.JPG/220px-Bramall_19c.JPG",
			"previous": [],
				"after": "The Great Hall is the central part of Bramall Hall. As with typical great halls in the Middle Ages, this would have been the room where the business of the house, estate and its villagers was conducted as well as a communal eating room for the household. It was originally an open-roofed, single-storey building,[67] with a fireplace situated in the middle of the floor.[3] It was probably first built around the end of the 14th century when the Davenports became lords of the manor.[69] Towards the end of the 16th century, the Great Hall was substantially rebuilt, and the Withdrawing Room was created above it. A long gallery was also added as a third storey.[16] The history of the gallery is uncertain; it was intact in 1790 but was taken down before 1819,[70] because it was believed to be unsafe.[27] A similar gallery was built at Little Moreton Hall, and it is still intact, causing the lower storeys to buckle under the weight.[15] The Great Hall has a bay window with leaded windows, common throughout the building.[71] William Harrison Ainsworth wrote about a right of way through the Great Hall, in his 1834 novel Rookwood. He described how a traveller could pass through the Great Hall, and be entertained and sometimes refreshed. He described Bramall as \"[the] best specimen of its class ... its class, in our opinion, is the best ... to be met with in Cheshire\".[72] No evidence exists for any such right of way. According to another tale, food from the buttery hatch was given to the poor who congregated outside.[71]",
			"color": "dim|0.54594 gray|0.54594 dim|0.54594 grey|0.54594 gray|0.26198 grey|0.26198 dark|0.1107 gray|0.1107 dark|0.1107 grey|0.1107 silver|0.037187 light|0.014336 gray|0.014336 light|0.014336 grey|0.014336 black|0.011407 gainsboro|0.0094279  "
		}
	}
}
