{
	"add": {
		"doc": {
			"id": "68a8e561456ab78884370ec6471022309ce2553bd9bcf100aec7a528df46624b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Edmontosaurus_jaw.jpg/220px-Edmontosaurus_jaw.jpg",
				"previous": "Before the 1960s and 1970s, the prevailing interpretation of hadrosaurids like Edmontosaurus was that they were aquatic and fed on aquatic plants.[74] An example of this is William Morris's 1970 interpretation of an edmontosaur skull with nonbony beak remnants. He proposed that the animal had a diet much like that of some modern ducks, filtering plants and aquatic invertebrates like mollusks and crustaceans from the water and discharging water via V-shaped furrows along the inner face of the upper beak.[12] This interpretation of the beak has been rejected, as the furrows and ridges are more like those of herbivorous turtle beaks than the flexible structures seen in filter-feeding birds.[74]",
				"after": "Between the mid-1980s and the first decade of the 2000s, the prevailing interpretation of how hadrosaurids processed their food followed the model put forward in 1984 by David B. Weishampel. He proposed that the structure of the skull permitted motion between bones that resulted in backward and forward motion of the lower jaw, and outward bowing of the tooth-bearing bones of the upper jaw when the mouth was closed. The teeth of the upper jaw would grind against the teeth of the lower jaw like rasps, processing plant material trapped between them.[8][75] Such a motion would parallel the effects of mastication in mammals, although accomplishing the effects in a completely different way.[76] Work in the early 2000s has challenged the Weishampel model. A study published in 2008 by Casey Holliday and Lawrence Witmer found that ornithopods like Edmontosaurus lacked the types of skull joints seen in those modern animals that are known to have kinetic skulls (skulls that permit motion between their constituent bones), such as squamates and birds. They proposed that joints that had been interpreted as permitting movement in dinosaur skulls were actually cartilaginous growth zones.[77] An important piece of evidence for Weishampel's model is the orientation of scratches on the teeth, showing the direction of jaw action. Other movements could produce similar scratches, though, such as movement of the bones of the two halves of the lower jaw. Not all models have been scrutinized under present techniques.[77] Vincent Williams and colleagues (2009) published additional work on hadrosaurid tooth microwear. They found four classes of scratches on Edmontosaurus teeth. The most common class was interpreted as resulting from an oblique motion, not a simple up-down or front-back motion, which is consistent with the Weishampel model. This motion is thought to have been the primary motion for grinding food. Two scratch classes were interpreted as resulting from forward or backward movement of the jaws. The other class was variable and probably resulted from opening the jaws. The combination of movements is more complex than had been previously predicted.[78]",
			"color": "dim|0.2131 gray|0.2131 dim|0.2131 grey|0.2131 gray|0.20828 grey|0.20828 dark|0.13882 gray|0.13882 dark|0.13882 grey|0.13882 silver|0.066056 antique|0.061924 white|0.061924 light|0.040813 gray|0.040813 light|0.040813 grey|0.040813 linen|0.028541 gainsboro|0.025043 old|0.024407 lace|0.024407 papaya|0.022823 whip|0.022823 beige|0.021446 tan|0.020845 sea|0.016272 shell|0.016272 floral|0.01594 white|0.01594  "
		}
	}
}
