{
	"add": {
		"doc": {
			"id": "68af47f14517844b05604cc3c9d4d2eacce3107d4c0a44170ed63b75746d6a00",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Miller_Park.jpg/220px-Miller_Park.jpg",
				"previous": "Wisconsin is represented by major league teams in three sports: football, baseball, and basketball. Lambeau Field, located in Green Bay, Wisconsin, is home to the National Football League's Green Bay Packers. The Packers have been part of the NFL since the league's second season in 1921 and hold the record for the most NFL titles, earning the city of Green Bay the nickname \"Titletown USA\". The Packers are the smallest city franchise in the NFL, and is the only one owned by shareholders statewide. The franchise was founded by \"Curly\" Lambeau who played and coached for them. The Green Bay Packers are one of the most successful small-market professional sports franchises in the world and have won 13 NFL championships, including the first two AFL-NFL Championship games (Super Bowls I and II), Super Bowl XXXI and Super Bowl XLV. The state's support of the team is evidenced by the 81,000-person waiting list for season tickets to Lambeau Field.[114]",
				"after": "The Milwaukee Brewers, the state's only major league baseball team, play in Miller Park in Milwaukee, the successor to Milwaukee County Stadium since 2001. In 1982, the Brewers won the American League Championship, marking their most successful season. The team switched from the American League to the National League starting with the 1998 season. Before the Brewers, Milwaukee had two prior Major League teams. The first team, also called the Brewers, played only one season in the newly founded American League in 1901 before moving to St. Louis and becoming the Browns, who are now the Baltimore Orioles. Milwaukee was also the home of the Braves franchise when they moved from Boston from 1953 to 1965, winning the World Series in 1957 and the National League pennant in 1958, before they moved to Atlanta.[115]",
			"color": "dark|0.61544 olive|0.61544 green|0.61544 dim|0.14696 gray|0.14696 dim|0.14696 grey|0.14696 gray|0.094189 grey|0.094189 dark|0.043722 gray|0.043722 dark|0.043722 grey|0.043722 black|0.021942 slate|0.021075 gray|0.021075 light|0.015382 slate|0.015382 gray|0.015382 silver|0.011772 dark|0.0081955 slate|0.0081955 gray|0.0081955  "
		}
	}
}
