{
	"add": {
		"doc": {
			"id": "68b08bdc970529184c663b3a4fee6980d2e34634ea797a2e09d01942b51f04ef",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Aeroflot_Tupolev_Tu-104B_at_Arlanda%2C_July_1972.jpg/220px-Aeroflot_Tupolev_Tu-104B_at_Arlanda%2C_July_1972.jpg",
				"previous": "Aeroflot's route network had extended to 295,400 kilometres (183,600 mi) by 1950, and it carried 1,603,700 passengers, 151,070 tonnes (333,050,000 lb) of freight and 30,580 tonnes (67,420,000 lb) of mail during the same year. Night flights began in the same year, and the 5th Five-Year Plan, covering the period 1951–1955, emphasised Aeroflot expanding night-time operations, which vastly improved aircraft utilisation. By 1952, some 700 destinations around the Soviet Union received regular flights from Aeroflot.[10]:20 On 30 November 1954, the Ilyushin Il-14 entered service, and the aircraft took a leading role in the operation of Aeroflot's all-Union services. The number of passengers carried in 1955 increased to 2,500,000, whilst freight and mail carriage also increased, to 194,960 and 63,760 tons, respectively. By this time, Aeroflot's route network covered a distance of some 321,500 kilometres (199,800 mi).[10]:21",
				"after": "The 20th Communist Party Congress, held in 1956, saw plans for Aeroflot services to be dramatically increased. The airline would see its overall activities increased from its then current levels by 3.8 times, and it was set the target of the carriage of 16,000,000 passengers by 1960. In order to meet these goals, Aeroflot introduced higher capacity turbojet and turbine-prop aircraft on key domestic routes, and on services to Aeroflot destinations abroad. A major step for Aeroflot occurred on 15 September 1956 when the Tupolev Tu-104 jet airliner entered service on the Moscow-Omsk-Irkutsk route, marking the world's first sustained jet airline service. The airline began international flights with the type on 12 October 1956 under the command of Boris Bugayev with flights from Moscow to Prague. The aircraft placed Aeroflot in an envious position, as airlines in the West had operated throughout the 1950s with large piston-engined aircraft.[10]:21[11]:44[12] By 1958 the route network covered 349,200 kilometres (217,000 mi), and the airline carried 8,231,500 passengers, and 445,600 tons of mail and freight, with fifteen percent of all-Union services being operated by jet aircraft.[10]:23",
			"color": "dim|0.5038 gray|0.5038 dim|0.5038 grey|0.5038 gray|0.13707 grey|0.13707 dark|0.063569 gray|0.063569 dark|0.063569 grey|0.063569 light|0.056942 slate|0.056942 gray|0.056942 light|0.053362 steel|0.053362 blue|0.053362 slate|0.049614 gray|0.049614 dark|0.015383 slate|0.015383 gray|0.015383 black|0.013241 lavender|0.010758 alice|0.009656 blue|0.009656 silver|0.0088046 ghost|0.0086567 white|0.0086567 white|0.00856 smoke|0.00856 light|0.007598 gray|0.007598 light|0.007598 grey|0.007598 gainsboro|0.0073029 azure|0.0069265 snow|0.006911 white|0.0067003 mint|0.0061532 cream|0.0061532 lavender|0.0045219 blush|0.0045219 sea|0.0044318 shell|0.0044318 floral|0.0039569 white|0.0039569  "
		}
	}
}
