{
	"add": {
		"doc": {
			"id": "68b5f3c7b93147291685f9d709380bd12aae7b8a1fb5bc7b604ab4a9ed983d76",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/China_Pop_Density.svg/300px-China_Pop_Density.svg.png",
				"previous": "Chinese history is often explained in terms of several strategic areas, defined by particular topographic limits. Starting from the Chinese central plain, the former heart of the Han populations, the Han people expanded militarily and then demographically toward the Loess Plateau, the Sichuan Basin, and the Southern hills (as defined by the map on the left), not without resistance from local populations. Pushed by its comparatively higher demographic growth, the Han continued their expansion by military and demographic waves. The far-south of present-day China, the northern parts of today's Vietnam, and the Tarim Basin were first reached and durably subdued by the Han Dynasty's armies. The Northern steppes were always the source of invasions into China, which culminated in the 13th century by Mongolian conquest of the whole China and creation of Mongolian Yuan dynasty. Manchuria, much of today's Northeast China, and Korean Peninsula were usually not under Chinese control, with the exception of some limited periods of occupation. Manchuria became strongly integrated into the Chinese empire during the late Qing Dynasty, while the west side of the Changbai Mountains, formerly the home of Korean tribes, thus also entered China.",
				"after": "The demographic occupation follows the topography and availability of former arable lands. The Heihe–Tengchong Line, running from Heihe, Heilongjiang to Tengchong County, Yunnan divides China into two roughly equal sections–in terms of geographic area, with areas west of the line being sparsely settled and areas east densely populated, in general.",
			"color": "misty|0.56747 rose|0.56747 pink|0.099518 light|0.090544 coral|0.090544 salmon|0.086962 red|0.05337 rosy|0.016813 brown|0.016813 dark|0.014938 gray|0.014938 dark|0.014938 grey|0.014938 indian|0.011969 red|0.011969 gray|0.0098126 grey|0.0098126 brown|0.0096523 firebrick|0.0094451 maroon|0.007082 dark|0.0063518 red|0.0063518 silver|0.0055945  "
		}
	}
}
