{
	"add": {
		"doc": {
			"id": "6904b052675ac0879aaf6baed304947a0dc151d79425ab9991dbaa05304982c1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Threatened_kincaids_lupine_flower.jpg/170px-Threatened_kincaids_lupine_flower.jpg",
				"previous": "Camas pocket gophers cause significant economic losses, so may be treated as an agricultural pest. Crops damaged include clover, alfalfa and vetch.[50] The gophers may eat these crops or damage the roots while burrowing. This can injure the roots and expose them to air, causing them to dry out. Subterranean activity can also damage the roots of fruit trees. Root crops are particularly susceptible to damage and consumption; potatoes, carrots, parsnips and other crops may be eaten on site or dragged off by the gopher for caching in the burrow. Excavated soil can cover grass and limit lifestock grazing; freshly sprouted grains may be similarly damaged.[50] An estimate of impact from camas pocket gopher activities in the Willamette Valley in 1918 amounted to $1.5 million annual losses.[50] Gopher activities can provide a benefit of soil aeration, enhancing water retention after rain or snowmelt. Buried vegetation can also compost, enhancing organic soil content to provide additional benefits.[55]",
				"after": "Proposed methods for controlling gopher populations in agricultural areas include poisoning dandelions,[50] clover, carrots, sweet potatoes and parsnips.[10] Camas pocket gophers are larger than other gophers, so conventional gopher traps may fail to capture them.[10] Toxic baits and fumigants may also fail, since the gophers will sometimes wall off a segment of the burrow.[10] Gophers may also cause local flooding if their tunneling activities damage levees.[55]",
			"color": "olive|0.4219 drab|0.4219 dark|0.31506 olive|0.31506 green|0.31506 thistle|0.046695 dark|0.041365 khaki|0.041365 rosy|0.024489 brown|0.024489 plum|0.024236 dark|0.021042 gray|0.021042 dark|0.021042 grey|0.021042 gray|0.013514 grey|0.013514 silver|0.01142  "
		}
	}
}
