{
	"add": {
		"doc": {
			"id": "69136ddc596fffa0c8e9db8f5c98e149a09dfb7a10c50d83835c7122d1b6b3e7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Coragyps_atratus.jpg/220px-Coragyps_atratus.jpg",
				"previous": "Like the turkey vulture, this vulture is often seen standing in a spread-winged stance.[28] The stance is believed to serve multiple functions: drying the wings, warming the body, and baking off bacteria. This same behavior is displayed by other New World vultures, Old World vultures, and storks.[41]",
				"after": "In natural settings, the black vulture eats mainly carrion.[42] In areas populated by humans, it may scavenge at garbage dumps, but also takes eggs and decomposing plant material and can kill or injure newborn or incapacitated mammals. Like other vultures, it plays an important role in the ecosystem by disposing of carrion which would otherwise be a breeding ground for disease.[43] The black vulture locates food either by sight or by following New World vultures of the genus Cathartes to carcasses. These vultures—the turkey vulture, the lesser yellow-headed vulture, and the greater yellow-headed vulture— forage by smell, an ability which is uncommon in the avian world. They fly low to the ground to pick up the scent of ethyl mercaptan, a gas produced by the beginnings of decay in dead animals.[44] Their heightened ability to detect odors allows them to search for carrion below the forest canopy.[41] King vultures and black vultures, which lack the ability to smell carrion, follow them to carcasses.[43] It is aggressive when feeding, and may chase the slightly larger turkey vulture from carcasses.[42]",
			"color": "dark|0.16303 gray|0.16303 dark|0.16303 grey|0.16303 gray|0.12168 grey|0.12168 dim|0.11399 gray|0.11399 dim|0.11399 grey|0.11399 black|0.11104 silver|0.10565 light|0.064828 gray|0.064828 light|0.064828 grey|0.064828 gainsboro|0.043689 antique|0.022941 white|0.022941 tan|0.019803 slate|0.018018 gray|0.018018 light|0.017661 slate|0.017661 gray|0.017661 linen|0.015507 white|0.014068 smoke|0.014068 sea|0.013636 shell|0.013636 floral|0.011989 white|0.011989 old|0.01167 lace|0.01167 snow|0.010815 papaya|0.009618 whip|0.009618 white|0.008525 ghost|0.0084484 white|0.0084484 blanched|0.0083076 almond|0.0083076  "
		}
	}
}
