{
	"add": {
		"doc": {
			"id": "691d3dde91c130f8f6889fedc9e40eff075187f7a2744557e36b581039e4d1f4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Driving_Google_Self-Driving_Car.jpg/220px-Driving_Google_Self-Driving_Car.jpg",
				"previous": "Other projects Google has worked on include a new collaborative communication service, a web browser, and a mobile operating system. The first of these was first announced on May 27, 2009. The company described Google Wave as a product that helps users communicate and collaborate on the web. The service is Google's \"email redesigned\", with realtime editing, the ability to embed audio, video, and other media, and extensions that further enhance the communication experience. Google Wave was initially in a developer's preview, where interested users had to be invited to test the service, but was released to the public on May 19, 2010, at Google's I/O keynote. On September 1, 2008, Google pre-announced the upcoming availability of Google Chrome, an open source web browser,[219] which was then released on September 2, 2008. On July 7, 2009, Google announced Google Chrome OS, an open source Linux-based operating system that includes only a web browser and is designed to log users into their Google account.[220][221]",
				"after": "Google Goggles is a mobile application available on Android and iOS used for image recognition and non-text-based search. In addition to scanning QR codes, the app can recognize historic landmarks, import business cards, and solve Sudoku puzzles.[222] While Goggles could originally identify people as well, Google has limited that functionality as a privacy protection.[223]",
			"color": "black|0.27394 dark|0.13072 gray|0.13072 dark|0.13072 grey|0.13072 silver|0.12527 light|0.072364 gray|0.072364 light|0.072364 grey|0.072364 dim|0.060549 gray|0.060549 dim|0.060549 grey|0.060549 gray|0.055878 grey|0.055878 gainsboro|0.04941 slate|0.019772 gray|0.019772 white|0.019124 smoke|0.019124 light|0.015761 slate|0.015761 gray|0.015761 snow|0.015745 ghost|0.015661 white|0.015661 alice|0.015022 blue|0.015022 sea|0.01495 shell|0.01495 white|0.014654 mint|0.013623 cream|0.013623 floral|0.013347 white|0.013347 azure|0.012617 lavender|0.010939 blush|0.010939 light|0.010761 steel|0.010761 blue|0.010761 linen|0.0088643 lavender|0.0079915  "
		}
	}
}
