{
	"add": {
		"doc": {
			"id": "693fa9d29ec235489b140e9960a4729cb194b4273d7a753df454071c0c264c23",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/St_Paul_Birmingham.jpg/170px-St_Paul_Birmingham.jpg",
				"previous": "Boulton was widely involved in civic activities in Birmingham. His friend Dr John Ash had long sought to build a hospital in the town. A great fan of the music of Handel, Boulton conceived of the idea to hold a music festival in Birmingham to raise funds for the hospital. The festival took place in September 1768, the first of a series stretching well into the twentieth century.[98] The hospital opened in 1779. Boulton also helped build the General Dispensary, where outpatient treatment could be obtained.[98] A firm supporter of the Dispensary, he served as treasurer, and wrote, \"If the funds of the institution are not sufficient for its support, I will make up the deficiency.\"[99] The Dispensary soon outgrew its original quarters, and a new building in Temple Row was opened in 1808, shortly before Boulton's death.[99]",
				"after": "Boulton helped found the New Street Theatre in 1774, and later wrote that having a theatre encouraged well-to-do visitors to come to Birmingham, and to spend more money than they would have otherwise.[98] Boulton attempted to have the theatre recognised as a patent theatre with a Royal Patent, entitled to present serious drama; he failed in 1779 but succeeded in 1807.[100] He also supported Birmingham's Oratorio Choral Society, and collaborated with button maker and amateur musical promoter Joseph Moore to put on a series of private concerts in 1799. He maintained a pew at St Paul's Church, Birmingham, a centre of musical excellence.[98] When performances of the Messiah were organised at Westminster Abbey in 1784 in the (incorrect) belief it was the centennial of Handel's birth and the (correct) belief that it was the 25th anniversary of his death, Boulton attended and wrote, \"I scarcely know which was grandest, the sounds or the scene. Both was transcendibly fine that it is not in my power of words to describe. In the grand Halleluja my soul almost ascended from my body.\"[101]",
			"color": "dim|0.23215 gray|0.23215 dim|0.23215 grey|0.23215 light|0.1511 steel|0.1511 blue|0.1511 gray|0.11115 grey|0.11115 black|0.09766 dark|0.096686 olive|0.096686 green|0.096686 dark|0.080099 gray|0.080099 dark|0.080099 grey|0.080099 light|0.056555 sky|0.056555 blue|0.056555 light|0.036431 slate|0.036431 gray|0.036431 slate|0.031645 gray|0.031645 silver|0.029555 light|0.027413 blue|0.027413 dark|0.0090393 slate|0.0090393 gray|0.0090393 light|0.0080902 gray|0.0080902 light|0.0080902 grey|0.0080902  "
		}
	}
}
