{
	"add": {
		"doc": {
			"id": "694927096f84c1c0fcf1ee656f8a0b18852633e395fa9f52500a47ce6aead9da",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/St_Paul%27s_Church%2C_Scotforth.jpg/220px-St_Paul%27s_Church%2C_Scotforth.jpg",
				"previous": "Sharpe's early Gothic Revival works were pre-archaeological, including Holy Trinity, Blackburn, built in 1837–46 for Revd JW Whittaker.[52] Hughes expresses the opinion that this church is Sharpe's pièce de resistance,[53] it contains \"a mongrel mix of Gothic styles\".[54][C] Simultaneously Sharpe was involved in the design of about twelve more churches in Northwest England, which increasingly incorporated more \"correct\" Gothic features.[55] In 1841 he obtained a contract to build three churches and associated structures (vicarages and schools) for the Weaver Navigation Trustees, at Weston Point, Runcorn; Castle, Northwich; and Winsford. All three were in Cheshire, and built between 1841 and 1844.[56] Between 1835 and 1842 Sharpe designed about 30 new churches in Lancashire and Cheshire, all to a low budget, and all to a degree pre-archaeological.[57] In 1843 Sharpe was able to fulfil his promise to build a church for the Earl of Derby; this was St Mary, Knowsley, which was completed and consecrated the following year.[58] It is described by Hughes as \"one of Sharpe's loveliest creations\".[59] About the same time he designed a new steeple for St Michael, Kirkham;[60] the steeple and St Mary's Church contained much more in the way of \"correct\" Gothic features, and both were praised by the Camden Society in The Ecclesiologist.[61]",
				"after": "In the early 1840s Sharpe was invited by John Fletcher, his future brother-in-law, to build a church near Fletcher's home in Little Bolton. Fletcher was the owner of a coal mine at Ladyshore, Little Lever, overlooking the River Irwell and the Manchester, Bolton & Bury Canal. He had been using the clay which came up with the coal to make refractory bricks for furnaces, and suggested its use for building the church, as it was much cheaper than stone. Sharpe then designed the first church in England to be built, in whole or in part, from this material (terracotta), St Stephen and All Martyrs, Lever Bridge (1842–44).[62] As terracotta is commonly used to make plant pots and the like, Sharpe himself called this church, and its two successors, \"the pot churches\", a nickname that has stuck. The advantages of terracotta were its cheapness, its sturdiness as a building material, and the fact that it could be moulded into almost any shape. It could therefore be used for walls, towers, arches, and arcades in a church, for the detailed decoration of capitals and pinnacles, and also, as at St Stephen's, for the furnishings, such as the altar, pulpit, font, organ case, and the pew ends. Apart from the foundations and the rubble within the walls, St Stephen and All Martyrs was constructed entirely from terracotta.[63][D] The following year, a second church was built using the same material, Trinity Church, Rusholme, south of Manchester (1845–46), built and paid for by Thomas Carill-Worsley, who lived at nearby Platt Hall. In this case, although the exterior is in terracotta, the interior is of plastered brick. The church was consecrated in June 1846, although at the time work on the spire had not yet started and several other features were incomplete, including the heating, seating, and floor tiling.[1][64][65][E]",
			"color": "gray|0.34155 grey|0.34155 dim|0.26979 gray|0.26979 dim|0.26979 grey|0.26979 dark|0.15538 gray|0.15538 dark|0.15538 grey|0.15538 black|0.087096 dark|0.06601 olive|0.06601 green|0.06601 silver|0.035259  "
		}
	}
}
