{
	"add": {
		"doc": {
			"id": "695cb0e252ba1b7fb83943e6123ce0ec7668d55055d1983bd35d47f55bad6b41",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Noogler.png/170px-Noogler.png",
				"previous": "In 2007 and early 2008, several top executives left Google. In October 2007, former chief financial officer of YouTube Gideon Yu joined Facebook[244] along with Benjamin Ling, a high-ranking engineer.[245] In March 2008, Sheryl Sandberg, then vice-president of global online sales and operations, began her position as chief operating officer of Facebook.[246] At the same time, Ash ElDifrawi, formerly head of brand advertising, left to become chief marketing officer of Netshops.[247] On April 4, 2011, Larry Page became CEO and Eric Schmidt became Executive Chairman of Google.[248] In July 2012, Google's first female employee, Marissa Mayer, left Google to become Yahoo!'s CEO.[249]",
				"after": "As a motivation technique, Google uses a policy often called Innovation Time Off, where Google engineers are encouraged to spend 20% of their work time on projects that interest them. Some of Google's newer services, such as Gmail, Google News, Orkut, and AdSense originated from these independent endeavors.[251] In a talk at Stanford University, Marissa Mayer, Google's Vice President of Search Products and User Experience until July 2012, showed that half of all new product launches in the second half of 2005 had originated from the Innovation Time Off.[252]",
			"color": "dark|0.15623 gray|0.15623 dark|0.15623 grey|0.15623 rosy|0.15105 brown|0.15105 silver|0.11528 sea|0.10613 green|0.10613 gray|0.085466 grey|0.085466 light|0.081995 gray|0.081995 light|0.081995 grey|0.081995 gainsboro|0.056995 dodger|0.047049 blue|0.047049 corn|0.039754 flower|0.039754 blue|0.039754 dim|0.029826 gray|0.029826 dim|0.029826 grey|0.029826 light|0.024274 slate|0.024274 gray|0.024274 slate|0.022157 gray|0.022157 khaki|0.015896 salmon|0.0086925 royal|0.0086317 blue|0.0086317 tomato|0.0082062 crimson|0.0068081  "
		}
	}
}
