{
	"add": {
		"doc": {
			"id": "695db1905b4ee37c2ba6ca37d3152313534a4570eacae8d02c220a3e1aba7653",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Relief_sculpture_of_the_Hindu_god_Narayana_with_his_consort_Lakshmi_%28Lakshminarayana%29_in_the_Hoysaleshwara_temple_at_Halebidu.jpg/170px-Relief_sculpture_of_the_Hindu_god_Narayana_with_his_consort_Lakshmi_%28Lakshminarayana%29_in_the_Hoysaleshwara_temple_at_Halebidu.jpg",
			"previous": {
				"_ArrayType_": "double",
				"_ArraySize_": [0,0],
				"_ArrayData_": null
			},
				"after": "Hinduism is a combination of secular and sacred beliefs, rituals, daily practices and traditions that has evolved over the course of over two thousand years and embodies complex symbolism combining the natural world with philosophy. Hindu temples began as simple shrines housing a deity and by the time of the Hoysalas had evolved into well articulated edifices in which worshippers sought transcendence of the daily world. Hoysala temples were not limited to any specific organised tradition of Hinduism and encouraged pilgrims of different Hindu devotional movements. The Hoysalas usually dedicated their temples to Lord Shiva or to Lord Vishnu (two of the major Hindu gods), but they occasionally chose a different deity. Worshippers of Shiva are called Shaivas or Lingayats and worshippers of Vishnu are called Vaishnavas. While King Vishnuvardhana and his descendants were Vaishnava by faith,[6] records show that the Hoysalas maintained religious harmony by building as many temples dedicated to Shiva as they did to Vishnu.[7] Most of these temples have secular features with broad themes depicted in their sculptures. This can be seen in the famous Chennakesava Temple at Belur dedicated to Vishnu and in the Hoysaleswara temple at Halebidu dedicated to Shiva. The Kesava temple at Somanathapura is different in that its ornamentation is strictly Vaishnavan.[8] Generally Vaishnava temples are dedicated to Keshava (or to Chennakeshava, meaning \"Beautiful Vishnu\") while a small number are dedicated to Lakshminarayana and Lakshminarasimha (Narayana and Narasimha both being Avatars, or physical manifestations, of Vishnu) with Lakshmi, consort of Vishnu, seated at his feet. Temples dedicated to Vishnu are always named after the deity. The Shaiva temples have a Shiva linga, symbol of fertility and the universal symbol of Shiva, in the shrine. The names of Shiva temples can end with the suffix eshwara meaning \"Lord of\". The name \"Hoysaleswara\", for instance, means \"Lord of Hoysala\". The temple can also be named after the devotee who commissioned the construction of the temple, an example being the Bucesvara temple at Koravangala, named after the devotee Buci.[9] The most striking sculptural decorations are the horizontal rows of exquisitely detailed, intricately carved images of gods, goddesses and their attendants on the outer temple wall panels. The Doddagaddavalli Lakshmi Devi (\"Goddess of Wealth\") Temple is an exception as it is dedicated to neither Vishnu nor Shiva. The defeat of the Jain Western Ganga Dynasty (of present-day south Karnataka) by the Cholas in the early 11th century and the rising numbers of followers of Vaishnava Hinduism and Virashaivism in the 12th century was mirrored by a decreased interest in Jainism.[10] However, two notable locations of Jain worship in the Hoysala territory were Shravanabelagola and Kambadahalli. The Hoysalas built Jain temples to satisfy the needs of its Jain population, a few of which have survived in Halebidu containing icons of Jain tirthankaras. They constructed stepped wells called Pushkarni or Kalyani, the ornate tank at Hulikere being an example. The tank has twelve minor shrines containing Hindu deities.[11]",
			"color": " "
		}
	}
}
