{
	"add": {
		"doc": {
			"id": "69617dece0c0a0c3d1b935e14eb1f395e8ec3a877b29dd24ea6230e18a760511",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Russia-2000-stamp-Dmitri_Shostakovich.jpg/220px-Russia-2000-stamp-Dmitri_Shostakovich.jpg",
			"previous": [],
				"after": "In May 1958, during a visit to Paris, Shostakovich recorded his two piano concertos with André Cluytens, as well as some short piano works. These were issued by EMI on an LP, reissued by Seraphim Records on LP, and eventually digitally remastered and released on CD. Shostakovich recorded the two concertos in stereo in Moscow for Melodiya. Shostakovich also played the piano solos in recordings of the Cello Sonata, Op. 40 with cellist Daniil Shafran and also with Mstislav Rostropovich; the Violin Sonata, Op. 134, with violinist David Oistrakh; and the Piano Trio, Op. 67 with violinist David Oistrakh and cellist Miloš Sádlo. There is also a short sound film of Shostakovich as soloist in a 1930s concert performance of the closing moments of his first piano concerto. A colour film of Shostakovich supervising one of his operas, from his last year, was also made.[109] A major achievement was the recording of the original, unexpurgated score for Lady Macbeth of Mtsensk by EMI. There was at least one recording of the cleaned up version, Katerina Ismailova that Shostakovich had made to satisfy Soviet censorship. But when conductor Mstislav Rostropovich and his wife, soprano Galina Vishnevskaya were finally allowed to emigrate to the West, the composer begged them to record the full original score, which they did in 1979. It features Vishnevskaya as Katerina, Nicolai Gedda as Sergei, Dimiter Petkov as Boris Ismailov and a brilliant supporting cast under Rostropovich's direction.",
			"color": "dark|0.067833 gray|0.067833 dark|0.067833 grey|0.067833 gray|0.057121 grey|0.057121 silver|0.056763 white|0.053689 smoke|0.053689 lavender|0.050958 blush|0.050958 light|0.050885 gray|0.050885 light|0.050885 grey|0.050885 ghost|0.05046 white|0.05046 snow|0.050445 sea|0.049186 shell|0.049186 thistle|0.048665 white|0.04668 alice|0.045033 blue|0.045033 dim|0.044756 gray|0.044756 dim|0.044756 grey|0.044756 floral|0.043944 white|0.043944 gainsboro|0.043744 mint|0.041203 cream|0.041203 rosy|0.038531 brown|0.038531 azure|0.036469 lavender|0.029988 linen|0.017568 misty|0.016946 rose|0.016946 ivory|0.010626 light|0.0078505 slate|0.0078505 gray|0.0078505 slate|0.0066906 gray|0.0066906 old|0.0061257 lace|0.0061257 light|0.0058503 steel|0.0058503 blue|0.0058503  "
		}
	}
}
