{
	"add": {
		"doc": {
			"id": "696245b2f3b201d37f85e83117217dc3b1413183fdcb61b22b5b8f97234dbbcc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Stone_Mountain_models.jpg/220px-Stone_Mountain_models.jpg",
				"previous": "Borglum was busy between the passage of the bill and the end of May 1924, first working on the Children's Founders Roll medal, and then the half dollar. The Children's Founders Roll was open to white children up to the age of 18 who contributed one dollar to the building of the monument. Borglum must still have been fine-tuning the monument's design; Jackson's posture on the medal differs from that on the coin.[18] Unlike the issued coin, Borglum's models showed the front part of Davis's horse, although the Confederate president is unseen, and marching soldiers appear in the background.[19] Borglum met with Treasury Secretary Andrew Mellon who questioned first why \"In God We Trust\" appeared directly over Lee's head; Borglum responded that it was to pay tribute to the Confederates' faith. Mellon then asked what the thirteen stars on the obverse represented; Borglum replied that those on the north side of the Mason-Dixon Line could consider them to represent the thirteen original colonies (those south of it, the implication was, could consider them to be a tribute to the Southern states). Mellon laughed and gave preliminary approval.[20] On July 2, Mellon showed the designs to President Coolidge; they were then sent to the Commission of Fine Arts for its members' opinions.[18]",
				"after": "According to numismatists William D. Hyder and R.W. Colbert, \"Borglum, to put it mildly, was a temperamental artist who managed to offend most everyone with whom he worked\".[8] They note that \"Borglum's past insolence had not left him in the good graces of the art community\" and his designs met a hostile reception at the commission.[18] Sculptor member James Earle Fraser, designer of the Buffalo nickel, rejected Borglum's initial design on July 22, eight days after they were received. The inscription on the reverse included a tribute to Harding; Fraser deemed it inartistic. Borglum submitted a second set on August 14, this was again rejected; the commission criticized the design, which seemed to be only a segment of a larger one, rather than specifically designed to fit a half dollar. Borglum wanted to ignore what he deemed \"damn fool suggestions\", but the Association threatened to fire him if he did not complete the coin. Borglum was concerned the reverse was still too crowded, and proposed leaving off the eagle,[21] but space was saved when Coolidge did not like the reference to Harding, and it was omitted.[22] With the eagle still in place on the reverse, Fraser finally approved the designs on October 10, 1924.[23] In all, Borglum made nine plaster models for the design.[20]",
			"color": " "
		}
	}
}
