{
	"add": {
		"doc": {
			"id": "6964d795833332465bcecb877aaeae2cd04f7195c0f1793397b85f1e6f349a34",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/WikiNews-Logo-en.svg/25px-WikiNews-Logo-en.svg.png",
			"previous": [
				"",
				" Lahore (help·info) (Punjabi: لہور, Urdu: لاہور‎ Hindustani pronunciation: [lahor]) is the capital of the Pakistani province of Punjab and is the second largest city in Pakistan after Karachi. It is often called the Garden of Mughals because of the heritage of the Mughal Empire. It is located near the Ravi River, close to the Pakistan-India border. Mughal structures such as the Badshahi Mosque, Ali Hujwiri, Lahore Fort, Shalimar Gardens and the mausoleums of Jehangir, and Nur Jehan are popular tourist spots in the city. Colonial British structures such as the Lahore High Court, General Post Office (GPO) and many of the older universities still retain their Mughal-Gothic style. Punjabi and Urdu are the native languages of the province and are the most widely spoken languages in Lahore and rural areas. Urdu and English, however, are becoming more popular with younger generations since they are officially supported, whereas Punjabi has no official patronage. Many people of Lahore who speak Punjabi are known as Lahori Punjabi due to their use of a mixture of Punjabi and colloquial Urdu. According to the 1998 census, Lahore's population was nearly 7 million. Mid-2006 government estimates now put the population at approximately 10 million.This makes Lahore the second largest city in Pakistan, fifth largest city in South Asia and the 26th largest city in the world."
			],
			"after": [],
			"color": "lavender|0.32325 light|0.1316 steel|0.1316 blue|0.1316 light|0.07335 blue|0.07335 gainsboro|0.06972 light|0.069269 gray|0.069269 light|0.069269 grey|0.069269 alice|0.063615 blue|0.063615 silver|0.059354 ghost|0.0367 white|0.0367 white|0.029698 smoke|0.029698 light|0.017382 sky|0.017382 blue|0.017382 snow|0.015311 dark|0.014946 gray|0.014946 dark|0.014946 grey|0.014946 lavender|0.014937 blush|0.014937 sky|0.014443 blue|0.014443 white|0.013732 azure|0.012648 sea|0.011601 shell|0.011601 mint|0.010749 cream|0.010749 linen|0.0083631 floral|0.0065312 white|0.0065312  "
		}
	}
}
