{
	"add": {
		"doc": {
			"id": "69666046055964420fba31326c7d3345c6b087f1252284b217133a3b392a041f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Car_trapped_under_bridge.JPG/220px-Car_trapped_under_bridge.JPG",
				"previous": "In the 20th century, Chew Stoke expanded slightly with the influx of residents from the Chew Valley Lake area. These new residents were moved to Chew Stoke when the lake was created in the 1950s.[2] In World War II, 42 children and three teachers, who had been evacuated from Avenmore school in London, were accommodated in the village.[5] On 10 July 1968, torrential rainfall, with 175 millimetres (7 in) falling in 18 hours on Chew Stoke, double the area's average rainfall for the whole of July,[10] led to widespread flooding in the Chew Valley, and water reached the first floor of many buildings.[5] The damage in Chew Stoke was not as severe as in some of the surrounding villages, such as Pensford; however, fears that the Chew Valley Lake dam would be breached caused considerable anxiety.[10][11]",
				"after": "On 4 February 2001, Princess Anne opened the Rural Housing Trust development at Salway Close. Each year, over a weekend in September (usually the first), a \"Harvest Home\" is held with horse and pet shows, bands, a funfair, and other entertainments. The Harvest Home was cancelled in 1997 as a mark of respect following the death of Princess Diana in the previous week. The Radford's factory site, where refrigeration equipment was formerly manufactured, was identified as a brownfield site suitable for residential development in the 2002 Draft Local Plan of Bath and North East Somerset.[12] That plan has generated controversy about balancing land use to meet residential, social, and employment needs.[13]",
			"color": "light|0.2225 slate|0.2225 gray|0.2225 light|0.21402 steel|0.21402 blue|0.21402 cadet|0.13138 blue|0.13138 slate|0.12985 gray|0.12985 corn|0.089684 flower|0.089684 blue|0.089684 light|0.048273 blue|0.048273 light|0.022327 sky|0.022327 blue|0.022327 lavender|0.020413 dark|0.015802 gray|0.015802 dark|0.015802 grey|0.015802 powder|0.013891 blue|0.013891 steel|0.013037 blue|0.013037 silver|0.0087787 gray|0.0073559 grey|0.0073559  "
		}
	}
}
