{
	"add": {
		"doc": {
			"id": "6983482420696fc65db6d19a95d874ab946978470a0ae37756f00db5235ff0c9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/WeaverAntDefense.JPG/220px-WeaverAntDefense.JPG",
				"previous": "Fire ants, Solenopsis spp., are unique in having a poison sac containing piperidine alkaloids.[76] Their stings are painful and can be dangerous to hypersensitive people.[77]",
				"after": "Trap-jaw ants of the genus Odontomachus are equipped with mandibles called trap-jaws, which snap shut faster than any other predatory appendages within the animal kingdom.[78] One study of Odontomachus bauri recorded peak speeds of between 126 and 230 km/h (78 – 143 mph), with the jaws closing within 130 microseconds on average. The ants were also observed to use their jaws as a catapult to eject intruders or fling themselves backward to escape a threat.[78] Before striking, the ant opens its mandibles extremely widely and locks them in this position by an internal mechanism. Energy is stored in a thick band of muscle and explosively released when triggered by the stimulation of sensory organs resembling hairs on the inside of the mandibles. The mandibles also permit slow and fine movements for other tasks. Trap-jaws also are seen in the following genera: Anochetus, Orectognathus, and Strumigenys,[78] plus some members of the Dacetini tribe,[79] which are viewed as examples of convergent evolution.",
			"color": "dark|0.13401 sea|0.13401 green|0.13401 medium|0.093927 aqua|0.093927 marine|0.093927 light|0.065911 cyan|0.065911 azure|0.050571 honeydew|0.046594 mint|0.045353 cream|0.045353 gray|0.045279 grey|0.045279 dark|0.035967 gray|0.035967 dark|0.035967 grey|0.035967 saddle|0.035885 brown|0.035885 dark|0.031794 olive|0.031794 green|0.031794 alice|0.031479 blue|0.031479 white|0.029449 smoke|0.029449 white|0.028857 sienna|0.026879 ghost|0.025816 white|0.025816 snow|0.025646 pale|0.025086 turquoise|0.025086 floral|0.024836 white|0.024836 sea|0.024326 green|0.024326 sea|0.020321 shell|0.020321 cadet|0.017682 blue|0.017682 dim|0.01419 gray|0.01419 dim|0.01419 grey|0.01419 lavender|0.012509 blush|0.012509 ivory|0.010863 silver|0.010836  "
		}
	}
}
