{
	"add": {
		"doc": {
			"id": "699c1ae6fcc5d56d640cf8b6d6fedb1c2a4eb115f4d38999e6521a4f21cab885",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Edouard_Manet_-_Luncheon_on_the_Grass_-_Google_Art_Project.jpg/220px-Edouard_Manet_-_Luncheon_on_the_Grass_-_Google_Art_Project.jpg",
				"previous": "In the early 1860s, four young painters—Claude Monet, Pierre-Auguste Renoir, Alfred Sisley, and Frédéric Bazille—met while studying under the academic artist Charles Gleyre. They discovered that they shared an interest in painting landscape and contemporary life rather than historical or mythological scenes. Following a practice that had become increasingly popular by mid-century, they often ventured into the countryside together to paint in the open air, but not for the purpose of making sketches to be developed into carefully finished works in the studio, as was the usual custom.[4] By painting in sunlight directly from nature, and making bold use of the vivid synthetic pigments that had become available since the beginning of the century, they began to develop a lighter and brighter manner of painting that extended further the Realism of Gustave Courbet and the Barbizon school. A favourite meeting place for the artists was the Café Guerbois on Avenue de Clichy in Paris, where the discussions were often led by Édouard Manet, whom the younger artists greatly admired. They were soon joined by Camille Pissarro, Paul Cézanne, and Armand Guillaumin.[5]",
				"after": "During the 1860s, the Salon jury routinely rejected about half of the works submitted by Monet and his friends in favour of works by artists faithful to the approved style.[6] In 1863, the Salon jury rejected Manet's The Luncheon on the Grass (Le déjeuner sur l'herbe) primarily because it depicted a nude woman with two clothed men at a picnic. While the Salon jury routinely accepted nudes in historical and allegorical paintings, they condemned Manet for placing a realistic nude in a contemporary setting.[7] The jury's severely worded rejection of Manet's painting appalled his admirers, and the unusually large number of rejected works that year perturbed many French artists.",
			"color": "black|0.48156 tan|0.22992 dim|0.10446 gray|0.10446 dim|0.10446 grey|0.10446 gray|0.06745 grey|0.06745 slate|0.028861 gray|0.028861 dark|0.021188 gray|0.021188 dark|0.021188 grey|0.021188 light|0.020782 slate|0.020782 gray|0.020782  "
		}
	}
}
