{
	"add": {
		"doc": {
			"id": "69bff54d09b41a8e9d2ec3371fd29fbbbf1f4f05c6b12e66b18755b4e5197953",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Three_cell_growth_types.png/250px-Three_cell_growth_types.png",
				"previous": "Regardless of the type of metabolic process they employ, the majority of bacteria are able to take in raw materials only in the form of relatively small molecules, which enter the cell by diffusion or through molecular channels in cell membranes. The Planctomycetes are the exception (as they are in possessing membranes around their nuclear material). It has recently been shown that Gemmata obscuriglobus is able to take in large molecules via a process that in some ways resembles endocytosis, the process used by eukaryotic cells to engulf external items.[28][94]",
				"after": "Unlike in multicellular organisms, increases in cell size (cell growth) and reproduction by cell division are tightly linked in unicellular organisms. Bacteria grow to a fixed size and then reproduce through binary fission, a form of asexual reproduction.[95] Under optimal conditions, bacteria can grow and divide extremely rapidly, and bacterial populations can double as quickly as every 9.8 minutes.[96] In cell division, two identical clone daughter cells are produced. Some bacteria, while still reproducing asexually, form more complex reproductive structures that help disperse the newly formed daughter cells. Examples include fruiting body formation by Myxobacteria and aerial hyphae formation by Streptomyces, or budding. Budding involves a cell forming a protrusion that breaks away and produces a daughter cell.",
			"color": "lavender|0.098262 blush|0.098262 ghost|0.095389 white|0.095389 white|0.089767 smoke|0.089767 alice|0.089641 blue|0.089641 snow|0.086917 white|0.083146 sea|0.081865 shell|0.081865 floral|0.075722 white|0.075722 mint|0.074935 cream|0.074935 azure|0.072618 lavender|0.046966 gainsboro|0.018915 light|0.013452 gray|0.013452 light|0.013452 grey|0.013452 misty|0.011027 rose|0.011027 light|0.010377 green|0.010377 linen|0.0094091 silver|0.0076061 lime|0.0057109 green|0.0057109 thistle|0.0050778 dark|0.0031359 gray|0.0031359 dark|0.0031359 grey|0.0031359 ivory|0.0030063 light|0.0029574 coral|0.0029574 pink|0.002881  "
		}
	}
}
