{
	"add": {
		"doc": {
			"id": "69fa81e058cf33023bfa1362207858d31fbc4aee5c08446388cde11040b916f7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/JFK_library_Stitch_Crop.jpg/250px-JFK_library_Stitch_Crop.jpg",
				"previous": "The project was plagued with problems from the outset. The first was scope. President Kennedy had begun considering the structure of his library soon after taking office, and he wanted to include archives from his administration, a museum of personal items, and a political science institute. After the assassination, the list expanded to include a fitting memorial tribute to the slain president. The variety of necessary inclusions complicated the design process and caused significant delays.[57]",
				"after": "Pei's first proposed design included a large glass pyramid that would fill the interior with sunlight, meant to represent the optimism and hope that Kennedy's administration had symbolized for so many in the US. Mrs. Kennedy liked the design, but resistance began in Cambridge, the first proposed site for the building, as soon as the project was announced. Many community members worried that the library would become a tourist attraction, causing particular problems with traffic congestion. Others worried that the design would clash with the architectural feel of nearby Harvard Square. By the mid-70s, Pei tried proposing a new design, but the library's opponents resisted every effort.[59] These events pained Pei, who had sent all three of his sons to Harvard, and although he rarely discussed his frustration, it was evident to his wife. \"I could tell how tired he was by the way he opened the door at the end of the day,\" she said. \"His footsteps were dragging. It was very hard for I. M. to see that so many people didn't want the building.\"[60]",
			"color": "black|0.22896 dark|0.16141 slate|0.16141 gray|0.16141 dim|0.11188 gray|0.11188 dim|0.11188 grey|0.11188 dark|0.061147 gray|0.061147 dark|0.061147 grey|0.061147 gray|0.060708 grey|0.060708 antique|0.029817 white|0.029817 tan|0.027676 papaya|0.022227 whip|0.022227 blanched|0.022223 almond|0.022223 bisque|0.0208 beige|0.018898 steel|0.017078 blue|0.017078  "
		}
	}
}
