{
	"add": {
		"doc": {
			"id": "6a085fa29676a0e03610eb13b48060ee68f0afaff865c109cf1cbf98868aaa97",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Big_Runaway_Map.PNG/220px-Big_Runaway_Map.PNG",
				"previous": "In the early 18th century, a tribal confederacy known as the Six Nations of the Iroquois, headquartered in New York, ruled the Indian (Native American) tribes of Pennsylvania, including those who lived near what would become Lock Haven. Indian settlements in the area included three Munsee villages on the 325-acre (1.32 km2) Great Island in the West Branch Susquehanna River at the mouth of Bald Eagle Creek. Four Indian trails, the Great Island Path, the Great Shamokin Path, the Bald Eagle Creek Path, and the Sinnemahoning Path, crossed the island, and a fifth, Logan's Path, met Bald Eagle Creek Path a few miles upstream near the mouth of Fishing Creek.[9] During the French and Indian War (1754–63), colonial militiamen on the Kittanning Expedition destroyed Munsee property on the Great Island and along the West Branch. By 1763, the Munsee had abandoned their island villages and other villages in the area.[10][11]",
				"after": "With the signing of the first Treaty of Fort Stanwix in 1768, the British gained control from the Iroquois of lands south of the West Branch. However, white settlers continued to appropriate land, including tracts in and near the future site of Lock Haven, not covered by the treaty. In 1769, Cleary Campbell, the first white settler in the area, built a log cabin near the present site of Lock Haven University of Pennsylvania, and by 1773 William Reed, another settler, had built a cabin surrounded by a stockade and called it Reed's Fort.[12] It was the westernmost of 11 mostly primitive forts along the West Branch; Fort Augusta, at what is now Sunbury, was the easternmost and most defensible. In response to settler incursions, and encouraged by the British during the American Revolution (1775–83), Indians attacked colonists and their settlements along the West Branch. Fort Reed and the other white settlements in the area were temporarily abandoned in 1778 during a general evacuation known as the Big Runaway. Hundreds of people fled along the river to Fort Augusta, about 50 miles (80 km) from Fort Reed; some did not return for five years.[13] In 1784, the second Treaty of Fort Stanwix, between the Iroquois and the United States, transferred most of the remaining Indian territory in Pennsylvania, including what would become Lock Haven, to the state.[14] The U.S. acquired the last remaining tract, the Erie Triangle, through a separate treaty and sold it to Pennsylvania in 1792.[14]",
			"color": "gray|0.23134 grey|0.23134 red|0.21891 dim|0.16667 gray|0.16667 dim|0.16667 grey|0.16667 tomato|0.12438 salmon|0.088308 black|0.069652 dark|0.052239 salmon|0.052239 light|0.026119 salmon|0.026119 dark|0.012438 gray|0.012438 dark|0.012438 grey|0.012438  "
		}
	}
}
