{
	"add": {
		"doc": {
			"id": "6a131f2528af0ffd3d57aa9afa4b68a2aa9dca3bbccf9bd654f840999e649ecd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Tyrannosaurus_rex_mmartyniuk.png/220px-Tyrannosaurus_rex_mmartyniuk.png",
				"previous": "Tyrannosaurus rex was one of the largest land carnivores of all time; the largest complete specimen, located at the Field Museum of National History and known colloquially as FMNH PR2081 and nicknamed \"Sue\", measured 12.3 metres (40 ft) long,[3] and was 4 metres (13 ft) tall at the hips.[4] Mass estimates have varied widely over the years, from more than 7.2 metric tons (7.9 short tons),[10] to less than 4.5 metric tons (5.0 short tons),[11][12] with most modern estimates ranging between 5.4 metric tons (6.0 short tons) and 6.8 metric tons (7.5 short tons).[5][13][14][15] One study in 2011 found that the maximum weight of Sue, the largest Tyrannosaurus, was between 9.5 and 18.5 metric tons (9.3–18.2 long tons; 10.5–20.4 short tons), though the authors stated that their upper and lower estimates were based on models with wide error bars and that they \"consider [them] to be too skinny, too fat, or too disproportionate\".[3] Packard et al. (2009) tested dinosaur mass estimation procedures on elephants and concluded that those of dinosaurs are flawed and produce over-estimations; thus, the weight of Tyrannosaurus could have been much less than previously thought.[16] Other estimations have concluded that the largest known Tyrannosaurus specimens had masses approaching[17] or exceeding 9 tonnes.[3][18][19]",
				"after": "The neck of Tyrannosaurus rex formed a natural S-shaped curve like that of other theropods, but was short and muscular to support the massive head. The forelimbs had only two clawed fingers,[20] along with an additional small metacarpal representing the remnant of a third digit.[21] In contrast the hind limbs were among the longest in proportion to body size of any theropod. The tail was heavy and long, sometimes containing over forty vertebrae, in order to balance the massive head and torso. To compensate for the immense bulk of the animal, many bones throughout the skeleton were hollow, reducing its weight without significant loss of strength.[20]",
			"color": "black|0.29895 dim|0.26703 gray|0.26703 dim|0.26703 grey|0.26703 gray|0.12848 grey|0.12848 maroon|0.093145 dark|0.089541 gray|0.089541 dark|0.089541 grey|0.089541 dark|0.031842 red|0.031842 silver|0.029991 rosy|0.015551 brown|0.015551  "
		}
	}
}
