{
	"add": {
		"doc": {
			"id": "6a14549b5f7c82402a71b927b52314ad10b8fa1becb6a797934404da5c42871b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Latin_and_Ancient_Greek_Language_-_Culture_-_Linguistics_at_Duke_University_in_2014.jpg/220px-Latin_and_Ancient_Greek_Language_-_Culture_-_Linguistics_at_Duke_University_in_2014.jpg",
				"previous": "The Living Latin movement attempts to teach Latin in the same way that living languages are taught, i.e., as a means of both spoken and written communication. It is available at the Vatican, and at some institutions in the U.S., such as the University of Kentucky and Iowa State University. The British Cambridge University Press is a major supplier of Latin textbooks for all levels, such as the Cambridge Latin Course series. It has also published a subseries of children's texts in Latin by Bell & Forte, which recounts the adventures of a mouse called Minimus.",
				"after": "In the United Kingdom, the Classical Association encourages the study of antiquity through various means, such as publications and grants. The University of Cambridge,[8] the Open University (OU),[9] a number of prestigious independent schools, for example Eton and Harrow, and Via Facilis,[10] a London-based charity, do still run Latin courses. In the United States and Canada, the American Classical League supports every effort to further the study of classics. Its subsidiaries include the National Junior Classical League (with more than 50,000 members), which encourages high school students to pursue the study of Latin, and the National Senior Classical League, which encourages students to continue their study of the classics into college. The league also sponsors the National Latin Exam. Classicist Mary Beard wrote in The Times Literary Supplement in 2006 that the reason for learning Latin is because of what was written in it.[11]",
			"color": "gray|0.2711 grey|0.2711 dark|0.20508 gray|0.20508 dark|0.20508 grey|0.20508 black|0.19764 dim|0.14685 gray|0.14685 dim|0.14685 grey|0.14685 light|0.065648 steel|0.065648 blue|0.065648 silver|0.059239 light|0.015739 gray|0.015739 light|0.015739 grey|0.015739 lavender|0.010343 gainsboro|0.0072998 dark|0.0047826 slate|0.0047826 blue|0.0047826  "
		}
	}
}
