{
	"add": {
		"doc": {
			"id": "6a21b181f6cc3587bea90e3b31b5ba855f35176c771474ce340505d60bf55a1d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Beaver_2.jpg/250px-Beaver_2.jpg",
			"previous": [],
				"after": "The basic units of beaver social organization are families consisting of an adult male and adult female in a monogamous pair and their kits and yearlings.[51] Beaver families can have as many as ten members in addition to the monogamous pair. Groups this size or close to this size build more lodges to live in while smaller families usually need only one.[51] However, large families in the northern hemisphere have been recorded living in one lodge. Beaver pairs mate for life; however, if a beaver's mate dies, it will partner with another one. Extra-pair copulations also occur.[51] In addition to being monogamous, both the male and female take part in raising offspring. They also both mark and defend the territory and build and repair the dam and lodge.[51] When young are born, they spend their first month in the lodge and their mother is the primary caretaker while their father maintains the territory. In the time after they leave the lodge for the first time, yearlings will help their parents build food caches in the fall and repair dams and lodges. Still, adults do the majority of the work and young beavers help their parents for reasons based on natural selection rather than kin selection. They are dependent on them for food and for learning life skills.[51] Young beavers spend most of their time playing but also copy their parents' behavior. However while copying behavior helps imprint life skills in young beavers it is not necessarily immediately beneficial for parents as the young beaver do not perform the tasks as well as the parents.[51]",
			"color": "black|0.57704 dim|0.209 gray|0.209 dim|0.209 grey|0.209 dark|0.081703 slate|0.081703 gray|0.081703 gray|0.037429 grey|0.037429 dark|0.022113 gray|0.022113 dark|0.022113 grey|0.022113 slate|0.015765 gray|0.015765 tan|0.014462 silver|0.011455 steel|0.0092526 blue|0.0092526 light|0.0075996 slate|0.0075996 gray|0.0075996  "
		}
	}
}
