{
	"add": {
		"doc": {
			"id": "6a301c67755428e92ca8b17d5bf36f8cf8048c3962246d4bf8bdf585bad44c38",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/6/67/RiteofSpringDancers.jpg/220px-RiteofSpringDancers.jpg",
				"previous": "On the evening of the 29 May the theatre was packed: Gustav Linor reported, \"Never ... has the hall been so full, or so resplendent; the stairways and the corridors were crowded with spectators eager to see and to hear\".[58] The evening began with Les Sylphides, in which Nijinsky and Karsavina danced the main roles.[54] The Rite followed. Some eyewitnesses and commentators said that the disturbances in the audience began during the Introduction, and grew into a crescendo when the curtain rose on the stamping dancers in \"Augurs of Spring\". But music historian Richard Taruskin asserts, \"it was not Stravinsky’s music that did the shocking. It was the ugly earthbound lurching and stomping devised by Vaslav Nijinsky.\"[59] Marie Rambert, who was working as an assistant to Nijinsky, recalled later that it was soon impossible to hear the music on the stage.[60] In his autobiography, Stravinsky writes that the derisive laughter that greeted the first bars of the Introduction disgusted him, and that he left the auditorium to watch the rest of the performance from the stage wings. The demonstrations, he says, grew into \"a terrific uproar\" which, along with the on-stage noises, drowned out the voice of Nijinsky who was shouting the step numbers to the dancers.[56] The journalist and photographer Carl Van Vechten recorded that the person behind him got carried away with excitement, and \"began to beat rhythmically on top of my head\", though Van Vechten failed to notice this at first, his own emotion being so great.[61]",
				"after": "Monteux believed that the trouble began when the two factions in the audience began attacking each other, but their mutual anger was soon diverted towards the orchestra: \"Everything available was tossed in our direction, but we continued to play on\". Around forty of the worst offenders were ejected—possibly with the intervention of the police, although this is uncorroborated. Through all the disturbances the performance continued without interruption. Things grew noticeably quieter during Part II, and by some accounts Maria Piltz's rendering of the final \"Sacrificial Dance\" was watched in reasonable silence. At the end there were several curtain calls for the dancers, for Monteux and the orchestra, and for Stravinsky and Nijinsky before the evening's programme continued.[62]",
			"color": "dim|0.24993 gray|0.24993 dim|0.24993 grey|0.24993 gray|0.22162 grey|0.22162 dark|0.18341 gray|0.18341 dark|0.18341 grey|0.18341 silver|0.099106 light|0.060639 gray|0.060639 light|0.060639 grey|0.060639 gainsboro|0.042408 linen|0.017268 white|0.015071 smoke|0.015071 sea|0.015002 shell|0.015002 snow|0.012557 floral|0.012366 white|0.012366 misty|0.011689 rose|0.011689 lavender|0.011115 blush|0.011115 ghost|0.010043 white|0.010043 white|0.0098967 mint|0.0081528 cream|0.0081528 old|0.0073366 lace|0.0073366 ivory|0.0049092  "
		}
	}
}
