{
	"add": {
		"doc": {
			"id": "6a3729d6b38f3088ff20f30ae319c6686dbc85a9c80e301810855b5c02dca856",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Island_Air_Dash_8-100_N829EX.jpg/220px-Island_Air_Dash_8-100_N829EX.jpg",
				"previous": "These designs were so successful that it was many years before newer designs bettered them enough to make it worthwhile to develop. There were a few exceptions, generally tailored to more specific roles. For instance, the Handley Page Jetstream (first flight in 1968) was intended for fewer passengers at much higher speeds, displacing smaller designs like the Beechcraft Queen Air. The Fairchild/Swearingen Metro (developed from the original Queen Air through a number of stages) filled a similar niche.",
				"after": "By the 1970s the first generation regional airliners were starting to wear out, but there had been little effort in producing new designs for this market. A varied list of light transport aircraft supplanted by newer and more modern 30 seat designs by Shorts with their Shorts 330 and 360 as well as other aircraft manufacturers, replaced and sometimes provided growth to established commuter markets. Additional development came to the regional airline industry with the arrival of some of the earlier De Havilland Canada types such as the Dash 7 delivered in 1978, but this was tailored more to the short-range and STOL (Short Take-Off and Landing) role than as a regional airliner. Feedback from the airlines was fairly consistent, however, and De Havilland responded with the Dash 8 in 1984, which had economic benefits over the earlier generation machines, and was faster and quieter as well.",
			"color": "dim|0.61639 gray|0.61639 dim|0.61639 grey|0.61639 black|0.18572 dark|0.062472 gray|0.062472 dark|0.062472 grey|0.062472 gray|0.058227 grey|0.058227 light|0.024224 slate|0.024224 gray|0.024224 slate|0.017731 gray|0.017731 silver|0.016171 dark|0.0061493 slate|0.0061493 gray|0.0061493 light|0.0057476 gray|0.0057476 light|0.0057476 grey|0.0057476  "
		}
	}
}
