{
	"add": {
		"doc": {
			"id": "6a729960516b34af2979d3f5ec08a58b622bcdeb21d8af2419eeb7d1a13bdade",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Daspletosaurus_torosus_by_durbed.jpg/220px-Daspletosaurus_torosus_by_durbed.jpg",
				"previous": "Daspletosaurus lived in a vast floodplain along the western shore of the interior seaway. Large rivers watered the land, occasionally flooding and blanketing the region with new sediment. When water was plentiful, the region could support a great deal of plant and animal life, but periodic droughts also struck the region, resulting in mass mortality as preserved in the many bonebed deposits found in Two Medicine and Judith River sediments, including the Daspletosaurus bonebed.[37] Similar conditions exist today in East Africa.[38] Volcanic eruptions from the west periodically blanketed the region with ash, also resulting in large-scale mortality, while simultaneously enriching the soil for future plant growth. It is these ash beds that allow precise radiometric dating as well. Fluctuating sea levels also resulted in a variety of other environments at different times and places within the Judith River Group, including offshore and nearshore marine habitats, coastal wetlands, deltas and lagoons, in addition to the inland floodplains.[35] The Two Medicine Formation was deposited at higher elevations farther inland than the other two formations.[36]",
				"after": "The excellent vertebrate fossil record of Two Medicine and Judith River rocks resulted from a combination of abundant animal life, periodic natural disasters, and the deposition of large amounts of sediment. Many types of freshwater and estuarine fish are represented, including sharks, rays, sturgeons, gars and others. The Judith River Group preserves the remains of many aquatic amphibians and reptiles, including frogs, salamanders, turtles, Champsosaurus and crocodilians. Terrestrial lizards, including whiptails, skinks, monitors and alligator lizards have also been discovered. Azhdarchid pterosaurs, and birds like Apatornis and Avisaurus flew overhead, while several varieties of mammals coexisted with Daspletosaurus and other types of dinosaurs in the various formations that make up the Judith River wedge.[35]",
			"color": "dim|0.07402 gray|0.07402 dim|0.07402 grey|0.07402 white|0.070303 smoke|0.070303 black|0.069908 sea|0.069102 shell|0.069102 snow|0.067996 white|0.065611 floral|0.065463 white|0.065463 ghost|0.064109 white|0.064109 linen|0.062323 gray|0.059888 grey|0.059888 mint|0.058924 cream|0.058924 alice|0.057986 blue|0.057986 dark|0.044478 gray|0.044478 dark|0.044478 grey|0.044478 lavender|0.04285 blush|0.04285 gainsboro|0.027985 silver|0.026246 azure|0.023808 light|0.021831 gray|0.021831 light|0.021831 grey|0.021831 ivory|0.010835 old|0.010705 lace|0.010705  "
		}
	}
}
