{
	"add": {
		"doc": {
			"id": "6a80012b97cbdd4a378ec7ba3341c268422002aec249c627b9d87f4b08b05a0e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/GravadoVoz.jpg/220px-GravadoVoz.jpg",
				"previous": "Many modern aircraft systems are digital or digitally controlled. Very often, the digital system will include Built-In Test Equipment which records information about the operation of the system. This information may also be accessed to assist with the investigation of an accident or incident.",
				"after": "The design of today's FDR is governed by the internationally recognized standards and recommended practices relating to flight recorders which are contained in ICAO Annex 6 which makes reference to industry crashworthiness and fire protection specifications such as those to be found in the European Organisation for Civil Aviation Equipment[25] documents EUROCAE ED55, ED56 fiken A and ED112 (Minimum Operational Performance Specification for Crash Protected Airborne Recorder Systems). In the United States, the Federal Aviation Administration (FAA) regulates all aspects of US aviation, and cites design requirements in their Technical Standard Order,[26] based on the EUROCAE documents (as do the aviation authorities of many other countries).",
			"color": "burly|0.19862 wood|0.19862 tan|0.14192 rosy|0.040086 brown|0.040086 peach|0.039152 puff|0.039152 wheat|0.032711 navajo|0.028868 white|0.028868 black|0.025575 pale|0.02336 golden|0.02336 rod|0.02336 lavender|0.020852 orange|0.019756 red|0.019756 moccasin|0.019104 bisque|0.016851 peru|0.016523 light|0.016395 gray|0.016395 light|0.016395 grey|0.016395 gainsboro|0.015923 dark|0.015374 salmon|0.015374 silver|0.014296 dark|0.013075 gray|0.013075 dark|0.013075 grey|0.013075 saddle|0.012213 brown|0.012213 white|0.011807 smoke|0.011807 alice|0.011764 blue|0.011764 beige|0.011661 sienna|0.011638 ghost|0.011468 white|0.011468 antique|0.01102 white|0.01102 blanched|0.010511 almond|0.010511 lavender|0.010129 blush|0.010129  "
		}
	}
}
