{
	"add": {
		"doc": {
			"id": "6a8e7dedc2ba340b033139dad404c15471daf1030f6f8fd81d13b0728347b8b5",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/0/07/ArcticIceOffWrangelIsland1914.jpg/220px-ArcticIceOffWrangelIsland1914.jpg",
				"previous": "Meanwhile, on 4 February, Mackay and his group (Murray and Beuchat, joined by seaman Stanley Morris) announced they were leaving the next day, to seek land. Mackay presented Bartlett with a letter dated 1 February that began: \"We, the undersigned, in consideration of the present critical situation, desire to make an attempt to reach the land.\" The letter requested appropriate supplies, and concluded by emphasising that the journey was on their own initiative and absolving Bartlett from all responsibilities. Bartlett allocated them a sledge, a tent, six gallons of oil, a rifle and ammunition and food for 50 days.[70] They left on 5 February; the last sighting of them was a few days later, by Chafe and the Inuit, returning from their abortive trip to Herald Island. They found Mackay's party struggling to make headway, with some of their provisions lost and clothing and other equipment discarded to lighten their load. Beuchat in particular was in a distressed state, nearly delirious and in the throes of hypothermia. However, the party refused assistance and rejected Chafe's pleas that they return with him to Shipwreck Camp.[69] Thereafter the only hint of their fate was a sailor's scarf belonging to Morris, later found buried in an ice floe. It was assumed that the four had either been crushed by the ice, or had fallen through it.[71]",
				"after": "Bartlett's party now consisted of eight Karluk crew members (himself, engineers John Munro and Robert Williamson, seamen Hugh Williams and Fred Maurer, fireman George Breddy, cook Robert Templeman, and Chafe), three scientists (McKinlay, Mamen and geologist George Malloch), John Hadley, and five Inuit (the family of four and Kataktovik). Hadley, nearing 60 years of age,[32] was one of the few, along with Bartlett and the Inuit, with experience of travelling for distances over ice.[23] Bartlett sent his forces out, in groups, to blaze a trail and lay down supply depots on the route to Wrangel Island, thus preparing his inexperienced party for the hazards of ice travel.[72] When he felt they were ready for the main journey he divided them into four teams and sent the first two away on 19 February. Bartlett himself led the last two groups from the camp on 24 February, leaving a note of the party's location in a copper drum in case the camp should drift into an inhabited area. The distance to Wrangel Island was estimated at 40 miles (64 km), but the journey proved to be twice that in length.[21]",
			"color": "dim|0.37961 gray|0.37961 dim|0.37961 grey|0.37961 gray|0.21811 grey|0.21811 dark|0.06387 gray|0.06387 dark|0.06387 grey|0.06387 blanched|0.038369 almond|0.038369 beige|0.037329 papaya|0.036907 whip|0.036907 light|0.036293 golden|0.036293 rod|0.036293 yellow|0.036293 corn|0.035968 silk|0.035968 lemon|0.03274 chiffon|0.03274 light|0.031618 yellow|0.031618 antique|0.023652 white|0.023652 bisque|0.017154 wheat|0.01713 silver|0.011628 old|0.0058596 lace|0.0058596 ivory|0.0035246 light|0.0032621 gray|0.0032621 light|0.0032621 grey|0.0032621  "
		}
	}
}
