{
	"add": {
		"doc": {
			"id": "6a94e96a6e774bd281bef5b854431141e81af093f45a23db3bce34f6062d7421",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Lucretia_Garfield_-_Brady-Handy.jpg/220px-Lucretia_Garfield_-_Brady-Handy.jpg",
				"previous": "At Geauga Academy, which he attended from 1848 to 1850, Garfield learned academic subjects he had not previously had time for. He shone as a student, and was especially interested in languages and elocution. He began to appreciate the power a speaker had over an audience, writing that the speaker's platform \"creates some excitement. I love agitation and investigation and glory in defending unpopular truth against popular error.\"[12] Geauga was co-educational, and Garfield was attracted to one of his fellow students, Lucretia Rudolph, whom he later married.[13] To support himself at Geauga, he worked as a carpenter's assistant and as a teacher.[14] The need to go from town to town to find a place as a teacher disgusted Garfield, and he thereafter developed a dislike of what he called \"place-seeking\", which became, he said, \"the law of my life\".[15] In later years, he would astound his friends by letting positions pass that could have been his with a little politicking.[15] Garfield had attended church more to please his mother than to worship God, but in his late teens underwent a religious awakening, and attended many camp meetings, at one of which he was born again. The next day, March 4, 1850, he was baptized into the Disciples by being submerged in the icy waters of the Chagrin River.[16]",
				"after": "After leaving Geauga, Garfield worked for a year at various jobs, including teaching.[17] Finding that some New Englanders worked their way through college, Garfield determined to do the same, and first sought a school that could prepare him for the entrance examinations. From 1851 to 1854, he attended the Western Reserve Eclectic Institute (later named Hiram College) in Hiram, Ohio, a school run by the Disciples. While there, he was most interested in the study of Greek and Latin, but was inclined to learn about and discuss any new thing he encountered.[18] Securing a position on entry as janitor, he was hired to teach while still a student.[19] Lucretia Rudolph had also enrolled at the Institute, and Garfield wooed her while teaching her Greek.[20] He developed a regular preaching circuit at neighboring churches, in some cases earning a gold dollar per service. By 1854, Garfield had learned all the Institute could teach him and was a full-time teacher.[21] Garfield then enrolled at Williams College in Williamstown, Massachusetts, as a third-year student, given credit for two year's study at the Institute after passing a cursory examination. Garfield was impressed with the college president, Mark Hopkins, who had responded warmly to Garfield's letter inquiring about admission. He said of Hopkins, \"The ideal college is Mark Hopkins on one end of a log with a student on the other.\"[22] Hopkins later stated about Garfield in his student days, \"There was a large general capacity applicable to any subject. There was no pretense of genius, or alternation of spasmodic effort, but a satisfactory accomplishment in all directions.\"[23] After his first term, Garfield was hired to teach penmanship to the students of nearby Pownal, Vermont—a post whose previous incumbent was Chester A. Arthur.[23]",
			"color": " "
		}
	}
}
