{
	"add": {
		"doc": {
			"id": "6a9e976257fc2dbed67588f7d3ee0ac89af200211a1a3fb256578b19a5eb203b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Noisy_Miner_pointing.JPG/220px-Noisy_Miner_pointing.JPG",
				"previous": "The noisy miner engages in most activities in a group. Roosting, foraging, preening, bathing and dust-bathing or anting are communal activities. Dawn song is a communal chorus, particularly during the breeding season. The communal interaction is facilitated by ritualised displays that have been categorised as flight displays, postural displays, and facial displays. In 'long flight' displays, initiated by either male or female birds, groups of up to twenty birds from more than one coterie fly about 40 metres (130 ft) above the canopy for distances of up to 1.5 kilometres (0.93 mi) from the colony, constantly calling and not returning to the colony for about twenty minutes. As they return the remaining birds show signs of agitation, and sometimes fly up to join them. The 'short flight' display is performed by the male, and may be analogous to the territorial advertising displays of other birds. In a ritualised movement, the noisy miner flies out from a perch across an open area, in a rhythmic undulating pattern, usually calling in flight. At the end of the clearing it turns on an upward swoop and flies silently back to a perch near the starting point. The 'head-up flight' is performed by the female during the nesting period, and may function to attract male helpers. In its most intense form the body and tail are held almost vertically, with legs dangling and the head held up and back. It is performed by the female when she is selecting the nest site, and when carrying nest-building material, and probably has the function of indicating the location of the nest to other group members.[43]",
				"after": "Postural displays include tall and low poses, pointing, open bill, and wing waving. The 'tall posture' is used when in close contact with another bird and is a mild threat. The bird holds itself upright with neck and legs stretched, and it faces the other bird. The 'low posture' is a submissive gesture; the bird sits low on the perch with legs obscured by fluffed feathers and often faces away from the other bird. Fledglings threatened by adult birds will adopt a low posture and open their bill widely. 'Pointing' is a threat display where the bird stretches out horizontally, with feathers sleeked and the bill pointed at the target of the aggression. A bill snap will sometimes accompany pointing. An 'open bill display' is used by subordinates in encounters between two birds, and by a female on the nest when other birds approach. The 'trident bill display' involves a fully open bill with the tongue raised and protruding and is a higher-intensity submissive display. 'Wing waving' is often performed at the same time as an open bill display. The wings are flexed and held slightly away from the body, and flapped out and up around three to six times. Wing waving may be accompanied by a yammer call. 'Eagle' displays involve holding the wings and tail spread out, in either a vertical or horizontal position.[43]",
			"color": "saddle|0.15283 brown|0.15283 peach|0.13871 puff|0.13871 gray|0.11027 grey|0.11027 dark|0.087273 gray|0.087273 dark|0.087273 grey|0.087273 silver|0.064175 bisque|0.058228 dim|0.052069 gray|0.052069 dim|0.052069 grey|0.052069 light|0.049594 gray|0.049594 light|0.049594 grey|0.049594 gainsboro|0.036979 blanched|0.029354 almond|0.029354 sienna|0.023467 antique|0.01942 white|0.01942 papaya|0.019148 whip|0.019148 wheat|0.016117 misty|0.013163 rose|0.013163 burly|0.0092264 wood|0.0092264 dark|0.008647 olive|0.008647 green|0.008647 linen|0.007516 rosy|0.0074425 brown|0.0074425 tan|0.0073901 moccasin|0.0067579 lavender|0.0059033 blush|0.0059033 white|0.0058172 smoke|0.0058172 lavender|0.0057691 corn|0.0053657 silk|0.0053657 sea|0.0043679 shell|0.0043679 old|0.0042978 lace|0.0042978  "
		}
	}
}
