{
	"add": {
		"doc": {
			"id": "6aa56db03b5da56d9c22265188b45fbdd995f243fb90b27c0cf1a9fb98bfd734",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/050706_005_dorset_nothe.jpg/220px-050706_005_dorset_nothe.jpg",
				"previous": "There are over two hundred events held throughout the year in the borough,[53] including firework festivals, dragon boat racing, beach volleyball,[54] handball[55] and motocross,[56] and the annual carnival in mid-August, which attracts around 70,000 people each year.[9][53] Weymouth is the only port in the world to have hosted the start of The Tall Ships' Races three times[57]—in 1983, 1987 and 1994; the 1994 race attracting 300,000 spectators.[58]",
				"after": "The Pavilion Theatre was built in 1960 on a peninsula of reclaimed land between the harbour and the esplanade, after the Ritz Theatre was destroyed by fire in 1954.[59] The Pavilion was owned and operated by Weymouth and Portland Borough Council, providing a venue for local community groups and schools, and hosting seasonal 'end-of-the-pier' entertainment and year-round shows and events. It was announced in 2006 that the Pavilion complex and 4 hectares (10 acres) of its surroundings would be entirely redeveloped from 2008 to 2011, in time for the 2012 Summer Olympics. The proposed complex was to include a refurbished theatre, a World Heritage Site visitors' centre, a new ferry terminal, a 140 bed 4-star hotel, an underground car park, a shopping arcade, offices, around 340 luxury apartments, 110 affordable homes, public squares, promenades, and a 290-berth marina.[60] Delays to the project mean it was unlikely to be completed in time for the 2012 Summer Olympics[61] and the redevelopment never took place. In November 2012 Weymouth and Portland Borough Council announced the intended closure and demolition of the theatre, with the site closing on 31 May 2013. Following a formal tender process the theatre was leased to local businessmen Phil Say and reopened on 13 July 2013. Weymouth Pavilion is now operated by Weymouth Pavilion CIC as a not-for-profit organisation.[62]",
			"color": "black|0.69974 dim|0.11599 gray|0.11599 dim|0.11599 grey|0.11599 olive|0.082074 drab|0.082074 dark|0.033398 olive|0.033398 green|0.033398 gray|0.021859 grey|0.021859 olive|0.010454 dark|0.0097388 gray|0.0097388 dark|0.0097388 grey|0.0097388  "
		}
	}
}
