{
	"add": {
		"doc": {
			"id": "6acccdf214e1688e454b605d27346ef3ed5d677d6a76881b04f5ce2f9c3ae326",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Airbus_Lagard%C3%A8re_-_GP7200_engine_MSN108_%281%29.JPG/220px-Airbus_Lagard%C3%A8re_-_GP7200_engine_MSN108_%281%29.JPG",
			"previous": [],
				"after": "The turbofan or fanjet is a type of airbreathing jet engine that is widely used in aircraft propulsion. The word \"turbofan\" is a portmanteau of \"turbine\" and \"fan\": the turbo portion refers to a gas turbine engine which takes mechanical energy from combustion,[1] and the fan, a ducted fan that uses the mechanical energy from the gas turbine to accelerate air rearwards. Thus, whereas all the air taken in by a turbojet passes through the turbine (through the combustion chamber), in a turbofan some of that air bypasses the turbine. A turbofan thus can be thought of as a turbojet being used to drive a ducted fan, with both of those contributing to the thrust. The ratio of the mass-flow of air bypassing the engine core compared to the mass-flow of air passing through the core is referred to as the bypass ratio. The engine produces thrust through a combination of these two portions working in concert; engines that use more jet thrust relative to fan thrust are known as low bypass turbofans, conversely those that have considerably more fan thrust than jet thrust are known as high bypass. Most commercial aviation jet engines in use today are of the high-bypass type, and most modern military fighter engines are low-bypass.[citation needed] Afterburners are not used on high-bypass turbofan engines but may be used on either low-bypass turbofan or turbojet engines.",
			"color": "black|0.17203 gray|0.10962 grey|0.10962 dim|0.1003 gray|0.1003 dim|0.1003 grey|0.1003 dark|0.097285 gray|0.097285 dark|0.097285 grey|0.097285 silver|0.063784 light|0.049873 gray|0.049873 light|0.049873 grey|0.049873 dark|0.046899 khaki|0.046899 gainsboro|0.03519 beige|0.028416 antique|0.027218 white|0.027218 tan|0.025952 papaya|0.017691 whip|0.017691 corn|0.015926 silk|0.015926 linen|0.01531 blanched|0.014567 almond|0.014567 old|0.01444 lace|0.01444 dark|0.013214 slate|0.013214 gray|0.013214  "
		}
	}
}
