{
	"add": {
		"doc": {
			"id": "6ace718552f137cb4482f9a538208bf8146999b666f91c085466af57f889024b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Solar_Life_Cycle.svg/800px-Solar_Life_Cycle.svg.png",
				"previous": "Earth's increasing surface temperature will accelerate the inorganic CO2 cycle, reducing its concentration to levels lethally low for plants (7001100000000000000♠10 ppm for C4 photosynthesis) in approximately 500-7016284018400000000♠900 myr.[70] The lack of vegetation will result in the loss of oxygen in the atmosphere, so animal life will become extinct within several million more years.[75] After another billion years all surface water will have disappeared[71] and the mean global temperature will reach 7002343150000000000♠70 °C[75] (7002343150000000000♠158 °F). Earth is expected to be effectively habitable for about another 7016157788000000000♠500 myr from that point,[70] although this may be extended up to 7016725824800000000♠2.3 byr if the nitrogen is removed from the atmosphere.[72] Even if the Sun were eternal and stable, 27% of the water in the modern oceans will descend to the mantle in one billion years, due to reduced steam venting from mid-ocean ridges.[76]",
				"after": "The Sun, as part of its evolution, will become a red giant in about 7017157788000000000♠5 byr. Models predict that the Sun will expand to roughly 1 AU (150,000,000 km), which is about 250 times its present radius.[73][77] Earth's fate is less clear. As a red giant, the Sun will lose roughly 30% of its mass, so, without tidal effects, Earth will move to an orbit 1.7 AU (250,000,000 km) from the Sun, when the star reaches its maximum radius. The planet was, therefore, initially expected to escape envelopment by the expanded Sun's sparse outer atmosphere, though most, if not all, remaining life would have been destroyed by the Sun's increased luminosity (peaking at about 5,000 times its present level).[73] A 2008 simulation indicates that Earth's orbit will decay due to tidal effects and drag, causing it to enter the red giant Sun's atmosphere and be vaporized.[77] After that, the Sun's core will collapse into a white dwarf, as its outer layers are ejected into space as a planetary nebula. The matter that once made up Earth will be released into interstellar space, where it may one day become incorporated into a new generation of planets and other celestial bodies.",
			"color": "black|0.30812 light|0.10313 pink|0.10313 olive|0.055918 khaki|0.044744 sandy|0.042618 brown|0.042618 peru|0.041803 pale|0.041333 golden|0.041333 rod|0.041333 light|0.022718 salmon|0.022718 floral|0.021828 white|0.021828 sea|0.020702 shell|0.020702 mint|0.020685 cream|0.020685 white|0.020106 snow|0.019949 white|0.019817 smoke|0.019817 azure|0.018111 ghost|0.017931 white|0.017931 alice|0.017227 blue|0.017227 dark|0.016761 salmon|0.016761 dim|0.016192 gray|0.016192 dim|0.016192 grey|0.016192 lemon|0.014991 chiffon|0.014991 lavender|0.012462 blush|0.012462 light|0.011838 golden|0.011838 rod|0.011838 yellow|0.011838 ivory|0.011033 light|0.0084663 yellow|0.0084663 dark|0.007169 gray|0.007169 dark|0.007169 grey|0.007169 corn|0.0069979 silk|0.0069979 beige|0.006234 gray|0.0062049 grey|0.0062049 old|0.0060357 lace|0.0060357 lavender|0.0060293 linen|0.0054901  "
		}
	}
}
