{
	"add": {
		"doc": {
			"id": "6af61e3c2250143a13c687340298fd2466c1e868607932178e683a5ffdc557be",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Cob_Normand_Haras_St_Lo_002.jpg/220px-Cob_Normand_Haras_St_Lo_002.jpg",
				"previous": "A multi-purpose breed,[5] the Norman Cob was formerly used wherever there was a need.[13] It was utilized in a variety of agricultural and other work by farmers,[5][6][13] and was used by the army for pulling artillery. The postal service used it to pull mail carriages,[20] which it was capable of doing at a fast trot over bad roads for long distances. Postal workers appreciated the breed for its willingness to remain calm, stationary and tethered for long periods of time.[12] Due to the modernization of agriculture and transport, it is now used very little in these areas.[10]",
				"after": "The breed is popular for recreational and competitive driving,[6] to which it is well suited in temperament.[1][30] In 1997, the rules of driving events in France were modified to take into account the speed of execution of the course, which made lighter, faster horses more competitive. The Norman Cob and the lighter type of Boulonnais were particularly affected.[35] The Norman Cob's gaits,[30] calm temperament and willingness to master technical movements make it an excellent competitor,[7] and in 2011, more than a third of the horses represented in the French driving championships were Norman Cobs.[36] Many Norman Cobs represent France in driving events at the international level.[9][37]",
			"color": "dark|0.16092 gray|0.16092 dark|0.16092 grey|0.16092 gray|0.13693 grey|0.13693 dim|0.13548 gray|0.13548 dim|0.13548 grey|0.13548 silver|0.10385 light|0.090948 gray|0.090948 light|0.090948 grey|0.090948 gainsboro|0.082603 black|0.071031 white|0.0288 smoke|0.0288 dark|0.02173 slate|0.02173 gray|0.02173 linen|0.019804 alice|0.018604 blue|0.018604 ghost|0.017388 white|0.017388 sea|0.016875 shell|0.016875 snow|0.016707 mint|0.014042 cream|0.014042 slate|0.012746 gray|0.012746 white|0.012681 light|0.0096341 slate|0.0096341 gray|0.0096341 azure|0.0095044 floral|0.0085843 white|0.0085843 lavender|0.0067036 blush|0.0067036  "
		}
	}
}
