{
	"add": {
		"doc": {
			"id": "6b04c8266400a2a04392b8faf74fcad7a58d4ab4ba7f944ae5ac4c47708d4082",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Vanport_flood.NWS.jpg/220px-Vanport_flood.NWS.jpg",
				"previous": "After the start of the war with Japan, President Franklin D. Roosevelt signed an order for internment of all the people of Japanese ancestry who lived on the West Coast. About 1,700 of them lived in Portland, and some had farms or businesses near the slough. When the government removed them from their homes in 1942, it housed them temporarily in the Livestock Exposition Center (Expo Center) in Kenton before sending them to internment camps further inland. They were not allowed to return until 1945.[56]",
				"after": "In 1942, Kaiser Shipbuilding Company began making ships for the war at three huge installations near the lower slough, one in St. Johns, one on Swan Island in Portland's Overlook neighborhood, and one in Vancouver, Washington.[57] St. Johns and Vancouver made Liberty ships, while Swan Island made tankers.[57] The St. Johns shipyard became the nation's leading producer of Liberty ships.[57] To house shipyard workers and their families, Henry J. Kaiser bought 650 acres (260 ha) of former marsh, pasture, and farmland in the lower slough watershed surrounded on all sides by dikes between 15 and 25 feet (5 and 8 m) high.[55] Here he built a new city, at first called Kaiserville and later Vanport. By 1943, Vanport's population of 39,000 made it the second largest city in Oregon and the largest wartime housing project in the U.S.[55] After the war, the population fell to about 18,500.[55] This was roughly the number of people living there on May 30, 1948, when a flood broke through Vanport's western levee.[55] The break occurred during the afternoon of a day with mild weather.[58] The first rush of water soon became a \"creeping inundation\",[58] slowed in its advance for 35 to 40 minutes by water-absorbing sloughs.[58] The water's gradual rise within the city allowed most of the residents to escape drowning. The county coroner's official list of bodies recovered was set at fifteen, and seven people on a list of missing people were never found.[59] The flood destroyed the city, which was never rebuilt.[55]",
			"color": "tan|0.32137 wheat|0.29461 black|0.078154 burly|0.075286 wood|0.075286 bisque|0.067715 peach|0.037845 puff|0.037845 moccasin|0.030628 navajo|0.02444 white|0.02444 blanched|0.022701 almond|0.022701 dark|0.00931 khaki|0.00931 papaya|0.0072285 whip|0.0072285 pale|0.0067059 golden|0.0067059 rod|0.0067059 antique|0.0057461 white|0.0057461  "
		}
	}
}
