{
	"add": {
		"doc": {
			"id": "6b10112eb0c7faf35f706e56c8d0487c08c8ecfcc49ef2fc39a94a1227963b7e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Mascarene_Parrot.jpg/220px-Mascarene_Parrot.jpg",
				"previous": "Several later authors instead described the body as brown and the head as bluish-lilac, based on stuffed specimens, and this has become the orthodox image of the bird. Live birds were never described with these colours. Hume has proposed that this colouration is an artifact of the taxidermy specimens having aged and being exposed to light, which can turn grey and black to brown. Such a transformation has also turned an aberrant dickcissel specimen (sometimes referred to as a distinct species, Townsend's dickcissel, Spiza townsendi) from grey to brown.[2]",
				"after": "Confusion over the colouration of the Mascarene parrot has also been furthered by a plate by French engraver and naturalist François-Nicolas Martinet in Buffon's 1779 Histoire Naturelle Des Oiseaux, the first coloured illustration of this species. It shows the bird as brown with a purplish head, and the strength of these colours differs considerably between copies, a result of having been hand-coloured by many different artists who worked under Martinet in his workshop. Across these copies, the body ranges from chestnut brown to greyish chocolate, the tail from light grey to blackish grey-brown, and the head from bluish-grey to dove-grey. The plate also lacks two dark central tail feathers without white bases, a feature described by Brisson, and these features have been repeated by subsequent artists. The illustration and Buffon's description were perhaps based on the Paris specimen which had its tail and wing feathers feathers severely damaged by sulphuric acid in an attempt at fumigation.[2] The Vienna specimen is partially albinistic and has white feathers on the tail, back, and wings.[11] It therefore cannot be used for comparison either.[2]",
			"color": "white|0.088815 smoke|0.088815 sea|0.086848 shell|0.086848 linen|0.085874 snow|0.085809 floral|0.08135 white|0.08135 white|0.077794 gainsboro|0.062244 ghost|0.061959 white|0.061959 lavender|0.061318 blush|0.061318 mint|0.058847 cream|0.058847 old|0.056336 lace|0.056336 alice|0.029693 blue|0.029693 dark|0.028428 gray|0.028428 dark|0.028428 grey|0.028428 light|0.025212 gray|0.025212 light|0.025212 grey|0.025212 gray|0.023429 grey|0.023429 silver|0.022391 dim|0.021274 gray|0.021274 dim|0.021274 grey|0.021274 ivory|0.01955 azure|0.007695 antique|0.0051592 white|0.0051592 black|0.004619 misty|0.0031378 rose|0.0031378  "
		}
	}
}
