{
	"add": {
		"doc": {
			"id": "6b2eae3fda4c1f3942682fa3c2293d284ea25fd6a82d4ef65d5eff397d726991",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Indian_collecting_cochineal.jpg/220px-Indian_collecting_cochineal.jpg",
			"previous": [],
				"after": "Cochineal dye was used by the Aztec and Maya peoples of Central and North America. Eleven cities conquered by Montezuma in the 15th century paid a yearly tribute of 2000 decorated cotton blankets and 40 bags of cochineal dye each.[4] Production of cochineal is depicted in Codex Osuna. During the colonial period, the production of cochineal (grana fina) grew rapidly. Produced almost exclusively in Oaxaca by indigenous producers, cochineal became Mexico's second-most valued export after silver.[5] Soon after the Spanish conquest of the Aztec Empire, it began to be exported to Spain, and by the 17th century was a commodity traded as far away as India.[6] The dyestuff was consumed throughout Europe and was so highly prized, its price was regularly quoted on the London and Amsterdam Commodity Exchanges. In 1777, French botanist Nicolas-Joseph Thiéry de Menonville, presenting himself as a botanizing physician, smuggled the insects and pads of the Opuntia cactus to Saint Domingue. This particular collection failed to thrive and ultimately died out, leaving the Mexican monopoly intact.[7] After the Mexican War of Independence in 1810–1821, the Mexican monopoly on cochineal came to an end. Large-scale production of cochineal emerged, especially in Guatemala and the Canary Islands; it was also cultivated in Spain and North Africa.[6]",
			"color": "light|0.26063 gray|0.26063 light|0.26063 grey|0.26063 gainsboro|0.24525 silver|0.13014 linen|0.036012 white|0.032812 smoke|0.032812 tan|0.029948 dark|0.029907 gray|0.029907 dark|0.029907 grey|0.029907 wheat|0.021501 burly|0.021305 wood|0.021305 antique|0.019983 white|0.019983 lavender|0.01474 blush|0.01474 alice|0.013952 blue|0.013952 lavender|0.013737 ghost|0.013331 white|0.013331 sea|0.0097734 shell|0.0097734 snow|0.0096382 gray|0.0074738 grey|0.0074738 misty|0.0066426 rose|0.0066426 old|0.0065513 lace|0.0065513 indian|0.0064686 red|0.0064686 peru|0.0063891 bisque|0.0057704 dark|0.0047364 khaki|0.0047364 navajo|0.0047265 white|0.0047265 blanched|0.0044233 almond|0.0044233 moccasin|0.0042803 floral|0.0040403 white|0.0040403 white|0.0040023 papaya|0.0039899 whip|0.0039899 beige|0.003558 pale|0.0032903 golden|0.0032903 rod|0.0032903  "
		}
	}
}
