{
	"add": {
		"doc": {
			"id": "6b366a346a7539f60534c4883be68e3fd8b96b270c75dd87e23fe157e9af8f31",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Banksia_menziesii_1_gnangarra.jpg/220px-Banksia_menziesii_1_gnangarra.jpg",
				"previous": "Banksia menziesii grows either as a gnarled tree to 10 m (35 ft), or a lower spreading 1–3 metre (4–10 ft) shrub, generally encountered at its northern limits in the vicinity of Eneabba-Mount Adams; thus, it declines steadily in size as the climate becomes warmer and dryer further north.[2] In the shrub form, several stems arise from the woody base known as the lignotuber. The trunk is greyish, sometimes with shades of brown or pink, and the 2–3 cm (1 in) thick rough bark breaks away easily. The new growth is covered in fine brownish hair, which wears away after two or three years, leaving smooth stems and leaves.[3] Stems which will bear flower spikes the following year are generally thicker and longer.[4] Oblong in shape and somewhat truncate at the tips, the leaves are grey-green in colour, 8–25 cm (3–10 in) long and up to 4 cm (1.6 in) wide. The new leaves are paler and finely downy. The leaf margins are serrated with many small 1–2 mm long triangular teeth. The lower surface of the leaf has a midrib covered in fine pale brown hair.[3]",
				"after": "Flowering occurs in autumn and winter, peaking from May to July. Overall the inflorescences, or flower spikes, take around eight months to development from the first microscopic changes in late spring.[5] Ovoid to cylindrical in shape, the flower spikes can be up to 7–8 cm (2.6–3.4 in) wide and 4–12 cm (1.6–4.8 in) high.[3] They are composed of numerous individual flowers; one field study south of Perth recorded an average of 1043 per flower spike,[6] while another on plants in cultivation in South Australia recorded an average of 720.[7] B. menziesii has more flower colour variants than any other Banksia species, with flower spikes occurring in a wide range of pinks, as well as chocolate, bronze, yellow and white, and greenish variants. They are particularly striking closeup but can look indistinct from a distance. They are most attractive in late bud, the styles contrasting well to the body of the inflorescence, the whole looking like a red- or pink-and white vertical candy striped bloom. The inflorescences are generally a deeper red after colder weather and further into the winter.[8] Anthocyanin pigments are responsible for the red and pink shades in the flowers.[9]",
			"color": "brown|0.15693 sienna|0.1431 dark|0.081211 salmon|0.081211 indian|0.07477 red|0.07477 rosy|0.071195 brown|0.071195 maroon|0.056109 burly|0.041971 wood|0.041971 saddle|0.033148 brown|0.033148 tan|0.031 peach|0.02285 puff|0.02285 thistle|0.021917 light|0.020012 coral|0.020012 pink|0.019867 misty|0.016604 rose|0.016604 light|0.014751 pink|0.014751 lavender|0.013452 blush|0.013452 dark|0.012274 red|0.012274 peru|0.010723 light|0.0099608 salmon|0.0099608 navajo|0.0095595 white|0.0095595 wheat|0.0093011 firebrick|0.0091716  "
		}
	}
}
