{
	"add": {
		"doc": {
			"id": "6b439b4414bc6ac31f504670637315fb4c4020798e4d1ad0706ff138f40a9c10",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/CBSNewsRemote1937.jpg/220px-CBSNewsRemote1937.jpg",
				"previous": "The extraordinary potential of radio news showed itself in 1930, when CBS suddenly found itself with a live telephone connection to a prisoner called \"The Deacon\" who described, from the inside and in real time, a riot and conflagration at the Ohio Penitentiary; for CBS, it was \"a shocking journalistic coup\".[34] Yet as late as 1934, there was still no regularly scheduled newscast on network radio: \"Most sponsors did not want network news programming; those that did were inclined to expect veto rights over it.\"[35] There had been a longstanding wariness between radio and the newspapers as well; the papers had rightly concluded that the upstart radio business would compete with them on two counts – advertising dollars and news coverage. By 1933, they fought back, many no longer publishing radio schedules for readers' convenience, or allowing \"their\" news to be read on the air for radio's profit.[36] Radio, in turn, pushed back when urban department stores, newspapers' largest advertisers and themselves owners of many radio stations, threatened to withhold their ads from print.[37] A short-lived attempted truce in 1933 even saw the papers proposing that radio be forbidden from running news before 9:30 a.m., and then only after 9:00 p.m. – and that no news story could air until it was 12 hours old.[38]",
				"after": "It was in this climate that Paley set out to \"enhance the prestige of CBS, to make it seem in the public mind the more advanced, dignified and socially aware network\".[39] He did it through sustaining programming like the New York Philharmonic, the thoughtful drama of Norman Corwin – and an in-house news division to gather and present news, free of fickle suppliers like newspapers and wire services.[39] In the fall of 1934, CBS launched an independent news division, shaped in its first years by Paley's vice-president, former New York Times columnist Ed Klauber, and news director Paul White. Since there was no blueprint or precedent for real-time news coverage, early efforts of the new division used the shortwave link-up CBS had been using for five years[40] to bring live feeds of European events to its American air.",
			"color": " "
		}
	}
}
