{
	"add": {
		"doc": {
			"id": "6b43ccbf21b6be07b3783bb915157ac699e68e92ac8199b8a625af132d6ea343",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Binding_energy_curve_-_common_isotopes.svg/220px-Binding_energy_curve_-_common_isotopes.svg.png",
				"previous": "In a similar way, the particular energetic stability of the helium-4 nucleus, produced by similar effects, accounts for the ease of helium-4 production in atomic reactions involving both heavy-particle emission, and fusion. Some stable helium-3 is produced in fusion reactions from hydrogen, but it is a very small fraction, compared with the highly favorable helium-4.",
				"after": "The unusual stability of the helium-4 nucleus is also important cosmologically: it explains the fact that in the first few minutes after the Big Bang, as the \"soup\" of free protons and neutrons which had initially been created in about 6:1 ratio cooled to the point that nuclear binding was possible, almost all first compound atomic nuclei to form were helium-4 nuclei. So tight was helium-4 binding that helium-4 production consumed nearly all of the free neutrons in a few minutes, before they could beta-decay, and also leaving few to form heavier atoms such as lithium, beryllium, or boron. Helium-4 nuclear binding per nucleon is stronger than in any of these elements (see nucleogenesis and binding energy) and thus no energetic drive was available, once helium had been formed, to make elements 3, 4 and 5. It was barely energetically favorable for helium to fuse into the next element with a lower energy per nucleon, carbon. However, due to lack of intermediate elements, this process requires three helium nuclei striking each other nearly simultaneously (see triple alpha process). There was thus no time for significant carbon to be formed in the few minutes after the Big Bang, before the early expanding universe cooled to the temperature and pressure point where helium fusion to carbon was no longer possible. This left the early universe with a very similar ratio of hydrogen/helium as is observed today (3 parts hydrogen to 1 part helium-4 by mass), with nearly all the neutrons in the universe trapped in helium-4.",
			"color": "white|0.10013 smoke|0.10013 alice|0.099649 blue|0.099649 ghost|0.099639 white|0.099639 sea|0.099592 shell|0.099592 snow|0.099591 white|0.099455 mint|0.099031 cream|0.099031 floral|0.098304 white|0.098304 azure|0.097808 lavender|0.097324 blush|0.097324 gainsboro|0.0026456  "
		}
	}
}
