{
	"add": {
		"doc": {
			"id": "6b5bf74bc30c44ca89b01338cbac2037ee063e6d869f920807ca1c2eeed6fa0c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Barack_Obama_meets_his_staff_in_Air_Force_One_Conference_Room.jpg/220px-Barack_Obama_meets_his_staff_in_Air_Force_One_Conference_Room.jpg",
				"previous": "In response to this reported threat, Col. Tillman said he flew Air Force One out into the Gulf of Mexico to test whether the other aircraft would follow. The other jet continued on its route, and Tillman said that it was later explained to him that an airliner had lost its transponder and that the pilots on-board neglected to switch to another radio frequency. The transponder of a plane broadcasts an electronic identification signal of itself.[31] A threat came again when Tillman received a message warning of an imminent attack on Air Force One. \"We got word from the vice president and the staff that 'Angel was next.' Angel being the classified call sign for the Air Force One. Once we got into the Gulf [of Mexico] and they passed to us that 'Angel was next,' at that point I asked for fighter support. If an airliner was part of the attack, it would be good to have fighters on the wing to go ahead and take care of us.\" At this point, Tillman said that the plan to fly the president back to Washington, DC was aborted and instead Tillman landed at Barksdale Air Force Base, Louisiana and Offutt Air Force Base, Nebraska, where the president made a speech. Tillman explained that this was due to his concern that because of the reported threat, Air Force One would be attacked when he returned to Andrews Air Force Base.[31]",
				"after": "After the preliminary stops, the president was returned to Washington. The next day, officials at the White House and the Justice Department explained that President Bush did this because there was \"specific and credible information that the White House and Air Force One were also intended targets.\"[32] The White House later could not confirm evidence of a threat made against Air Force One, and subsequent investigation found the original claim to be a result of miscommunication.[33]",
			"color": "black|0.27621 rosy|0.046479 brown|0.046479 dark|0.044178 gray|0.044178 dark|0.044178 grey|0.044178 dim|0.040255 gray|0.040255 dim|0.040255 grey|0.040255 silver|0.032698 gray|0.029906 grey|0.029906 light|0.027185 steel|0.027185 blue|0.027185 light|0.025647 gray|0.025647 light|0.025647 grey|0.025647 white|0.025544 smoke|0.025544 lavender|0.024062 snow|0.023182 floral|0.022873 white|0.022873 sea|0.022861 shell|0.022861 white|0.022487 mint|0.0222 cream|0.0222 gainsboro|0.021128 ghost|0.020684 white|0.020684 tan|0.020555 alice|0.020476 blue|0.020476 burly|0.019897 wood|0.019897 azure|0.017802 lavender|0.014168 blush|0.014168 linen|0.012949 ivory|0.012497 light|0.010671 slate|0.010671 gray|0.010671 slate|0.010633 gray|0.010633 old|0.010506 lace|0.010506 thistle|0.010358 antique|0.0080471 white|0.0080471 honeydew|0.006998 beige|0.0066241  "
		}
	}
}
