{
	"add": {
		"doc": {
			"id": "6b5b5e56fbc291e55daf008f2ec8322936afa079869b0abf22a3979acb9edb0a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/EgyptAir_Boeing_737-200Adv_SU-AYO_ZRH_Sep_1979.png/220px-EgyptAir_Boeing_737-200Adv_SU-AYO_ZRH_Sep_1979.png",
				"previous": "EgyptAir inherited UAA‍‍ '​‍s staff, equipment, assets and liabilities. On 19 March 1972, a Douglas DC-9-32 carrying Yugoslav registration YU-AHR crashed into the Shamsam Mountains, 4 miles (6.4 km) southwest of Aden, killing all 30 occupants on board. On 16 June, an Ilyushin Il-62 (SU-ARN) was involved in a landing accident with no reported fatalities. In July, eight Tupolev Tu-154s were ordered for US$60 million, with three of them slated for delivery in July 1973 (1973-07), three in November 1973 (1973-11) and two in March 1974 (1974-03).[37] Prior to firming the transaction up EgyptAir had also considered the Boeing 727, but financing for these US-manufactured aircraft could not be arranged.[38] Under the terms of the contract, light maintenance was to be performed in Egypt, whereas airframe and engine overhauling was to be undertaken in the Soviet Union.[39] In July 1972 (1972-07), the acquisition of four Boeing 707-320Cs valued at US$40 million was announced. At this time, the airline had four Boeing 707s already in operation. The handover of the new aircraft had been arranged for March, May, June and September 1973 (1973-09).[37] On 5 December 1972, one of the four 707s already in the fleet (SU-AOW) crashed near Cairo while on a training flight. The crew of six perished in the accident. Reports indicating the airframe had been shot down were denied by the Egyptian government.[40] An Ilyushin Il-18, registration SU-AOY, was involved in a deadly accident near Nicosia on 29 January 1973 when it crashed into mountainous terrain, killing all 37 occupants on board.[41] Delivery of the four new Boeing 707s took place during the year, with two more 707-320Cs being ordered in September. In October the three Il-62s were returned to Aeroflot because of elevated operational costs and technical issues.[37] Also that month,[37] the first Tu-154 entered the fleet and was used for pilot training.[39] From Moscow, the handover of the Tu-154s was made through London-Heathrow, where these aircraft were fitted with British-made seats.[39]",
				"after": "The outbreak of the Yom Kippur War in 1973 had forced the carrier to suspend the Tokyo service; it was resumed on 15 March 1974 via Bombay, Bangkok and Manila. During 1974, the flight to Khartoum was extended to Kinshasa.[37] One of the brand new Tu-154 aircraft, SU-AXO, crashed on 10 July 1974 after takeoff from Cairo International Airport during a training flight, killing a crew of six on board.[42] Following the crash EgyptAir requested the return of its Tu-154 fleet to the Soviets and a refund for the price paid for them.[43] The capacity shortage caused by the grounding of the Tu-154s was partly alleviated by the lease of aircraft.[44] The airline had already been looking for other aircraft to replace them, and an order for six Douglas DC-9-50s was placed in November. On 9 December, an Il-18, registration YR-IMK, crashed into the Red Sea; there were nine fatalities. In January 1975 (1975-01), the government turned the order with Douglas down and moved to Boeing for the provision of new equipment. An agreement with the Soviets for the return of the Tu-154s was struck on 10 February; early in the year the An-24s were traded back to the company that represented the Soviets as a partial repayment for the loan taken to acquire the aft-engined Tu-154s. The Boeing order was finalised by March and consisted of four Boeing 727-200s and six Boeing 737-200s. There were plans to trade the first three Boeing 707-320Cs in for the new aircraft as part of the deal with Boeing.[37] Valued at US$60 million, the transaction was partly financed by the United Arab Emirates.[45] In May, the order was homogenised to eight Boeing 737-200s with deliveries slated for April and May 1976 (1976-05). Arrangements were made to sell the four Comets both to raise money to finance the new aircraft and to have an all-Boeing fleet.[46]",
			"color": "black|0.49442 light|0.10901 blue|0.10901 powder|0.074954 blue|0.074954 light|0.069455 steel|0.069455 blue|0.069455 dark|0.051147 slate|0.051147 gray|0.051147 light|0.048311 slate|0.048311 gray|0.048311 dim|0.041959 gray|0.041959 dim|0.041959 grey|0.041959 slate|0.039185 gray|0.039185 gray|0.024654 grey|0.024654 dark|0.017305 gray|0.017305 dark|0.017305 grey|0.017305 light|0.012776 cyan|0.012776  "
		}
	}
}
