{
	"add": {
		"doc": {
			"id": "6b7557145ad196733d153423ca5a02c4452c73ff332d931f70c557edd13329f1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Cory_Monteith_2009.jpg/170px-Cory_Monteith_2009.jpg",
				"previous": "Actors lacking theatrical experience needed to demonstrate, during their auditions, that they could also sing and dance. Chris Colfer had no previous professional experience, but Murphy wrote in the character Kurt Hummel for him.[39] Jayma Mays auditioned with the song \"Touch-a, Touch-a, Touch-a, Touch Me\" from The Rocky Horror Show, while Cory Monteith initially submitted a tape of himself acting only, and was requested to submit a second, musical tape, in which he sang \"a cheesy, '80s music-video-style version\" of REO Speedwagon's \"Can't Fight This Feeling\".[39] Kevin McHale came from a boy-band background, having previously been part of the group Not Like Them. He explained that the diversity of the cast's backgrounds reflects the range of different musical styles within the show itself: \"It's a mix of everything: classic rock, current stuff, R&B. Even the musical theatre stuff is switched up. You won't always recognize it.\"[39] Jane Lynch was originally supposed to have a recurring role,[40] but was made a series regular when a Damon Wayans pilot she was working on for ABC fell through.[41] The cast is contracted for a potential three Glee films,[42] with their contract stating that \"[The actor] hereby grants Fox three exclusive, irrevocable options to engage [the actor] in up to, respectively, three feature-length motion pictures.\"[43] Murphy said in December 2010 that he wasn't interested in doing a Glee movie \"as a story\", and added, \"I might do it as a live concert thing.\"[44] Glee: The 3D Concert Movie, filmed during the 2011 Glee Live! In Concert! tour, was released on August 12, 2011.[45]",
				"after": "Glee has featured as many as fifteen main roles with star billing, after starting with twelve. Morrison plays Will Schuester, McKinley High's Spanish teacher, who becomes glee-club director and hopes to restore it to its former glory.[27] Lynch plays Sue Sylvester, head coach of the \"Cheerios\" cheerleading squad, and the Glee Club's nemesis.[41] Mays appears as Emma Pillsbury, the school's mysophobic guidance counselor who has feelings for Will,[46] and Jessalyn Gilsig plays Terri Schuester, Will's wife whom he eventually divorces after five years of marriage and the discovery that she has faked being pregnant instead of revealing she had suffered a false pregnancy.[47] Michele plays Rachel Berry, talented star of the glee club who is often bullied by the Cheerios and football players, but grows closer to them as the show progresses. Rachel has an on-and-off relationship with Finn Hudson starting in season one; they become engaged in season three.[47] Monteith played Finn, star quarterback of the school's football team who risks alienation by his friends after joining the glee club.[47] Also in the club are Amber Riley as Mercedes Jones, a fashion-conscious diva who initially resents having to sing back-up; Colfer as Kurt Hummel, a fashionable gay male countertenor;[48] McHale as Artie Abrams, a guitar player and paraplegic; and Ushkowitz as Tina Cohen-Chang, an Asian American student with a fake speech impediment. Dianna Agron plays Quinn Fabray, Finn's cheerleader girlfriend, who later joins the glee club to keep an eye on him. Mark Salling plays Noah \"Puck\" Puckerman, a good friend of Finn's on the football team who at first disapproves of Finn joining the glee club, but later joins it himself. Naya Rivera and Heather Morris, who portray Cheerios and glee club vocalists Santana Lopez and Brittany Pierce respectively, were originally recurring actors, but were promoted to series regulars in the second season.[49] Mike O'Malley, who plays Kurt's father Burt Hummel, also became a series regular on season two.[50] Gilsig and O'Malley no longer appeared on the list of starring actors at the beginning of the third season, though O'Malley was a recurring guest star in at least six episodes during the season.[51] Two actors were promoted to series regulars as of the third season: Harry Shum, Jr. as football player and glee club member Mike Chang and Darren Criss as former Dalton Academy Warbler and new club member Blaine Anderson, both of whom started as recurring actors, Shum in the first season and Criss in the second.[52] For the fourth season, Chord Overstreet, who started as a recurring actor in the second season, playing glee club member Sam Evans, was promoted to the main cast,[53] while Agron and Mays were credited as recurring guest stars.",
			"color": "rosy|0.21568 brown|0.21568 dim|0.16456 gray|0.16456 dim|0.16456 grey|0.16456 lavender|0.1272 light|0.1 steel|0.1 blue|0.1 black|0.061734 ghost|0.02968 white|0.02968 alice|0.028414 blue|0.028414 pink|0.024959 gray|0.02471 grey|0.02471 lavender|0.023756 blush|0.023756 slate|0.021728 gray|0.021728 light|0.019759 slate|0.019759 gray|0.019759 white|0.018984 smoke|0.018984 snow|0.015682 misty|0.014066 rose|0.014066 white|0.013981 thistle|0.013952 dark|0.012295 gray|0.012295 dark|0.012295 grey|0.012295  "
		}
	}
}
