{
	"add": {
		"doc": {
			"id": "6b76afa22d93a0e2ed88da2547fedc6ed99236b333993a1c4a5100d076159300",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/TIG_Weld_low_magnification.jpg/220px-TIG_Weld_low_magnification.jpg",
				"previous": "Gas tungsten arc welding is most commonly used to weld stainless steel and nonferrous materials, such as aluminum and magnesium, but it can be applied to nearly all metals, with a notable exception being zinc and its alloys. Its applications involving carbon steels are limited not because of process restrictions, but because of the existence of more economical steel welding techniques, such as gas metal arc welding and shielded metal arc welding. Furthermore, GTAW can be performed in a variety of other-than-flat positions, depending on the skill of the welder and the materials being welded.[29]",
				"after": "Aluminum and magnesium are most often welded using alternating current, but the use of direct current is also possible, depending on the properties desired. Before welding, the work area should be cleaned and may be preheated to 175 to 200 °C (347 to 392 °F) for aluminum or to a maximum of 150 °C (302 °F) for thick magnesium workpieces to improve penetration and increase travel speed.[30] AC current can provide a self-cleaning effect, removing the thin, refractory aluminium oxide (sapphire) layer that forms on aluminium metal within minutes of exposure to air. This oxide layer must be removed for welding to occur.[30] When alternating current is used, pure tungsten electrodes or zirconiated tungsten electrodes are preferred over thoriated electrodes, as the latter are more likely to \"spit\" electrode particles across the welding arc into the weld. Blunt electrode tips are preferred, and pure argon shielding gas should be employed for thin workpieces. Introducing helium allows for greater penetration in thicker workpieces, but can make arc starting difficult.[30]",
			"color": "khaki|0.28389 pale|0.18351 golden|0.18351 rod|0.18351 black|0.11035 lemon|0.050707 chiffon|0.050707 dark|0.047881 golden|0.047881 rod|0.047881 dark|0.045569 khaki|0.045569 light|0.037137 golden|0.037137 rod|0.037137 yellow|0.037137 moccasin|0.035827 wheat|0.025312 light|0.02188 yellow|0.02188 navajo|0.020229 white|0.020229 corn|0.020115 silk|0.020115 beige|0.015754  "
		}
	}
}
