{
	"add": {
		"doc": {
			"id": "6b9b279a885d6ee4bca05f9f5c925f2d7051be987cc6d728efbd6578a7bf5dd1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Common_raves_landfill.jpg/220px-Common_raves_landfill.jpg",
				"previous": "In some places they are mainly scavengers, feeding on carrion as well as the associated maggots and carrion beetles. With large-bodied carrion, which they are not equipped to tear through as well as birds such as hook-billed vultures, they must wait for the prey to be torn open by another predator or flayed by other means.[58] Plant food includes cereal grains, berries and fruit. They prey on small invertebrates, amphibians, reptiles, small mammals and birds.[59] Ravens may also consume the undigested portions of animal feces, and human food waste. They store surplus food items, especially those containing fat, and will learn to hide such food out of the sight of other common ravens.[51] Ravens also raid the food caches of other species, such as the Arctic fox.[60] They sometimes associate with another canine, the grey wolf, as a kleptoparasite, following to scavenge wolf-kills in winter.[61] Ravens are regular predators at bird nests, brazenly picking off eggs, nestlings and sometimes adult birds when they spot an opportunity. They are considered perhaps the primary natural threat to the nesting success of the critically endangered California condor, since they readily take condor eggs and are very common in the areas where the species is being re-introduced.[62]",
				"after": "Common ravens nesting near sources of human garbage included a higher percentage of food waste in their diet, birds nesting near roads consumed more road-killed vertebrates, and those nesting far from these sources of food ate more arthropods and plant material. Fledging success was higher for those using human garbage as a food source.[63] In contrast, a 1984–1986 study of common raven diet in an agricultural region of south-western Idaho found that cereal grains were the principal constituent of pellets, though small mammals, grasshoppers, cattle carrion and birds were also eaten.[64]",
			"color": "dim|0.15991 gray|0.15991 dim|0.15991 grey|0.15991 black|0.14956 gray|0.14875 grey|0.14875 dark|0.10805 gray|0.10805 dark|0.10805 grey|0.10805 silver|0.054227 antique|0.045074 white|0.045074 beige|0.035298 light|0.027773 gray|0.027773 light|0.027773 grey|0.027773 papaya|0.026642 whip|0.026642 blanched|0.023118 almond|0.023118 corn|0.021501 silk|0.021501 old|0.020468 lace|0.020468 dark|0.019459 slate|0.019459 gray|0.019459 gainsboro|0.017241 linen|0.016626 ivory|0.013943 light|0.013331 yellow|0.013331 floral|0.012254 white|0.012254 light|0.0092215 golden|0.0092215 rod|0.0092215 yellow|0.0092215 wheat|0.0091324 sea|0.0087813 shell|0.0087813 honeydew|0.0081674  "
		}
	}
}
