{
	"add": {
		"doc": {
			"id": "6bfce7b9c23ff5855c2db63e1941f7b6b59bce3052fc1fccf682f56b96d916bf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Japan_Airlines_777-200ER_Economy_cabin.jpg/220px-Japan_Airlines_777-200ER_Economy_cabin.jpg",
			"previous": [],
				"after": "MAGIC, JAL's in-flight entertainment system, supported by the JAL Entertainment Network (JEN), features the latest hit movies and videos, games and audio programs. There are four generations of the MAGIC system: MAGIC-I, MAGIC-II, MAGIC-III, MAGIC-IV and the new MAGIC-V (To be installed on the Boeing 787-8 and selected Boeing 767-300ER routes) a)[170] Introduced on 1 December 2007, the MAGIC-III system provides Audio/Video On Demand (AVOD) entertainment to all passengers. The number of movie, music, video and game channels on MAGIC-III was doubled from 57 to 130 by 2008; and it is installed on all seats on Boeing 767-300ER, 777-200ER and 777-300ER aircraft.[171] Aircraft with MAGIC-I and MAGIC-II have movies that automatically start when the AVOD system is turned on—once the aircraft reaches cruise level—and economy class passengers can tune in to watch the movie in progress; and all movies restart upon completion. Executive and First Class passengers have full AVOD control. MAGIC systems also have JAL's duty-free shopping catalogue, including flight crew recommendations and a video of specials available on the flight.[172] MAGIC-V will feature the same entertainment as MAGIC-III, but with a touch screen controller, along with a handset. There will be USB ports for iPod connectivity, and an easier to control handset. (Being introduced on selected Boeing 767-300ER routes in late October). The MAGIC-III system is used on internationally configured Boeing 767-300 with Skyluxe Seat, older internationally configured Boeing 767-300ER with Skyluxe Seat, all Boeing 777-200ER, older Boeing 777-300ER with Skysleeper Solo/Suite first class and Shell Flat Seat/Neo Business class. The MAGIC-IV is used on internationally configured Boeing 737-800s, along with a newer look of Skyluxe Seat. It uses 9-inch touchscreens by Panasonic eFX. The MAGIC-V system is deploying across the fleet, with selected Boeing 767-300ERs (Skyrecliner seat) and B787-8 (Shell Flat Neo seat) getting the newest IFE. Followed by refurbished Boeing 777-300ERs (all aircraft) and selected Boeing 767-300ER aircraft (including those with Skyluxe seat) will get the MAGIC-V along with new seats in all classes.",
			"color": "dim|0.30553 gray|0.30553 dim|0.30553 grey|0.30553 gray|0.30445 grey|0.30445 dark|0.1936 gray|0.1936 dark|0.1936 grey|0.1936 black|0.088557 silver|0.042813 slate|0.020879 gray|0.020879 light|0.015736 slate|0.015736 gray|0.015736 light|0.01069 gray|0.01069 light|0.01069 grey|0.01069  "
		}
	}
}
