{
	"add": {
		"doc": {
			"id": "6c04031ada0105d70b061661791d49eafb0fdaae0bfa371058f15a2417c4f77e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Ansett-767-N407AN-070405-01-12.jpg/220px-Ansett-767-N407AN-070405-01-12.jpg",
				"previous": "Laid-off Ansett workers were eventually paid most of their entitlements, partly from an A$150 million compensation package offered by Air New Zealand in return for having the ASIC inquiry dropped, but mostly through asset sales and leasing revenue. The Federal Government did provide a A$350 million loan which is being repaid by the Administrators at the same time as the staff are being repaid however, to ensure that there is no exposure to taxpayers, a $10 per seat levy was imposed by the Federal Government on Australian airline passengers. Employees ended up receiving 96% of their entitlements.[14]",
				"after": "Ansett's administrators, KordaMentha, initially advised creditors that it was unlikely that much more money would be realised, due to the depression of the global aviation industry after 11 September reducing the value of aircraft from A$300 million to A$70 million. In the months following the final flight, the administrators negotiated the sale of the terminal leases back to the airport owners, recouping millions. Auctions were held to sell Ansett's airport furniture and equipment. Its headquarters at 465/489 and 501 Swanston Street, Melbourne were sold to PDG Corporation. Some aircraft stored in heavy maintenance were broken up, as it was not cost-effective to restore them to an airworthy state.",
			"color": "black|0.14721 silver|0.12919 light|0.10878 gray|0.10878 light|0.10878 grey|0.10878 dark|0.093419 gray|0.093419 dark|0.093419 grey|0.093419 gainsboro|0.087037 dim|0.050271 gray|0.050271 dim|0.050271 grey|0.050271 gray|0.047889 grey|0.047889 linen|0.046922 sea|0.034836 shell|0.034836 white|0.034477 smoke|0.034477 floral|0.028837 white|0.028837 old|0.028474 lace|0.028474 snow|0.025859 antique|0.019126 white|0.019126 white|0.018649 lavender|0.016968 blush|0.016968 mint|0.016444 cream|0.016444 ghost|0.01201 white|0.01201 misty|0.011215 rose|0.011215 ivory|0.011211  "
		}
	}
}
