{
	"add": {
		"doc": {
			"id": "6c2423405671740e8b7a1a617facb1dfc0469e15b85d61a3117a784121236b64",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Pannello_di_pittura_parietale_da_area_vesuviana%2C_miho_museum%2C_shiga_02.jpg/170px-Pannello_di_pittura_parietale_da_area_vesuviana%2C_miho_museum%2C_shiga_02.jpg",
				"previous": "Rich families from Rome usually had two or more houses, a townhouse (domus, plural domūs) and at least one luxury home (villa) outside the city. The domus was a privately owned single-family house, and might be furnished with a private bath (balneum),[293] but it was not a place to retreat from public life.[294] Although some neighbourhoods of Rome show a higher concentration of well-to-do houses, the rich did not live in segregated enclaves. Their houses were meant to be visible and accessible. The atrium served as a reception hall in which the paterfamilias (head of household) met with clients every morning, from wealthy friends to poorer dependents who received charity.[295] It was also a center of family religious rites, containing a shrine and the images of family ancestors.[296] The houses were located on busy public roads, and ground-level spaces facing the street were often rented out as shops (tabernae).[297] In addition to a kitchen garden— windowboxes might substitute in the insulae—townhouses typically enclosed a peristyle garden that brought a tract of nature, made orderly, within walls.[298]",
				"after": "The villa by contrast was an escape from the bustle of the city, and in literature represents a lifestyle that balances the civilized pursuit of intellectual and artistic interests (otium) with an appreciation of nature and the agricultural cycle.[300] Ideally a villa commanded a view or vista, carefully framed by the architectural design.[301] It might be located on a working estate, or in a \"resort town\" situated on the seacoast, such as Pompeii and Herculaneum.",
			"color": "light|0.28807 slate|0.28807 gray|0.28807 slate|0.24964 gray|0.24964 gray|0.068743 grey|0.068743 dim|0.068374 gray|0.068374 dim|0.068374 grey|0.068374 black|0.066927 steel|0.046374 blue|0.046374 dark|0.036553 olive|0.036553 green|0.036553 dark|0.027783 gray|0.027783 dark|0.027783 grey|0.027783 tan|0.02645 silver|0.015458 dark|0.011512 khaki|0.011512 light|0.010369 gray|0.010369 light|0.010369 grey|0.010369 sienna|0.0094634  "
		}
	}
}
