{
	"add": {
		"doc": {
			"id": "6c26900661af5b9c7290fbb4d027f0396786fcbad65924da5f31ba2f1456f14d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Carpenter_Theatre_Richmond_Va.JPG/220px-Carpenter_Theatre_Richmond_Va.JPG",
				"previous": "From earliest days, Virginia, and Richmond in particular, have welcomed live theatrical performances. From Lewis Hallam's early productions of Shakespeare in Williamsburg, the focus shifted to Richmond's antebellum prominence as a main colonial and early 19th century performance venue for such celebrated American and English actors as William Macready, Edwin Forrest,[94] and the Booth family. In the 20th century, Richmonders' love of theater continued with many amateur troupes and regular touring professional productions. In the 1960s a small renaissance or golden age[95] accompanied the growth of professional dinner theaters and the fostering of theater by the Virginia Museum, reaching a peak in the 1970s with the establishment of a resident Equity company at the Virginia Museum Theater (now the Leslie Cheek) and the birth of Theatre IV, a company that continues to this day.",
			"after": [
				"Other venues and companies include:",
				"Commercial art galleries include Metro Space Gallery and Gallery 5 in a newly designated arts district. Not-for-profit galleries include Visual Arts Center of Richmond, 1708 Gallery and Artspace."
			],
			"color": "tan|0.37023 burly|0.16958 wood|0.16958 black|0.1663 dim|0.06486 gray|0.06486 dim|0.06486 grey|0.06486 gray|0.0448 grey|0.0448 wheat|0.030163 dark|0.026919 gray|0.026919 dark|0.026919 grey|0.026919 bisque|0.014996 blanched|0.013343 almond|0.013343 papaya|0.010131 whip|0.010131 antique|0.010068 white|0.010068 peach|0.0092149 puff|0.0092149 silver|0.0077657 moccasin|0.0075086 corn|0.007071 silk|0.007071 navajo|0.0066039 white|0.0066039 beige|0.0065236 light|0.0048264 golden|0.0048264 rod|0.0048264 yellow|0.0048264 light|0.0046719 yellow|0.0046719 old|0.0038169 lace|0.0038169 lemon|0.0037866 chiffon|0.0037866  "
		}
	}
}
