{
	"add": {
		"doc": {
			"id": "6c2c39faa8308bd6acbfb2ae57fb872bb3304e11d829a24d9ac8a9091dc57b91",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Old_Market_Roundabout%2C_Bristol.jpg/220px-Old_Market_Roundabout%2C_Bristol.jpg",
				"previous": "Transport planning allows for high utilization and less impact regarding new infrastructure. Using models of transport forecasting, planners are able to predict future transport patterns. On the operative level, logistics allows owners of cargo to plan transport as part of the supply chain. Transport as a field is studied through transport economics, the backbone for the creation of regulation policy by authorities. Transport engineering, a sub-discipline of civil engineering, must take into account trip generation, trip distribution, mode choice and route assignment, while the operative level is handled through traffic engineering.",
				"after": "Because of the negative impacts incurred, transport often becomes the subject of controversy related to choice of mode, as well as increased capacity. Automotive transport can be seen as a tragedy of the commons, where the flexibility and comfort for the individual deteriorate the natural and urban environment for all. Density of development depends on mode of transport, with public transport allowing for better spacial utilization. Good land use keeps common activities close to people's homes and places higher-density development closer to transport lines and hubs, to minimize the need for transport. There are economies of agglomeration. Beyond transportation some land uses are more efficient when clustered. Transportation facilities consume land, and in cities, pavement (devoted to streets and parking) can easily exceed 20 percent of the total land use. An efficient transport system can reduce land waste.",
			"color": "dark|0.14166 gray|0.14166 dark|0.14166 grey|0.14166 silver|0.10779 light|0.097683 gray|0.097683 light|0.097683 grey|0.097683 dim|0.085673 gray|0.085673 dim|0.085673 grey|0.085673 gainsboro|0.083679 gray|0.078407 grey|0.078407 slate|0.042144 gray|0.042144 light|0.04082 slate|0.04082 gray|0.04082 white|0.034267 smoke|0.034267 linen|0.029233 sea|0.027096 shell|0.027096 snow|0.023643 black|0.021685 floral|0.021394 white|0.021394 white|0.018526 ghost|0.017579 white|0.017579 mint|0.017227 cream|0.017227 dark|0.015704 slate|0.015704 gray|0.015704 lavender|0.015675 blush|0.015675 alice|0.013629 blue|0.013629 old|0.013475 lace|0.013475 azure|0.0099719 ivory|0.0091217 misty|0.0063245 rose|0.0063245 antique|0.0050991 white|0.0050991 lavender|0.0048159 cadet|0.0038347 blue|0.0038347 light|0.0031842 blue|0.0031842 light|0.0031652 steel|0.0031652 blue|0.0031652  "
		}
	}
}
