{
	"add": {
		"doc": {
			"id": "6c4de95cfb72383f9a2b500269c7cb1faeba91ac10b678a77241ddd1cd03bed6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/St_andre_satirical_portrait.jpg/220px-St_andre_satirical_portrait.jpg",
				"previous": "Crowds reportedly mobbed Tothill Fields Bridewell for months, hoping to catch a glimpse of the now infamous Toft. By this time she had become quite ill, and while incarcerated had her portrait drawn by John Laguerre. She was ultimately discharged on 8 April 1727, as it was unclear as to what charge should have been made against her.[57] The Toft family made no profit from the affair, and Mary Toft returned to Surrey. She had a daughter in February 1727, and reappeared briefly in 1740 when she was imprisoned for receiving stolen goods, but her death was reported in 1763.[56][58][59]",
				"after": "The case was cited by Robert Walpole's opponents as symbolising the age, which they perceived as greedy, corrupt and deceitful. One author, writing to the Prince of Wales's mistress, suggested the story was a political portent of the approaching death of the prince's father. On 7 January 1727 Mist's Weekly Journal satirised the matter, making several allusions to political change, and comparing the affair to the events of 1641 when Parliament began its revolution against King Charles I.[61] The scandal provided the writers of Grub Street with enough material to produce pamphlets, squibs, broadsides and ballads for several months.[62] With publications such as St. André's Miscarriage (1727) and The anatomist dissected: or the man-midwife finely brought to bed (1727) satirists scorned the objectivity of men-midwives, and critics of Toft's attendants questioned their integrity, undermining their profession with sexual puns and allusions.[63] The case raised questions about England's status as an \"enlightened\" nation—Voltaire used the case in his brief essay Singularités de la nature to describe how the Protestant English were still influenced by an ignorant Church.[64]",
			"color": " "
		}
	}
}
