{
	"add": {
		"doc": {
			"id": "6c575a0b3886f211ea81fa386fa00c1fdfae14c1338424dad30c7b66749047a0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Dendrocollybia_racemosa_65827.jpg/170px-Dendrocollybia_racemosa_65827.jpg",
				"previous": "The spores are narrowly ellipsoid to ovoid, thin-walled, hyaline (translucent), with dimensions of 4–5.5 by 2–3 µm. When stained with Melzer's reagent, the spores turn a light blue color. The basidia (the spore-bearing cells) are four-spored, measure 16–20 by 3.5–4 µm, and taper gradually towards the base. Cystidia are not differentiated in this species. The cap surface is made of a cuticle of radial, somewhat agglutinated, rather coarse hyphae that differ chiefly in size from the underlying tissue—initially 1–3 µm in diameter, becoming 5–7 µm wide in the underlying tissue. The hyphae are clamped, and encrusted with shallow irregularly shaped masses that are most conspicuous in the surface cells. The gill tissue is made of hyphae that project downward from the cap and arranged in a subparallel fashion, meaning that the hyphae are mostly parallel to one another and are slightly intertwined. The hyphae are clamped, with a narrow, branched compact subhymenium (a narrow zone of small, short hyphae immediately beneath the hymenium) composed of hyphae 2–3 µm in diameter. The conidia are 8.5–12 by 4–5 µm, peanut-shaped, non-amyloid (not changing color when stained with Melzer's reagent), clamped, and produced by fragmentation of the coarse mycelium.[1] Clamp connections are present in the hyphae.[17] Asexual spores are 10.0–15.5 by 3–4 µm, ellipsoid to oblong, non-amyloid, and contain granular contents.[13] The grayish color of the fruit bodies is caused by encrusted pigments (crystalline aggregates of pigment molecules, possibly melanin) that occur throughout the tissue of the stem and cap, including the gills; these pigments are absent in Collybia species.[4]",
			"after": [],
			"color": "dark|0.2898 gray|0.2898 dark|0.2898 grey|0.2898 black|0.16835 gray|0.16192 grey|0.16192 silver|0.13116 dim|0.058373 gray|0.058373 dim|0.058373 grey|0.058373 light|0.046782 gray|0.046782 light|0.046782 grey|0.046782 tan|0.033295 gainsboro|0.022504 antique|0.019293 white|0.019293 misty|0.012769 rose|0.012769 linen|0.0090375 papaya|0.0056476 whip|0.0056476  "
		}
	}
}
