{
	"add": {
		"doc": {
			"id": "6c59e9bd7420a914bc2d1aa6cf462ffcc2792af0f9ea78fd77e02ed279295fb6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/1867_NationalStandardTheatre.jpg/170px-1867_NationalStandardTheatre.jpg",
				"previous": "The Goodman's Fields Theatre was established in 1727, and it was here that David Garrick made his successful début as Richard III, in 1741. In the 19th century the theatres of the East End rivalled in their grandiosity and seating capacity those of the West End. The first of this era was the ill-fated Brunswick Theatre (1828), which collapsed three days after opening, killing 15 people. This was followed by the opening of the Pavilion (1828) in Whitechapel, the Garrick (1831) in Leman Street, the Effingham (1834) in Whitechapel, the Standard (1835) in Shoreditch, the City of London (1837) in Norton Folgate, then the Grecian and the Britannia Theatre in Hoxton (1840).[133] Though very popular for a time, from the 1860s onwards these theatres, one by one, began to close, the buildings were demolished and their very memory began to fade.[134]",
				"after": "There were also many Yiddish theatres, particularly around Whitechapel. These developed into professional companies, after the arrival of Jacob Adler in 1884 and the formation of his 'Russian Jewish Operatic Company' that first performed in Beaumont Hall,[135] Stepney, and then found homes both in the Prescott Street Club, Stepney, and in Princelet Street in Spitalfields.[136] The Pavilion became an exclusively Yiddish theatre in 1906, finally closing in 1936 and being demolished in 1960. Other important Jewish theatres were Feinmans, The Jewish National Theatre and the Grand Palais. Performances were in Yiddish, and predominantly melodrama.[90] These declined, as audience and actors left for New York and the more prosperous parts of London.[137]",
			"color": "dark|0.19244 gray|0.19244 dark|0.19244 grey|0.19244 silver|0.18364 light|0.10971 gray|0.10971 light|0.10971 grey|0.10971 gray|0.10072 grey|0.10072 dim|0.098364 gray|0.098364 dim|0.098364 grey|0.098364 gainsboro|0.063325 rosy|0.03755 brown|0.03755 black|0.036819 light|0.031708 slate|0.031708 gray|0.031708 light|0.031391 steel|0.031391 blue|0.031391 slate|0.026919 gray|0.026919 white|0.0095465 smoke|0.0095465 lavender|0.0094559 lavender|0.0072405 blush|0.0072405 ghost|0.0063467 white|0.0063467 alice|0.0058748 blue|0.0058748  "
		}
	}
}
