{
	"add": {
		"doc": {
			"id": "6c71e8ace2b16d8d581361a5ed3cfe13621eb4a32040fc2f638c788b26c91bcd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/1881_3C_Liberty_Head_Three_Cents_%28Judd-1668%2C_Pollock-1869%29.jpg/220px-1881_3C_Liberty_Head_Three_Cents_%28Judd-1668%2C_Pollock-1869%29.jpg",
				"previous": "Although more than a million were minted in 1881,[1] another blow to the three-cent piece occurred on October 1, 1883, when first-class mail rates were lowered from three to two cents for the first 0.5 ounces (14 g). Although the rate for pieces weighing up to 1 ounce (28 g) initially remained at three cents, the two-cent rate was extended to one ounce effective July 1, 1885. Deprived of the original reason for the denomination's existence,[39] no three-cent pieces were struck for circulation in 1886 (though several thousand proof coins were produced), and in the three remaining years of the piece's life, a total of less than 60,000 circulation strikes were minted.[1] As the production of three-cent pieces dwindled, the other non-specie coins prospered, with record numbers of cents being struck in the 1880s to address the need to make change, and for penny arcade machines. The nickel proved popular in slot machines and street railways, which often set fares at five cents. With silver again circulating, the three-cent piece became more unpopular because it was almost the same diameter as the dime, leading to confusion and small frauds.[40]",
				"after": "Beginning in 1880, in their annual reports, the Mint Director and Treasury Secretary appealed to Congress to discontinue the three-cent piece.[40] The last three-cent pieces were struck in 1889,[1] and the denomination was discontinued, along with the gold dollar and the three-dollar piece, by the Act of September 26, 1890.[14] Many of the coins from 1888 and 1889 were still held at the Treasury Department and were melted after passage of the act, the fate of millions more as they flowed back from banks. The resultant metal contributed to large mintages of the Liberty Head nickel between 1890 and 1893.[41]",
			"color": "gray|0.23181 grey|0.23181 dark|0.2031 gray|0.2031 dark|0.2031 grey|0.2031 dim|0.15021 gray|0.15021 dim|0.15021 grey|0.15021 silver|0.10188 light|0.053594 gray|0.053594 light|0.053594 grey|0.053594 antique|0.037342 white|0.037342 gainsboro|0.030388 linen|0.026344 old|0.021341 lace|0.021341 sea|0.01583 shell|0.01583 floral|0.015445 white|0.015445 papaya|0.01455 whip|0.01455 beige|0.014444 ivory|0.013071 corn|0.009203 silk|0.009203 blanched|0.0090923 almond|0.0090923 white|0.0082709 smoke|0.0082709 mint|0.0062622 cream|0.0062622 snow|0.0058754 black|0.0057031 honeydew|0.004541 white|0.0043282 bisque|0.0036993 light|0.0035398 yellow|0.0035398  "
		}
	}
}
