{
	"add": {
		"doc": {
			"id": "6c9b349beb4611afd242d760ae57dd850e4693592b68195686057396c45c942b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Chicago_Water_tower.jpg/170px-Chicago_Water_tower.jpg",
			"previous": [],
				"after": "In 2012[update], Chicago attracted 34.07 million domestic leisure travelers, 10.92 million domestic business travelers and 1.369 million overseas visitors.[14] These visitors contributed more than US$12.8 billion to Chicago's economy.[14] Upscale shopping along the Magnificent Mile and State Street, thousands of restaurants, as well as Chicago's eminent architecture, continue to draw tourists. The city is the United States' third-largest convention destination. A 2011 study by Walk Score ranked Chicago the fourth most walkable of fifty largest cities in the United States.[164] Most conventions are held at McCormick Place, just south of Soldier Field. The historic Chicago Cultural Center (1897), originally serving as the Chicago Public Library, now houses the city's Visitor Information Center, galleries and exhibit halls. The ceiling of its Preston Bradley Hall includes a 38-foot (12 m) Tiffany glass dome. Grant Park holds Millennium Park, Buckingham Fountain (1927), and the Art Institute of Chicago. The park also hosts the annual Taste of Chicago festival. In Millennium Park, there is the reflective Cloud Gate sculpture. Cloud Gate, a public sculpture by Indian-born British artist Anish Kapoor, is the centerpiece of the AT&T Plaza in Millennium Park. Also, an outdoor restaurant transforms into an ice rink in the winter season. Two tall glass sculptures make up the Crown Fountain. The fountain's two towers display visual effects from LED images of Chicagoans' faces, along with water spouting from their lips. Frank Gehry's detailed, stainless steel band shell, the Jay Pritzker Pavilion, hosts the classical Grant Park Music Festival concert series. Behind the pavilion's stage is the Harris Theater for Music and Dance, an indoor venue for mid-sized performing arts companies, including the Chicago Opera Theater and Music of the Baroque.",
			"color": "gray|0.23962 grey|0.23962 dim|0.2245 gray|0.2245 dim|0.2245 grey|0.2245 dark|0.13339 gray|0.13339 dark|0.13339 grey|0.13339 black|0.064631 silver|0.064303 light|0.046713 gray|0.046713 light|0.046713 grey|0.046713 slate|0.038841 gray|0.038841 gainsboro|0.033572 linen|0.01909 antique|0.01897 white|0.01897 light|0.014823 slate|0.014823 gray|0.014823 old|0.014307 lace|0.014307 sea|0.012104 shell|0.012104 floral|0.011051 white|0.011051 white|0.0089047 smoke|0.0089047 ivory|0.0087138 beige|0.0084747 mint|0.005744 cream|0.005744 snow|0.0053814 dark|0.004949 slate|0.004949 gray|0.004949 papaya|0.0045822 whip|0.0045822 honeydew|0.0039947  "
		}
	}
}
