{
	"add": {
		"doc": {
			"id": "6cb5647b9c461e616a88b8e9cc3873d278c93422470840665a5681cb917def3a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/AlisoCreekReliefMap.jpg/230px-AlisoCreekReliefMap.jpg",
				"previous": "Most of Southern California, including all of Orange County, was periodically part of the Pacific Ocean; the most recent epoch was approximately 10 million years ago (MYA). The Santa Ana Mountains, which now border the creek to the north and east, began their uplift about 5.5 million years ago along the Elsinore Fault.[21] Aliso Creek formed about this time, running from the mountains across the broad coastal plain to the Pacific.",
				"after": "About 1.22 million years ago, the San Joaquin Hills along the Orange County coast began their uplift along a blind thrust fault (the San Joaquin Hills blind thrust) extending south from the Los Angeles Basin.[22] As Aliso Creek was an antecedent stream, or one that had formed prior to the mountains' uplift, it cut a water gap through the rising mountains that today is Aliso Canyon. The same phenomenon occurred to the north with Laguna Canyon and San Diego Creek, and to the south at San Juan Creek. The uplift also caused Aliso Creek's largest tributary, Sulphur Creek, to turn north to join Aliso Creek instead of flowing south to Salt Creek.[5] The Wisconsinian era was responsible for shaping the watershed to its present-day form, with deep side canyons and broad alluvial valleys.[5]",
			"color": "pale|0.40305 golden|0.40305 rod|0.40305 dark|0.12705 khaki|0.12705 moccasin|0.11021 navajo|0.08129 white|0.08129 wheat|0.042933 burly|0.03245 wood|0.03245 khaki|0.026602 lemon|0.022898 chiffon|0.022898 blue|0.014842 tan|0.011443 light|0.0063101 gray|0.0063101 light|0.0063101 grey|0.0063101 light|0.0057898 golden|0.0057898 rod|0.0057898 yellow|0.0057898 silver|0.0056762 gainsboro|0.0054682 white|0.0051797 smoke|0.0051797 floral|0.0047307 white|0.0047307 sea|0.0046743 shell|0.0046743 dark|0.0044728 gray|0.0044728 dark|0.0044728 grey|0.0044728 snow|0.0043421  "
		}
	}
}
