{
	"add": {
		"doc": {
			"id": "6ce16f6391250932d449d296cfadb275250d243d7d2f62ff9aebb6449e3bf743",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/F117-palmdale-040625-01.jpg/220px-F117-palmdale-040625-01.jpg",
				"previous": "Rockwell's Palmdale assembly facility is where all the individual parts, pieces and systems of the Space Shuttle came together and were assembled and tested. Upon completion, the spacecraft was turned over to NASA for transport overland from Palmdale to Edwards Air Force Base, California. NASA's Dryden Flight Research Facility at Edwards Air Force Base was the site of the mate-demate facility for mating or demating the spacecraft and the shuttle carrier aircraft.",
				"after": "Approximately 250 major subcontractors supplied various systems and components to Rockwell's Palmdale assembly facility. The structures of the orbiter were manufactured at various companies under contract to Rockwell International's Space Transportation Systems Division, Downey, Calif. The upper and lower forward fuselage, crew compartment, forward reaction control system and aft fuselage were manufactured at Rockwell's Space Transportation Systems Division facility in Downey and were transported overland from Downey to Rockwell's Palmdale, Calif., assembly facility. The midfuselage was manufactured by General Dynamics, San Diego, Calif., and transported overland to Rockwell's Palmdale assembly facility. The wings (including elevons) were manufactured by Grumman, Bethpage, Long Island, N.Y., and transported by ship from New York via the Panama Canal to Long Beach, Calif., and then transported overland to Rockwell's Palmdale assembly facility. The vertical tail (including rudder/speed brake) were manufactured by Fairchild Republic, Farmingdale, Long Island, N.Y., and transported overland to Rockwell's Palmdale assembly facility. The payload bay doors were manufactured at Rockwell International's Tulsa, Okla., facility and transported overland to Rockwell's Palmdale assembly facility. The body flap was manufactured at Rockwell International's Columbus, Ohio, facility and transported overland to Rockwell's Palmdale assembly facility. The aft orbital maneuvering system/reaction control system pods were manufactured by McDonnell Douglas, St. Louis, Mo., and transported by aircraft to Rockwell's Palmdale assembly facility. They were also transported by aircraft from Rockwell's Palmdale assembly facility to the Kennedy Space Center.",
			"color": "dark|0.25915 gray|0.25915 dark|0.25915 grey|0.25915 gray|0.17803 grey|0.17803 silver|0.14079 slate|0.097138 gray|0.097138 dim|0.09533 gray|0.09533 dim|0.09533 grey|0.09533 light|0.081478 gray|0.081478 light|0.081478 grey|0.081478 gainsboro|0.042442 light|0.035647 slate|0.035647 gray|0.035647 dark|0.027023 slate|0.027023 gray|0.027023 black|0.011718  "
		}
	}
}
