{
	"add": {
		"doc": {
			"id": "6ceebf2f12401a4714d9daa655fd408d1c10c3ae97a099eb00e6509ca472c573",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Henry_Moore_in_workshop_Allan_Warren.jpg/120px-Henry_Moore_in_workshop_Allan_Warren.jpg",
				"previous": "Portal:Arts/Featured biography/14",
				"after": "Henry Moore was a British artist and sculptor. Born into a poor mining family in the Yorkshire town of Castleford, he became well-known for his large-scale abstract cast bronze and carved marble sculptures; substantially supported by the British art establishment, Moore helped to introduce a particular form of modernism into Britain. His ability to satisfy large-scale commissions made him exceptionally wealthy towards the end of his life. However, he lived frugally and most of his wealth went to endow the Henry Moore Foundation, which continues to support education and promotion of the arts. His signature form is a pierced reclining figure, first influenced by a Toltec-Maya sculpture known as \"Chac Mool\", which he had seen as a plaster cast in Paris in 1925. Early versions are pierced conventionally as a bent arm reconnects with the body. Later, more abstract versions, are pierced directly through the body in order to explore the concave and convex shapes. These more extreme piercings developed in parallel with Barbara Hepworth's sculptures. Hepworth first pierced a torso after misreading a review of one of Henry Moore's early shows.",
			"color": "light|0.24489 steel|0.24489 blue|0.24489 slate|0.11887 gray|0.11887 black|0.10975 light|0.1085 slate|0.1085 gray|0.1085 sky|0.080511 blue|0.080511 dim|0.043293 gray|0.043293 dim|0.043293 grey|0.043293 light|0.03257 blue|0.03257 steel|0.030613 blue|0.030613 dark|0.026295 gray|0.026295 dark|0.026295 grey|0.026295 gray|0.02523 grey|0.02523 light|0.021435 gray|0.021435 light|0.021435 grey|0.021435 silver|0.019716 gainsboro|0.018265 rosy|0.01219 brown|0.01219 white|0.011141 smoke|0.011141 alice|0.010438 blue|0.010438 ghost|0.0094113 white|0.0094113 light|0.008643 sky|0.008643 blue|0.008643 snow|0.0085568 white|0.0079939 azure|0.0079681 mint|0.0077011 cream|0.0077011 sea|0.0076111 shell|0.0076111 floral|0.0067891 white|0.0067891  "
		}
	}
}
