{
	"add": {
		"doc": {
			"id": "6cf5bdddd2363409e0b8c15c628f1cc24d1b5a9c0aca547b2eb51b3041135b6a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Annual_Amtrak_Ridership_Graph_thru_FY2012.svg/220px-Annual_Amtrak_Ridership_Graph_thru_FY2012.svg.png",
			"previous": [],
			"after": [
				"Outside the Northeast Corridor and stretches of track in Southern California and Michigan, most Amtrak trains run on tracks owned and operated by privately owned freight railroads.",
				"Freight rail operators are required under federal law to give dispatching preference to Amtrak trains. Some freight railroads have been accused of violating or skirting these regulations, allegedly resulting in passenger trains waiting in sidings for an hour or longer while waiting for freight traffic to clear the track. The railroads' dispatching practices were investigated in 2008,[78] resulting in stricter laws about train priority which had a dramatic result. Amtrak's overall on-time performance went up from 74.7% in fiscal 2008 to 84.7% in 2009, with long-distance trains and others outside the NEC seeing the greatest benefit. The Missouri River Runner jumped from a very poor 11% to 95%, becoming one of Amtrak's best performers. The Texas Eagle went from 22.4% to 96.7%, and the California Zephyr, with an abysmal 5% on-time record in 2008, went up to 78.3%.[79] However, this improved performance also coincided with a general economic downturn, resulting in the lowest freight rail traffic volumes since at least 1988, meaning less freight traffic to impede passenger traffic.[80]"
			],
			"color": "white|0.094086 smoke|0.094086 alice|0.092023 blue|0.092023 ghost|0.091246 white|0.091246 snow|0.089217 white|0.088171 lavender|0.087893 blush|0.087893 mint|0.087609 cream|0.087609 azure|0.087371 gainsboro|0.063208 lavender|0.051823 sea|0.044902 shell|0.044902 floral|0.039525 white|0.039525 light|0.019649 gray|0.019649 light|0.019649 grey|0.019649 silver|0.011021 sky|0.010142 blue|0.010142 deep|0.01001 sky|0.01001 blue|0.01001 light|0.0068091 blue|0.0068091 dark|0.0057767 gray|0.0057767 dark|0.0057767 grey|0.0057767 powder|0.0043834 blue|0.0043834 light|0.0040905 sky|0.0040905 blue|0.0040905 gray|0.0036886 grey|0.0036886 linen|0.0025651  "
		}
	}
}
