{
	"add": {
		"doc": {
			"id": "6cf86739d7847676b4e0703bf1c31cda897af38263f31d5cd7dc532b35c99b69",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/WTI_price_96_09.PNG/250px-WTI_price_96_09.PNG",
				"previous": "Microwave heating technologies are based on the same principles as radio wave heating, although it is believed that radio wave heating is an improvement over microwave heating because its energy can penetrate farther into the oil shale formation.[58] The microwave heating process was tested by Global Resource Corporation.[59] Electro-Petroleum proposes electrically enhanced oil recovery by the passage of direct current between cathodes in producing wells and anodes located either at the surface or at depth in other wells. The passage of the current through the oil shale formation results in resistive Joule heating.[10]",
				"after": "The dominant question for shale oil production is under what conditions shale oil is economically viable. According to the United States Department of Energy, the capital costs of a 100,000 barrels per day (16,000 m3/d) ex-situ processing complex are $3–10 billion.[60] The various attempts to develop oil shale deposits have succeeded only when the shale-oil production cost in a given region is lower than the price of petroleum or its other substitutes. According to a survey conducted by the RAND Corporation, the cost of producing shale oil at a hypothetical surface retorting complex in the United States (comprising a mine, retorting plant, upgrading plant, supporting utilities, and spent oil shale reclamation), would be in a range of US$70–95 per barrel ($440–600/m3), adjusted to 2005 values. Assuming a gradual increase in output after the start of commercial production, the analysis projects a gradual reduction in processing costs to $30–40 per barrel ($190–250/m3) after achieving the milestone of 1 billion barrels (160×10 ^6 m3).[8][28] The United States Department of Energy estimates that the ex-situ processing would be economic at sustained average world oil prices above US$$54 per barrel and in-situ processing would be economic at prices above $35 per barrel. These estimates assume a return rate of 15%.[60] Royal Dutch Shell announced in 2006 that its Shell ICP technology would realize a profit when crude oil prices are higher than $30 per barrel ($190/m3), while some technologies at full-scale production assert profitability at oil prices even lower than $20 per barrel ($130/m3).[11][61]",
			"color": "white|0.08814 smoke|0.08814 sea|0.081984 shell|0.081984 snow|0.081799 ghost|0.081437 white|0.081437 alice|0.08065 blue|0.08065 white|0.079422 lavender|0.078987 blush|0.078987 mint|0.07598 cream|0.07598 floral|0.074817 white|0.074817 azure|0.070882 light|0.031453 gray|0.031453 light|0.031453 grey|0.031453 silver|0.029097 gainsboro|0.024799 pink|0.020255 dark|0.017073 gray|0.017073 dark|0.017073 grey|0.017073 misty|0.016505 rose|0.016505 light|0.01631 pink|0.01631 light|0.014954 coral|0.014954 linen|0.014538 salmon|0.0081372 ivory|0.0052824  "
		}
	}
}
