{
	"add": {
		"doc": {
			"id": "6d08968e3352db4bac68232b28aadf9ea1308d0160479e71ae0e69d8a336dab0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/F-15C_AIM-9_AIM-120_m02006120700063.jpg/220px-F-15C_AIM-9_AIM-120_m02006120700063.jpg",
				"previous": "The Eagle can be armed with combinations of four different air-to-air weapons: AIM-7F/M Sparrow missiles or AIM-120 AMRAAM advanced medium range air-to-air missiles on its lower fuselage corners, AIM-9L/M Sidewinder or AIM-120 AMRAAM missiles on two pylons under the wings, and an internal M61 Vulcan 20 millimetres (0.79 in) Gatling gun in the right wing root.[47]",
				"after": "Low-drag conformal fuel tanks (CFTs) were developed for the F-15C and D models. They can be attached to the sides of the engine air intake ramps under each wing and are designed to the same load factors and airspeed limits as the basic aircraft.[47] They degrade performance by increasing drag and cannot be jettisoned in-flight (unlike conventional external tanks). Each conformal fuel tank can hold 750 U.S. gallons (2,840 L) of fuel.[48] These tanks increase range and reduce the need for in-flight refueling. All external stations for munitions remain available with the tanks in use. Moreover, Sparrow or AMRAAM missiles can be attached to the corners of the conformal fuel tanks.[31] The 57 FIS based at Keflavik NAS, Iceland was the only C-model squadron to use CFTs on a regular basis due to its extended operations over the North Atlantic. With the closure of the 57 FIS, the F-15E is the only variant to carry them on a routine basis. CFTs have also been sold to Israel and Saudi Arabia.",
			"color": "light|0.15104 steel|0.15104 blue|0.15104 light|0.1069 blue|0.1069 light|0.09558 gray|0.09558 light|0.09558 grey|0.09558 gainsboro|0.088191 lavender|0.080937 dim|0.076555 gray|0.076555 dim|0.076555 grey|0.076555 silver|0.075874 dark|0.058145 gray|0.058145 dark|0.058145 grey|0.058145 black|0.054277 gray|0.030485 grey|0.030485 alice|0.023364 blue|0.023364 light|0.021885 slate|0.021885 gray|0.021885 slate|0.020983 gray|0.020983 white|0.018875 smoke|0.018875 ghost|0.018236 white|0.018236 lavender|0.012452 blush|0.012452 snow|0.012385 white|0.011 azure|0.0096984 sea|0.0084396 shell|0.0084396 mint|0.0083153 cream|0.0083153 floral|0.0054204 white|0.0054204 powder|0.004511 blue|0.004511  "
		}
	}
}
