{
	"add": {
		"doc": {
			"id": "6d0f564ed3fe952477152358cb7027c745b01f7d0b3a4f65fdfcaea9c5b56f0e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/AeroSvit_Ukrainian_Airlines_An-148-100B_UR-NTC_UKKM_2010-4-28.png/220px-AeroSvit_Ukrainian_Airlines_An-148-100B_UR-NTC_UKKM_2010-4-28.png",
				"previous": "In 2006, the carrier became the 85th worldwide in passing the IATA Operational Safety Audit.[10] In March that year, Naples was added to the route network,[11] and in June the Kyiv–Vilnius and Simferopol–Vilnius routes were launched in codeshare agreement with Lithuania's national carrier flyLAL.[12] In September 2006 (2006-09), Aerosvit was the first airline to operate both inbound and outbund passenger flights at Bangkok Suvarnabhumi Airport.[13][14] and in October, the airline celebrated the six-millionth passenger carried since it started operations.[15]",
				"after": "In 2007, due to cooperation with Delta Air Lines, the number of destinations in the United States increased, allowing onward travel from New York to cities such as Los Angeles and Portland. It was in the same year that Aerosvit Airlines and Donbassaero began to build (at the initiative of their joint main shareholder Privat Group) the strategic alliance Ukrainian Aviation Group. Also, in this year, the fleet was supplemented with a third long haul aircraft Boeing 767 and eleventh and twelfth mid-range Boeing 737s, whilst the start of code share flights with Belavia on the Kyiv-Minsk route took place. In August 2007 (2007-08), it was announced that a contract was signed with Boeing for the acquisition of seven Boeing 737-800s and purchase rights for another seven;[17] in a deal valued at more than US$500 million, the operation marked the company's first direct purchase of aircraft since its foundation.[18][19] These new aircraft would replace the airline's 13-strong Boeing 737 Classic fleet;[20] the first of them was handed over by the manufacturer in March 2012 (2012-03).[21] In December 2007 (2007-12), the airline began the commercialisation of e-tickets on its website.[22]",
			"color": "dark|0.14649 gray|0.14649 dark|0.14649 grey|0.14649 silver|0.13125 dim|0.10591 gray|0.10591 dim|0.10591 grey|0.10591 light|0.089004 gray|0.089004 light|0.089004 grey|0.089004 gainsboro|0.067665 gray|0.060243 grey|0.060243 light|0.040995 steel|0.040995 blue|0.040995 white|0.025591 smoke|0.025591 slate|0.024218 gray|0.024218  "
		}
	}
}
