{
	"add": {
		"doc": {
			"id": "6d255c0d3a263576c6d8e6d244645eb6b7f93d2cc2fab2e7449a87cb75025901",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Santodomingo.jpg/250px-Santodomingo.jpg",
				"previous": "In 1586, Francis Drake captured the city and held it for ransom.[12] Drake's invasion signaled the decline of Spanish dominion over Hispaniola, which was accentuated in the early 17th century by policies that resulted in the depopulation of most of the island outside of the capital. An expedition sent by Oliver Cromwell in 1655 attacked the city of Santo Domingo, but was defeated. The English troops withdrew and took the less guarded colony of Jamaica, instead.[13] In 1697, the Treaty of Ryswick included the acknowledgement by Spain of France's dominion over the Western third of the island, now Haiti.",
				"after": "From 1795 to 1822 the city changed hands several times along with the colony it headed. The city was ceded to France in 1795 after years of struggles, it was briefly captured by Haitian rebels in 1801, recovered by France in 1802, and was once again reclaimed by Spain in 1809. In 1821 Santo Domingo became the capital of an independent nation after the Criollo bourgeois within the country, led by José Núñez de Cáceres, overthrew the Spanish crown. The nation was unified with Haiti just two months later. The city and the colony lost much of their Spanish-born peninsular population as a result of these events which caused a great deal of instability and unrest.[12][14][15]",
			"color": "tan|0.1517 dark|0.12188 slate|0.12188 gray|0.12188 silver|0.062324 light|0.058182 gray|0.058182 light|0.058182 grey|0.058182 gainsboro|0.048436 dark|0.045253 gray|0.045253 dark|0.045253 grey|0.045253 antique|0.045162 white|0.045162 linen|0.030627 cadet|0.030509 blue|0.030509 wheat|0.028541 burly|0.027845 wood|0.027845 old|0.025215 lace|0.025215 beige|0.023648 sea|0.022458 shell|0.022458 papaya|0.021418 whip|0.021418 gray|0.02107 grey|0.02107 floral|0.020972 white|0.020972 white|0.020935 smoke|0.020935 blanched|0.019198 almond|0.019198 bisque|0.017171 black|0.014061 ivory|0.014046 snow|0.014021 dim|0.013867 gray|0.013867 dim|0.013867 grey|0.013867 mint|0.012705 cream|0.012705 corn|0.012018 silk|0.012018 white|0.010447 ghost|0.0075086 white|0.0075086 alice|0.0073599 blue|0.0073599 honeydew|0.0068251  "
		}
	}
}
