{
	"add": {
		"doc": {
			"id": "6d31accb60cb39a2a686151553a533688945c6c14d4541ae395a1b07ba564763",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Heteralochaskull.png/170px-Heteralochaskull.png",
				"previous": "Although sexual dimorphism in bill shape is found in other birds, such as the riflebirds, sicklebills and other wood-excavating birds including some species of woodpecker,[17] it was most pronounced in the huia.[18] The beak of the male was short at approximately 60 mm (2.3 in) and slightly arched downwards[8] and robust, very similar to that of the closely related saddleback, while the female's beak was finer, longer at around 104 mm (4 in), and decurved (curved downward) like that of a hummingbird or honeyeater. The difference was not only in the bone; the rhamphotheca grew way past the end of the bony maxilla and mandible to produce a pliable implement able to deeply penetrate holes made by wood-boring beetle larvae. The skulls and mandibles of the huia and saddleback are very similar, the latter essentially miniatures of the former.[19]",
				"after": "There are two possible explanations for the evolution of this sexual difference in bill shape. The most widely supported is that it allowed birds of different sexes to utilise different food sources.[17] This divergence may have arisen because of a lack of competitors in these foraging niches in the North Island forest ecosystems.[20] The other idea is that the ivory-coloured bill, which contrasted sharply with the bird's black plumage, may have been used to attract a mate. In animals that use sexually dimorphic physical traits to attract a mate, the dimorphic feature is often brightly coloured or contrasts with the rest of the body, as with the huia.[17] It has been suggested that as the female was the main provider of food for the chicks by regurgitation, this sex evolved the longer bill to obtain the protein-rich invertebrate diet required for the chicks.[17]",
			"color": " "
		}
	}
}
