{
	"add": {
		"doc": {
			"id": "6d3eb13dacced73a63089488c619350265c31b266da3a3f3642c00d38314d378",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/29/Chinese_PWs_Battle_of_Kapyong_24_April_1951_%28AWM_P04953%29.jpg/220px-Chinese_PWs_Battle_of_Kapyong_24_April_1951_%28AWM_P04953%29.jpg",
			"previous": [],
				"after": "As daylight broke, the Chinese now found themselves highly exposed in the open ground in front of the Australians. A and B Company supported by artillery, mortars and tanks poured heavy fire onto the hapless Chinese, forcing them to withdraw leaving hundreds of casualties behind on the slopes. With the Australians remaining in possession of their original defensive locations the immediate situation had stabilised, although they were now effectively cut-off 4 kilometres (2.5 mi) behind the front.[65] Ammunition, food and medical supplies were now extremely low throughout the forward area, and with casualty evacuation increasingly difficult, the battalion was at risk of being overrun unless it could be concentrated, resupplied and supported.[60] As such in order to avoid each company being isolated and overwhelmed in a series of Chinese attacks, at 07:15 B Company was ordered to leave its position and join the other companies on the high ground to form a defendable battalion position. The Australians subsequently withdrew as instructed, taking several dozen Chinese prisoners with them that had been captured earlier by a standing patrol.[65] The New Zealand gunners covered their movement across the open valley, laying a smoke screen to conceal the withdrawal, while the American tanks also provided support. As they moved across the valley the Australians exchanged a number of shots with a small groups of Chinese who were still hiding in dead ground and in the riverbed, as well as numerous dead from the fighting the previous night.[72] 173 Chinese dead were counted on the B Company perimeter by the Australians before they departed.[73]",
			"color": " "
		}
	}
}
