{
	"add": {
		"doc": {
			"id": "6d43d1dbd961d0dbd7027453c87d957fef3f0c22fdbdfb17f46281ee8b5cfa27",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Nuffield_College_windows.jpg/220px-Nuffield_College_windows.jpg",
				"previous": "The architectural correspondent of The Times wrote that the architecture of the college was incongruous – it was \"remarkable\" that a college with connections to modern industry should be looking backwards in this way. \"That a college devoted to modern scientific studies should be dressed up [in the style of an antique Cotswold manor house] has already been the subject of puzzled comment by many foreign visitors to Oxford.\"[45] Writing in The Observer, Patience Gray also disliked the college's design, referring to the \"Cotswold dementia\" of the architecture, and the college's \"pokey windows and grotesque sugarloaf tower.\"[42] The chapel was described by the travel writer Jan Morris as \"one of the sweetest little sanctuaries in Oxford\";[46] \"very simple, almost stern\" with a contrast between the black and white pews and the \"rich colour\" of the stained glass.[46] However, she said that whilst Oxford colleges change in style over time as buildings are added or altered, \"Nuffield was a hodge-podge from the start, with a faintly Levantine tower upon a Cotswold Gothic base\".[6]",
				"after": "The writer Miles Jebb considered the contrast between the hall's black and white floor and red-panelled roof to be \"most effective\".[37] He thought that the enclosed layout of the college was \"a principal attraction\", but wrote that the tower's \"palpably utilitarian function detracts from its aesthetic attraction\", even though it made the \"emphatic addition\" to the skyline of Oxford that Nuffield wanted.[37] A. R. Woolley, author of an Oxford University Press guide to the city and university, was more positive. He described the tower as \"an exciting breakaway from the conventional\", with its spire as a \"secular contribution to the sky-line\".[38] He said that the buildings \"make a picturesque group of gabled Cotswold roofs\", adding that \"[t]heir design is simple and depends for its effects upon its just proportions. It is at once traditional and original.\"[38]",
			"color": "black|0.35824 burly|0.16368 wood|0.16368 olive|0.095026 drab|0.095026 tan|0.090489 dim|0.07617 gray|0.07617 dim|0.07617 grey|0.07617 dark|0.062637 olive|0.062637 green|0.062637 gray|0.026395 grey|0.026395 silver|0.016384 light|0.013135 gray|0.013135 light|0.013135 grey|0.013135 dark|0.012884 gray|0.012884 dark|0.012884 grey|0.012884  "
		}
	}
}
