{
	"add": {
		"doc": {
			"id": "6d4bb644f459ff0265979d1e70a44b7897a36782ee8e1e5cd1f7294ab224a019",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Great_Bow_Bridge.jpg/220px-Great_Bow_Bridge.jpg",
				"previous": "Stanmoor lock was constructed above the junction with the River Tone, but all traces of it have gone. Next to the pedestrian bridge at Stathe four living willow cones, which were woven in 1997 by Clare Wilks, have now rooted and sprouted.[116] Oath lock no longer functions as a lock, but the sluice is used to regulate the river levels.[7] Below Langport, the river is crossed by a lattice girder bridge, carrying the Taunton to Westbury railway line, which approaches the crossing on multi-arched viaducts.[117] This is followed by the derelict remains of the Langport lock and sluice.[117]",
				"after": "At Langport, the Great Bow Bridge, which now carries the A378, is a three-arched bridge, constructed under the terms of the Parrett Navigation Act of 1836. Completed in 1841 at a cost of £3,749,[101] it replaced the previous medieval bridge, with its nine tiny arches, all too small to allow navigation. A bridge at this site was first mentioned in 1220.[118] The medieval bridge consisted of a total of 31 arches, of which nine crossed the river, and 19 of the original arches were located by ground-penetrating radar in 1987, buried beneath the road which runs from Great Bow Bridge to Little Bow Bridge.[14] The Warehouse in Langport was built in the late 18th century of English bond red brick, with Flemish bond extensions. It has clay plain tile roofs with hipped ends. It was built by the Parrett Navigation Company, a trading company owned by Vincent Stuckey and Walter Bagehot, on the banks of the River.[119] When the river became unnavigable, the building was no longer needed, and it was eventually abandoned. The Somerset Trust for Sustainable Development, which became the Ecos Trust, purchased the site, designated as a brown field site, in February 2003, and worked with Somerset Buildings Preservation Trust, English Heritage and local councils to redevelop it into a craft, heritage learning and small business centre, with the surrounding land being used for an eco-friendly housing development.[119] It is a grade II listed building.[120]",
			"color": "dim|0.42835 gray|0.42835 dim|0.42835 grey|0.42835 gray|0.12782 grey|0.12782 dark|0.12022 gray|0.12022 dark|0.12022 grey|0.12022 black|0.091328 light|0.061511 slate|0.061511 gray|0.061511 slate|0.050266 gray|0.050266 silver|0.030619 dark|0.017303 olive|0.017303 green|0.017303 dark|0.015685 slate|0.015685 gray|0.015685  "
		}
	}
}
