{
	"add": {
		"doc": {
			"id": "6d4e5056a80f7394ed060ac3a48593d9460d8864120f629fe67c75b8f7841f15",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Belton_Stables._Giano.jpg/300px-Belton_Stables._Giano.jpg",
				"previous": "Work on the new house began in 1685. The architect thought to have been responsible for the initial design is William Winde, although the house has also been attributed to Sir Christopher Wren, while others believe the design to be so similar to Roger Pratt's Clarendon House, London, that it could have been the work of any talented draughtsman.[11] The assumption popular today, that Winde was the architect, is based on the stylistic similarity between Belton and Coombe Abbey, which was remodelled by Winde between 1682 and 1685. Further evidence is a letter dated 1690, in which Winde recommends a plasterer who worked at Belton to another of his patrons.[12]",
				"after": "Whoever the architect, Belton follows closely the design of Clarendon House, completed in 1667.[1] This great London town house (demolished circa 1683) has been one of the most admired buildings of its era due to \"its elegant symmetry and confident and common-sensical design\".[14] Sir John Summerson described Clarendon House as \"the most influential house of its time among those who aimed at the grand manner\" and Belton as \"much the finest surviving example of its class\".[1] John and Alice Brownlow assembled one of the finest teams of craftsmen available at the time to work on the project. This dream team was headed by the master mason William Stanton who oversaw the project. His second in command, John Thompson, had worked with Sir Christopher Wren on several of the latter's London churches, while the chief joiner John Sturges had worked at Chatsworth under William Talman. The wrought-ironworker John Warren worked under Stanton at Denham Place, Buckinghamshire, and the fine wrought iron gates and overthrow at Belton may be his.[15] Thus so competent were the builders of Belton that Winde may have done little more than provide the original plans and drawings, leaving the interpretation to the on-site craftsmen. This theory is further demonstrated by the external appearance of the adjoining stable block. More provincial, and less masterful in proportion, it is known to have been entirely the work of Stanton.[16]",
			"color": "dim|0.37557 gray|0.37557 dim|0.37557 grey|0.37557 slate|0.2496 gray|0.2496 light|0.14492 slate|0.14492 gray|0.14492 gray|0.086598 grey|0.086598 dark|0.025847 gray|0.025847 dark|0.025847 grey|0.025847 antique|0.024683 white|0.024683 black|0.023621 dark|0.019821 olive|0.019821 green|0.019821 dark|0.017589 slate|0.017589 gray|0.017589 silver|0.014259  "
		}
	}
}
