{
	"add": {
		"doc": {
			"id": "6d53819831a301022ec560aee2f670cbe7d8ee349a686c61de7d24e04c8a2f34",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/The_Whitechapel_Gallery.jpg/220px-The_Whitechapel_Gallery.jpg",
				"previous": "As head of the London arm of the family businesses, Speyer became wealthy. He owned a pair of neighbouring houses at 44 and 46 Grosvenor Street, Mayfair, that he had rebuilt as a single residence at the cost of £150,000 (approximately £13.4 million today).[8][17] The rebuilding work was carried out by Detmar Blow and Fernand Billery in 1910 and 1911; the architects gave the house a \"Beaux-Arts\" style portland stone façade and lavish interiors including 11 bedrooms and a large music room.[18][19] Speyer also had a large country house built in 1908, in the fashionable Edwardian resort of Overstrand on the Norfolk coast. The house was named \"Sea Marge\" (meaning land that borders the sea) and was designed in the Mock Tudor style, surrounded by gardens.[20][21] To decorate his homes, Speyer collected works of art, furniture and decorative items from across Europe.[18] He also commissioned art works, including his wife's portrait, painted by John Singer Sargent in 1907,[22][note 9] and his own portrait, painted by William Orpen, which was exhibited at the Royal Academy in 1914.[1][note 10]",
				"after": "Speyer was a music lover and patron of the arts, frequently holding concerts in his home. He was friends with composers Edward Elgar, Edvard Grieg, Richard Strauss, Claude Debussy and Percy Grainger, and with the German cellist and composer Hugo Becker. Speyer owned violins by Stradivarius and Giuseppe Guarneri,[25] used by his wife in public and private performances. He was chairman of the Classical Concert Society until 1912 and (following financial problems experienced by Robert Newman) held the position of chairman of the Queen's Hall Concert board from 1902 to 1914, paying £2,000 per year (£190 thousand today)[8] to underwrite the Promenade Concerts.[1][26][27] Speyer increased rehearsal time for the Queen's Hall Orchestra and was involved in the challenge to the deputy system then operating, stopping musicians from sending under-prepared substitutes to perform in their places.[28] He was described by Bird as \"the sole monetary force which kept the Queen's Hall Orchestra afloat\".[29] Speyer's control of the Queen's Hall enabled him to attract musicians and composers to perform modern new works at his concerts including Strauss, whom he brought to London to conduct the first English performance of A Hero's Life, and Arnold Schoenberg, whose Five Orchestral Pieces received its première in 1912.[30][31] Becker dedicated Three Pieces for Cello with Piano Accompaniment to Speyer in recognition of their friendship, and Strauss dedicated his opera Salome to him.[32][33]",
			"color": "tan|0.26543 black|0.23082 burly|0.20664 wood|0.20664 wheat|0.081081 navajo|0.030783 white|0.030783 bisque|0.027432 moccasin|0.024977 peach|0.022114 puff|0.022114 dim|0.021812 gray|0.021812 dim|0.021812 grey|0.021812 blanched|0.016067 almond|0.016067 antique|0.011766 white|0.011766 gray|0.0097914 grey|0.0097914 papaya|0.009752 whip|0.009752  "
		}
	}
}
