{
	"add": {
		"doc": {
			"id": "6d690c2a4f5a76dd2906a6a648f0427b0166e1ddf3af54751f19a80bd4b9e301",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Nixon_at_Liberty_Island.jpg/220px-Nixon_at_Liberty_Island.jpg",
				"previous": "In 1956, an Act of Congress officially renamed Bedloe's Island as Liberty Island, a change advocated by Bartholdi generations earlier. The act also mentioned the efforts to found an American Museum of Immigration on the island, which backers took as federal approval of the project, though the government was slow to grant funds for it.[120] Nearby Ellis Island was made part of the Statue of Liberty National Monument by proclamation of President Lyndon Johnson in 1965.[106] In 1972, the immigration museum, in the statue's base, was finally opened in a ceremony led by President Richard Nixon. The museum's backers never provided it with an endowment to secure its future and it closed in 1991 after the opening of an immigration museum on Ellis Island.[93]",
				"after": "Beginning December 26, 1971, 15 anti-Vietnam war veterans occupied the statue, flying a US flag upside down from her crown. They left December 28 following a Federal Court order.[121] The statue was also several times taken over briefly by demonstrators publicizing causes such as Puerto Rican independence, opposition to abortion, and opposition to US intervention in Grenada. Demonstrations with the permission of the Park Service included a Gay Pride Parade rally and the annual Captive Baltic Nations rally.[122]",
			"color": "honeydew|0.069483 ivory|0.067777 old|0.067615 lace|0.067615 floral|0.067348 white|0.067348 mint|0.066821 cream|0.066821 linen|0.064026 sea|0.062637 shell|0.062637 dark|0.060807 gray|0.060807 dark|0.060807 grey|0.060807 white|0.05275 beige|0.05161 snow|0.047233 black|0.046403 light|0.045007 slate|0.045007 gray|0.045007 slate|0.034812 gray|0.034812 dim|0.032456 gray|0.032456 dim|0.032456 grey|0.032456 silver|0.032252 gray|0.030339 grey|0.030339 white|0.020084 smoke|0.020084 light|0.012787 yellow|0.012787 corn|0.012258 silk|0.012258 light|0.0095238 gray|0.0095238 light|0.0095238 grey|0.0095238 dark|0.008907 slate|0.008907 gray|0.008907 azure|0.0077167 powder|0.0059141 blue|0.0059141 cadet|0.0055166 blue|0.0055166 gainsboro|0.0036314  "
		}
	}
}
