{
	"add": {
		"doc": {
			"id": "6d6e45444aa75feffc564a02d10a2ac649763388ed6a87595ff43efe0e77b767",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/China_Human_Dev_SVG.svg/220px-China_Human_Dev_SVG.svg.png",
			"previous": [],
				"after": "The Ministry of Health, together with its counterparts in the provincial health bureaux, oversees the health needs of the Chinese population.[403] An emphasis on public health and preventive medicine has characterized Chinese health policy since the early 1950s. At that time, the Communist Party started the Patriotic Health Campaign, which was aimed at improving sanitation and hygiene, as well as treating and preventing several diseases. Diseases such as cholera, typhoid and scarlet fever, which were previously rife in China, were nearly eradicated by the campaign. After Deng Xiaoping began instituting economic reforms in 1978, the health of the Chinese public improved rapidly due to better nutrition, although many of the free public health services provided in the countryside disappeared along with the People's Communes. Healthcare in China became mostly privatized, and experienced a significant rise in quality. In 2009, the government began a 3-year large-scale healthcare provision initiative worth US$124 billion.[404] By 2011, the campaign resulted in 95% of China's population having basic health insurance coverage.[405] In 2011, China was estimated to be the world's third-largest supplier of pharmaceuticals, but its population has suffered from the development and distribution of counterfeit medications.[406]",
			"color": "gray|0.28819 grey|0.28819 dim|0.23493 gray|0.23493 dim|0.23493 grey|0.23493 dark|0.18932 gray|0.18932 dark|0.18932 grey|0.18932 black|0.076559 red|0.051857 silver|0.043623 light|0.022217 gray|0.022217 light|0.022217 grey|0.022217 gainsboro|0.015338 light|0.0090224 coral|0.0090224 white|0.0067296 smoke|0.0067296 light|0.005869 pink|0.005869 salmon|0.0051682 white|0.0051591 alice|0.0050578 blue|0.0050578 ghost|0.0050244 white|0.0050244 snow|0.005019 sea|0.0049862 shell|0.0049862 lavender|0.004432 blush|0.004432 mint|0.0039503 cream|0.0039503  "
		}
	}
}
