{
	"add": {
		"doc": {
			"id": "6d737d26c1635326caf8976244a8aae3ef04fc0f9f4b812724ad78de4a50fb67",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/SS_France_Hong_Kong_74.jpg/180px-SS_France_Hong_Kong_74.jpg",
				"previous": "Despite the harsh economic conditions, a number of companies continued to build larger and faster ships. In 1929, the German ships SS Bremen and SS Europa bested the speed record set by Mauretania 20 years earlier with an average speed of almost 28 knots (52 km/h; 32 mph). The ships used bulbous bows and steam turbines to reach these high speeds while maintaining economical operating costs. In 1933, the Italian Line's 51,100-ton ocean liner SS Rex, with a time of four days and thirteen hours,[19] captured the westbound Blue Riband, which she held for two years. In 1935, French liner SS Normandie used a revolutionary new hull design and powerful turbo-electric transmission to take the Blue Riband from the Rex. Due to poor economic conditions, the British government amalgamated the Cunard Line and White Star Lines. The newly merged company countered with liners RMS Queen Mary and RMS Queen Elizabeth. Queen Mary held the Blue Riband in 1936-37 and from 1938-52.[20]",
				"after": "In World War II many liners were used as troop ships. Notable ocean liners, such as Queen Mary, Aquitania, Cap Arcona, Laconia, Queen Elizabeth, and Orontes all helped transport troops. While some ocean liners survived the war, many others were lost.",
			"color": "light|0.24936 slate|0.24936 gray|0.24936 slate|0.20845 gray|0.20845 light|0.070341 gray|0.070341 light|0.070341 grey|0.070341 black|0.069745 gainsboro|0.060983 dark|0.04587 gray|0.04587 dark|0.04587 grey|0.04587 silver|0.044664 white|0.035126 smoke|0.035126 linen|0.031277 light|0.020314 steel|0.020314 blue|0.020314 sea|0.01906 shell|0.01906 lavender|0.01639 blush|0.01639 gray|0.015454 grey|0.015454 snow|0.014921 alice|0.01468 blue|0.01468 ghost|0.014277 white|0.014277 dim|0.0096284 gray|0.0096284 dim|0.0096284 grey|0.0096284 dark|0.0064797 slate|0.0064797 gray|0.0064797 antique|0.0060126 white|0.0060126 floral|0.0050791 white|0.0050791 white|0.0048978 old|0.0042385 lace|0.0042385 mint|0.0036862 cream|0.0036862  "
		}
	}
}
