{
	"add": {
		"doc": {
			"id": "6d8095b0c5fc87a44117e04bb4e57cb789ee11d0b663908881c1235632ce96e2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/NesjavellirPowerPlant_edit2.jpg/220px-NesjavellirPowerPlant_edit2.jpg",
				"previous": "In 2010, worldwide biofuel production reached 105 billion liters (28 billion gallons US), up 17% from 2009,[134] and biofuels provided 2.7% of the world's fuels for road transport, a contribution largely made up of ethanol and biodiesel.[citation needed] Global ethanol fuel production reached 86 billion liters (23 billion gallons US) in 2010, with the United States and Brazil as the world's top producers, accounting together for 90% of global production. The world's largest biodiesel producer is the European Union, accounting for 53% of all biodiesel production in 2010.[134] As of 2011, mandates for blending biofuels exist in 31 countries at the national level and in 29 states or provinces.[115] The International Energy Agency has a goal for biofuels to meet more than a quarter of world demand for transportation fuels by 2050 to reduce dependence on petroleum and coal.[135]",
				"after": "Geothermal energy is thermal energy generated and stored in the Earth. Thermal energy is the energy that determines the temperature of matter. The geothermal energy of the Earth's crust originates from the original formation of the planet (20%) and from radioactive decay of minerals (80%).[136] The geothermal gradient, which is the difference in temperature between the core of the planet and its surface, drives a continuous conduction of thermal energy in the form of heat from the core to the surface. The adjective geothermal originates from the Greek roots γη (ge), meaning earth, and θερμος (thermos), meaning hot.",
			"color": "black|0.43321 dim|0.11753 gray|0.11753 dim|0.11753 grey|0.11753 light|0.091081 slate|0.091081 gray|0.091081 slate|0.089687 gray|0.089687 steel|0.089576 blue|0.089576 gray|0.07904 grey|0.07904 dark|0.047424 gray|0.047424 dark|0.047424 grey|0.047424 silver|0.015939  "
		}
	}
}
