{
	"add": {
		"doc": {
			"id": "6d86144e048f1d1faa20dafe0471d6dfecdea283e998c2127da08669b9207e1e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Pezophaps_solitaria.jpg/170px-Pezophaps_solitaria.jpg",
				"previous": "Sexual size dimorphism in this species is perhaps the greatest in any neognath bird.[25] Males were considerably larger than females, measuring 90 cm (35 in) in length and weighing up to 28 kg (62 lb), whereas females were 70 cm (28 in) and weighed 17 kg (37 lb).[26] This is only 60% of the weight of a mature male.[25] Their weight may have varied substantially due to fat cycles, meaning that individuals were fat during cool seasons, but slim during hot seasons, and may have been as low as 21 kg in males and 13 kg in females.[27] Though male pigeons are usually larger than females, there is no direct evidence for the largest specimens actually being the males of the species, and this has only been assumed based on early works. Though the male was probably largest, this can only be confirmed by molecular sexing techniques, and not skeletal morphology alone.[25]",
				"after": "The Rodrigues solitaire shared traits with the dodo, its closest relative, such as size and features in the skull, pelvis and sternum. It differed in other aspects; it was taller and more slender than the dodo and had a smaller skull and beak, a flatter skull roof and larger orbits. Its neck and legs were proportionally longer, and the dodo did not possess an equivalent to the carpal knob of the Rodrigues solitaire. Many skeletal features of the Rodrigues solitaire and dodo that are unique among pigeons have evolved to adapt to flightlessness. Their pelvic elements were thicker than those of flighted birds (to support their greater weight), and their pectoral region and wings were paedomorphic (underdeveloped, retaining juvenile features). However, the skull, trunk and pelvic limbs were peramorphic, which means they changed considerably with maturity.[27]",
			"color": "dim|0.27357 gray|0.27357 dim|0.27357 grey|0.27357 gray|0.25654 grey|0.25654 dark|0.19369 gray|0.19369 dark|0.19369 grey|0.19369 silver|0.085303 black|0.04644 light|0.041778 gray|0.041778 light|0.041778 grey|0.041778 gainsboro|0.029153 white|0.010028 smoke|0.010028 sea|0.0070818 shell|0.0070818 snow|0.0068188 ghost|0.006518 white|0.006518 alice|0.0060727 blue|0.0060727 linen|0.0060332 white|0.0056011 floral|0.0052942 white|0.0052942 mint|0.0048502 cream|0.0048502 lavender|0.004543 blush|0.004543 slate|0.0040323 gray|0.0040323 azure|0.0035989  "
		}
	}
}
