{
	"add": {
		"doc": {
			"id": "6d8b77e4f1eda53ec79db44df7f257de210363706a2ef2571d2a1c05e712529f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Pan_American_Union%2C_Washington%2C_DC_in_1943.jpg/220px-Pan_American_Union%2C_Washington%2C_DC_in_1943.jpg",
				"previous": "At the Fourth International Conference of American States (Buenos Aires, 1910), the name of the organization was changed to the \"Union of American Republics\" and the Bureau became the \"Pan American Union.\" The Pan American Union Building was constructed in 1910, on Constitution Avenue, Northwest, Washington, D.C.",
				"after": "In the mid-1930s, U.S. President Franklin Delano Roosevelt organized an inter-American conference in Buenos Aires. One of the items at the conference was a \"League of Nations of the Americas\", an idea proposed by Colombia, Guatemala, and the Dominican Republic.[4] At the subsequent Inter-American Conference for the Maintenance of Peace, 21 nations pledged to remain neutral in the event of a conflict between any two members.[5] The experience of World War II convinced hemispheric governments that unilateral action could not ensure the territorial integrity of the American nations in the event of external aggression. To meet the challenges of global conflict in the postwar world and to contain conflicts within the hemisphere, they adopted a system of collective security, the Inter-American Treaty of Reciprocal Assistance (Rio Treaty) signed in 1947 in Rio de Janeiro.",
			"color": "black|0.37867 light|0.090707 gray|0.090707 light|0.090707 grey|0.090707 silver|0.080703 misty|0.059903 rose|0.059903 antique|0.058487 white|0.058487 gainsboro|0.05736 dark|0.04598 gray|0.04598 dark|0.04598 grey|0.04598 linen|0.040808 dim|0.03514 gray|0.03514 dim|0.03514 grey|0.03514 gray|0.027571 grey|0.027571 sea|0.020715 shell|0.020715 old|0.020492 lace|0.020492 papaya|0.013013 whip|0.013013 floral|0.010943 white|0.010943 tan|0.009624 lavender|0.008486 blush|0.008486 blanched|0.0064511 almond|0.0064511  "
		}
	}
}
