{
	"add": {
		"doc": {
			"id": "6da6573a26532842a18ee97f5ddf5100c1ebfa024e98068f96b42f7fb0e184fd",
			"url": "https://upload.wikimedia.org/wikipedia/en/9/92/Warner_Bros_Games.png",
				"previous": "In 2003, they co-published their first video game, Looney Tunes: Back in Action. Electronic Arts was the other publisher of the game.[1] In 2004, Warner Bros. acquired developer Monolith Productions.[2] In 2005, the WB Games label was created. The first game that Monolith developed in conjunction with Warner Bros. Entertainment was The Matrix Online which SEGA helped co-publish. Warner Bros. also helped distribute both Enter the Matrix and The Matrix: Path of Neo for the Matrix series. In 2006, they bought a 10.3% stake in SCi Entertainment, the owner of Eidos Interactive. That same year, they released their first self-published title (with no co-publishers), Justice League Heroes, which was distributed by Eidos on the Xbox. In 2007, their goal was for a five-year plan to expand in the video game industry, which includes the acquisition of studios for internal development and the creation of a studio (WB Games) in the Seattle area that will run all the games published and developed by the company;[3] starting with the acquisition of TT Games that same year for the amount of £100 million.[4]",
				"after": "In April 2008, they increased their stake to 35% gaining distribution right of all Eidos games in the United States, Canada and Mexico.[5] On December 15, 2008, right after SCi changed their name to Eidos plc, Warner acquired a total of 10 million shares of the company, raising its owned amount to 19.92%, after an agreement which prevented Time Warner from acquiring more shares was scrapped one month earlier.[6] On January 28, 2009, The Hollywood Reporter reported the deal also gave Warner the rights of the Tomb Raider film series,[7] previously owned by Paramount Pictures. On February 12, 2009, SQEX Ltd, a wholly owned subsidiary of Square Enix, announced a takeover offer worth £84.3 million (32p per share) for Eidos plc,[8] which was backed by Warner Bros. as shareholder.[9] Square Enix eventually took over the company April 22, 2009 and later changed the name to Square Enix Europe.",
			"color": "black|0.3907 dark|0.07916 gray|0.07916 dark|0.07916 grey|0.07916 gray|0.071883 grey|0.071883 light|0.070464 gray|0.070464 light|0.070464 grey|0.070464 silver|0.067286 dim|0.057897 gray|0.057897 dim|0.057897 grey|0.057897 gainsboro|0.057481 white|0.032728 smoke|0.032728 linen|0.019704 snow|0.017978 alice|0.017565 blue|0.017565 ghost|0.017369 white|0.017369 sea|0.017155 shell|0.017155 lavender|0.01603 blush|0.01603 white|0.014194 mint|0.010434 cream|0.010434 floral|0.0090194 white|0.0090194 lavender|0.0080024 azure|0.0062442 old|0.0048727 lace|0.0048727 ivory|0.004667 slate|0.0044337 gray|0.0044337  "
		}
	}
}
