{
	"add": {
		"doc": {
			"id": "6dacb655f1aef087dd963d18159de4a138950dd7ca0e87a17bca09ffe6bea4c0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/SNECMA_-_P_%26_W_TF_106_Jet_Engine_%287362379444%29.jpg/220px-SNECMA_-_P_%26_W_TF_106_Jet_Engine_%287362379444%29.jpg",
				"previous": "The F-14's problems did not afflict TF30 engines in the F-111 to nearly the same extent as the USAF and RAAF F-111. The F-111, while technically designated as a \"fighter,\" was actually used as a strike aircraft against ground targets, representing the frequent dichotomy between USAF and USN/USMC in defining what is a \"fighter\" aircraft, with the former utilizing the term for many of its ground attack/strike aircraft, while the latter reserving the term only for those aircraft which can engage in air-to-air combat and referring to its strike aircraft as \"attack\" aircraft. The strike mission is characterized by discrete phases, so less abrupt changes in throttle, angle of attack and altitude are required than in air-to-air combat against a peer or near-peer adversary aircraft. Though the F-14A entered service with the Navy powered by Pratt & Whitney TF30, by the end of the decade, following numerous problems with the original engine, the Department of Defense began procuring F110-GE-400 engines and installed them in the F-14A Plus (later redesignated to F-14B in 1991), which entered service with the fleet in 1988. These engines solved the reliability problems and provided nearly 30% more thrust, achieving a 1:1 dry thrust to weight ratio. The subsequent F-14D, a combination of both remanufactured/upgraded F-14As and new manufacture F-14Ds, also used F110-GE-400 engines.",
				"after": "Source:[9]",
			"color": "dim|0.26825 gray|0.26825 dim|0.26825 grey|0.26825 gray|0.17807 grey|0.17807 black|0.13479 dark|0.11219 gray|0.11219 dark|0.11219 grey|0.11219 dark|0.046449 golden|0.046449 rod|0.046449 golden|0.039942 rod|0.039942 silver|0.039343 slate|0.027598 gray|0.027598 light|0.023827 slate|0.023827 gray|0.023827 light|0.012268 gray|0.012268 light|0.012268 grey|0.012268 light|0.01076 steel|0.01076 blue|0.01076 khaki|0.0089825 lavender|0.0087597  "
		}
	}
}
