{
	"add": {
		"doc": {
			"id": "6db87b1192ac692205788320a6f98183d43358bffa33e22cbc1aa537dab60575",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Guardians_of_Day_and_Night%2C_Han_Dynasty.jpg/220px-Guardians_of_Day_and_Night%2C_Han_Dynasty.jpg",
				"previous": "The Partisan Prohibitions were repealed during the Yellow Turban Rebellion and Five Pecks of Rice Rebellion in 184 AD, largely because the court did not want to continue to alienate a significant portion of the gentry class who might otherwise join the rebellions.[81] The Yellow Turbans and Five-Pecks-of-Rice adherents belonged to two different hierarchical Daoist religious societies led by faith healers Zhang Jue (d. 184 AD) and Zhang Lu (d. 216 AD), respectively. Zhang Lu's rebellion, in modern northern Sichuan and southern Shaanxi, was not quelled until 215 AD.[82] Zhang Jue's massive rebellion across eight provinces was annihilated by Han forces within a year, however the following decades saw much smaller recurrent uprisings.[83] Although the Yellow Turbans were defeated, many generals appointed during the crisis never disbanded their assembled militia forces and used these troops to amass power outside of the collapsing imperial authority.[84]",
				"after": "General-in-Chief He Jin (d. 189 AD), half-brother to Empress He (d. 189 AD), plotted with Yuan Shao (d. 202 AD) to overthrow the eunuchs by having several generals march to the outskirts of the capital. There, in a written petition to Empress He, they demanded the eunuchs' execution.[86] After a period of hesitation, Empress He consented. When the eunuchs discovered this, however, they had her brother He Miao (何苗) rescind the order.[87] The eunuchs assassinated He Jin on September 22, 189 AD. Yuan Shao then besieged Luoyang's Northern Palace while his brother Yuan Shu (d. 199 AD) besieged the Southern Palace. On September 25 both palaces were breached and approximately two thousand eunuchs were killed.[88] Zhang Rang had previously fled with Emperor Shao (r. 189 AD) and his brother Liu Xie—the future Emperor Xian of Han (r. 189–220 AD). While being pursued by the Yuan brothers, Zhang committed suicide by jumping into the Yellow River.[89]",
			"color": "sienna|0.17914 dark|0.070456 salmon|0.070456 peach|0.065653 puff|0.065653 tan|0.062964 antique|0.052017 white|0.052017 peru|0.047774 rosy|0.037653 brown|0.037653 bisque|0.035919 burly|0.03533 wood|0.03533 saddle|0.033888 brown|0.033888 misty|0.029407 rose|0.029407 linen|0.027732 papaya|0.026682 whip|0.026682 blanched|0.025613 almond|0.025613 sea|0.024887 shell|0.024887 floral|0.021677 white|0.021677 old|0.021592 lace|0.021592 sandy|0.016146 brown|0.016146 snow|0.014956 white|0.014721 smoke|0.014721 light|0.012758 gray|0.012758 light|0.012758 grey|0.012758 white|0.012489 silver|0.011989 ivory|0.011778 mint|0.011597 cream|0.011597  "
		}
	}
}
