{
	"add": {
		"doc": {
			"id": "6dbf5e6fd11fe6a85548a2cf43f03e637054bf1dd888f999f3798c0b1be1a187",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Aug_5_2006_goldfinch_nest.jpg/220px-Aug_5_2006_goldfinch_nest.jpg",
				"previous": "Once a male has found a mate, he selects a territory, marking the boundaries by warbling as he flies from perch to perch. After circling the perimeter, he performs two flight displays, first repeating a low, flat flight, then flying in an exaggerated version of normal flight, tucking his wings close to his body, plummeting earthwards and catching himself as he spreads his wings to glide upward in a series of loops. Two or three pairs may group their territories together in a loose colony, perhaps to aid in defense against predators.[16]",
				"after": "The nest is built in late summer by the female in the branches of a deciduous shrub or tree at a height of up to 10 m (33 ft). The nest-building lasts approximately six days, during which time the female works in 10–40 minute increments. The male frequently flies with the female as she collects nesting materials, and though he may carry some materials back to the nest, he leaves its construction to the female. The outer shell of the nest is built of bark, weeds, vines, and grass.[23] The inside diameter of the finished nest is about 6.5 cm (2.6 in).[22] The rim is reinforced with bark bound by spiderwebs and caterpillar silk, and the cup is lined with plant down from milkweed, thistle, or cattail. The nest is so tightly woven that it can hold water, and it is possible for nestlings to drown following a rainstorm if the parents do not cover the nest.[17]",
			"color": "dark|0.44406 olive|0.44406 green|0.44406 pale|0.082424 golden|0.082424 rod|0.082424 dark|0.04824 khaki|0.04824 light|0.040405 golden|0.040405 rod|0.040405 yellow|0.040405 lemon|0.033352 chiffon|0.033352 honeydew|0.031342 beige|0.026282 light|0.024242 yellow|0.024242 light|0.019704 cyan|0.019704 corn|0.018489 silk|0.018489 mint|0.017652 cream|0.017652 azure|0.016524 olive|0.015584 khaki|0.01554 ivory|0.013845 dark|0.013658 sea|0.013658 green|0.013658 olive|0.013133 drab|0.013133  "
		}
	}
}
