{
	"add": {
		"doc": {
			"id": "6de85d400890c46c7cfc3c21945a526cc019d376c79900d6a2363d3ccd674b6b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Tel-o-fun.jpg/220px-Tel-o-fun.jpg",
				"previous": "The underground section will include 10 stations, including an interchange with Israel Railways services at Tel Aviv Central Railway Station and the nearby 2000 Terminal. A maintenance depot, connected via a branch line and tunnel to the main section of the line, will be constructed in Kiryat Arye, across from the existing Kiryat Arye suburban railway station. The intended builder and operator of the first line, MTS, has had financial difficulties that postponed the line's opening. In May 2010, the ministry of finance decided to cancel the agreement with MTS due to the difficulties and the agreement was cancelled in August 2010.[210] The line is being built instead by NTA – The Tel Aviv region's mass transit development authority. Initially, the line's targeted opening was in 2012 and today the target is 2016 after several postponements due to the disagreements with MTS and NTA's takeover of the project.",
			"after": [
				"Tel Aviv Municipality encourages the use of bicycles in the city. Plans called for expansion of the paths to 100 kilometers (62.1 mi) by 2009.[211]",
				"In April 2011, Tel Aviv municipality launched Tel-O-Fun, a bicycle sharing system, in which 150 stations of bicycles for rent were installed within the city limits.[212] As of October 2011, there are 125 active stations, providing more than 1,000 bicycles. As of April 2011 the municipality has completed construction of about 100 km (62 mi) of bicycle paths."
			],
			"color": "black|0.17453 silver|0.11517 dark|0.10214 gray|0.10214 dark|0.10214 grey|0.10214 dim|0.091496 gray|0.091496 dim|0.091496 grey|0.091496 gray|0.078876 grey|0.078876 light|0.078458 gray|0.078458 light|0.078458 grey|0.078458 gainsboro|0.047947 olive|0.039208 drab|0.039208 misty|0.035672 rose|0.035672 antique|0.035294 white|0.035294 dark|0.030327 olive|0.030327 green|0.030327 linen|0.0295 sea|0.01752 shell|0.01752 old|0.015582 lace|0.015582 floral|0.011327 white|0.011327 tan|0.010294 white|0.0093998 smoke|0.0093998 lavender|0.0077342 blush|0.0077342 burly|0.0072967 wood|0.0072967 snow|0.0072022 papaya|0.007038 whip|0.007038  "
		}
	}
}
