{
	"add": {
		"doc": {
			"id": "6df1c0ea52615d76333eb0e7309d763bd69efd228880aeedf7e5710754ecdbe0",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/7/75/Gypsy_escortDN-ST-91-05966.jpg/170px-Gypsy_escortDN-ST-91-05966.jpg",
				"previous": "While the Tomcat was being used by Iran in combat against Iraq in its intended air superiority mission in the early 1980s, the U.S. Navy found itself flying regular daily combat missions over Lebanon to photograph activity in the Bekaa Valley. At the time, the Tomcat had been thought too large and vulnerable to be used over land, but the need for imagery was so great that Tomcat aircrews developed high speed medium altitude tactics to deal with considerable AAA and SA-7 SAM threat in the Bekaa area. The first exposure of a Navy Tomcat to a SA-2 missile was over Somalia in April 1983 when a local battery was unaware of two Tomcats scheduled for a TARPS mission in prelude to an upcoming international exercise in vicinity of Berbera. An SA-2 was fired at the second Tomcat while conducting 10,000-ft mapping profile at max conserve setting. The Tomcat aircrews spotted the missile launch and dove for the deck thereby evading it without damage. The unexpected demand for combat TARPS laid the way for high altitude sensors such as the KA-93 36 in (910 mm) Long Range Optics (LOROP) to be rapidly procured for the Tomcat as well as an Expanded Chaff Adapter (ECA) to be incorporated in an AIM-54 Phoenix Rail. Commercial \"Fuzz buster\" type radar detectors were also procured and mounted in pairs in the forward cockpit as a stop gap solution to detect SAM radars such as the SA-6. The ultimate solution was an upgrade to the ALR-67 then being developed, but it would not be ready until the advent of the F-14A+ later in 1980s.[citation needed]",
				"after": "The participation of the F-14 in the 1991 Operation Desert Storm consisted of Combat Air Patrol (CAP) over the Red Sea and Persian Gulf and overland missions consisting of strike escort and reconnaissance. Until the waning days of Desert Storm, in-country air superiority was tasked to USAF F-15 Eagles due to the way the Air Tasking Orders (ATO) delegated primary overland CAP stations to the F-15 Eagle. The governing Rules of Engagement (ROE) also dictated a strict Identification Friend or Foe (IFF) requirement when employing Beyond Visual Range weapons such as the AIM-7 Sparrow and particularly the AIM-54 Phoenix. This hampered the Tomcat from using its most powerful weapon. Furthermore, the powerful emissions from the AWG-9 radar are detectable at great range with a radar warning receiver. Iraqi fighters routinely retreated as soon as the Tomcats \"lit them up\" with the AWG-9.[45][46] The U.S. Navy suffered its only F-14 loss from enemy action on 21 January 1991 when BuNo 161430, an F-14A upgraded to an F-14A+, from VF-103 was shot down by an SA-2 surface-to-air missile while on an escort mission near Al Asad airbase in Iraq. Both crew survived ejection with the pilot being rescued by USAF Special Forces and the RIO being captured by Iraqi troops as a POW until the end of the war.[47] The F-14 also achieved its final kill in US service, an Mi-8 \"Hip\" helicopter, with an AIM-9 Sidewinder.",
			"color": "burly|0.18189 wood|0.18189 peach|0.13046 puff|0.13046 tan|0.070558 misty|0.069042 rose|0.069042 antique|0.063124 white|0.063124 linen|0.046979 bisque|0.046109 gainsboro|0.031391 light|0.029983 gray|0.029983 light|0.029983 grey|0.029983 navajo|0.027465 white|0.027465 sea|0.027427 shell|0.027427 dark|0.026785 gray|0.026785 dark|0.026785 grey|0.026785 wheat|0.025707 blanched|0.022981 almond|0.022981 papaya|0.022492 whip|0.022492 old|0.021065 lace|0.021065 silver|0.020999 black|0.016628 lavender|0.015028 blush|0.015028 white|0.014804 smoke|0.014804 gray|0.01118 grey|0.01118 floral|0.01075 white|0.01075 dim|0.010388 gray|0.010388 dim|0.010388 grey|0.010388 snow|0.0084091 dark|0.0071587 slate|0.0071587 gray|0.0071587 ghost|0.0053506 white|0.0053506 moccasin|0.0052338 corn|0.003773 silk|0.003773 alice|0.0037625 blue|0.0037625 light|0.0036797 slate|0.0036797 gray|0.0036797 white|0.0035709 slate|0.0033868 gray|0.0033868 beige|0.0032618  "
		}
	}
}
