{
	"add": {
		"doc": {
			"id": "6df556aaebe75c19343955489e6d0ad288f855ea932a14923fbc814e7d617d5a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/U.S._Territorial_Acquisitions.png/300px-U.S._Territorial_Acquisitions.png",
				"previous": "Americans' eagerness to expand westward prompted a long series of American Indian Wars.[86] The Louisiana Purchase of French-claimed territory in 1803 almost doubled the nation's size.[87] The War of 1812, declared against Britain over various grievances and fought to a draw, strengthened U.S. nationalism.[88] A series of U.S. military incursions into Florida led Spain to cede it and other Gulf Coast territory in 1819.[89] Expansion was aided by steam power, when steamboats began traveling along America's large water systems, which were connected by new canals, such as the Erie and the I&M; then, even faster railroads began their stretch across the nation's land.[90]",
				"after": "From 1820 to 1850, Jacksonian democracy began a set of reforms which included wider male suffrage; it led to the rise of the Second Party System of Democrats and Whigs as the dominant parties from 1828 to 1854. The Trail of Tears in the 1830s exemplified the Indian removal policy that moved Indians into the west to their own reservations. The U.S. annexed the Republic of Texas in 1845 during a period of expansionist Manifest destiny.[91] The 1846 Oregon Treaty with Britain led to U.S. control of the present-day American Northwest.[92] Victory in the Mexican–American War resulted in the 1848 Mexican Cession of California and much of the present-day American Southwest.[93]",
			"color": "tan|0.15907 burly|0.127 wood|0.127 misty|0.080063 rose|0.080063 lavender|0.06799 blush|0.06799 sea|0.045304 shell|0.045304 linen|0.033845 white|0.033719 smoke|0.033719 sky|0.033675 blue|0.033675 snow|0.030898 alice|0.029992 blue|0.029992 light|0.029882 gray|0.029882 light|0.029882 grey|0.029882 ghost|0.029542 white|0.029542 silver|0.029411 mint|0.028523 cream|0.028523 gainsboro|0.028356 azure|0.028196 white|0.027843 floral|0.025978 white|0.025978 thistle|0.022381 gold|0.017299 dark|0.016819 gray|0.016819 dark|0.016819 grey|0.016819 lavender|0.010361 cadet|0.01034 blue|0.01034 ivory|0.010201 gray|0.0083986 grey|0.0083986 dim|0.0079742 gray|0.0079742 dim|0.0079742 grey|0.0079742 light|0.0043027 steel|0.0043027 blue|0.0043027 light|0.0037758 salmon|0.0037758  "
		}
	}
}
