{
	"add": {
		"doc": {
			"id": "6e052d3aae7864723a15264d6c6515f9b94a1e708ef984f9513f94d645bdd0e9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Barbados_Blackbelly.JPG/170px-Barbados_Blackbelly.JPG",
				"previous": "The domestic sheep is a multi-purpose animal, and the more than 200 breeds now in existence were created to serve these diverse purposes.[4][18] Some sources give a count of a thousand or more breeds,[19][20] but these numbers cannot be verified, according to some sources.[7][12] However, several hundred breeds of sheep have been identified by the FAO (Food and Agriculture Organization of the UN), with the estimated number varying somewhat from time to time: e.g. 863 breeds as of 1993,[21] 1314 breeds as of 1995[22] and 1229 breeds as of 2006.[23] (These numbers exclude extinct breeds, which are also tallied by the FAO.) For purposes of such tallies, the FAO definition of a breed is \"either a subspecific group of domestic livestock with definable and identifiable external characteristics that enable it to be separated by visual appraisal from other similarly defined groups within the same species or a group for which geographical and/or cultural separation from phenotypically similar groups has led to acceptance of its separate identity.\"[23] Almost all sheep are classified as being best suited to furnishing a certain product: wool, meat, milk, hides, or a combination in a dual-purpose breed. Other features used when classifying sheep include face color (generally white or black), tail length, presence or lack of horns, and the topography for which the breed has been developed. This last point is especially stressed in the UK, where breeds are described as either upland (hill or mountain) or lowland breeds.[16] A sheep may also be of a fat-tailed type, which is a dual-purpose sheep common in Africa and Asia with larger deposits of fat within and around its tail.",
				"after": "Breeds are often categorized by the type of their wool. Fine wool breeds are those that have wool of great crimp and density, which are preferred for textiles. Most of these were derived from Merino sheep, and the breed continues to dominate the world sheep industry. Downs breeds have wool between the extremes, and are typically fast-growing meat and ram breeds with dark faces.[24] Some major medium wool breeds, such as the Corriedale, are dual-purpose crosses of long and fine-wooled breeds and were created for high-production commercial flocks. Long wool breeds are the largest of sheep, with long wool and a slow rate of growth. Long wool sheep are most valued for crossbreeding to improve the attributes of other sheep types. For example: the American Columbia breed was developed by crossing Lincoln rams (a long wool breed) with fine-wooled Rambouillet ewes.",
			"color": "black|0.30397 gray|0.21393 grey|0.21393 dark|0.17405 gray|0.17405 dark|0.17405 grey|0.17405 dim|0.15692 gray|0.15692 dim|0.15692 grey|0.15692 silver|0.069845 light|0.027302 gray|0.027302 light|0.027302 grey|0.027302 gainsboro|0.016158  "
		}
	}
}
