{
	"add": {
		"doc": {
			"id": "6e1215c5a4e1623de9ab5136b74fb83075ecda3534ca831a91234ccfea74b948",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/CristodelaRedenci%C3%B3noriginal.jpg/185px-CristodelaRedenci%C3%B3noriginal.jpg",
				"previous": "The city hosts the International Association of Science and Technology Parks (IASP) (Asociación Internacional de Parques Tecnológicos), and a group of IT company executives and business leaders has launched an information sector initiative, Málaga Valley e-27, which seeks to make Málaga the Silicon Valley of Europe. Málaga has had strong growth in new technology industries, mainly located in the Technological Park of Andalusia, and in the construction sector. The city is home to the largest bank in Andalusia, Unicaja, and such local companies as Mayoral, Charanga, Sando, Vera, Ubago, Isofoton, Tedial, Novasoft, Grupo Vértice and Almeida viajes, and other multinationals such as Fujitsu Spain, Pernod Ricard Spain, Accenture, Epcos, Oracle Corporation, Huawei and San Miguel.[26]",
			"after": [
				"The Holy Week celebration, the August Málaga Fair (Feria de Málaga) and the Málaga Film Festival are the three major events held in the city.",
				"The Holy Week of Málaga has been observed for five centuries. Processions start on Palm Sunday and continue until Easter Sunday. Images depicting scenes from the Passion are displayed on huge ornate tronos (floats or thrones), some weighing more than 5,000 kilos and carried by more than 250 members of the fraternity of Nuestra Señora de la Esperanza. These tronos highlight the processions that go through the streets led by penitents dressed in long purple robes, often with pointed hats, followed by women in black carrying candles. Drums and trumpets play music and occasionally someone spontaneously sings a mournful saeta dedicated to the floats as they make their way slowly round the streets."
			],
			"color": "black|0.2512 dim|0.21665 gray|0.21665 dim|0.21665 grey|0.21665 gray|0.15158 grey|0.15158 dark|0.071932 slate|0.071932 gray|0.071932 maroon|0.058742 dark|0.050144 olive|0.050144 green|0.050144 dark|0.045124 gray|0.045124 dark|0.045124 grey|0.045124 midnight|0.020666 blue|0.020666 dark|0.019545 slate|0.019545 blue|0.019545 dark|0.018664 red|0.018664 slate|0.014979 gray|0.014979  "
		}
	}
}
