{
	"add": {
		"doc": {
			"id": "6e178aa0f9b8671acce40ea6cacd4499d7b28a9bd5aa477dd73d43df86878704",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/SawtoothsUtahRidgedrive.jpg/220px-SawtoothsUtahRidgedrive.jpg",
				"previous": "Visiting distant backcountry areas requires accessing hiking trails and then backpacking or horseback riding into remote destinations. Free permits are required for use of the wilderness and can be obtained at trailheads. Group size is restricted in the wilderness, open fires are not permitted in some high-use areas, and visitors are expected to follow Leave No Trace practices. There are abundant trails throughout the forest, with over 700 miles (1,100 km) in the SNRA, 440 miles (710 km) in the Fairfield District, and 341 miles (549 km) in the Minidoka District.[3] Two National Recreation Trails are found on the forest, the Fishhook Creek Boardwalk at Redfish Lake and the Wood River Nature Trail at the Wood River Campground.[2]",
				"after": "All-terrain vehicles are allowed on over 500 mi (800 km) of forest roads and some trails, but access may be restricted depending on season and environmental conditions. The Sun Valley area has an extensive network of mountain biking trails.[3] Hunting and fishing are popular recreational activities permitted throughout the forest, provided that proper permits are obtained and the applicable rules and regulations are followed. Hunting and fishing licenses are available from the state of Idaho through the Idaho Department of Fish and Game.[118]",
			"color": "dim|0.1675 gray|0.1675 dim|0.1675 grey|0.1675 light|0.15076 gray|0.15076 light|0.15076 grey|0.15076 black|0.13255 gainsboro|0.12088 gray|0.086908 grey|0.086908 silver|0.069422 linen|0.043519 antique|0.030517 white|0.030517 dark|0.027296 slate|0.027296 gray|0.027296 old|0.023156 lace|0.023156 light|0.022578 slate|0.022578 gray|0.022578 slate|0.020292 gray|0.020292 sea|0.0168 shell|0.0168 white|0.01528 smoke|0.01528 floral|0.0138 white|0.0138 dark|0.012679 gray|0.012679 dark|0.012679 grey|0.012679 beige|0.011306 ivory|0.0074959  "
		}
	}
}
