{
	"add": {
		"doc": {
			"id": "6e200d99f6ffff5efab2b0cbeac3bea78d3ff0b75d3ebdc4a47ee3b9a7245f43",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Corvus_coronoides_-_Glebe_Point%2C_Sydney%2C_New_South_Wales%2C_Australia_-head-8.jpg/220px-Corvus_coronoides_-_Glebe_Point%2C_Sydney%2C_New_South_Wales%2C_Australia_-head-8.jpg",
			"previous": [],
				"after": "Measuring 46–53 cm (18–21 in) in length with a 100 cm (40 in) wingspan and weighing around 650 g (1.4 lb),[4] the adult Australian raven is an all black-bird with a black beak, mouth and tongue and sturdy black or grey-black legs and feet.[23] The tibia is fully feathered and the tarsus is long, and the feet large and strong.[24] It has white irises.[23] The plumage is glossy with a blue-purple to blue-green sheen, greenish over the ear coverts, depending on light. The underparts are not glossy.[25] The Australian raven has throat feathers (hackles) that are lanceolate with rounded tips, while the other four species of Australian corvids have bifurcate tips, though this can be difficult to see in the field.[21] The hackles are also longer than those of the other four species; when they are raised (such as when the bird is calling), they give the bird an unusual bearded appearance. The upper third of the upper mandible, including the nares and nasal groove, is covered with bristles,[25] which can be up to 3 cm (1.2 in) long.[26] The heavy-set beak is tipped with a slight hook,[25] and is longer than the bird's head. The wings are long and broad, with the longest of its ten primary feathers (usually the seventh but occasionally the eighth) almost reaching the end of the tail when the bird is at rest. The tail is rounded or wedge-shaped.[24] The Australian raven can be distinguished from the two species of crow occurring in Australia by the grey base of the feathers, which is white in the latter species. The demarcation between pale and black regions on the feather is gradual in the ravens and sharply delineated in the crows. Feather bases are not normally visible when observing birds in the field, but can sometimes be seen on a windy day if the feathers are ruffled.[21] Unlike the other four species, the Australian raven has a bare patch of skin under, and extending to beside, the bill. This can be hard to discern in the field. The three species of raven are more heavily set with a broader chest than the two crow species, with the forest raven the stockiest of all.[27] Relative size of species is only useful when two species can be seen side by side, as the overlap in size is large and the difference in size small.[28]",
			"color": "black|0.23436 dim|0.20043 gray|0.20043 dim|0.20043 grey|0.20043 dark|0.16473 gray|0.16473 dark|0.16473 grey|0.16473 silver|0.13492 gray|0.096591 grey|0.096591 light|0.072073 gray|0.072073 light|0.072073 grey|0.072073 gainsboro|0.045394 white|0.0118 smoke|0.0118  "
		}
	}
}
