{
	"add": {
		"doc": {
			"id": "6e206e47196c6b5766581da409de42c46987e543880d248002d97609360346b4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Hyndman_Peak.JPG/170px-Hyndman_Peak.JPG",
				"previous": "The forest maintains a full-time fire staff throughout the summer, not only to control and extinguish fires that pose threats to people and structures but also to set controlled burns. Their jobs include maintaining a high level of preparedness, keeping a vigilant lookout for fire activity, responding to reports of fires, maintaining equipment, monitoring weather and relative atmospheric dryness, and preparing daily fire activity reports, which are used to post fire information for visitors and staff.[3] The forest has wildland fire engines, pumps, hand tools and fire hose at its disposal. A helicopter can be summoned quickly, along with support from the South Central Idaho Interagency Dispatch Center, including a team of smokejumpers and air tankers used to provide air support in dropping flame retardant and water. There are small areas around Stanley and Mount Harrison where aerial retardant would not be used in the case of a fire.[74] The 10-member Sawtooth Helitack crew was established in 1963 and is based at Friedman Memorial Airport in Hailey.[75] In the case of larger fires, the National Interagency Fire Command can quickly mobilize available resources. Only four of the original fire lookout towers remain standing in the forest, but they are no longer in use: Iron Mountain, Horton Peak, Lookout Mountain, and Mount Harrison, which was last fully staffed in 2007.[1][76] Many of these towers were built by the Civilian Conservation Corps during the Great Depression.[16]:I-20",
			"after": [],
			"color": "dim|0.36929 gray|0.36929 dim|0.36929 grey|0.36929 gray|0.27346 grey|0.27346 dark|0.079944 gray|0.079944 dark|0.079944 grey|0.079944 silver|0.048045 light|0.047253 gray|0.047253 light|0.047253 grey|0.047253 gainsboro|0.043188 steel|0.029641 blue|0.029641 white|0.01651 smoke|0.01651 sea|0.010141 shell|0.010141 alice|0.01011 blue|0.01011 ghost|0.0099823 white|0.0099823 snow|0.0098686 lavender|0.0096264 blush|0.0096264 linen|0.0089754 white|0.0083812 mint|0.0069139 cream|0.0069139 floral|0.0049429 white|0.0049429 azure|0.0038538 light|0.0038025 slate|0.0038025 gray|0.0038025  "
		}
	}
}
