{
	"add": {
		"doc": {
			"id": "6e3c8825bee9cba949c8d7556182187f5c053e9afdd642a2f2cda72e45df7189",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Mikak_and_Tukauk.jpg/220px-Mikak_and_Tukauk.jpg",
				"previous": "In 1583 Newfoundland became England's first possession in North America and one of the earliest permanent English colonies in the New World[51] when it was claimed by Sir Humphrey Gilbert for Queen Elizabeth. Though English fishing boats had visited Newfoundland continuously since Cabot's second voyage in 1498 and seasonal fishing camps had existed for a century prior, similar was true of Basque, French, and Portuguese ships and camps, thus pressure to secure the island from foreign control led to the appointment of Proprietary Governors to establish colonial settlements on the island from 1610 to 1728. John Guy was governor of the first settlement at Cuper's Cove. Other settlements were Bristol's Hope, Renews, New Cambriol, South Falkland and Avalon which became a province in 1623. The first governor given jurisdiction over all of Newfoundland was Sir David Kirke in 1638.",
				"after": "Explorers soon realized that the waters around Newfoundland had the best fishing in the North Atlantic.[52] By 1620, 300 fishing boats worked the Grand Bank, employing some 10,000 sailors; many continuing to come from Basque Country, Normandy, or Brittany. They dried and salted the cod on the coast and sold it to Spain and Portugal. Heavy investment by Sir George Calvert, 1st Baron Baltimore, in the 1620s in wharves, warehouses, and fishing stations failed to pay off. French raids hurt the business, and the weather was terrible, so he redirected his attention to his other colony in Maryland.[53] After Calvert left, small-scale entrepreneurs such as Sir David Kirke made good use of the facilities. Kirke became the first governor in 1639.[54] A triangular trade with New England, the West Indies, and Europe gave Newfoundland an important economic role. By the 1670s there were 1700 permanent residents and another 4500 in the summer months.[55]",
			"color": "black|0.33029 rosy|0.058875 brown|0.058875 dim|0.046202 gray|0.046202 dim|0.046202 grey|0.046202 misty|0.045603 rose|0.045603 peach|0.034514 puff|0.034514 thistle|0.026802 gray|0.025822 grey|0.025822 silver|0.025624 steel|0.025028 blue|0.025028 dark|0.024988 gray|0.024988 dark|0.024988 grey|0.024988 light|0.023991 gray|0.023991 light|0.023991 grey|0.023991 dark|0.022684 salmon|0.022684 antique|0.019206 white|0.019206 gainsboro|0.018741 sienna|0.0174 brown|0.017043 linen|0.016542 bisque|0.013764 sea|0.012238 shell|0.012238 lavender|0.012074 blush|0.012074 old|0.011384 lace|0.011384 papaya|0.010934 whip|0.010934 slate|0.010528 gray|0.010528 blanched|0.01011 almond|0.01011 burly|0.0092881 wood|0.0092881 floral|0.0089053 white|0.0089053 light|0.0085412 slate|0.0085412 gray|0.0085412  "
		}
	}
}
