{
	"add": {
		"doc": {
			"id": "6e4c17b936c7c7b4cf9e2f93e55f6828c5dbe7cd1ed26366f3a9a8caf0bcb46a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Officer%27s_daughter.jpg/220px-Officer%27s_daughter.jpg",
				"previous": "During the era of the collodion process, before the arrival of less demanding photographic technology (the gelatin silver process, photographic film, and smaller cameras) and the consequent rise of amateur photography, commercial photographers like Farsari had a particular importance for recording events and views. In Japan before 1899 such photographers were even more significant because the government required foreigners to obtain passes to journey to the interior, and commercial photographers based in Japan could more easily gain access and provide rare images of restricted areas.[31] By 1889, however, Farsari estimated that about half of all visitors to Yokohama were amateur photographers; even if this was an exaggeration, the presence of increasing numbers of amateur photographers was obviously having an impact on the commercial photography business. To encourage amateur photographers to visit his studio and possibly buy his merchandise, Farsari provided free use of a darkroom.[32]",
				"after": "Attribution is often difficult with Farsari's photographs because 19th-century photographers frequently acquired each others' images and sold them under their own names. This may be due to the commonplace exchange of stock and negatives between various commercial photographers, or due to the number of freelance amateurs who sold their work to more than one studio.[33] Thus a photograph identified as by Farsari might actually be by Beato, Stillfried & Andersen or Kusakabe.[34] A case in point is the photograph of an Officer's Daughter, variously attributed to Farsari, Stillfried, Kusakabe or even Suzuki Shin'ichi.[35]",
			"color": "dark|0.062168 gray|0.062168 dark|0.062168 grey|0.062168 silver|0.05699 light|0.05311 steel|0.05311 blue|0.05311 lavender|0.049448 blush|0.049448 white|0.048399 smoke|0.048399 misty|0.046956 rose|0.046956 snow|0.044862 light|0.044769 gray|0.044769 light|0.044769 grey|0.044769 ghost|0.043559 white|0.043559 sea|0.042742 shell|0.042742 gainsboro|0.041586 rosy|0.039959 brown|0.039959 white|0.038628 gray|0.036883 grey|0.036883 alice|0.033522 blue|0.033522 floral|0.033239 white|0.033239 dim|0.032086 gray|0.032086 dim|0.032086 grey|0.032086 linen|0.032005 mint|0.027945 cream|0.027945 thistle|0.026668 azure|0.021036 light|0.019246 blue|0.019246 lavender|0.015427 light|0.0094537 slate|0.0094537 gray|0.0094537 crimson|0.0091432 old|0.0087568 lace|0.0087568 ivory|0.0087007 pink|0.0080427 dark|0.0069421 sea|0.0069421 green|0.0069421 light|0.0065933 cyan|0.0065933 slate|0.0065752 gray|0.0065752 powder|0.0057851 blue|0.0057851  "
		}
	}
}
