{
	"add": {
		"doc": {
			"id": "6e50423680b4a9c08d40adac70743a30b09aac236e11f16a5daee42f17cdd2a8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Oiledcrestedauklet.jpeg/220px-Oiledcrestedauklet.jpeg",
				"previous": "Other human factors have led to declines and even extinctions in seabird populations, colonies and species. Of these, perhaps the most serious are introduced species. Seabirds, breeding predominantly on small isolated islands, have lost many predator defence behaviours.[38] Feral cats are capable of taking seabirds as large as albatrosses, and many introduced rodents, such as the Pacific rat, can take eggs hidden in burrows. Introduced goats, cattle, rabbits and other herbivores can lead to problems, particularly when species need vegetation to protect or shade their young.[56] Disturbance of breeding colonies by humans is often a problem as well—visitors, even well-meaning tourists, can flush brooding adults off a colony leaving chicks and eggs vulnerable to predators.",
				"after": "The build-up of toxins and pollutants in seabirds is also a concern. Seabirds, being apex predators, suffered from the ravages of DDT until it was banned; among other effects, DDT was implicated in embryo development problems and the skewed sex ratio of western gulls in southern California.[57] Oil spills are also a threat to seabird species, as both a toxin and because the feathers of the birds become saturated by the oil, causing them to lose their waterproofing.[58] Oil pollution threatens species with restricted ranges or already depressed populations.",
			"color": "dim|0.26315 gray|0.26315 dim|0.26315 grey|0.26315 gray|0.17832 grey|0.17832 dark|0.1303 salmon|0.1303 dark|0.097226 gray|0.097226 dark|0.097226 grey|0.097226 light|0.072044 salmon|0.072044 sienna|0.054944 silver|0.031755 slate|0.031191 gray|0.031191 light|0.021046 slate|0.021046 gray|0.021046 salmon|0.017356 black|0.015652 peach|0.014869 puff|0.014869 rosy|0.013299 brown|0.013299 coral|0.011763 light|0.0095963 gray|0.0095963 light|0.0095963 grey|0.0095963 gainsboro|0.0057478  "
		}
	}
}
