{
	"add": {
		"doc": {
			"id": "6e56800fb5792eab4170d121814e9c7c0de87bf5c0550336dc091e6bb0f7f281",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Rnai_phenotype_petunia_crop.png/250px-Rnai_phenotype_petunia_crop.png",
			"previous": [],
				"after": "The discovery of RNAi was preceded first by observations of transcriptional inhibition by antisense RNA expressed in transgenic plants,[148] and more directly by reports of unexpected outcomes in experiments performed by plant scientists in the United States and the Netherlands in the early 1990s.[149] In an attempt to alter flower colors in petunias, researchers introduced additional copies of a gene encoding chalcone synthase, a key enzyme for flower pigmentation into petunia plants of normally pink or violet flower color. The overexpressed gene was expected to result in darker flowers, but instead produced less pigmented, fully or partially white flowers, indicating that the activity of chalcone synthase had been substantially decreased; in fact, both the endogenous genes and the transgenes were downregulated in the white flowers. Soon after, a related event termed quelling was noted in the fungus Neurospora crassa,[150] although it was not immediately recognized as related. Further investigation of the phenomenon in plants indicated that the downregulation was due to post-transcriptional inhibition of gene expression via an increased rate of mRNA degradation.[151] This phenomenon was called co-suppression of gene expression, but the molecular mechanism remained unknown.[152]",
			"color": "light|0.1999 steel|0.1999 blue|0.1999 silver|0.19903 light|0.10692 gray|0.10692 light|0.10692 grey|0.10692 dark|0.067948 gray|0.067948 dark|0.067948 grey|0.067948 black|0.053194 light|0.052747 blue|0.052747 dark|0.04597 slate|0.04597 blue|0.04597 lavender|0.037546 gainsboro|0.026369 alice|0.022626 blue|0.022626 light|0.021837 cyan|0.021837 dim|0.021668 gray|0.021668 dim|0.021668 grey|0.021668 azure|0.017628 powder|0.015263 blue|0.015263 gray|0.014885 grey|0.014885 ghost|0.01176 white|0.01176 mint|0.011497 cream|0.011497 white|0.010791 smoke|0.010791 white|0.0092362 snow|0.0082501 slate|0.007292 gray|0.007292  "
		}
	}
}
