{
	"add": {
		"doc": {
			"id": "6e563934c8c434f3e1dcf0bcdb0b5f55917bb84acaa2283f2ead766820bc27f7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Cafe%C3%AFne.png/170px-Cafe%C3%AFne.png",
				"previous": "Organic chemistry is a specific discipline within chemistry which involves the scientific study of the structure, properties, composition, reactions, and preparation (by synthesis or by other means) of chemical compounds consisting primarily of carbon and hydrogen, which may contain any number of other elements, including nitrogen, oxygen, halogens as well as phosphorus, silicon and sulfur.",
				"after": "The original definition of \"organic\" chemistry came from the misconception that organic compounds were always related to life processes. Not all organic compounds support life on Earth, but life as we know it also depends heavily on inorganic chemistry; for example, many enzymes rely on transition metals such as iron and copper; and materials such as shells, teeth and bones are part organic, part inorganic in composition. Apart from elemental carbon, inorganic chemistry deals only with simple carbon compounds, with molecular structures which do not contain carbon to carbon connections (its oxides, acids, carbonates, carbides, and minerals). This does not mean that single-carbon organic compounds do not exist (viz. methane and its simple derivatives). Biochemistry mainly deals with the chemistry of proteins (and other large biomolecules).",
			"color": "dark|0.10323 turquoise|0.10323 light|0.1019 sea|0.1019 green|0.1019 turquoise|0.095222 medium|0.093483 turquoise|0.093483 aqua|0.09318 cyan|0.09318 medium|0.070044 blue|0.070044 dark|0.052589 cyan|0.052589 blue|0.052089 teal|0.041732 red|0.028685 dark|0.019831 red|0.019831 maroon|0.017113 cadet|0.014293 blue|0.014293 dark|0.013688 gray|0.013688 dark|0.013688 grey|0.013688 gray|0.01185 grey|0.01185 powder|0.0090265 blue|0.0090265 pale|0.0089279 turquoise|0.0089279 silver|0.0072592 light|0.006153 gray|0.006153 light|0.006153 grey|0.006153 dark|0.0059778 blue|0.0059778 gainsboro|0.0051324 rosy|0.0047315 brown|0.0047315 dim|0.0044569 gray|0.0044569 dim|0.0044569 grey|0.0044569 royal|0.0042879 blue|0.0042879 lavender|0.0040657 light|0.0036331 steel|0.0036331 blue|0.0036331  "
		}
	}
}
