{
	"add": {
		"doc": {
			"id": "6e66ca485baf794123e1f15ba9ebc92270ac7c1af5f0ef1d8be36188c65bbf85",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Prediction_of_sound_scattering_from_Schroeder_Diffuser.jpg/220px-Prediction_of_sound_scattering_from_Schroeder_Diffuser.jpg",
			"previous": [],
				"after": "Classical physics includes the traditional branches and topics that were recognised and well-developed before the beginning of the 20th century—classical mechanics, acoustics, optics, thermodynamics, and electromagnetism. Classical mechanics is concerned with bodies acted on by forces and bodies in motion and may be divided into statics (study of the forces on a body or bodies not subject to an acceleration), kinematics (study of motion without regard to its causes), and dynamics (study of motion and the forces that affect it); mechanics may also be divided into solid mechanics and fluid mechanics (known together as continuum mechanics), the latter including such branches as hydrostatics, hydrodynamics, aerodynamics, and pneumatics. Acoustics is the study of how sound is produced, controlled, transmitted and received.[34] Important modern branches of acoustics include ultrasonics, the study of sound waves of very high frequency beyond the range of human hearing; bioacoustics the physics of animal calls and hearing,[35] and electroacoustics, the manipulation of audible sound waves using electronics.[36] Optics, the study of light, is concerned not only with visible light but also with infrared and ultraviolet radiation, which exhibit all of the phenomena of visible light except visibility, e.g., reflection, refraction, interference, diffraction, dispersion, and polarization of light. Heat is a form of energy, the internal energy possessed by the particles of which a substance is composed; thermodynamics deals with the relationships between heat and other forms of energy. Electricity and magnetism have been studied as a single branch of physics since the intimate connection between them was discovered in the early 19th century; an electric current gives rise to a magnetic field, and a changing magnetic field induces an electric current. Electrostatics deals with electric charges at rest, electrodynamics with moving charges, and magnetostatics with magnetic poles at rest.",
			"color": "dodger|0.35541 blue|0.35541 deep|0.22206 sky|0.22206 blue|0.22206 blue|0.12846 aqua|0.08619 cyan|0.08619 medium|0.022177 blue|0.022177 yellow|0.021169  "
		}
	}
}
