{
	"add": {
		"doc": {
			"id": "6e69c12554d4210419d8028ef5692681c1311ab6d9e9c33a4cf4a65193bd68cd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Ricketts_Glen_Lakes_1939_labels.PNG/220px-Ricketts_Glen_Lakes_1939_labels.PNG",
				"previous": "Trexler and Turrell paid Ricketts $50,000 in both 1890 and 1891, and continued to cut his land and pay him for the timber until 1913. By 1911, the main sawmill at Ricketts could cut 125,000 board feet (290 m3) a day and was supported by three locomotives with 62 cars on 22 miles (35 km) of track. Within the park, the area around what became Lake Jean was cut in the 1890s, and Cherry Ridge (east of Red Rock Job Corps Center) and land around Lake Leigh were the last areas cut by the Ricketts mill. Timber in the east part of the park and along Bowman Creek was cut by Lewis' company, which also used logging railroads and even ran track down the Allegheny Front at Phillips Creek.[38][39] Lewis' firm built a splash dam on Bowman Creek to help float logs downstream in 1891, then used the lake to cut ice for refrigeration. A second dam and lake were added in 1909 and the icehouses were on state park land; the ice industry supported the small village and post office of Mountain Springs.[40] Ricketts ran his own ice cutting business on Ganoga Lake from 1895 to about 1915.[41]",
				"after": "Within a decade of the railroad reaching his lands, Ricketts was out of the hotel business. The North Mountain House hotel was threatened by a forest fire in 1900; the subsequent loss of much of the surrounding old-growth forest led to decreased numbers of hotel guests. Changing tastes may have also played a role in the decline in popularity; the hotel had over 150 guests in August 1878, but only about 70 guests in August 1894.[42] The wooden addition was torn down in 1897 or 1903,[b] and \"despite profits, Ricketts became disenchanted with the hotel business and closed his hotel in 1903\", though the stone house remained the Ricketts family's summer home.[43] Passenger rail service to Ganoga Lake ended when the hotel closed; the fishing club closed that year as well, but was re-formed in 1907.[17] In 1903 another large fire on North Mountain threatened the sawmill in the lumber town of Ricketts.[44]",
			"color": "dim|0.73328 gray|0.73328 dim|0.73328 grey|0.73328 gray|0.21819 grey|0.21819 black|0.029706 dark|0.014036 gray|0.014036 dark|0.014036 grey|0.014036  "
		}
	}
}
