{
	"add": {
		"doc": {
			"id": "6e776087634dc15a93224495e1dc4b9eacd136e3ef54602916de6538a23098b7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/S.Kragujevic%2C_G%C3%A9rard_Philipe_1955.JPG/239px-S.Kragujevic%2C_G%C3%A9rard_Philipe_1955.JPG",
				"previous": "As much as he welcomed steady employment in the Mexican film industry, Buñuel was quick to seize opportunities to re-emerge onto the international film scene and to engage with themes that were not necessarily focused on Mexican preoccupations.[87]:p.144 His first chance came in 1954, when Dancigers partnered with Henry F. Ehrlich, of United Artists, to co-produce a film version of Daniel Defoe's Robinson Crusoe, using a script developed by the Canadian writer Hugo Butler, another emigre from Hollywood who had run afoul of authorities seeking out communists.[108]:p.75 The result, Adventures of Robinson Crusoe, was Buñuel's first color film.[167] Buñuel was given much more time than usual for the filming (three months), which was accomplished on location in Manzanillo, a Pacific seaport with a lush jungle interior, and was shot simultaneously in English and Spanish.[168] When the film was released in the United States, its young star Dan O'Herlihy used his own money to fund a Los Angeles run for the film and gave free admission to all members of the Screen Actors Guild, who in turn rewarded the little-known actor with his only Oscar nomination.[168]",
				"after": "In the mid-1950s, Buñuel got the chance to work again in France on international co-productions. The result was what critic Raymond Durgnat has called the director's \"revolutionary triptych\", in that each of the three films is \"openly, or by implication, a study in the morality and tactics of armed revolution against a right-wing dictatorship.\"[68]:p.100 The first, Cela s'appelle l'aurore (Franco-Italian, 1956) required Buñuel and the \"pataphysical\" writer Jean Ferry to adapt a novel by Emmanuel Roblès after the celebrated writer Jean Genet failed to deliver a script after having been paid in full.[109]:p.100 The second film was La mort en ce jardin (Franco-Mexican, 1956), which was adapted by Buñuel and his frequent collaborator Luis Alcoriza from a novel by the Belgian writer José-André Lacour. The final part of the \"triptych\" was La Fièvre Monte à El Pao (Franco-Mexican, 1959), the last film of the popular French star Gérard Philipe, who died in the final stages of the production.[170] Buñuel was later to explain that he was so strapped for cash that he, \"took everything that was offered to me, as long as it wasn’t humiliating.\"[169]",
			"color": " "
		}
	}
}
