{
	"add": {
		"doc": {
			"id": "6e8acf9b59b41cde1a571cf523e098a09e4e2a0643e14c95d5b81350f287dba8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/US_Supreme_Court_photo_D_Ramey_Logan.jpg/220px-US_Supreme_Court_photo_D_Ramey_Logan.jpg",
				"previous": "In the October 2012 term, the Court decided 78 cases. Five of them were decided in unsigned opinions. 38 out of the 78 decisions (representing 49% of the decisions) were unanimous in judgement, with 24 decisions being completely unanimous (a single opinion with every justice that participated joined). This was the largest percentage of unanimous decisions that the Court had in ten years, since the October 2002 term (when 51% of the decisions handed down were unanimous). The Court split 5-4 in 23 cases (29% of the total); of these, 16 broke down along the traditionally perceived ideological lines, with Chief Justice Roberts and Justices Scalia, Thomas, and Alito on one side, Justices Ginsburg, Breyer, Sotomayor and Kagan on the other, and Justice Kennedy holding the balance. Of these 16 cases, Justice Kennedy sided with the conservatives on 10 cases, and with the liberals on 6. Three cases were decided by an interesting alignment of justices, with Chief Justice Roberts joined by Justices Kennedy, Thomas, Breyer and Alito in the majority, with Justices Scalia, Ginsburg, Sotomayor, and Kagan in the minority. The greatest agreement between justices was between Ginsburg and Kagan, who agreed on 72 of the 75 cases in which both voted; the lowest agreement between justices was between Ginsburg and Alito, who agreed only on 45 out of 77 cases in which they both participated. Justice Kennedy was in the majority of 5-4 decisions on 20 out of the 24 cases, and in 71 of the 78 cases of the term, in line with his position as the \"swing-vote\" of the Court.[109][110]",
			"after": [],
			"color": "black|0.56658 dark|0.12616 gray|0.12616 dark|0.12616 grey|0.12616 gray|0.1122 grey|0.1122 silver|0.052579 dim|0.035691 gray|0.035691 dim|0.035691 grey|0.035691 light|0.029898 gray|0.029898 light|0.029898 grey|0.029898 gainsboro|0.020373  "
		}
	}
}
