{
	"add": {
		"doc": {
			"id": "6e8f7650dbb65f2e9af6cf0c90da475c79dc7ea3309ca885decd85c46d0a8ac6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Madonnaperformingstickyandsweettour2008.jpg/170px-Madonnaperformingstickyandsweettour2008.jpg",
			"previous": [],
				"after": "\"Human Nature\" received mixed reviews from music critics. Sal Cinquemani of Slant Magazine gave the song a positive review, stating that \"for years, Madonna spoke in metaphors, fantasies and blatant shock tactics, but the performer indignantly struck back at her critics on \"Human Nature.\" She didn't just hold up a mirror, she became the mirror.\"[4] Barbara O'Dair from Rolling Stone also gave a positive review of the song, commenting that \"Madonna does a drive-by on her critics, complete with a keening synth line straight outta Dre\" adding that \"Madonna's message is still 'Express yourself, don't repress yourself.' This time, however, it comes not with a bang but a whisper.\"[5] For Moscow-Pullman Daily News, the song had the catchiest chorus from the album.[6] Jim Farber from Entertainment Weekly gave the song a negative review, noting that Madonna's \"on far surer ground thrashing through such neurotic (if not uncommon) views of relationships than she is trashing the media. In striking back at her critics, Madonna simply sounds self-righteous and smug. I didn't know I couldn't talk about sex, she sneers in Human Nature. Did I say something true? Yes. But tooting your own horn about it just sounds petty.\"[7]",
			"color": "silver|0.2436 dark|0.19833 gray|0.19833 dark|0.19833 grey|0.19833 dark|0.093242 slate|0.093242 gray|0.093242 dim|0.065193 gray|0.065193 dim|0.065193 grey|0.065193 gray|0.061869 grey|0.061869 light|0.057351 gray|0.057351 light|0.057351 grey|0.057351 peach|0.045432 puff|0.045432 burly|0.032995 wood|0.032995 dark|0.023541 salmon|0.023541 light|0.020126 steel|0.020126 blue|0.020126 tan|0.018356 gainsboro|0.015732 slate|0.014879 gray|0.014879 light|0.014356 slate|0.014356 gray|0.014356 rosy|0.010709 brown|0.010709 bisque|0.0094757 sienna|0.0070162 thistle|0.0060931 navajo|0.0060573 white|0.0060573  "
		}
	}
}
