{
	"add": {
		"doc": {
			"id": "6ea2b8bfa2d6ebc1f75f5757b271b3bc749e6d0ab7090e260705e13216744f1d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/LibroMuertosMetropolitan.jpg/220px-LibroMuertosMetropolitan.jpg",
			"previous": [],
				"after": "Like an athletic decathlon, the Academic Decathlon has ten events: art, economics, essay, interview, language and literature, math, music, science, social science, and speech.[50] Prior to 2013, the Super Quiz replaced one of the seven objective events each year; from 2003-2012, it alternated between replacing science and social science.[25] USAD releases the topics and theme of the following year's competition in early March,[51] giving students time to prepare for a competition season that runs from November to April.[52] The curriculum is developed by a ten-member panel of former USAD coaches known as the USAD Curriculum Advisory Group. The group contracts with \"curriculum developers\", who must have at least a bachelor's degree in their respective subject, to create the subject area outlines, Resource Guides, and Notebook Dividers. The Super Quiz Resource Guide was formed mostly from articles from peer reviewed journals, but also includes non-peer reviewed articles, which are looked over by a panel of five reviewers and then checked for accuracy by another reviewer.[53] Use of this format was continued for the Science packet in the 2012-2013 season.[26]",
			"color": "burly|0.24611 wood|0.24611 tan|0.15297 navajo|0.11505 white|0.11505 wheat|0.076753 moccasin|0.074718 pale|0.047663 golden|0.047663 rod|0.047663 peach|0.04333 puff|0.04333 lemon|0.030211 chiffon|0.030211 bisque|0.028619 light|0.022004 golden|0.022004 rod|0.022004 yellow|0.022004 blanched|0.020174 almond|0.020174 papaya|0.012721 whip|0.012721 corn|0.011891 silk|0.011891 peru|0.010973 light|0.010764 yellow|0.010764 sandy|0.0091229 brown|0.0091229 antique|0.0090239 white|0.0090239 beige|0.0082915 khaki|0.0067961 sienna|0.0065283 black|0.0056579 dark|0.0048042 khaki|0.0048042 saddle|0.0045028 brown|0.0045028  "
		}
	}
}
