{
	"add": {
		"doc": {
			"id": "6ea95df08347c4bbc15096e87d02310b7319ac9c62c5eccf14e8707cb666c108",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/HMS_Defence_1907.jpg/220px-HMS_Defence_1907.jpg",
				"previous": "Buoyed with their success at Tsushima, Japan laid down the four Tsukuba-class cruisers between 1905 and 1908. At a speed of 20.5 knots, they carried an extremely heavy main armament of four 12-inch (305 mm) guns, 8 inches (203 mm) of belt and turret armor and 3 inches (76 mm) of deck armor. The Tsukubas were intended to take the place of aging battleships and thus showed Japan's intention of continuing to use armored cruisers in fleet engagements. The U.S. Navy raised the main gun caliber of its cruisers with its Tennessee class, laid down between 1902 and 1904. These mounted four 10-inch (254 mm) and 16 6-inch (152 mm) guns, the former a size previously allocated to battleships. While they had thinner armor than the Pennsylvanias (5 inches (127 mm) on their belts and 1 inch (25 mm) on their decks) due to newly imposed congressional restraints on tonnage, they could still steam at 22 knots. They were built as a fast, powerful response in the eventuality of a Pacific war and were the largest and last American armored cruisers built.[34]",
				"after": "The British also considered 10-inch (254 mm) and 12-inch (305 mm) guns for its Minotaur class cruisers, the culmination of its armored cruiser building program. They displaced 14,600 tons, were capable of 23 knots and were armed with four 9.2-inch (234 mm) and 10 7.5-inch (191 mm) guns. By the time these ships were commissioned, Britain possessed the largest armored cruiser force in the world. Undaunted and fully engaged in a naval arms race with the British, the Germans also continued to build armored cruisers, partly from their faith in them as fighting units and commerce raiders, partly from Japan's success. Between 1897 and 1906 they laid down eight of them for use on overseas stations. The initial two, SMS Fürst Bismarck and SMS Prinz Heinrich, were armed with 9.44-inch (240 mm) guns; the six that followed had 8.2-inch (208 mm) guns of a more modern design. The final pair, Scharnhorst and Gneisenau, displaced 12,781 tons, steamed at 23.5 knots, carried 6 inches (152 mm) of belt and 2 inches (51 mm) of deck armor and were armed with eight 8.2-inch (208 mm) guns.[35]",
			"color": "light|0.1662 gray|0.1662 light|0.1662 grey|0.1662 gainsboro|0.15691 dim|0.1569 gray|0.1569 dim|0.1569 grey|0.1569 silver|0.10423 gray|0.078637 grey|0.078637 dark|0.076842 gray|0.076842 dark|0.076842 grey|0.076842 lavender|0.069612 lavender|0.046171 blush|0.046171 white|0.037734 smoke|0.037734 ghost|0.031971 white|0.031971 alice|0.027958 blue|0.027958 snow|0.02116 sea|0.011354 shell|0.011354 white|0.01131  "
		}
	}
}
