{
	"add": {
		"doc": {
			"id": "6eabe33c45bf8d1a7ed9b46b75b64d706febfcd45e4cc749bdd5fff150bea471",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/MLK%27s_Boyhood_home.jpg/200px-MLK%27s_Boyhood_home.jpg",
			"previous": [],
				"after": "As of 2010, Atlanta is the seventh-most visited city in the United States, with over 35 million visitors per year.[152] Although the most popular attraction among visitors to Atlanta is the Georgia Aquarium,[153] the world's largest indoor aquarium,[154] Atlanta's tourism industry mostly driven by the city's history museums and outdoor attractions. Atlanta contains a notable amount of historical museums and sites, including the Martin Luther King, Jr. National Historic Site, which includes the preserved childhood home of Dr. Martin Luther King, Jr., as well as his final resting place; the Atlanta Cyclorama & Civil War Museum, which houses a massive painting and diorama in-the-round, with a rotating central audience platform, depicting the Battle of Atlanta in the Civil War; the World of Coca-Cola, featuring the history of the world famous soft drink brand and its well-known advertising; the College Football Hall of Fame which honors college football and its athletes; the National Center for Civil and Human Rights, which explores the American Civil Rights Movement and its connection to contemporary human rights movements throughout the world; the Carter Center and Presidential Library, housing U.S. President Jimmy Carter's papers and other material relating to the Carter administration and the Carter family's life; and the Margaret Mitchell House and Museum, site of the writing of the best-selling novel Gone with the Wind.",
			"color": "black|0.304 dim|0.24447 gray|0.24447 dim|0.24447 grey|0.24447 gray|0.096624 grey|0.096624 tan|0.081918 slate|0.052922 gray|0.052922 dark|0.043651 gray|0.043651 dark|0.043651 grey|0.043651 light|0.031111 slate|0.031111 gray|0.031111 wheat|0.019189 bisque|0.016545 blanched|0.015107 almond|0.015107 antique|0.01485 white|0.01485 silver|0.013757 papaya|0.011516 whip|0.011516  "
		}
	}
}
