{
	"add": {
		"doc": {
			"id": "6eac4282526aa2f0080d3606465aa9db4a14bcb682e000ee0c7bbff015f6aab7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Louisiana_Purchase7_1903_Issue-10c-crop.jpg/220px-Louisiana_Purchase7_1903_Issue-10c-crop.jpg",
				"previous": "Napoleon came to power in 1799. Dreaming of a renewed French empire, he secured the return of the Louisiana territory from Spain via the Third Treaty of San Ildefonso the following year, and through other agreements. These pacts were initially secret, and newly inaugurated American President Thomas Jefferson learned of them in 1801. Fearing that the port of New Orleans would be closed to American shipping, he sent former Virginia senator James Monroe to France to assist American Minister Robert Livingston in purchasing the lower Mississippi; Congress appropriated $2 million for the purpose.[2]",
				"after": "When the Americans met with Napoleon, they found that the emperor desired to sell the entire territory, much of which was unmapped and unexplored by white men; Napoleon was faced with defeat in revolting Haiti and feared that the British would capture New Orleans, meaning he would lose Louisiana with no compensation. After some haggling, they agreed on a price of 60 million francs, plus 20 million more to pay claims by American citizens against France—a total of some $15 million, which paid for some 828,500 square miles (2,146,000 km2) of land. The treaty was signed on April 30, 1803, and, although there was some question as to whether there was constitutional power for such a purchase, the American Senate ratified the treaty on October 20, 1803. The United States took formal possession two months later.[2]",
			"color": "dark|0.13988 salmon|0.13988 sienna|0.13586 wheat|0.082468 moccasin|0.078365 navajo|0.075236 white|0.075236 peach|0.070469 puff|0.070469 brown|0.059065 bisque|0.055825 burly|0.042919 wood|0.042919 tan|0.03997 maroon|0.037751 blanched|0.031887 almond|0.031887 lemon|0.024777 chiffon|0.024777 pale|0.017686 golden|0.017686 rod|0.017686 saddle|0.015491 brown|0.015491 light|0.015351 salmon|0.015351 light|0.015098 golden|0.015098 rod|0.015098 yellow|0.015098 papaya|0.012751 whip|0.012751 indian|0.01238 red|0.01238 corn|0.008218 silk|0.008218 dark|0.005893 red|0.005893 light|0.005656 yellow|0.005656  "
		}
	}
}
