{
	"add": {
		"doc": {
			"id": "6ebd43c37434f530346ad0906df98852b1ee00e9a54963d36bbad4d0f7895e12",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/GroupFromNorthEastIndiaAtTaj.jpg/220px-GroupFromNorthEastIndiaAtTaj.jpg",
			"previous": [],
				"after": "Traditional Indian society is sometimes defined by social hierarchy. The Indian caste system embodies much of the social stratification and many of the social restrictions found in the Indian subcontinent. Social classes are defined by thousands of endogamous hereditary groups, often termed as jātis, or \"castes\".[293] India declared untouchability to be illegal[294] in 1947 and has since enacted other anti-discriminatory laws and social welfare initiatives. At the workplace in urban India and in international or leading Indian companies, the caste related identification has pretty much lost its importance.[295][296] Family values are important in the Indian tradition, and multi-generational patriarchal joint families have been the norm in India, though nuclear families are becoming common in urban areas.[297] An overwhelming majority of Indians, with their consent, have their marriages arranged by their parents or other family members.[298] Marriage is thought to be for life,[298] and the divorce rate is extremely low.[299] Child marriages are common, especially in rural areas; many women in India wed before reaching 18, which is their legal marriageable age.[300] Female infanticide in India and female foeticide in India have caused a discrepancy in the sex ratio, as of 2005 it was estimated that there were 50 million more males than females in the nation.[301][302] However the recent report from 2011 shown improvement among the gender ratio.[303] The payment of dowry, although illegal, remains widespread across class lines.[304] Deaths resulting from dowry, mostly from bride burning, are on the rise.[305]",
			"color": "gray|0.27325 grey|0.27325 dim|0.22443 gray|0.22443 dim|0.22443 grey|0.22443 black|0.17381 tan|0.065072 light|0.058918 slate|0.058918 gray|0.058918 dark|0.041065 gray|0.041065 dark|0.041065 grey|0.041065 slate|0.036699 gray|0.036699 wheat|0.017357 silver|0.013982 bisque|0.0078629 antique|0.0075092 white|0.0075092 light|0.0072332 gray|0.0072332 light|0.0072332 grey|0.0072332 rosy|0.0071729 brown|0.0071729 blanched|0.0065395 almond|0.0065395  "
		}
	}
}
