{
	"add": {
		"doc": {
			"id": "6eca34daacbde31c18be6511a6fc8b0ecc47762a08f2d1fd79c2c30e683e788a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Kings_Bowl_and_Great_Rift_from_air.jpg/220px-Kings_Bowl_and_Great_Rift_from_air.jpg",
				"previous": "In spite of their fresh appearance, the oldest flows in the Craters of the Moon Lava Field are 15,000 years old and the youngest erupted about 2000 years ago, according to Mel Kuntz and other USGS geologists.[9] Nevertheless the volcanic fissures at Craters of the Moon are considered to be dormant, not extinct, and are expected to erupt in less than a thousand years. There are eight major eruptive periods recognized in the Craters of the Moon Lava Field.[8] Each period lasted about 1000 years or less and were separated by relatively quiet periods that lasted between 500 to as long as 3000 years.[8] Individual lava flows were up to 30 miles (50 km) long with the Blue Dragon Flow being the longest.[29]",
				"after": "Kings Bowl Lava Field erupted during a single fissure eruption on the southern part of the Great Rift about 2,250 years ago. This eruption probably lasted only a few hours to a few days. The field preserves explosion pits, lava lakes, squeeze-ups, basalt mounds, and an ash blanket.[7] The Wapi Lava Field probably formed from a fissure eruption at the same time as the Kings Bowl eruption. More prolonged activity over a period of months to a few years led to the formation of low shield volcanos-(?) in the Wapi field. The Bear Trap lava tube, between the Craters of the Moon and the Wapi lava fields, is a cave system more than 15 miles (24 km) long.[27] The lava tube is remarkable for its length and for the number of well-preserved lava cave features, such as lava stalactites and curbs, the latter marking high stands of the flowing lava frozen on the lava tube walls. The lava tubes and pit craters of the monument are known for their unusual preservation of winter ice and snow into the hot summer months, due to shielding from the sun and the insulating properties of basalt.",
			"color": "tan|0.45027 black|0.21462 dim|0.060981 gray|0.060981 dim|0.060981 grey|0.060981 burly|0.053842 wood|0.053842 wheat|0.053146 gray|0.047934 grey|0.047934 bisque|0.020068 moccasin|0.018 navajo|0.01694 white|0.01694 peach|0.015369 puff|0.015369  "
		}
	}
}
