{
	"add": {
		"doc": {
			"id": "6ee57a2f14471d37c474c03b4937bfa2247123af85f0fb8893645f26e4c9f4e5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Brooklyn_Museum_-_Mother_and_Child_Before_a_Pool_-_Mary_Cassatt.jpg/220px-Brooklyn_Museum_-_Mother_and_Child_Before_a_Pool_-_Mary_Cassatt.jpg",
				"previous": "The 1890s were Cassatt's busiest and most creative time. She had matured considerably and became more diplomatic and less blunt in her opinions. She also became a role model for young American artists who sought her advice. Among them was Lucy A. Bacon, whom Cassatt introduced to Camille Pissarro. Though the Impressionist group disbanded, Cassatt still had contact with some of the members, including Renoir, Monet, and Pissarro.[59]",
				"after": "In 1891, she exhibited a series of highly original colored drypoint and aquatint prints, including Woman Bathing and The Coiffure, inspired by the Japanese masters shown in Paris the year before. (See Japonism) Cassatt was attracted to the simplicity and clarity of Japanese design, and the skillful use of blocks of color. In her interpretation, she used primarily light, delicate pastel colors and avoided black (a \"forbidden\" color among the Impressionists). Adelyn D. Breeskin, Cassatt's most noted historian and the author of two catalogue raisonnés of her work, notes that these colored prints, \"now stand as her most original contribution... adding a new chapter to the history of graphic arts...technically, as color prints, they have never been surpassed\".[60]",
			"color": "antique|0.17441 white|0.17441 wheat|0.1021 light|0.071411 gray|0.071411 light|0.071411 grey|0.071411 blanched|0.069552 almond|0.069552 gainsboro|0.067085 linen|0.066387 papaya|0.059203 whip|0.059203 tan|0.053214 old|0.048271 lace|0.048271 bisque|0.040998 beige|0.036773 sea|0.033377 shell|0.033377 white|0.025257 smoke|0.025257 floral|0.024886 white|0.024886 silver|0.022228 snow|0.013407 dark|0.011685 gray|0.011685 dark|0.011685 grey|0.011685 misty|0.011546 rose|0.011546 corn|0.0097157 silk|0.0097157 dim|0.0096567 gray|0.0096567 dim|0.0096567 grey|0.0096567 mint|0.0084788 cream|0.0084788 lavender|0.0081705 blush|0.0081705 peach|0.0060355 puff|0.0060355 ivory|0.0056939 gray|0.0056669 grey|0.0056669  "
		}
	}
}
