{
	"add": {
		"doc": {
			"id": "6eeaf25e0c705f188461317933037db3178231f01e1e5180c65eef47c5d9f0f2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Russian_economy_since_fall_of_Soviet_Union.PNG/220px-Russian_economy_since_fall_of_Soviet_Union.PNG",
				"previous": "Russia has a developed, high-income market economy with enormous natural resources, particularly oil and natural gas. It has the 15th largest economy in the world by nominal GDP and the 6th largest by purchasing power parity (PPP). Since the turn of the 21st century, higher domestic consumption and greater political stability have bolstered economic growth in Russia. The country ended 2008 with its ninth straight year of growth, but growth has slowed with the decline in the price of oil and gas. Real GDP per capita, PPP (current international) was 19,840 in 2010.[159] Growth was primarily driven by non-traded services and goods for the domestic market, as opposed to oil or mineral extraction and exports.[93] The average nominal salary in Russia was $967 per month in early 2013, up from $80 in 2000.[160][161] In March 2014 the average nominal monthly wages reached 30,000 RUR (or US$980),[162][163] while tax on the income of individuals is payable at the rate of 13% on most incomes.[164] Approximately 12.8% of Russians lived below the national poverty line in 2011,[165] significantly down from 40% in 1998 at the worst point of the post-Soviet collapse.[89] Unemployment in Russia was at 5.4% in 2014, down from about 12.4% in 1999.[166] The middle class has grown from just 8 million persons in 2000 to 104 million persons in 2013.[167][168] Sugar imports reportedly dropped 82% between 2012 and 2013 as a result of the increase in domestic output.[169]",
				"after": "Oil, natural gas, metals, and timber account for more than 80% of Russian exports abroad.[93] Since 2003, the exports of natural resources started decreasing in economic importance as the internal market strengthened considerably. Despite higher energy prices, oil and gas only contribute to 5.7% of Russia's GDP and the government predicts this will be 3.7% by 2011.[170] Oil export earnings allowed Russia to increase its foreign reserves from $12 billion in 1999 to $597.3 billion on 1 August 2008, the third largest foreign exchange reserves in the world.[171] The macroeconomic policy under Finance Minister Alexei Kudrin was prudent and sound, with excess income being stored in the Stabilization Fund of Russia.[172] In 2006, Russia repaid most of its formerly massive debts,[173] leaving it with one of the lowest foreign debts among major economies.[174] The Stabilization Fund helped Russia to come out of the global financial crisis in a much better state than many experts had expected.[172]",
			"color": "powder|0.17822 blue|0.17822 light|0.17217 cyan|0.17217 azure|0.13455 antique|0.099709 white|0.099709 light|0.05992 gray|0.05992 light|0.05992 grey|0.05992 linen|0.041251 papaya|0.039326 whip|0.039326 blanched|0.033813 almond|0.033813 old|0.032931 lace|0.032931 beige|0.029979 corn|0.02638 silk|0.02638 bisque|0.025564 silver|0.023956 gainsboro|0.021472 sea|0.021426 shell|0.021426 floral|0.018875 white|0.018875 light|0.008576 coral|0.008576 salmon|0.00344 white|0.0031625 smoke|0.0031625 indian|0.0030928 red|0.0030928 dark|0.0028773 gray|0.0028773 dark|0.0028773 grey|0.0028773  "
		}
	}
}
