{
	"add": {
		"doc": {
			"id": "6ef89d4339e56f12ffe2c4f0ac63aeb4fd237fe14ba22da5da13460604b08f0a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Berenty_001.jpg/220px-Berenty_001.jpg",
				"previous": "Lemurs have been the focus of monographic series, action plans, field guides, and classic works in ethology.[62] However, few species have been thoroughly studied to date, and most research has been preliminary and restricted to a single locality.[2] Only recently have numerous scientific papers been published to explain the basic aspects of behavior and ecology of poorly known species. Field studies have given insights on population dynamics and evolutionary ecology of most genera and many species.[62] Long-term research focused on identified individuals is in its infancy and has only been started for a few populations. However, learning opportunities are dwindling as habitat destruction and other factors threaten the existence of lemur populations across the island.[2]",
				"after": "Lemurs are mentioned in sailors' voyage logs as far back as 1608 and in 1658 that at least seven lemur species were described in detail by the French merchant, Étienne de Flacourt, who may also have been the only westerner to see and chronicle the existence of a giant (now extinct) lemur, which he called the tretretretre. Around 1703 merchants and sailors began bringing lemurs back to Europe, at which time James Petiver, an apothecary in London, described and illustrated the mongoose lemur. Starting in 1751, the London illustrator George Edwards began describing and illustrating some lemur species, of which a few were included in various editions of Systema Naturae by Carl Linnaeus. In the 1760s and 1770s, French naturalists Georges-Louis Leclerc, Comte de Buffon and Louis-Jean-Marie Daubenton began describing the anatomy of several lemur species. The first traveling naturalist to comment on lemurs was Philibert Commerçon in 1771, although it was Pierre Sonnerat who recorded a greater variety of lemur species during his travels.[133][135]",
			"color": "black|0.25598 burly|0.17307 wood|0.17307 tan|0.10987 navajo|0.081026 white|0.081026 rosy|0.046864 brown|0.046864 sandy|0.031227 brown|0.031227 khaki|0.019987  "
		}
	}
}
