{
	"add": {
		"doc": {
			"id": "6efd51fa5f3bada769825af44152d8a8790e8d0e6251815b57c23f472c6d57a1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/IDS_reflecting_Wells_Fargo.jpg/170px-IDS_reflecting_Wells_Fargo.jpg",
			"previous": [],
				"after": "Minnesota's earliest industries were fur trading and agriculture; the city of Minneapolis grew around the flour mills powered by St. Anthony Falls. Although less than one percent of the population is employed in the agricultural sector,[75] it remains a major part of the state's economy, ranking sixth in the nation in the value of products sold.[76] The state is the U.S.'s largest producer of sugar beets, sweet corn, and green peas for processing, and farm-raised turkeys. Minnesota is also a large producer of corn and soybeans.[77] Minnesota has the most food cooperatives per capita in America.[78] Forestry remains strong, including logging, pulpwood processing and paper production, and forest products manufacturing. Minnesota was famous for its soft-ore mines, which produced a significant portion of the world's iron ore for over a century. Although the high-grade ore is now depleted, taconite mining continues, using processes developed locally to save the industry. In 2004, the state produced 75 percent of the country's usable iron ore.[77] The mining boom created the port of Duluth which continues to be important for shipping ore, coal, and agricultural products. The manufacturing sector now includes technology and biomedical firms in addition to the older food processors and heavy industry. The nation's first indoor shopping mall was Edina's Southdale Center and its largest is Bloomington's Mall of America.",
			"color": "black|0.50788 light|0.13615 slate|0.13615 gray|0.13615 slate|0.10983 gray|0.10983 steel|0.10382 blue|0.10382 dim|0.086727 gray|0.086727 dim|0.086727 grey|0.086727 gray|0.024543 grey|0.024543 light|0.013757 steel|0.013757 blue|0.013757 dark|0.0098572 slate|0.0098572 gray|0.0098572  "
		}
	}
}
