{
	"add": {
		"doc": {
			"id": "6f064b62f2830e2c5074822492c33f9fd7f27db523afb1cb6882be812c355c5d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/TabulaRogeriana_upside-down.jpg/350px-TabulaRogeriana_upside-down.jpg",
				"previous": "In the early 10th century, Abū Zayd al-Balkhī, a Persian originally from Balkh, founded the \"Balkhī school\" of terrestrial mapping in Baghdad. The geographers of this school also wrote extensively of the peoples, products, and customs of areas in the Muslim world, with little interest in the non-Muslim realms.[45] Suhrāb, a late 10th-century Persian geographer, accompanied a book of geographical coordinates with instructions for making a rectangular world map, with equirectangular projection or cylindrical equidistant projection.[45] In the early 11th century, Avicenna hypothesized on the geological causes of mountains in The Book of Healing (1027).",
				"after": "In mathematical geography, Persian Abū Rayhān al-Bīrūnī, around 1025, was the first to describe a polar equi-azimuthal equidistant projection of the celestial sphere.[46] He was also regarded as the most skilled when it came to mapping cities and measuring the distances between them, which he did for many cities in the Middle East and western Indian subcontinent. He combined astronomical readings and mathematical equations to record degrees of latitude and longitude and to measure the heights of mountains and depths of valleys, recorded in The Chronology of the Ancient Nations. He discussed human geography and the planetary habitability of the Earth, suggesting that roughly a quarter of the Earth's surface is habitable by humans. He solved a complex geodesic equation in order to accurately compute the Earth's circumference.[47] His estimate of 6,339.9 km for the Earth radius was only 16.8 km less than the modern value of 6,356.7 km.",
			"color": "tan|0.4362 burly|0.1055 wood|0.1055 dark|0.062924 khaki|0.062924 dim|0.047938 gray|0.047938 dim|0.047938 grey|0.047938 rosy|0.026709 brown|0.026709 gray|0.026387 grey|0.026387 slate|0.025337 gray|0.025337 wheat|0.023503 dark|0.019624 slate|0.019624 blue|0.019624 pale|0.015257 golden|0.015257 rod|0.015257 sienna|0.014317 saddle|0.013656 brown|0.013656 light|0.012851 slate|0.012851 gray|0.012851 dark|0.01213 olive|0.01213 green|0.01213 dark|0.012013 slate|0.012013 gray|0.012013 dark|0.011806 gray|0.011806 dark|0.011806 grey|0.011806 peach|0.011301 puff|0.011301 dark|0.010157 salmon|0.010157 dark|0.0095251 sea|0.0095251 green|0.0095251  "
		}
	}
}
