{
	"add": {
		"doc": {
			"id": "6f13d7d6a4a0b1c0a3c2eae528fea2d943d5f4df216043e0e023409895445738",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Tyto_alba_close_up.jpg/220px-Tyto_alba_close_up.jpg",
			"previous": [],
				"after": "Marsh rice rats are active during the night and for this reason are rarely seen, although they may be among the most common small mammals in part of their range. They will build nests of sedge and grass, about 13 cm (5 in) large, which are placed under debris, near shrubs, in short burrows, or high in aquatic vegetation. They may also use old nests of marsh wrens (Cistothorus palustris), red-winged blackbirds (Agelaius phoeniceus), muskrats (Ondatra zibethicus) or round-tailed muskrats (Neofiber alleni). Marsh rice rats sometimes make large runways or dig burrows.[146] They are accomplished and willing swimmers, easily swimming for more than 10 m (30 ft) under water,[147] and will often seek safety in the water when alarmed.[148] Rice rats in the Florida Keys occasionally climb in vegetation, but never higher than 90 cm (3 ft).[149] Marsh rice rats are very clean and extensively groom themselves, perhaps to keep their fur water-repellent.[150] They are aggressive towards conspecifics and emit high-pitched squeaks while fighting.[74] In dense vegetation, the perceptual range (the distance from which an animal can detect a patch of suitable habitat) of marsh rice rats is less than 10 m (33 ft).[151] When released outside of their natural wetland habitat, marsh rice rats generally move either upwind or downwind (anemotaxis), perhaps in order to move in a straight line, which is an efficient strategy to find suitable habitat.[152]",
			"color": "dark|0.24059 gray|0.24059 dark|0.24059 grey|0.24059 silver|0.17412 light|0.12549 gray|0.12549 light|0.12549 grey|0.12549 gainsboro|0.099831 gray|0.072771 grey|0.072771 lavender|0.06335 dim|0.053539 gray|0.053539 dim|0.053539 grey|0.053539 alice|0.026588 blue|0.026588 ghost|0.023193 white|0.023193 tan|0.020194 white|0.016818 smoke|0.016818 lavender|0.013794 blush|0.013794 snow|0.0095668 white|0.0080539 azure|0.0070268 black|0.0060782  "
		}
	}
}
