{
	"add": {
		"doc": {
			"id": "6f3d0238f1948e0419805d0ece4be385dfa17033f9c8d3a96db5a6a0ee6b4bd0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Sterna_hirundo_-hovering_to_protect_nest-8.jpg/220px-Sterna_hirundo_-hovering_to_protect_nest-8.jpg",
				"previous": "Pairs are established or confirmed through aerial courtship displays in which a male and a female fly in wide circles up to 200 m (660 ft) or more, calling all the while, before the two birds descend together in zigzag glides. If the male is carrying a fish, he may attract the attention of other males too. On the ground, the male courts the female by circling her with his tail and neck raised, head pointing down, and wings partially open. If she responds, they may both adopt a posture with the head pointed skywards. The male may tease a female with the fish, not parting with his offering until she has displayed to him sufficiently.[67] Once courtship is complete, the male makes a shallow depression in the sand, and the female scratches in the same place. Several trials may take place until the pair settle on a site for the actual nest.[67] The eggs may be laid on bare sand, gravel or soil, but a lining of debris or vegetation is often added if available,[43] or the nest may be rimmed with seaweed, stones or shells. The saucer-shaped scrape is typically 4 cm (1.6 in) deep and 10 cm (3.9 in) across, but may extend to as much as 24 cm (9.4 in) wide including the surrounding decorative material.[68] Breeding success in areas prone to flooding has been enhanced by the provision of artificial mats made from eelgrass, which encourage the terns to nest in higher, less vulnerable areas, since many prefer the mats to bare sand.[69] The common tern tends to use more nest material than roseate or Arctic terns, although roseate often nests in areas with more growing vegetation.[70][71]",
			"after": [],
			"color": "light|0.71402 steel|0.71402 blue|0.71402 dim|0.055846 gray|0.055846 dim|0.055846 grey|0.055846 gray|0.03785 grey|0.03785 light|0.037064 slate|0.037064 gray|0.037064 dark|0.036742 gray|0.036742 dark|0.036742 grey|0.036742 dark|0.035849 slate|0.035849 gray|0.035849 slate|0.033112 gray|0.033112 silver|0.014973 light|0.013383 blue|0.013383  "
		}
	}
}
