{
	"add": {
		"doc": {
			"id": "6f4c28de4dea0fb5b12302dbcce54542aeeffb53923aab794f6ab60cdbb0e96d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Magazine_cutout_ladies_plume_hats.jpg/170px-Magazine_cutout_ladies_plume_hats.jpg",
				"previous": "With the increasing population in towns near the Everglades came hunting opportunities. Even decades earlier, Harriet Beecher Stowe had been horrified at the hunting by visitors, and she wrote the first conservation publication for Florida in 1877: \"[t]he decks of boats are crowded with men, whose only feeling amid our magnificent forests, seems to be a wild desire to shoot something and who fire at every living thing on shore.\"[41] Otters and raccoons were the most widely hunted for their skins. Otter pelts could fetch between $8 and $15 each. Raccoons, more plentiful, only warranted 75 cents each in 1915. Hunting often went unchecked; on one trip, a Lake Okeechobee hunter killed 250 alligators and 172 otters.[42]",
				"after": "Wading birds were a particular target. Their feathers were used in women's hats from the late 19th century until the 1920s. In 1886, five million birds were estimated to have been killed for their feathers.[43] They were usually shot in the spring, when their feathers were colored for mating and nesting. Aigrettes, as the plumes were called in the millinery business, sold in 1915 for $32 an ounce, also the price of gold.[42] Millinery was a $17-million-a-year industry[44] that motivated plume harvesters to lie in wait at the nests of egrets and other large birds during the nesting season, shoot the parents with small-bore rifles, and leave the chicks to starve.[42] Many hunters refused to participate after watching the gruesome results of a plume hunt.[42][45] Still, plumes from Everglades wading birds could be found in Havana, New York City, London, and Paris. A dealer in New York paid at least 60 hunters to provide him with \"almost anything that wore feathers, but particularly the Herons, Spoonbills, and showy birds\". Hunters could collect plumes from a hundred birds on a good day.[46]",
			"color": "rosy|0.44895 brown|0.44895 tan|0.22892 indian|0.10004 red|0.10004 dim|0.083026 gray|0.083026 dim|0.083026 grey|0.083026 gray|0.069496 grey|0.069496  "
		}
	}
}
