{
	"add": {
		"doc": {
			"id": "6f6b73678cea8143c8d2a702e6502bde7fcbffff389588896e3f51a1894ae063",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Lucius_Fairchild_Crop.jpg/170px-Lucius_Fairchild_Crop.jpg",
			"previous": [],
				"after": "Kent has produced and been home to a number of notable individuals in varying fields. Its natives and residents are referred to as \"Kentites\".[214] John Davey, a pioneer in tree surgery and founder of the Davey Tree Expert Company moved to Kent in the 1880s. His son, Martin L. Davey, would later serve as Governor of Ohio and a U.S. Representative. Other political figures to come from Kent include Wisconsin governor Lucius Fairchild, former U.S. Representative Robert E. Cook, and noted abolitionist John Brown, who lived in what was then Franklin Mills from 1835–1839.[215][216] Noted athletes to have come from Kent include former National Football League players Mike Adamle, Tom DeLeone, and Stan White and former Major League Baseball player, manager, and executive Gene Michael.[217][218] Three members of the band Devo, which debuted in Kent in 1973 and was founded by Kent State University students, are natives of Kent: Gerald Casale, Peter Gregg, and Rod Reisman.[219] Other performing artists to come from Kent include singer Julianne Baird, playwright Vincent J. Cardinal, and voice actor Joshua Seth.[217][220] Lucien Price, an author and writer for The Boston Evening Transcript and The Atlantic Monthly grew up in Kent and used the pseudonym \"Woolwick\" for Kent in some of his stories.[221] Kent was also the home of inventor Lucien B. Smith, regarded as the inventor of barbed wire.[222][223] Additionally, people who have lived in Kent while attending Kent State University include comedians Drew Carey and Arsenio Hall, actor Michael Keaton, musician Joe Walsh, and additional members of the band Devo.[224] Athletes include football players Antonio Gates, Joshua Cribbs, and Jack Lambert; Major League Baseball players Thurman Munson, Rich Rollins, and Andy Sonnanstine; college football coaches Nick Saban and Lou Holtz; and golfer Ben Curtis, who resides in Franklin Township just north of the Kent city limits and lists Kent as his residence.[225][226][227]",
			"color": " "
		}
	}
}
