{
	"add": {
		"doc": {
			"id": "6f714d5532927494700e351b9f76826a94d2c36d64477ce4107119a3cf68d8f1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Union_Station_and_Christopher_Columbus_Memorial_Fountain.jpg/220px-Union_Station_and_Christopher_Columbus_Memorial_Fountain.jpg",
				"previous": "The Washington Metropolitan Area Transit Authority (WMATA) operates the Washington Metro, the city's rapid transit system, as well as Metrobus. Both systems serve the District and its suburbs. Metro opened on March 27, 1976 and presently consists of 91 stations and 117 miles (188 km) of track.[195] With an average of about one million trips each weekday, Metro is the second-busiest rapid transit system in the country. Metrobus serves over 400,000 riders each weekday and is the nation's sixth-largest bus system.[196] The city also operates its own DC Circulator bus system, which connects commercial areas within central Washington.[197]",
				"after": "Union Station is the city's main train station and services approximately 70,000 people each day. It is Amtrak's second-busiest station with 4.6 million passengers annually and is the southern terminus for the Northeast Corridor and Acela Express routes. Maryland's MARC and Virginia's VRE commuter trains and the Metrorail Red Line also provide service into Union Station.[198] Following renovations in 2011, Union Station became Washington's primary intercity bus transit center.[199]",
			"color": "black|0.16667 dark|0.15007 gray|0.15007 dark|0.15007 grey|0.15007 gray|0.124 grey|0.124 dim|0.11363 gray|0.11363 dim|0.11363 grey|0.11363 steel|0.1037 blue|0.1037 silver|0.10043 light|0.054236 gray|0.054236 light|0.054236 grey|0.054236 light|0.033629 slate|0.033629 gray|0.033629 gainsboro|0.032028 light|0.025103 steel|0.025103 blue|0.025103 slate|0.015842 gray|0.015842 white|0.0065508 smoke|0.0065508 linen|0.0062441 sea|0.0055191 shell|0.0055191 corn|0.0049837 flower|0.0049837 blue|0.0049837 snow|0.004545 floral|0.0043977 white|0.0043977  "
		}
	}
}
