{
	"add": {
		"doc": {
			"id": "6f7f9fdd075d578d028a16cec53785847c3472966e466db768a49c53e0b30ab1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Wang_Anshi.jpg/200px-Wang_Anshi.jpg",
				"previous": "Inspired by Fan, the later Chancellor Wang Anshi (1021–1086) implemented a series of reforms in 1069 upon his ascendance to office. Wang promulgated a community-based law enforcement and civil order known as the Baojia system. Wang Anshi attempted to diminish the importance of landholding and private wealth in favor of mutual-responsibility social groups that shared similar values and could be easily controlled by the government.[129] Just as scholar-officials owed their social prestige to their government degrees, Wang wanted to structure all of society as a mass of dependents loyal to the central government.[129] He used various means, including the prohibition of landlords offering loans to tenants; this role was assumed by the government.[129] Wang established local militias that could aid the official standing army and lessen the constrained state budget expenses for the military.[130] He set up low-cost loans for the benefit of rural farmers, whom he viewed as the backbone of the Song economy.[130] Since the land tax exacted from rural farmers filled the state treasury's coffers, Wang implemented a reform to update the land-survey system so that more accurate assessments could be gathered.[130] Wang removed the mandatory poetry requirement in the civil service exams, on the grounds that many otherwise skilled and knowledgeable Confucian students were being denied entry into the administration.[130] Wang also established government monopolies for tea, salt, and wine production.[130] All of these programs received heavy criticism from conservative ministerial peers, who believed his reforms damaged local family wealth which provided the basis for the production of examination candidates, managers, merchants, landlords, and other essential members of society.[129] Historian Paul J. Smith writes that Wang's reforms—the New Policies—represented the professional bureaucratic elite's final attempt to bring the thriving economy under state control to remedy the lack of state resources in combating powerful enemies to the north—the Liao and Western Xia.[131]",
				"after": "Winston W. Lo argues that Wang's obstinate behavior and inability to consider revision or annulment of his reforms stemmed from his conviction that he was a latter-day sage.[132] Confucian scholars of the Song believed that the 'way' (dao) embodied in the Five Classics was known by the ancient sages and was transmitted from one sage to another in an almost telepathic manner, but after it reached Mencius (c. 372–c. 289 BC) there was no one worthy of accepting the transference of the dao.[133] Some believed that the long dormant dao could be revived if one were truly a sage; Lo writes of Song Neo-Confucianists, \"it is this self-image which explained their militant stand in relation to conventional ethics and scholarship.\"[133] Wang defined his life mission as restoring the unity of dao, as he believed it had not departed from the world but had become fragmented by schools of Confucian thought, each one propagating only half-truths.[134] Lo asserts that Wang, believing that he was in possession of the dao, followed Yi Zhi and the Duke of Zhou's classic examples in resisting the wishes of selfish or foolish men by ignoring criticism and public opinion.[134] If unflinching certitude in his sagehood and faultless reforms was not enough, Wang sought potential allies and formed a coalition that became known as the New Policies Group, which in turn emboldened his known political rivals to band together in opposition to him.[135] Yet factional power struggles were not steeped in ideological discourse alone; cliques had formed naturally with shifting alliances of professional elite lineages and efforts to obtain a greater share of available offices for one's immediate and extended kinship over vying competitors.[136] People such as Su Shi also opposed Wang's faction on practical grounds; for example, Su's critical poem hinting that Wang's salt monopoly hindered effective salt distribution.[130]",
			"color": "light|0.38463 pink|0.38463 pink|0.14824 rosy|0.14375 brown|0.14375 misty|0.12351 rose|0.12351 lavender|0.036427 blush|0.036427 dim|0.026265 gray|0.026265 dim|0.026265 grey|0.026265 thistle|0.018412 gray|0.010805 grey|0.010805 sea|0.010253 shell|0.010253 linen|0.0092103  "
		}
	}
}
