{
	"add": {
		"doc": {
			"id": "6f8a16cddf88d567d3a4e19a22c055341b989d93bf67922b59e614dfabdaf0ea",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Hieroglyphs_from_the_tomb_of_Seti_I.jpg/120px-Hieroglyphs_from_the_tomb_of_Seti_I.jpg",
				"previous": "Portal:Arts/Featured article/29",
				"after": "Ancient Egyptian literature was written in the Egyptian language from Ancient Egypt's pharaonic period until the end of Roman domination. Along with Sumerian literature, it is considered the world's earliest literature. Writing in Ancient Egypt first appeared in the late 4th millennium BC. By the Old Kingdom, literary works included funerary texts, epistles and letters, religious hymns and poems, and commemorative autobiographical texts. It was not until the early Middle Kingdom that a narrative Egyptian literature was created. Middle Egyptian, the spoken language of the Middle Kingdom, became a classical language during the New Kingdom, when the vernacular language known as Late Egyptian first appeared in writing. Scribes of the New Kingdom canonized and copied many literary texts written in Middle Egyptian, which remained the language used for oral readings of sacred hieroglyphic texts. Ancient Egyptian literature has been preserved on a wide variety of media, including papyrus scrolls and packets, limestone or ceramic ostraca, wooden writing boards, monumental stone edifices and coffins. Hidden caches of literature, buried for thousands of years, have been discovered in settlements on the dry desert margins of Egyptian civilization.",
			"color": "light|0.12954 gray|0.12954 light|0.12954 grey|0.12954 gainsboro|0.10748 silver|0.099831 linen|0.067888 antique|0.065816 white|0.065816 dark|0.058749 gray|0.058749 dark|0.058749 grey|0.058749 misty|0.04816 rose|0.04816 sea|0.044582 shell|0.044582 old|0.04188 lace|0.04188 floral|0.03389 white|0.03389 gray|0.033399 grey|0.033399 white|0.032683 smoke|0.032683 dim|0.025438 gray|0.025438 dim|0.025438 grey|0.025438 snow|0.023943 lavender|0.021542 blush|0.021542 ivory|0.016727 papaya|0.015874 whip|0.015874 beige|0.015839 tan|0.015444 white|0.013743 rosy|0.012817 brown|0.012817 mint|0.010913 cream|0.010913 ghost|0.0099366 white|0.0099366 blanched|0.0072897 almond|0.0072897 corn|0.0064476 silk|0.0064476 alice|0.0057265 blue|0.0057265  "
		}
	}
}
