{
	"add": {
		"doc": {
			"id": "6f8d0946f4bb2859c36a15ec2ece6b8a88575046c54b01217de1fc1c7ed16267",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Raphael_missing.jpg/220px-Raphael_missing.jpg",
				"previous": "Many places of learning and culture—universities, schools, libraries, museums, theaters and cinemas—were either closed or designated as \"Nur für Deutsche\" (For Germans Only). Twenty-five museums and a host of other institutions were destroyed during the war.[24] According to one estimate, by war's end 43% of the infrastructure of Poland's educational and research institutions and 14% of its museums had been destroyed.[27] According to another, only 105 of pre-war Poland's 175 museums survived the war, and just 33 of these institutions were able to reopen.[28] Of pre-war Poland's 603 scientific institutions, about half were totally destroyed, and only a few survived the war relatively intact.[29]",
				"after": "Many university professors, as well as teachers, lawyers, artists, writers, priests and other members of the Polish intelligentsia were arrested and executed, or transported to concentration camps, during operations such as AB-Aktion. This particular campaign resulted in the infamous Sonderaktion Krakau[31] and the massacre of Lwów professors.[22][32] During World War II Poland lost 39% to 45% of its physicians and dentists, 26% to 57% of its lawyers, 15% to 30% of its teachers, 30% to 40% of its scientists and university professors, and 18% to 28% of its clergy.[2][33] The Jewish intelligentsia was exterminated altogether. The reasoning behind this policy was clearly articulated by a Nazi gauleiter: \"In my district, [any Pole who] shows signs of intelligence will be shot.\"[22]",
			"color": "black|0.35785 silver|0.1007 dark|0.096549 gray|0.096549 dark|0.096549 grey|0.096549 light|0.084988 gray|0.084988 light|0.084988 grey|0.084988 gainsboro|0.068194 gray|0.038886 grey|0.038886 dim|0.02846 gray|0.02846 dim|0.02846 grey|0.02846 misty|0.016052 rose|0.016052 white|0.015841 smoke|0.015841 linen|0.015359 peach|0.013774 puff|0.013774 sea|0.012053 shell|0.012053 tan|0.011988 lavender|0.011425 blush|0.011425 antique|0.011344 white|0.011344 rosy|0.010413 brown|0.010413 snow|0.0096368 ghost|0.0087255 white|0.0087255  "
		}
	}
}
