{
	"add": {
		"doc": {
			"id": "6fac596df982242ad8aab71daf6d7bc8606781452b5d4707c589afc4708a1efd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Gharial_lurking.jpg/220px-Gharial_lurking.jpg",
				"previous": "Various types of aquatic habitats are used by different crocodilians. Some species are relatively more terrestrial and prefer swamps, ponds, and the edges of lakes, where they can bask in the sun and there is plenty of plant life supporting a diverse fauna. Others spend more time in the water and inhabit the lower stretches of rivers, mangrove swamps, and estuaries. These habitats also have a rich flora and provide plenty of food. The Asian gharials find the fish on which they feed in the pools and backwaters of swift rivers. South American dwarf caimans inhabit cool, fast-flowing streams, often near waterfalls, and other caimans live in warmer, turbid lakes and slow-moving rivers. The crocodiles are mainly river dwellers, and the Chinese alligator is found in slow-moving, turbid rivers flowing across China's floodplains. The American alligator is an adaptable species and inhabits swamps, rivers, or lakes with clear or turbid water.[69] Climatic factors also affect crocodilians' distribution locally. During the dry season, caimans can be restricted to deep pools in rivers for several months; in the rainy season, much of the savannah in the Venezuelan llanos is flooded, and they disperse widely across the plain.[71] Desert crocodiles in Mauritania have adapted to their arid environment by staying in caves or burrows in a state of æstivation during the driest periods. When it rains, the reptiles gather at gueltas.[72]",
				"after": "Dry land is also important as it provides opportunities for basking, nesting, and escaping from temperature extremes. Gaping allows evaporation of moisture from the mouth lining and has a cooling effect, and several species make use of shallow burrows on land to keep cool. Wallowing in mud can also help prevent them from overheating.[73] The type of vegetation bordering the rivers and lakes inhabited by crocodilians is mostly humid tropical forest, with mangrove swamps in estuarine areas. These forests are of great importance to the crocodilians, creating suitable microhabitats where they can flourish. The roots of the trees absorb water when it rains, releasing it back slowly into the environment. When the forests are cleared to make way for agriculture, rivers tend to silt up, the water runs off rapidly, the water courses can dry up in the dry season and flooding can occur in the wet season. Destruction of forest habitat is probably a greater threat to crocodilians than is hunting.[74]",
			"color": "olive|0.57419 drab|0.57419 dark|0.25194 khaki|0.25194 dark|0.055701 olive|0.055701 green|0.055701 black|0.032752 olive|0.020247 pale|0.0077095 golden|0.0077095 rod|0.0077095 dim|0.007023 gray|0.007023 dim|0.007023 grey|0.007023  "
		}
	}
}
