{
	"add": {
		"doc": {
			"id": "6fc6325a71a0ca6b30eeb9fa88745859b12a949cf5e609dba26aad0eac584c44",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Bombardement_of_Algiers_1816.jpg/220px-Bombardement_of_Algiers_1816.jpg",
				"previous": "In the American Revolutionary War (1775–1783) the Royal Navy readily obliterated the small Continental Navy of frigates fielded by the rebel colonists, but the entry of France, Spain and the Netherlands into the war against Britain produced a combination of opposing forces which deprived the Navy of its position of superiority for the first time since the 1690s, briefly but decisively. The war saw a series of indecisive battles in the Atlantic and Caribbean, in which the Navy failed to achieve the conclusive victories needed to secure the supply lines of British forces in North America and to cut off the colonial rebels from outside support.[38] The most important operation of the war came in 1781 when, in the Battle of the Chesapeake, the British fleet failed to lift the French blockade of Lord Cornwallis's army, resulting in Cornwallis's surrender at Yorktown.[39] Although this disaster effectively concluded the fighting in North America, hostilities continued in the Indian Ocean, where the French were prevented from re-establishing a meaningful foothold in India, and in the Caribbean. British Caribbean victories in the Battle of the Saintes in 1782 and in the relief of Gibraltar later the same year symbolised the restoration of British naval ascendancy, but this came too late to prevent the independence of the Thirteen Colonies.[40]",
				"after": "Disease, particularly scurvy, caused catastrophic losses in the Royal Navy.[41] The eradication of scurvy from the Royal Navy in the 1790s came about due to the efforts of Gilbert Blane, chairman of the Navy's Sick and Hurt Board, which ordered fresh lemon juice to be given to sailors on ships. Other navies soon adopted this successful solution.[42]",
			"color": "tan|0.17919 dim|0.11544 gray|0.11544 dim|0.11544 grey|0.11544 gray|0.079783 grey|0.079783 black|0.070751 burly|0.063829 wood|0.063829 rosy|0.062043 brown|0.062043 sienna|0.039885 peach|0.036656 puff|0.036656 dark|0.033872 gray|0.033872 dark|0.033872 grey|0.033872 dark|0.028767 salmon|0.028767 slate|0.027251 gray|0.027251  "
		}
	}
}
