{
	"add": {
		"doc": {
			"id": "6fc7b42f203523f21243c5f2596bb404d85c227f47f3e1b11a407c98d056e89d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Greene_Street_School.png/220px-Greene_Street_School.png",
				"previous": "Fuller was an avid reader. By the time she was in her 30s, she had earned a reputation as the best-read person, male or female, in New England.[19] She used her knowledge to give private lessons based on the teaching style of Elizabeth Palmer Peabody.[20] Fuller hoped to earn her living through journalism and translation; her first published work, a response to historian George Bancroft, appeared in November 1834 in the North American Review.[21] When she was 23, her father's law practice failed and he moved the family to a farm in Groton.[22] On February 20, 1835, Frederic Henry Hedge and James Freeman Clarke asked her to contribute to each of their periodicals. Clarke helped her publish her first literary review in the Western Messenger in June: criticisms of recent biographies on George Crabbe and Hannah More.[23] In the fall of that year, she suffered a terrible migraine with a fever that lasted nine days. Fuller continued to experience such headaches throughout her life.[24] While she was still recovering, her father died of cholera on October 2, 1835.[25] She was deeply affected by his death: \"My father's image follows me constantly\", she wrote.[26] She vowed to step in as the head of the family and take care of her widowed mother and younger siblings.[27] Her father had not left a will, and two of her uncles gained control of his property and finances, later assessed at $18,098.15, and the family had to rely on them for support. Humiliated by the way her uncles were treating the family, Fuller wrote that she regretted being \"of the softer sex, and never more than now\".[28]",
				"after": "Around this time, Fuller was hoping to prepare a biography of Johann Wolfgang von Goethe, but felt that she could work on it only if she traveled to Europe. Her father's death and her sudden responsibility for her family caused her to abandon this idea.[21] In 1836, Fuller was given a job teaching at Bronson Alcott's Temple School in Boston,[29] where she remained for a year. She then accepted an invitation to teach under Hiram Fuller (no relation) at the Greene Street School in Providence, Rhode Island, in April 1837 with the unusually high salary of $1,000 per year.[30] Her family sold the Groton farm and Fuller moved with them to Jamaica Plain, Massachusetts.[31] On November 6, 1839, Fuller held the first of her \"conversations\",[32] discussions among local women who met in the Boston home of the Peabodys.[33] Fuller intended to compensate for the lack of women's education[34] with discussions and debates focused on subjects including the fine arts, history, mythology, literature, and nature.[35] Serving as the \"nucleus of conversation\", Fuller also intended to answer the \"great questions\" facing women: \"What were we born to do? How shall we do it? which so few ever propose to themselves 'till their best years are gone by\".[36] A number of significant figures in the women's rights movement attended these gatherings, including Sophia Dana Ripley, Caroline Sturgis,[37] and Maria White Lowell.[32]",
			"color": "dim|0.43941 gray|0.43941 dim|0.43941 grey|0.43941 gray|0.2761 grey|0.2761 black|0.11779 dark|0.1072 gray|0.1072 dark|0.1072 grey|0.1072 silver|0.042004 light|0.012077 gray|0.012077 light|0.012077 grey|0.012077 gainsboro|0.0054199  "
		}
	}
}
