{
	"add": {
		"doc": {
			"id": "6fdd73b77b074d655cbd1d10aa7aa036c12244c24a6542f75b3b41b4d6b01be6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Tornado_variable_sweep_wing_Manching.JPG/220px-Tornado_variable_sweep_wing_Manching.JPG",
			"previous": [],
				"after": "In the aftermath of the cancellation of the TSR-2, the British had started a project with the French for the Anglo-French Variable Geometry aircraft (AFVG). When French commitment was curtailed the British sought a second partner in the F-104 Consortium of European nations. This in turn led to the European consortium that adopted variable geometry for the Multi-Role Combat Aircraft (MRCA) project that emerged as the Panavia Tornado.[4] This was an interdictor and stand-off interceptor similar in function to the F-111, albeit on a smaller scale. After AFVG, Dassault Aviation built a prototype fighter in 1968, Dassault Mirage G , two variants Mirage G4 and G8,[5] and in cooperation with Ling-Temco-Vought, the LVT V-507 for VFX project.[6] Meanwhile, the U.S. Navy introduced the Grumman F-14 Tomcat to replace the canceled F-111B fleet interceptor with a fighter more nimble than the F-4 Phantom. Unlike the F-111, its variable-sweep wings were programmed automatically by speed and could be swept under G loading. In air combat, the wings could be swept forward for tight \"bat\" turns and back for dash speeds.[7][8] Rockwell, meanwhile, adopted variable geometry for the Advanced Manned Strategic Bomber (AMSA) program that produced the B-1 Lancer bomber, intended to provide an optimum combination of high-speed cruising efficiency and fast, supersonic penetration speeds at extremely low level. The last variable-sweep wing military aircraft to date was the Soviet Tupolev Tu-160 \"Blackjack\", which first flew in 1980.",
			"color": "dark|0.33727 gray|0.33727 dark|0.33727 grey|0.33727 gray|0.23896 grey|0.23896 dim|0.19453 gray|0.19453 dim|0.19453 grey|0.19453 silver|0.12014 light|0.029176 gray|0.029176 light|0.029176 grey|0.029176 black|0.016663 slate|0.013121 gray|0.013121 gainsboro|0.009177 light|0.0081233 slate|0.0081233 gray|0.0081233  "
		}
	}
}
