{
	"add": {
		"doc": {
			"id": "6fdd38b7c0b33a173480442df67ce224b433c559ad3208a4164af65ad999a8fd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Everglades_Hammock_Center.JPG/220px-Everglades_Hammock_Center.JPG",
				"previous": "Alligators have created a niche in wet prairies. With their claws and snouts they dig at low spots and create ponds free of vegetation that remain submerged throughout the dry season. Alligator holes are integral to the survival of aquatic invertebrates, turtles, fish, small mammals, and birds during extended drought periods. The alligators then feed upon some of the animals that come to the hole.[50][51]",
				"after": "Small islands of trees growing on land raised between 1 foot (0.30 m) and 3 feet (0.91 m) above sloughs and prairies are called tropical hardwood hammocks.[52] They may range from one (4,000 m²) to ten acres (40,000 m²) in area, and appear in freshwater sloughs, sawgrass prairies, or pineland. Hammocks are slightly elevated on limestone plateaus risen several inches above the surrounding peat, or they may grow on land that has been unharmed by deep peat fires. Hardwood hammocks exhibit a mixture of subtropical and hardwood trees, such as Southern live oak (Quercus virginiana), gumbo limbo (Bursera simaruba), royal palm (Roystonea), and bustic (Dipholis salicifolia) that grow in very dense clumps.[53] Near the base, sharp saw palmettos (Serenoa repens) flourish, making the hammocks very difficult for people to penetrate, though small mammals, reptiles and amphibians find these islands an ideal habitat. Water in sloughs flows around the islands, creating moats. Though some ecosystems are maintained and promoted by fire, hammocks may take decades or centuries to recover. The moats around the hammocks protect the trees.[54] The trees are limited in height by weather factors such as frost, lightning, and wind; the majority of trees in hammocks grow no higher than 55 feet (17 m).",
			"color": "black|0.80961 dim|0.019724 gray|0.019724 dim|0.019724 grey|0.019724 dark|0.017623 gray|0.017623 dark|0.017623 grey|0.017623 gray|0.017374 grey|0.017374 dark|0.015391 olive|0.015391 green|0.015391 silver|0.012482 dark|0.010809 khaki|0.010809 light|0.0093789 gray|0.0093789 light|0.0093789 grey|0.0093789 gainsboro|0.0073511 pale|0.0057675 golden|0.0057675 rod|0.0057675 white|0.0046575 smoke|0.0046575 lavender|0.0042115  "
		}
	}
}
