{
	"add": {
		"doc": {
			"id": "6fe67eb4ee39ff8acb02aa645da5f8175dde73b237cbf1186d71ccfafe6e7308",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Birkenhead_by_Spy0002.jpg/170px-Birkenhead_by_Spy0002.jpg",
				"previous": "At one point in the proceedings, Smith attempted to press a point he was making, by quoting from a signal sent to British ships. Lord Mersey queried which message this was, and it transpired that the message in question existed in the version of evidence given to Smith by the Board of Trade Solicitor, Sir Ellis Cunliffe, but not in versions given to others. Cunliffe explained the discrepancy by saying that different versions of the papers had been prepared for use, depending whether the enquiry had been in camera or not, but the message quoted appeared never to have existed. Lord Mersey observed that it was his job to get at the truth, and thereafter became more critical of Admiralty evidence.[43]",
				"after": "On 10 June, just before the hearing, significant changes were made to the Defence of the Realm Act, which made it an offence to collect or publish information about the nature, use, or carriage of \"war materials\" for any reason. Previously, this had only been an offence if the information was collected to aid the enemy. This was used to prohibit discussion about the ship's cargo.[1] The rifle cartridges carried by the Lusitania were mentioned during the case, Lord Mersey stating that \"the 5,000 cases of ammunition on board were 50 yards away from where the torpedo struck the ship\".[44]",
			"color": "bisque|0.11886 dim|0.10468 gray|0.10468 dim|0.10468 grey|0.10468 wheat|0.098084 blanched|0.086758 almond|0.086758 papaya|0.071881 whip|0.071881 antique|0.066356 white|0.066356 corn|0.058987 silk|0.058987 beige|0.056023 light|0.051849 golden|0.051849 rod|0.051849 yellow|0.051849 lemon|0.048252 chiffon|0.048252 light|0.045455 yellow|0.045455 peach|0.037987 puff|0.037987 tan|0.027366 moccasin|0.019086 rosy|0.018642 brown|0.018642 dark|0.015774 gray|0.015774 dark|0.015774 grey|0.015774 gray|0.015057 grey|0.015057 dark|0.010516 salmon|0.010516  "
		}
	}
}
