{
	"add": {
		"doc": {
			"id": "6fecd474e156378ab4b75bf8fc3bc3b205563d01fcab35bcbd5854499cc85a69",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Fish_drying_in_the_sun_poisson_seche_Madagascar.jpg/220px-Fish_drying_in_the_sun_poisson_seche_Madagascar.jpg",
				"previous": "Foods were commonly prepared by boiling in water (at first using green bamboo as a vessel, and later clay or iron pots),[14] roasting over a fire or grilling over hot stones or coals.[6] Fermentation was also used to create curds from milk, develop the flavor of certain dried or fresh tubers or produce alcoholic beverages from honey, sugar cane juice or other local plants.[5] The techniques of sun curing (drying), smoking and salting were used to preserve various foods for transport, trade or future consumption. Many foods prepared in these ways, such as a smoked dried beef called kitoza ([kiˈtuzə̥]) and salted dried fish, are still eaten in a similar form in modern-day Madagascar.[15]",
				"after": "By the 16th century, centralized kingdoms had emerged on the west coast among the Sakalava and in the Central highlands among the Merina. The Merina sovereigns celebrated the new year with an ancient Merina ceremony called the Royal Bath (fandroana). For this ceremony, a beef confit called jaka ([ˈdzakə̥]) was prepared by placing beef in a decorative clay jar and sealing it with suet, then conserving it in an underground pit for a year. The jaka would be shared with friends at the following year's festival. As a dessert, revelers would eat rice boiled in milk and drizzled with honey, a preparation known as tatao ([taˈtau̯]). According to oral history, King Ralambo was the originator of these culinary traditions in Imerina.[16] Ralambo's father, King Andriamanelo, is credited with introducing the marriage tradition of the vodiondry ([vudiˈuɳɖʳʲ]) or \"rump of the sheep,\" wherein the most favored cut of meat—the hindquarters—was offered by the groom to the parents of the bride-to-be at an engagement ceremony.[17] In contemporary Malagasy society the terminology persists but families are more likely to offer symbolic coins in place of an offering of food.[18]",
			"color": "dark|0.43073 olive|0.43073 green|0.43073 black|0.23938 olive|0.078606 drab|0.078606 light|0.022246 blue|0.022246 light|0.017485 sky|0.017485 blue|0.017485 rosy|0.017248 brown|0.017248 light|0.017019 steel|0.017019 blue|0.017019 dark|0.014551 gray|0.014551 dark|0.014551 grey|0.014551 gray|0.014178 grey|0.014178 dim|0.013661 gray|0.013661 dim|0.013661 grey|0.013661 dark|0.010226 khaki|0.010226 powder|0.0094081 blue|0.0094081  "
		}
	}
}
