{
	"add": {
		"doc": {
			"id": "6ff6637503b60bfd43a3a937522e49b34398305af2038ff74fc42bedb24c42c8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/MammothVsMastodon.jpg/350px-MammothVsMastodon.jpg",
				"previous": "The second radiation was represented by the emergence of the gomphotheres in the Miocene,[36] which likely evolved from Eritreum[35] and originated in Africa, spreading to every continent except Australia and Antarctica. Members of this group included Gomphotherium and Platybelodon.[36] The third radiation started in the late Miocene and led to the arrival of the elephantids, which descended from, and slowly replaced, the gomphotheres.[37] The African Primelephas gomphotheroides gave rise to Loxodonta, Mammuthus and Elephas. Loxodonta branched off earliest, around the Miocene and Pliocene boundary, while Mammuthus and Elephas diverged later during the early Pliocene. Loxodonta remained in Africa, while Mammuthus and Elephas spread to Eurasia, and the former reached North America. At the same time, the stegodontids, another proboscidean group descended from gomphotheres, spread throughout Asia, including the Indian subcontinent, China, southeast Asia and Japan. Mammutids continued to evolve into new species, such as the American mastodon.[38]",
				"after": "At the beginning of the Pleistocene, elephantids experienced a high rate of speciation. Loxodonta atlantica became the most common species in northern and southern Africa but was replaced by Elephas iolensis later in the Pleistocene. Only when Elephas disappeared from Africa did Loxodonta become dominant once again, this time in the form of the modern species. Elephas diversified into new species in Asia, such as E. hysudricus and E. platycephus;[39] the latter the likely ancestor of the modern Asian elephant.[40] Mammuthus evolved into several species, including the well-known woolly mammoth.[39] In the Late Pleistocene, most proboscidean species vanished during the Quaternary glaciation which killed off 50% of genera weighing over 5 kg (11 lb) worldwide.[41]",
			"color": "tan|0.30484 black|0.1422 dark|0.098406 gray|0.098406 dark|0.098406 grey|0.098406 burly|0.063725 wood|0.063725 dim|0.062718 gray|0.062718 dim|0.062718 grey|0.062718 gray|0.053065 grey|0.053065 silver|0.047492  "
		}
	}
}
