{
	"add": {
		"doc": {
			"id": "703bb3223852d26c41b51dc66043addde57f92fc789440eac17563de52e567e4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/The_Chaser_pantomime_horse_stunt_%285_September_2007%2C_Sydney%29.jpg/220px-The_Chaser_pantomime_horse_stunt_%285_September_2007%2C_Sydney%29.jpg",
			"previous": [
				"In addition to The Chaser's major APEC security breach, the team performed stunts at the APEC Summit that received far less coverage in the media.",
				"Licciardello stated that they did not know they had entered the red zone, and \"we had the advice of our lawyers ring in our ears; 'Do NOT go into the red zone. You can go into the green zone if they let you, but DO NOT go into the red zone.' \"[53] He said that they \"were absolutely sure we would never get past the first checkpoint. It was panic stations when we realised\", adding that it was a \"stupid gag that backfired\".[16] Morrow said that the purpose of the stunt was \"an attempt to satirise in a silly way the very heavy security and the spin surrounding that security, it was a test of the old adage that if you want to get in somewhere the best way is right through the front door. I didn't want the stunt to happen in a way that resulted in people getting arrested. If we've made a mistake and crossed into the green zone, I'm very regretful about that.\"[16] He said the only reason they impersonated bin Laden was because they needed a joke to get out of the stunt that they always assumed would never have passed security.[54]"
			],
				"after": "On 5 September 2007, Chris Taylor, mounted on a pantomime horse, confronted police officers, who were on foot, and asked them if they needed any reinforcements against APEC protesters. When his offer was refused, Taylor took the horse for a stroll anyway, and was met by amused onlookers and media personnel.[15] He was later asked by police officers to remove his clothing for examination, since it resembled a police uniform; but no charges of impersonating police were laid.[55] The reference was to the horse flu outbreak, which forced police officers to face APEC protesters on foot.[56] This stunt aired on the 12 September 2007 episode.[15]",
			"color": " "
		}
	}
}
