{
	"add": {
		"doc": {
			"id": "706856ac0d3e1702a95f4998d75dcdbb94cf4ba93f56a1818ca565d0ccb65081",
			"url": "https://upload.wikimedia.org/wikipedia/en/c/c3/Gents-v-Players-1899.jpg",
				"previous": "His name now well known in cricketing circles, Grace played for Gentlemen of the South v Players of the South in June 1865[90] when he was still only 16 but already 6 ft 2 in (1.88 m) tall and weighing 11 st (70 kg).[91] This match is regarded by CricketArchive as his first-class debut.[92] He bowled extremely well and had match figures of 13 for 84. It was this performance that earned him his first selection for the prestigious Gentlemen v Players fixture.[22]",
				"after": "During this period, before the start of Test cricket in 1877, Gentlemen v Players was the most prestigious fixture in which a player could take part. This is apart from North v South which was technically a fixture of higher quality given that the amateur Gentlemen were usually (until Grace took a hand) outclassed by the professional Players. Grace represented the Gentlemen in their matches against the Players from 1865 to 1906. It was he who enabled the amateurs to meet the paid professionals on level terms and to defeat them more often than not. His ability to master fast bowling was the key factor.[93] Before Grace's debut in the fixture, the Gentlemen had lost 19 consecutive games; of the next 39 games they won 27 and lost only 4.[93] In consecutive innings against the Players from 1871 to 1873, Grace scored 217, 77 and 112, 117, 163, 158 and 70.[93] In his whole career, he scored a record 15 centuries in the fixture.[94]",
			"color": "dim|0.16916 gray|0.16916 dim|0.16916 grey|0.16916 gray|0.14692 grey|0.14692 dark|0.097636 gray|0.097636 dark|0.097636 grey|0.097636 light|0.07518 gray|0.07518 light|0.07518 grey|0.07518 silver|0.074774 gainsboro|0.070139 white|0.047072 smoke|0.047072 lavender|0.035611 blush|0.035611 alice|0.035511 blue|0.035511 black|0.03543 ghost|0.034957 white|0.034957 sea|0.03426 shell|0.03426 snow|0.033723 white|0.029824 linen|0.026779 mint|0.02466 cream|0.02466 floral|0.016424 white|0.016424 azure|0.011672  "
		}
	}
}
