{
	"add": {
		"doc": {
			"id": "706b275c5b4906667d3747ebfbbfc7f384f0c120c6f45f4102f5fe0113d23104",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Koala_skeleton1.jpg/150px-Koala_skeleton1.jpg",
				"previous": "The pelage of the koala is thicker and longer on the back, and shorter on the belly. The ears have thick fur on both the inside and outside.[29] The back fur colour varies from light grey to chocolate brown.[27] The belly fur is whitish; on the rump it is dappled whitish, and darker at the back.[28] The koala has the most effective insulating back fur of any marsupial and is highly resilient to wind and rain, while the belly fur can reflect solar radiation.[33] The koala's curved, sharp claws are well adapted for climbing trees. The large forepaws have two opposable digits (the first and second, which are opposable to the other three) that allow them to grasp small branches. On the hindpaws, the second and third digits are fused, a typical condition for members of Diprotodontia, and the attached claws (which are still separate) are used for grooming.[34] As in humans and other primates, koalas have friction ridges on their paws.[35] The animal has a sturdy skeleton and a short, muscular upper body with proportionately long upper limbs that contribute to its climbing and grasping abilities. Additional climbing strength is achieved with thigh muscles that attach to the shinbone lower than other animals.[36] The koala has a cartilaginous pad at the end of the spine that may make it more comfortable when it perches in the fork of a tree.[32]",
				"after": "The koala has one of the smallest brains in proportion to body weight of any mammal,[37] being 60% smaller than that of a typical diprotodont, weighing only 19.2 grams.[38] The brain's surface is fairly smooth, typical for a \"primitive\" animal.[39] It occupies only 61% of the cranial cavity[37] and is pressed against the inside surface by cerebrospinal fluid. The function of this relatively large amount of fluid is not known, although one possibility is that it acts as a shock absorber, cushioning the brain if the animal falls from a tree.[39] The koala's small brain size may be an adaptation to the energy restrictions imposed by its diet, which is insufficient to sustain a larger brain.[37] Because of its small brain, the koala has a limited ability to perform complex, unfamiliar behaviours. For example, when presented with plucked leaves on a flat surface, the animal cannot adapt to the change in its normal feeding routine and will not eat the leaves.[40] The koala's olfactory senses are normal, and it is known to sniff the oils of individual branchlets to assess their edibility.[37] Its nose is fairly large and covered in leathery skin. Its round ears provide it with good hearing[32] and it has a well-developed middle ear.[14] A koala's vision is not well developed,[32] and its relatively small eyes are unusual among marsupials in that the pupils have vertical slits.[29] Koalas make use of a novel vocal organ to produce low-pitched sounds (see social spacing, below). Unlike typical mammalian vocal cords, which are folds in the larynx, these organs are placed in the velum (soft palate) and are called velar vocal cords.[41]",
			"color": "tan|0.17263 black|0.13633 silver|0.113 dark|0.085873 gray|0.085873 dark|0.085873 grey|0.085873 light|0.076241 gray|0.076241 light|0.076241 grey|0.076241 gray|0.061447 grey|0.061447 antique|0.047327 white|0.047327 gainsboro|0.046972 dim|0.044808 gray|0.044808 dim|0.044808 grey|0.044808 linen|0.024534 burly|0.020583 wood|0.020583 misty|0.018294 rose|0.018294 wheat|0.016102 bisque|0.015531 papaya|0.014946 whip|0.014946 old|0.014502 lace|0.014502 sea|0.012767 shell|0.012767 blanched|0.012575 almond|0.012575 peach|0.0096417 puff|0.0096417 floral|0.0088349 white|0.0088349 white|0.007023 smoke|0.007023 beige|0.0058603  "
		}
	}
}
