{
	"add": {
		"doc": {
			"id": "707da1cf3791547cbe615b1658f30677da89fe393948bfdc19f1bfe0f13a4103",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Daniel_boone_bicentennial_half_dollar_commemorative_reverse.jpg/220px-Daniel_boone_bicentennial_half_dollar_commemorative_reverse.jpg",
				"previous": "According to \"The Boone Family\" book by Hazel Atterbury Spraker (1982), \"[Daniel] was buried near the body of his wife, in a cemetery established in 1803 by David Bryan, upon the bank of a small stream called Teuque Creek about one and one-half miles southeast of the present site of the town of Marthasville in Warren County, Missouri, it being at that time the only Protestant cemetery North of the Missouri River.\" {page 578}",
				"after": "Daniel Boone remains an iconic figure in American history, although his status as an early American folk hero and later as a subject of fiction have tended to obscure the actual details of his life. Boone is commonly remembered as a hunter, pioneer, and \"Indian-fighter\", though most people are uncertain when he lived or exactly what he did. Several places in the United States are named for him, including the Daniel Boone National Forest, the Sheltowee Trace Trail, the town of Boone, North Carolina, various settlements carrying the name of \"Boonville\", and six counties: Boone County, Illinois; Boone County, Indiana; Boone County, Nebraska; Boone County, West Virginia; Boone County, Missouri; and Boone County, Kentucky. Schools across the United States are named for Daniel Boone, including schools in Birdsboro, Pennsylvania; Douglassville, Pennsylvania; Richmond, Kentucky; Wentzville, Missouri; Warrenton, Missouri; Gray, Tennessee; and the city of Chicago.",
			"color": "black|0.085807 dark|0.085217 gray|0.085217 dark|0.085217 grey|0.085217 gray|0.070856 grey|0.070856 silver|0.066035 dim|0.063899 gray|0.063899 dim|0.063899 grey|0.063899 antique|0.060327 white|0.060327 tan|0.045549 light|0.043685 gray|0.043685 light|0.043685 grey|0.043685 beige|0.040174 old|0.037524 lace|0.037524 linen|0.03514 papaya|0.033483 whip|0.033483 gainsboro|0.029447 corn|0.029015 silk|0.029015 ivory|0.028065 floral|0.026612 white|0.026612 blanched|0.026476 almond|0.026476 wheat|0.022857 sea|0.022226 shell|0.022226 light|0.019183 yellow|0.019183 bisque|0.016225 honeydew|0.014683 light|0.013223 golden|0.013223 rod|0.013223 yellow|0.013223 mint|0.01169 cream|0.01169 white|0.010803 smoke|0.010803 snow|0.0094904 lemon|0.009377 chiffon|0.009377 white|0.008104 misty|0.0065059 rose|0.0065059 moccasin|0.0057207 peach|0.0054145 puff|0.0054145  "
		}
	}
}
