{
	"add": {
		"doc": {
			"id": "7092737d1e3312e72d0ed642b51cc411b8d797b28912fbd33116c68d5ea9165b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/%22Jap...You%27re_Next%5E_We%27ll_Finish_the_Job%22_-_NARA_-_513563.jpg/170px-%22Jap...You%27re_Next%5E_We%27ll_Finish_the_Job%22_-_NARA_-_513563.jpg",
				"previous": "Even before the surrender of Nazi Germany on May 8, 1945, plans were underway for the largest operation of the Pacific War, Operation Downfall, the invasion of Japan.[8] The operation had two parts: Operations Olympic and Coronet. Set to begin in October 1945, Olympic involved a series of landings by the U.S. Sixth Army intended to capture the southern third of the southernmost main Japanese island, Kyūshū.[9] Operation Olympic was to be followed in March 1946 by Operation Coronet, the capture of the Kantō Plain, near Tokyo on the main Japanese island of Honshū by the U.S. First, Eighth and Tenth Armies. The target date was chosen to allow for Olympic to complete its objectives, for troops to be redeployed from Europe, and the Japanese winter to pass.[10]",
				"after": "Japan's geography made this invasion plan obvious to the Japanese; they were able to predict the Allied invasion plans accurately and thus adjust their defensive plan, Operation Ketsugō, accordingly. The Japanese planned an all-out defense of Kyūshū, with little left in reserve for any subsequent defense operations.[11] Four veteran divisions were withdrawn from the Kwantung Army in Manchuria in March 1945 to strengthen the forces in Japan,[12] and 45 new divisions were activated between February and May 1945. Most were immobile formations for coastal defense, but 16 were high quality mobile divisions.[13] In all, there were 2.3 million Japanese Army troops prepared to defend the home islands, backed by a civilian militia of 28 million men and women. Casualty predictions varied widely, but were extremely high. The Vice Chief of the Imperial Japanese Navy General Staff, Vice Admiral Takijirō Ōnishi, predicted up to 20 million Japanese deaths.[14]",
			"color": "black|0.12492 white|0.062824 smoke|0.062824 dark|0.056899 gray|0.056899 dark|0.056899 grey|0.056899 mint|0.055741 cream|0.055741 sea|0.055405 shell|0.055405 linen|0.054177 gainsboro|0.053842 snow|0.053423 floral|0.051548 white|0.051548 azure|0.051111 gray|0.049582 grey|0.049582 dim|0.046475 gray|0.046475 dim|0.046475 grey|0.046475 white|0.044711 light|0.043269 gray|0.043269 light|0.043269 grey|0.043269 silver|0.041723 old|0.028805 lace|0.028805 alice|0.025842 blue|0.025842 ghost|0.021083 white|0.021083 ivory|0.02068 honeydew|0.01929 lavender|0.0064502 blush|0.0064502 rosy|0.0044972 brown|0.0044972  "
		}
	}
}
