{
	"add": {
		"doc": {
			"id": "70b3825590e9c990a127457ccc64f2e15a1d536f6fa6572b7c3e32c6366f0e28",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Stone_Mountain_medal_image.jpg/220px-Stone_Mountain_medal_image.jpg",
			"previous": [],
				"after": "Borglum was busy between the passage of the bill and the end of May 1924, first working on the Children's Founders Roll medal, and then the half dollar. The Children's Founders Roll was open to white children up to the age of 18 who contributed one dollar to the building of the monument. Borglum must still have been fine-tuning the monument's design; Jackson's posture on the medal differs from that on the coin.[18] Unlike the issued coin, Borglum's models showed the front part of Davis's horse, although the Confederate president is unseen, and marching soldiers appear in the background.[19] Borglum met with Treasury Secretary Andrew Mellon who questioned first why \"In God We Trust\" appeared directly over Lee's head; Borglum responded that it was to pay tribute to the Confederates' faith. Mellon then asked what the thirteen stars on the obverse represented; Borglum replied that those on the north side of the Mason-Dixon Line could consider them to represent the thirteen original colonies (those south of it, the implication was, could consider them to be a tribute to the Southern states). Mellon laughed and gave preliminary approval.[20] On July 2, Mellon showed the designs to President Coolidge; they were then sent to the Commission of Fine Arts for its members' opinions.[18]",
			"color": "dark|0.23329 gray|0.23329 dark|0.23329 grey|0.23329 gray|0.17444 grey|0.17444 silver|0.16308 dim|0.11488 gray|0.11488 dim|0.11488 grey|0.11488 light|0.096936 gray|0.096936 light|0.096936 grey|0.096936 gainsboro|0.055137 antique|0.028372 white|0.028372 linen|0.019823 misty|0.019033 rose|0.019033 slate|0.010244 gray|0.010244 old|0.0099479 lace|0.0099479 sea|0.009425 shell|0.009425 tan|0.0072816 light|0.0068612 slate|0.0068612 gray|0.0068612 floral|0.0064938 white|0.0064938 papaya|0.0054464 whip|0.0054464  "
		}
	}
}
