{
	"add": {
		"doc": {
			"id": "70b501dd831f2b640d3fe944bbfe9307ac0437075de0a7c1a645e69437b6a734",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Cathay.pacific.a340-600.b-hqb.arp.jpg/220px-Cathay.pacific.a340-600.b-hqb.arp.jpg",
				"previous": "On Monday, 6 July 1998, at 00:00 HKT, Kai Tak International Airport saw its last commercial departure, Cathay Pacific Flight 251 to London Heathrow Airport, after over 73 years of operation. The next day, Cathay Pacific Flight 889 from New York John F. Kennedy International Airport piloted by Captain Paul Horsting, was the first arrival to the new Hong Kong International Airport at Chek Lap Kok, Hong Kong. Also on board were Captain Mike Lowes and First Officer Kelvin Ma.[26] This flight was also the world's first nonstop transpolar flight from New York to Hong Kong. The flight, dubbed Polar One, takes about 16 hours between Hong Kong and New York Kennedy, saving about three to four hours compared to the one stop flight via Vancouver. It is Cathay Pacific's longest nonstop flight, and one of the longest in the world at 8,055 mi (12,963 km).[27]",
			"after": [
				"The 2000s saw Cathay Pacific experience labour relations issues, while completing the acquisition of Dragonair.",
				"On 28 November 2002, the airline took delivery of its first Airbus A340-600 aircraft at a ceremony at the Airbus factory in Toulouse. Cathay Pacific was the launch customer in Asia for the A340-600 and the aircraft was the first of three leased from International Lease Finance Corporation (ILFC).[28] On 1 December 2005, Cathay Pacific ordered 16 Boeing 777-300ER aircraft, four on lease from ILFC, to be delivered between September 2007 and July 2010, plus options on 20 more of the type, two of which were converted to orders on 1 June 2006. The airline also ordered 3 more A330-300 on the same day, with the delivery of the aircraft scheduled for 2008.[29][30][31] On 7 August 2007, Cathay Pacific ordered five more wide-body Boeing 777-300ER aircraft for a total price of about US$1.4 billion, increasing its commitment to a total of 23 of the aircraft type.[32]"
			],
			"color": "light|0.58375 slate|0.58375 gray|0.58375 dark|0.23392 gray|0.23392 dark|0.23392 grey|0.23392 dim|0.033576 gray|0.033576 dim|0.033576 grey|0.033576 slate|0.029608 gray|0.029608 silver|0.024784 light|0.017143 gray|0.017143 light|0.017143 grey|0.017143 black|0.014391 gray|0.013285 grey|0.013285 gainsboro|0.012954 light|0.0050797 steel|0.0050797 blue|0.0050797 white|0.004177 smoke|0.004177 linen|0.003328 dark|0.0030338 slate|0.0030338 gray|0.0030338  "
		}
	}
}
