{
	"add": {
		"doc": {
			"id": "70cc58380113881784c39c340a7ec53a151eefe35cf654ff82ff42ed8b56756b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Hong_Kong_Convention_Centre_%285714951833%29.jpg/220px-Hong_Kong_Convention_Centre_%285714951833%29.jpg",
			"previous": [],
				"after": "In 1980, Rhodesia, Britain's last African colony, became the independent nation of Zimbabwe. The New Hebrides achieved independence (as Vanuatu) in 1980, with Belize following suit in 1981. The passage of the British Nationality Act 1981, which reclassified the remaining Crown colonies as \"British Dependent Territories\" (renamed British Overseas Territories in 2002)[209] meant that, aside from a scattering of islands and outposts (and the acquisition in 1955 of an uninhabited rock in the Atlantic Ocean, Rockall),[210] the process of decolonisation that had begun after the Second World War was largely complete. In 1982, Britain's resolve in defending its remaining overseas territories was tested when Argentina invaded the Falkland Islands, acting on a long-standing claim that dated back to the Spanish Empire.[211] Britain's ultimately successful military response to retake the islands during the ensuing Falklands War was viewed by many to have contributed to reversing the downward trend in Britain's status as a world power.[212] The same year, the Canadian government severed its last legal link with Britain by patriating the Canadian constitution from Britain. The 1982 Canada Act passed by the British parliament ended the need for British involvement in changes to the Canadian constitution.[8] Similarly, the Constitution Act 1986 reformed the constitution of New Zealand to severe its constitutional link with Britain, and the Australia Act 1986 severed the constitutional link between Britain and the Australian states.[213]",
			"color": "dark|0.4006 gray|0.4006 dark|0.4006 grey|0.4006 light|0.21562 slate|0.21562 gray|0.21562 slate|0.14432 gray|0.14432 dim|0.082319 gray|0.082319 dim|0.082319 grey|0.082319 dark|0.05969 slate|0.05969 gray|0.05969 silver|0.051242 gray|0.039304 grey|0.039304  "
		}
	}
}
