{
	"add": {
		"doc": {
			"id": "70cd1b51ec5454b5351779311cc9eb7f19846fed730602b165bf841e748635bf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/IED_detonator.jpg/220px-IED_detonator.jpg",
			"previous": [],
				"after": "Teleoperated robots, or telerobots, are devices remotely operated from a distance by a human operator rather than following a predetermined sequence of movements, but which has semi-autonomous behaviour. They are used when a human cannot be present on site to perform a job because it is dangerous, far away, or inaccessible. The robot may be in another room or another country, or may be on a very different scale to the operator. For instance, a laparoscopic surgery robot allows the surgeon to work inside a human patient on a relatively small scale compared to open surgery, significantly shortening recovery time.[99] They can also be used to avoid exposing workers to the hazardous and tight spaces such as in duct cleaning. When disabling a bomb, the operator sends a small robot to disable it. Several authors have been using a device called the Longpen to sign books remotely.[102] Teleoperated robot aircraft, like the Predator Unmanned Aerial Vehicle, are increasingly being used by the military. These pilotless drones can search terrain and fire on targets.[103][104] Hundreds of robots such as iRobot's Packbot and the Foster-Miller TALON are being used in Iraq and Afghanistan by the U.S. military to defuse roadside bombs or improvised explosive devices (IEDs) in an activity known as explosive ordnance disposal (EOD).[105]",
			"color": "tan|0.27003 wheat|0.1499 bisque|0.12131 peach|0.1182 puff|0.1182 blanched|0.063582 almond|0.063582 moccasin|0.039654 dim|0.037417 gray|0.037417 dim|0.037417 grey|0.037417 burly|0.033189 wood|0.033189 papaya|0.028454 whip|0.028454 navajo|0.026806 white|0.026806 black|0.025832 antique|0.024192 white|0.024192 corn|0.010181 silk|0.010181 lemon|0.0088066 chiffon|0.0088066 light|0.0081429 golden|0.0081429 rod|0.0081429 yellow|0.0081429  "
		}
	}
}
