{
	"add": {
		"doc": {
			"id": "70e63f48101d7c8ff0dd5a8ef14aab8a50e168d62926ed7ca510c38d2281b200",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/St_Luke%27s_church%2C_Salford.JPG/180px-St_Luke%27s_church%2C_Salford.JPG",
				"previous": "In the autumn of 1878, at the age of 20, Emmeline Goulden met and began a courtship with Richard Pankhurst, a barrister who had advocated women's suffrage – and other causes, including freedom of speech and education reform – for years. Richard, 44 years old when they met, had earlier resolved to remain a bachelor to better serve the public. Their mutual affection was powerful, but the couple's happiness was diminished by the death of his mother the following year. Sophia Jane Goulden chastised her daughter for \"throwing herself\" at Richard[28] and urged her without success to exhibit more aloofness. Emmeline suggested to Richard that they avoid the legal formalities of marriage by entering into a free union; he objected on the grounds that she would be excluded from political life as an unmarried woman. He noted that his colleague Elizabeth Wolstenholme Elmy had faced social condemnation before she formalised her marriage to Ben Elmy. Emmeline Goulden agreed, and they were wed in St Luke's Church, Pendleton on 18 December 1879.[29]",
				"after": "During the 1880s, living at the Goulden cottage with her parents in Seedley, Emmeline Pankhurst tended to her husband and children, but still devoted time to political activities. Although she gave birth to five children in ten years, both she and Richard believed that she should not be \"a household machine.\"[30] Thus a servant was hired to help with the children as Pankhurst involved herself with the Women's Suffrage Society. Their daughter Christabel was born on 22 September 1880, less than a year after the wedding. Pankhurst gave birth to another daughter, Estelle Sylvia, in 1882 and their son Francis Henry, nicknamed Frank, in 1884. Soon afterwards Richard Pankhurst left the Liberal Party. He began expressing more radical socialist views and argued a case in court against several wealthy businessmen. These actions roused Robert Goulden's ire and the mood in the house became tense. In 1885 the Pankhursts moved to Chorlton-on-Medlock, and their daughter Adela was born. They moved to London the following year, where Richard ran unsuccessfully for election as a Member of Parliament and Pankhurst opened a small fabric shop called Emerson and Company.[31]",
			"color": "dim|0.34645 gray|0.34645 dim|0.34645 grey|0.34645 black|0.29328 gray|0.24959 grey|0.24959 dark|0.058574 olive|0.058574 green|0.058574 dark|0.02223 gray|0.02223 dark|0.02223 grey|0.02223 dark|0.013787 slate|0.013787 gray|0.013787 slate|0.0087562 gray|0.0087562  "
		}
	}
}
