{
	"add": {
		"doc": {
			"id": "70f8ea2c1d1cfbc7a3a5d993d3e536e38b6841b3986b81976843450a868629a1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/20060921-3_p092106pm-259-515h.jpg/220px-20060921-3_p092106pm-259-515h.jpg",
				"previous": "For 2004, Bruce Allen was hired as general manager. After Allen's arrival, both John Lynch and Warren Sapp were released, stunning many Buccaneer fans. The distracted Buccaneers began the 2004 season with a 1–5 record, their worst start under Gruden. The fading accuracy of kicker Martin Gramatica did not help matters, as the team lost many close games en route to a 5–11 record.",
				"after": "In the 2005 season, the Buccaneers celebrated their 30th season in the league, and returned to their winning ways. The Bucs selected Carnell \"Cadillac\" Williams in the first round of the 2005 draft, and the rookie would provide a running game the Buccaneers had not possessed since the days of James Wilder in the 1980s. Williams would later go on to receive the NFL Offensive Rookie of the Year Award. After starting 5–1, the team entered a midseason slump hampered by a season-ending injury to starting QB Brian Griese. Replacement starter Chris Simms struggled early, but came into his own, leading the team to a last-minute win over the Redskins. The Bucs won the NFC South Division finishing 11–5. The season ended abruptly, however, with a 17–10 loss in the Wild Card round, in a rematch with the Redskins.",
			"color": "black|0.58187 dim|0.055394 gray|0.055394 dim|0.055394 grey|0.055394 dark|0.031561 gray|0.031561 dark|0.031561 grey|0.031561 gray|0.031003 grey|0.031003 light|0.024193 slate|0.024193 gray|0.024193 slate|0.023084 gray|0.023084 silver|0.023051 light|0.022055 gray|0.022055 light|0.022055 grey|0.022055 gainsboro|0.018939 light|0.017879 steel|0.017879 blue|0.017879 white|0.01291 smoke|0.01291 lavender|0.012394 alice|0.011181 blue|0.011181 ghost|0.011166 white|0.011166 snow|0.010278 white|0.0093052 sea|0.0089496 shell|0.0089496 lavender|0.0089202 blush|0.0089202 mint|0.0079751 cream|0.0079751 azure|0.0073595 floral|0.0072264 white|0.0072264 dark|0.0067 khaki|0.0067 brown|0.0062644  "
		}
	}
}
