{
	"add": {
		"doc": {
			"id": "7130366058b3f80e25f8f4694809223fecfd3c71016e4498b21d63c560a63093",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Albrecht_Altdorfer_039.jpg/220px-Albrecht_Altdorfer_039.jpg",
				"previous": "Albrecht Altdorfer is regarded as one of the founders of Western landscape art.[29] He was a painter, etcher, architect, and engraver, and the leader of the Danube school of German art. As evidenced by such paintings as Saint George and the Dragon (1510) and Allegory (1531), much of Altdorfer's work is characterised by an attachment to sprawling landscapes that dwarf the figures within them;[30] The Battle of Alexander at Issus epitomises this facet of his style. With reference to St George and the Dragon in particular, art historian Mark W. Roskill comments that \"The accessory material of landscape [in Altdorfer's work] is played with and ornamentally elaborated so that it reverberates with the sense of a sequestered and inhospitable environment\".[31] Inspired by his travels around the Austrian Alps and the Danube River,[32] Altdorfer painted a number of landscapes that contain no figures at all, including Landscape with a Footbridge (c. 1516) and Danube Landscape near Regensburg (c. 1522–25). These were the first \"pure\" landscapes since antiquity.[33] Most of Altdorfer's landscapes were made with a vertical format, in contrast with the modern conception of the genre. The horizontal landscape was an innovation of Altdorfer's Flemish contemporary Joachim Patinir and his followers.[34]",
				"after": "Altdorfer also produced a great deal of religious artwork, in reflection of his devout Catholicism. His most frequent subjects were the Virgin Mary and the life and crucifixion of Christ. As in The Battle of Alexander at Issus, these paintings often feature settings of great majesty and use the sky to convey symbolic meaning. This meaning is not uniform throughout Altdorfer's corpus – for example, the visage of the setting sun connotes loss and tragedy in Agony in the Garden, but serves as \"the emblem of power and glory\" in The Battle of Alexander at Issus.[35]",
			"color": "wheat|0.092931 dark|0.088366 slate|0.088366 gray|0.088366 burly|0.062677 wood|0.062677 moccasin|0.053297 pale|0.050217 golden|0.050217 rod|0.050217 bisque|0.048149 blanched|0.04506 almond|0.04506 tan|0.044831 navajo|0.039127 white|0.039127 papaya|0.031804 whip|0.031804 antique|0.027159 white|0.027159 lemon|0.027084 chiffon|0.027084 firebrick|0.026415 dark|0.025252 khaki|0.025252 light|0.024317 golden|0.024317 rod|0.024317 yellow|0.024317 peach|0.023536 puff|0.023536 brown|0.022196 corn|0.021334 silk|0.021334 beige|0.020198 khaki|0.014322 sienna|0.014306 light|0.011811 yellow|0.011811 indian|0.011191 red|0.011191 dark|0.010242 olive|0.010242 green|0.010242 light|0.0093508 steel|0.0093508 blue|0.0093508 dim|0.0091908 gray|0.0091908 dim|0.0091908 grey|0.0091908 dark|0.0091641 gray|0.0091641 dark|0.0091641 grey|0.0091641 dark|0.0089614 salmon|0.0089614 light|0.00846 slate|0.00846 gray|0.00846 old|0.0078182 lace|0.0078182 light|0.0066757 blue|0.0066757 maroon|0.006305 sky|0.0060703 blue|0.0060703  "
		}
	}
}
