{
	"add": {
		"doc": {
			"id": "715a00d76fcb85dd62898a63188c3b0e6977ecc67e62993eafe4f1077b5fc3b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/BradmanDuck32-33.jpg/220px-BradmanDuck32-33.jpg",
				"previous": "Bradman had other problems to deal with at this time; among these were bouts of illness from an undiagnosed malaise which had begun during the tour of North America,[62] and that the Australian Board of Control had initially refused permission for him to write a column for the Sydney Sun.[62] Bradman, who had signed a two-year contract with the newspaper, threatened to withdraw from cricket to honour his contract when the board denied him permission to write; eventually, the paper released Bradman from the contract, in a victory for the board.[62] In three first-class games against England before the Tests, Bradman averaged just 17.16 in 6 innings.[63] Jardine decided to give the new tactics a trial in only one game, a fixture against an Australian XI at Melbourne. In this match, Bradman faced the leg theory and later warned local administrators that trouble was brewing if it continued.[64] He withdrew from the First Test at the Sydney Cricket Ground amid rumours that he had suffered a nervous breakdown. Despite his absence, England employed what were already becoming known as the Bodyline tactics against the Australian batsmen and won an ill-tempered match.[19]",
				"after": "The public clamoured for the return of Bradman to defeat Bodyline: \"he was the batsman who could conquer this cankerous bowling ... 'Bradmania', amounting almost to religious fervour, demanded his return\".[65] Recovered from his indisposition, Bradman returned to the side in Alan Kippax's position. A world record crowd of 63,993 at the MCG saw Bradman come to the crease on the first day of the Second Test with the score at 2/67. A standing ovation ensued that delayed play for several minutes.[66] Bradman anticipated receiving a bouncer as his first ball and, as the bowler delivered, he moved across his stumps to play the hook shot. The ball failed to rise and Bradman dragged it onto his stumps; the first-ball duck was his first in a Test. The crowd fell into stunned silence as he walked off. However, Australia took a first innings lead in the match, and another record crowd on 2 January 1933 watched Bradman hit a counter-attacking second innings century. His unbeaten 103 (from 146 balls) in a team total of 191 helped set England a target of 251 to win. Bill O'Reilly and Bert Ironmonger bowled Australia to a series-levelling victory amid hopes that Bodyline was beaten.[67]",
			"color": " "
		}
	}
}
