{
	"add": {
		"doc": {
			"id": "7165ac715dbba463231afcd217110445a8260590ae184bba2183d9590fdc069a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/WWII_London_Blitz_East_London.jpg/220px-WWII_London_Blitz_East_London.jpg",
				"previous": "Between 7 September 1940 and 10 May 1941, a sustained bombing campaign was mounted. It began with the bombing of London for 57 successive nights,[70] an era known as 'the Blitz'. East London was targeted because the area was a centre for imports and storage of raw materials for the war effort, and the German military command felt that support for the war could be damaged among the mainly working class inhabitants. On the first night of the blitz, 430 civilians were killed and 1600 seriously wounded.[70] The populace responded by evacuating children and the vulnerable to the country[71] and digging in, constructing Anderson shelters in their gardens and Morrison shelters in their houses, or going to communal shelters built in local public spaces.[72] On 10 September 1940, 73 civilians, including women and children preparing for evacuation, were killed when a bomb hit the South Hallsville School. Although the official death toll is 73,[73] many local people believed it must have been higher. Some estimates say 400 or even 600 may have lost their lives during this raid on Canning Town.[74]",
				"after": "The effect of the intensive bombing worried the authorities and 'Mass-Observation' was deployed to gauge attitudes and provide policy suggestions,[75] as before the war they had investigated local attitudes to anti-Semitism.[76] The organisation noted that close family and friendship links within the East End were providing the population with a surprising resilience under fire. Propaganda was issued, reinforcing the image of the 'brave chirpy Cockney'. On the Sunday after the Blitz began, Winston Churchill himself toured the bombed areas of Stepney and Poplar. Anti-aircraft installations were built in public parks, such as Victoria Park and the Mudchute on the Isle of Dogs, and along the line of the Thames, as this was used by the aircraft to guide them to their target.",
			"color": " "
		}
	}
}
