{
	"add": {
		"doc": {
			"id": "7169410b2506953c1b77377f32976a7a0c3bdd9edaee424d0b62155b6eb6e847",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Nest_of_naked_mole_rats.jpg/220px-Nest_of_naked_mole_rats.jpg",
				"previous": "Larger rodents tend to live in family units where parents and their offspring live together until the youngsters disperse. Beavers live in extended family units typically with a pair of adults, this year's kits, the previous year's offspring and sometimes older young.[38] Brown rats usually live in small colonies with up to six females sharing a burrow and one male defending a territory around the burrow. At high population densities, this system breaks down and males show a hierarchical system of dominance with overlapping ranges. Female offspring remain in the colony while male young disperse.[39] The prairie vole is monogamous and forms a lifelong pair bond. Outside the breeding season, prairie voles live in close proximity with others in small colonies. A male is not aggressive towards other males until he has mated, after which time he defends a territory, a female and a nest against other males. The pair huddle together, groom one another, and share nesting and pup-raising responsibilities.[40]",
				"after": "Among the most social of rodents are the ground squirrels, which typically form colonies based on female kinship, males dispersing after weaning and becoming nomadic as adults. Cooperation in ground squirrels varies between species and typically includes making alarm calls, defending territories, sharing food, protecting nesting areas and preventing infanticide.[41] The black-tailed prairie dog forms large towns that may cover many hectares. The burrows do not interconnect but are excavated and occupied by territorial family groups known as coteries. A coterie often consists of an adult male, three or four adult females, several non-breeding yearlings and this year's offspring. Individuals within coteries are friendly with each other, but hostile towards outsiders.[37]",
			"color": "dark|0.52098 slate|0.52098 blue|0.52098 midnight|0.36676 blue|0.36676 slate|0.056343 blue|0.056343 black|0.035389 medium|0.018579 purple|0.018579  "
		}
	}
}
