{
	"add": {
		"doc": {
			"id": "716b50ed11540844fb776eaf9592a93e491224ce961384ae0e75871d8e3c2a3f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/The_Battle_of_San_Jacinto_%281895%29.jpg/300px-The_Battle_of_San_Jacinto_%281895%29.jpg",
				"previous": "The area along Buffalo Bayou had many thick oak groves, separated by marshes. This type of terrain was familiar to the Texians and quite alien to the Mexican soldiers.[235] Houston's army, comprising 900 men, reached Lynch's Ferry mid-morning on April 20; Santa Anna's 700-man force arrived a few hours later. The Texians made camp in a wooded area along the bank of Buffalo Bayou; while the location provided good cover and helped hide their full strength, it also left the Texians no room for retreat.[236][237] Over the protests of several of his officers, Santa Anna chose to make camp in a vulnerable location, a plain near the San Jacinto River, bordered by woods on one side, marsh and lake on another.[235][238] The two camps were approximately 500 yards (460 m) apart, separated by a grassy area with a slight rise in the middle.[239] Colonel Pedro Delgado later wrote that \"the camping ground of His Excellency's selection was in all respects, against military rules. Any youngster would have done better.\"[240]",
				"after": "Over the next several hours, two brief skirmishes occurred. Texians won the first, forcing a small group of dragoons and the Mexican artillery to withdraw.[235][241] Mexican dragoons then forced the Texian cavalry to withdraw. In the melee, Rusk, on foot to reload his rifle, was almost captured by Mexican soldiers, but was rescued by newly arrived Texian volunteer Mirabeau B. Lamar.[241] Over Houston's objections, many infantrymen rushed onto the field. As the Texian cavalry fell back, Lamar remained behind to rescue another Texian who had been thrown from his horse; Mexican officers \"reportedly applauded\" his bravery.[242] Houston was irate that the infantry had disobeyed his orders and given Santa Anna a better estimate of their strength; the men were equally upset that Houston hadn't allowed a full battle.[243]",
			"color": "black|0.36697 tan|0.076916 dark|0.071842 olive|0.071842 green|0.071842 burly|0.05979 wood|0.05979 sienna|0.057982 peru|0.055263 saddle|0.048177 brown|0.048177 dim|0.022083 gray|0.022083 dim|0.022083 grey|0.022083 sandy|0.021036 brown|0.021036  "
		}
	}
}
