{
	"add": {
		"doc": {
			"id": "716f0b7bf28340fdaafb669382466f2f4b166303c4e089af40273286dcbc5d07",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Bosbyshell_medal_crop.jpg/220px-Bosbyshell_medal_crop.jpg",
				"previous": "In 1890, Bosbyshell deposited $4,200 of federal funds in the Keystone National Bank, which then went bankrupt. Bosbyshell was responsible for the debt, which was only $300 less than his annual salary, and paid it off by stages, completing the payments in 1894.[21] In August 1890, Bosbyshell was elected colonel of his National Guard regiment; the vote was unexpectedly close, as he was disliked by some of his fellow officers.[22] Following the Homestead Riots in July 1892, Pennsylvania Governor Robert E. Pattison ordered militia to the strike-torn town to restore order. Bosbyshell led his guard regiment to Homestead, where the strikers offered no resistance.[23] In August 1893, he resigned from the regiment.[2]",
				"after": "Before Congress abolished the practice in 1873, the government made silver legal tender alongside gold.[24] This led to one of the great political controversies of the late 1800s, as many called for a return to pre-1873 laws, which would require the government to take all the silver offered it and then return it, struck into silver dollars.[25] On January 3, 1891, two \"free silver\" advocates called at the Philadelphia Mint with a large ingot of silver, and asked for it to be coined. When the weighing clerk declined, they asked to see Bosbyshell, who received them, but refused their demand. He did, however, write at their request a letter stating that the laws forbade coinage of silver provided by the public.[26]",
			"color": "sienna|0.30622 peru|0.29547 sandy|0.090719 brown|0.090719 dark|0.087898 salmon|0.087898 saddle|0.055694 brown|0.055694 burly|0.030178 wood|0.030178 peach|0.022722 puff|0.022722 tan|0.016402 navajo|0.015634 white|0.015634 bisque|0.0098456 wheat|0.0091331 moccasin|0.0091142 pale|0.0064152 golden|0.0064152 rod|0.0064152 blanched|0.0061453 almond|0.0061453  "
		}
	}
}
