{
	"add": {
		"doc": {
			"id": "717213f6dad1a9ab998d640722b15458079d8c3ecfa0130d49746b9161203482",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Boeing_720-040B_AP-AMG_PIA_LHR_24.06.62_edited-2.jpg/220px-Boeing_720-040B_AP-AMG_PIA_LHR_24.06.62_edited-2.jpg",
				"previous": "Pakistan International Airlines can trace its origins to the days when Pakistan had not yet gained independence from the British Raj. In 1946, the country's founder Muhammed Ali Jinnah realized the need for a flag carrier for the prospective country and requested financial help from wealthy businessmen Mirza Ahmad Ispahani and Adamjee Haji Dawood for this purpose. Around that time, a new airline 'Orient Airways', was registered in Calcutta on 23 October 1946. In February 1947, the airline bought three DC-3 airplanes from a company in Texas and obtained a license to fly in May of the same year. The airline started its operations in June, offering services from Kolkata to Sittwe and Yangon. On 14 August 1947, Pakistan came into being and Orient Airways started relief operations for the new country. It was the first and only Muslim owned airline in India and flew from 1947 to 1955.",
				"after": "On 7 June 1954, Orient Airways started its operations by offering flight services between East and West Pakistan, with service from Karachi to Dhaka. In addition, the airline also introduced two new domestic routes, i.e., Karachi-Lahore-Peshawar and Karachi-Quetta-Lahore. However, due to sustained losses being suffered by the airline, the Government of Pakistan proposed that Orient Airways merge with a new national airline. On 11 March 1955, Orient Airways merged with the government's proposed airline, becoming Pakistan International Airlines Corporation. The newly formed airline also inaugurated its first international route, Karachi-London Heathrow Airport[13] via Cairo and Rome, using four newly acquired Lockheed L-1049C Super Constellations. The airline continued using DC-3s on domestic routes in Pakistan. In May 1956, PIA ordered two Super Lockheed Constellations of the latest L-1049H type and five Vickers Viscount 815.",
			"color": "black|0.19437 tan|0.040631 sea|0.035604 shell|0.035604 white|0.0347 smoke|0.0347 floral|0.033972 white|0.033972 dark|0.032093 gray|0.032093 dark|0.032093 grey|0.032093 snow|0.031398 gray|0.030137 grey|0.030137 white|0.029129 linen|0.028939 mint|0.028536 cream|0.028536 dark|0.024318 khaki|0.024318 light|0.023511 gray|0.023511 light|0.023511 grey|0.023511 antique|0.023176 white|0.023176 silver|0.022693 ghost|0.022628 white|0.022628 gainsboro|0.022139 ivory|0.021913 old|0.021841 lace|0.021841 wheat|0.020882 alice|0.019285 blue|0.019285 azure|0.019059 beige|0.018831 dim|0.018209 gray|0.018209 dim|0.018209 grey|0.018209 lavender|0.016682 blush|0.016682 burly|0.013729 wood|0.013729 sea|0.012761 green|0.012761 papaya|0.012185 whip|0.012185 honeydew|0.011195  "
		}
	}
}
