{
	"add": {
		"doc": {
			"id": "717a345f0f3ed3fb2183bfc954413f5c0d047ca787a5fe9919db4138ddeadcb7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Parallel_telomere_quadruple.png/220px-Parallel_telomere_quadruple.png",
				"previous": "At the ends of the linear chromosomes are specialized regions of DNA called telomeres. The main function of these regions is to allow the cell to replicate chromosome ends using the enzyme telomerase, as the enzymes that normally replicate DNA cannot copy the extreme 3′ ends of chromosomes.[57] These specialized chromosome caps also help protect the DNA ends, and stop the DNA repair systems in the cell from treating them as damage to be corrected.[58] In human cells, telomeres are usually lengths of single-stranded DNA containing several thousand repeats of a simple TTAGGG sequence.[59]",
				"after": "These guanine-rich sequences may stabilize chromosome ends by forming structures of stacked sets of four-base units, rather than the usual base pairs found in other DNA molecules. Here, four guanine bases form a flat plate and these flat four-base units then stack on top of each other, to form a stable G-quadruplex structure.[61] These structures are stabilized by hydrogen bonding between the edges of the bases and chelation of a metal ion in the centre of each four-base unit.[62] Other structures can also be formed, with the central set of four bases coming from either a single strand folded around the bases, or several different parallel strands, each contributing one base to the central structure.",
			"color": "steel|0.24862 blue|0.24862 dodger|0.23418 blue|0.23418 light|0.10058 steel|0.10058 blue|0.10058 corn|0.055123 flower|0.055123 blue|0.055123 slate|0.047836 blue|0.047836 royal|0.046221 blue|0.046221 medium|0.038617 slate|0.038617 blue|0.038617 indian|0.035291 red|0.035291 rosy|0.018438 brown|0.018438 light|0.01679 slate|0.01679 gray|0.01679 lavender|0.010404 brown|0.0089337 alice|0.0079487 blue|0.0079487  "
		}
	}
}
