{
	"add": {
		"doc": {
			"id": "7183079af368bbc4598f24e9f4cf82865c34e41affa4b6896d81b4b271c12d8a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/HMS_Invincible_sideview.jpg/220px-HMS_Invincible_sideview.jpg",
				"previous": "World War II also saw the United States become by far the largest Naval power in the world. In the late 20th and early 21st centuries, the United States Navy possessed over 70% of the world's total numbers and total tonnage of naval vessels of 1,000 tons or greater.[11] Throughout the rest of the 20th century, the United States Navy would maintain a tonnage greater than that of the next 17 largest navies combined. During the Cold War, the Soviet Navy became a significant armed force, with large numbers of large, heavily armed ballistic missile submarines and extensive use of heavy, long-ranged antisurface missiles to counter the numerous United States carrier battle groups. Only 3 nations (United States, France, and Brazil) presently operate CATOBAR carriers of any size, while Russia, China and India operate sizeable STOBAR carriers (although all three are originally of Russian design). The UK is also currently constructing two Queen Elizabeth class carriers, which will be the largest STOVL vessels in service, and India is currently building one Vikrant-class aircraft carrier and considering another. France is also looking at a new carrier, probably using a CATOBAR system and possibly based on the British Queen Elizabeth design.",
				"after": "A navy typically operates from one or more naval bases. The base is a port that is specialized in naval operations, and often includes housing, a munitions depot, docks for the vessels, and various repair facilities. During times of war temporary bases may be constructed in closer proximity to strategic locations, as it is advantageous in terms of patrols and station-keeping. Nations with historically strong naval forces have found it advantageous to obtain basing rights in other countries in areas of strategic interest.",
			"color": "black|0.326 gainsboro|0.055779 white|0.051606 smoke|0.051606 alice|0.048058 blue|0.048058 ghost|0.04545 white|0.04545 azure|0.044226 snow|0.03964 mint|0.038892 cream|0.038892 white|0.038534 light|0.034158 gray|0.034158 light|0.034158 grey|0.034158 silver|0.029671 dark|0.028056 gray|0.028056 dark|0.028056 grey|0.028056 sea|0.026251 shell|0.026251 lavender|0.02089 lavender|0.019094 blush|0.019094 floral|0.018532 white|0.018532 light|0.018035 slate|0.018035 gray|0.018035 linen|0.015257 slate|0.015081 gray|0.015081 dim|0.013018 gray|0.013018 dim|0.013018 grey|0.013018 light|0.012885 blue|0.012885 gray|0.012171 grey|0.012171 light|0.0094992 cyan|0.0094992 light|0.0088497 steel|0.0088497 blue|0.0088497 ivory|0.0084782 old|0.0082865 lace|0.0082865 powder|0.0053352 blue|0.0053352 dark|0.0040652 slate|0.0040652 gray|0.0040652  "
		}
	}
}
