{
	"add": {
		"doc": {
			"id": "71949a96de973a3a42d3ff34250f06a40f1f5eefd6e14b137a0abf488599cdf0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/First_International_Airways_Douglas_DC-8_PER_Monty.jpg/220px-First_International_Airways_Douglas_DC-8_PER_Monty.jpg",
				"previous": "The definitive short-fuselage DC-8 with the same engine that powered the vast majority of 707s, the JT3D. Fourteen earlier DC-8s were converted to this standard. All but the -55 were certified in 1961. The DC-8-51, DC-8-52 and DC-8-53 all had 17,000 lb (76.1 kN) JT3D-1 or 18,000 lb (80.6 kN) JT3D-3B engines, varying mainly in their weights: 276,000 pounds (125,200 kg), 300,000 pounds (136,100 kg) and 315,000 pounds (142,900 kg) respectively. The DC-8-55 arrived in June 1964, retaining the JT3D-3B engines but with strengthened structure from the freighter versions and 325,000-pound (147,420 kg) maximum weight. 88 DC-8-50s were built plus the 14 converted from Series 10/30.[citation needed]",
				"after": "The DC-8-71 to DC-8-73 were straightforward conversions of the -61 to -63, replacing the JT3D engines with more fuel-efficient 22,000 lb (98.5 kN) CFM56-2 high-bypass turbofans in new housings built by Grumman, along with new engine pylons and fairing of the air intakes below the nose. The DC-8-71 achieved the same end but required more modification because the -61 did not have the improved wings and relocated engines of the -62 and -63. Maximum takeoff weights remained the same, but there was a slight reduction in payload because of the heavier engines. All three models were certified in 1982 and a total of 110 60-Series DC-8s were converted by the time the program ended in 1988.[citation needed]",
			"color": "dim|0.46873 gray|0.46873 dim|0.46873 grey|0.46873 black|0.10886 gray|0.083792 grey|0.083792 dark|0.04346 gray|0.04346 dark|0.04346 grey|0.04346 silver|0.037786 light|0.02738 gray|0.02738 light|0.02738 grey|0.02738 dark|0.019675 sea|0.019675 green|0.019675 gainsboro|0.018747 white|0.014906 smoke|0.014906 floral|0.014478 white|0.014478 sea|0.01377 shell|0.01377 linen|0.013762 honeydew|0.013506 mint|0.013036 cream|0.013036 snow|0.012445 white|0.012261 sea|0.011067 green|0.011067 ivory|0.010585 old|0.010457 lace|0.010457  "
		}
	}
}
