{
	"add": {
		"doc": {
			"id": "71ae1ed6c5c59ab8e3dafd539a3b9f6bf85c11080f7831e76c5731d6699b8378",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Ionization_energies.png/400px-Ionization_energies.png",
				"previous": "The noble gases have weak interatomic force, and consequently have very low melting and boiling points. They are all monatomic gases under standard conditions, including the elements with larger atomic masses than many normally solid elements.[11] Helium has several unique qualities when compared with other elements: its boiling and melting points are lower than those of any other known substance; it is the only element known to exhibit superfluidity; it is the only element that cannot be solidified by cooling under standard conditions—a pressure of 25 standard atmospheres (2,500 kPa; 370 psi) must be applied at a temperature of 0.95 K (−272.200 °C; −457.960 °F) to convert it to a solid.[26] The noble gases up to xenon have multiple stable isotopes. Radon has no stable isotopes; its longest-lived isotope, 222Rn, has a half-life of 3.8 days and decays to form helium and polonium, which ultimately decays to lead.[11] Melting and boiling points generally increase going down the group.",
				"after": "The noble gas atoms, like atoms in most groups, increase steadily in atomic radius from one period to the next due to the increasing number of electrons. The size of the atom is related to several properties. For example, the ionization potential decreases with an increasing radius because the valence electrons in the larger noble gases are farther away from the nucleus and are therefore not held as tightly together by the atom. Noble gases have the largest ionization potential among the elements of each period, which reflects the stability of their electron configuration and is related to their relative lack of chemical reactivity.[24] Some of the heavier noble gases, however, have ionization potentials small enough to be comparable to those of other elements and molecules. It was the insight that xenon has an ionization potential similar to that of the oxygen molecule that led Bartlett to attempt oxidizing xenon using platinum hexafluoride, an oxidizing agent known to be strong enough to react with oxygen.[15] Noble gases cannot accept an electron to form stable anions; that is, they have a negative electron affinity.[27]",
			"color": "dark|0.28347 salmon|0.28347 gray|0.18914 grey|0.18914 dark|0.15344 gray|0.15344 dark|0.15344 grey|0.15344 silver|0.12409 light|0.068325 gray|0.068325 light|0.068325 grey|0.068325 dim|0.039425 gray|0.039425 dim|0.039425 grey|0.039425 gainsboro|0.025759 misty|0.015353 rose|0.015353 sea|0.01041 shell|0.01041 white|0.0091466 smoke|0.0091466 floral|0.008973 white|0.008973 snow|0.008813 lavender|0.0081998 blush|0.0081998 white|0.0080829 ghost|0.007712 white|0.007712 antique|0.0072545 white|0.0072545 mint|0.0072477 cream|0.0072477 linen|0.0066178 alice|0.006361 blue|0.006361  "
		}
	}
}
