{
	"add": {
		"doc": {
			"id": "71b9c347391926a97bd79c3c27f8a5453d0e58f83981659bbbb156c01c8ba9a1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Arctic_Tern_%28Sterna_paradisaea%29%2C_Ward_of_Clugan_-_geograph.org.uk_-_1357999.jpg/220px-Arctic_Tern_%28Sterna_paradisaea%29%2C_Ward_of_Clugan_-_geograph.org.uk_-_1357999.jpg",
			"previous": [],
				"after": "There are several terns of a similar size and general appearance to the common tern. A traditionally difficult species to separate is the Arctic tern, and until the key characteristics were clarified, distant or flying birds of the two species were often jointly recorded as \"commic terns\". Although similar in size, the two terns differ in structure and flight. The common tern has a larger head, thicker neck, longer legs, and more triangular and stiffer wings than its relative, and has a more powerful, direct flight.[25] The Arctic tern has greyer underparts than the common, which make its white cheeks more obvious, whereas the rump of the common tern can be greyish in non-breeding plumage, compared to the white of its relative. The common tern develops a dark wedge on the wings as the breeding season progresses, but the wings of Arctic stay white throughout the northern summer. All the flight feathers of the Arctic tern are translucent against a bright sky, only the four innermost wing feathers of the common tern share this property.[25][26] The trailing edge of the outer flight feathers is a thin black line in the Arctic tern, but thicker and less defined in the common.[19] The bill of an adult common tern is orange-red with a black tip, except in black-billed S. h. longipennis, and its legs are bright red, while both features are a darker red colour in the Arctic tern, which also lacks the black bill tip.[25]",
			"color": "dark|0.1483 gray|0.1483 dark|0.1483 grey|0.1483 silver|0.1405 light|0.085408 gray|0.085408 light|0.085408 grey|0.085408 gray|0.072798 grey|0.072798 dark|0.063559 slate|0.063559 gray|0.063559 dim|0.06107 gray|0.06107 dim|0.06107 grey|0.06107 gainsboro|0.049822 white|0.029834 smoke|0.029834 light|0.027661 slate|0.027661 gray|0.027661 sea|0.027228 shell|0.027228 floral|0.0268 white|0.0268 mint|0.024973 cream|0.024973 snow|0.024028 white|0.023111 azure|0.020423 ghost|0.019975 white|0.019975 alice|0.019002 blue|0.019002 linen|0.018946 light|0.018742 steel|0.018742 blue|0.018742 ivory|0.015703 old|0.012061 lace|0.012061 slate|0.011684 gray|0.011684 black|0.01135 lavender|0.010437 blush|0.010437 antique|0.0098254 white|0.0098254 beige|0.0074336 honeydew|0.006763  "
		}
	}
}
