{
	"add": {
		"doc": {
			"id": "71c154cf40b7f34ca72e09ffd8e4412d4a036137d34179512c1a705e493c917f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Priestley_Foyer.jpg/220px-Priestley_Foyer.jpg",
				"previous": "The house has a two-and-half story central section, which is 48 feet (14.6 m) by 43 feet (13.1 m), and two one-story wings on the north and south sides that are each 22 feet (6.7 m) by 21 feet (6.4 m). The first and second floors have a total area of 5,052 square feet (469 m²).[62] The north wing was the laboratory and the south wing (which had an attached woodshed) was the summer kitchen. The cellar, first, and second floors of the central section are each divided into four rooms, with a central hall on the first and second floors; the first floor also has an intersecting hall that leads to the laboratory. The attic has three rooms for servants and a larger room for storage.[5] A paint analysis done in 1994 revealed that the house had no wall paper initially and that the walls and woodwork were painted \"a brilliant white\".[63]",
				"after": "The house is a frame structure, covered with white wooden clapboards, anchored to a stone foundation. The Priestleys built their home out of wood, dried in trenches on the site,[2] because no stone or brick was available in the area. Joseph wrote a detailed description of the drying process, concluding: \"A house constructed with such boards I prefer to one of brick and stone\".[64] This may have prompted journalist William Cobbett to caustically label the house a \"shed\" in one of his political tirades against Joseph.[65] The central section of the house has a slate gable roof with a railing-enclosed deck. The house has \"three internal gable end chimneys, one for the main kitchen\", and one each at the north and south ends of the central section.[5]",
			"color": "gray|0.29624 grey|0.29624 dim|0.16306 gray|0.16306 dim|0.16306 grey|0.16306 black|0.081321 tan|0.069149 light|0.066785 slate|0.066785 gray|0.066785 dark|0.05963 gray|0.05963 dark|0.05963 grey|0.05963 slate|0.049883 gray|0.049883 wheat|0.033468 silver|0.023779 lemon|0.018987 chiffon|0.018987 light|0.018303 steel|0.018303 blue|0.018303 light|0.018078 golden|0.018078 rod|0.018078 yellow|0.018078 moccasin|0.012189 blanched|0.011392 almond|0.011392 light|0.011333 yellow|0.011333 corn|0.011267 silk|0.011267 pale|0.010326 golden|0.010326 rod|0.010326 papaya|0.0073474 whip|0.0073474 beige|0.0072957  "
		}
	}
}
