{
	"add": {
		"doc": {
			"id": "71d1aa098b1deb14280d87f8a8b4ed6fd39516515848b3d64ea8c3718dd0fbf8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Red-capped_Robin_currawinya.JPG/220px-Red-capped_Robin_currawinya.JPG",
				"previous": "The smallest of the red robins, the red-capped robin is 10.5–12.5 cm (4–5 in) long with a wingspan of 15–19.5 cm (6–8 in), and weighs around 7–9 g (0.25–0.31 oz). Males and females are of similar size. It has longer legs than the other robins of the genus Petroica. The male has a distinctive scarlet cap and breast. Its upperparts are jet black with white shoulder bars, and its tail black with white tips. The underparts and shoulder are white. All colours are sharply delineated from one another.[12] The female is an undistinguished grey-brown above with a reddish tint to the crown, and paler underneath with dark brown wings and pale buff wing patch. Some females have a reddish tint to the breast. Both sexes have a small black bill,[14] and dark brown eyes and legs. Immature birds initially resemble the female;[11] it is only with their second moult, which takes place at around or just over a year of age that males adopt their distinctive adult plumage.[15] The red-capped robin moults once a year, after the breeding season which takes place between December and April.[16]",
				"after": "Two red keto-carotenoid pigments, canthaxanthin and adonirubin, are responsible for the redness in the red-capped robin's plumage.[17] The birds are unable to synthesize these compounds themselves, and hence need to obtain them from their food. Carotenoids are costly to metabolise and are also required for use in immune function, hence birds need to be in good condition to have enough left for use in red feathers. This makes red plumage a good advertisement to prospective mates.[18] A 2001 field study at Terrick Terrick National Park in Victoria found that males who had greater reproductive success and were in better condition moulted into a brighter plumage the following year. However, male age and condition at the time were more likely to predict mating success for the following breeding season.[17] Adult males can breed at one year of age and may do so while yet in non-breeding plumage,[19] but they are less successful at reproducing at this age.[17] The oldest recorded age is 5 years and 7 months for a bird banded near Beverley, Western Australia, in 1990.[20]",
			"color": "black|0.35641 burly|0.21162 wood|0.21162 navajo|0.079006 white|0.079006 tan|0.065533 saddle|0.052983 brown|0.052983 moccasin|0.045876 wheat|0.040026 peru|0.02788 sienna|0.02593 dim|0.023459 gray|0.023459 dim|0.023459 grey|0.023459 sandy|0.013703 brown|0.013703 gray|0.010977 grey|0.010977 slate|0.010051 gray|0.010051  "
		}
	}
}
