{
	"add": {
		"doc": {
			"id": "71e1db1f3a12c66c611364bd158d4d475f86a9c18c3a097f8e2df3f9696c989b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/MSU_Chittenden_Hall_sepia.jpg/220px-MSU_Chittenden_Hall_sepia.jpg",
				"previous": "In 1899, the State Agricultural College finally admitted its first African American student, William O. Thompson. After graduation, Thompson taught at what is now Tuskegee University, founded and headed by Booker T. Washington. Washington later delivered one of his most memorable addresses to the class of 1900 at commencement: in the 1900 commencement address, Booker T. Washington said \"Without industrial development there can be no wealth; without wealth there can be no leisure; without leisure, no opportunity for thoughtful reflection and the cultivation of the higher arts.\"[29] MSU President Jonathan L. Snyder had invited Washington to be the College's Class of 1900 commencement speaker. A few years later, Myrtle Craig became the first African-American woman to enroll at the College. Graduating with the Class of 1907, she received her degree from U.S. President Theodore Roosevelt, commencement speaker for the Semi-Centennial celebration of the College's opening.[7]",
				"after": "The City of East Lansing incorporated in 1907 as well.[30] Two years later, the college officially changed its name to Michigan Agricultural College (M.A.C.), since by this time there were many other agricultural colleges across the country. Even though the College had been around for over fifty years and was a widely recognized leader of the Land Grant Colleges, some within the state legislature opposed expansion. Despite the Morrill Act's original mandate that Land Grant Colleges teach engineering (then called \"mechanic arts\"), some in Michigan believed its agricultural college should not have engineering programs because these duplicated the University of Michigan's offerings. Nonetheless, M.A.C. had developed civil and electrical engineering programs to compliment the original mechanical program of 1885.[31] These separate disciplines were unified in a new Department of Engineering in 1908.[32]",
			"color": "black|0.48325 dark|0.13026 gray|0.13026 dark|0.13026 grey|0.13026 silver|0.097141 gray|0.079245 grey|0.079245 light|0.059139 gray|0.059139 light|0.059139 grey|0.059139 gainsboro|0.034334 dim|0.033417 gray|0.033417 dim|0.033417 grey|0.033417  "
		}
	}
}
