{
	"add": {
		"doc": {
			"id": "71e617fc7b9e71b3ab102b6ec33aa8d5ed0dd2b8cb094d352302ee445c74900a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Vertebrate_archetype.jpg/220px-Vertebrate_archetype.jpg",
				"previous": "Ideas about the transmutation of species were associated with the radical materialism of the Enlightenment and were attacked by more conservative thinkers. Cuvier attacked the ideas of Lamarck and Geoffroy, agreeing with Aristotle that species were immutable. Cuvier believed that the individual parts of an animal were too closely correlated with one another to allow for one part of the anatomy to change in isolation from the others, and argued that the fossil record showed patterns of catastrophic extinctions followed by repopulation, rather than gradual change over time. He also noted that drawings of animals and animal mummies from Egypt, which were thousands of years old, showed no signs of change when compared with modern animals. The strength of Cuvier's arguments and his scientific reputation helped keep transmutational ideas out of the mainstream for decades.[60]",
				"after": "In Great Britain, the philosophy of natural theology remained influential. William Paley's 1802 book Natural Theology with its famous watchmaker analogy had been written at least in part as a response to the transmutational ideas of Erasmus Darwin.[62] Geologists influenced by natural theology, such as Buckland and Sedgwick, made a regular practice of attacking the evolutionary ideas of Lamarck, Grant, and Vestiges.[63][64] Although Charles Lyell opposed scriptural geology, he also believed in the immutability of species, and in his Principles of Geology, he criticized Lamarck's theories of development.[53] Idealists such as Louis Agassiz and Richard Owen believed that each species was fixed and unchangeable because it represented an idea in the mind of the creator. They believed that relationships between species could be discerned from developmental patterns in embryology, as well as in the fossil record, but that these relationships represented an underlying pattern of divine thought, with progressive creation leading to increasing complexity and culminating in humanity. Owen developed the idea of \"archetypes\" in the Divine mind that would produce a sequence of species related by anatomical homologies, such as vertebrate limbs. Owen led a public campaign that successfully marginalized Grant in the scientific community. Darwin would make good use of the homologies analyzed by Owen in his own theory, but the harsh treatment of Grant, and the controversy surrounding Vestiges, showed him the need to ensure that his own ideas were scientifically sound.[57][65][66]",
			"color": "black|0.11904 dark|0.10006 gray|0.10006 dark|0.10006 grey|0.10006 silver|0.086267 gray|0.072627 grey|0.072627 light|0.068098 gray|0.068098 light|0.068098 grey|0.068098 dim|0.057643 gray|0.057643 dim|0.057643 grey|0.057643 gainsboro|0.053609 linen|0.049789 sea|0.04384 shell|0.04384 floral|0.041046 white|0.041046 white|0.038338 smoke|0.038338 old|0.036401 lace|0.036401 snow|0.034561 ivory|0.029705 white|0.029488 antique|0.029193 white|0.029193 mint|0.02864 cream|0.02864 ghost|0.013032 white|0.013032 lavender|0.011982 blush|0.011982 misty|0.0092766 rose|0.0092766 azure|0.0090946 honeydew|0.008731 beige|0.0081428 alice|0.0065297 blue|0.0065297 papaya|0.0062346 whip|0.0062346  "
		}
	}
}
