{
	"add": {
		"doc": {
			"id": "720176d049b3833487ba2752a96a2531e10458a0dc88bde2f79888260aa9326b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Pillars_at_Sarasvati_Temple_in_Gadag.JPG/170px-Pillars_at_Sarasvati_Temple_in_Gadag.JPG",
				"previous": "From the 11th century, newly incorporated features were either based on the traditional dravida plan of the Badami Chalukyas, as found in the Virupaksha and Mallikarjuna Temples at Pattadakal, or were further elaborations of this articulation. The new features produced a closer juxtaposition of architectural components, visible as a more crowded decoration, as can be seen in the Mallikarjuna Temple at Sudi in the Gadag district and the Amrtesvara Temple at Annigeri in the Dharwad district.[32]",
				"after": "The architects in the Karnataka region seem to have been inspired by architectural developments in northern India. This is evidenced by the fact that they incorporated decorative miniature towers (multi-aedicular towers depicting superstructures) of the Sekhari and Bhumija types, supported on pilasters, almost simultaneously with these developments in the temples in northern India. The miniature towers represented shrines, which in turn represented deities. Sculptural depictions of deities were generally discreet although not uncommon. Other northern ideas they incorporated were the pillar bodies that appeared as wall projections.[33] Well-known constructions incorporating these features are found at the Kasivisvesvara Temple and the Nannesvara Temple, both at Lakkundi.[34]",
			"color": "antique|0.10987 white|0.10987 linen|0.074015 old|0.065736 lace|0.065736 tan|0.062953 sea|0.053238 shell|0.053238 floral|0.050334 white|0.050334 papaya|0.049435 whip|0.049435 ivory|0.042385 blanched|0.037817 almond|0.037817 bisque|0.036064 beige|0.033149 light|0.033045 gray|0.033045 light|0.033045 grey|0.033045 silver|0.03243 white|0.029413 smoke|0.029413 dark|0.029199 gray|0.029199 dark|0.029199 grey|0.029199 gainsboro|0.028376 snow|0.02697 misty|0.025341 rose|0.025341 corn|0.025178 silk|0.025178 peach|0.024979 puff|0.024979 dim|0.024761 gray|0.024761 dim|0.024761 grey|0.024761 gray|0.02406 grey|0.02406 mint|0.022103 cream|0.022103 white|0.020679  "
		}
	}
}
