{
	"add": {
		"doc": {
			"id": "721b42731c3e4ff4a6134eae3cac87ceff4a8831fd8d9a74f5785254c6501102",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Astraeus_hygrometricus1928.jpg/300px-Astraeus_hygrometricus1928.jpg",
				"previous": "The fruit body is 1–8 cm (0.4–3.1 in) in diameter from tip to tip when expanded.[25] The exoperidium is thick, and the rays are typically areolate (divided into small areas by cracks and crevices) on the upper surface,[26] and are dark grey to black. The spore case is sessile (lacking a stalk), light gray to tan color and 1 to 3 cm (0.4 to 1.2 in) broad with a felt-like or scurfy (coated with loose scaly crust) surface; the top of the spore case is opened by an irregular slit, tear or pore.[27] The interior of the spore case, the gleba, is white and solid when young, and divided into oval locules—a characteristic that helps to distinguish it from Geastrum.[28] The gleba becomes brown and powdery as the specimen matures.[29] Small dark hairlike threads (rhizomorphs) extend from the base of the fruit body into the substrate. The rhizomorphs are fragile, and often break off after maturity.[4]",
				"after": "The spores are spherical or nearly so, reddish-brown, thick-walled and verrucose (covered with warts and spines). The spores' dimensions are 7–11 µm;[30] the warts are about 1 µm long.[31] The spores are non-amyloid, and will not stain with iodine from Melzer's reagent.[10] The use of scanning electron microscopy has shown that the spines are 0.90–1.45 µm long, rounded at the tip, narrow, tapered, and sometime joined together at the top.[15] The capillitia (masses of thread-like sterile fibers dispersed among the spores) are branched, 3.5–6.5 µm in diameter, and hyaline (translucent).[4] The basidia (spore-bearing cells) are four- to eight-spored,[4] with very short sterigmata.[32] The basidia are arranged in long strings of clusters; individual basidia measure 11–15 by 18–24 µm. The threads of the capillitia arise from the inner surface of the peridium, and are thick-walled, long, interwoven, and branched, measuring 3–5.5 µm thick.[4] The exoperidium (the outer layer of tissue, comprising the rays) is made of four distinct layers of tissue: the mycelial layer contains branched hyphae that are 4–6 μm in diameter; the hyphae of the fibrous layer are 6–8 μm diameter and branched; the collenchyma-type layer has branched hyphae of 3–4 μm diameter; the soft layer contains hyphae that are 3–6 μm in diameter.[33]",
			"color": " "
		}
	}
}
