{
	"add": {
		"doc": {
			"id": "7226b5d9db5a977a9bd697740f1a282c7f37eaa0299ed5287a5fd5b6d0d15794",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/LT-2002-5litai-Tyto-b.png/170px-LT-2002-5litai-Tyto-b.png",
				"previous": "In some areas, it may be an insufficiency of suitable nesting sites that is the factor limiting barn owl numbers. The provision of nest boxes under the eaves of buildings and in other locations can be very successful in increasing the local population. In Malaysia, large areas of rainforest were felled to make way for oil palm plantations and with few tree cavities for breeding, the barn owl population, with its ability to control rodent pests, diminished. The provision of two hundred nest boxes in a trial saw almost one hundred percent occupancy and as the programme expanded, the plantations supported one of the densest barn owl populations in the world.[48] Similarly, providing nesting boxes has increased the number of barn owls in rice-growing areas of Malaysia where the rodents do much damage to the crop. However, although barn owl numbers have increased in both these instances, it is unclear as to how effective this biological control of the rats is as compared to the trapping and baiting that occurred previously.[49]",
				"after": "Common names such as \"demon owl\", \"death owl\", or \"ghost owl\" show that traditionally, rural populations in many places considered barn owls to be birds of evil omen. Consequently, they were often persecuted by farmers who were unaware of the benefit these birds bring.[50] The Canary barn owl is particularly at risk, and as late as 1975, hunting by fearful locals was limiting the population on Fuerteventura where only a few dozen pairs remain. On Lanzarote a somewhat larger number of these birds still seem to exist, but altogether this particular subspecies is precariously rare: Probably less than three hundred and perhaps fewer than two hundred individuals still remain. Similarly, the birds on the western Canary Islands which are usually assigned to the nominate subspecies have declined much, and here wanton destruction seems still to be significant. On Tenerife they seem relatively numerous but on the other islands, the situation looks about as bleak as on Fuerteventura. Due to their assignment to the nominate subspecies, which is common in mainland Spain, the western Canary Islands population is not classified as threatened.[51][52][53]",
			"color": " "
		}
	}
}
