{
	"add": {
		"doc": {
			"id": "7240fee5b3b520abe968e72247b800749572885af2e6ce4ce0e2d91add6c9dab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Market-Hierarchy-Model.png/300px-Market-Hierarchy-Model.png",
			"previous": [
				"",
				"For example, the buyer of a used car faces a variety of different transaction costs. The search costs are the costs of finding a car and determining the car's condition. The bargaining costs are the costs of negotiating a price with the seller. The policing and enforcement costs are the costs of ensuring that the seller delivers the car in the promised condition."
			],
			"after": [
				"The idea that transactions form the basis of an economic thinking was introduced by the institutional economist John R. Commons (1931). He said that:",
				"The term \"transaction cost\" is frequently thought to have been coined by Ronald Coase, who used it to develop a theoretical framework for predicting when certain economic tasks would be performed by firms, and when they would be performed on the market. However, the term is actually absent from his early work up to the 1970s. While he did not coin the specific term, Coase indeed discussed \"costs of using the price mechanism\" in his 1937 paper The Nature of the Firm, where he first discusses the concept of transaction costs, and refers to the \"Costs of Market Transactions\" in his seminal work, The Problem of Social Cost (1960). The term \"Transaction Costs\" itself can instead be traced back to the monetary economics literature of the 1950s, and does not appear to have been consciously 'coined' by any particular individual.[3]"
			],
			"color": "lavender|0.41665 light|0.3858 steel|0.3858 blue|0.3858 light|0.038244 slate|0.038244 gray|0.038244 slate|0.029883 gray|0.029883 dim|0.024147 gray|0.024147 dim|0.024147 grey|0.024147 dark|0.019986 gray|0.019986 dark|0.019986 grey|0.019986 gray|0.019104 grey|0.019104 gainsboro|0.017146 black|0.012496 alice|0.010424 blue|0.010424 silver|0.0093493  "
		}
	}
}
