{
	"add": {
		"doc": {
			"id": "7242742eac11c2c7bc6571f14eed65911d0b2a1b73f53ef36d9a28446fad4711",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Cyclol_fabric_spacefilling_OHside.png/350px-Cyclol_fabric_spacefilling_OHside.png",
			"previous": [],
				"after": "The cyclol fabric was shown to be implausible for several reasons. Hans Neurath and Henry Bull showed that the dense packing of side chains in the cyclol fabric was inconsistent with the experimental density observed in protein films.[50] Maurice Huggins calculated that several non-bonded atoms of the cyclol fabric would approach more closely than allowed by their van der Waals radii; for example, the inner Hα and Cα atoms of the lacunae would be separated by only 1.68 Å (Figure 5).[51] Haurowitz showed chemically that the outside of proteins could not have a large number of hydroxyl groups, a key prediction of the cyclol model,[52] whereas Meyer and Hohenemser showed that cyclol condensations of amino acids did not exist even in minute quantities as a transition state.[53] More general chemical arguments against the cyclol model were given by Bergmann and Niemann[54] and by Neuberger.[55][56] Infrared spectroscopic data showed that the number of carbonyl groups in a protein did not change upon hydrolysis,[57] and that intact, folded proteins have a full complement of amide carbonyl groups;[58] both observations contradict the cyclol hypothesis that such carbonyls are converted to hydroxyl groups in folded proteins. Finally, proteins were known to contain proline in significant quantities (typically 5%); since proline lacks the amide hydrogen and its nitrogen already forms three covalent bonds, proline seems incapable of the cyclol reaction and of being incorporated into a cyclol fabric. An encyclopedic summary of the chemical and structural evidence against the cyclol model was given by Pauling and Niemann.[59] Moreover, a supporting piece of evidence—the result that all proteins contain an integer multiple of 288 amino-acid residues[4]—was likewise shown to be incorrect in 1939.[60]",
			"color": "brown|0.59829 firebrick|0.16665 midnight|0.064066 blue|0.064066 light|0.046899 coral|0.046899 salmon|0.041088 medium|0.030637 slate|0.030637 blue|0.030637 dark|0.013809 blue|0.013809  "
		}
	}
}
