{
	"add": {
		"doc": {
			"id": "7252d74c92dcc7b0817d2d6a4103962be9af1bb0d787a8de1a67fe9b5d1d29ad",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Helvetica.svg/220px-Helvetica.svg.png",
				"previous": "Roman, italic, and oblique are also terms used to differentiate between upright and two possible slanted forms of a typeface. Italic and oblique fonts are similar (indeed, oblique fonts are often simply called italics) but there is strictly a difference: italic applies to fonts where the letter forms are redesigned, not just slanted. Almost all serif faces have italic forms; some sans-serif faces have oblique designs. (Most faces do not offer both as this is an artistic choice by the font designer about how the slanted form should look.)[16]",
				"after": "Sans serif (lit. without serif) designs appeared relatively recently in the history of type design. The evolution of the sans serif font very likely stemmed from the slab serif font. The earliest slab serif font, Antique, later renamed Egyptian, designed in 1815 by the English typefounder Vincent Figgins[17] was succeeded one year later by the first sans serif font, created by William Caslon IV. The evidence of this is clearly shown in the uniform strokes in the letter forms. Sans serif fonts are commonly but not exclusively used for display typography such as signage, headings, and other situations demanding legibility above high readability. The text on electronic media offers an exception to print: most web pages and digitized media are laid out in sans serif typefaces because serifs often detract from readability at the low resolution of displays.[citation needed]",
			"color": "black|0.18694 white|0.0704 smoke|0.0704 white|0.06997 snow|0.069423 ghost|0.068717 white|0.068717 mint|0.06804 cream|0.06804 alice|0.067801 blue|0.067801 sea|0.067266 shell|0.067266 azure|0.066053 floral|0.066015 white|0.066015 lavender|0.06107 blush|0.06107 dark|0.027559 gray|0.027559 dark|0.027559 grey|0.027559 dim|0.025994 gray|0.025994 dim|0.025994 grey|0.025994 gray|0.025919 grey|0.025919 silver|0.019431 light|0.015938 gray|0.015938 light|0.015938 grey|0.015938 gainsboro|0.013905 ivory|0.0062318 linen|0.0033335  "
		}
	}
}
