{
	"add": {
		"doc": {
			"id": "7266d721b77b1685881d3fddc61331c27424a7cfa49c614934820f36e1a427b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/London_Tower_%28CherryX%29.jpg/300px-London_Tower_%28CherryX%29.jpg",
			"previous": [],
				"after": "The inner ward was created during Richard the Lionheart's reign, when a moat was dug to the west of the innermost ward, effectively doubling the castle's size.[28][29] Henry III created the ward's east and north walls, and the ward's dimensions remain to this day.[7] Most of Henry's work survives, and only two of the nine towers he constructed have been completely rebuilt.[30] Between the Wakefield and Lanthorn Towers, the innermost ward's wall also serves as a curtain wall for the inner ward.[31] The main entrance to the inner ward would have been through a gatehouse, most likely in the west wall on the site of what is now Beauchamp Tower. The inner ward's western curtain wall was rebuilt by Edward I.[32] The 13th-century Beauchamp Tower marks the first large-scale use of brick as a building material in Britain, since the 5th-century departure of the Romans.[33] The Beauchamp Tower is one of 13 towers that stud the curtain wall. Anti-clockwise from the south-west corner they are: Bell, Beauchamp, Devereux, Flint, Bowyer, Brick, Martin, Constable, Broad Arrow, Salt, Lanthorn, Wakefield, and the Bloody Tower.[31] While these towers provided positions from which flanking fire could be deployed against a potential enemy, they also contained accommodation. As its name suggests, Bell Tower housed a belfry, its purpose to raise the alarm in the event of an attack. The royal bow-maker, responsible for making longbows, crossbows, catapults, and other siege and hand weapons, had a workshop in the Bowyer Tower. A turret at the top of Lanthorn Tower was used as a beacon by traffic approaching the Tower at night.[34]",
			"color": "tan|0.64868 black|0.05264 wheat|0.04058 burly|0.03434 wood|0.03434 dim|0.027731 gray|0.027731 dim|0.027731 grey|0.027731 bisque|0.026733 peach|0.019766 puff|0.019766 blanched|0.01819 almond|0.01819 gray|0.018141 grey|0.018141 antique|0.015582 white|0.015582 papaya|0.012586 whip|0.012586 dark|0.011863 gray|0.011863 dark|0.011863 grey|0.011863  "
		}
	}
}
