{
	"add": {
		"doc": {
			"id": "7268c70eea1977ac71be908037c680f554f70b4d6d64c5236681a0eeea6c5969",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Summit_rim_of_Mount_St._Helens.ogv/220px--Summit_rim_of_Mount_St._Helens.ogv.jpg",
				"previous": "Although Mount St. Helens is in Skamania County, Washington, access routes to the mountain run through Cowlitz County to the west. State Route 504, locally known as the Spirit Lake Memorial Highway, connects with Interstate 5 at Exit 49, 34 miles (55 km) to the west of the mountain. That north–south highway skirts the low-lying cities of Castle Rock, Longview and Kelso along the Cowlitz River, and passes through the Vancouver, Washington–Portland, Oregon metropolitan area less than 50 miles (80 km) to the southwest. The community nearest the volcano is Cougar, Washington, in the Lewis River valley 11 miles (18 km) south-southwest of the peak. Gifford Pinchot National Forest surrounds Mount St. Helens.",
				"after": "During the winter of 1980–1981, a new glacier appeared. Now officially named Crater Glacier, it was formerly known as the Tulutson Glacier. Shadowed by the crater walls and fed by heavy snowfall and repeated snow avalanches, it grew rapidly (14 feet (4.3 m) per year in thickness). By 2004, it covered about 0.36 square miles (0.93 km2), and was divided by the dome into a western and eastern lobe. Typically, by late summer, the glacier looks dark from rockfall from the crater walls and ash from eruptions. As of 2006, the ice had an average thickness of 300 feet (100 m) and a maximum of 650 feet (200 m), nearly as deep as the much older and larger Carbon Glacier of Mount Rainier. The ice is all post–1980, making the glacier very young geologically. However, the volume of the new glacier is about the same as all the pre–1980 glaciers combined.[9][10][11][12][13]",
			"color": "dim|0.40732 gray|0.40732 dim|0.40732 grey|0.40732 dark|0.23637 gray|0.23637 dark|0.23637 grey|0.23637 silver|0.11459 gray|0.089953 grey|0.089953 light|0.076047 slate|0.076047 gray|0.076047 slate|0.048954 gray|0.048954 light|0.015159 gray|0.015159 light|0.015159 grey|0.015159 light|0.0060603 steel|0.0060603 blue|0.0060603 gainsboro|0.0048272  "
		}
	}
}
