{
	"add": {
		"doc": {
			"id": "72738a262b543f47c019d09688f0a8a30898cc61417bdcebe3b340f04d02c131",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Killer_Whale_Tipe_B.jpg/250px-Killer_Whale_Tipe_B.jpg",
				"previous": "Predation by orcas on whale calves in high productivity, high latitude areas has been hypothesised to be the reason for great whale migrations to low productivity tropical waters, ostensibly to reduce the risk of attacks on the highly vulnerable calves due to lower density of orcas in these waters.[127]",
				"after": "Other marine mammal prey species include nearly 20 species of seal, sea lion and fur seal. Walruses and sea otters are less frequently taken. Often, to avoid injury, killer whales disable their prey before killing and eating it. This may involve throwing it in the air, slapping it with their tails, ramming it, or breaching and landing on it.[128] Sea lions are killed by head-butting or after a stunning blow from a tail fluke. In the Aleutian Islands, a decline in sea otter populations in the 1990s was controversially attributed by some scientists to killer whale predation, although with no direct evidence.[129] The decline of sea otters followed a decline in harbour seal and Steller sea lion populations, the killer whale's preferred prey,[b][131] which in turn may be substitutes for their original prey, now decimated by industrial whaling.[132][133][134]",
			"color": "dark|0.13772 gray|0.13772 dark|0.13772 grey|0.13772 dim|0.1121 gray|0.1121 dim|0.1121 grey|0.1121 silver|0.09932 gray|0.092669 grey|0.092669 slate|0.084515 gray|0.084515 light|0.078442 gray|0.078442 light|0.078442 grey|0.078442 light|0.077719 slate|0.077719 gray|0.077719 gainsboro|0.063285 black|0.033188 white|0.029207 smoke|0.029207 sea|0.020261 shell|0.020261 snow|0.019318 alice|0.018909 blue|0.018909 ghost|0.018886 white|0.018886 linen|0.018119 white|0.01583 mint|0.015249 cream|0.015249 floral|0.014842 white|0.014842 lavender|0.012529 blush|0.012529 azure|0.011455 light|0.0050009 steel|0.0050009 blue|0.0050009 old|0.0043717 lace|0.0043717 antique|0.0037708 white|0.0037708 dark|0.0032701 slate|0.0032701 gray|0.0032701  "
		}
	}
}
