{
	"add": {
		"doc": {
			"id": "72740990615c18f53ca1ee38b1ac731c8e59611b3eb9aeceaa5a1061b8eb7a51",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Androulla_Vassiliou2.jpg/220px-Androulla_Vassiliou2.jpg",
			"previous": [],
				"after": "The Commission is primarily based in Brussels, with the President's office and the Commission's meeting room on the 13th floor of the Berlaymont building. The Commission also operates out of numerous other buildings in Brussels and Luxembourg.[70][71] When the Parliament is meeting in Strasbourg, the Commissioners also meet there in the Winston Churchill building to attend the Parliament's debates.[72] The Commission is divided into departments known as Directorates-General (DGs) that can be likened to departments or ministries. Each covers a specific policy area such as Agriculture or Justice and citizens' rights or internal services such as Human Resources and Translation and is headed by Director-General who is responsible to a Commissioner. A Commissioner's portfolio can be supported by numerous DGs, they prepare proposals for them and if approved by a majority of Commissioners it goes forward to Parliament and Council for consideration.[2][73] There has been criticism from a number of people that the highly fragmented DG structure wastes a considerable amount of time in turf wars as the different departments and Commissioners compete with each other. Furthermore the DGs can exercise considerable control over a Commissioner with the Commissioner having little time to learn to assert control over their staff.[74][75]",
			"color": "black|0.32661 dim|0.17334 gray|0.17334 dim|0.17334 grey|0.17334 gray|0.10186 grey|0.10186 dark|0.073945 gray|0.073945 dark|0.073945 grey|0.073945 silver|0.058832 light|0.041486 gray|0.041486 light|0.041486 grey|0.041486 tan|0.034675 gainsboro|0.03307 white|0.01354 smoke|0.01354 linen|0.012763 sea|0.011749 shell|0.011749 snow|0.010241 antique|0.0099794 white|0.0099794 light|0.0093808 steel|0.0093808 blue|0.0093808 ghost|0.0092156 white|0.0092156 alice|0.0086946 blue|0.0086946 white|0.0086238 floral|0.0085387 white|0.0085387 mint|0.0076641 cream|0.0076641 lavender|0.0071345 blush|0.0071345  "
		}
	}
}
