{
	"add": {
		"doc": {
			"id": "729602922ccd541d39425827d5905f2b9ca6aabef7a36b7b39336f4b9398698a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/West_Point_Cadet_walking_the_Area%2C_May_98.jpg/220px-West_Point_Cadet_walking_the_Area%2C_May_98.jpg",
			"previous": [],
				"after": "From the earliest days of the academy, one form of punishment for cadets who commit regulatory infractions has been a process officially known as punishment tours.[219] This process is better known to the cadets as \"hours\" because as punishment, cadets must walk a specified number of hours in retribution. Cadets are \"awarded\" punishment tours based upon the severity of the infraction. Being late to class or having an unkempt room may result in as little as 5 hours while more severe misconduct infractions may result in upwards of 60 to 80 hours. In its most traditional form, punishment tours are \"walked off\" by wearing the dress gray uniform under arms and walking back and forth in a designated area of the cadet barracks courtyard, known as \"Central Area.\" Cadets who get into trouble frequently and spend many weekends \"walking off their hours\" are known as \"area birds.\"[220] Cadets who walk more than 100 total hours in their career are affectionately known as \"Century Men.\"[221] An alternate form of punishment to walking hours is known as \"fatigue tours,\" where assigned hours may be \"worked off\" by manual labor, such as cleaning the barracks. Certain cadets whose academics are deficient may also conduct \"sitting tours,\" where they have to \"sit hours\" in a designated academic room in a controlled study environment, for which they receive half credit towards their reduction of tours. Cadets' uniforms are inspected before their tours begin each day. A small number of cadets may be relieved of their tours that day if their uniforms are exceptionally presentable. Another tradition associated with punishment tours is that any visiting head of state has the authority to grant \"amnesty,\" releasing all cadets with outstanding hours from the remainder of their assigned tours.[222][223]",
			"color": "light|0.19345 gray|0.19345 light|0.19345 grey|0.19345 gainsboro|0.17665 silver|0.14013 white|0.071081 smoke|0.071081 alice|0.062296 blue|0.062296 light|0.054776 steel|0.054776 blue|0.054776 ghost|0.050102 white|0.050102 lavender|0.032855 snow|0.032195 dark|0.028408 gray|0.028408 dark|0.028408 grey|0.028408 lavender|0.025744 blush|0.025744 white|0.023568 sea|0.022221 shell|0.022221 mint|0.019967 cream|0.019967 azure|0.019098 linen|0.017589 floral|0.0083903 white|0.0083903 light|0.0052245 slate|0.0052245 gray|0.0052245 slate|0.0036918 gray|0.0036918 gray|0.0027768 grey|0.0027768  "
		}
	}
}
