{
	"add": {
		"doc": {
			"id": "72cab80fa973b947ea2bef3efbc0b9dd6c9473535742039fd4b492a97468fefd",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e0/Queluz_lightened.jpg/300px-Queluz_lightened.jpg",
				"previous": "The architect, Mateus Vicente de Oliveira, had trained under Ludovice of Ratisbon and Jean Baptiste Robillon[10] during the construction of the royal palace and convent of Mafra. The more sombre and massive classical palace at Mafra does not appear to have influenced the design for Queluz, which is in a lighter, more airy style.[1] Work began in 1747 and continued rapidly until 1755, when it was interrupted by the Great Earthquake of 1755, after which the labourers were more urgently required for the reconstruction of the city. The earthquake proved to be a catalyst, because the urban rebuilding process stimulated the development of the arts in Portugal.[4] The subsequent architecture of Queluz was influenced by new ideas and concepts. When work recommenced in 1758, the design was adapted for fear of another earthquake. Thus the later works take the form of low, long buildings, more structurally stable than a single high block: as a result, viewed from a distance the palace resembles long enfilades linked by higher pavilions rather than one single construction.[11]",
				"after": "The public façade of the palace faces directly onto a town square and takes the form of two low, symmetrical, quadrant wings which flank the forward-reaching wings of a small central corps de logis, thus forming a semi-circular cour d'honneur (see key 1). The southern of the two quadrant wings is terminated by the onion-domed chapel, while the northern wing contained the kitchens and servants' quarters (see keys 2, 1 and 13).[12] The only decoration comes from the simple classical pediments above the windows. This façade, that most readily seen from the town, presents a decorous and impassive public face with one of the most architecturally severe elevations of the palace (see illustration right).",
			"color": "gray|0.35516 grey|0.35516 dim|0.35466 gray|0.35466 dim|0.35466 grey|0.35466 dark|0.052065 gray|0.052065 dark|0.052065 grey|0.052065 dark|0.043324 slate|0.043324 gray|0.043324 silver|0.034464 tan|0.026451 olive|0.015898 rosy|0.012839 brown|0.012839 antique|0.011406 white|0.011406 light|0.011044 gray|0.011044 light|0.011044 grey|0.011044  "
		}
	}
}
