{
	"add": {
		"doc": {
			"id": "72ce2cd06467ec9f03b07772402923c059521ef09944506c232cb4d236fb87c2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Faucon_pelerin_7_mai.jpg/220px-Faucon_pelerin_7_mai.jpg",
				"previous": "The peregrine falcon hunts most often at dawn and dusk, when prey are most active, but also nocturnally in cities, particularly during migration periods when hunting at night may become prevalent. Nocturnal migrants taken by peregrines include species as diverse as yellow-billed cuckoo, black-necked grebe, virginia rail, and common quail.[59] The peregrine requires open space in order to hunt, and therefore often hunts over open water, marshes, valleys, fields, and tundra, searching for prey either from a high perch or from the air.[61] Large congregations of migrants, especially species that gather in the open like shorebirds, can be quite attractive to hunting peregrines. Once prey is spotted, it begins its stoop, folding back the tail and wings, with feet tucked.[19] Prey is typically struck and captured in mid-air; the peregrine falcon strikes its prey with a clenched foot, stunning or killing it with the impact, then turns to catch it in mid-air.[61] If its prey is too heavy to carry, a peregrine will drop it to the ground and eat it there. If they miss the initial strike, peregrines will chase their prey in a twisting flight.[62] Although previously thought rare, several cases of peregrines contour-hunting, i.e. using natural contours to surprise and ambush prey on the ground, have been reported and even rare cases of prey being pursued on foot. In addition, peregrines have been documented preying on chicks in nests, from birds such as kittiwakes.[63] Prey is plucked before consumption.[48]",
				"after": "The peregrine falcon is sexually mature at one to three years of age, but in healthy populations they breed after two to three years of age. A pair mates for life and returns to the same nesting spot annually. The courtship flight includes a mix of aerial acrobatics, precise spirals, and steep dives.[15] The male passes prey it has caught to the female in mid-air. To make this possible, the female actually flies upside-down to receive the food from the male's talons.",
			"color": "tan|0.46894 wheat|0.070386 dim|0.059695 gray|0.059695 dim|0.059695 grey|0.059695 burly|0.058727 wood|0.058727 bisque|0.04014 antique|0.037749 white|0.037749 blanched|0.035339 almond|0.035339 papaya|0.031019 whip|0.031019 peach|0.025782 puff|0.025782 beige|0.019283 corn|0.018493 silk|0.018493 moccasin|0.018175 old|0.016819 lace|0.016819 linen|0.015607 navajo|0.013931 white|0.013931  "
		}
	}
}
