{
	"add": {
		"doc": {
			"id": "72eea206a6181deef529239bf007ab1fa188160e18c2645e497819bfbe050d69",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Handfor_ERDF_Grand_Opening.jpg/220px-Handfor_ERDF_Grand_Opening.jpg",
				"previous": "The most significant challenge at Hanford is stabilizing the 53 million U.S. gallons (204,000 m3) of high-level radioactive waste stored in 177 underground tanks. As of 1998 about a third of these tanks had leaked waste into the soil and groundwater.[76] As of 2008[update], most of the liquid waste has been transferred to more secure double-shelled tanks; however, 2.8 million U.S. gallons (10,600 m3) of liquid waste, together with 27 million U.S. gallons (100,000 m3) of salt cake and sludge, remains in the single-shelled tanks.[4] DOE lacks information about the extent to which the 27 double-shell tanks may be susceptible to corrosion. Without determining the extent to which the factors that contributed to the leak in AY-102 were similar to the other 27 double-shell tanks, DOE cannot be sure how long its double-shell tanks can safely store waste.[6] That waste was originally scheduled to be removed by 2018. As of 2008[update], the revised deadline was 2040.[74] Nearby aquifers contain an estimated 270 billion U.S. gallons (1 billion m3) of contaminated groundwater as a result of the leaks.[77] As of 2008[update], 1 million U.S. gallons (4,000 m3) of highly[clarification needed] radioactive waste is traveling through the groundwater toward the Columbia River. This waste is expected to reach the river in 12 to 50 years if cleanup does not proceed on schedule.[4] The site includes 25 million cubic feet (710,000 m3) of solid radioactive waste.[77]",
				"after": "Under the Tri-Party Agreement, lower-level hazardous wastes are buried in huge lined pits that will be sealed and monitored with sophisticated instruments for many years. Disposal of plutonium and other high-level wastes is a more difficult problem that continues to be a subject of intense debate. As an example, plutonium has a half-life of 24,100 years, and a decay of ten half-lives is required before a sample is considered to cease its radioactivity.[78][79] In 2011 the Department of Energy started building a vitrification plant to combine the dangerous wastes with glass to render them stable. Bechtel, a San Francisco-based construction and engineering firm, has been hired to construct the vitrification plant. It was originally scheduled to be operational by 2011, with vitrification completed by 2028.[74][80][81] As of 2012, according to a study by the General Accounting Office, there were a number of serious unresolved technical and managerial problems.[82] As of 2013[update] estimated costs were $13.4 billion with commencement of operations estimated to be in 2022 and about 3 decades of operation.[83]",
			"color": "dark|0.25846 gray|0.25846 dark|0.25846 grey|0.25846 black|0.25015 silver|0.12421 gray|0.11362 grey|0.11362 dim|0.11256 gray|0.11256 dim|0.11256 grey|0.11256 light|0.035205 gray|0.035205 light|0.035205 grey|0.035205 gainsboro|0.018663 burly|0.016137 wood|0.016137 tan|0.015794 peach|0.0068323 puff|0.0068323 antique|0.0046908 white|0.0046908 bisque|0.0045508  "
		}
	}
}
