{
	"add": {
		"doc": {
			"id": "72f18ba05603a71a25bdbeb9e76ac52410315a8566438f14048633d70ff5beab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Seattle_Skyline-.jpg/220px-Seattle_Skyline-.jpg",
				"previous": "Seattle remained the corporate headquarters of Boeing until 2001, when the company separated its headquarters from its major production facilities; the headquarters were moved to Chicago.[41] The Seattle area is still home to Boeing's Renton narrow-body plant (where the 707, 720, 727, and 757 were assembled, and the 737 is assembled today) and Everett wide-body plant (assembly plant for the 747, 767, 777, and 787). The company's credit union for employees, BECU, remains based in the Seattle area, though it is now open to all residents of Washington.",
				"after": "As prosperity began to return in the 1980s, the city was stunned by the Wah Mee massacre in 1983, when 13 people were killed in an illegal gambling club in the International District, Seattle's Chinatown.[42] Beginning with Microsoft's 1979 move from Albuquerque, New Mexico to nearby Bellevue, Washington,[43] Seattle and its suburbs became home to a number of technology companies including Amazon.com, RealNetworks, Nintendo of America, McCaw Cellular (now part of AT&T Mobility), VoiceStream (now T-Mobile), and biomedical corporations such as HeartStream (later purchased by Philips), Heart Technologies (later purchased by Boston Scientific), Physio-Control (later purchased by Medtronic), ZymoGenetics, ICOS (later purchased by Eli Lilly and Company) and Immunex (later purchased by Amgen). This success brought an influx of new residents with a population increase within city limits of almost 50,000 between 1990 and 2000,[44] and saw Seattle's real estate become some of the most expensive in the country.[45] Many of the Seattle area's tech companies remain relatively strong, but the frenzied dot-com boom years ended in early 2001.[46][47]",
			"color": "dim|0.18338 gray|0.18338 dim|0.18338 grey|0.18338 light|0.1737 steel|0.1737 blue|0.1737 dark|0.12427 gray|0.12427 dark|0.12427 grey|0.12427 gray|0.11483 grey|0.11483 slate|0.091054 gray|0.091054 silver|0.066123 light|0.045244 slate|0.045244 gray|0.045244 light|0.039321 gray|0.039321 light|0.039321 grey|0.039321 gainsboro|0.030833 black|0.02277 white|0.013804 smoke|0.013804 alice|0.013466 blue|0.013466 lavender|0.01276 ghost|0.012143 white|0.012143 azure|0.0086765 snow|0.0074153 white|0.0065068 mint|0.0059069 cream|0.0059069  "
		}
	}
}
