{
	"add": {
		"doc": {
			"id": "7301bb0a303ed76fa63c7e41a5e9e5638681deae721a6ee074aa1dc458949e77",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Nef_cath%C3%A9drale_Laon.jpg/220px-Nef_cath%C3%A9drale_Laon.jpg",
				"previous": "Romanesque art, especially metalwork, was at its most sophisticated in Mosan art, in which distinct artistic personalities including Nicholas of Verdun (d. 1205) become apparent, and an almost classical style is seen in works such as a font at Liège,[238] contrasting with the writhing animals of the exactly contemporary Gloucester Candlestick. Large illuminated bibles and psalters were the typical forms of luxury manuscripts, and wall-painting flourished in churches, often following a scheme with a Last Judgement on the west wall, a Christ in Majesty at the east end, and narrative biblical scenes down the nave, or in the best surviving example, at Saint-Savin-sur-Gartempe, on the barrel-vaulted roof.[239]",
				"after": "From the early 12th century, French builders developed the Gothic style, marked by the use of rib vaults, pointed arches, flying buttresses, and large stained glass windows. It was used mainly in churches and cathedrals, and continued in use until the 16th century in much of Europe. Classic examples of Gothic architecture include Chartres Cathedral and Reims Cathedral in France as well as Salisbury Cathedral in England.[240] Stained glass became a crucial element in the design of churches, which continued to use extensive wall-paintings, now almost all lost.[241]",
			"color": "dim|0.38657 gray|0.38657 dim|0.38657 grey|0.38657 gray|0.21516 grey|0.21516 black|0.15364 dark|0.080909 gray|0.080909 dark|0.080909 grey|0.080909 silver|0.025468 slate|0.01821 gray|0.01821 light|0.013934 gray|0.013934 light|0.013934 grey|0.013934 light|0.013556 slate|0.013556 gray|0.013556 gainsboro|0.0096361 linen|0.0079915 sea|0.0071875 shell|0.0071875 floral|0.0069001 white|0.0069001 white|0.0068222 smoke|0.0068222 snow|0.0059843 mint|0.0057993 cream|0.0057993 ivory|0.0055457 old|0.0052894 lace|0.0052894 white|0.0052728  "
		}
	}
}
