{
	"add": {
		"doc": {
			"id": "730db335285bb914542a3774350bd7496a55d819f1cd4af6bdc91cf91379b832",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Irakli_Gharibashvili._2013.jpg/220px-Irakli_Gharibashvili._2013.jpg",
				"previous": "Legislative authority is vested in the Parliament of Georgia. It is unicameral and has 150 members, known as deputies, of whom 75 are elected by plurality to represent single-member district, and 75 are chosen to represent parties by proportional representation. Members of parliament are elected for four-year terms. Five parties and electoral blocs had representatives elected to the parliament in the 2008 elections: the United National Movement (governing party), The Joint Opposition, the Christian-Democrats, the Labour Party and Republican Party.[citation needed] On 26 May 2012, Saakashvili inaugurated a new Parliament building in the western city of Kutaisi, in an effort to decentralise power and shift some political control closer to Abkhazia.[91]",
				"after": "Although considerable progress was made since the Rose revolution, former President Mikheil Saakashvili stated in 2008 that Georgia is still not a \"full-fledged, very well-formed, crystalized society.\"[92] The political system remains in the process of transition, with frequent adjustments to the balance of power between the President and Parliament, and opposition proposals ranging from transforming the country into parliamentary republic to re-establishing the monarchy.[93][94] Observers note the deficit of trust in relations between the Government and the opposition.[95]",
			"color": "black|0.2122 rosy|0.13257 brown|0.13257 gainsboro|0.050044 white|0.045769 smoke|0.045769 gray|0.042958 grey|0.042958 alice|0.040383 blue|0.040383 light|0.039017 gray|0.039017 light|0.039017 grey|0.039017 ghost|0.038443 white|0.038443 snow|0.03486 azure|0.031429 white|0.030771 mint|0.029698 cream|0.029698 light|0.028069 pink|0.028069 dark|0.02726 gray|0.02726 dark|0.02726 grey|0.02726 pink|0.027076 sea|0.022225 shell|0.022225 lavender|0.021372 blush|0.021372 dim|0.018694 gray|0.018694 dim|0.018694 grey|0.018694 silver|0.018106 floral|0.01511 white|0.01511 dark|0.01511 slate|0.01511 gray|0.01511  "
		}
	}
}
