{
	"add": {
		"doc": {
			"id": "730e32cff43a2e1d37088db8b433217620cd8a87b10ddb081cb9784ec80ac49b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Reuters_Building.jpg/220px-Reuters_Building.jpg",
			"previous": [],
				"after": "Reuters's journalistic objectivism has been questioned when Reuters commented on the possible insensitivity of its non-use of the word terrorist in reports, including the 11 September attacks. Reuters has been careful to use the word terrorist only in quotes, whether quotations or scare quotes. Reuters global news editor Stephen Jukes wrote, \"We all know that one man's terrorist is another man's freedom fighter, and that Reuters upholds the principle that we do not use the word terrorist.\" The Washington Post media critic Howard Kurtz responded, \"After the 1995 Oklahoma City bombing, and again after the attacks on the World Trade Center and Pentagon, Reuters allowed the events to be described as acts of terror. But as of last week, even that terminology is banned.\" Reuters later apologised for what they described as \"the insensitive manner\" in which they characterized their policy and said their policy is \"to avoid the use of emotional terms and not make value judgments concerning the facts we attempt to report accurately and fairly\".[11]",
			"color": "black|0.31082 steel|0.22881 blue|0.22881 dim|0.045117 gray|0.045117 dim|0.045117 grey|0.045117 light|0.029717 slate|0.029717 gray|0.029717 dark|0.027898 gray|0.027898 dark|0.027898 grey|0.027898 gray|0.027784 grey|0.027784 slate|0.027645 gray|0.027645 silver|0.021315 light|0.018435 gray|0.018435 light|0.018435 grey|0.018435 white|0.017586 smoke|0.017586 gainsboro|0.015878 snow|0.015796 ghost|0.015258 white|0.015258 white|0.015242 alice|0.014947 blue|0.014947 lavender|0.014864 sea|0.013554 shell|0.013554 mint|0.013275 cream|0.013275 light|0.013105 steel|0.013105 blue|0.013105 floral|0.012283 white|0.012283 azure|0.011872 lavender|0.011201 blush|0.011201 saddle|0.0079869 brown|0.0079869 light|0.0066697 blue|0.0066697 ivory|0.0063389 linen|0.0062061  "
		}
	}
}
