{
	"add": {
		"doc": {
			"id": "7312658c9aaa548819d42145e92f4fe8e886849a33caa437a4f50f57b65abab0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Green_Sea_Turtle_Biscayne.jpg/220px-Green_Sea_Turtle_Biscayne.jpg",
			"previous": [],
				"after": "Beyond the keys in the Atlantic Ocean the seafloor slopes gradually down before rising in an almost continuous coral reef. The reef, composed of living corals, is inhabited by more than 200 species of fish, as well as molluscs, crustaceans and worms.[71] Every coral species in park waters is considered protected by either federal or state regulations.[117] Coral reefs are estimated to cover about half the area of the park, with about 4000 individual patch reefs and areas of bank-barrier reef.[118] Hundreds of species of hard and soft corals, sea anemones and sponges are found in bay and offshore waters.[119] The coral reefs may themselves be subdivided into the outer reef on the edge of the Florida carbonate platform, the patch reefs between the outer reef and the keys, and the reefs in the shoals on either side of the keys. The offshore reefs are dominated by elkhorn coral to 10-meter (33 ft) water depth, and staghorn coral below 10 meters. The landward patch reefs are principally composed of boulder star coral and symmetrical brain coral. The island shoal reefs mainly consist of lesser starlet coral and Porites finger corals.[120]",
			"color": "dark|0.21342 slate|0.21342 gray|0.21342 silver|0.19309 dark|0.15389 gray|0.15389 dark|0.15389 grey|0.15389 light|0.14011 gray|0.14011 light|0.14011 grey|0.14011 gainsboro|0.092969 cadet|0.039741 blue|0.039741 teal|0.028792 white|0.018061 smoke|0.018061 gray|0.014361 grey|0.014361 alice|0.0098218 blue|0.0098218 ghost|0.0090674 white|0.0090674 linen|0.0085031 sea|0.0083449 shell|0.0083449 snow|0.0082378 lavender|0.008216 blush|0.008216 dim|0.0074587 gray|0.0074587 dim|0.0074587 grey|0.0074587 dark|0.0074233 cyan|0.0074233 white|0.0061317 mint|0.0055287 cream|0.0055287  "
		}
	}
}
