{
	"add": {
		"doc": {
			"id": "7315b54e726af4e0ab77b81759a70a308efc652f068d3fb7e4d2dcbbd5122690",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Pen_ts%27ao%2C_woodblock_book_1249-ce.png/220px-Pen_ts%27ao%2C_woodblock_book_1249-ce.png",
				"previous": "Printing technology in the form of movable type was invented by Bi Sheng (毕升; 990–1051) in the 11th century. The work of Bi Sheng was written of by Shen Kuo in his Dream Pool Essays (Mengxi Bitan).[36] Movable type, alongside woodblock printing, increased literacy with the mass production of printed materials. This meant that parents could encourage sons to learn to read and write and therefore be able to take the imperial examination and become part of the growing learned bureaucracy. Movable type printing was further advanced in Joseon era Korea, where Bi Sheng's baked clay characters were scrapped for metal type characters in 1234.[37] The movable type of Bi Sheng was later improved upon by Wang Zhen (1290–1333), who invented wooden movable type c. 1298, and Hua Sui (1439–1513), who invented bronze movable type in China in 1490; yet the Koreans had metal movable type before Hua Sui, and even Wang Zhen had experimented with tin-metal movable type.[38] Although movable type and woodblock printing would remain the dominant types of printing methods for centuries, the European printing press (employing the Hellenistic screw-press) was eventually adopted by East Asian countries.",
				"after": "For printing, the mass production of paper for writing was already well established in China. The papermaking process had been perfected and standardized by the Han dynasty court eunuch Cai Lun (50–121) in 105, and was in widespread use for writing even by the 3rd century.[39] The Song dynasty was the world's first government in history to issue paper-printed money—the banknote (see Jiaozi and Huizi).[40] Toilet paper had been in general use in China since the 6th century,[41] paper bags for preserving the flavor of tea leaves by the 7th century,[41] and by the Song dynasty government officials who had done a great service were rewarded by the court with gifts of paper-printed money wrapped in paper envelopes.[41] During the Song dynasty, independent and government sponsored industries were developed to meet the needs of a growing population that had reached over 100 million. For example, for the printing of paper money alone, the Song court established several government-run mints and factories in the cities of Huizhou, Chengdu, Hangzhou, and Anqi.[42] The size of the workforce employed in these paper money factories was quite large, as it was recorded in 1175 that the factory at Hangzhou alone employed more than a thousand workers a day.[42]",
			"color": " "
		}
	}
}
