{
	"add": {
		"doc": {
			"id": "7316c1e981556a74840317b8515af2906d433d8fc8bde0470fd6ad109864b593",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5a/Anachronox_gameplay.jpg/220px-Anachronox_gameplay.jpg",
				"previous": "Anachronox is a turn-based role-playing game similar in nature to many Japanese role-playing video games like Final Fantasy. The player controls a party of up to three characters as they explore a 3D environment (colloquially known as a \"field map\") of futuristic cities, space vessels, and outdoor areas.[2] Players can swap for new party members, talk to non-player characters, and collect and shop for equipment and items. When players near an interactive character or item, a floating arrow-shaped electronic device called the LifeCursor appears, which lets the player click on the person or item.[2] After a certain point in the story, players can travel by shuttle to other planets, triggering cutscenes of the shuttle trips. Each playable character has a unique skill, such as lockpicking, which may be used to solve puzzles.[2] Some sequences involve minigames, such as an unnamed mission in which the player pilots a fighter spaceship to destroy enemies with lasers. Certain field maps also feature simple two-dimensional minigames, including the original games Ox and Bugaboo.[2] The protagonist Boots also possesses a camera, which the player can use to take screenshots for their own enjoyment or as part of quest objectives.[2]",
				"after": "Enemy encounters trigger a combat mode. As in Chrono Trigger, enemies are openly visible on field maps or lie in wait to ambush the party and thus are not random.[3] Similar to Final Fantasy‍ '​s Active Time Battle, each character has a meter that gradually fills with time.[2] When the meter is full, characters can physically attack enemies, use MysTech magic, unleash BattleSkill attacks, use items, move to a different position, or use a nearby object to attack, if present.[2] For playable characters and computer-controlled enemies, each attack has their number of hit points (a numerically based life bar) get reduced, which can be restored through healing items or MysTech slags. Use of MysTech and equippable shield cells require Neutron-Radiated Glodents (NRG), a separate energy reserve displayed beneath a character's life bar.[2] NRG is replenished through certain items. Use of BattleSkills require Bouge, a third bar beneath NRG that automatically fills with time; players can use different BattleSkills depending on how full the Bouge bar is.[2] Some characters must undergo certain plot developments to unlock their BattleSkills. When a playable character loses all hit points, he or she faints. If all the player's characters fall in battle, the game ends and must be restored from a previously saved game. Winning battles earns experience points and raises characters' levels, granting them improved statistics.[2] These statistics can be viewed through the status screen, which displays important character information and current quests. Unlike many other RPGs, Anachronox displays a character's attributes with qualitative descriptors (such as Poor and Excellent) instead of integers.[2]",
			"color": "dark|0.52591 slate|0.52591 gray|0.52591 black|0.26905 dim|0.038677 gray|0.038677 dim|0.038677 grey|0.038677  "
		}
	}
}
