{
	"add": {
		"doc": {
			"id": "7317066e716bb229b43162faf9960459d04e924d81f73e1d8413679cea8bba71",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/db/Chikkamagalur_Amritheswara_navaranga_retouched.JPG/170px-Chikkamagalur_Amritheswara_navaranga_retouched.JPG",
				"previous": "The mantapa is the hall where groups of people gather during prayers. The entrance to the mantapa normally has a highly ornate overhead lintel called a makaratorana (makara is an imaginary beast and torana is an overhead decoration).[16] The open mantapa which serves the purpose of an outer hall (outer mantapa) is a regular feature in larger Hoysala temples leading to an inner small closed mantapa and the shrine(s). The open mantapas have seating areas made of stone with the mantapa's parapet wall acting as a back rest. The seats may follow the same staggered square shape of the parapet wall. The open mantapa is the largest part of the temple and is the place supporting larger congregations of people. The ceiling here is supported by numerous pillars that create many bays.[20] The shape of the open mantapa is best described as staggered-square and is the style used in most Hoysala temples.[21] Even the smallest open mantapa has 13 bays. The walls have parapets that have half pillars supporting the outer ends of the roof which allow plenty of light making all the sculptural details visible. The mantapa ceiling is generally ornate with sculptures, both mythological and floral. The ceiling consists of deep and domical surfaces and contains sculptural depictions of banana bud motifs and other such decorations.[22] The Amruteswara temple in Chikmagalur district has forty-eight domes in the mahamantapa (\"great open hall\").",
				"after": "If the temple is small it will consist of only a closed mantapa (enclosed with walls extending all the way to the ceiling) and the shrine. The closed mantapa, well decorated inside and out, is larger than the vestibule connecting the shrine and the mantapa and has four lathe-turned pillars to support the ceiling, which may be deeply domed. The four pillars divide the hall into nine bays. The nine bays result in nine finely decorated ceilings.[23] Pierced stone latticework screens placed between pillars to filter the light is a characteristic Hoysala stylistic element.",
			"color": "tan|0.13757 gray|0.12094 grey|0.12094 dark|0.10298 gray|0.10298 dark|0.10298 grey|0.10298 dim|0.10002 gray|0.10002 dim|0.10002 grey|0.10002 silver|0.071621 antique|0.043814 white|0.043814 light|0.037994 gray|0.037994 light|0.037994 grey|0.037994 bisque|0.033652 wheat|0.032676 blanched|0.02798 almond|0.02798 papaya|0.026073 whip|0.026073 gainsboro|0.022683 peach|0.02086 puff|0.02086 linen|0.020227 old|0.0181 lace|0.0181 beige|0.017487 black|0.017277 sea|0.01542 shell|0.01542 floral|0.01491 white|0.01491 corn|0.013858 silk|0.013858 white|0.011277 smoke|0.011277 ivory|0.01078 snow|0.01023 white|0.0086523 mint|0.008427 cream|0.008427  "
		}
	}
}
