{
	"add": {
		"doc": {
			"id": "73298f2504ae45d2a3a3acb923bf8ce7fbf7e8ff8c4a4f8f274a40487f46d12b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Ciconia_ciconia_-_01.jpg/220px-Ciconia_ciconia_-_01.jpg",
				"previous": "The white stork is a large bird. It has a length of 100–115 cm (39–45 in),[nb 1][15] and a standing height of 100–125 cm (39–49 in). The wingspan is 155–215 cm (61–85 in) and its weight is 2.3–4.5 kg (5.1–9.9 lb).[16][17] Like all storks, it has long legs, a long neck and a long straight pointed beak.[11] The sexes are identical in appearance, except that males are larger than females on average.[8] The plumage is mainly white with black flight feathers and wing coverts; the black is caused by the pigment melanin.[18] The breast feathers are long and shaggy forming a ruff which is used in some courtship displays.[19] The irises are dull brown or grey, and the peri-orbital skin is black. The adult has a bright red beak and red legs,[8] the colouration of which is derived from carotenoids in the diet. In parts of Spain, studies have shown that the pigment is based on astaxanthin obtained from an introduced species of crayfish (Procambarus clarkii) and the bright red beak colours show up even in nestlings, in contrast to the duller beaks of young white storks elsewhere.[20]",
				"after": "As with other storks, the wings are long and broad enabling the bird to soar.[21] In flapping flight its wingbeats are slow and regular. It flies with its neck stretched forward and with its long legs extended well beyond the end of its short tail. It walks at a slow and steady pace with its neck upstretched. In contrast, it often hunches its head between its shoulders when resting.[22] Moulting has not been extensively studied, but appears to take place throughout the year, with the primary flight feathers replaced over the breeding season.[19]",
			"color": "corn|0.37733 flower|0.37733 blue|0.37733 light|0.23442 steel|0.23442 blue|0.23442 black|0.13555 steel|0.051288 blue|0.051288 dark|0.034234 gray|0.034234 dark|0.034234 grey|0.034234 silver|0.027653 light|0.019805 gray|0.019805 light|0.019805 grey|0.019805 dim|0.01682 gray|0.01682 dim|0.01682 grey|0.01682 gray|0.01653 grey|0.01653  "
		}
	}
}
