{
	"add": {
		"doc": {
			"id": "732a1d2713976d275e29ad8927f8609a70266ed334ee844fa6ac07b773441c12",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/US_Navy_021107-N-2794R-002_KC-10_%5Eldquo%2CExtender%5Erdquo%2C_refuels_a_F-A-18C_%5Eldquo%2CHornet%5Erdquo.jpg/220px-US_Navy_021107-N-2794R-002_KC-10_%5Eldquo%2CExtender%5Erdquo%2C_refuels_a_F-A-18C_%5Eldquo%2CHornet%5Erdquo.jpg",
				"previous": "The KC-10 Extender first flew on 12 July 1980, but it was not until October the same year that the first aerial refuel sortie was performed.[6][7] The design for the KC-10 involved modifications from the DC-10-30CF design. Unnecessary airline features were replaced by an improved cargo-handling system and military avionics.[8] Meanwhile, the KC-10 retains 88% commonality with its commercial counterparts, giving it greater access to the worldwide commercial support system.[4] Other changes from the DC-10-30CF include the removal of most windows and lower cargo doors.[9] Early aircraft featured a distinctive light gray, white and blue paint scheme, but a gray-green camouflage scheme was used on later tankers. The paint scheme was switched to a medium gray color by the late 1990s.[10]",
				"after": "The most notable changes were the addition of the McDonnell Douglas Advanced Aerial Refueling Boom (AARB) and additional fuel tanks located in the baggage compartments below the main deck. The extra tanks increase the KC-10's fuel capacity to 356,000 lb (161,478 kg), nearly doubling the KC-135's capacity.[6] The KC-10 has both a centerline refueling boom — unique in that it sports a control surface system at its aft end that differs from the V-tail design used on previous tankers — and a drogue-and-hose system on the starboard side of the rear fuselage. The KC-10 boom operator is located in the rear of the aircraft with wide window for monitoring refueling. The operator controls refueling operations through a digital fly-by wire system.[1][10][11] Unlike the KC-135, the KC-10's hose-and-drogue system allows refueling of Navy, Marine Corps, and most allied aircraft, all in one mission.[6] The final twenty KC-10s produced included wing-mounted pods for added refueling locations.[2] In addition to its tanking role, the KC-10 can carry a complement 75 personnel with 146,000 lb (66,225 kg) of cargo, or 170,000 lb (77,110 kg) in an all-cargo configuration.[6] The KC-10 has a side cargo door for loading and unloading cargo. Handling equipment is required to raise and lower loads to the cargo opening.",
			"color": "gainsboro|0.12657 light|0.11313 gray|0.11313 light|0.11313 grey|0.11313 white|0.06866 smoke|0.06866 light|0.055696 blue|0.055696 alice|0.053008 blue|0.053008 ghost|0.051468 white|0.051468 snow|0.048168 sea|0.047938 shell|0.047938 linen|0.045713 silver|0.043723 powder|0.043607 blue|0.043607 black|0.040796 white|0.038359 floral|0.037072 white|0.037072 lavender|0.033763 blush|0.033763 mint|0.032311 cream|0.032311 azure|0.020895 lavender|0.019048 light|0.014998 steel|0.014998 blue|0.014998 old|0.011954 lace|0.011954 dim|0.011819 gray|0.011819 dim|0.011819 grey|0.011819 gray|0.010584 grey|0.010584 dark|0.0092431 gray|0.0092431 dark|0.0092431 grey|0.0092431 ivory|0.0073288 light|0.0034447 cyan|0.0034447 sky|0.0030314 blue|0.0030314  "
		}
	}
}
