{
	"add": {
		"doc": {
			"id": "733bb842c91128ca70af4d0cd8222818cf730159957c30e2a82a8707a4e77d88",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Ovidiu03.jpg/170px-Ovidiu03.jpg",
			"previous": [],
				"after": "In the traditional literary canon, literature under Augustus, along with that of the late Republic, has been viewed as the \"Golden Age\" of Latin literature, embodying the classical ideals of \"unity of the whole, the proportion of the parts, and the careful articulation of an apparently seamless composition.\"[528] The three most influential Classical Latin poets—Vergil, Horace, and Ovid—belong to this period. Vergil wrote the Aeneid, creating a national epic for Rome in the manner of the Homeric epics of Greece. Horace perfected the use of Greek lyric meters in Latin verse. Ovid's erotic poetry was enormously popular, but ran afoul of the Augustan moral programme; it was one of the ostensible causes for which the emperor exiled him to Tomis (present-day Constanţa, Romania), where he remained to the end of his life. Ovid's Metamorphoses was a continuous poem of fifteen books weaving together Greco-Roman mythology from the creation of the universe to the deification of Julius Caesar. Ovid's versions of Greek myths became one of the primary sources of later classical mythology, and his work was so influential in the Middle Ages that the 12th and 13th centuries have been called the \"Age of Ovid.\"[529]",
			"color": "light|0.22376 slate|0.22376 gray|0.22376 light|0.17432 steel|0.17432 blue|0.17432 slate|0.15852 gray|0.15852 dark|0.056357 gray|0.056357 dark|0.056357 grey|0.056357 dim|0.034458 gray|0.034458 dim|0.034458 grey|0.034458 silver|0.032709 steel|0.032357 blue|0.032357 gainsboro|0.030708 light|0.030031 gray|0.030031 light|0.030031 grey|0.030031 gray|0.024158 grey|0.024158 alice|0.022999 blue|0.022999 lavender|0.02285 white|0.021171 smoke|0.021171 ghost|0.01798 white|0.01798 light|0.013919 blue|0.013919 azure|0.013815 snow|0.01339 black|0.012535 white|0.01199 mint|0.011802 cream|0.011802 sea|0.0092136 shell|0.0092136 lavender|0.0075488 blush|0.0075488 floral|0.007527 white|0.007527  "
		}
	}
}
