{
	"add": {
		"doc": {
			"id": "733cde4fdbd7afc166c6310b2f89b89be4e375b1186a8562096e7fa04494da5c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Banksia_aquilonia_RBG2.jpg/220px-Banksia_aquilonia_RBG2.jpg",
			"previous": [],
				"after": "Banksia aquilonia grows as a tall shrub or small tree up to 8 m (26 ft) high,[2] though plants up to 15 m (49 ft) have been recorded.[3] It has hard, fissured, grey bark, and narrow elliptic or lanceolate leaves measuring 5–20 cm (2.0–7.9 in) long by 0.6–1.2 cm (0.2–0.5 in) wide with entire (straight) margins and acute tips. They are a smooth shiny green above and white below with a prominent midrib covered in red-brown hair.[4] The brownish new growth appears in summer.[3] The plant is in bloom from March to June. Flowers occur in Banksia's characteristic vertical flower spike, an inflorescence made up of hundreds of pairs of flowers densely packed in a spiral around a woody axis. B. aquilonia's flower spike is a pale yellow colour, roughly cylindrical, 6–10 cm (2.4–3.9 in) high,[2] and up to 6 cm (2.4 in) in diameter. The tubular perianths of the individual flowers are 2.5–2.9 cm (0.98–1.14 in) long.[5] These open at maturity (anthesis) to release the styles. All old flower parts fall away as up to 50 oval follicles develop on the bare woody spike. The follicles measure 0.8–1.2 cm (0.3–0.5 in) long, 0.5–0.9 cm (0.20–0.35 in) high, and 0.4–0.5 cm (0.16–0.20 in) wide. Furry at first, they become smooth with age and open when ripe,[2] and their two half-oval valves split to release the one or two seeds they contain.[4] The obovate dark grey-brown to black seeds sandwich a woody separator. Measuring 1.4–1.6 cm (0.6–0.6 in) long, they are made up of a wedge-shaped seed body, 0.8–1 cm (0.3–0.4 in) long by 0.2–0.3 cm (0.08–0.1 in) wide.[2] The woody separator is the same shape as the seed, with an impression where the seed body lies next to it.[4] Seedlings have bright obovate green cotyledons around 1 cm (0.39 in) long.[5] Juvenile leaves are narrower, measuring 7–24 cm (2.8–9.4 in) long and 0.6–2.1 cm (0.2–0.8 in) wide, and often have serrate (toothed) margins.[4]",
			"color": "dim|0.19806 gray|0.19806 dim|0.19806 grey|0.19806 gray|0.17279 grey|0.17279 dark|0.16811 gray|0.16811 dark|0.16811 grey|0.16811 dark|0.14556 sea|0.14556 green|0.14556 silver|0.092354 light|0.053893 gray|0.053893 light|0.053893 grey|0.053893 gainsboro|0.034524 lavender|0.022317 dark|0.017489 olive|0.017489 green|0.017489 rosy|0.011147 brown|0.011147 dark|0.010299 khaki|0.010299 slate|0.0098617 gray|0.0098617  "
		}
	}
}
