{
	"add": {
		"doc": {
			"id": "7344ca5ca172f3a9973dce4109b1df2612ea85d7ca111291fac62e8eae67d1cb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Neer_Dosa.jpg/220px-Neer_Dosa.jpg",
				"previous": "Most of the popular Indian festivals are celebrated in the city, the most important being Dasara, Diwali, Christmas, Easter, Eid, and Ganesh Chaturthi. Kodial Theru, also known as Mangaluru Rathotsava (Mangalore Car Festival) is a festival unique to the Goud Saraswat Brahmin community, and is celebrated at the Sri Venkatramana Temple.[112][113] The Mangalorean Catholics community's unique festivals include Monti Fest (Mother Mary's feast), which celebrates the Nativity feast and the blessing of new harvests.[114] The Jain Milan, a committee comprising Jain families of Mangalore, organises the Jain food festival annually,[115] while festivals such as Mosaru Kudike, which is part of Krishna Janmashtami festival, is celebrated by the whole community.[116] Aati, a festival worshiping Kalanja, a patron spirit of the city, occurs during the Aashaadha month of Hindu calendar. Festivals such as Karavali Utsav and Kudlostava are highlighted by national and state-level performances in dance, drama and music.[117] Bhuta Kola (spirit worship), is usually performed by the Tuluva community at night. Nagaradhane (snake worship) is performed in the city in praise of Naga Devatha (the serpent king), who is said to be the protector of all snakes.[118] An ancient ritual associated with the 'daivasthanams' (temples) in rural areas, Hindu kori katta,[119][120] a religious and spiritual cockfight, is held at the temples and also allowed if organised as part of religious or cultural events.[121]",
				"after": "Mangalorean cuisine is largely influenced by the South Indian cuisine, with several cuisines being unique to the diverse communities of the city. Coconut and curry leaves are common ingredients to most Mangalorean Curry, as are ginger, garlic and chili. Mangalorean Fish Curry is a popular dish in Kanara. The Tuluva community's well-known dishes include Kori Rotti (dry rice flakes dipped in gravy), Bangude Pulimunchi (silver-grey mackerels), Beeja-Manoli Upkari, Neer dosa (lacy rice-crêpes), Boothai Gasi, Kadubu, and Patrode. The Konkani community's specialities include Daali thoy, beebe-upkari (cashew based), val val, avnas ambe sasam, Kadgi chakko, paagila podi, and chana gashi. Vegetarian cuisine in Mangalore, also known as Udupi cuisine, is known and liked throughout the state and region. Since Mangalore is a coastal town, fish forms the staple diet of most people.[122] Mangalorean Catholics' Sanna-Dukra Maas (Sanna—idli fluffed with toddy or yeast; Dukra Maas—Pork), Pork Bafat, Sorpotel and the Mutton Biryani of the Muslims are well-known dishes. Pickles such as happala, sandige and puli munchi are unique to Mangalore. Shendi (toddy), a country liquor prepared from coconut flower sap, is popular.[109]",
			"color": "tan|0.4723 antique|0.11726 white|0.11726 rosy|0.032441 brown|0.032441 light|0.03077 gray|0.03077 light|0.03077 grey|0.03077 silver|0.02965 burly|0.024422 wood|0.024422 gainsboro|0.02227 dark|0.020705 gray|0.020705 dark|0.020705 grey|0.020705 linen|0.020683 papaya|0.020633 whip|0.020633 blanched|0.015913 almond|0.015913 bisque|0.013212  "
		}
	}
}
