{
	"add": {
		"doc": {
			"id": "73679bdf35bd04fbf06f849639570bf53374ed343dd90d3d3a6c04ecc139929b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Bridgewater_Canal_in_centre_of_Sale_2006.jpg/220px-Bridgewater_Canal_in_centre_of_Sale_2006.jpg",
				"previous": "About 300 acres (120 ha) of \"wasteland\" known as Sale Moor was enclosed in 1807, to be divided between the landowners in Sale. This was part of a nationwide initiative to begin cultivation of common land to lessen the food shortage caused by the Napoleonic Wars.[21] Records of poor relief in the town start in 1808, a time when the region was in the grip of an economic depression.[22] Poorhouses, where paupers could stay rent-free, were built in the early-19th century, reflecting the poor state of the local economy.[23] In 1829, Samuel Brooks acquired 515 acres (208 ha) of land in Sale – about a quarter of the township – from George Grey, 6th Earl of Stamford.[24] The area later became known as Brooklands after the land owner.",
				"after": "The Manchester, South Junction and Altrincham Railway opened in 1849,[25] and led to the middle classes using Sale as a commuter town, a residence away from their place of work.[26] This resulted in Sale's population more than tripling by the end of the 19th century.[27] The land in Sale Moor was the cheapest in the town because the soil was poor and difficult to cultivate, which was part of the reason the area was common land until the early 19th century. However, when the railway opened, Sale Moor was close to the station and became the most expensive area in Sale. Villas were built in Sale Moor, and a few in Ashton upon Mersey as the demand for land increased.[28] They were often decorated with stained glass or different coloured bricks in an attempt to make them \"mansions in miniature\" for the aspiring middle-class.[29]",
			"color": "black|0.66795 dim|0.074926 gray|0.074926 dim|0.074926 grey|0.074926 gray|0.045094 grey|0.045094 tan|0.036573 dark|0.035114 gray|0.035114 dark|0.035114 grey|0.035114 burly|0.018712 wood|0.018712 slate|0.018427 gray|0.018427 light|0.016954 slate|0.016954 gray|0.016954 peru|0.013027 silver|0.010707 olive|0.008724  "
		}
	}
}
