{
	"add": {
		"doc": {
			"id": "737323512c8710de55ea5c6fae4e4cc3b2298986524f47d9af6bb0b42cd2b315",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Christmas_shearwater_takeoff.JPG/220px-Christmas_shearwater_takeoff.JPG",
				"previous": "The procellariids are small- to medium-sized seabirds. The largest, the giant petrels with a wingspan of 81 to 99 cm (32 to 39 in), are almost as large as albatrosses; the smallest, such as the fairy prion have a wingspan of 23 to 28 cm (9.1 to 11.0 in),[11] are slightly bigger than the diving petrels. There are no obvious differences between the sexes, although females tend to be slighter.[12] Like all Procellariiformes, the procellariids have a characteristic tubular nasal passage used for olfaction.[13] This ability to smell helps to locate patchily distributed prey at sea and may also help locate nesting colonies. The plumage of the procellariids is usually dull, with greys, blues, blacks and browns being the usual colours, although some species have striking patterns (such as the Cape petrel).",
				"after": "The technique of flight among procellariids depends on foraging methods. Compared to an average bird, all procellariids have a high aspect ratio (meaning their wings are long and narrow) and a heavy wing loading. Therefore they must maintain a high speed in order to remain in the air. Most procellariids use two techniques to do this, namely, dynamic soaring and slope soaring.[14] Dynamic soaring involves gliding across wave fronts, thus taking advantage of the vertical wind gradient and minimising the effort required to stay in the air. Slope soaring is more straightforward: the procellariid turns to the wind, gaining height, from where it can then glide back down to the sea. Most procellariids aid their flight by means of flap-glides, where bursts of flapping are followed by a period of gliding; the amount of flapping dependent on the strength of the wind and the choppiness of the water.[15] Shearwaters and other larger petrels, which have lower aspect ratio, must make more use of flapping to remain airborne than gadfly petrels. Because of the high speeds required for flight, procellariids need to either run or face into a strong wind in order to take off.",
			"color": "antique|0.19092 white|0.19092 linen|0.10866 papaya|0.099781 whip|0.099781 old|0.087528 lace|0.087528 beige|0.066812 blanched|0.066679 almond|0.066679 dim|0.059192 gray|0.059192 dim|0.059192 grey|0.059192 black|0.057853 sea|0.050263 shell|0.050263 corn|0.042973 silk|0.042973 floral|0.040284 white|0.040284 ivory|0.023735 gray|0.017611 grey|0.017611 misty|0.014803 rose|0.014803 slate|0.013651 gray|0.013651 gainsboro|0.012458 bisque|0.010451 dark|0.0095405 gray|0.0095405 dark|0.0095405 grey|0.0095405 light|0.0093703 gray|0.0093703 light|0.0093703 grey|0.0093703 silver|0.00666  "
		}
	}
}
