{
	"add": {
		"doc": {
			"id": "7375a9ee6957e283e8e8e8afbbac9c241984078faf8684a58ed376e7db10e418",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Stegosaurus_BW.jpg/220px-Stegosaurus_BW.jpg",
				"previous": "In the past, some palaeontologists, notably Robert Bakker, have speculated that the plates may have been mobile to some degree, although others disagree.[37] Bakker suggested the plates were the bony cores of pointed horn-covered plates that a Stegosaurus could flip from one side to another to present a predator with an array of spikes and blades that would impede it from closing sufficiently to attack the Stegosaurus effectively. The plates would naturally sag to the sides of the Stegosaurus, the length of the plates reflecting the width of the animal at that point along its spine. His reasoning for these plates to be covered in horn is that the surface fossilized plates have a resemblance to the bony cores of horns in other animals known or thought to bear horns, and his reasoning for the plates to be defensive in nature is that the plates had insufficient width for them to stand erect easily in such a manner as to be useful in display without continuous muscular effort.[38] S. stenops also had disk-shaped plates, on its hips.",
				"after": "The function of the plates has been much debated. Initially thought of as some form of armor,[29] they appear to have been too fragile and ill-placed for defensive purposes, leaving the animal's sides unprotected.[39] The plates' large size suggests that they may have served to increase the apparent height of the animal, either to intimidate enemies[24] or to impress other members of the same species, in some form of sexual display,[39] although both male and female specimens seemed to have had the same plates. More recently, researchers have proposed that they may have helped to control the body temperature of the animal,[37] in a similar way to the sails of the pelycosaurs Dimetrodon and Edaphosaurus (and modern elephant and rabbit ears). The plates had blood vessels running through grooves and air flowing around the plates would have cooled the blood.[40] Some 2010 structural comparisons of Stegosaurus plates to Alligator osteoderms seem to support the conclusion that the potential for a thermoregulatory role in the plates of Stegosaurus definitely exists.[41] This hypothesis has been seriously questioned,[42] since its closest relatives, such as Kentrosaurus, had more low surface area spikes than plates, implying that cooling was not important enough to require specialized structural formations such as plates. Another possible function is that the plates may have helped the animal increase heat absorption from the sun. Since a cooling trend occurred towards the end of the Jurassic, a large ectothermic reptile might have used the increased surface area afforded by the plates to absorb radiation from the sun.",
			"color": "dark|0.13785 khaki|0.13785 light|0.079789 gray|0.079789 light|0.079789 grey|0.079789 silver|0.073884 gainsboro|0.071537 white|0.050189 smoke|0.050189 sea|0.047821 shell|0.047821 snow|0.047187 floral|0.046513 white|0.046513 white|0.046459 mint|0.046217 cream|0.046217 ghost|0.040519 white|0.040519 azure|0.04025 alice|0.037597 blue|0.037597 lavender|0.029159 blush|0.029159 tan|0.028274 ivory|0.018766 linen|0.018477 olive|0.015675 drab|0.015675 dark|0.012098 olive|0.012098 green|0.012098 old|0.011376 lace|0.011376 dark|0.011164 gray|0.011164 dark|0.011164 grey|0.011164 burly|0.0087189 wood|0.0087189 olive|0.00861 honeydew|0.0078064 khaki|0.0073296 wheat|0.0063708  "
		}
	}
}
