{
	"add": {
		"doc": {
			"id": "7378065bdf08489152567ed4a6fa71648d4df1a5e009638be0795d4e90616677",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/b/b8/Roy_Lichtenstein_Whamm_Original_and_Lichtenstein_Derivative.gif/400px-Roy_Lichtenstein_Whamm_Original_and_Lichtenstein_Derivative.gif",
				"previous": "Whaam! adapts a panel by Irv Novick from the \"Star Jockey\" story from issue #89 of DC Comics' All-American Men of War (Feb. 1962).[24][25][26] The original forms part of a dream sequence in which fictional World War II P-51 Mustang pilot Johnny Flying Cloud, \"the Navajo ace\", foresees himself flying a jet fighter while shooting down other jet planes.[27][28] In Lichtenstein's painting, both the attacking and target planes are replaced by different types of aircraft. Paul Gravett suggests that Lichtenstein substituted the attacking plane with an aircraft from \"Wingmate of Doom\" illustrated by Jerry Grandenetti in the subsequent issue (#90, April 1962),[29] and that the target plane was borrowed from a Russ Heath drawing in the third panel of page 3 of the \"Aces Wild\" story in the same issue #89.[30] The painting also omits the speech bubble from the source in which the pilot exclaims \"The enemy has become a flaming star!\"[31]",
				"after": "A smaller, single-panel oil painting by Lichtenstein around the same time, Tex!, has a similar composition, with a plane at the lower left shooting an air-to-air missile at a second plane that is exploding in the upper right, with a word bubble.[32] The same issue of All-American Men of War was the inspiration for at least three other Lichtenstein paintings, Okay Hot-Shot, Okay!, Brattata and Blam, in addition to Whaam! and Tex![33] The graphite pencil sketch, Jet Pilot was also from that issue.[34] Several of Lichtenstein's other comics-based works are inspired by stories about Johnny Flying Cloud written by Robert Kanigher and illustrated by Novick, including Okay Hot-Shot, Okay!, Jet Pilot and Von Karp.[28]",
			"color": " "
		}
	}
}
