{
	"add": {
		"doc": {
			"id": "737a6abbf0bf62f52c412e8091580010c19fc5a76ea0bd3d5f8e1eeab77cb547",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Baby_Gharial.jpg/220px-Baby_Gharial.jpg",
				"previous": "The main threat to crocodilians around the world is human activity, including hunting and habitat destruction. Early in the 1970s, more than 2 million wild crocodilian skins of a variety of species had been traded, driving down the majority of crocodilian populations, in some cases almost to extinction. Starting in 1973, CITES attempted to prevent trade in body parts of endangered animals, such as the skins of crocodiles. This proved to be problematic in the 1980s, as crocodiles were abundant and dangerous to humans in some parts of Africa, and it was legal to hunt them. At the Conference of the Parties in Botswana in 1983, it was argued on behalf of aggrieved local people that it was reasonable to sell the lawfully hunted skins. In the late 1970s, crocodiles began to be farmed in different countries, started from eggs taken from the wild. By the 1980s, farmed crocodile skins were produced in sufficient numbers to destroy the unlawful trade in wild crocodilians. By 2000, skins from twelve crocodilian species, whether harvested lawfully in the wild or farmed, were traded by thirty countries, and the unlawful trade in the products had almost vanished.[118]",
				"after": "The gharial has undergone a chronic long-term decline, combined with a rapid short-term decline, leading the IUCN to list the species as Critically Endangered. In 1946, the gharial population had been widespread, numbering around 5,000 to 10,000; by 2006, however, it had declined 96–98%, reduced to a small number of widely spaced subpopulations of fewer than 235 individuals. This long-term decline had a number of causes, including egg collection and hunting, such as for indigenous medicine. The rapid decline of about 58% between 1997 and 2006 was caused by increasing use of gill nets and the loss of riverine habitat.[119] The gharial population continues to be threatened by environmental hazards such as heavy metals and protozoan parasites,[120] but as of 2013 numbers are rising, due to the protection of nests against egg predators.[121] The Chinese alligator was historically widespread throughout the eastern Yangtze River system but is currently restricted to some areas in southeastern Anhui province thanks to habitat fragmentation and degradation. The wild population is believed to exist only in small fragmented ponds. In 1972, the species was declared a Class I endangered species by the Chinese government and received the maximum amount of legal protection. Since 1979, captive breeding programs were established in China and North America, creating a healthy captive population.[122] In 2008, alligators bred in the Bronx Zoo were successfully reintroduced to Chongming Island.[123] The Philippine crocodile is perhaps the most threatened crocodilian and is considered by the IUCN to be Critically Endangered. Hunting and destructive fishing habits have reduced its population to around 100 individuals by 2009. In the same year, 50 captive bred crocodiles were released into the wild to help boost the population. Support from local people is crucial for the species survival.[124]",
			"color": "silver|0.15175 dark|0.13002 gray|0.13002 dark|0.13002 grey|0.13002 light|0.12911 gray|0.12911 light|0.12911 grey|0.12911 gainsboro|0.11299 white|0.053681 smoke|0.053681 ghost|0.042706 white|0.042706 alice|0.041727 blue|0.041727 lavender|0.038479 blush|0.038479 snow|0.037487 gray|0.032732 grey|0.032732 lavender|0.032726 white|0.030035 sea|0.029022 shell|0.029022 linen|0.021776 black|0.021244 mint|0.020673 cream|0.020673 azure|0.020461 floral|0.017754 white|0.017754 dim|0.012725 gray|0.012725 dim|0.012725 grey|0.012725 old|0.0069534 lace|0.0069534  "
		}
	}
}
