{
	"add": {
		"doc": {
			"id": "737e29803fcf30c36f381873f3b21cddceca5197282d146d0de5fb076564f30d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Boeing_727-224_N32718_CO_ORD_19.02.78_edited-3.jpg/220px-Boeing_727-224_N32718_CO_ORD_19.02.78_edited-3.jpg",
				"previous": "At Six's insistence, Continental (with Pan Am and Trans World Airlines) was one of the three launch airlines for the Boeing 747. On June 26, 1970, Continental became the second carrier (after TWA) to put the 747 into U.S. domestic service. Its upper-deck first class lounge and main deck \"Polynesian Pub\" won awards worldwide for the most refined cabin interior among all airlines, as did meal services developed by Continental's Cordon Bleu-trained executive chef, Lucien DeKeyser.[9] Continental's 747 services from Chicago and Denver to Los Angeles and Honolulu set the standard for service in the western U.S.[5][9] When asked by one Denver customer service agent in 1974 why he flew Continental wherever he could, Hollywood legend Henry Fonda remarked, \"This operation is class; strictly class!\"[9] On June 1, 1972, Continental's widebody DC-10 service began. Six had insisted that Continental place a large order for DC-10s with manufacturer McDonnell Douglas. This decision again proved prescient, since the publicity associated with Continental's splashy 747 service Chicago-Denver-Los Angeles-Honolulu had stimulated increased market share and increased traffic for all carriers. Denver, Houston and Seattle were growing rapidly in the 1970s; the DC-10s took over most flights between Denver and Chicago, Los Angeles, Houston and Seattle, and between Houston-Los Angeles.[5][9]",
				"after": "During the 1970s Denver was the airline's main hub. The 747s were focused on the Chicago-Los Angeles-Honolulu routes, with one daily round trip through Denver. The DC-10s served large markets (Los Angeles to Chicago, Denver, Houston and Honolulu; and from Denver to Chicago, Los Angeles, Seattle and Houston). DC-9s and 727s predominated elsewhere and added frequencies on DC-10 routes.[9] Next to Braniff, Continental operated fewer aircraft types (four: the 747, DC-10, 727-200, and DC-9-10) during this period than any U.S. trunkline, affording savings in parts, maintenance, and crew training.[9] The DC-10 enabled the airline to capitalize on traffic growth in the west. Continental saw market share grow annually in each DC-10 market through the 1970s, until relative market parity was achieved with United, the principal competitor on most of the DC-10 routes. The same innovations introduced on the 747s appeared on Continental's DC-10s, including the \"Polynesian Pub\", but after the 1973 oil crisis more seats were needed and the DC-10 pubs were removed.[9] Continental phased out its 747s in 1978 in favor of the DC-10s (747s would return to Continental during the Lorenzo era, flying Newark to London and Paris). From the late-70s until it merged with Texas International, Continental operated only DC-10s and 727-200s.",
			"color": "dim|0.24474 gray|0.24474 dim|0.24474 grey|0.24474 silver|0.17976 dark|0.10035 gray|0.10035 dark|0.10035 grey|0.10035 gray|0.081223 grey|0.081223 light|0.068909 gray|0.068909 light|0.068909 grey|0.068909 light|0.055936 steel|0.055936 blue|0.055936 gainsboro|0.032474 light|0.025314 slate|0.025314 gray|0.025314 slate|0.022367 gray|0.022367 light|0.015489 blue|0.015489 red|0.012324 white|0.011591 smoke|0.011591 mint|0.0098855 cream|0.0098855 alice|0.0092444 blue|0.0092444 snow|0.009064 azure|0.0088243 white|0.0087739 ghost|0.0086281 white|0.0086281 floral|0.008252 white|0.008252 sea|0.0081353 shell|0.0081353 tan|0.0062284 dark|0.0058327 khaki|0.0058327  "
		}
	}
}
