{
	"add": {
		"doc": {
			"id": "73837a865ad11fea3c87d17361c450d94bc6773a5fa4933a6b2c26da152a3923",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Warner_Brother_Studios_from_The_Petrified_Forest_film_trailer.jpg/220px-Warner_Brother_Studios_from_The_Petrified_Forest_film_trailer.jpg",
				"previous": "In 1934, the studio lost over $2.5 million,[HBTN 30] of which $500,000 was the result of a 1934 fire at the Burbank studio, destroying 20 years' worth of early Vitagraph, Warner Bros. and First National films.[HBTN 30] The following year, Hearst's film adaption of William Shakespeare's A Midsummer Night's Dream (1935) failed at the box office and the studio's net loss increased.[cph 27] During this time, Harry and six other movie studio figures were indicted for conspiracy to violate the Sherman Antitrust Act,[HBTN 30] through an attempt to gain a monopoly over St Louis movie theaters.[26] In 1935, Harry was put on trial;[HBTN 30] after a mistrial, Harry sold the company's movie theaters and the case was never reopened.[HBTN 30] 1935 also saw the studio make a net profit of $674,158.00.[HBTN 30]",
				"after": "By 1936, contracts of musical and silent stars were not renewed replaced by tough-talking, working-class types who better fit these pictures. Dorothy Mackaill, Dolores del Río, Bebe Daniels, Frank Fay, Winnie Lightner, Bernice Claire, Alexander Gray, Alice White, and Jack Mulhall that had characterized the urban, modern, and sophisticated attitude of the 1920s gave way to James Cagney, Joan Blondell, Edward G. Robinson, Warren William and Barbara Stanwyck, who would be more acceptable to the common man. The studio was one of the most prolific producers of Pre-Code pictures and had a lot of trouble with the censors once they started clamping down on what they considered indecency (around 1934).[HBTN 31] As a result, Warner Bros. turned to historical pictures from around 1935 to avoid confrontations with the Breen office. In 1936, following the success of The Petrified Forest, Jack signed Humphrey Bogart to a studio contract.[cph 28] Warner, however, did not think Bogart was star material,[cph 29] and cast Bogart in infrequent roles as a villain opposite either James Cagney or Edward Robinson over the next five years.[cph 28]",
			"color": "dark|0.2491 gray|0.2491 dark|0.2491 grey|0.2491 silver|0.20352 light|0.1352 gray|0.1352 light|0.1352 grey|0.1352 gray|0.10731 grey|0.10731 gainsboro|0.098282 dim|0.07076 gray|0.07076 dim|0.07076 grey|0.07076 black|0.02366 linen|0.02103 white|0.018367 smoke|0.018367 sea|0.013847 shell|0.013847 floral|0.0099487 white|0.0099487 snow|0.0098246 old|0.0078656 lace|0.0078656 mint|0.0064719 cream|0.0064719 ghost|0.0064206 white|0.0064206 white|0.006079 lavender|0.0048205 blush|0.0048205  "
		}
	}
}
