{
	"add": {
		"doc": {
			"id": "73851873e537aeb84ca84b3672cc83c6241906c995843004fb7a4c8ef396f905",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/De_Cruci_Libres_Tres_47.jpg/100px-De_Cruci_Libres_Tres_47.jpg",
				"previous": "Although Christians accepted that the cross was the gallows on which Jesus died,[16] they had already begun in the 2nd century to use it as a Christian symbol.[17] During the first three centuries of the Christian era the cross was \"a symbol of minor importance\" when compared to the prominence given to it later,[18] but by the second century it was nonetheless so closely associated with Christians that Tertullian could designate the body of Christian believers as crucis religiosi, i.e. \"devotees of the Cross\".[19] and it was already a tradition for Christians to trace repeatedly on their foreheads the sign of the cross.[20] Martin Luther at the time of the Reformation retained the cross and crucifix in the Lutheran Church. Luther wrote: \"The cross alone is our theology.\" He believed one knows God not through works but through suffering, the cross, and faith[need quotation to verify].[21]",
				"after": "The Protestant Reformation spurred a revival of iconoclasm, a wave of rejecting sacred images—including the cross—from worship. For example, during the 16th century, Nicholas Ridley,[22] James Calfhill,[23] and Theodore Beza,[24] rejected practices that were described as cross worship. Considering it a form of idolatry, there was a dispute in 16th century England over the baptismal use of the sign of the cross and even the public use of crosses.[25] There were more active reactions to religious items that were thought as 'relics of Papacy', as happened for example in September 1641, when Sir Robert Harley, pulled down and destroyed the cross at Wigmore.[26] Writers during the 19th century indicating a pagan origin of the cross included Henry Dana Ward,[27] Mourant Brock,[28] and John Denham Parsons.[29] David Williams, writing of medieval images of monsters, says: \"The disembodied phallus is also formed into a cross, which, before it became for Christianity the symbol of salvation, was a pagan symbol of fertility.\"[30] The study, Gods, Heroes & Kings: The Battle for Mythic Britain states: \"Before the fourth century CE, the cross was not widely embraced as a sign of Christianity, symbolizing as it did the gallows of a criminal.\"[31]",
			"color": " "
		}
	}
}
