{
	"add": {
		"doc": {
			"id": "739e89e47c76fe3f56b9ba163f0ac6742b2d4797e6cd0cd96a1497ef7538b50c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/C17.globemaster.arp.jpg/220px-C17.globemaster.arp.jpg",
			"previous": [
				"Nearly all commercial cargo aircraft presently in the fleet are derivatives or transformations of passenger aircraft. However, there are three other methods to the development of cargo aircraft.[8]",
				"When the Airbus A380 was announced, the maker originally accepted orders for the freighter version A380F, offering the second largest payload capacity of any cargo aircraft, exceeded only by the An-225.[6] An aerospace consultant has estimated that the A380F would have 7% better payload and better range than the 747-8F, but also higher trip costs.[7] However, as of February 2013, production has not started, and firm availability dates have not been announced."
			],
				"after": "Existing air cargo derivatives of passenger airplanes have been very fitting. For example, the Boeing-747-200F has proven to be the big payload toiler of the air cargo fleet and could continue unmodified for a number of years. Each derivative freighter has the benefit of having most of its development costs already assessed against the transaction of its passenger equivalent. Furthermore, the financial arrangements for buying the airplane have already been established and there is a quite short lead time before production (as compared to all new aircraft). A main drawback of existing air cargo aircraft is that they represent older technology; thus their direct operating costs are higher than what might be achieved with current technology. Additionally, since they generally have not been designed specifically for air cargo, loading and unloading can cause problems; the aircraft may be pressurized more than necessary, and there may be apparatus manufactured for passenger safety that is not necessary for cargo.",
			"color": "dark|0.19801 gray|0.19801 dark|0.19801 grey|0.19801 black|0.14044 dim|0.14036 gray|0.14036 dim|0.14036 grey|0.14036 gray|0.10514 grey|0.10514 silver|0.09128 light|0.081103 slate|0.081103 gray|0.081103 slate|0.070404 gray|0.070404 light|0.053875 gray|0.053875 light|0.053875 grey|0.053875 gainsboro|0.037376 light|0.02732 steel|0.02732 blue|0.02732  "
		}
	}
}
