{
	"add": {
		"doc": {
			"id": "73a66a09b71feef7608d588b59111c144598f5964f0c945d9423c86f89091ab2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Petrus_Christus_-_The_Last_Judgement_-_WGA04844.jpg/210px-Petrus_Christus_-_The_Last_Judgement_-_WGA04844.jpg",
				"previous": "Bryson Burroughs, writing for the Metropolitan at the time of their acquisition in 1933, attributed the works to Hubert. Burroughs saw in the panels the hand of an expressive artist, \"all nerves and sensibilities\",[30] overcome with sympathy for the plight of the central figures in the panels, but who was nonetheless weak in drawing line. This profile, he believed, was incompatible with the aloof and impassive master craftsman Jan is known to have been.[30] Yet Burroughs acknowledged there was \"no certain documented proof for the attribution [to Hubert].\" He admitted his evidence was \"limited, inevitably incomplete\", and thus \"circumstantial and presumptive\".[50] More recent scholarship tends to agree Jan painted the panels based on the evidence that they are stylistically closer to Jan than Hubert, who died in 1426; and that Jan, who travelled across the Alps to Italy that year, painted the mountain range.[2]",
				"after": "The paintings have often been compared to the seven pages of the Turin-Milan Hours illuminated manuscript attributed to the unidentified artist \"Hand G\", generally thought to have been Jan van Eyck.[52] The closeness is seen to lie both in the miniaturist technique and the particular painterly style. The similarity of a Turin drawing of the crucified Christ to the figure in the New York diptych has led some art historians to conclude they were, at least, painted near the same time, during the 1420s and early 1430s. Most believe both the drawing and diptych panel at least originated from a prototype designed by Jan van Eyck.[5] Panofsky attributed the New York panels to \"Hand G\".[53] When the Turin-Milan Hours miniatures were discovered they were at first believed to have been painted before the Duke of Berry's death in 1416, an idea that was quickly rejected with the date extended to sometime in the early 1430s.[54]",
			"color": "black|0.78114 dark|0.033142 gray|0.033142 dark|0.033142 grey|0.033142 brown|0.023084 silver|0.022742 dim|0.017254 gray|0.017254 dim|0.017254 grey|0.017254 light|0.015015 gray|0.015015 light|0.015015 grey|0.015015 light|0.014759 slate|0.014759 gray|0.014759 slate|0.012369 gray|0.012369 gray|0.011476 grey|0.011476 gainsboro|0.010378 peru|0.007642 dark|0.006933 slate|0.006933 gray|0.006933 sienna|0.0066966  "
		}
	}
}
