{
	"add": {
		"doc": {
			"id": "73bb1ec63826d99596a9be652589da06fee78830de99cb25097b02013ae856c9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/We-marktplatz01.jpg/220px-We-marktplatz01.jpg",
				"previous": "After becoming part of the Wettin's territory in 1346, urban development improved. The Wettins fostered Weimar by abolishing socage and granting privileges to the citizens. Now Weimar became equal to other Wettinian cities like Weißensee and grew during the 15th century, with the establishment of a town hall and the current main church. Weimar acquired woad trade privileges in 1438. The castle and the walls were finished in the 16th century, making Weimar into a full city.",
				"after": "After the Treaty of Leipzig (1485) Weimar became part of the electorate of the Ernestine branch of Wettins with Wittenberg as capital. The Protestant Reformation was introduced in Weimar in 1525; Martin Luther stayed several times in the city. As the Ernestines lost the Schmalkaldic War in 1547, their capital Wittenberg went also to the Albertines, so that they needed a new residence. As the ruler returned from captivity, Weimar became his residence in 1552 and remained as such until the end of the monarchy in 1918. The first Ernestine territorial partition in 1572 was followed by various ones, nevertheless Weimar stayed the capital of different Saxe-Weimar states. The court and its staff brought some wealth to the city, so that it saw a first construction boom in the 16th century. The 17th century brought decline to Weimar, because of changing trade conditions (as in nearby Erfurt). Besides, the territorial partitions led to the loss of political importance of the dukes of Saxe-Weimar and their finances shrunk. The city's polity weakened more and more and lost its privileges, leading to the absolutist reign of the dukes in the early 18th century. On the other hand, this time brought another construction boom to Weimar, and the city got its present appearance, marked by various ducal representation buildings. The city walls were demolished in 1757 and during the following decades, Weimar expanded in all directions. The biggest building constructed in this period was the Schloss as the residence of the dukes (north and east wing: 1789–1803, west wing 1832–1835, south wing: 1913–1914). Between 1708 and 1717 Johann Sebastian Bach worked as the court's organist in Weimar.",
			"color": "dim|0.43525 gray|0.43525 dim|0.43525 grey|0.43525 gray|0.27653 grey|0.27653 black|0.041162 dark|0.039454 gray|0.039454 dark|0.039454 grey|0.039454 silver|0.030794 light|0.019089 gray|0.019089 light|0.019089 grey|0.019089 dark|0.017055 slate|0.017055 gray|0.017055 gainsboro|0.010644 rosy|0.010359 brown|0.010359 dark|0.010127 salmon|0.010127 tan|0.010124 slate|0.0091153 gray|0.0091153 dark|0.0088009 olive|0.0088009 green|0.0088009 light|0.0080129 slate|0.0080129 gray|0.0080129 sienna|0.007202  "
		}
	}
}
