{
	"add": {
		"doc": {
			"id": "73ca503b077b360c2ec2bbff48062d74818224724e90e07e7f21da6f031312bf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Clock_accurcy.jpg/220px-Clock_accurcy.jpg",
				"previous": "Most of the complexity of the clock lies in this adjustment process. The adjustment tries to correct for unwanted side-effects, such as frequencies from other electron transitions, temperature changes, and the spreading in frequencies caused by ensemble effects.[clarification needed] One way of doing this is to sweep the microwave oscillator's frequency across a narrow range to generate a modulated signal at the detector. The detector's signal can then be demodulated to apply feedback to control long-term drift in the radio frequency. In this way, the quantum-mechanical properties of the atomic transition frequency of the caesium can be used to tune the microwave oscillator to the same frequency, except for a small amount of experimental error. When a clock is first turned on, it takes a while for the oscillator to stabilize. In practice, the feedback and monitoring mechanism is much more complex than described above.",
				"after": "A number of other atomic clock schemes are in use for other purposes. Rubidium standard clocks are prized for their low cost, small size (commercial standards are as small as 17 cm3)[13] and short-term stability. They are used in many commercial, portable and aerospace applications. Hydrogen masers (often manufactured in Russia) have superior short-term stability compared to other standards, but lower long-term accuracy.",
			"color": "light|0.33176 steel|0.33176 blue|0.33176 yellow|0.15022 dim|0.076996 gray|0.076996 dim|0.076996 grey|0.076996 corn|0.046512 flower|0.046512 blue|0.046512 yellow|0.037712 green|0.037712 light|0.029175 blue|0.029175 gray|0.026294 grey|0.026294 lavender|0.02408 dark|0.020742 slate|0.020742 blue|0.020742 olive|0.014456 drab|0.014456 slate|0.013409 gray|0.013409 indigo|0.013199 dark|0.011942 khaki|0.011942  "
		}
	}
}
