{
	"add": {
		"doc": {
			"id": "741d7ef5826fe38df3cae3de6d0dc16bbe03838942a7ceee479eaedb7b31835c",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Virginia_Civil_Rights_Memorial_wide.jpg/220px-Virginia_Civil_Rights_Memorial_wide.jpg",
				"previous": "New economic forces also changed the Commonwealth. Virginian James Albert Bonsack invented the tobacco cigarette rolling machine in 1880 leading to new industrial scale production centered around Richmond. In 1886, railroad magnate Collis Potter Huntington founded Newport News Shipbuilding, which was responsible for building six major World War I-era battleships for the U.S. Navy from 1907–1923.[95] During the war, German submarines like U-151 attacked ships outside the port.[96] In 1926, Dr. W.A.R. Goodwin, rector of Williamsburg's Bruton Parish Church, began restoration of colonial-era buildings in the historic district with financial backing of John D. Rockefeller, Jr.[97] Though their project, like others in the state, had to contend with the Great Depression and World War II, work continued as Colonial Williamsburg became a major tourist attraction.[98]",
				"after": "Protests started by Barbara Rose Johns in 1951 in Farmville against segregated schools led to the lawsuit Davis v. County School Board of Prince Edward County. This case, filed by Richmond natives Spottswood Robinson and Oliver Hill, was decided in 1954 with Brown v. Board of Education, which rejected the segregationist doctrine of \"separate but equal\". But, in 1958, under the policy of \"massive resistance\" led by the influential segregationist Senator Harry F. Byrd and his Byrd Organization, the Commonwealth prohibited desegregated local schools from receiving state funding.[99]",
			"color": "dim|0.25269 gray|0.25269 dim|0.25269 grey|0.25269 gray|0.12023 grey|0.12023 black|0.10175 gainsboro|0.054886 light|0.048509 gray|0.048509 light|0.048509 grey|0.048509 dark|0.046495 gray|0.046495 dark|0.046495 grey|0.046495 white|0.042421 smoke|0.042421 linen|0.038277 sea|0.0361 shell|0.0361 silver|0.033926 snow|0.032679 floral|0.030863 white|0.030863 mint|0.02566 cream|0.02566 white|0.024431 ghost|0.023132 white|0.023132 alice|0.020801 blue|0.020801 old|0.016729 lace|0.016729 lavender|0.012231 blush|0.012231 dark|0.01064 slate|0.01064 gray|0.01064 azure|0.0095571 slate|0.0050976 gray|0.0050976 ivory|0.0049049  "
		}
	}
}
