{
	"add": {
		"doc": {
			"id": "74241065e019bf95e5172313de864581c2a19c96bca5fe7845821b733618f1c3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/1976_Bicentennial_Quarter_Rev.png/220px-1976_Bicentennial_Quarter_Rev.png",
				"previous": "The new clad quarters were struck without mint mark in 1965–1967, regardless of the mint of origin. Beginning in 1968, mint marks were restored. The San Francisco Mint had reopened, but from 1968, it struck quarters only for collectors, for the most part proof coins.[34] The Mint adjusted both sides of the coin for the initiation of clad coinage, lowering the relief (the modified reverse design exists on some 1964-dated silver quarters). The obverse was slightly changed in 1974, with some details sharpened.[35] Mint marks on post-1965 pieces are found on the lower right of the obverse, to the right of Washington's neck.[36]",
				"after": "In January 1973, Representative Richard C. White introduced legislation for commemorative dollars and half dollars for the 1976 United States Bicentennial.[37] On June 6, Mint Director Mary Brooks testified before a congressional committee, and responding to concerns that only the two least-popular denominations would be changed, agreed to support the temporary redesign of the quarter as well.[38] On October 18, 1973, President Richard Nixon signed legislation mandating a temporary redesign of the three denominations for all coins issued after July 4, 1975 and struck before January 1, 1977. These pieces would bear the double date 1776–1976. In addition to circulation pieces, Congress mandated that 45 million Bicentennial coins be struck in 40% silver.[39] Fearful of creating low-mintage pieces which might be hoarded as the cent recently had been, thus creating a shortage of quarters, in December 1974 the Mint obtained congressional approval to continue striking 1974-dated quarters, half dollars and dollars until Bicentennial coinage began. Accordingly, there are no 1975-dated quarters.[40][41][42] Almost two billion Bicentennial quarters were struck,[43] as the Mint sought to assure that there would be plenty of souvenirs of the anniversary.[44] The Mint sold the silver sets, in both uncirculated and proof, for more than a decade before ending sales at the end of 1986.[45] Jack L. Ahr's colonial drummer, which had appeared on the Bicentennial quarter, was replaced after 1976 by Flanagan's original reverse.[34]",
			"color": "gray|0.29149 grey|0.29149 dark|0.24862 gray|0.24862 dark|0.24862 grey|0.24862 dim|0.20219 gray|0.20219 dim|0.20219 grey|0.20219 silver|0.10612 light|0.04895 gray|0.04895 light|0.04895 grey|0.04895 gainsboro|0.034017 black|0.01388 white|0.0090997 smoke|0.0090997 lavender|0.0057655 blush|0.0057655 alice|0.0056892 blue|0.0056892 ghost|0.005562 white|0.005562 sea|0.0054229 shell|0.0054229 snow|0.0053174 white|0.0045634 mint|0.0038702 cream|0.0038702 linen|0.003789 floral|0.003 white|0.003  "
		}
	}
}
