{
	"add": {
		"doc": {
			"id": "7426872b7eb2f69d2d12d6d027dc8d5b41fd1fcd2cb0ea11bc076e6e4ad0d209",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Eday_EMEC_site.jpg/220px-Eday_EMEC_site.jpg",
			"previous": [],
				"after": "Unlike wind and wave, tidal power is an inherently predictable source. However the technology is in its infancy and numerous devices are in the prototype stages. Today it is known that a tall tubular tower with three blades attached to it is the typical profile of a wind turbine, but twenty-five years ago there were a wide variety of different systems being tested.[66] This is the current situation with regard to tidal power. Some systems capture energy from the tides in a vertical direction. The tide comes in and raises the water level in a basin. As the tide lowers the water in the basin is discharged through a turbine. Tidal stream power captures energy from the flow of tides, usually using underwater plant resembling a small wind turbine. An example is Marine Current Turbines SeaGen 1.2 MW device at Strangford Lough in Northern Ireland, which is the largest tidal stream turbine in the world.[67] To date the only installed tidal power plant of any size is the 240 MW rated barrage scheme at the Rance Estuary in Brittany, which has been operating successfully for more than 25 years, although there are a number of other much smaller projects around the world.[68]",
			"color": "dim|0.36049 gray|0.36049 dim|0.36049 grey|0.36049 dark|0.072659 slate|0.072659 gray|0.072659 dark|0.064921 gray|0.064921 dark|0.064921 grey|0.064921 gray|0.062871 grey|0.062871 silver|0.052433 light|0.049564 gray|0.049564 light|0.049564 grey|0.049564 gainsboro|0.045817 white|0.025067 smoke|0.025067 alice|0.023949 blue|0.023949 ghost|0.020553 white|0.020553 dark|0.017325 olive|0.017325 green|0.017325 lavender|0.016942 azure|0.015946 snow|0.01561 lavender|0.01515 blush|0.01515 cadet|0.014976 blue|0.014976 white|0.014002 mint|0.013383 cream|0.013383 powder|0.012463 blue|0.012463 light|0.011125 cyan|0.011125 black|0.010343 sea|0.0097246 shell|0.0097246 slate|0.0090701 gray|0.0090701 light|0.0080261 blue|0.0080261 light|0.0079772 slate|0.0079772 gray|0.0079772  "
		}
	}
}
