{
	"add": {
		"doc": {
			"id": "742e6f6b8b271bafb26bf0293e7cc4f58d00cd243afa228dde34fd12d64877b3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Baguettes_and_THB_at_a_shop_in_Toliara_Madagascar.JPG/220px-Baguettes_and_THB_at_a_shop_in_Toliara_Madagascar.JPG",
				"previous": "French colonial rule began in 1896 and introduced a number of innovations to local cuisines. Certain new food names derived from the French language—then the dominant language of the state[33]—became widespread. Baguettes were popularized among cosmopolitan urbanites, as were a variety of French pastries and desserts such as cream horns, mille-feuille, croissants and chocolat chaud (hot chocolate). The French also introduced foie gras, now produced locally,[34] and popularized a dish known in the highlands as composé: a cold macaroni salad mixed with blanched vegetables based on the French macédoine de légumes.[35] The French established plantations for the cultivation of a variety of cash crops, including not only those already exploited in the 19th century, but new foreign fruits, vegetables and livestock, with varying degrees of success. Tea, coffee, vanilla, coconut oil and spices became successful exports.[36] Coconut became a regular ingredient in coastal cuisine, and vanilla began to be used in sauces for poultry and seafood dishes.[37]",
				"after": "Although a handful of Chinese settlers had arrived in Madagascar towards the end of the reign of Queen Ranavalona III, the first major influx of Chinese migrants followed an announcement by General Joseph Gallieni, first governor general of the colony of Madagascar, requesting 3,000 Chinese laborers to construct a northern rail line between Antananarivo and Toamasina.[38] Chinese migrants introduced a number of dishes that have become part of urban popular cuisine in regions with large Chinese communities, including riz cantonais (Chinese fried rice), soupe chinoise (Chinese-style noodle soup), misao (fried noodles), pao (hum bao)[39] and nems (fried egg rolls).[40]",
			"color": "gray|0.38668 grey|0.38668 dim|0.11874 gray|0.11874 dim|0.11874 grey|0.11874 black|0.053951 silver|0.043998 steel|0.042447 blue|0.042447 light|0.036732 gray|0.036732 light|0.036732 grey|0.036732 peach|0.029032 puff|0.029032 dark|0.026783 gray|0.026783 dark|0.026783 grey|0.026783 gainsboro|0.025781 tan|0.018955 burly|0.015696 wood|0.015696 slate|0.015518 gray|0.015518 saddle|0.013764 brown|0.013764 light|0.01325 slate|0.01325 gray|0.01325 rosy|0.012916 brown|0.012916 peru|0.0097322 sienna|0.0091929 thistle|0.0091886 light|0.0088548 steel|0.0088548 blue|0.0088548 bisque|0.0078949 misty|0.0071965 rose|0.0071965 lavender|0.0071095 indian|0.0069332 red|0.0069332  "
		}
	}
}
