{
	"add": {
		"doc": {
			"id": "7434ee4bf0616b86fdedfac76e74428b5774426612b4b32350bdde5cc3894ac1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Balaenoptera_borealis_3.jpg/220px-Balaenoptera_borealis_3.jpg",
				"previous": "Sei whales usually travel alone[45] or in pods of up to six individuals.[43] Larger groups may assemble at particularly abundant feeding grounds. Very little is known about their social structure. During the southern Gulf of Maine influx in mid-1986, groups of at least three sei whales were observed \"milling\" on four occasions - i.e. moving in random directions, rolling, and remaining at the surface for over ten minutes. One whale would always leave the group during or immediately after such socializing bouts.[43] The sei whale is among the fastest cetaceans. It can reach speeds of up to 50 kilometres per hour (27 kn) over short distances.[12] However, it is not a remarkable diver, reaching relatively shallow depths for five to fifteen minutes. Between dives, the whale surfaces for a few minutes, remaining visible in clear, calm waters, with blows occurring at intervals of about 60 seconds (range: 45–90 sec.). Unlike the fin whale, the sei whale tends not to rise high out of the water as it dives, usually just sinking below the surface. The blowholes and dorsal fin are often exposed above the water surface almost simultaneously. The whale almost never lifts its flukes above the surface, and are generally less active on water surfaces than close related Bryde's whales; it rarely breaches.[11]",
				"after": "This rorqual is a filter feeder, using its baleen plates to obtain its food by opening its mouth, engulfing or skimming large amounts of the water containing the food, then straining the water out through the baleen, trapping any food items inside its mouth.",
			"color": "gray|0.37213 grey|0.37213 dim|0.26773 gray|0.26773 dim|0.26773 grey|0.26773 dark|0.2047 gray|0.2047 dark|0.2047 grey|0.2047 silver|0.04953 slate|0.023695 gray|0.023695 light|0.02061 gray|0.02061 light|0.02061 grey|0.02061 gainsboro|0.012865  "
		}
	}
}
