{
	"add": {
		"doc": {
			"id": "743ff2a327b435b36d0295207b4eed3d8fac27d9a3c334b56803b5817b8b1bca",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Relativistic_precession.svg/220px-Relativistic_precession.svg.png",
				"previous": "Mathematical collaborations of unprecedented size and scope took place. An example is the classification of finite simple groups (also called the \"enormous theorem\"), whose proof between 1955 and 1983 required 500-odd journal articles by about 100 authors, and filling tens of thousands of pages. A group of French mathematicians, including Jean Dieudonné and André Weil, publishing under the pseudonym \"Nicolas Bourbaki\", attempted to exposit all of known mathematics as a coherent rigorous whole. The resulting several dozen volumes has had a controversial influence on mathematical education.[130]",
				"after": "Differential geometry came into its own when Einstein used it in general relativity. Entire new areas of mathematics such as mathematical logic, topology, and John von Neumann's game theory changed the kinds of questions that could be answered by mathematical methods. All kinds of structures were abstracted using axioms and given names like metric spaces, topological spaces etc. As mathematicians do, the concept of an abstract structure was itself abstracted and led to category theory. Grothendieck and Serre recast algebraic geometry using sheaf theory. Large advances were made in the qualitative study of dynamical systems that Poincaré had begun in the 1890s. Measure theory was developed in the late 19th and early 20th centuries. Applications of measures include the Lebesgue integral, Kolmogorov's axiomatisation of probability theory, and ergodic theory. Knot theory greatly expanded. Quantum mechanics led to the development of functional analysis. Other new areas include, Laurent Schwartz's distribution theory, fixed point theory, singularity theory and René Thom's catastrophe theory, model theory, and Mandelbrot's fractals. Lie theory with its Lie groups and Lie algebras became one of the major areas of study.",
			"color": "alice|0.082252 blue|0.082252 ghost|0.080581 white|0.080581 white|0.079495 smoke|0.079495 snow|0.076873 white|0.076708 azure|0.076091 mint|0.075931 cream|0.075931 sea|0.073495 shell|0.073495 floral|0.072089 white|0.072089 lavender|0.063365 blush|0.063365 light|0.055459 blue|0.055459 light|0.04272 sky|0.04272 blue|0.04272 sky|0.033991 blue|0.033991 pale|0.020283 violet|0.020283 red|0.020283 lavender|0.015376 ivory|0.014806 light|0.011596 steel|0.011596 blue|0.011596 pink|0.0089152 misty|0.0083155 rose|0.0083155 light|0.0074248 cyan|0.0074248 linen|0.0071703 light|0.0054655 pink|0.0054655 powder|0.0040108 blue|0.0040108  "
		}
	}
}
