{
	"add": {
		"doc": {
			"id": "744a45e6af42fac41e5382093c3edc6e6cda6f628e1e3dc8afa456596c22261b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/L%27agaric_contigu_%28Paxillus_involutus%29.jpg/220px-L%27agaric_contigu_%28Paxillus_involutus%29.jpg",
			"previous": [],
				"after": "The brown roll-rim was described by French mycologist Pierre Bulliard in 1785 as Agaricus contiguus,[3] although the 1786 combination Agaricus involutus of August Batsch[4] is taken as the first valid description.[1] James Bolton published a description of what he called Agaricus adscendibus in 1788;[5] the taxonomical authority Index Fungorum considers this to be synonymous with P. involutus.[2] Additional synonyms include Omphalia involuta described by Samuel Frederick Gray in 1821,[6] and Rhymovis involuta, published by Gottlob Ludwig Rabenhorst in 1844.[7] The species gained its current binomial name in 1838 when the 'father of mycology', Swedish naturalist Elias Magnus Fries erected the genus Paxillus, and set it as the type species.[8] The starting date of fungal taxonomy had been set as January 1, 1821, to coincide with the date of Fries' works, which meant that names coined earlier than this date required sanction by Fries (indicated in the name by a colon) to be considered valid. It was thus written Paxillus involutus (Batsch:Fr.) Fr. However, a 1987 revision of the International Code of Botanical Nomenclature set the starting date at May 1, 1753, the date of publication of Linnaeus' seminal work, the Species Plantarum.[9] Hence the name no longer requires the ratification of Fries' authority.",
			"color": "khaki|0.25798 lemon|0.09756 chiffon|0.09756 pale|0.093416 golden|0.093416 rod|0.093416 light|0.09294 golden|0.09294 rod|0.09294 yellow|0.09294 wheat|0.07215 moccasin|0.066709 blanched|0.062054 almond|0.062054 corn|0.057129 silk|0.057129 light|0.044764 yellow|0.044764 bisque|0.034877 papaya|0.026802 whip|0.026802 tan|0.024538 dark|0.021176 khaki|0.021176  "
		}
	}
}
