{
	"add": {
		"doc": {
			"id": "745a5c059c17f9c837dd01968e5f360af6edd4c132d6f3cec3c7d963e4ede1d2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Daspletosaurus_torosus_steveoc.jpg/220px-Daspletosaurus_torosus_steveoc.jpg",
				"previous": "Daspletosaurus had a massive skull that could reach more than 1 meter (3.3 ft) in length.[1] The bones were heavily constructed and some, including the nasal bones on top of the snout, were fused for strength. Large fenestrae (openings) in the skull reduced its weight. An adult Daspletosaurus was armed with about six dozen teeth that were very long but oval in cross section rather than blade-like. Unlike its other teeth, those in the premaxilla at the end of the upper jaw had a D-shaped cross section, an example of heterodonty always seen in tyrannosaurids. Unique skull features included the rough outer surface of the maxilla (upper jaw bone) and the pronounced crests around the eyes on the lacrimal, postorbital, and jugal bones. The orbit (eye socket) was a tall oval, somewhere in between the circular shape seen in Gorgosaurus and the 'keyhole' shape of Tyrannosaurus.[6][7][8] Split carinae[9] have been found on Daspletosaurus teeth.[10]",
				"after": "Daspletosaurus shared the same body form as other tyrannosaurids, with a short, S-shaped neck supporting the massive skull. It walked on its two thick hindlimbs, which ended in four-toed feet, although the first digit (the hallux) did not contact the ground. In contrast, the forelimbs were extremely small and bore only two digits, although Daspletosaurus had the longest forelimbs in proportion to body size of any tyrannosaurid. A long, heavy tail served as a counterweight to the head and torso, with the center of gravity over the hips.[1][8]",
			"color": "dim|0.13368 gray|0.13368 dim|0.13368 grey|0.13368 gray|0.1141 grey|0.1141 dark|0.07421 gray|0.07421 dark|0.07421 grey|0.07421 white|0.062161 smoke|0.062161 alice|0.05967 blue|0.05967 ghost|0.059623 white|0.059623 snow|0.05927 sea|0.059034 shell|0.059034 white|0.058518 lavender|0.057518 blush|0.057518 mint|0.057214 cream|0.057214 floral|0.055781 white|0.055781 azure|0.055746 silver|0.038928 light|0.024595 gray|0.024595 light|0.024595 grey|0.024595 gainsboro|0.020385 linen|0.0043756 black|0.0027287  "
		}
	}
}
