{
	"add": {
		"doc": {
			"id": "7461f115914dd27d23ccdaf216b4f7a7d259972d7c09922d63d2303f1a9addc9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Asche_in_Chu_Chin_Chow.jpg/220px-Asche_in_Chu_Chin_Chow.jpg",
				"previous": "The current theatre opened on 28 April 1897. Herbert Beerbohm Tree built the theatre with profits from his tremendous success at the Haymarket Theatre,[55] and he owned, managed and lived in the theatre from its construction until his death in 1917. For his personal use, he had a banqueting hall and living room installed in the massive, central, square French-style dome.[50] This building did not specialise in opera, although there were some operatic performances in its early years. The theatre opened with a dramatisation of Gilbert Parker's The Seats of the Mighty. Adaptations of novels by Dickens, Tolstoy, and others formed a significant part of the repertoire, along with classical works from Molière and Shakespeare. The theatre also hosted the world première of J. M. Synge's The Tinker's Wedding on 11 November 1909[56] and George Bernard Shaw's Pygmalion, with Tree as Henry Higgins and Mrs Patrick Campbell as Eliza, in 1914.[57] Tree's productions were known for their elaborate and spectacular scenery and effects, often including live animals and real grass.[57] These remained both popular and profitable, but in his last decade, Tree's acting style was seen as increasingly outmoded, and many of his plays received bad reviews. Tree defended himself from critical censure, demonstrating his continuing popularity at the box office until his death.[58]",
				"after": "In 1904, Tree founded the Academy of Dramatic Art (later RADA), which spent a year based in the theatre before moving in 1905 to Gower Street in Bloomsbury. Tree continued to take graduates of the Academy into his company at His Majesty's, employing some 40 actors in this way by 1911.[59]",
			"color": "light|0.11924 gray|0.11924 light|0.11924 grey|0.11924 silver|0.098473 antique|0.095949 white|0.095949 dark|0.09292 gray|0.09292 dark|0.09292 grey|0.09292 black|0.091098 sea|0.045532 shell|0.045532  "
		}
	}
}
