{
	"add": {
		"doc": {
			"id": "7473fcbbfaaaa4b6de6fd5357e5cde23f37f4ae2fa43b27630d87dfeecbe339e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Stac_an_Armin_and_Boreray.jpg/220px-Stac_an_Armin_and_Boreray.jpg",
			"previous": [],
				"after": "The great auk was found in the cold North Atlantic coastal waters along the coasts of Canada, the northeastern United States, Norway, Greenland, Iceland, the Faroe Islands, Ireland, Great Britain, France, and northern Spain.[30] The great auk left the North Atlantic waters for land only to breed, even roosting at sea when not breeding.[25][31] The rookeries of the great auk were found from Baffin Bay down to the Gulf of St. Lawrence, across the far northern Atlantic, including Iceland, and in Norway and the British Isles in Europe.[25][32][33] For their nesting colonies the great auks required rocky islands with sloping shorelines that provided access to the seashore.[27] These were very limiting requirements and it is believed that the great auk never had more than 20 breeding colonies.[27] Additionally, the nesting sites needed to be close to rich feeding areas and be far enough from the mainland to discourage visitation by humans and polar bears.[34] The localities of only six former breeding colonies are known: Papa Westray in the Orkney Islands, St. Kilda Island off Scotland, Grimsey Island and Eldey Island near Iceland, Funk Island[35] near Newfoundland, and the Bird Rocks (Rochers-aux-Oiseaux) in the Gulf of St. Lawrence.[27] Records suggest that this species may have bred on Cape Cod, Massachusetts.[27] By the late 18th and early 19th centuries, the breeding range of the Great Auk was restricted to Funk Island, Grimsey Island, Eldey Island, the Gulf of St. Lawrence, and St. Kilda Island.[32] Funk Island was the largest known breeding colony.[36]",
			"color": "light|0.34149 slate|0.34149 gray|0.34149 slate|0.25014 gray|0.25014 light|0.22644 steel|0.22644 blue|0.22644 dark|0.080751 slate|0.080751 gray|0.080751 dim|0.07788 gray|0.07788 dim|0.07788 grey|0.07788 gray|0.013899 grey|0.013899 dark|0.0076564 gray|0.0076564 dark|0.0076564 grey|0.0076564  "
		}
	}
}
