{
	"add": {
		"doc": {
			"id": "7476df6f4b3b10c3ada49d722e7b09b89bee877b07bedaa74e8d68a53f6836a8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Trebuchet.jpg/220px-Trebuchet.jpg",
				"previous": "As earlier empires had done, the Muslim caliphates united in trade large areas that had previously traded little. The conquered sometimes paid lower taxes than in their earlier independence, and ideas spread even more easily than goods. Peace was more frequent than it had been. These conditions fostered improvements in agriculture and other technology as well as in sciences which largely adapted from earlier Greek, Roman and Persian empires, with improvements.",
				"after": "European technology in the Middle Ages may be best described as a symbiosis of traditio et innovatio. While medieval technology has been long depicted as a step backwards in the evolution of Western technology, sometimes willfully so by modern authors intent on denouncing the church as antagonistic to scientific progress (see e.g. Myth of the Flat Earth), a generation of medievalists around the American historian of science Lynn White stressed from the 1940s onwards the innovative character of many medieval techniques. Genuine medieval contributions include for example mechanical clocks, spectacles and vertical windmills. Medieval ingenuity was also displayed in the invention of seemingly inconspicuous items like the watermark or the functional button. In navigation, the foundation to the subsequent age of exploration was laid by the introduction of pintle-and-gudgeon rudders, lateen sails, the dry compass, the horseshoe and the astrolabe.",
			"color": "light|0.40029 steel|0.40029 blue|0.40029 black|0.12084 dim|0.042066 gray|0.042066 dim|0.042066 grey|0.042066 dark|0.040253 gray|0.040253 dark|0.040253 grey|0.040253 silver|0.035478 rosy|0.033497 brown|0.033497 gray|0.030919 grey|0.030919 light|0.028647 gray|0.028647 light|0.028647 grey|0.028647 gainsboro|0.025725 dark|0.022863 olive|0.022863 green|0.022863 misty|0.019113 rose|0.019113 thistle|0.018202 lavender|0.016591 blush|0.016591 linen|0.014433 white|0.01406 smoke|0.01406 lavender|0.013717 sea|0.013547 shell|0.013547 snow|0.012152 ghost|0.010582 white|0.010582 steel|0.0096927 blue|0.0096927 floral|0.0082455 white|0.0082455 white|0.0076132 corn|0.0069559 flower|0.0069559 blue|0.0069559 light|0.0068918 slate|0.0068918 gray|0.0068918  "
		}
	}
}
