{
	"add": {
		"doc": {
			"id": "74820fd4c6caeefe23dd59e955f4afe2ca2fdf2baa5f5aeb7bea6e935609b3c3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Wincenty_Dunin-Marcinkiewicz_2.jpg/170px-Wincenty_Dunin-Marcinkiewicz_2.jpg",
				"previous": "After Belarus was incorporated into the Soviet Union, the Soviet government took control of the Republic's cultural affairs. At first, a policy of \"Belarusianization\" was followed in the newly formed Byelorussian SSR. This policy was reversed in the 1930s, and the majority of prominent Belarusian intellectuals and nationalist advocates were either exiled or killed in Stalinist purges.[180] The free development of literature occurred only in Polish-held territory until Soviet occupation in 1939.[179] Several poets and authors went into exile after the Nazi occupation of Belarus and would not return until the 1960s.[179] The last major revival of Belarusian literature occurred in the 1960s with novels published by Vasil Bykaŭ and Uladzimir Karatkievich.",
				"after": "Music in Belarus largely comprises a rich tradition of folk and religious music. The country's folk music traditions can be traced back to the times of the Grand Duchy of Lithuania. In the 19th century, Polish composer Stanisław Moniuszko composed operas and chamber music pieces while living in Minsk. During his stay, he worked with Belarusian poet Vintsent Dunin-Martsinkyevich and created the opera Sialanka (Peasant Woman). At the end of the 19th century, major Belarusian cities formed their own opera and ballet companies. The ballet Nightingale by M. Kroshner was composed during the Soviet era and became the first Belarusian ballet showcased at the National Academic Vialiki Ballet Theatre in Minsk.[181]",
			"color": "black|0.34979 dim|0.13431 gray|0.13431 dim|0.13431 grey|0.13431 gray|0.08659 grey|0.08659 dark|0.075895 gray|0.075895 dark|0.075895 grey|0.075895 silver|0.048882 light|0.041198 gray|0.041198 light|0.041198 grey|0.041198 gainsboro|0.030861 linen|0.028987 sea|0.022815 shell|0.022815 old|0.019916 lace|0.019916 floral|0.019765 white|0.019765 antique|0.019228 white|0.019228 misty|0.01798 rose|0.01798 white|0.017972 smoke|0.017972 snow|0.015979 white|0.012347 ivory|0.011685 mint|0.010421 cream|0.010421 lavender|0.0093994 blush|0.0093994  "
		}
	}
}
