{
	"add": {
		"doc": {
			"id": "748bc944c9c623216a3ad6f6914c4974fa424ad71d76f84deb302feaf1c27d0a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/University-College-Cork-Panorama-2012.JPG/220px-University-College-Cork-Panorama-2012.JPG",
				"previous": "The Cork Suburban Rail system also departs from Kent Station and provides connections to parts of Metropolitan Cork. Stations include Little Island, Mallow, Midleton, Fota and Cobh. In July 2009 the Glounthaune to Midleton line was reopened, with new stations at Carrigtwohill and Midleton (with future stations planned for Kilbarry, Monard, Carrigtwohill West and Blarney).[67]",
				"after": "Cork is an important educational centre in Ireland. University College Cork (UCC), a constituent university of the National University of Ireland, offers a wide variety of courses in Arts, Commerce, Engineering, Law, Medicine and Science. The university was named \"Irish University of the Year\" in 2003–2004[68] and 2005–2006 by The Sunday Times. Cork Institute of Technology (CIT) was named Irish \"Institute of Technology of the Year\" in 2006–2007 and offers a variety of third level courses in Computing and IT, Business, Humanities and Engineering (Mechanical, Electronic, Electrical, and Chemical). The National Maritime College of Ireland is also located in Cork and is the only college in Ireland in which Nautical Studies and Marine Engineering can be undertaken. CIT also incorporates the Cork School of Music and Crawford College of Art and Design as constituent schools. The Cork College of Commerce is the largest post-Leaving Certificate College in Ireland and is also the biggest provider of Vocational Preparation and Training courses in the country. Other 3rd level institutions include Griffith College Cork, a private institution, and various other colleges.",
			"color": "dark|0.36151 gray|0.36151 dark|0.36151 grey|0.36151 gray|0.35895 grey|0.35895 dim|0.12228 gray|0.12228 dim|0.12228 grey|0.12228 dark|0.037964 olive|0.037964 green|0.037964 black|0.033763 olive|0.028927 drab|0.028927 silver|0.020469 slate|0.019557 gray|0.019557 light|0.014784 slate|0.014784 gray|0.014784  "
		}
	}
}
