{
	"add": {
		"doc": {
			"id": "74937da9c3c806773078f5cb8aa11b79e0aea5b31bf5a47e1958d913328ff0e4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Spiteful_XVI_RB518.jpg/220px-Spiteful_XVI_RB518.jpg",
				"previous": "Although it is common practice to compare different piston engines and their performance potential by referring to the engine displacement or swept volume this does not give an accurate reading of an engine's capabilities. According to A C Lovesey, who was in charge of the Merlin's development,[nb 3] \"The impression still prevails that the static capacity known as the swept volume is the basis of comparison of the possible power output for different types of engine, but this is not the case because the output of the engine depends solely on the mass of air it can be made to consume efficiently, and in this respect the supercharger plays the most important role.\"[16]",
				"after": "Unlike the Merlin, the Griffon was designed from the outset to use a single-stage supercharger driven by a two-speed, hydraulically operated gearbox; the production versions, the Griffon II, III, IV, and VI series, were designed to give their maximum power at low altitudes and were mainly used by the Fleet Air Arm. The Griffon 60, 70, and 80 series featured two-stage supercharging and achieved their maximum power at low to medium altitudes. The Griffon 101, 121, and 130 series engines, collectively designated Griffon 3 SML,[17] used a two-stage, three-speed supercharger, adding a set of \"Low Supercharger (L.S)\" gears to the already existing Medium and Full Supercharger (M.S and F.S) gears.[17] Another modification was to increase the diameters of both impellers, thus increasing the rated altitudes at which maximum power could be generated in each gear.[18] While the 101 continued to drive a five-blade propeller, the 121 and 130 series were designed to drive contra-rotating propellers.[17] In 1946 a Griffon 101 was fitted to the Supermarine Spiteful XVI, RB518 (a re-engined production Mk.XIV); this aircraft achieved a maximum speed of 494 mph (795 km/h) with full military equipment.[19]",
			"color": " "
		}
	}
}
