{
	"add": {
		"doc": {
			"id": "74a0188247683df8c1b40b7ba209a2136352346c0cf4cc52c99faef3c0c7bd65",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Nauru_satellite.jpg/200px-Nauru_satellite.jpg",
			"previous": [],
				"after": "Nauru is an island nation in the Micronesian South Pacific. The nearest neighbour is Banaba Island in the Republic of Kiribati, 300 km due east. Nauru is the world's smallest island nation, covering just 21 km² (8.1 sq. mi), the smallest independent republic, and the only republican state in the world without an official capital. Initially inhabited by Micronesian and Polynesian peoples, Nauru was annexed and designated a 'colony' by Germany in the late 19th century, and became a mandate territory administered by Australia, New Zealand, and the United Kingdom following World War I. The island was occupied by Japan during World War II, and after the war entered into trusteeship again. Nauru achieved independence in 1968. Nauru is a phosphate rock island, and its primary economic activity since 1907 has been the export of phosphate mined from the island. With the exhaustion of phosphate reserves, its environment severely degraded by mining, and the trust established to manage the island's wealth significantly reduced in value, the government of Nauru has resorted to unusual measures to obtain income. In the 1990s, Nauru briefly became a tax haven and money laundering center. Since 2001, it has accepted aid from the Australian government; in exchange for this aid, Nauru houses an offshore detention centre that holds and processes asylum seekers trying to enter Australia.",
			"color": "black|0.17621 dark|0.13858 gray|0.13858 dark|0.13858 grey|0.13858 dim|0.12657 gray|0.12657 dim|0.12657 grey|0.12657 gray|0.1177 grey|0.1177 silver|0.093421 dark|0.069574 slate|0.069574 gray|0.069574 light|0.05775 gray|0.05775 light|0.05775 grey|0.05775 gainsboro|0.039305 linen|0.018913 antique|0.014507 white|0.014507 old|0.014363 lace|0.014363 sea|0.013772 shell|0.013772 floral|0.013529 white|0.013529 white|0.012951 smoke|0.012951 beige|0.011116 ivory|0.010654  "
		}
	}
}
