{
	"add": {
		"doc": {
			"id": "74ac4aebd70a7f108b7eea42a1f93f302148e329bf1a5e5c980d56c63c9ed640",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Landing_lights_on_royal_jordanian_arp.jpg/220px-Landing_lights_on_royal_jordanian_arp.jpg",
				"previous": "Key considerations of landing light design include intensity, reliability, weight, and power consumption. Ideal landing lights are extremely intense, require little electrical power, are lightweight, and have long and predictable service lives. Past and present technologies include ordinary incandescent lamps, halogen lamps, various forms of arc lamps and discharge lamps, and LED lamps.",
				"after": "Landing lights are typically only useful as visibility aids to the pilots when the aircraft is very low and close to terrain, as during take-off and landing. Landing lights are usually extinguished in cruise flight, especially if atmospheric conditions are likely to make the lights reflect or glare back into the eyes of the pilots. However, the brightness of landing lights makes them useful for increasing the visibility of an aircraft to other pilots, and so pilots are often encouraged to keep their landing lights on while below certain altitudes or in crowded airspace. Some aircraft (especially business jets) have lights that— when not needed to directly illuminate the ground—can operate in a flashing mode to enhance visibility to other aircraft. One convention is for commercial aircraft to turn on their landing lights when changing flight levels. Landing lights are sometimes used in emergencies to communicate with ground personnel or other aircraft, especially if other means of communication are not available (radio failures and the like).",
			"color": "light|0.2982 sky|0.2982 blue|0.2982 dim|0.16144 gray|0.16144 dim|0.16144 grey|0.16144 light|0.15292 steel|0.15292 blue|0.15292 black|0.085279 gray|0.081604 grey|0.081604 dark|0.032843 gray|0.032843 dark|0.032843 grey|0.032843 sky|0.019176 blue|0.019176 silver|0.01777 light|0.016593 blue|0.016593 light|0.012902 gray|0.012902 light|0.012902 grey|0.012902 lavender|0.010794 gainsboro|0.010041 light|0.0087784 slate|0.0087784 gray|0.0087784 white|0.0081697 smoke|0.0081697 sea|0.0070933 shell|0.0070933 slate|0.0069191 gray|0.0069191 snow|0.0068573 floral|0.0066123 white|0.0066123 alice|0.0065911 blue|0.0065911 mint|0.0065117 cream|0.0065117 white|0.0063879 ghost|0.0061014 white|0.0061014 azure|0.0055475  "
		}
	}
}
