{
	"add": {
		"doc": {
			"id": "74b3531199ff9853a10a3649494c4654adebeb2d533ecd3e0e8bc4157395e3a1",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/9f/R%40H_v1.32_screensaver.png/400px-R%40H_v1.32_screensaver.png",
				"previous": "Both the Rosetta@home application and the BOINC distributed computing platform are available for the Microsoft Windows, Linux and Macintosh platforms (BOINC also runs on several other platforms, e.g. FreeBSD).[6] Participation in Rosetta@home requires a central processing unit (CPU) with a clock speed of at least 500 MHz, 200 megabytes of free disk space, 512 megabytes of physical memory, and Internet connectivity.[7] As of November 20, 2013, the current version of the Rosetta application is 5.98, and the current version of the Rosetta Mini application is 3.48.[8] The current recommended BOINC program version is 7.0.28.[6] Standard HTTP (port 80) is used for communication between the user's BOINC client and the Rosetta@home servers at the University of Washington; HTTPS (port 443) is used during password exchange. Remote and local control of the BOINC client use port 31416 and port 1043, which might need to be specifically unblocked if they are behind a firewall.[9] Workunits containing data on individual proteins are distributed from servers located in the Baker lab at the University of Washington to volunteers' computers, which then calculate a structure prediction for the assigned protein. To avoid duplicate structure predictions on a given protein, each workunit is initialized with a random number seed. This gives each prediction a unique trajectory of descent along the protein's energy landscape.[10] Protein structure predictions from Rosetta@home are approximations of a global minimum in a given protein's energy landscape. That global minimum represents the most energetically favorable conformation of the protein, i.e. its native state.",
				"after": "A primary feature of the Rosetta@home graphical user interface (GUI) is a screensaver which shows a current workunit's progress during the simulated protein folding process. In the upper-left of the current screensaver, the target protein is shown adopting different shapes (conformations) in its search for the lowest energy structure. Depicted immediately to the right is the structure of the most recently accepted. On the upper right the lowest energy conformation of the current decoy is shown; below that is the true, or native, structure of the protein if it has already been determined. Three graphs are included in the screensaver. Near the middle, a graph for the accepted model's free energy is displayed, which fluctuates as the accepted model changes. A graph of the accepted model's root mean square deviation (RMSD), which measures how structurally similar the accepted model is to the native model, is shown far right. On the right of the accepted energy graph and below the RMSD graph, the results from these two functions are used to produce an energy vs. RMSD plot as the model is progressively refined.[11]",
			"color": "black|0.53223 medium|0.070201 aqua|0.070201 marine|0.070201 royal|0.05659 blue|0.05659 blue|0.050501 cadet|0.036593 blue|0.036593 dark|0.027221 slate|0.027221 gray|0.027221 medium|0.026862 blue|0.026862 midnight|0.023997 blue|0.023997 sienna|0.01952 maroon|0.017908 red|0.017908 dark|0.014506 red|0.014506 sea|0.014327 green|0.014327 steel|0.012536 blue|0.012536 medium|0.012178 sea|0.012178 green|0.012178 dark|0.011819 olive|0.011819 green|0.011819 firebrick|0.010208 navy|0.0089542 dark|0.0089542 blue|0.0089542 saddle|0.0059097 brown|0.0059097  "
		}
	}
}
