{
	"add": {
		"doc": {
			"id": "74bb9cec97000ce74573dde0fbfd6a4195975d9b43753e72c86cd0b3e6d2fe46",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Kentucky_Derby_2014-0214.jpg/260px-Kentucky_Derby_2014-0214.jpg",
				"previous": "Nineteen horses started, with 164,906 spectators gathered at Churchill Downs. It was the second-largest crowd in Kentucky Derby history.[14] Uncle Sigh and Chitu set the early pace, as jockey Victor Espinoza held California Chrome back in third, a bit off the pace. Coming around the final turn, California Chrome and then fourth place Samraat made a move, surging past the pace setters. The two horses remained neck-and-neck for several strides before California Chrome broke away and coasted to finish line, winning by 1 3/4 lengths. Long-shot Commanding Curve came from well back to claim second, while Danza took third. Wicked Strong placed fourth and Samraat faded to fifth.[15] For the win, California Chrome took home $1.418 million of the $2.178 million purse.[14]",
				"after": "California Chrome became the first California-bred horse to win the Derby since Decidedly in 1962. For Espinoza, it was his second Kentucky Derby win, his first coming in 2002 when he rode War Emblem to victory. After the race, trainer Art Sherman called Espinoza's ride \"perfect\".[15] At age 77, Sherman is the oldest trainer to win the race. His only previous experience at Churchill Downs was in 1955, when he was an exercise rider for Swaps. Swaps won the Derby that year.[15] Interviewed after the race, Sherman emotionally remarked, \"Well, when I went to Swaps' grave the other day I said a little prayer and it came true. I said I hope [California Chrome] is another Swaps.\"[13]",
			"color": "gray|0.30801 grey|0.30801 dark|0.24726 gray|0.24726 dark|0.24726 grey|0.24726 dim|0.14281 gray|0.14281 dim|0.14281 grey|0.14281 black|0.058782 silver|0.044439 light|0.024994 gray|0.024994 light|0.024994 grey|0.024994 gainsboro|0.019713 dark|0.017867 slate|0.017867 gray|0.017867 light|0.014011 slate|0.014011 gray|0.014011 slate|0.013488 gray|0.013488 light|0.0099932 steel|0.0099932 blue|0.0099932 dark|0.0077065 sea|0.0077065 green|0.0077065 lavender|0.0075809 white|0.0055209 smoke|0.0055209 rosy|0.0054104 brown|0.0054104 thistle|0.0050468  "
		}
	}
}
