{
	"add": {
		"doc": {
			"id": "74c758dfb80d7eeced26c09596f443d92a4f0c055bea68359ba16b16f40fec38",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Peterborough_River_Nene.jpg/220px-Peterborough_River_Nene.jpg",
			"previous": [],
				"after": "East Anglia is most notable for being almost flat. During the Ice Age much of the region was covered by ice sheets and this has influenced the topography and nature of the soils.[224] Much of Cambridgeshire is low-lying, in some places below present-day mean sea level.[225] The lowest point on land is supposedly just to the south of the city at Holme Fen, which is 2.75 metres (9 ft) below sea level. The largest of the many settlements along the Fen edge, Peterborough has been called the Gateway to the Fens. Before they were drained the Fens were liable to periodic flooding so arable farming was limited to the higher areas of the Fen edge, with the rest of the Fenland dedicated to pastoral farming. In this way, the mediaeval and early modern Fens stood in contrast to the rest of southern England, which was primarily arable. Since the advent of modern drainage in the nineteenth and twentieth centuries the Fens have been radically transformed such that arable farming has almost entirely replaced pastoral. The unitary authority extends north west to the settlements of Wothorpe and Wittering and east beyond Thorney into the Fens, and it includes the Ortons, south of the River Nene. It borders Northamptonshire to the west, Lincolnshire to the north, and the Cambridgeshire districts of Fenland and Huntingdonshire to the south and east. The city centre is located at 52°35'N latitude 0°15'W longitude or Ordnance Survey national grid reference TL 185 998.",
			"color": "dark|0.15605 gray|0.15605 dark|0.15605 grey|0.15605 gray|0.15564 grey|0.15564 dim|0.13811 gray|0.13811 dim|0.13811 grey|0.13811 light|0.11717 slate|0.11717 gray|0.11717 slate|0.093256 gray|0.093256 silver|0.08394 light|0.062436 gray|0.062436 light|0.062436 grey|0.062436 gainsboro|0.0478 light|0.039324 steel|0.039324 blue|0.039324 dark|0.021935 olive|0.021935 green|0.021935 tan|0.014362 olive|0.012675 lavender|0.011808  "
		}
	}
}
