{
	"add": {
		"doc": {
			"id": "74e82d8d15274074a57a06e9d1384aad66b6b7fa570b2a3fdf178c1f777ef76d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Surrender_of_General_Burgoyne.jpg/220px-Surrender_of_General_Burgoyne.jpg",
				"previous": "About one-third of the battles of the U.S. Revolutionary War took place in New York. The first major battle of the American Revolutionary War after independence was declared—and the largest battle of the entire war—was fought in New York at the Battle of Long Island (a.k.a. Battle of Brooklyn) in August 1776. With the British victory, they occupied New York City, making it their military and political base of operations in North America for the duration of the conflict, and consequently the focus of General George Washington's intelligence network. On the notorious British prison ships of Wallabout Bay, more American combatants died of intentional neglect than were killed in combat in every battle of the war, combined. Both sides of combatants lost more soldiers to disease than to outright wounds.The first of two major British armies were captured by the Continental Army at the Battle of Saratoga in 1777, a success that influenced France to ally with the revolutionaries.The state constitution was enacted in 1777. New York became the 11th state to ratify the United States Constitution, on July 26, 1788.",
				"after": "In an attempt to retain their sovereignty and remain an independent nation positioned between the new United States and British North America, four of the Iroquois Nations fought on the side of the British; only the Oneida and their dependents, the Tuscarora, allied themselves with the Americans.[30] In retaliation for attacks on the frontier led by Joseph Brant and Loyalist Mohawk and related forces, the Sullivan Expedition of 1778 and 1779 destroyed nearly 50 Iroquois villages, adjacent croplands and winter stores, forcing many refugees to British-held Niagara.[31]",
			"color": "black|0.63306 dim|0.060911 gray|0.060911 dim|0.060911 grey|0.060911 gray|0.037585 grey|0.037585 dark|0.032463 gray|0.032463 dark|0.032463 grey|0.032463 tan|0.028214 dark|0.02515 golden|0.02515 rod|0.02515 dark|0.018731 slate|0.018731 gray|0.018731  "
		}
	}
}
