{
	"add": {
		"doc": {
			"id": "74ed8ec05893cbaec91decff9642916c7baa39492b4213bad951a64c945add98",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Siphonops_paulensis02.jpg/220px-Siphonops_paulensis02.jpg",
			"previous": [],
				"after": "The order Gymnophiona (from the Greek gymnos meaning \"naked\" and ophis meaning \"serpent\") or Apoda (from the Latin an- meaning \"without\" and the Greek poda meaning \"legs\") comprises the caecilians. These are long, cylindrical, limbless animals with a snake- or worm-like form. The adults vary in length from 8 to 75 centimetres (3 to 30 inches) with the exception of Thomson's caecilian (Caecilia thompsoni), which can reach 150 centimetres (4.9 feet). A caecilian's skin has a large number of transverse folds and in some species contains tiny embedded dermal scales. It has rudimentary eyes covered in skin, which are probably limited to discerning differences in light intensity. It also has a pair of short tentacles near the eye that can be extended and which have tactile and olfactory functions. Most caecilians live underground in burrows in damp soil, in rotten wood and under plant debris, but some are aquatic.[47] Most species lay their eggs underground and when the larvae hatch, they make their way to adjacent bodies of water. Others brood their eggs and the larvae undergo metamorphosis before the eggs hatch. A few species give birth to live young, nourishing them with glandular secretions while they are in the oviduct.[48] Caecilians have a mostly Gondwanan distribution, being found in tropical regions of Africa, Asia and Central and South America.[49]",
			"color": "rosy|0.33831 brown|0.33831 misty|0.22938 rose|0.22938 light|0.071731 gray|0.071731 light|0.071731 grey|0.071731 gainsboro|0.05536 silver|0.045204 lavender|0.036184 blush|0.036184 pink|0.034013 thistle|0.021664 linen|0.018475 sea|0.01356 shell|0.01356 white|0.012106 smoke|0.012106 lavender|0.010686 snow|0.0095639 ghost|0.0087052 white|0.0087052 light|0.0084719 steel|0.0084719 blue|0.0084719 antique|0.0084274 white|0.0084274 alice|0.0074629 blue|0.0074629 light|0.0068151 pink|0.0068151 white|0.0065533 floral|0.0060917 white|0.0060917 dark|0.0059606 gray|0.0059606 dark|0.0059606 grey|0.0059606  "
		}
	}
}
