{
	"add": {
		"doc": {
			"id": "7528b7a9b0157c157730f34663ce3c8d77ff317b2de027b0c222f5241a7df90c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/WattsHallUnionPresbyterianSeminary.JPG/220px-WattsHallUnionPresbyterianSeminary.JPG",
				"previous": "There are seven current masjids in the Greater Richmond area, with three more currently in construction,[67][68][69] accommodating the growing Muslim population, the first one being Masjid Bilal.[70][71] In the 1950s, Muslims from the East End got organized under Nation of Islam (NOI). They used to meet in Temple #24 located on North Avenue. After the NOI split in 1975, the Muslims who joined mainstream Islam, start meeting at Shabaaz Restaurant on Nine Mile Road. By 1976, the Muslims used to meet in a rented church. They tried to buy this church, but due to financial difficulties the Muslims instead bought an old grocery store at Chimbarazoo Boulevard, the present location of Masjid Bilal. Initially, the place was called \"Masjid Muhammad #24\". Only by 1990 did the Muslims renamed it to \"Masjid Bilal\". Masjid Bilal was followed by the Islamic Center of Virginia, ICVA[72] masjid. The ICVA was established in 1973 as a non profit tax exempt organization. With aggressive fundraising, ICVA was able to buy land on Buford road. Construction of the new masjid began in the early 1980s. The rest of the five current masjids in the Richmond area are Islamic Center of Richmond (ICR)[73] in the west end, Masjid Umm Barakah[74] on 2nd street downtown, Islamic Society of Greater Richmond (ISGR)[75] in the west end, Masjidullah[76] in the north side, and Masjid Ar-Rahman[77] in the east end.",
				"after": "Hinduism is actively practiced, particularly in suburban areas of Henrico and Chesterfield. Some 6,000 families of Indian descent resided in the Richmond Region as of 2011. Hindus are served by several temples and cultural centers. The two most familiar are the Cultural Center of India (CCI) located off of Iron Bridge Road in Chesterfield County and the Hindu Center of Virginia in Henrico County which has garnered national fame and awards for being the first LEED certified religious facility in the commonwealth.",
			"color": "dark|0.43733 salmon|0.43733 dim|0.090271 gray|0.090271 dim|0.090271 grey|0.090271 gray|0.081579 grey|0.081579 dark|0.068374 gray|0.068374 dark|0.068374 grey|0.068374 rosy|0.039911 brown|0.039911 black|0.030362 peach|0.029639 puff|0.029639 silver|0.028998 tan|0.024615 dark|0.024175 olive|0.024175 green|0.024175 light|0.016207 salmon|0.016207 light|0.014993 gray|0.014993 light|0.014993 grey|0.014993 gainsboro|0.011101 burly|0.0086788 wood|0.0086788 bisque|0.0078614  "
		}
	}
}
