{
	"add": {
		"doc": {
			"id": "752d4bd9d34e1c45b6a7478e114f9787d586672c67b1f7ebfd32c53c103e0510",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Rhyoliteschool.jpg/220px-Rhyoliteschool.jpg",
				"previous": "Although the mine produced more than $1 million (equivalent to about $24 million in 2009)[27] in bullion in its first three years, its shares declined from $23 a share (in historical dollars) to less than $3.[38] In February 1908, a committee of minority stockholders, suspecting that the mine was overvalued, hired a British mining engineer to conduct an inspection. The engineer's report was unfavorable, and news of this caused a sudden further decline in share value from $3 to 75 cents.[39] Schwab expressed disappointment when he learned that \"the wonderful high-grade [ore] that had brought [the mine] fame was confined to only a few stringers and that what he had actually bought was a large low-grade mine.\"[38] Although the mine was still profitable, by 1909 no new ore was being discovered, and the value of the remaining ore steadily decreased. In 1910, the mine operated at a loss for most of the year, and on March 14, 1911, it was closed. By then, the stock, which had fallen to 10 cents a share, slid to 4 cents and was dropped from the exchanges.[40]",
				"after": "Rhyolite began to decline before the final closing of the mine. At roughly the same time that the Bullfrog mines were running out of high-grade ore, the 1906 San Francisco earthquake diverted capital to California while interrupting rail service, and the financial panic of 1907 restricted funding for mine development. As mines in the district reduced production or closed, unemployed miners left Rhyolite to seek work elsewhere, businesses failed, and by 1910, the census reported only 675 residents.[41] All three banks in the town closed by March 1910. The newspapers, including the Rhyolite Herald, the last to go, all shut down by June 1912. The post office closed in November 1913; the last train left Rhyolite Station in July 1914, and the Nevada-California Power Company turned off the electricity and removed its lines in 1916.[42] Within a year the town was \"all but abandoned\",[42] and the 1920 census reported a population of only 14.[36] A 1922 motor tour by the Los Angeles Times found only one remaining resident, a 92-year-old man who died in 1924.[43]",
			"color": "black|0.84142 silver|0.0279  "
		}
	}
}
