{
	"add": {
		"doc": {
			"id": "75356e1abfb81f13e1ccee32a1a4f58213ba919899e4f3ab3514dff78cf8998d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Michael_Jackson_Cannescropped.jpg/170px-Michael_Jackson_Cannescropped.jpg",
				"previous": "The first single released from the album was \"Scream/Childhood\". \"Scream\" was a duet, performed with Jackson's youngest sister Janet. The song fights against the media, mainly for what the media made him out to be during his 1993 child abuse allegations. The single had the highest debut on the Billboard Hot 100 at number five, and received a Grammy nomination for \"Best Pop Collaboration with Vocals\".[199] \"You Are Not Alone\" was the second single released from HIStory; it holds the Guinness World Record for the first song ever to debut at number one on the Billboard Hot 100 chart.[135] It was seen as a major artistic and commercial success, receiving a Grammy nomination for \"Best Pop Vocal Performance\".[199]",
				"after": "In late 1995, Jackson was rushed to a hospital after collapsing during rehearsals for a televised performance; the incident was caused by a stress-related panic attack.[200] \"Earth Song\" was the third single released from HIStory, and topped the UK Singles Chart for six weeks over Christmas 1995; it sold a million copies, making it Jackson's most successful single in the UK.[199] The track \"They Don't Care About Us\" became controversial when the Anti-Defamation League and other groups criticized its allegedly antisemitic lyrics. Jackson quickly put out a revised version of the song without the offending lyrics.[201] In 1996, Jackson won a Grammy for Best Music Video, Short Form for \"Scream\" and an American Music Award for Favorite Pop/Rock Male Artist.[52][202]",
			"color": "black|0.69632 rosy|0.063046 brown|0.063046 misty|0.027833 rose|0.027833 dark|0.027721 gray|0.027721 dark|0.027721 grey|0.027721 silver|0.020946 gray|0.018514 grey|0.018514 light|0.01823 gray|0.01823 light|0.01823 grey|0.01823 dim|0.017659 gray|0.017659 dim|0.017659 grey|0.017659 gainsboro|0.015199 white|0.0083421 smoke|0.0083421 alice|0.0071583 blue|0.0071583 ghost|0.0068208 white|0.0068208 snow|0.0063613 mint|0.005971 cream|0.005971 white|0.0059501 azure|0.005638 sea|0.0045197 shell|0.0045197 linen|0.0043876 floral|0.0043741 white|0.0043741  "
		}
	}
}
