{
	"add": {
		"doc": {
			"id": "753a5215026556f6ee63d6de5bacf498c6e2f55f9ce2c3ce82b27f0d99f8fe4b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Chamber_for_Welding_Fumes_%288743403735%29.jpg/220px-Chamber_for_Welding_Fumes_%288743403735%29.jpg",
				"previous": "Welding can be dangerous and unhealthy if the proper precautions are not taken. However, using new technology and proper protection greatly reduces risks of injury and death associated with welding.[52] Since many common welding procedures involve an open electric arc or flame, the risk of burns and fire is significant; this is why it is classified as a hot work process. To prevent injury, welders wear personal protective equipment in the form of heavy leather gloves and protective long sleeve jackets to avoid exposure to extreme heat and flames. Additionally, the brightness of the weld area leads to a condition called arc eye or flash burns in which ultraviolet light causes inflammation of the cornea and can burn the retinas of the eyes. Goggles and welding helmets with dark UV-filtering face plates are worn to prevent this exposure. Since the 2000s, some helmets have included a face plate which instantly darkens upon exposure to the intense UV light. To protect bystanders, the welding area is often surrounded with translucent welding curtains. These curtains, made of a polyvinyl chloride plastic film, shield people outside the welding area from the UV light of the electric arc, but can not replace the filter glass used in helmets.[53]",
				"after": "Welders are often exposed to dangerous gases and particulate matter. Processes like flux-cored arc welding and shielded metal arc welding produce smoke containing particles of various types of oxides. The size of the particles in question tends to influence the toxicity of the fumes, with smaller particles presenting a greater danger. This is because smaller particles have the ability to cross the blood brain barrier. Fumes and gases, such as carbon dioxide, ozone, and fumes containing heavy metals, can be dangerous to welders lacking proper ventilation and training.[54] Exposure to manganese welding fumes, for example, even at low levels (<0.2 mg/m3), may lead to neurological problems or to damage to the lungs, liver, kidneys, or central nervous system.[55] Nano particles can become trapped in the alveolar macrophages of the lungs and induce pulmonary fibrosis.[56] The use of compressed gases and flames in many welding processes poses an explosion and fire risk. Some common precautions include limiting the amount of oxygen in the air, and keeping combustible materials away from the workplace.[54]",
			"color": "black|0.5533 antique|0.051637 white|0.051637 dim|0.041946 gray|0.041946 dim|0.041946 grey|0.041946 dark|0.037276 gray|0.037276 dark|0.037276 grey|0.037276 gray|0.033164 grey|0.033164 beige|0.027925 silver|0.027733 papaya|0.027082 whip|0.027082 linen|0.02333 old|0.022099 lace|0.022099 blanched|0.019461 almond|0.019461 light|0.016372 gray|0.016372 light|0.016372 grey|0.016372 corn|0.01572 silk|0.01572 gainsboro|0.014246 floral|0.01361 white|0.01361 sea|0.013275 shell|0.013275 ivory|0.011864 wheat|0.01049  "
		}
	}
}
