{
	"add": {
		"doc": {
			"id": "755af9b7e9236c58fe740116947669cd691794629827f46ccd97d0dde2cf9b29",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Ursula_Franklin_at_book_launch_cropped_for_MP.jpg/120px-Ursula_Franklin_at_book_launch_cropped_for_MP.jpg",
				"previous": "Portal:Society/Featured biography/8",
				"after": "Ursula Franklin (born 1921) is a Canadian metallurgist, research physicist, author and educator who has taught at the University of Toronto for more than 40 years. She is the author of The Real World of Technology, which is based on her 1989 Massey Lectures, and The Ursula Franklin Reader: Pacifism as a Map, a collection of her papers, interviews, and talks. Franklin is a practising Quaker and has been active in working on behalf of pacifist and feminist causes. Franklin has received numerous honours and awards, including the Governor General's Award in Commemoration of the Persons Case for promoting the equality of girls and women in Canada and the Pearson Medal of Peace for her work in advancing human rights. Franklin is best known for her writings on the political and social effects of technology. For her, technology is a comprehensive system that includes methods, procedures, organization, \"and most of all, a mindset\". She distinguishes between holistic technologies used by craft workers or artisans and prescriptive ones associated with a division of labour in large-scale production. Franklin argues that the dominance of prescriptive technologies in modern society discourages critical thinking and promotes \"a culture of compliance\".",
			"color": "dark|0.15645 gray|0.15645 dark|0.15645 grey|0.15645 gray|0.14961 grey|0.14961 dim|0.12056 gray|0.12056 dim|0.12056 grey|0.12056 peach|0.079094 puff|0.079094 silver|0.064024 rosy|0.054553 brown|0.054553 light|0.049427 gray|0.049427 light|0.049427 grey|0.049427 gainsboro|0.042553 misty|0.036918 rose|0.036918 antique|0.027079 white|0.027079 bisque|0.024035 linen|0.020869 black|0.014636 sea|0.013703 shell|0.013703 old|0.013617 lace|0.013617 blanched|0.012232 almond|0.012232 papaya|0.012173 whip|0.012173 tan|0.011569 white|0.010497 smoke|0.010497 floral|0.010319 white|0.010319 snow|0.0068065 thistle|0.0067934 lavender|0.00666 blush|0.00666 pink|0.0064581 ivory|0.0062005 beige|0.0058346  "
		}
	}
}
