{
	"add": {
		"doc": {
			"id": "75a7de051640cd9c11bde641b6f266ac68b96a38d0693a7591bcbef65b8bb1fe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/The_Sandlings.JPG/220px-The_Sandlings.JPG",
				"previous": "In 1958, as part of the commemorations of the 70th anniversary of the creation of the Wood Green Local Board, the railway goods depot was used for a three-day exhibition of locomotives and other railway rolling stock. The exhibition was a great success, and was visited by around 14,000 spectators.[27] Among locomotives on exhibit were the land speed record holder Mallard and a Class 9F steam locomotive.[57]",
				"after": "However, by this point the Palace Gates Line was in severe decline. Passenger numbers had fallen greatly since the opening of the Piccadilly line, while freight usage dropped throughout the 1950s as a result of improved road haulage and declining demand for coal. The line was closed to passengers on 7 January 1963.[7] With freight usage dwindling to a trickle following the ending of passenger services, the goods yard was closed on 7 December 1964.[27] The site of the goods yard was used for the construction of a large apartment block known as The Sandlings,[2] and Noel Park & Wood Green railway station was converted into commercial premises, before being demolished in the early 1970s to become the site of the eastern section of Wood Green Shopping City.[17]",
			"color": "dim|0.53639 gray|0.53639 dim|0.53639 grey|0.53639 gray|0.11434 grey|0.11434 dark|0.042537 gray|0.042537 dark|0.042537 grey|0.042537 light|0.041151 blue|0.041151 powder|0.030681 blue|0.030681 sky|0.024447 blue|0.024447 silver|0.02361 black|0.019403 light|0.015414 sky|0.015414 blue|0.015414 light|0.013744 gray|0.013744 light|0.013744 grey|0.013744 tan|0.013062 light|0.011614 cyan|0.011614 burly|0.011116 wood|0.011116 pale|0.010315 turquoise|0.010315 light|0.010229 steel|0.010229 blue|0.010229 gainsboro|0.0088546 lavender|0.0069404 slate|0.0069189 gray|0.0069189  "
		}
	}
}
