{
	"add": {
		"doc": {
			"id": "75bc7941e84ec16f2025ddedfddb5958ce859f29f66e6b3c47f439f6963c7de5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Kranz_on_Console_-_GPN-2000-001406.jpg/220px-Kranz_on_Console_-_GPN-2000-001406.jpg",
				"previous": "During the Gemini program, Kraft's role changed again. He was now the head of mission operations, in charge of a team of flight directors, although still also serving as a flight director himself. Due to the greater length of Gemini missions, Mission Control was now manned on a three-shift basis. \"Clearly, with flight control facing a learning curve,\" space historian David Harland has said, \"these arrangements were an experiment in their own right.\"[28] Yet Kraft proved to be remarkably successful at passing on responsibility to his fellow flight directors—arguably too successful, as Gene Kranz found during his first shift handover on Gemini 4. As Kranz recalled, \"He just said, 'You're in charge,' and walked out.\"[29]",
				"after": "The Gemini program represented a string of firsts for NASA—the first flight with two astronauts, the first rendezvous in space, the first spacewalk—and Kraft was on duty during many of these historic events. America's first spacewalk happened during the Gemini 4 mission; Kraft, at his console, found that he had to force himself to concentrate on his work, distracted by Ed White's \"mesmerizing\" descriptions of the Earth below.[30] He could easily understand the euphoria that White felt at the spectacle, yet he also was mindful of the discipline required to keep the flight safe. White delayed his return to the capsule, and a communication problem prevented capsule communicator Gus Grissom from getting the crew to hear the order to terminate the spacewalk. When contact was finally re-established, Kraft expressed his frustration on his ground loop to Grissom:",
			"color": "dark|0.2548 gray|0.2548 dark|0.2548 grey|0.2548 silver|0.15541 gray|0.14865 grey|0.14865 light|0.098079 gray|0.098079 light|0.098079 grey|0.098079 gainsboro|0.075699 dim|0.062358 gray|0.062358 dim|0.062358 grey|0.062358 white|0.02917 smoke|0.02917 sea|0.02194 shell|0.02194 linen|0.02162 snow|0.020174 ghost|0.019778 white|0.019778 alice|0.019676 blue|0.019676 floral|0.018196 white|0.018196 white|0.015965 lavender|0.013742 blush|0.013742 mint|0.01243 cream|0.01243 azure|0.0088737 ivory|0.0034426  "
		}
	}
}
