{
	"add": {
		"doc": {
			"id": "75cc83539fad2a41532a62570dab63261ab9024c8dc80f383600415f7b835da8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/White_Deer_Hole_Creek_near_1st_Gap.JPG/170px-White_Deer_Hole_Creek_near_1st_Gap.JPG",
				"previous": "The Great Island Path was a major trail that ran north along the Susquehanna River from the Saponi village of Shamokin at modern Sunbury, fording the river there and following the west bank of the West Branch Susquehanna River north until White Deer Hole valley. The path turned west at Allenwood and followed White Deer Hole Creek until about the present location of Elimsport. There it headed northwest, crossed North White Deer Ridge and passed west through the Nippenose valley, then turned north and crossed Bald Eagle Mountain via McElhattan Creek and ran along the south bank of the river to the Great Island (near the present day city of Lock Haven). The stretch from the mouth of the creek to the Nippenose valley is approximately followed by Route 44. From the Great Island, the Great Shamokin Path continued further west to the modern boroughs of Clearfield and Kittanning, the last on the Allegheny River.[38]",
				"after": "Culbertson's Path followed White Deer Hole Creek west from Allenwood, then followed Spring Creek north, crossed Bald Eagle Mountain and followed Mosquito Run to the river at the current borough of Duboistown. Here it crossed the river to \"French Margaret's Town\" (western modern day Williamsport) before joining the major Sheshequin Path, which led north up Lycoming Creek to the North Branch of the Susquehanna River, modern New York, and the Iroquois there. These trails were only wide enough for one person, but settlers in White Deer Hole valley broadened the path to DuBoistown to take grain to Culbertson's mill on Mosquito Run, hence the name.[38] Culbertson's Path was used as a part of the Underground Railroad until the American Civil War began in 1861. Escaped slaves would often wade in creeks to hide their scent from pursuing bloodhounds.[39] In 2009, there is still a \"Culbertson's Trail\", for hiking over Bald Eagle Mountain from Pennsylvania Route 554 to Duboistown.[14]",
			"color": "dim|0.41763 gray|0.41763 dim|0.41763 grey|0.41763 gray|0.2009 grey|0.2009 dark|0.10914 gray|0.10914 dark|0.10914 grey|0.10914 slate|0.061502 gray|0.061502 light|0.046901 slate|0.046901 gray|0.046901 silver|0.040073 light|0.023019 gray|0.023019 light|0.023019 grey|0.023019 black|0.021452 gainsboro|0.016634 white|0.0063378 smoke|0.0063378 ghost|0.0050609 white|0.0050609 alice|0.0048999 blue|0.0048999 lavender|0.0047085 blush|0.0047085 snow|0.0045142 light|0.0042212 steel|0.0042212 blue|0.0042212  "
		}
	}
}
