{
	"add": {
		"doc": {
			"id": "75de2a5fff02d7af8cc1f3fdfda94a987efa4aa953c0562c66cebded1845ded3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Gilbert-GS-Big.JPG/200px-Gilbert-GS-Big.JPG",
			"previous": [],
				"after": "Gilbert and Sullivan refers to the Victorian era partnership of librettist W. S. Gilbert (1836–1911) and composer Arthur Sullivan (1842–1900). Together, they wrote fourteen comic operas between 1871 and 1896, of which H.M.S. Pinafore, The Pirates of Penzance, and The Mikado are among the best known. Gilbert, who wrote the words, created fanciful \"topsy-turvy\" worlds for these operas, where each absurdity is taken to its logical conclusion—fairies rub elbows with British lords, flirting is a capital offence, gondoliers ascend to the monarchy, and pirates turn out to be noblemen who have gone wrong. Sullivan, six years Gilbert's junior, composed the music, contributing memorable melodies that could convey both humour and pathos. Producer Richard D'Oyly Carte brought Gilbert and Sullivan together and nurtured their collaboration. He built the Savoy Theatre in 1881 to present their joint works—which came to be known as the Savoy Operas—and he founded the D'Oyly Carte Opera Company, which performed and promoted their works for over a century. The Gilbert and Sullivan operas have enjoyed broad and enduring international success and are still performed frequently throughout the English-speaking world. The collaboration introduced innovations in content and form that directly influenced the development of musical theatre through the 20th century. The operas have also influenced political discourse, literature, film and television and have been widely parodied and pastiched by humorists.",
			"color": "dark|0.16442 gray|0.16442 dark|0.16442 grey|0.16442 gray|0.15273 grey|0.15273 silver|0.10415 dim|0.090369 gray|0.090369 dim|0.090369 grey|0.090369 light|0.088772 gray|0.088772 light|0.088772 grey|0.088772 gainsboro|0.078959 white|0.046552 smoke|0.046552 alice|0.033518 blue|0.033518 ghost|0.032977 white|0.032977 sea|0.032395 shell|0.032395 snow|0.031962 lavender|0.03147 blush|0.03147 white|0.028224 mint|0.024901 cream|0.024901 linen|0.021592 floral|0.018876 white|0.018876 azure|0.016324  "
		}
	}
}
