{
	"add": {
		"doc": {
			"id": "75e80cbe7f5d6588514da810f6a3f75d7238cef9050c54210a2ddf29317a33a2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/First_Barber_pattern.png/170px-First_Barber_pattern.png",
				"previous": "Frustrated at the competition's outcome, Leech on June 11, 1891 instructed Barber to prepare designs for the half dollar, quarter, and dime. As the Morgan dollar was then being heavily struck, the Mint director decided to leave that design unaltered for the time being. For the obverse of the new coins, Leech suggested a depiction of Liberty similar to that on the French coins of the period; he was content that the current reverses be continued. Leech had previously suggested to Barber that he engage outside help if the work was to be done at the Mint; the chief engraver replied that he was aware of no one who could be of help in the preparation of new designs. Leech had spoken with Saint-Gaudens on the same subject; the sculptor stated that only four men in the world were capable of executing high-quality coin designs; three lived in France and he was the fourth.[20]",
				"after": "Leech announced the decision to have Barber do the work in July, stating that he had instructed the engraver to prepare designs for presentation to Secretary of the Treasury Charles Foster. In a letter printed in the New York Tribune, Gilder expressed disappointment that the Mint was planning to generate the new designs in-house, feeling that the Mint, essentially a factory for coins, was ill-equipped to generate artistic coin designs. Due to Gilder's prominence in the coinage redesign movement, Leech felt the need to respond personally, which he did in early August. He told Gilder that \"artistic designs for coins, that would meet the ideas of an art critic like yourself, and artists generally, are not always adapted for practical coining\".[21] He assured Gilder that the designs which Barber had already prepared had met with the approval of Mitchell, though Leech himself had some improvements to suggest to the chief engraver.[22]",
			"color": " "
		}
	}
}
