{
	"add": {
		"doc": {
			"id": "75fcefd221e478796aea8b985840def72d8b1c6d0251d8ad4e824c5e8889f378",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/KoKo_1926.jpg/150px-KoKo_1926.jpg",
				"previous": "Gentlemen of the Japanese town of Titipu are gathered (\"If you want to know who we are\"). A wandering musician, Nanki-Poo, enters and introduces himself (\"A wand'ring minstrel I\"). He inquires about his beloved, the maiden Yum-Yum, a ward of Ko-Ko (formerly a cheap tailor). One of the gentlemen, Pish-Tush, explains that when the Mikado decreed that flirting was a capital crime, the Titipu authorities frustrated the decree by appointing Ko-Ko, a prisoner condemned to death for flirting, to the post of Lord High Executioner (\"Our great Mikado, virtuous man\"). Ko-Ko was \"next\" to be decapitated, and the Titipu authorities reasoned that he could \"not cut off another's head until he cut his own off\", and since Ko-Ko was not likely to try to execute himself, no executions could take place. However, all officials but the haughty Pooh-Bah proved too proud to serve under an ex-tailor, and Pooh-Bah now holds all their posts—and collects all their salaries. Pooh-Bah informs Nanki-Poo that Yum-Yum is scheduled to marry Ko-Ko on that very day (\"Young man, despair\").",
				"after": "Ko-Ko enters (\"Behold the Lord High Executioner\"), and asserts himself by reading off a list of people \"who would not be missed\" if they were executed (\"As some day it may happen\"). Soon, Yum-Yum appears with two of her friends (sometimes referred to as her \"sisters\"), Peep-Bo and Pitti-Sing (\"Comes a train of little ladies\", \"Three little maids from school\"). Ko-Ko encourages a respectful greeting between Pooh-Bah and the young girls, but Pooh-Bah will have none of it (\"So please you, sir\"). Nanki-Poo arrives on the scene and informs Ko-Ko of his love for Yum-Yum. Ko-Ko sends him away, but Nanki-Poo manages to meet with his beloved and reveals his secret to Yum-Yum: he is the son and heir of the Mikado, but he's travelling in disguise to avoid the amorous advances of Katisha, an elderly lady of his father's court. They lament over what the law forbids them to do (\"Were you not to Ko-Ko plighted\").",
			"color": "black|0.68554 dim|0.02377 gray|0.02377 dim|0.02377 grey|0.02377 gray|0.023025 grey|0.023025 dark|0.0192 gray|0.0192 dark|0.0192 grey|0.0192 ivory|0.018643 floral|0.018569 white|0.018569 linen|0.018506 old|0.018381 lace|0.018381 sea|0.017677 shell|0.017677 mint|0.016263 cream|0.016263 white|0.015139 smoke|0.015139 snow|0.014265 white|0.013579 silver|0.0115 honeydew|0.011439 beige|0.010775 light|0.0097686 gray|0.0097686 light|0.0097686 grey|0.0097686 antique|0.0089506 white|0.0089506 gainsboro|0.0078579  "
		}
	}
}
