{
	"add": {
		"doc": {
			"id": "76021317081aa996d90aa0c710e9cd93d6c5dfa31abe0c5ee30731c91ba4f063",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/FAM_18_Round_the_World_1939.jpg/170px-FAM_18_Round_the_World_1939.jpg",
				"previous": "Equally critical to the 314's success was the proficiency of its Pan Am flight crews, who were extremely skilled at long-distance, over-water flight operations and navigation. For training, many of the transpacific flights carried a second crew.[9] Only the very best and most experienced flight crews were assigned Boeing 314 flying boat duty. Before coming aboard, all Pan Am captains as well as first and second officers had thousands of hours of flight time in other seaplanes and flying boats. Rigorous training in dead reckoning, timed turns, judging drift from sea current, astral navigation, and radio navigation were conducted. In conditions of poor or no visibility, pilots sometimes made successful landings at fogged-in harbors by landing out to sea, then taxiing the 314 into port.[10]",
				"after": "The first 314 flight on the San Francisco-Hong Kong route left Alameda on February 23, 1939 with regular passenger and Air Mail service beginning on March 29.[11][12] A one-way trip on this route took over six days to complete. Commercial passenger service lasted less than three years, ending when the United States entered World War II in December 1941.",
			"color": "misty|0.1041 rose|0.1041 pink|0.095939 pale|0.086521 violet|0.086521 red|0.086521 light|0.072984 pink|0.072984 sea|0.048412 shell|0.048412 floral|0.048187 white|0.048187 white|0.044784 smoke|0.044784 mint|0.044471 cream|0.044471 linen|0.044139 snow|0.042168 lavender|0.04182 blush|0.04182 white|0.039303 ivory|0.03909 honeydew|0.035436 old|0.032596 lace|0.032596 rosy|0.032372 brown|0.032372 azure|0.027034 gainsboro|0.021209 ghost|0.020687 white|0.020687 light|0.015265 gray|0.015265 light|0.015265 grey|0.015265 alice|0.012056 blue|0.012056 light|0.011279 cyan|0.011279 beige|0.0087292 antique|0.008256 white|0.008256 brown|0.0044144 silver|0.0042182  "
		}
	}
}
