{
	"add": {
		"doc": {
			"id": "760b55788f48648cb3a7c13c2949fce93b10235292b72c1cac88016b8e631729",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Amazona_vittata.jpg/220px-Amazona_vittata.jpg",
				"previous": "Conservation efforts include both land and species protection. Approximately 8.95 km² (equal to 3.4% of total land area) divided among 34 reserves are protected in Puerto Rico.[3] According to the IUCN there are 21 threatened species in Puerto Rico: 2 mammals, 8 breeding birds, 8 reptiles, and 3 amphibians. The U.S. federal government lists 5 mammals, 2 amphibians, 8 birds, and 10 reptiles under the Federal Endangered Species Act. The Puerto Rican government, through the Department of Natural and Environmental Resources (DNER), produces its own threatened species list which includes 18 critically endangered species (3 amphibians, 7 birds, 3 reptiles, 2 fish and 3 invertebrates), and 14 endangered species.[55] The DNER follows the IUCN classification scheme for species' priority assignment.",
				"after": "Birds currently receive the greatest attention in regards to conservation. Arguably the most successful fauna recovery plan in Puerto Rico was the Puerto Rican Parrot Recovery Plan. Initiated in 1968, its main objective was to downlist the Puerto Rican Parrot's status from critical to threatened by the year 2020. Other objectives include the establishment of two separate, effective, wild populations (500 or more individuals for 5 years), the protection of habitat for those populations and the control of predators, parasites and competitors of the species. Currently, the total wild parrot population is estimated at 44 individuals, and 105 birds are in captivity.[56] This program was fundamental in raising ecological awareness in Puerto Rico.",
			"color": "black|0.2059 dim|0.090345 gray|0.090345 dim|0.090345 grey|0.090345 dark|0.083395 sea|0.083395 green|0.083395 dark|0.073407 gray|0.073407 dark|0.073407 grey|0.073407 gray|0.072394 grey|0.072394 dark|0.070289 slate|0.070289 gray|0.070289 gainsboro|0.0599 silver|0.054046 light|0.049791 gray|0.049791 light|0.049791 grey|0.049791 powder|0.045599 blue|0.045599 sea|0.015009 green|0.015009 honeydew|0.013982 white|0.013077 smoke|0.013077 linen|0.012651 light|0.012375 cyan|0.012375 mint|0.010669 cream|0.010669 sea|0.0098939 shell|0.0098939 floral|0.0095606 white|0.0095606  "
		}
	}
}
