{
	"add": {
		"doc": {
			"id": "761fd43d7587c2488b54d7edd75971abc2b51d898483f29d7d0a6d777daf5a3e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Xenon_short_arc_1.jpg/220px-Xenon_short_arc_1.jpg",
				"previous": "In many applications, the noble gases are used to provide an inert atmosphere. Argon is used in the synthesis of air-sensitive compounds that are sensitive to nitrogen. Solid argon is also used for the study of very unstable compounds, such as reactive intermediates, by trapping them in an inert matrix at very low temperatures.[72] Helium is used as the carrier medium in gas chromatography, as a filler gas for thermometers, and in devices for measuring radiation, such as the Geiger counter and the bubble chamber.[61] Helium and argon are both commonly used to shield welding arcs and the surrounding base metal from the atmosphere during welding and cutting, as well as in other metallurgical processes and in the production of silicon for the semiconductor industry.[60]",
				"after": "Noble gases are commonly used in lighting because of their lack of chemical reactivity. Argon, mixed with nitrogen, is used as a filler gas for incandescent light bulbs.[60] Krypton is used in high-performance light bulbs, which have higher color temperatures and greater efficiency, because it reduces the rate of evaporation of the filament more than argon; halogen lamps, in particular, use krypton mixed with small amounts of compounds of iodine or bromine.[60] The noble gases glow in distinctive colors when used inside gas-discharge lamps, such as \"neon lights\". These lights are called after neon but often contain other gases and phosphors, which add various hues to the orange-red color of neon. Xenon is commonly used in xenon arc lamps which, due to their nearly continuous spectrum that resembles daylight, find application in film projectors and as automobile headlamps.[60]",
			"color": "dim|0.24419 gray|0.24419 dim|0.24419 grey|0.24419 gray|0.21947 grey|0.21947 dark|0.15439 gray|0.15439 dark|0.15439 grey|0.15439 light|0.072776 slate|0.072776 gray|0.072776 slate|0.070233 gray|0.070233 light|0.059751 steel|0.059751 blue|0.059751 black|0.045317 silver|0.035569 light|0.017728 gray|0.017728 light|0.017728 grey|0.017728 light|0.016696 blue|0.016696 gainsboro|0.012444  "
		}
	}
}
