{
	"add": {
		"doc": {
			"id": "762a410aad27e06f6fefe72fb7c38306891153250a20949bd20fc06cd505fa29",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Inside_the_United_States_Supreme_Court.jpg/220px-Inside_the_United_States_Supreme_Court.jpg",
				"previous": "Many of the internal operations of the Court are organized by the seniority of the justices; the Chief Justice is considered the most senior member of the Court, regardless of the length of his or her service. The Associate Justices are then ranked by the length of their service.",
				"after": "During Court sessions, the justices sit according to seniority, with the Chief Justice in the center, and the Associate Justices on alternating sides, with the most senior Associate Justice on the Chief Justice's immediate right, and the most junior Associate Justice seated on the left farthest away from the Chief Justice. Therefore, the current court sits as follows from left to right, from the perspective of those facing the Court: Sotomayor, Breyer, Thomas, Scalia (most senior Associate Justice), Roberts (Chief Justice), Kennedy, Ginsburg, Alito, and Kagan (most junior Associate Justice). In the official yearly Court photograph, justices are arranged similarly, with the five most senior members sitting in the front row in the same order as they would sit during Court sessions (Thomas, Scalia, Roberts, Kennedy, Ginsburg), and the four most junior justices standing behind them, again in the same order as they would sit during Court sessions (Sotomayor, Breyer, Alito, Kagan).",
			"color": "maroon|0.17793 black|0.16422 dark|0.12154 red|0.12154 firebrick|0.069322 brown|0.038607 pale|0.031119 golden|0.031119 rod|0.031119 chocolate|0.025513 floral|0.02043 white|0.02043 sea|0.019762 shell|0.019762 white|0.018886 smoke|0.018886 snow|0.018838 navajo|0.018747 white|0.018747 mint|0.01874 cream|0.01874 white|0.018558 sandy|0.017621 brown|0.017621 azure|0.016022 ghost|0.015835 white|0.015835 moccasin|0.015155 alice|0.014491 blue|0.014491 ivory|0.011797 wheat|0.011666 burly|0.010426 wood|0.010426 lavender|0.0095323 blush|0.0095323 lemon|0.0095218 chiffon|0.0095218 tan|0.0081562 light|0.0069107 golden|0.0069107 rod|0.0069107 yellow|0.0069107 sienna|0.0066983 linen|0.0066739 old|0.0061535 lace|0.0061535  "
		}
	}
}
