{
	"add": {
		"doc": {
			"id": "7630baf2be933f024a192ccea13baaa11a5fe9b49d6de07e5016dd5d16ec122e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Plutonium_pellet.jpg/220px-Plutonium_pellet.jpg",
				"previous": "Plutonium recovered from spent reactor fuel poses a less significant proliferation hazard, because of excessive contamination with non-fissile plutonium-240 and plutonium-242. Separation of the isotopes is not feasible. A dedicated reactor operating on very low burnup (hence minimal exposure of newly formed plutonium-239 to additional neutrons which causes it to be transformed to heavier isotopes of plutonium) is generally required to produce material suitable for use in efficient nuclear weapons. While \"weapons-grade\" plutonium is defined to contain at least 92% plutonium-239 (of the total plutonium), the United States have managed to detonate an under-20Kt device using plutonium believed to contain only about 85% plutonium-239, so called '\"fuel-grade\" plutonium.[99] The \"reactor-grade\" plutonium produced by a regular LWR burnup cycle typically contains less than 60% Pu-239, with up to 30% parasitic Pu-240/Pu-242, and 10–15% fissile Pu-241.[99] It is unknown if a device using plutonium obtained from reprocessed civil nuclear waste can be detonated, however such a device could hypothetically fizzle and spread radioactive materials over a large urban area. The IAEA conservatively classifies plutonium of all isotopic vectors as \"direct-use\" material, that is, \"nuclear material that can be used for the manufacture of nuclear explosives components without transmutation or further enrichment\".[99]",
				"after": "The isotope plutonium-238 has a half-life of 87.74 years.[100] It emits a large amount of thermal energy with low levels of both gamma rays/particles and spontaneous neutron rays/particles.[101] Being an alpha emitter, it combines high energy radiation with low penetration and thereby requires minimal shielding. A sheet of paper can be used to shield against the alpha particles emitted by plutonium-238. One kilogram of the isotope can generate about 570 watts of heat.[5][101]",
			"color": "black|0.60045 chocolate|0.38728  "
		}
	}
}
