{
	"add": {
		"doc": {
			"id": "763b6d4bf38b9bff623654a44a4797e5eee0ff05743e34718cbe6573b34c6863",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/VW_Polo_I_front_20090810.jpg/220px-VW_Polo_I_front_20090810.jpg",
			"previous": [],
				"after": "While Volkswagen's range of cars soon became similar to that of other large European automakers, the Golf has been the mainstay of the Volkswagen lineup since its introduction, and the mechanical basis for several other cars of the company. There have been seven generations of the Volkswagen Golf, the first of which was produced from the summer of 1974 until the end of 1983 (sold as the Rabbit in the United States and Canada and as the Caribe in Latin America). Its chassis also spawned the Volkswagen Scirocco sport coupe, Volkswagen Jetta saloon/sedan, Volkswagen Golf Cabriolet convertible, and Volkswagen Caddy pick-up. North American production of the Rabbit commenced at the Volkswagen Westmoreland Assembly Plant near New Stanton, Pennsylvania in 1978. It would be produced in the United States as the Rabbit until the spring of 1984. The second-generation Golf hatchback/Jetta sedan ran from late 1983 to late 1991, and a North American version produced at Westmoreland Assembly went on sale at the start of the 1985 model year. The production numbers of the first-generation Golf has continued to grow annually in South Africa as the Citi Golf, with only minor modifications to the interior, engine and chassis, using tooling relocated from the New Stanton, Pennsylvania plant when that site began to build the Second Generation car.",
			"color": "dark|0.30269 khaki|0.30269 black|0.21201 dark|0.1753 gray|0.1753 dark|0.1753 grey|0.1753 gray|0.087811 grey|0.087811 dim|0.074619 gray|0.074619 dim|0.074619 grey|0.074619 pale|0.032782 golden|0.032782 rod|0.032782 silver|0.029919 light|0.0185 slate|0.0185 gray|0.0185 slate|0.018113 gray|0.018113 light|0.0091051 gray|0.0091051 light|0.0091051 grey|0.0091051  "
		}
	}
}
