{
	"add": {
		"doc": {
			"id": "7658f39147843b6c815f30f3fb97a647b3aba8be2b857e35362a34793509a27b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Poole.quay.750pix.jpg/220px-Poole.quay.750pix.jpg",
			"previous": [],
				"after": "Poole Quay is a visitor attraction to the south of the town centre lined with a mixture of traditional public houses, redeveloped warehouses, modern apartment blocks and historic listed buildings. Once the busy centre of Poole's maritime industry, all port activities moved to Hamworthy in the 1970s as the Quay became increasingly popular with tourists. The Grade II* listed Customs House on the quay-front was built in 1814 and now functions as a restaurant and bar.[74] Nearby the Grade I listed Town Cellars, a medieval warehouse built in the 15th century on the foundations of a 14th-century stone building, houses a local history centre.[75] Scaplen's Court, another Grade I listed building, also dates from the medieval era.[76] The Poole Pottery production factory once stood on the eastern end of the Quay but the site was redeveloped into a luxury apartment block and marina in 2001, although an outlet store remains on the site.[77] Boats regularly depart from the quay during the summer and provide cruises around the harbour and to Brownsea Island, the River Frome and Swanage.[78] Public artworks along the Quay include Sea Music – a large metal sculpture designed by Sir Anthony Caro, and a life-size bronze sculpture of Robert Baden-Powell created to celebrate the founding of the Scout Movement on Brownsea Island.[79] At the western end of the quay near the mouth of Holes Bay is Poole Bridge. Built in 1927, it is the third bridge to be located on the site since 1834.[80]",
			"color": "dark|0.23177 gray|0.23177 dark|0.23177 grey|0.23177 gray|0.1767 grey|0.1767 dim|0.13303 gray|0.13303 dim|0.13303 grey|0.13303 silver|0.10435 light|0.056483 gray|0.056483 light|0.056483 grey|0.056483 black|0.055506 gainsboro|0.036334 light|0.022063 slate|0.022063 gray|0.022063 slate|0.021756 gray|0.021756 rosy|0.017276 brown|0.017276 white|0.011895 smoke|0.011895 sea|0.0095076 shell|0.0095076 linen|0.0092016 snow|0.0088695 floral|0.0078803 white|0.0078803 white|0.0075769 ghost|0.0075532 white|0.0075532 mint|0.0074249 cream|0.0074249 alice|0.0073014 blue|0.0073014 dark|0.005789 slate|0.005789 gray|0.005789 azure|0.0054605 lavender|0.0050564 blush|0.0050564  "
		}
	}
}
