{
	"add": {
		"doc": {
			"id": "765d607412edf071bec1c50022ba1e0944adff43e1bdcceb2fabcb18114d6970",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/C17_aircraft_alt.jpg/220px-C17_aircraft_alt.jpg",
				"previous": "The US Air Force Fitness Test (AFFT) is designed to test the abdominal circumference, muscular strength/endurance and cardiovascular respiratory fitness of airmen in the USAF. As part of the Fit to Fight program, the USAF adopted a more stringent physical fitness assessment; the new fitness program was put into effect on 1 June 2010. The annual ergo-cycle test which the USAF had used for several years had been replaced in 2004. In the AFFT, Airmen are given a score based on performance consisting of four components: waist circumference, the sit-up, the push-up, and a 1.5-mile (2.4 km) run. Airmen can potentially earn a score of 100, with the run counting as 60%, waist circumference as 20%, and both strength test counting as 10% each. A passing score is 75 points. Effective 1 July 2010, the AFFT is administered by the base Fitness Assessment Cell (FAC), and is required twice a year. Personnel may test once a year if he or she earns a score above a 90%. Additionally, only meeting the minimum standards on each one of these test will not get you a passing score of 75%, and failing any one component will result in a failure for the entire test.",
				"after": "The Air Force can provide rapid global mobility, which lies at the heart of U.S. strategy in this environment—without the capability to project forces, there is no conventional deterrent. As U.S. forces stationed overseas continue to decline, global interests remain, making the unique mobility capabilities of the USAF even more in demand. Air mobility is a national asset of growing importance for responding to emergencies and protecting American interests around the globe.",
			"color": "slate|0.18007 gray|0.18007 light|0.12635 slate|0.12635 gray|0.12635 light|0.09554 steel|0.09554 blue|0.09554 silver|0.069669 gainsboro|0.068134 light|0.06372 gray|0.06372 light|0.06372 grey|0.06372 white|0.04221 smoke|0.04221 sea|0.034725 shell|0.034725 linen|0.033683 snow|0.031756 ghost|0.02763 white|0.02763 white|0.026355 dark|0.024386 gray|0.024386 dark|0.024386 grey|0.024386 mint|0.024166 cream|0.024166 floral|0.024122 white|0.024122 black|0.021523 lavender|0.021239 blush|0.021239 gray|0.019987 grey|0.019987 alice|0.019621 blue|0.019621 old|0.0132 lace|0.0132 azure|0.013093 dim|0.012816 gray|0.012816 dim|0.012816 grey|0.012816  "
		}
	}
}
