{
	"add": {
		"doc": {
			"id": "76721e12eee5b4e139bef312d22302a9a972a5a6f32eb311e9a9f459aaf1c115",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/MSU_Marshall-Adams_Hall_sepia.jpg/170px-MSU_Marshall-Adams_Hall_sepia.jpg",
				"previous": "When a 1916 fire destroyed M.A.C.'s nine-year-old engineering hall, there was a movement to have the entire program absorbed by the University of Michigan.[32] Lansing automobile magnate Ransom E. Olds, however, solidified the program on the East Lansing campus with a gift of $100,000 in 1917 for a new engineering building to be erected directly upon the foundations of the burned hall.[33] The donation, the College's first significant private gift for a building, resulted in Olds Hall. The original building is still standing but now houses MSU's University Relations division as well as classroom space.",
				"after": "In 1914, the United States Congress passed the Smith–Lever Act, which provided federal funding for a system of state cooperative extension service. Like T.C. Abbot's initial \"Farmers' Institutes\", these extension services spread college-based knowledge about agriculture and related issues to citizens around the state. Such extension services served as the third prong of the Land Grant college mission of education, research and public service. With this new mandate, the College looked to expand its curriculum beyond agriculture and engineering. By 1925, the institution had expanded enough that it petitioned the state of Michigan to remove the word \"agriculture\" from its name, but the University of Michigan opposed the name change. As a compromise, the state government decided to call it Michigan State College of Agriculture and Applied Science (M.S.C.). However, the College's athletic teams were still known as the \"Aggies\". Thus M.S.C. held a contest to find a new nickname. They decided to call the teams the \"Michigan Staters\". Local sports writers for the Lansing State Journal and the Capital News went through the losing entries to find a shorter and more heroic name. They decided on the \"Spartans\". By coincidence, Justin Morrill had once compared the Land Grant colleges to the schools of ancient Sparta.[34] With a heroic name and a historic precedent, the \"Spartans\" quickly caught on as the teams' new nickname. Within a few years, the College changed the lyrics of the Fight Song to reflect the name change of the College and its sports teams.",
			"color": "black|0.77932 dark|0.10156 gray|0.10156 dark|0.10156 grey|0.10156 gray|0.046051 grey|0.046051 silver|0.037814  "
		}
	}
}
