{
	"add": {
		"doc": {
			"id": "76879e8347cab9c2944a9c273b74e972193531900c2ce52d58b6e43a6b5c4d33",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/CMOberonTobleroneGallop15.8.08Small.jpg/220px-CMOberonTobleroneGallop15.8.08Small.jpg",
				"previous": "The Cleveland Bay generally stands between 16 and 16.2 hands (64 and 66 inches, 163 and 168 cm), and is always bay in colour. Bright bay horses (bays with a more reddish tint than normal) are the most preferred by breeders, followed by ordinary bay, dark bay and then light bay.[1] This preference for brighter shades of bay was originally stated in the official breed standard, although this stipulation has since been removed.[2] In some bloodlines of the breed, light, grayish hairs in the mane and tail are known as a characteristic of pure blood. White markings, except for a small star on the forehead, render the horse inadmissible to the stud book. Horses are expected to have complete black points, including completely black lower legs. Legs that are red below the knees and hocks are considered faulty in colour, although they do not disqualify a horse from registry.[1] The occasional red legs that appear in the breed are thought to come from chestnut Thoroughbred stallions that were crossed into Cleveland Bay and Yorkshire Coach Horse bloodlines at some points in the history of both breeds.[3] The uniformity in colour is encouraged as it makes creating matching driving teams and pairs very easy.[4] When the breed was first developed, the horses almost always had a countershaded dorsal stripe, but these disappeared with the outcrossings of the 18th century.[5]",
				"after": "The breed has a large head, slightly convex profile, and a long, well-muscled neck. The withers are well-muscled, which often makes them less pronounced, the chest is broad and deep, the shoulders are muscular and sloping, and the croup slightly sloping. The legs are short in relation to the body, but strong and well-muscled.[6] The legs have little or no feather, as the breed was developed partially for working in the heavy clay soils of its native country, where heavy feather led to increased disease prevalence.[7] They are hardy and long-lived horses, and docile in temperament.[6] In the early 20th century, when a breed standard was issued by the British Cleveland Bay Society for use in judging shows, a section was added on the movement of the horses, describing the desired action, especially at the trot. This was included in part because military potential was still considered a factor in evaluating harness horses and a good trot was necessary for an artillery horse. It was also evaluated because breeds with large action at the trot often also have a potential for jumping. The combination of desired characteristics means that the breed is useful for breeding show jumpers, eventers and steeplechasers (the latter especially when crossed with Thoroughbreds).[1]",
			"color": "black|0.55443 dark|0.16589 khaki|0.16589 burly|0.072343 wood|0.072343 olive|0.059347 drab|0.059347 dark|0.037556 slate|0.037556 gray|0.037556  "
		}
	}
}
