{
	"add": {
		"doc": {
			"id": "768e3c5844380d57e7a73e2c82be4c560d6d3b36e19adec56b4fe71f146f6bb1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Lancaster_Town_Hall_1828.jpg/220px-Lancaster_Town_Hall_1828.jpg",
				"previous": "Concurrently with designing churches and building railways, Sharpe was heavily involved in the civic life of Lancaster, particularly in pioneering sanitary reform. By political persuasion he was a Conservative, and in 1837 he joined the local Heart of Oak Club, the core of the Lancaster Conservative Association.[128] He was elected a town councillor for Castle Ward in 1841, a post he held for ten years, and in 1843 was appointed the town council's representative on the local Police Commission. He was also a visitor to the national schools, and in November 1848 he was elected as mayor for year, at that time a position more like that of a \"chief magistrate\".[129][130] Through these offices he became aware of the unsatisfactory state of sanitation in the town, and resolved to improve it.[129] The town was overcrowded, it suffered from poor housing, open sewers, overflowing cesspits, and a very poor water supply, mainly from wells polluted by infiltration. Many people suffered from typhus,[131] and in 1848 there was an outbreak of cholera.[132] The Police Commission had been established in Lancaster in 1825 with a wider role than suggested by its title, including \"cleansing, lighting and watching\" the town.[133] However, there was constant friction between the Police Commission and the Town Council, the former tending to block any necessary reforms on the grounds of cost to the ratepayers. The conflict was unresolved until the two bodies merged in 1849.[133] The functions of the new body included the establishment of the first Lancaster Board of Health.[134]",
				"after": "Before, during and after his mayoralty, Sharpe played a major role in promoting sanitary reform, often meeting considerable opposition and needing to use his oratorical, political and persuasive skills to the full.[135] A campaign to deal with the problems had been initiated in 1847 by two Lancaster doctors, Thomas Howitt and Edward Denis de Vitre. Sharpe joined them, drawing extensively on his experience of having accompanied Professor Richard Owen (born and educated in Lancaster) on his tour of inspection of the town in 1844.[136] In 1848 Robert Rawlinson, also from Lancaster, was appointed as local surveyor,[137] and published a further report that recommended new sewers and drains and the construction of a waterworks.[138] Although Sharpe agreed in principle with the report, he was not satisfied with its details. Later that year, which was during his mayoralty, he travelled to London with the town clerk and a former mayor to meet representatives of the General Board of Health, including its chairman, Lord Morpeth, and its secretary Edwin Chadwick. As a result of this meeting, the Board of Health appointed James Smith from Scotland as an inspector, and commissioned him to produce a further report on Lancaster's problems.[139] Smith's investigation took place in January 1849,[140] and his report was received in July.[141] In his conclusions, Smith noted that Lancaster was favourably situated to provide a healthy environment for its inhabitants, and that this could be achieved by \"a complete and constant supply of pure and soft water, and ... a thorough system of drainage and sewerage\".[141] Subsequently, an Act of Parliament gave approval for these measures to be carried out,[142] and in 1852 royal assent was given for the waterworks to be constructed.[143] Delays, disputes and controversies continued,[144] until the waterworks was eventually opened in 1855, when work on the drainage and sewage systems was already under way. This enabled underground pipes for the two systems to be laid simultaneously.[145] Sharpe had played a significant part in arranging Queen Victoria's visit to Lancaster in October 1851, and with Paley designed four triumphal arches for the occasion. He also took part in the proceedings on the day, escorting the Queen, Prince Albert, and the Prince of Wales (the future King Edward VII) to the top of the castle tower.[146]",
			"color": "dark|0.20339 gray|0.20339 dark|0.20339 grey|0.20339 dark|0.18976 slate|0.18976 gray|0.18976 dim|0.1615 gray|0.1615 dim|0.1615 grey|0.1615 gray|0.14327 grey|0.14327 silver|0.11575 light|0.05386 gray|0.05386 light|0.05386 grey|0.05386 slate|0.042836 gray|0.042836 light|0.037065 slate|0.037065 gray|0.037065 gainsboro|0.03187  "
		}
	}
}
