{
	"add": {
		"doc": {
			"id": "768e92e2eb7e9e41de845975d884fe632eaa5ea4456bb3997d4b3a3e623080a0",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/2d/Triptych_-_August_1972.jpg/420px-Triptych_-_August_1972.jpg",
				"previous": "Bacon's work from the 1970s has been described by the art critic Hugh Davies as the \"frenzied momentum of a struggle against death\". Bacon admitted during a 1974 interview that he thought the most difficult aspect of aging was \"losing your friends\". This was a bleak period in his life, and though he was to live for another seventeen years, he felt that his life was almost over, \"and all the people I've loved are dead\". His concern is reflected in the darkened flesh and background tones of his paintings from this period.[29] His acute sense of mortality and awareness of the fragility of life were heightened by Dyer's death in Paris. In the next three years he painted many images of his former lover, including the series of three \"Black Triptychs\" which have come to be seen as among his best work. A number of characteristics bind the triptychs together: the form of a monochromatically rendered doorway features centrally in all, and each is framed by flat and shallow walls.[29] In each three Dyer is stalked by a broad shadow; which takes the form of pools of blood or flesh in the outer panels and the wings of the angel of death in the left hand and central images.[30] In its display caption for Triptych–August 1972 the Tate gallery wrote, \"What death has not already consumed seeps incontinently out of the figures as their shadows.\"[31]",
				"after": "Each of the three \"Black triptychs\" displays sequential views of a single figure, and each seems to be intended to be viewed as if stills from a film.[22] The figures rendered are not drawn from any of Bacon's usual intellectual sources; they do not depict Golgotha, Handes, or Leopold Bloom. In these pictures Bacon strips Dyer from the context of both Dyer's own life and the artist's life, and presents him as a nameless, slumped, gathering of flesh, awaiting the onset of death.[32] Describing the Black Triptychs in 1993, the art critic Juan Vicente Aliaga wrote that \"the horror, the abjection that oozed from the crucifixes has been transformed in his last paintings into quiet solitude. The masculine bodies entwined in a carnal embrace have given way to the solitary figure leaning over the washbasin, standing firm on the smooth ground, neutral, bald-headed, his convex back deformed, his testicles contracted in a fold.\"[33]",
			"color": "gray|0.28744 grey|0.28744 dark|0.2345 gray|0.2345 dark|0.2345 grey|0.2345 blanched|0.046638 almond|0.046638 dim|0.039185 gray|0.039185 dim|0.039185 grey|0.039185 wheat|0.031247 beige|0.02448 papaya|0.023738 whip|0.023738 antique|0.020674 white|0.020674 light|0.018349 golden|0.018349 rod|0.018349 yellow|0.018349 silver|0.018052 floral|0.016413 white|0.016413 corn|0.016297 silk|0.016297 sea|0.016127 shell|0.016127 white|0.015548 smoke|0.015548 snow|0.015078 mint|0.014953 cream|0.014953 white|0.014848 black|0.012991 azure|0.012706 ghost|0.012594 white|0.012594 lemon|0.012587 chiffon|0.012587 alice|0.010586 blue|0.010586 light|0.010087 yellow|0.010087 bisque|0.010071 ivory|0.010064 linen|0.0081714 light|0.0077176 gray|0.0077176 light|0.0077176 grey|0.0077176 lavender|0.0066723 blush|0.0066723 old|0.0064791 lace|0.0064791 rosy|0.0062252 brown|0.0062252 gainsboro|0.0054164  "
		}
	}
}
