{
	"add": {
		"doc": {
			"id": "76b4be432d3f98b8fb3625de618674f007ba34a0ecd9edb0e85094126b4539ae",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/2014-11-02_13_11_36_Tree_of_Heaven_foliage_during_autumn_along_Lower_Ferry_Road_in_Ewing%2C_New_Jersey.JPG/220px-2014-11-02_13_11_36_Tree_of_Heaven_foliage_during_autumn_along_Lower_Ferry_Road_in_Ewing%2C_New_Jersey.JPG",
				"previous": "Ailanthus produces an allelopathic chemical called ailanthone, which inhibits the growth of other plants.[34] The inhibitors are strongest in the bark and roots, but are also present in the leaves, wood and seeds of the plant. One study showed that a crude extract of the root bark inhibited 50% of a sample of garden cress (Lepidium sativum) seeds from germinating. The same study tested the extract as an herbicide on garden cress, redroot pigweed (Amaranthus retroflexus), velvetleaf (Abutilon theophrasti), yellow bristlegrass (Setaria pumila), barnyard grass (Echinochloa crusgalli), pea (Pisum sativum cv. Sugar Snap) and maize (Zea mays cv. Silver Queen). It proved able to kill nearly 100% of seedlings with the exception of velvetleaf, which showed some resistance.[35] Another experiment showed a water extract of the chemical was either lethal or highly damaging to 11 North American hardwoods and 34 conifers, with the white ash (Fraxinus americana) being the only plant not adversely affected.[36] The chemical does not, however, affect the tree of heaven's own seedlings, indicating that A. altissima has a defence mechanism to prevent autotoxicity.[34] Resistance in various plant species has been shown to increase with exposure. Populations without prior exposure to the chemicals are most susceptible to them. Seeds produced from exposed plants have also been shown to be more resistant than their unexposed counterparts.[37]",
				"after": "The tree of heaven is a very rapidly growing tree, possibly the fastest growing tree in North America.[38] Growth of one to two metres (3.3 to 6.6 ft) per year for the first four years is considered normal. Shade considerably hampers growth rates. Older trees, while growing much slower, still do so faster than other trees. Studies found that Californian trees grew faster than their East Coast counterparts, and American trees in general grew faster than Chinese ones.[38]",
			"color": " "
		}
	}
}
