{
	"add": {
		"doc": {
			"id": "76c5a520f0efbc8474128f4ec6f5cf23b879359138e919426e1dbe6fb387f8bd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Phage.jpg/170px-Phage.jpg",
				"previous": "Plant virus particles or virus-like particles (VLPs) have applications in both biotechnology and nanotechnology. The capsids of most plant viruses are simple and robust structures and can be produced in large quantities either by the infection of plants or by expression in a variety of heterologous systems. Plant virus particles can be modified genetically and chemically to encapsulate foreign material and can be incorporated into supramolecular structures for use in biotechnology.[203]",
				"after": "Bacteriophages are a common and diverse group of viruses and are the most abundant form of biological entity in aquatic environments – there are up to ten times more of these viruses in the oceans than there are bacteria,[204] reaching levels of 250,000,000 bacteriophages per millilitre of seawater.[205] These viruses infect specific bacteria by binding to surface receptor molecules and then entering the cell. Within a short amount of time, in some cases just minutes, bacterial polymerase starts translating viral mRNA into protein. These proteins go on to become either new virions within the cell, helper proteins, which help assembly of new virions, or proteins involved in cell lysis. Viral enzymes aid in the breakdown of the cell membrane, and, in the case of the T4 phage, in just over twenty minutes after injection over three hundred phages could be released.[206]",
			"color": "gray|0.21885 grey|0.21885 dim|0.21017 gray|0.21017 dim|0.21017 grey|0.21017 dark|0.18666 gray|0.18666 dark|0.18666 grey|0.18666 black|0.12139 silver|0.090712 light|0.055608 gray|0.055608 light|0.055608 grey|0.055608 gainsboro|0.040047 linen|0.012469 white|0.011101 smoke|0.011101 sea|0.0090352 shell|0.0090352 snow|0.006955 floral|0.0069465 white|0.0069465 mint|0.0049705 cream|0.0049705 white|0.0048472 old|0.0047226 lace|0.0047226 ghost|0.0044036 white|0.0044036  "
		}
	}
}
