{
	"add": {
		"doc": {
			"id": "76deb40412e75dd8f21b4983fe5e6637fea975a37f00a4f326fe8e43b0442e4d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Temple_mount.JPG/220px-Temple_mount.JPG",
				"previous": "Christianity reveres Jerusalem for its Old Testament history, and also for its significance in the life of Jesus. According to the New Testament, Jesus was brought to Jerusalem soon after his birth[293] and later in his life cleansed the Second Temple.[294] The Cenacle, believed to be the site of Jesus' Last Supper, is located on Mount Zion in the same building that houses the Tomb of King David.[295][296] Another prominent Christian site in Jerusalem is Golgotha, the site of the crucifixion. The Gospel of John describes it as being located outside Jerusalem,[297] but recent archaeological evidence suggests Golgotha is a short distance from the Old City walls, within the present-day confines of the city.[298] The land currently occupied by the Church of the Holy Sepulchre is considered one of the top candidates for Golgotha and thus has been a Christian pilgrimage site for the past 2000 years.[298][299][300]",
				"after": "Jerusalem is the third-holiest city in Islam.[12] For approximately a year, before it was permanently switched to the Kaaba in Mecca, the qibla (direction of prayer) for Muslims was Jerusalem.[301][302] The city's lasting place in Islam, however, is primarily due to Muhammad's Night of Ascension (c. CE 620). Muslims believe Muhammad was miraculously transported one night from Mecca to the Temple Mount in Jerusalem, whereupon he ascended to Heaven to meet previous prophets of Islam.[303][304][305] The first verse in the Qur'an's Surat al-Isra notes the destination of Muhammad's journey as al-Aqsa (the farthest) mosque,[306][307] in reference to the location in Jerusalem. The hadith, the recorded sayings of the Prophet Mohammad, name Jerusalem as the location of the Al-Aqsa Mosque.[308] Today, the Temple Mount is topped by an Islamic landmark intended to commemorate the event—al-Aqsa Mosque, derived from the name mentioned in the Qur'an, and also the place from which Muslims believe Muhammad ascended to Heaven.[309]",
			"color": "dim|0.19288 gray|0.19288 dim|0.19288 grey|0.19288 gray|0.19033 grey|0.19033 dark|0.16892 gray|0.16892 dark|0.16892 grey|0.16892 silver|0.094008 black|0.086757 light|0.060612 gray|0.060612 light|0.060612 grey|0.060612 gainsboro|0.042765 linen|0.021487 antique|0.017512 white|0.017512 old|0.014294 lace|0.014294 sea|0.013697 shell|0.013697 white|0.011852 smoke|0.011852 floral|0.011618 white|0.011618 snow|0.0083148 tan|0.0075239 ivory|0.0072447 mint|0.006781 cream|0.006781 white|0.0056101 light|0.0048921 slate|0.0048921 gray|0.0048921  "
		}
	}
}
