{
	"add": {
		"doc": {
			"id": "76e8e92aec85ae5caf072e8261ad88c69edf045a495d21dcbecdba0171f53208",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/P_anguinus-head.jpg/220px-P_anguinus-head.jpg",
				"previous": "Development of the olm and other troglobite amphibians is characterized by heterochrony – the animal does not undergo metamorphosis and instead retains larval features. The form of heterochrony in the olm is neoteny – delayed somatic maturity with precocious reproductive maturity, i.e. reproductive maturity is reached while retaining the larval external morphology. In other amphibians, the metamorphosis is regulated by the hormone thyroxine, excreted by the thyroid gland. The thyroid is normally developed and functioning in the olm, so the lack of metamorphosis is due to the unresponsiveness of key tissues to thyroxine.[12]",
				"after": "The olm swims by eel-like twisting of its body, assisted only slightly by its poorly developed legs. It is a predatory animal, feeding on small crabs, snails and occasionally insects.[5] It does not chew its food, instead swallowing it whole. The olm is resistant to long-term starvation, an adaptation to its underground habitat. It can consume large amounts of food at once, and store nutrients as large deposits of lipids and glycogen in the liver. When food is scarce, it reduces its activity and metabolic rate, and can also reabsorb its own tissues in severe cases. Controlled experiments have shown that an olm can survive up to 10 years without food.[28]",
			"color": "black|0.56407 gray|0.079597 grey|0.079597 dark|0.079275 gray|0.079275 dark|0.079275 grey|0.079275 silver|0.036796 dim|0.034128 gray|0.034128 dim|0.034128 grey|0.034128 light|0.022716 gray|0.022716 light|0.022716 grey|0.022716 gainsboro|0.015215 white|0.013416 smoke|0.013416 sea|0.013025 shell|0.013025 floral|0.012062 white|0.012062 snow|0.011867 mint|0.011041 cream|0.011041 white|0.010957 linen|0.010057 ghost|0.0092257 white|0.0092257 rosy|0.0084914 brown|0.0084914 azure|0.0083983 alice|0.0080514 blue|0.0080514 antique|0.0076069 white|0.0076069 ivory|0.0068513 old|0.0056958 lace|0.0056958  "
		}
	}
}
