{
	"add": {
		"doc": {
			"id": "76eeaf1335f4b517306097635a4bd9acebfe1c468d77775679e96eb6b47c0c25",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Pulteney_Bridge%2C_Bath_2.jpg/220px-Pulteney_Bridge%2C_Bath_2.jpg",
				"previous": "On the authority of the future emperor Vespasian, as part of the ongoing expansion of the Roman presence in Britain, the Second Legion Augusta invaded Somerset from the south-east in AD 47. The county remained part of the Roman Empire until around AD 409, when the Roman occupation of Britain came to an end.[1] A variety of Roman remains have been found, including Pagans Hill Roman Temple in Chew Stoke,[18] Low Ham Roman Villa and the Roman Baths that gave their name to the city of Bath.[19]",
				"after": "After the Romans left, Britain was invaded by Anglo-Saxon peoples. By AD 600 they had established control over much of what is now England, but Somerset was still in native British hands. The British held back Saxon advance into the south-west for some time longer, but by the early eighth century King Ine of Wessex had pushed the boundaries of the West Saxon kingdom far enough west to include Somerset.[20] The Saxon royal palace in Cheddar was used several times in the 10th century to host the Witenagemot.[21] After the Norman Conquest, the county was divided into 700 fiefs, and large areas were owned by the crown,[22] with fortifications such as Dunster Castle used for control and defence. Somerset contains HMP Shepton Mallet, England's oldest prison still in use, which opened in 1610.[23] In the English Civil War Somerset was largely Parliamentarian,[24] with key engagements being the Siege of Taunton[25] and the Battle of Langport.[26] In 1685 the Monmouth Rebellion was played out in Somerset and neighbouring Dorset.[27] The rebels landed at Lyme Regis and travelled north, hoping to capture Bristol and Bath, but they were defeated in the Battle of Sedgemoor at Westonzoyland, the last pitched battle fought in England.[28] Arthur Wellesley took his title, Duke of Wellington from the town of Wellington;[29] he is commemorated on a nearby hill by a large, spotlit obelisk, known as the Wellington Monument.",
			"color": " "
		}
	}
}
