{
	"add": {
		"doc": {
			"id": "770a55f341f99d851a77de3175a102186bdc43c744d1582e535452bf78d534b6",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/6/65/West_indies_cricket_board_flag.png/200px-West_indies_cricket_board_flag.png",
			"previous": [
				"",
				"As of 29 March 2015, the West Indian cricket team is ranked eighth in Tests, eighth in ODIs and sixth in T20Is by the ICC.[1]",
				"The West Indies have won the ICC Cricket World Cup twice, in 1975 and 1979, the ICC World Twenty20 once, in 2012, the ICC Champions Trophy once, in 2004, and were runners up in the Cricket World Cup in 1983 and Under 19 Cricket World Cup in 2004. The first cricket team to win the World Cup twice, their record was surpassed by five World Cup wins by Australia, and equalled by India in 2011. West Indies are also the first team to win back to back World Cups, since surpassed by three consecutive World Cup wins by Australia (1999, 2003 and 2007). West Indies is the first team to appear in three consecutive World Cup finals (1975, 1979 and 1983), since surpassed by four consecutive World Cup finals appearances by Australia (1996, 1999, 2003 and 2007)."
			],
			"after": [
				"The current side represents:",
				"The West Indies Cricket Board, the governing body of the team, consists of the six cricket associations of Barbados, Guyana, Jamaica, Trinidad and Tobago, Leeward Islands and Windward Islands. The Leeward Islands Cricket Association consists of associations of one sovereign state (Antigua and Barbuda), the two entities of Saint Kitts and Nevis, three British Overseas Territories (Anguilla, Montserrat and British Virgin Islands) and two other dependencies (US Virgin Islands and Sint Maarten). The Windward Islands Cricket Board of Control consists of associations of four sovereign states (Dominica, Grenada, Saint Lucia and Saint Vincent and the Grenadines)."
			],
			"color": "sky|0.24015 blue|0.24015 light|0.22624 blue|0.22624 navy|0.15896 dark|0.15781 blue|0.15781 medium|0.067701 aqua|0.067701 marine|0.067701 golden|0.031932 rod|0.031932 medium|0.021189 sea|0.021189 green|0.021189 saddle|0.020178 brown|0.020178 light|0.019166 sky|0.019166 blue|0.019166 dark|0.0096965 khaki|0.0096965 brown|0.0091036 chocolate|0.0072899 powder|0.0067376 blue|0.0067376 dark|0.0065399 golden|0.0065399 rod|0.0065399 dark|0.0057726 slate|0.0057726 blue|0.0057726 cadet|0.0050576 blue|0.0050576 midnight|0.0037496 blue|0.0037496  "
		}
	}
}
