{
	"add": {
		"doc": {
			"id": "770f88ec3f47e5d9d86f623f8af43f0f592731c575c0f87fefa8df8758806b70",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Oregon_State_Capitol_rotunda.jpg/220px-Oregon_State_Capitol_rotunda.jpg",
			"previous": [],
				"after": "The Oregon State Capitol is home to both branches of the state legislature, the House and Senate, and has offices for the governor, treasurer, and the secretary of state. In its center, the floor of the prominent rotunda features an embedded Oregon State Seal sculpted in bronze by Ulric Ellerhusen. Ellerhusen also sculpted the Oregon Pioneer that rests atop the capitol dome's exterior. The dome rises 106 feet (32 m) above the state seal. The interior of the dome was painted by Frank H. Schwarz and features 33 stars, symbolizing Oregon's place as the 33rd state to join the Union. Eight medallions are painted near the top of the walls of the rotunda that represent the eight objects in the state seal.[16] Also encircling the interior of the rotunda are four murals depicting moments from Oregon history.[17] One mural depicts Captain Robert Gray's exploration of the Columbia River in 1792, another shows the Lewis and Clark Expedition, and two others portray covered wagons from pioneer times. These four murals were painted by Schwarz and Barry Faulkner. Other murals include the Provisional Government of Oregon's salmon and wheat seal, the Oregon Territory's seal, and depictions of Oregon's industries, all located in the rotunda's wings along the grand staircase. The capitol's galleria area on the first floor includes hearing rooms, display cases, and the visitor information area.[16]",
			"color": "light|0.1081 steel|0.1081 blue|0.1081 dark|0.09303 slate|0.09303 gray|0.09303 dim|0.085423 gray|0.085423 dim|0.085423 grey|0.085423 light|0.065641 slate|0.065641 gray|0.065641 slate|0.060392 gray|0.060392 black|0.060367 lavender|0.04467 dark|0.042724 gray|0.042724 dark|0.042724 grey|0.042724 steel|0.041703 blue|0.041703  "
		}
	}
}
