{
	"add": {
		"doc": {
			"id": "7714942d726c9ca0b4320b1b78f8f56bde06eeb420276d991b54a2bde1d32018",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Raf.hercules.c-130k.c3.arp.jpg/220px-Raf.hercules.c-130k.c3.arp.jpg",
				"previous": "C-130H models produced from 1992 to 1996 were designated as C-130H3 by the USAF. The \"3\" denoting the third variation in design for the H series. Improvements included ring laser gyros for the INUs, GPS receivers, a partial glass cockpit (ADI and HSI instruments), a more capable APN-241 color radar, night vision device compatible instrument lighting, and an integrated radar and missile warning system. The electrical system upgrade included Generator Control Units (GCU) and Bus Switching units (BSU)to provide stable power to the more sensitive upgraded components.[citation needed]",
				"after": "The equivalent model for export to the UK is the C-130K, known by the Royal Air Force (RAF) as the Hercules C.1. The C-130H-30 (Hercules C.3 in RAF service) is a stretched version of the original Hercules, achieved by inserting a 100 in (2.54 m) plug aft of the cockpit and an 80 in (2.03 m) plug at the rear of the fuselage. A single C-130K was purchased by the Met Office for use by its Meteorological Research Flight, where it was classified as the Hercules W.2. This aircraft was heavily modified (with its most prominent feature being the long red and white striped atmospheric probe on the nose and the move of the weather radar into a pod above the forward fuselage). This aircraft, named Snoopy, was withdrawn in 2001 and was then modified by Marshall of Cambridge Aerospace as flight-testbed for the A400M turbine engine, the TP400. The C-130K is used by the RAF Falcons for parachute drops. Three C-130K (Hercules C Mk.1P) were upgraded and sold to the Austrian Air Force in 2002.[7]",
			"color": "dark|0.14799 khaki|0.14799 dim|0.10666 gray|0.10666 dim|0.10666 grey|0.10666 antique|0.08334 white|0.08334 gray|0.07853 grey|0.07853 black|0.073147 blanched|0.061744 almond|0.061744 papaya|0.060902 whip|0.060902 bisque|0.055598 beige|0.036187 corn|0.034433 silk|0.034433 old|0.032761 lace|0.032761 linen|0.029399 wheat|0.024979 dark|0.023215 gray|0.023215 dark|0.023215 grey|0.023215 peach|0.016846 puff|0.016846 light|0.014719 yellow|0.014719 tan|0.013024 floral|0.012383 white|0.012383 ivory|0.012354 silver|0.011823 khaki|0.010593 sea|0.0086714 shell|0.0086714 dark|0.0068898 slate|0.0068898 gray|0.0068898 light|0.0062658 gray|0.0062658 light|0.0062658 grey|0.0062658 light|0.0054627 golden|0.0054627 rod|0.0054627 yellow|0.0054627  "
		}
	}
}
