{
	"add": {
		"doc": {
			"id": "77151c0ae4b840b38ea36c86e4b70c64128b7f94f15f2f10565ede0418c2eaee",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/S%C3%B6_65%2C_Djulefors.jpg/170px-S%C3%B6_65%2C_Djulefors.jpg",
				"previous": "A vast majority, 94%, are raised in memory of men, but, contrary to common perception, the vast majority of the runestones are raised in memory of people who died at home. The most famous runestones and those that people tend to think of are those that tell of foreign voyages, but they comprise only c. 10% of all runestones,[20] and they were raised in usually memory of those not having returned from Viking expeditions and not as tributes to those having returned.[22] These runestones contain roughly the same message as the majority of the runestones, which is that people wanted to commemorate one or several dead kinsmen.[20]",
			"after": [
				"The first man who scholars know fell on the eastern route was the East Geat Eyvindr whose fate is mentioned on the 9th century Kälvesten Runestone.[20] The epitath reads:",
				"It is unfortunate for historians that the stones rarely reveal where the men died.[22] On the Smula Runestone in Västergötland, we are informed only that they died during a war campaign in the East: \"Gulli/Kolli raised this stone in memory of his wife's brothers Ásbjôrn and Juli, very good valiant men. And they died in the east in the retinue\".[22][24] Another runemaster in the same province laconically states on the Dalum Runestone: \"Tóki and his brothers raised this stone in memory of their brothers. One died in the west, another in the east\".[22][25]"
			],
			"color": "gray|0.44841 grey|0.44841 dim|0.24385 gray|0.24385 dim|0.24385 grey|0.24385 dark|0.21548 gray|0.21548 dark|0.21548 grey|0.21548 silver|0.0329 light|0.018773 slate|0.018773 gray|0.018773 slate|0.01839 gray|0.01839 light|0.0071861 gray|0.0071861 light|0.0071861 grey|0.0071861 dark|0.0055494 olive|0.0055494 green|0.0055494 gainsboro|0.0034335  "
		}
	}
}
