{
	"add": {
		"doc": {
			"id": "771bb6448987fea0df6f797d547b46807568f23a5d73cc21815feba58645bb30",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/USS_Tripoli_LPH10_a.jpg/220px-USS_Tripoli_LPH10_a.jpg",
				"previous": "This new-found importance of naval aviation forced nations to create a number of carriers, in efforts to provide air superiority cover for every major fleet in order to ward off enemy aircraft. This extensive usage required the construction of several new 'light' carriers. Escort aircraft carriers, such as USS Bogue, were sometimes purpose-built, but most were converted from merchant ships as a stop-gap measure to provide anti-submarine air support for convoys and amphibious invasions. Following this concept, Light aircraft carriers built by the US, such as USS Independence, represented a larger, more \"militarized\" version of the escort carrier. Although with similar complement to Escort carriers, they had the advantage of speed from their converted cruiser hulls. The UK 1942 Design Light Fleet Carrier was designed for building quickly by civilian shipyards and with an expected service life of about 3 years.[14] They served the Royal Navy during the war and was the hull design chosen for nearly all aircraft carrier equipped navies after the war until the 1980s. Emergencies also spurred the creation or conversion of highly unconventional aircraft carriers. CAM ships, were cargo-carrying merchant ships that could launch (but not retrieve) a single fighter aircraft from a catapult to defend the convoy from long range German aircraft.",
				"after": "Before World War II, international naval treaties of 1922, 1930 and 1936 limited the size of capital ships including carriers.",
			"color": "dark|0.24695 slate|0.24695 gray|0.24695 dim|0.14432 gray|0.14432 dim|0.14432 grey|0.14432 gray|0.14163 grey|0.14163 light|0.11285 slate|0.11285 gray|0.11285 slate|0.092934 gray|0.092934 black|0.05153 dark|0.05059 gray|0.05059 dark|0.05059 grey|0.05059 silver|0.029653 light|0.024804 gray|0.024804 light|0.024804 grey|0.024804 gainsboro|0.019993 cadet|0.019247 blue|0.019247 light|0.007125 blue|0.007125 white|0.0069553 smoke|0.0069553 alice|0.0065506 blue|0.0065506 powder|0.0058981 blue|0.0058981 azure|0.0054528  "
		}
	}
}
