{
	"add": {
		"doc": {
			"id": "774392ce40b20e55583e0e317463d76fd6daf81275f7f2a4cb7fa7525f73e5d1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/PhoenixDustStorm2.2011.jpg/500px-PhoenixDustStorm2.2011.jpg",
				"previous": "Most deserts undergo drastic fluctuations between day and nighttime temperatures, but not Phoenix due to the urban heat island effect. As the city has expanded, average summer low temps have been rising steadily. The daily heat of the sun is stored in pavement, sidewalks and buildings, and is radiated back out at night.[65] During the summer, overnight lows greater than 80 °F (27 °C) are commonplace, as the daily normal low remains at or above 80 °F from June 22 to September 8. On average, 67 days throughout the year will see the nighttime low at or above 80 °F (27 °C). July 15, 2003 officially saw the record high daily minimum temperature, at 96 °F (36 °C).[60][61]",
				"after": "The city averages over 330 days of sunshine, or over 90%, per year, and receives scant rainfall, the average annual total at Phoenix Sky Harbor International Airport being 7 inches (180 mm).[66] Precipitation is sparse during most of the year, but the monsoon brings an influx of moisture. Historically, the monsoon officially started when the average Dew point was 55 degrees for three days in a row; on average this event occurred around July 7; however, in 2008 the National Weather Service decreed that from that point forward, June 15 would be the official first day of the monsoon, and it would end on September 30.[67] The monsoon raises humidity levels and can cause heavy localized precipitation, occasional flooding, large hail, strong winds, the rare tornado, and dust storms,[68] which can rise to the level of a haboob in some years.[69]",
			"color": "rosy|0.096755 brown|0.096755 dim|0.090533 gray|0.090533 dim|0.090533 grey|0.090533 sea|0.061653 shell|0.061653 floral|0.061158 white|0.061158 white|0.057924 smoke|0.057924 snow|0.05743 mint|0.057216 cream|0.057216 white|0.056237 azure|0.053184 ghost|0.052885 white|0.052885 alice|0.051491 blue|0.051491 lavender|0.048501 blush|0.048501 gray|0.046102 grey|0.046102 peach|0.02418 puff|0.02418 tan|0.016765 antique|0.016672 white|0.016672 dark|0.014744 gray|0.014744 dark|0.014744 grey|0.014744 bisque|0.014137 linen|0.013697 papaya|0.012397 whip|0.012397 blanched|0.012301 almond|0.012301 ivory|0.011586 wheat|0.011171 old|0.011113 lace|0.011113  "
		}
	}
}
