{
	"add": {
		"doc": {
			"id": "77471fc99b549ca7fe204a05b90c6b595d0db013b2db4d637cd58d4c48100b50",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Cloud_forest_mount_kinabalu.jpg/220px-Cloud_forest_mount_kinabalu.jpg",
				"previous": "The Kerinci Seblat National Park, Sumatra's largest, was estimated to contain a population of around 500 rhinos in the 1980s,[30] but due to poaching, this population is now considered extinct. The survival of any animals in Peninsula Malaysia is extremely unlikely.[7]",
				"after": "Genetic analysis of Sumatran rhino populations has identified three distinct genetic lineages.[9] The channel between Sumatra and Malaysia was not as significant a barrier for the rhinos as the Barisan Mountains along the length of Sumatra, for rhinos in eastern Sumatra and Peninsular Malaysia are more closely related than the rhinos on the other side of the mountains in western Sumatra. In fact, the eastern Sumatra and Malaysia rhinos show so little genetic variance, the populations were likely not separate during the Pleistocene, when sea levels were much lower and Sumatra formed part of the mainland. Both populations of Sumatra and Malaysia, however, are close enough genetically that interbreeding would not be problematic. The rhinos of Borneo are sufficiently distinct that conservation geneticists have advised against crossing their lineages with the other populations.[9] Conservation geneticists have recently begun to study the diversity of the gene pool within these populations by identifying microsatellite loci. The results of initial testing found levels of variability within Sumatran rhino populations comparable to those in the population of the less endangered African rhinos, but the genetic diversity of Sumatran rhinos is an area of continuing study.[31]",
			"color": "dim|0.4151 gray|0.4151 dim|0.4151 grey|0.4151 gray|0.22232 grey|0.22232 dark|0.14075 gray|0.14075 dark|0.14075 grey|0.14075 black|0.12938 slate|0.029816 gray|0.029816 silver|0.023787 dark|0.017508 olive|0.017508 green|0.017508 light|0.012013 slate|0.012013 gray|0.012013  "
		}
	}
}
