{
	"add": {
		"doc": {
			"id": "7786215aeb67278dfe553001549ccbee8b0723e23ee3143a7ab96f195d482b70",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/PhoenixDowntown.jpg/220px-PhoenixDowntown.jpg",
				"previous": "Phoenix is in the southwestern United States, in the south-central portion of Arizona, and about halfway between Tucson to the south and Flagstaff to the north. The metropolitan area is known as the \"Valley of the Sun\", due to its location in the Salt River Valley. It lies at a mean elevation of 1,117 feet (340 m), in the northern reaches of the Sonoran Desert.[51][52]",
				"after": "Other than the mountains in and around the city, the topography of Phoenix is generally flat, allowing the city's main streets to run on a precise grid with wide, open-spaced roadways. Scattered, low mountain ranges surround the valley: McDowell Mountains to the northeast, the White Tank Mountains to the west, the Superstition Mountains far to the east, and the Sierra Estrella to the southwest. On the outskirts of Phoenix are large fields of irrigated cropland and several Indian reservations.[22][51][53] The Salt River runs westward through the city of Phoenix, and the riverbed is often dry or contains a little water due to large irrigation diversions. The community of Ahwatukee is separated from the rest of the city by South Mountain.",
			"color": "dim|0.21457 gray|0.21457 dim|0.21457 grey|0.21457 gray|0.16112 grey|0.16112 dark|0.13122 gray|0.13122 dark|0.13122 grey|0.13122 black|0.10716 silver|0.065565 light|0.036947 gray|0.036947 light|0.036947 grey|0.036947 slate|0.0368 gray|0.0368 light|0.031785 slate|0.031785 gray|0.031785 gainsboro|0.025997 rosy|0.020221 brown|0.020221 linen|0.012109 sea|0.010415 shell|0.010415 white|0.0097511 smoke|0.0097511 antique|0.0094369 white|0.0094369 floral|0.0090399 white|0.0090399 light|0.0087435 steel|0.0087435 blue|0.0087435 old|0.008292 lace|0.008292 misty|0.0078463 rose|0.0078463 snow|0.0078108 lavender|0.0066128 blush|0.0066128  "
		}
	}
}
