{
	"add": {
		"doc": {
			"id": "77890c15dfa81cc73b806231e6743b9deb177a74932b0a8ee6252fb118b7235b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Lockheed_L-1011-1_Tristar%2C_Lockheed_JP5893645.jpg/220px-Lockheed_L-1011-1_Tristar%2C_Lockheed_JP5893645.jpg",
				"previous": "The design featured a twin-aisle interior with a maximum of 400 passengers, a three-engine layout, low noise emissions (in the early 1970s, Eastern Air Lines nicknamed the L-1011 \"WhisperLiner\"), improved reliability and efficient operation. The main visible difference between the TriStar and its similar trijet competitor, the McDonnell Douglas DC-10, is the middle/tail engine: the DC-10's engine is mounted above the fuselage for simplicity of design and more economical construction, while the TriStar's engine is mounted to the rear fuselage and fed through an S-duct (similar to the Boeing 727) for reduced drag, improved stability, and easier replacement.[6] A further major difference between the L-1011 and the DC-10 was Lockheed's selection of the Rolls-Royce RB211 as the only engine for the L-1011.[7][8] As originally designed, the RB211 turbofan was an advanced three-spool design with a carbon fibre fan,[9] which would have better efficiency and power-to-weight ratio than any competing design. This would make the L-1011 more efficient, a major selling point.",
				"after": "American Airlines opted for the Douglas DC-10, although they showed considerable interest in the L-1011. American's intent was to convince Douglas to lower their price for the DC-10, which they did.[10] Without the support of American, the TriStar was launched on orders from TWA and Eastern Air Lines. Although the TriStar's design schedule closely followed that of its competitor, Douglas beat Lockheed to market by a year due to delays in powerplant development.",
			"color": "dark|0.32675 gray|0.32675 dark|0.32675 grey|0.32675 gray|0.15834 grey|0.15834 dim|0.11081 gray|0.11081 dim|0.11081 grey|0.11081 black|0.10209 silver|0.08592 light|0.03558 gray|0.03558 light|0.03558 grey|0.03558 gainsboro|0.029036 rosy|0.017842 brown|0.017842 misty|0.012898 rose|0.012898 linen|0.012583 light|0.011952 slate|0.011952 gray|0.011952 white|0.010844 smoke|0.010844 lavender|0.0097693 blush|0.0097693 sea|0.0082445 shell|0.0082445 brown|0.0065696 slate|0.0062184 gray|0.0062184  "
		}
	}
}
