{
	"add": {
		"doc": {
			"id": "779905abf9acecaf15ddf0cdccac7e1d03679d0286845195dd87271bfd4901dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Battle_of_Waterloo_1815.PNG/220px-Battle_of_Waterloo_1815.PNG",
				"previous": "In the early 19th century, the British-led Industrial Revolution began to transform the country. It slowly led to a shift in political power away from the old Tory and Whig landowning classes towards the new industrialists. An alliance of merchants and industrialists with the Whigs would lead to a new party, the Liberals, with an ideology of free trade and laissez-faire. In 1832 Parliament passed the Great Reform Act, which began the transfer of political power from the aristocracy to the middle classes. In the countryside, enclosure of the land was driving small farmers out. Towns and cities began to swell with a new urban working class. Few ordinary workers had the vote, and they created their own organisations in the form of trade unions.",
				"after": "After the defeat of France in the Revolutionary and Napoleonic Wars (1792–1815), the UK emerged as the principal naval and imperial power of the 19th century (with London the largest city in the world from about 1830).[82] Unchallenged at sea, British dominance was later described as Pax Britannica.[83][84] By the time of the Great Exhibition of 1851, Britain was described as the \"workshop of the world\".[85] The British Empire was expanded to include India, large parts of Africa and many other territories throughout the world. Alongside the formal control it exerted over its own colonies, British dominance of much of world trade meant that it effectively controlled the economies of many countries, such as China, Argentina and Siam.[86][87] Domestically, political attitudes favoured free trade and laissez-faire policies and a gradual widening of the voting franchise. During the century, the population increased at a dramatic rate, accompanied by rapid urbanisation, causing significant social and economic stresses.[88] After 1875, the UK's industrial monopoly was challenged by Germany and the USA. To seek new markets and sources of raw materials, the Conservative Party under Disraeli launched a period of imperialist expansion in Egypt, South Africa and elsewhere. Canada, Australia and New Zealand became self-governing dominions.[89]",
			"color": "gray|0.21386 grey|0.21386 dark|0.19421 gray|0.19421 dark|0.19421 grey|0.19421 black|0.18824 dim|0.10163 gray|0.10163 dim|0.10163 grey|0.10163 light|0.073986 slate|0.073986 gray|0.073986 tan|0.072215 slate|0.047164 gray|0.047164 burly|0.021211 wood|0.021211 sienna|0.018269 wheat|0.015577 silver|0.012958  "
		}
	}
}
