{
	"add": {
		"doc": {
			"id": "779e0fb52008054d19acc52a1d2ba745750ba624372ff305656d157f1eb8e96b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/KerbauJawa.jpg/250px-KerbauJawa.jpg",
			"previous": [],
				"after": "Agriculture is the cultivation of animals, plants, fungi and other life forms for food, fiber, and other products used to sustain life. Agriculture was the key implement in the rise of sedentary human civilization, whereby farming of domesticated species created food surpluses that nurtured the development of civilization. The study of agriculture is known as agricultural science. The history of agriculture dates back thousands of years, and its development has been driven and defined by greatly different climates, cultures, and technologies. However, all farming generally relies on techniques to expand and maintain the lands suitable for raising domesticated species. For plants, this usually requires some form of irrigation, although there are methods of dryland farming; pastoral herding on rangeland is still the most common means of raising livestock. In the developed world, industrial agriculture based on large-scale monoculture has become the dominant system of modern farming, although there is growing support for sustainable agriculture. The major agricultural products can be broadly grouped into foods, fibers, fuels, and raw materials.",
			"color": "black|0.30262 khaki|0.09212 tan|0.080518 pale|0.061946 golden|0.061946 rod|0.061946 burly|0.048047 wood|0.048047 dim|0.046314 gray|0.046314 dim|0.046314 grey|0.046314 dark|0.040242 khaki|0.040242 wheat|0.034071 gray|0.023324 grey|0.023324 moccasin|0.018471 navajo|0.01747 white|0.01747 dark|0.014941 gray|0.014941 dark|0.014941 grey|0.014941 peach|0.012931 puff|0.012931 rosy|0.012208 brown|0.012208 antique|0.01187 white|0.01187 bisque|0.010815 lemon|0.010026 chiffon|0.010026 blanched|0.0096961 almond|0.0096961 linen|0.0089829 silver|0.008792 papaya|0.0084337 whip|0.0084337 light|0.0080853 golden|0.0080853 rod|0.0080853 yellow|0.0080853 sea|0.0078986 shell|0.0078986 old|0.0078476 lace|0.0078476 floral|0.0075647 white|0.0075647 light|0.0069783 gray|0.0069783 light|0.0069783 grey|0.0069783 beige|0.0067028 corn|0.006346 silk|0.006346  "
		}
	}
}
