{
	"add": {
		"doc": {
			"id": "77b2165067979cbe44a4ac00091bb01169da4a6d0b633ce8e4c03cc520fb7bab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Datalink_USB_Dress_Edition.JPG/170px-Datalink_USB_Dress_Edition.JPG",
				"previous": "The similar-sounding terms chronograph and chronometer are often confused, although they mean altogether different things. A chronograph is a watch with an added duration timer, often a stopwatch complication (as explained above), while a chronometer watch is a timepiece that has met an industry standard test for performance under pre-defined conditions: a chronometer is a high quality mechanical or a thermo-compensated movement that has been tested and certified to operate within a certain standard of accuracy by the COSC (Contrôle Officiel Suisse des Chronomètres). The concepts are different but not mutually exclusive; so a watch can be a chronograph, a chronometer, both, or neither.",
				"after": "Many computerized wristwatches have been developed, but none have had long-term sales success, because they have awkward user interfaces due to the tiny screens and buttons, and a short battery life. As miniaturized electronics became cheaper, watches have been developed containing calculators, tonometers, barometers, altimeters, a compass using both hands to show the N/S direction, video games, digital cameras, keydrives, GPS receivers and cellular phones. A few astronomical watches show phase of the Moon and other celestial phenomena. In the early 1980s Seiko marketed a watch with a television in it. Such watches have also had the reputation as unsightly and thus mainly geek toys. Several companies have however attempted to develop a computer contained in a wristwatch (see also wearable computer).",
			"color": "dark|0.21668 gray|0.21668 dark|0.21668 grey|0.21668 dim|0.208 gray|0.208 dim|0.208 grey|0.208 gray|0.15874 grey|0.15874 silver|0.089942 light|0.062856 slate|0.062856 gray|0.062856 light|0.059219 gray|0.059219 light|0.059219 grey|0.059219 slate|0.052005 gray|0.052005 black|0.040356 gainsboro|0.03862 linen|0.0079902 dark|0.0073153 slate|0.0073153 gray|0.0073153 white|0.0068906 smoke|0.0068906  "
		}
	}
}
