{
	"add": {
		"doc": {
			"id": "77dcc85b2b9a85227c6d99d8794cb1a79a0445ddc9bbbc9df7ff4ca51c9b1647",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8f/USA_Today_Logo.svg/175px-USA_Today_Logo.svg.png",
				"previous": "Each section is denoted by a certain color to differentiate sections beyond lettering and is seen in a box the top-left corner of the first page, with News being blue (section A), Money with green (section B), red for Sports (section C), and purple for Life (section D). Orange is used for bonus sections (section E or above), which are published occasionally such as for business travel trends and the Olympics; other bonus sections for sports (such as for the PGA Tour preview, NCAA Basketball Tournaments, Memorial Day auto races (Indianapolis 500 and Coca-Cola 600), NFL opening weekend and the Super Bowl) previously used the orange color, but now use the sports red in their bonus sections. On days featuring bonus sections or business holidays, the Money and Life sections are usually combined into one section, while combinations of the Friday Life editions into one section are common during quiet weeks. The stock tables were discontinued after the last redesign in 2012 due to the myriad electronic ways to check individual stock prices, in line with most newspapers. Gannett's television stations also now mainly use the USA Today coloring scheme in the company's newest graphics package, which was introduced in late 2012.",
				"after": "In many ways, USA Today is set up to break the typical newspaper layout. Some examples of that divergence from tradition include using the left-hand quarter of each section as reefers (front-page paragraphs referring to stories on inside pages[10]), sometimes using sentence-length blurbs to describe stories inside. As a national newspaper, USA Today cannot focus on the weather for any one city. Therefore, the entire back page of the News section is used for weather maps and temperature lists for the entire United States and many cities throughout the world, with data provided by The Weather Channel meteorologists. In the bottom left-hand corner of the weather page is a graphic called \"Weather Focus\", which explains various meteorological phenomena. On some days, the Weather Focus could be a photo of a rare meteorological event. On Mondays, the Money section uses its back page to present an unusual graphic depicting the performance of various industry groups as a function of quarterly, monthly, and weekly movements against the S&P 500. Like most national papers, USA Today does not carry comic strips.",
			"color": "white|0.084993 smoke|0.084993 ghost|0.084813 white|0.084813 alice|0.08422 blue|0.08422 mint|0.083704 cream|0.083704 azure|0.0837 white|0.082579 snow|0.082059 floral|0.079643 white|0.079643 sea|0.07928 shell|0.07928 lavender|0.077502 blush|0.077502 sky|0.061837 blue|0.061837 light|0.036888 blue|0.036888 powder|0.029823 blue|0.029823 light|0.021872 sky|0.021872 blue|0.021872 light|0.015035 cyan|0.015035 ivory|0.0066681 linen|0.0045234  "
		}
	}
}
