{
	"add": {
		"doc": {
			"id": "77ec00364bbd27c271d53946108d4bab0bbf9d351589e1978f6b570740a7fe6d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Glyptemys_muhlenbergii_in_grass.jpg/220px-Glyptemys_muhlenbergii_in_grass.jpg",
				"previous": "The bog turtle's karyotype is composed of 50 chromosomes.[4] Studies of variations in mitochondrial DNA indicate low levels of genetic divergence among bog turtle colonies. This is unusual in species such as the bog turtle, which have fragmented distributions and exist in small isolated groups (fewer than 50 individuals in bog turtle colonies). These conditions limit gene flow, typically leading to divergence between isolated groups. Data indicate that the bog turtle suffered dramatic reductions in numbers – a population bottleneck – as colonies were forced south in the face of glaciation. Receding glaciers led to the relatively recent post-Pleistocene expansion, as the bog turtles moved back into their former northern range. This recent colonization from a relatively limited southern population may account for the reduction of genetic diversity.[33] The northern and southern populations are at present genetically isolated, likely as a consequence of farming and habitat destruction in Virginia's Shenandoah Valley during the American Civil War.[31]",
				"after": "The bog turtle is primarily diurnal, active during the day and sleeping at night. It wakes in the early morning, basks until fully warm, then begins its search for food.[31] It is a seclusive species, making it challenging to observe in its natural habitat.[11] During colder days, the bog turtle will spend much of its time in dense underbrush, underwater, or buried in mud.[10] Such behavior is indicative of the bog turtle's ability to survive without oxygen.[34] On warmer days, the bog turtle's activities include scavenging, mating (during early spring), and basking in sunlight, the last of which it spends a great deal of the day doing.[21] However, the bog turtle usually takes shelter from the sun during the hottest part of the day.[31] Occasionally, during times of extreme heat, the turtle will either estivate,[35] or become subterranean, sometimes occupying networks of tunnels filled with water.[35] At night, the bog turtle buries itself in soft tunnels.[36]",
			"color": "black|0.50294 tan|0.15985 wheat|0.03911 dark|0.037193 khaki|0.037193 dim|0.036048 gray|0.036048 dim|0.036048 grey|0.036048 dark|0.03366 olive|0.03366 green|0.03366 pale|0.019714 golden|0.019714 rod|0.019714  "
		}
	}
}
