{
	"add": {
		"doc": {
			"id": "77f37253cb3d727240c8502bfd8632be1b30d0d26faad18a6ad8e3febfa1db61",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Sunset_over_florence_1.jpg/400px-Sunset_over_florence_1.jpg",
				"previous": "In all, the Renaissance could be viewed as an attempt by intellectuals to study and improve the secular and worldly, both through the revival of ideas from antiquity, and through novel approaches to thought. Some scholars, such as Rodney Stark,[20] play down the Renaissance in favor of the earlier innovations of the Italian city-states in the High Middle Ages, which married responsive government, Christianity and the birth of capitalism. This analysis argues that, whereas the great European states (France and Spain) were absolutist monarchies, and others were under direct Church control, the independent city republics of Italy took over the principles of capitalism invented on monastic estates and set off a vast unprecedented commercial revolution which preceded and financed the Renaissance.",
				"after": "Many argue that the ideas that characterized the Renaissance had their origin in late 13th century Florence, in particular with the writings of Dante Alighieri (1265–1321) and Francesco Petrarca (1304–1374), as well as the paintings of Giotto di Bondone (1267–1337).[21] Some writers date the Renaissance quite precisely; one proposed starting point is 1401, when the rival geniuses Lorenzo Ghiberti and Filippo Brunelleschi competed for the contract to build the bronze doors for the Baptistery of the Florence Cathedral (Ghiberti won).[22] Others see more general competition between artists and polymaths such as Brunelleschi, Ghiberti, Donatello, and Masaccio for artistic commissions as sparking the creativity of the Renaissance. Yet it remains much debated why the Renaissance began in Italy, and why it began when it did. Accordingly, several theories have been put forward to explain its origins.",
			"color": "black|0.67048 dark|0.11438 olive|0.11438 green|0.11438 dim|0.032982 gray|0.032982 dim|0.032982 grey|0.032982 saddle|0.032524 brown|0.032524  "
		}
	}
}
