{
	"add": {
		"doc": {
			"id": "7807691c257db74a88ddc53778418233a0f531a1009596bc646c3237ce0e59e1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Paganavebury.jpg/220px-Paganavebury.jpg",
				"previous": "In her third chapter, Greenwood examines her experiences among London's ceremonial magicians, focusing on her training in the Hermetic Qabalah, a \"magical language\" for exploring the otherworld. Adopting Luhrmann's concept of \"interpretative drift\", she relates how she shifted her understanding of events to make sense of her magical experiences. However, in contrast to Luhrmann's emphasis on how practitioners overcame their initial scepticism, Greenwood focuses on how these practitioners learn \"the language of another mode of reality\" through their experiences.[11] Chapter four details Greenwood's early involvement in Wicca, through three separate covens. Offering her thoughts on Wiccan invocations, she then discusses the faith's approach to sexual polarity, pointing to the sexual underpinnings of the Great Rite and the Gnostic Mass as evidence. The chapter is rounded off with an explanation of how Wicca understands the natural world and a comparison between the religion and ceremonial magic.[12]",
				"after": "Chapter five examines the attraction of magic for its practitioners, and its uses for psychotherapy and healing. Greenwood explores the ways in which occultists use magic as a rebellion against Christianity, and their construction of a \"magical identity\", believing this to be \"organized around a deep internal exploration of the self through an interaction with the otherworld\". She also looks at magic and the acquisition of power, and the sense of empowerment discovered by magicians who were former abuse victims.[13] The sixth chapter focuses on notions of gender and sexuality, highlighting the widespread belief that sexual energy provides the power behind magic and discussing the contrasting views of Dion Fortune and Aleister Crowley on this issue; the former emphasised harmony and balance between \"masculine\" and \"feminine\" magical forces, while the latter advocated \"magical anarchy\" or spiritual autonomy for each individual, irrespective of gender. Greenwood looks at contrasting views on these issues in High Magic (ceremonial magic), Wicca and Feminist Witchcraft. Drawing upon the typologies advocated by sociologist of religion Susan J. Palmer, she argues that High Magic emphasises \"sex polarity\", a situation in which men and women are seen as unequal and different, whereas Wicca holds to a position of \"sex complementarity\", in which men and women are seen as different yet equal, and Feminist Witchcraft advocates \"sex unity\", in which there is a tolerance of sexual ambiguity.[14]",
			"color": "gray|0.15983 grey|0.15983 dim|0.14971 gray|0.14971 dim|0.14971 grey|0.14971 dark|0.073119 gray|0.073119 dark|0.073119 grey|0.073119 slate|0.05095 gray|0.05095 black|0.048802 firebrick|0.042139 tomato|0.039542 light|0.033682 slate|0.033682 gray|0.033682 white|0.021804 smoke|0.021804 gainsboro|0.020288 dark|0.019552 red|0.019552 silver|0.019244 light|0.018761 gray|0.018761 light|0.018761 grey|0.018761 alice|0.018506 blue|0.018506 ghost|0.018158 white|0.018158 snow|0.01801 white|0.016369 lavender|0.016101 blush|0.016101 sea|0.015933 shell|0.015933 mint|0.0153 cream|0.0153 azure|0.01504 maroon|0.014495 dark|0.012513 slate|0.012513 gray|0.012513 floral|0.012449 white|0.012449 brown|0.011815 misty|0.0089816 rose|0.0089816 dark|0.0081962 olive|0.0081962 green|0.0081962 dark|0.0073828 khaki|0.0073828 cadet|0.0068093 blue|0.0068093 linen|0.0067724  "
		}
	}
}
