{
	"add": {
		"doc": {
			"id": "7808b9f072e424e955575c85e218fe5ad89a4b27a8d632d51061a0fb4535e061",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Long_Beach_California_from_Airplane_looking_North.jpg/250px-Long_Beach_California_from_Airplane_looking_North.jpg",
			"previous": [
				"Other places in Long Beach to see natural areas include Bluff Park (coastal bluffs), the Golden Shores Marine Reserve, the Jack Dunster Marine Reserve, Shoreline Park, and DeForest Park.",
				"The El Dorado Nature Center has changed its original \"hands-off\" approach and has begun to actively introduce indigenous species.[38] The Los Cerritos Wetlands Study Group, state government agencies, and grassroots groups are collaborating on a plan to preserve Long Beach's last remaining wetlands.[39] Long Beach is the first city in California to join the 'EcoZone' Program, intended to measurably improve environmental conditions through public-private partnerships. Such projects seek to reduce pollution, restore native habitat, and provide green areas for the city's residents to enjoy."
			],
				"after": "The 2010 United States Census[40] reported that Long Beach had a population of 462,257.[11] The population density was 9,191.3 people per square mile (3,548.8/km²). The racial makeup of Long Beach was 213,066 (46.1%) White, 62,603 (13.5%) Black or African American, 3,458 (0.7%) Native American, 59,496 (12.9%) Asian (4.5% Filipino, 3.9% Cambodian, 0.9% Vietnamese, 0.6% Chinese, 0.6% Japanese, 0.4% Indian, 0.4% Korean, 0.2% Thai, 0.1% Laotian, 0.1% Hmong), 5,253 (1.1%) Pacific Islander (0.8% Samoan, 0.1% Guamanian, 0.1% Tongan), 93,930 (20.3%) from other races, and 24,451 (5.3%) from two or more races. Hispanic or Latino of any race were 188,412 persons (40.8%). 32.9% of the city's population was of Mexican heritage.[41] Non-Hispanic Whites were 29.4% of the population in 2010,[11] down from 86.2% in 1970.[27]",
			"color": "dim|0.51833 gray|0.51833 dim|0.51833 grey|0.51833 gray|0.22462 grey|0.22462 black|0.22087 dark|0.02303 gray|0.02303 dark|0.02303 grey|0.02303  "
		}
	}
}
