{
	"add": {
		"doc": {
			"id": "780ed92e753685c9d090ac9f3a3bb6e00c3fc802a651e2ae71f8753736ab14d9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Blaeu_-_Atlas_of_Scotland_1654_-_SKIA_-_The_Isle_of_Skye.jpg/220px-Blaeu_-_Atlas_of_Scotland_1654_-_SKIA_-_The_Isle_of_Skye.jpg",
				"previous": "The most powerful clans on Skye in the post–Norse period were Clan MacLeod, originally based in Trotternish, and Clan Macdonald of Sleat. Following the disintegration of the Lordship of the Isles, the Mackinnons also emerged as an independent clan, whose substantial landholdings in Skye were centred on Strathaird.[55] Clan MacNeacail also have a long association with Trotternish,[56] and in the 16th century many of the MacInnes clan moved to Sleat.[57] The MacDonalds of South Uist were bitter rivals of the MacLeods, and an attempt by the former to murder church-goers at Trumpan in retaliation for a previous massacre on Eigg, resulted in the Battle of the Spoiling Dyke of 1578.[58]",
				"after": "After the failure of the Jacobite rebellion of 1745, Flora MacDonald became famous for rescuing Prince Charles Edward Stuart from the Hanoverian troops. Although she was born on South Uist her story is strongly associated with their escape via Skye and she is buried at Kilmuir in Trotternish.[59] Samuel Johnson and James Boswell's visit to Skye in 1773 and their meeting with Flora MacDonald in Kilmuir is recorded in Boswell's The Journal of a Tour to the Hebrides. Boswell wrote, \"To see Dr. Samuel Johnson, the great champion of the English Tories, salute Miss Flora MacDonald in the isle of Sky, [sic] was a striking sight; for though somewhat congenial in their notions, it was very improbable they should meet here\".[60] Johnson's words that Flora MacDonald was \"A name that will be mentioned in history, and if courage and fidelity be virtues, mentioned with honour\" are written on her gravestone.[61] After this rebellion the clan system was broken up and Skye became a series of landed estates.[62]",
			"color": "antique|0.10996 white|0.10996 blanched|0.064258 almond|0.064258 bisque|0.061402 papaya|0.059799 whip|0.059799 wheat|0.047234 misty|0.044656 rose|0.044656 tan|0.040913 dark|0.040536 gray|0.040536 dark|0.040536 grey|0.040536 silver|0.039445 linen|0.03404 pale|0.031353 golden|0.031353 rod|0.031353 light|0.029785 gray|0.029785 light|0.029785 grey|0.029785 khaki|0.029711 gray|0.029107 grey|0.029107 old|0.028502 lace|0.028502 beige|0.027794 dark|0.027455 khaki|0.027455 corn|0.027239 silk|0.027239 gainsboro|0.020705 dim|0.019225 gray|0.019225 dim|0.019225 grey|0.019225 moccasin|0.016728 thistle|0.015242 sea|0.014948 shell|0.014948 lemon|0.014096 chiffon|0.014096 light|0.013814 golden|0.013814 rod|0.013814 yellow|0.013814 peach|0.013274 puff|0.013274 floral|0.011321 white|0.011321 light|0.011149 yellow|0.011149 lavender|0.010496 blush|0.010496 rosy|0.0089609 brown|0.0089609 navajo|0.0089358 white|0.0089358 ivory|0.0081496  "
		}
	}
}
