{
	"add": {
		"doc": {
			"id": "782394c617defa2917a89a99e491eb02abdf6d900e968cd902807a641798b924",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/DE-def-art-declensions-en.svg/220px-DE-def-art-declensions-en.svg.png",
				"previous": "German is an inflected language with three grammatical genders; as such, there can be a large number of words derived from the same root.",
			"after": [
				"German nouns inflect by case, gender, and number:",
				"This degree of inflection is considerably less than in Old High German and other old Indo-European languages such as Latin, Ancient Greek, and Sanskrit, and also somewhat less than, for instance, Old English, modern Icelandic and Russian. The three genders have collapsed in the plural, which now behaves, grammatically, somewhat as a fourth gender. With four cases and three genders plus plural there are 16 permutations of case and gender/number, but there are only six forms of the definite article, which together cover all 16 permutations. In nouns, inflection for case is required in the singular for strong masculine and neuter nouns, in the genitive, and sometimes in the dative. Both of these cases are losing ground to substitutes in informal speech. The dative noun ending is considered somewhat old-fashioned in many contexts and is often dropped, but it is still used in proverbs and the like, in formal speech, and in written language. Weak masculine nouns share a common case ending for genitive, dative and accusative in the singular. Feminine nouns are not declined in the singular. The plural does have an inflection for the dative. In total, seven inflectional endings (not counting plural markers) exist in German: -s, -es, -n, -ns, -en, -ens, -e."
			],
			"color": "white|0.091699 smoke|0.091699 white|0.09041 snow|0.090349 mint|0.089995 cream|0.089995 ghost|0.089623 white|0.089623 azure|0.089249 floral|0.088902 white|0.088902 alice|0.088374 blue|0.088374 sea|0.086433 shell|0.086433 lavender|0.081342 blush|0.081342 black|0.035297 dim|0.016622 gray|0.016622 dim|0.016622 grey|0.016622 dark|0.014717 gray|0.014717 dark|0.014717 grey|0.014717 gray|0.013768 grey|0.013768 silver|0.012597 light|0.0073436 gray|0.0073436 light|0.0073436 grey|0.0073436 gainsboro|0.0066589 ivory|0.0051023  "
		}
	}
}
