{
	"add": {
		"doc": {
			"id": "78258bd02b11d2484a8784b5f787206b93408a6d3e31eb7f5771387fdb46e756",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Typhoon_McGoon_II%2C_New_Caledonia%2C_January_1943.jpg/220px-Typhoon_McGoon_II%2C_New_Caledonia%2C_January_1943.jpg",
				"previous": "On 7 December 1941, a group of 12 B-17s of the 38th (four B-17C) and 88th (eight B-17E) Reconnaissance Squadrons, en route to reinforce the Philippines, were flown into Pearl Harbor from Hamilton Field, California, arriving during the attack on Pearl Harbor. Leonard \"Smitty\" Smith Humiston, co-pilot on First Lieutenant Robert H. Richards' B-17C, AAF S/N 40-2049, reported that he thought the U.S. Navy was giving the flight a 21-gun salute to celebrate the arrival of the bombers, after which he realized that Pearl Harbor was under attack. The Fortress came under fire from Japanese fighter aircraft, though the crew was unharmed with the exception of one member who suffered an abrasion on his hand. Enemy activity forced an abort from Hickam Field to Bellows Field, where the aircraft overran the runway and into a ditch where it was then strafed. Although initially deemed repairable, 40-2049 (11th BG / 38th RS) received more than 200 bullet holes and never flew again. Ten of the 12 Fortresses survived the attack.[106]",
				"after": "By 1941, the Far East Air Force (FEAF) based at Clark Field in the Philippines had 35 B-17s, with the War Department eventually planning to raise that to 165.[107] When the FEAF received word of the attack on Pearl Harbor, General Lewis H. Brereton sent his bombers and fighters on various patrol missions to prevent them from being caught on the ground. Brereton planned B-17 raids on Japanese air fields in Formosa, in accordance with Rainbow 5 war plan directives, but this was overruled by General Douglas MacArthur.[108] A series of disputed discussions and decisions, followed by several confusing and false reports of air attacks, delayed the authorization of the sortie. By the time the B-17s and escorting Curtiss P-40 Warhawk fighters were about to get airborne, they were destroyed by Japanese bombers of the 11th Air Fleet. The FEAF lost half its aircraft during the first strike,[109] and was all but destroyed over the next few days.",
			"color": " "
		}
	}
}
