{
	"add": {
		"doc": {
			"id": "783795a492e16c1450d80573a5b9fd3cbba857d813c2a56ec9f1678479cb5de3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Stuy_HS_sunny_jeh.JPG/220px-Stuy_HS_sunny_jeh.JPG",
			"previous": [],
				"after": "Stuyvesant students undertake a college preparatory curriculum that includes four years of English, history, and laboratory-based sciences (biology, chemistry and physics are required), four years of mathematics (previously three, changed from Class of 2015 onward) and three years of a single foreign language, a semester each of introductory art, music, health and technical drawing, two semesters of computer science (previously one, changed from class of 2015 onward),[54] and two lab-based technology courses. Several exemptions from technology education exist for seniors.[55][56] Stuyvesant offers students a broad selection of elective courses. Some of the more unusual offerings include robotics, astronomy, New York City history, Women's Voices, and the mathematics of financial markets.[57] Most students complete the New York City Regents courses by junior year and take calculus during their senior year. However, the school offers math courses through differential equations for the more advanced students. A year of technical drawing used to be required; students learned how to draft by hand in its first semester and how to draft using a computer (CAD) in the second. Now, students take a one-semester technical drawing class (a compacted version of the former drafting course), and a semester of introductory computer science, which introduces NetLogo and Racket. For the class of 2015, the one-semester computer science course was replaced with a two-semester course.[54]",
			"color": "tan|0.16939 dim|0.13405 gray|0.13405 dim|0.13405 grey|0.13405 black|0.12658 gray|0.1026 grey|0.1026 light|0.094841 slate|0.094841 gray|0.094841 slate|0.085996 gray|0.085996 dark|0.076009 gray|0.076009 dark|0.076009 grey|0.076009 light|0.042705 steel|0.042705 blue|0.042705 light|0.022713 blue|0.022713 silver|0.022597 dark|0.017922 slate|0.017922 gray|0.017922 burly|0.011365 wood|0.011365 light|0.010158 gray|0.010158 light|0.010158 grey|0.010158 lavender|0.0084741 alice|0.0080951 blue|0.0080951 gainsboro|0.0077054 powder|0.0073896 blue|0.0073896 ghost|0.0061302 white|0.0061302  "
		}
	}
}
