{
	"add": {
		"doc": {
			"id": "783b0714c2eabee44387a5520f9f6660828c6575402c753b4596548321b75fb8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Bataille_Jemmapes.jpg/220px-Bataille_Jemmapes.jpg",
				"previous": "In 1684 there was a major reorganisation of the French infantry and again in 1701 to fit in with Louis XIV's plans and the War of the Spanish Succession. This reshuffle created many of the modern regiments of the French Army and standardised their equipment and tactics. The army of the Sun King tended to wear grey-white coats with coloured linings. There were exceptions and the foreign troops, recruited from outside France, wore red (Swiss, Irish...) or blue (Germans, Scots...) while the French Guards wore blue. In addition to these regiments of the line the Maison du Roi provided several elite units, the Swiss Guards, French Guards and the Regiments of Musketeers being the most famous. The white/grey coated French Infantry of the line Les Blancs with their Charleville muskets were a feared foe on the battlefields of the seventeenth and eighteenth centuries, fighting in the Nine Years' War, the Wars of Spanish and Austrian Succession, the Seven Years' War and the American Revolution.",
				"after": "The revolution split the army with the main mass losing most of its officers to aristocratic flight or guillotine and becoming demoralised and ineffective. The French Guard joined the revolt and the Swiss Guards were massacred during the storming of the Tuileries palace. The remnants of the royal army were then joined to the revolutionary militias known as sans-culottes, and the \"National Guard\" a more middle class militia and police force, to form the French Revolutionary Army.",
			"color": "tan|0.15094 rosy|0.15 brown|0.15 peach|0.1283 puff|0.1283 burly|0.064633 wood|0.064633 misty|0.063989 rose|0.063989 bisque|0.047917 dark|0.044304 salmon|0.044304 antique|0.043085 white|0.043085 blanched|0.02338 almond|0.02338 light|0.023036 gray|0.023036 light|0.023036 grey|0.023036 dim|0.021776 gray|0.021776 dim|0.021776 grey|0.021776 silver|0.021362 wheat|0.020499 linen|0.019027 papaya|0.018849 whip|0.018849 dark|0.017105 gray|0.017105 dark|0.017105 grey|0.017105 gainsboro|0.016894 gray|0.015709 grey|0.015709 navajo|0.011814 white|0.011814 sienna|0.010499 old|0.010389 lace|0.010389 sea|0.0095517 shell|0.0095517 moccasin|0.0081107  "
		}
	}
}
