{
	"add": {
		"doc": {
			"id": "783ff52cf99beec4f04526fa7a7fe0641747d7c9c71fe0013430b9f74fdaa693",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Manchester_interchange_station.png/220px-Manchester_interchange_station.png",
			"previous": [],
				"after": "Manchester Airport railway station, opened in May 1993,[68] by British Rail forms part of The Station and is located between Terminals 1 and 2. It is linked to the terminals using a Skylink moving walkway. Trains are operated either by Northern Rail or First TransPennine Express and connect the airport to Manchester Piccadilly Station and other railway stations mainly throughout northern England, including Crewe, Wigan and Southport, but some trains come from as far as Edinburgh Waverley. A third rail platform was completed in December 2008 to allow for an increase in rail capacity. In 2009 Network Rail stated that the creation of the third platform has meant that the capacity at Manchester airport will become constrained by the layover of the trains and congestion at the throat. To solve this issue they have recommended building a line underneath the Airport towards Northwich in the 2019 to 2024 period.[69] On 28 January 2013, the Government announced the station will be included in the 2nd stage of High Speed 2 which will give the airport direct links with other British cities like Birmingham and London and also a quicker route into Central Manchester. Work on building a new fourth platform commenced in early 2014 with a blockade required in February 2015 to allow completion.",
			"color": "light|0.138 gray|0.138 light|0.138 grey|0.138 gainsboro|0.13088 white|0.06498 smoke|0.06498 lavender|0.050681 silver|0.050538 ghost|0.045787 white|0.045787 linen|0.040872 snow|0.037268 sea|0.036914 shell|0.036914 lavender|0.031794 blush|0.031794 old|0.031217 lace|0.031217 floral|0.031135 white|0.031135 white|0.029538 alice|0.028714 blue|0.028714 mint|0.027592 cream|0.027592 ivory|0.02421 dark|0.02269 gray|0.02269 dark|0.02269 grey|0.02269 dim|0.02126 gray|0.02126 dim|0.02126 grey|0.02126 antique|0.01878 white|0.01878 gray|0.017567 grey|0.017567 papaya|0.015667 whip|0.015667 blanched|0.014773 almond|0.014773 light|0.01372 steel|0.01372 blue|0.01372 bisque|0.011362 wheat|0.0088814 beige|0.0084035 dark|0.0070587 sea|0.0070587 green|0.0070587 black|0.0047694 light|0.0046382 coral|0.0046382 honeydew|0.0044006 corn|0.003516 silk|0.003516 indian|0.0034101 red|0.0034101  "
		}
	}
}
