{
	"add": {
		"doc": {
			"id": "7881794c6cf127a06f1cb41e510aa6564d65891ff828de778489d447f4a74704",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Hieronymus_Bosch_-_Triptych_of_Garden_of_Earthly_Delights_%28detail%29_-_WGA2516.jpg/320px-Hieronymus_Bosch_-_Triptych_of_Garden_of_Earthly_Delights_%28detail%29_-_WGA2516.jpg",
				"previous": "The pools in the fore and background contain bathers of both sexes. In the central circular pool, the sexes are mostly segregated, with several females adorned by peacocks and fruit.[37] Four women carry cherry-like fruits on their heads, perhaps a symbol of pride at the time, as has been deduced from the contemporaneous saying: \"Don't eat cherries with great lords–they'll throw the pits in your face.\"[43] The women are surrounded by a parade of naked men riding horses, donkeys, unicorns, camels, and other exotic or fantastic creatures.[34] several men show acrobatics while riding, apparently acts designed to gain the females' attention, which highlights the attraction felt between the two sexes as groups.[37] The two outer springs also contain both men and women cavorting with abandon. Around them, birds infest the water while winged fish crawl on land. Humans inhabit giant shells. All are surrounded by over-sized fruit pods and eggshells, and both humans and animals feast on strawberries and cherries.",
				"after": "The impression of a life lived without consequence, or what art historian Hans Belting describes as \"unspoilt and pre-moral existence\", is underscored by the absence of children and old people.[44] According to the second and third chapters of Genesis, Adam and Eve's children were born after they were expelled from Eden. This has led some commentators, in particular Belting, to theorise that the panel represents the world if the two had not been driven out \"among the thorns and thistles of the world\". In Fraenger's view, the scene illustrates \"a Utopia, a garden of divine delight before the Fall, or — since Bosch could not deny the existence of the dogma of Original Sin — a millennial condition that would arise if, after expiation of Original Sin, humanity were permitted to return to Paradise and to a state of tranquil harmony embracing all Creation.\"[45]",
			"color": "dim|0.29444 gray|0.29444 dim|0.29444 grey|0.29444 gray|0.14343 grey|0.14343 tan|0.079979 dark|0.067871 gray|0.067871 dark|0.067871 grey|0.067871 black|0.061712 slate|0.040393 gray|0.040393 silver|0.03003 wheat|0.024299 rosy|0.022369 brown|0.022369 antique|0.022354 white|0.022354 light|0.021494 gray|0.021494 light|0.021494 grey|0.021494 light|0.021297 slate|0.021297 gray|0.021297 burly|0.0184 wood|0.0184 gainsboro|0.016945 linen|0.011307 brown|0.01073 blanched|0.009915 almond|0.009915 bisque|0.0097735 sienna|0.0095062 papaya|0.0091521 whip|0.0091521 misty|0.0089295 rose|0.0089295 old|0.0071113 lace|0.0071113  "
		}
	}
}
