{
	"add": {
		"doc": {
			"id": "789433a2c857ed254b651b26d45a0de7a343e4a7816bb2536c14e894bdc3d8ea",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Boeing_747-830%2C_Lufthansa_AN2119979.jpg/220px-Boeing_747-830%2C_Lufthansa_AN2119979.jpg",
			"previous": [],
				"after": "First Class is offered on most long-haul aircraft (Airbus A330-300, A340-300, A340-600, the front part of the upper deck of all Airbus A380s, and the main deck nose section of all Boeing 747–8s). Each seat converts to a 2 metres (6 ft 7 in) bed, includes laptop power outlets, as well as entertainment facilities. On Boeing 747-400s fitted with a first class cabin, First Class is situated on the upper deck, with a window-side bed and aisle seat all as part of one ticket. Meals are available on demand. Lufthansa offers dedicated First Class check-in counters at most airports, and offers dedicated First Class lounges in Frankfurt and Munich, as well as a dedicated First Class Terminal in Frankfurt. Arriving passengers have the option of using Lufthansa's First Class arrival facilities, as well as the new Welcome Lounge. Lufthansa has introduced a new First Class product aboard the Airbus A380 and plans to gradually introduce it on all of its long-haul aircraft.[70] With the new programme SCORE, introduced to boost profits by 1.5 billion euros over the following years, LH will stop route expansion and extensively decrease its First Class offerings on most routes.[71][72]",
			"color": "black|0.33217 dark|0.143 gray|0.143 dark|0.143 grey|0.143 dim|0.12985 gray|0.12985 dim|0.12985 grey|0.12985 gray|0.12478 grey|0.12478 silver|0.064413 light|0.035821 gray|0.035821 light|0.035821 grey|0.035821 gainsboro|0.022973 slate|0.013217 gray|0.013217 white|0.0109 smoke|0.0109 sea|0.0098473 shell|0.0098473 snow|0.0089746 light|0.0089676 slate|0.0089676 gray|0.0089676 linen|0.0085696 floral|0.0084085 white|0.0084085 white|0.0078426 mint|0.0077499 cream|0.0077499 ghost|0.007336 white|0.007336 alice|0.0069689 blue|0.0069689 lavender|0.0064796 blush|0.0064796  "
		}
	}
}
