{
	"add": {
		"doc": {
			"id": "78bc02c23e1e83821061e1dbfdad1326f55037e0bd7d62c8e82985724abfc887",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Hercules_C130_bombardier_d_eau_Californie.jpg/220px-Hercules_C130_bombardier_d_eau_Californie.jpg",
				"previous": "In the United States, most of these aircraft are privately owned and contracted to government agencies, and the National Guard and the U.S. Marines also maintain fleets of firefighting aircraft. On May 10, 2004, The U.S. Forest Service (USFS) and the Bureau of Land Management (BLM) announced that they were cancelling contracts with operators of 33 heavy airtankers. They cited liability concerns and an inability to safely manage the fleet after the wing failure and resulting crash of a C-130A Hercules in California and a PB4Y-2 in Colorado during the summer of 2002. Both aged aircraft broke up in flight due to catastrophic fatigue cracks at the wing roots. After subsequent third-party examination and extensive testing of all USFS contracted heavy airtankers, three companies were awarded contracts and now maintain a combined fleet of 23 aircraft.",
				"after": "Borate salts used in the past to fight wildfires have been found to sterilize the soil and be toxic to animals so are now prohibited.[20] Newer retardants use ammonium sulfate or ammonium polyphosphate with attapulgite clay thickener or diammonium phosphate with a guar gum derivative thickener. These are not only less toxic but act as fertilizers to help the regrowth of plants after the fire. Fire retardants often contain wetting agents, preservatives and rust inhibitors and are colored red with ferric oxide or fugitive color to mark where they have been dropped. Brand names of fire retardants for aerial application include Fire-Trol and Phos-Chek.",
			"color": "dim|0.42382 gray|0.42382 dim|0.42382 grey|0.42382 black|0.34348 gray|0.074153 grey|0.074153 dark|0.033818 slate|0.033818 gray|0.033818 firebrick|0.026474 maroon|0.023082 dark|0.018318 red|0.018318 brown|0.012053 slate|0.0096169 gray|0.0096169 tomato|0.0068611 indian|0.0067636 red|0.0067636  "
		}
	}
}
