{
	"add": {
		"doc": {
			"id": "78c58fe0e2fcafe92131b902bc1e775b6b29f097f1e326bc4cc00ace02e35d76",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/US_Navy_040429-N-7949W-001_The_Deep_Submergence_Rescue_Vehicle_Mystic_%28DSRV_1%29_is_carefully_loaded_onto_a_Russian-built_An-124_Condor_%28Antonov%29.jpg/220px-US_Navy_040429-N-7949W-001_The_Deep_Submergence_Rescue_Vehicle_Mystic_%28DSRV_1%29_is_carefully_loaded_onto_a_Russian-built_An-124_Condor_%28Antonov%29.jpg",
				"previous": "Germany led the recent effort to lease An-124s for NATO strategic airlift requirements. Two aircraft are leased from SALIS GmbH as a stopgap until the Airbus A400M is available.[22] Under NATO SALIS programme NAMSA is chartering six An-124-100 transport aircraft. According to the contract An-124-100s of Antonov Airlines and Volga-Dnepr are used within the limits of NATO SALIS programme to transport cargo by requests of 18 countries: Belgium, Hungary, Greece, Denmark, Canada, Luxembourg, Netherlands, Norway, United Kingdom, Poland, Portugal, Slovakia, Slovenia, Finland, France, Germany, Czech Republic and Sweden. Two An-124-100s are constantly based on full-time charter in the Leipzig/Halle airport, but the contract specifies that if necessary, two more aircraft will be provided on six days notice and another two on nine days notice.[23] The aircraft proved extremely useful for NATO especially with ongoing operations in Iraq and Afghanistan.[24]",
				"after": "United Launch Alliance (ULA) contracts the An-124 to transport the Atlas V launch vehicle from its facilities in Decatur, Alabama to Cape Canaveral. ULA also uses the An-124 to transport the Atlas V launch vehicle and Centaur upper stage from their manufacturing facility in Denver, Colorado to Cape Canaveral and Vandenberg Air Force Base.[25] Two flights are required to transfer each launch vehicle (one for the Atlas V main booster stage and another for the Centaur upper stage).[26] It is also contracted by Space Systems Loral to transport satellites from Palo Alto, CA to the Arianespace spaceport in Kourou, French Guiana.[27]",
			"color": "black|0.51188 dim|0.13854 gray|0.13854 dim|0.13854 grey|0.13854 light|0.077962 slate|0.077962 gray|0.077962 slate|0.071345 gray|0.071345 gray|0.058251 grey|0.058251 dark|0.023567 gray|0.023567 dark|0.023567 grey|0.023567 antique|0.0097257 white|0.0097257 beige|0.0096848  "
		}
	}
}
