{
	"add": {
		"doc": {
			"id": "78f11074bbf5b1c3fab0b9566a24c0eab0ff6f6bbd253df653c757003211192f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Minas_Geraes-class_battleship_drawings.jpg/370px-Minas_Geraes-class_battleship_drawings.jpg",
			"previous": [],
				"after": "Brazil's Minas Geraes, the lead ship, was laid down by Armstrong on 17 April 1907, while its sister São Paulo followed thirteen days later at Vickers. Completion of the partial hull needed to launch Minas Geraes was delayed by a five-month strike to 10 September 1908. São Paulo followed on 19 April 1909.[85] Both were christened in front of large crowds by the wife of Francisco Régis de Oliveira, the Brazilian ambassador to the United Kingdom.[86] After fitting-out, the period after a warship's launch where it is completed, Minas Geraes was put through multiple trials of the speed, endurance, efficiency, and weaponry of the ship in September, including what was at that time the heaviest broadside ever fired off a warship, Minas Geraes was completed and handed over to Brazil on 5 January 1910.[87] The trials proved that the blast from the class' superfiring upper turrets would not injure crewmen in the lower turrets. The ship itself managed to reach 21.432 knots (24.664 mph; 39.692 km/h) on an indicated horsepower (ihp) of 27,212.[88] São Paulo followed its classmate in July, after its own trials at the end of May, where the ship reached 21.623 knots (24.883 mph; 40.046 km/h) at 28,645 ihp.[89]",
			"color": "light|0.09801 gray|0.09801 light|0.09801 grey|0.09801 silver|0.094291 gainsboro|0.089653 dark|0.084317 gray|0.084317 dark|0.084317 grey|0.084317 white|0.070318 smoke|0.070318 sea|0.058864 shell|0.058864 snow|0.055626 ghost|0.054888 white|0.054888 alice|0.054859 blue|0.054859 floral|0.053077 white|0.053077 white|0.048884 gray|0.047038 grey|0.047038 mint|0.045045 cream|0.045045 linen|0.044085 azure|0.039376 dim|0.023862 gray|0.023862 dim|0.023862 grey|0.023862 lavender|0.018888 blush|0.018888 ivory|0.018802  "
		}
	}
}
