{
	"add": {
		"doc": {
			"id": "791c4371680bb7e40b0e682ee837ca0f01f084f572d19eccf09c2f342abc6d72",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Baltimore_City_College.jpg/220px-Baltimore_City_College.jpg",
				"previous": "In 1978, at the urging of concerned alumni, City College underwent its first major capital renovations. When the campus reopened, the high school welcomed women for the first time. The all-male tradition did not end easily; alumni had argued for the uniqueness of a single-sex educational system and convinced the task force studying the issue to vote 11–6 in favor of keeping the all-male tradition. The Board of School Commissioners, in a reversal, voted to admit women citing constitutional concerns.[26]",
				"after": "City College stands on a 38-acre (153,781 m2) campus in northeast Baltimore at the intersection of 33rd Street and the Alameda.[27] The campus consists of two buildings: the Gothic-style edifice known locally as the \"Castle on the Hill\" that sits in the center of the campus, and the power plant building east of the castle. In addition to providing the building's utilities, the power plant originally housed five workshops: an electrical shop, a mechanical shop, a metal shop, a printing shop, and a wood shop.[28] It currently houses the Coldstream-Homestead-Montebello community corporation headquarters. Only the main building is in academic use by the school. Both buildings were designed by the architecture firm of Buckler and Fenhagen. Just south of the main building is Alumni Field, the school's stadium, which serves as home to the football, boys and girls lacrosse and track teams. During a major building renovation in 1978 a modern gymnasium was added to the southwest corner of the main building.",
			"color": "dim|0.3705 gray|0.3705 dim|0.3705 grey|0.3705 gray|0.18939 grey|0.18939 black|0.14428 dark|0.067865 gray|0.067865 dark|0.067865 grey|0.067865 tan|0.054043 silver|0.027508 rosy|0.02503 brown|0.02503 dark|0.01769 olive|0.01769 green|0.01769 peach|0.011661 puff|0.011661  "
		}
	}
}
