{
	"add": {
		"doc": {
			"id": "7929f8e1c4a1e3cb014a405dadc9e6585edecf2ac307dcdcac72bf773a244666",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Progress_Hong_Kong_1a_IMG_1286.JPG/170px-Progress_Hong_Kong_1a_IMG_1286.JPG",
				"previous": "In 1997, a Boeing 747-200 (B-HIB) named Spirit of Hong Kong, with a special livery, a big traditional Chinese brushstroke character \"家\" (means family/home), a traditional Chinese wording \"繁榮進步 更創新高\" painted on the left side of the aircraft and a wording \"The Spirit of Hong Kong 97\" painted on the right side of the aircraft, to commemorate the handover of Hong Kong back to China.[102] On 17 January 2000, Spirit of Hong Kong made a return on a Boeing 747-400 (B-HOX) to celebrate the legendary resilience of Hong Kong with a new special livery depicts a young athlete overcoming a series of challenges to reach his goal. A special wording \"Same Team. Same Dream.\" was painted on the left side of the aircraft and a traditional Chinese wording \"積極進取 飛越更高理想\" was painted on the right side of the aircraft.[103][104][105] On 30 July 2013, Spirit of Hong Kong made another return, this time, on a Boeing 777-300ER (B-KPB). The livery features 110 people who represent the extraordinary spirit of Hong Kong people. The livery also has the wordings \"The Spirit of Hong Kong 香港精神號\" The livery is actually an online contest held by Cathay Pacific to call on Hong Kong people to submit creative entries that illustrate the true spirit of the city – along with a full-body photograph of themselves. The judging panel then chose 100 winners and 10 champions – and their silhouettes have been painted on the plane.[106][107]",
				"after": "On 5 July 2002, a Boeing 747-400 (B-HOY), named Asia's world city, carried a special livery, the \"Asia's world city\" brandline, the Brand Hong Kong logotype and the dragon symbol, to promote Hong Kong around the world.[108] In January 2008, a new Boeing 777-300ER (B-KPF) was painted in the Asia's world city livery.[109]",
			"color": "dark|0.34189 gray|0.34189 dark|0.34189 grey|0.34189 dim|0.19873 gray|0.19873 dim|0.19873 grey|0.19873 dark|0.19627 slate|0.19627 gray|0.19627 gray|0.1079 grey|0.1079 slate|0.057992 gray|0.057992 silver|0.048569 light|0.030943 slate|0.030943 gray|0.030943 light|0.0069324 gray|0.0069324 light|0.0069324 grey|0.0069324 black|0.0048965  "
		}
	}
}
