{
	"add": {
		"doc": {
			"id": "7930638d97d0f9761551f625b66991f25d74c18fe6490b8bf73dd91aaff4ef92",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/McKinley1904-7.jpg/200px-McKinley1904-7.jpg",
				"previous": "In addition to the Canton site there are many memorials to McKinley. There is a monument at his birthplace in Niles; 20 Ohio schools bear his name.[228] Nearly a million dollars was pledged by contributors or allocated from public funds for the construction of McKinley memorials in the year after his death.[229] Phillips suggests the significant number of major memorials to McKinley in Ohio reflected the expectation among Ohioans in the years after McKinley's death that he would be ranked among the great presidents.[230] Statues to him may be found in more than a dozen states; his name has been bestowed on streets, civic organizations, and libraries. Mount McKinley in central Alaska is named for the former president; its summit, at 20,320 feet (6,190 m), is the highest point in North America. Until its name was changed to Denali National Park, the park in which it is located was known as Mount McKinley National Park.[228]",
				"after": "McKinley’s biographer, H. Wayne Morgan remarks that McKinley died the most beloved president in history.[231] However, the young, enthusiastic Roosevelt quickly captured public attention after his predecessor’s death. The new president made little effort to secure the trade reciprocity McKinley had intended to negotiate with other nations. Controversy and public interest surrounded Roosevelt throughout the seven and a half years of his presidency as memories of McKinley faded; by 1920, according to Gould, McKinley’s administration was deemed no more than “a mediocre prelude to the vigor and energy of Theodore Roosevelt’s”.[221] Beginning in the 1950s, McKinley received more favorable evaluations; nevertheless, in surveys ranking American presidents, he has generally been placed near the middle, often trailing contemporaries such as Hayes and Cleveland.[221] Morgan suggests that this relatively low ranking is due to a perception among historians that while many decisions during McKinley’s presidency profoundly affected the nation’s future, he more followed public opinion than led it, and that McKinley’s standing has suffered from altered public expectations of the presidency.[232]",
			"color": "cadet|0.1456 blue|0.1456 black|0.087225 light|0.070635 slate|0.070635 gray|0.070635 slate|0.0661 gray|0.0661 dark|0.048872 slate|0.048872 gray|0.048872 dark|0.046182 gray|0.046182 dark|0.046182 grey|0.046182 steel|0.042147 blue|0.042147 powder|0.039249 blue|0.039249 light|0.03434 blue|0.03434 silver|0.032921 dim|0.030288 gray|0.030288 dim|0.030288 grey|0.030288 gray|0.028241 grey|0.028241 light|0.026665 gray|0.026665 light|0.026665 grey|0.026665 honeydew|0.025472 light|0.023413 steel|0.023413 blue|0.023413 gainsboro|0.02259 beige|0.019476 light|0.014889 cyan|0.014889 mint|0.014395 cream|0.014395 pale|0.012163 turquoise|0.012163 ivory|0.012113 azure|0.011856 light|0.01104 yellow|0.01104 white|0.010534 smoke|0.010534 floral|0.0098702 white|0.0098702 light|0.009245 golden|0.009245 rod|0.009245 yellow|0.009245  "
		}
	}
}
