{
	"add": {
		"doc": {
			"id": "7938ed2c8a0eb7ef54abf14d8e5c27412743613297be82bf70c7af180e6acf8a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/World_Time_Zones_Map.png/500px-World_Time_Zones_Map.png",
				"previous": "Prior to the introduction of standard time, each municipality throughout the civilized world set its official clock, if it had one, according to the local position of the Sun (see solar time). This served adequately until the introduction of rail travel in Britain, which made it possible to travel fast enough over long distances to require continuous re-setting of timepieces as a train progressed in its daily run through several towns. Greenwich Mean Time, where all clocks in Britain were set to the same time, was established to solve this problem. Chronometers or telegraphy were used to synchronize these clocks.[4]",
				"after": "Standard time, as originally proposed by Scottish-Canadian Sir Sandford Fleming in 1879, divided the world into twenty-four time zones, each one covering 15 degrees of longitude. All clocks within each zone would be set to the same time as the others, but differed by one hour from those in the neighboring zones. The local time at the Royal Greenwich Observatory in Greenwich, England was chosen as standard at the 1884 International Meridian Conference, leading to the widespread use of Greenwich Mean Time to set local clocks. This location was chosen because by 1884 two-thirds of all nautical charts and maps already used it as their prime meridian.[5] The conference did not adopt Fleming's time zones because they were outside the purpose for which it was called, which was to choose a basis for universal time (as well as a prime meridian).",
			"color": "beige|0.16141 burly|0.12692 wood|0.12692 light|0.11071 gray|0.11071 light|0.11071 grey|0.11071 gainsboro|0.10127 bisque|0.085944 silver|0.077517 peach|0.07267 puff|0.07267 dark|0.066817 gray|0.066817 dark|0.066817 grey|0.066817 tan|0.053313 wheat|0.0283 antique|0.025593 white|0.025593 blanched|0.02482 almond|0.02482 papaya|0.022351 whip|0.022351 corn|0.018163 silk|0.018163 dark|0.0055918 khaki|0.0055918 light|0.0050281 blue|0.0050281 navajo|0.0036454 white|0.0036454  "
		}
	}
}
