{
	"add": {
		"doc": {
			"id": "7939b85f480e0aaa31e2ebe93f42c5de25478fc99dad4e67894f91ab6e6c3c2d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/West_Wycombe_Park_1_%28Giano%29.png/250px-West_Wycombe_Park_1_%28Giano%29.png",
				"previous": "The finest architects of the day submitted plans to transform the older family house into a modern architectural extravaganza. Among them was Robert Adam, who submitted a plan for the west portico, but his idea was dropped;[6] finally, the architect Nicholas Revett was consulted and created the present west portico. Today, the first sight of the house as one approaches from the drive is this large west portico: from this direction, the entire end of the house appears as a Grecian temple. This eight-columned portico, inspired by the Temple of Bacchus in Baalbek and completed by 1770, is considered to be the earliest example of Greek revival architecture in Britain.[7] The opposite (east) end of the house, designed by John Donowell and completed c.1755, appears equally temple-like, but this time the muse was the Villa Rotunda. Thus the two opposing porticos, east and west, illustrate perfectly the period of architectural transformation of the late 18th century from the earlier Roman inspired Palladian architecture to the more Greek inspired Neoclassicism.",
				"after": "The principal façade is the great south front, a two-storey colonnade of Corinthian columns superimposed on Tuscan, the whole surmounted by a pediment in the centre. The columns are not stone, but wood coated in stucco. This is particularly interesting, as cost was no object in the construction of the house. The architect of this elevation was John Donowell, who executed the work between 1761 and 1763 (although he had to wait until 1775 for payment[8]). The façade, which has similarities to the main façade of Palladio's Palazzo Chiericati of 1550, was originally the entrance front. The front door is still in the centre of the ground floor leading into the main entry hall. This in itself is a substantial deviation from the classical form: West Wycombe does not have a first floor piano nobile: had the architect truly followed Palladio's ideals, the main entrance and principal rooms would have been on the first floor reached by an outer staircase, giving the main reception rooms elevated views, and allowing the ground floor to be given over to service rooms.",
			"color": "dark|0.228 khaki|0.228 black|0.17982 gray|0.17311 grey|0.17311 dim|0.14491 gray|0.14491 dim|0.14491 grey|0.14491 dark|0.13726 gray|0.13726 dark|0.13726 grey|0.13726 dark|0.067246 olive|0.067246 green|0.067246 silver|0.036898  "
		}
	}
}
