{
	"add": {
		"doc": {
			"id": "794356ac71bdeabf752ef9eb28e05789153f38341a3638593cb467ae6adc054f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Volta_A.jpg/250px-Volta_A.jpg",
			"previous": [],
				"after": "Through the centuries, Italy has given birth to some of the most notable scientific minds, particularly in modern and the contemporary era. Prominent Italian Polymaths such as Leonardo da Vinci, Michelangelo and Leon Battista Alberti made important contributions to a variety of fields, including biology, architecture, engineering. Galileo Galilei, a physicist, mathematician and astronomer, played a major role in the Scientific Revolution. His achievements include key improvements to the telescope and consequent astronomical observations, and ultimately the triumph of Copernicanism over the Ptolemaic model. Other astronomers suchs as Giovanni Domenico Cassini and Giovanni Schiaparelli made many important discoveries about the Solar System. In mathematics, Joseph Louis Lagrange (born Giuseppe Lodovico Lagrangia), Fibonacci, and Gerolamo Cardano made fundamental advances in the field. Physicist Enrico Fermi, a Nobel prize laureate, led the team that developed the first nuclear reactor and is also noted for his many other contributions to physics, including the co-development of the quantum theory. Other prominent physicist include: Amedeo Avogadro ( most noted for his contributions to molecular theory, in particular the Avogadro's law and the Avogadro constant), Evangelista Torricelli (inventor of barometer), Alessandro Volta (inventor of electric battery), Guglielmo Marconi (inventor of radio), Ettore Majorana (who discovered the Majorana fermions), Emilio G. Segrè (who discovered the elements technetium and astatine, and the antiproton), Carlo Rubbia (1984 Nobel Prize in Physics for work leading to the discovery of the W and Z particles at CERN). In biology, Marcello Malpighi founded microscopic anatomy, Lazzaro Spallanzani conducted important research in bodily functions, animal reproduction, and cellular theory, Camillo Golgi, whose many achievements include the discovery of the Golgi complex, paved the way to the acceptance of the Neuron doctrine, Rita Levi-Montalcini discovered the nerve growth factor (awarded 1986 Nobel Prize in Physiology or Medicine). In chemistry, Giulio Natta received the Nobel Prize in Chemistry in 1963 for his work on high polymers. Giuseppe Occhialini received the Wolf Prize in Physics for the discovery of the pion or pi-meson decay in 1947. Ennio de Giorgi, a Wolf Prize in Mathematics recipient in 1990, solved Bernstein's problem about minimal surfaces and the 19th Hilbert problem on the regularity of solutions of Elliptic partial differential equations.",
			"color": " "
		}
	}
}
