{
	"add": {
		"doc": {
			"id": "79452ee5d1b99f9389e09203ef94ccc69b1e8c88a5883b1b8cde0c09f6686691",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Thai_Gem_Cutting.jpg/220px-Thai_Gem_Cutting.jpg",
				"previous": "Kunisaki put his mine up for sale, asking $6 million to recoup his expenses. Even though mine profits had been poor over the decades, prices of precious gems were very high at the time due to the worldwide oil crises of the 1970s and early 1980s. Four individuals or groups seriously considered Kunisaki's offer.[78] Relying heavily upon Delmer Brown's expertise, Harry C. Bullock and J. R. Edington formed the limited partnership American Yogo Sapphire Limited, becoming the 14th American company to work the Yogo dike. Bullock and Brown had Yogo mine experience, as they had worked with di Suvero. Bullock's plan included mining, cutting, making jewelry, and marketing—the whole spectrum of the business. They paid the $6 million asked by Kunisaki and then raised another $7.2 million in funding by October 1981. Brown located quality gemcutters in Thailand, and set up the American Yogo Sapphire Company there. Brown also set up a thorough, computerized security system that tracked gems from the mine to the gemcutters.[78] Bigger roughs were sent to American cutters, specialty cuts were done in Germany, a few cuts were done in Hong Kong, and the vast majority were done in Thailand.[79] American Yogo Sapphire Limited secured a $5 million line of credit with Citibank. Desiring a more modern name, American Yogo Sapphire Limited changed its name to Intergem Limited in early 1982. Intergem marketed the Yogo as the \"Royal American Sapphire.\" Their first line of jewelry appeared in mid-1982, first marketed regionally in the American west and later at the national level. Intergem also developed a system of authorized dealers,[78] and found success in its first four years, with sales over $3 million in 1984 alone.[80]",
				"after": "Intergem rocked the gem trade by marketing the Yogo as the world's only guaranteed untreated sapphire. By 1982, the practice of routinely heat treating gems had become a major issue in the industry.[78] At the time, 95 percent of all the world's sapphires were being heated to enhance their natural color. Thai traders had even purchased large quantities of naturally colorless Sri Lankan sapphires, known as geuda, and heated them to an artificial blue.[81] A problem with the practice was that heated gems often fade over time, though trained gemologists can detect a heated gem with 95 percent accuracy. Intergem's marketing of guaranteed untreated Yogos set them against many in the gem industry.[81][82] In 1985 there was a movement in Pennsylvania to require disclosure that a gem had been treated. Intergem's strategy resulted in large numbers of gem professionals visiting Yogo Gulch.[80]",
			"color": "black|0.17958 tan|0.090845 burly|0.073118 wood|0.073118 sienna|0.060597 golden|0.057994 rod|0.057994 dark|0.039198 gray|0.039198 dark|0.039198 grey|0.039198 dim|0.036921 gray|0.036921 dim|0.036921 grey|0.036921 gray|0.027783 grey|0.027783 silver|0.027732 steel|0.026633 blue|0.026633 light|0.022213 gray|0.022213 light|0.022213 grey|0.022213 saddle|0.021992 brown|0.021992 navajo|0.021559 white|0.021559 peru|0.020864 peach|0.01987 puff|0.01987 gainsboro|0.01878 wheat|0.017613 moccasin|0.014134 bisque|0.013273 sandy|0.012666 brown|0.012666  "
		}
	}
}
