{
	"add": {
		"doc": {
			"id": "79491d38b9858bcaaf98c05f75ec7ca65c10f20650e00207b36e407831e4b7d1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Dakota_War_of_1862-stereo-right.jpg/170px-Dakota_War_of_1862-stereo-right.jpg",
				"previous": "In 1762 the region became part of Spanish Louisiana until 1802.[35][36] The portion of the state east of the Mississippi River became part of the United States at the end of the American Revolutionary War, when the Second Treaty of Paris was signed. Land west of the Mississippi River was acquired with the Louisiana Purchase, although a portion of the Red River Valley was disputed until the Treaty of 1818.[37] In 1805, Zebulon Pike bargained with Native Americans to acquire land at the confluence of the Minnesota and Mississippi rivers. The construction of Fort Snelling followed between 1819 and 1825.[38] Its soldiers built a grist mill and a sawmill at Saint Anthony Falls, the first of the water-powered industries around which the city of Minneapolis later grew. Meanwhile, squatters, government officials, and tourists had settled near the fort. In 1839, the Army forced them to move downriver and they settled in the area that became St. Paul.[39] Minnesota Territory was formed on March 3, 1849. The first territorial legislature (held September 2, 1849)[40] was dominated by men from New England or of New England ancestry.[41] Thousands of people had come to build farms and cut timber, and Minnesota became the 32nd U.S. state on May 11, 1858. The founding population was so overwhelmingly of New England origins that the state was dubbed \"The New England of the West\".[42][43][44][45]",
				"after": "Treaties between European settlers and the Dakota and Ojibwe gradually forced the natives off their lands and on to smaller reservations. As conditions deteriorated for the Dakota, tensions rose, leading to the Dakota War of 1862.[46] The result of the six-week war was the execution of 38 Dakota — the largest mass execution in United States history — and the exile of most of the rest of the Dakota to the Crow Creek Reservation in Dakota Territory.[37] As many as 800 white settlers died during the war.[47]",
			"color": " "
		}
	}
}
