{
	"add": {
		"doc": {
			"id": "7966f0ef9daa00ab0c4a1eb20519afe59a9ebbef714d50c43b160621cdfdc4c9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/OaklandZooLemurs.jpg/220px-OaklandZooLemurs.jpg",
				"previous": "More than 80 percent of Madagascar's 14,883 plant species are found nowhere else in the world, including five plant families.[24] The family Didiereaceae, composed of four genera and 11 species, is limited to the spiny forests of southwestern Madagascar.[15] Four-fifths of the world's Pachypodium species are endemic to the island.[25] Three-fourths[26] of Madagascar's 860[24] orchid species are found here alone, as are six of the world's eight baobab species.[27] The island is home to around 170 palm species, three times as many as on all of mainland Africa; 165 of them are endemic.[26] Many native plant species are used as herbal remedies for a variety of afflictions. The drugs vinblastine and vincristine, used to treat Hodgkin's disease, leukemia and other cancers, were derived from the Madagascar periwinkle.[28] The traveler's palm, known locally as ravinala[29] and endemic to the eastern rain forests,[30] is highly iconic of Madagascar and is featured in the national emblem as well as the Air Madagascar logo.[31]",
				"after": "Like its flora, Madagascar's fauna is diverse and exhibits a high rate of endemism. Lemurs have been characterized as \"Madagascar's flagship mammal species\" by Conservation International.[20] In the absence of monkeys and other competitors, these primates have adapted to a wide range of habitats and diversified into numerous species. As of 2012, there were officially 103 species and subspecies of lemur,[33] 39 of which were described by zoologists between 2000 and 2008.[34] They are almost all classified as rare, vulnerable, or endangered. At least 17 species of lemur have become extinct since man arrived on Madagascar, all of which were larger than the surviving lemur species.[35] A number of other mammals, including the cat-like fossa, are endemic to Madagascar. Over 300 species of birds have been recorded on the island, of which over 60 percent (including four families and 42 genera) are endemic.[20] The few families and genera of reptile that have reached Madagascar have diversified into more than 260 species, with over 90 percent of these being endemic[36] (including one endemic family).[20] The island is home to two-thirds of the world's chameleon species,[36] including the smallest known,[37] and researchers have proposed that Madagascar may be the origin of all chameleons. Endemic fish of Madagascar include two families, 15 genera and over 100 species, primarily inhabiting the island's freshwater lakes and rivers. Although invertebrates remain poorly studied on Madagascar, researchers have found high rates of endemism among the known species. All 651 species of terrestrial snail are endemic, as are a majority of the island's butterflies, scarab beetles, lacewings, spiders and dragonflies.[20]",
			"color": "dim|0.31057 gray|0.31057 dim|0.31057 grey|0.31057 gray|0.20596 grey|0.20596 dark|0.14754 gray|0.14754 dark|0.14754 grey|0.14754 black|0.099344 silver|0.064938 slate|0.046754 gray|0.046754 light|0.042418 slate|0.042418 gray|0.042418 light|0.032766 gray|0.032766 light|0.032766 grey|0.032766 gainsboro|0.021595 white|0.0034939 smoke|0.0034939  "
		}
	}
}
