{
	"add": {
		"doc": {
			"id": "7967782b366b81263fcb71dd4275519dda07c8fca4f3b6323c05b5d01829d149",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/TannaGroundDove.jpg/220px-TannaGroundDove.jpg",
			"previous": [],
				"after": "These conflicts continued after the journey with the problem of who should write the official account of the travels. Lord Sandwich, although willing to pay the promised money, was irritated with Johann Reinhold Forster's opening chapter and tried to have him edited. However, Forster did not want to have his writing corrected \"like a theme of a School-boy,\" and stubbornly refused any compromise in this direction.[15] As a result, the official account was written by Cook, and the Forsters were deprived of the right to compile the account and did not obtain payment for their work. During the negotiations, the younger Forster decided to release an unofficial account of their travels. In 1777, the book A Voyage round the World in His Britannic Majesty's Sloop Resolution, Commanded by Capt. James Cook, during the Years, 1772, 3, 4, and 5 was published. This report was the first account of Cook's second voyage (it appeared six weeks before the official publication) and was intended for the general public. The English version and his own translation into German (published 1778–1780) earned the young author real fame. The poet Christoph Martin Wieland praised the book as the most important one of his time, and even today it remains one of the most important journey descriptions ever written. The book also had a significant impact on German literature, culture and science. For instance, Alexander von Humboldt was greatly influenced by it[16] and it inspired many ethnologists of later times.",
			"color": "tan|0.36841 burly|0.18803 wood|0.18803 sienna|0.082936 silver|0.037671 dark|0.037572 gray|0.037572 dark|0.037572 grey|0.037572 rosy|0.030971 brown|0.030971 light|0.029252 gray|0.029252 light|0.029252 grey|0.029252 peru|0.029184 gray|0.026057 grey|0.026057  "
		}
	}
}
