{
	"add": {
		"doc": {
			"id": "797e518b68b806579b1302ffa4a6694d1082809089437d6b9448c9d4507e56be",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Cook_Islands_carved_wood_figure%2C_British_Museum.jpg/220px-Cook_Islands_carved_wood_figure%2C_British_Museum.jpg",
			"previous": [],
				"after": "Woodcarving is a common art form in the Cook Islands. The proximity of islands in the southern group helped produce a homogeneous style of carving but which had special developments in each island. Rarotonga is known for its fisherman's gods and staff-gods, Atiu for its wooden seats, Mitiaro, Mauke and Atiu for mace and slab gods and Mangaia for its ceremonial adzes. Most of the original wood carvings were either spirited away by early European collectors or were burned in large numbers by missionaries. Today, carving is no longer the major art form with the same spiritual and cultural emphasis given to it by the Maori in New Zealand. However, there are continual efforts to interest young people in their heritage and some good work is being turned out under the guidance of older carvers. Atiu, in particular, has a strong tradition of crafts both in carving and local fibre arts such as tapa. Mangaia is the source of many fine adzes carved in a distinctive, idiosyncratic style with the so-called double-k design. Mangaia also produces food pounders carved from the heavy calcite found in its extensive limestone caves.",
			"color": "gainsboro|0.1008 light|0.094062 gray|0.094062 light|0.094062 grey|0.094062 white|0.089298 smoke|0.089298 alice|0.076245 blue|0.076245 ghost|0.074361 white|0.074361 snow|0.069371 sea|0.067057 shell|0.067057 white|0.064017 lavender|0.057504 blush|0.057504 azure|0.057449 mint|0.056043 cream|0.056043 floral|0.049521 white|0.049521 silver|0.04742 dim|0.033048 gray|0.033048 dim|0.033048 grey|0.033048 linen|0.018369 gray|0.014917 grey|0.014917 ivory|0.01206 dark|0.0090731 gray|0.0090731 dark|0.0090731 grey|0.0090731 black|0.006225  "
		}
	}
}
