{
	"add": {
		"doc": {
			"id": "79896b6c5d47dd46cf314cf27a64a4d9fd918c267198a3ef6bce08cd1d88a8f8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Tyrannoskull.jpg/220px-Tyrannoskull.jpg",
				"previous": "The neck of Tyrannosaurus rex formed a natural S-shaped curve like that of other theropods, but was short and muscular to support the massive head. The forelimbs had only two clawed fingers,[20] along with an additional small metacarpal representing the remnant of a third digit.[21] In contrast the hind limbs were among the longest in proportion to body size of any theropod. The tail was heavy and long, sometimes containing over forty vertebrae, in order to balance the massive head and torso. To compensate for the immense bulk of the animal, many bones throughout the skeleton were hollow, reducing its weight without significant loss of strength.[20]",
				"after": "The largest known Tyrannosaurus rex skulls measure up to 1.5 metres (5 ft) in length.[22] Large fenestrae (openings) in the skull reduced weight and provided areas for muscle attachment, as in all carnivorous theropods. But in other respects Tyrannosaurus's skull was significantly different from those of large non-tyrannosauroid theropods. It was extremely wide at the rear but had a narrow snout, allowing unusually good binocular vision.[23][24] The skull bones were massive and the nasals and some other bones were fused, preventing movement between them; but many were pneumatized (contained a \"honeycomb\" of tiny air spaces) which may have made the bones more flexible as well as lighter. These and other skull-strengthening features are part of the tyrannosaurid trend towards an increasingly powerful bite, which easily surpassed that of all non-tyrannosaurids.[8][25][26] The tip of the upper jaw was U-shaped (most non-tyrannosauroid carnivores had V-shaped upper jaws), which increased the amount of tissue and bone a tyrannosaur could rip out with one bite, although it also increased the stresses on the front teeth.[27][28]",
			"color": " "
		}
	}
}
