{
	"add": {
		"doc": {
			"id": "7992089e00711a10605a7df95ea42ffd6b51364d2c2d7ddb4ee2e3d1a4e40a60",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Precision_Farming_in_Minnesota_-_Natural_Colour.jpg/220px-Precision_Farming_in_Minnesota_-_Natural_Colour.jpg",
				"previous": "The cereals rice, corn, and wheat provide 60% of human food supply.[64] Between 1700 and 1980, \"the total area of cultivated land worldwide increased 466%\" and yields increased dramatically, particularly because of selectively bred high-yielding varieties, fertilizers, pesticides, irrigation, and machinery.[64] However, concerns have been raised over the sustainability of intensive agriculture. Intensive agriculture has become associated with decreased soil quality in India and Asia, and there has been increased concern over the effects of fertilizers and pesticides on the environment, particularly as population increases and food demand expands. The monocultures typically used in intensive agriculture increase the number of pests, which are controlled through pesticides. Integrated pest management (IPM), which \"has been promoted for decades and has had some notable successes\" has not significantly affected the use of pesticides because policies encourage the use of pesticides and IPM is knowledge-intensive.[64] In the 21st century, plants have been used to grow biofuels, pharmaceuticals (including biopharmaceuticals),[65] and bioplastics.[66]",
				"after": "In the past century agriculture has been characterized by increased productivity, the substitution of synthetic fertilizers and pesticides for labor, water pollution, and farm subsidies. In recent years there has been a backlash against the external environmental effects of conventional agriculture, resulting in the organic and sustainable agriculture movements.[67][68] One of the major forces behind this movement has been the European Union, which first certified organic food in 1991 and began reform of its Common Agricultural Policy (CAP) in 2005 to phase out commodity-linked farm subsidies,[69] also known as decoupling. The growth of organic farming has renewed research in alternative technologies such as integrated pest management and selective breeding. Recent mainstream technological developments include genetically modified food.",
			"color": " "
		}
	}
}
