{
	"add": {
		"doc": {
			"id": "799884819b3940d4363b74095c3679ef5ffb3b485d2f54b871d1ed83c00ef3d7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Mesotriton_alpestris_apuanus04.jpg/220px-Mesotriton_alpestris_apuanus04.jpg",
			"previous": [],
				"after": "At hatching, a typical salamander larva has eyes without lids, teeth in both upper and lower jaws, three pairs of feathery external gills, a somewhat laterally flattened body and a long tail with dorsal and ventral fins. The forelimbs may be partially developed and the hind limbs are rudimentary in pond-living species but may be rather more developed in species that reproduce in moving water. Pond-type larvae often have a pair of balancers, rod-like structures on either side of the head that may prevent the gills from becoming clogged up with sediment. Some members of the genera Ambystoma and Dicamptodon have larvae that never fully develop into the adult form, but this varies with species and with populations. The northwestern salamander (Ambystoma gracile) is one of these and, depending on environmental factors, either remains permanently in the larval state, a condition known as neoteny, or transforms into an adult.[84] Both of these are able to breed.[85] Neoteny occurs when the animal's growth rate is very low and is usually linked to adverse conditions such as low water temperatures that may change the response of the tissues to the hormone thyroxine.[86] Other factors that may inhibit metamorphosis include lack of food, lack of trace elements and competition from conspecifics. The tiger salamander (Ambystoma tigrinum) also sometimes behaves in this way and may grow particularly large in the process. The adult tiger salamander is terrestrial, but the larva is aquatic and able to breed while still in the larval state. When conditions are particularly inhospitable on land, larval breeding may allow continuation of a population that would otherwise die out. There are fifteen species of obligate neotenic salamanders, including species of Necturus, Proteus and Amphiuma, and many examples of facultative ones that adopt this strategy under appropriate environmental circumstances.[87]",
			"color": "slate|0.25489 gray|0.25489 light|0.25045 slate|0.25045 gray|0.25045 tan|0.096269 dark|0.063975 gray|0.063975 dark|0.063975 grey|0.063975 gray|0.054662 grey|0.054662 dim|0.048681 gray|0.048681 dim|0.048681 grey|0.048681 light|0.042746 gray|0.042746 light|0.042746 grey|0.042746 gainsboro|0.036822 burly|0.035603 wood|0.035603 silver|0.035557 wheat|0.012523 antique|0.012334 white|0.012334 linen|0.0070121  "
		}
	}
}
