{
	"add": {
		"doc": {
			"id": "799ebe410075b6a33aa159d2424ce8b1ac31c655bb3f0ff80da8551b97608699",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Les_Tr%C3%A8s_Riches_Heures_du_duc_de_Berry_Janvier.jpg/170px-Les_Tr%C3%A8s_Riches_Heures_du_duc_de_Berry_Janvier.jpg",
				"previous": "As with almost every part of life at the time, a medieval meal was generally a communal affair. The entire household, including servants, would ideally dine together. To sneak off to enjoy private company was considered a haughty and inefficient egotism in a world where people depended very much on each other. In the 13th century, English bishop Robert Grosseteste advised the Countess of Lincoln: \"forbid dinners and suppers out of hall, in secret and in private rooms, for from this arises waste and no honour to the lord and lady.\" He also recommended to watch that the servants not make off with leftovers to make merry at rere-suppers, rather than giving it as alms.[27] Towards the end of the Middle Ages, the wealthy increasingly sought to escape this regime of stern collectivism. When possible, rich hosts retired with their consorts to private chambers where the meal could be enjoyed in greater exclusivity and privacy. Being invited to a lord's chambers was a great privilege and could be used as a way to reward friends and allies and to awe subordinates. It allowed lords to distance themselves further from the household and to enjoy more luxurious treats while serving inferior food to the rest of the household that still dined in the great hall. At major occasions and banquets, however, the host and hostess generally dined in the great hall with the other diners.[29] Although there are descriptions of dining etiquette on special occasions, less is known about the details of day-to-day meals of the elite or about the table manners of the common people and the destitute. However, it can be assumed there were no such extravagant luxuries as multiple courses, luxurious spices or hand-washing in scented water in everyday meals.[30]",
				"after": "Things were different for the wealthy. Before the meal and between courses, shallow basins and linen towels were offered to guests so they could wash their hands, as cleanliness was emphasized. Social codes made it difficult for women to uphold the ideal of immaculate neatness and delicacy while enjoying a meal, so the wife of the host often dined in private with her entourage or ate very little at such feasts. She could then join dinner only after the potentially messy business of eating was done. Overall, fine dining was a predominantly male affair, and it was uncommon for anyone but the most honored of guests to bring his wife or her ladies-in-waiting. The hierarchical nature of society was reinforced by etiquette where the lower ranked were expected to help the higher, the younger to assist the elder, and men to spare women the risk of sullying dress and reputation by having to handle food in an unwomanly fashion. Shared drinking cups were common even at lavish banquets for all but those who sat at the high table, as was the standard etiquette of breaking bread and carving meat for one's fellow diners.[31]",
			"color": "silver|0.10181 dim|0.087557 gray|0.087557 dim|0.087557 grey|0.087557 light|0.082608 gray|0.082608 light|0.082608 grey|0.082608 gray|0.078534 grey|0.078534 dark|0.076418 gray|0.076418 dark|0.076418 grey|0.076418 dark|0.064589 slate|0.064589 blue|0.064589 gainsboro|0.053139 tan|0.049675 midnight|0.04257 blue|0.04257 slate|0.040109 gray|0.040109 light|0.039288 slate|0.039288 gray|0.039288 brown|0.029517 rosy|0.016838 brown|0.016838 firebrick|0.016377 antique|0.015588 white|0.015588 burly|0.013901 wood|0.013901 sienna|0.012866 dark|0.012607 olive|0.012607 green|0.012607 steel|0.012434 blue|0.012434 black|0.011053  "
		}
	}
}
