{
	"add": {
		"doc": {
			"id": "79c3fcdd6cf45a770e7991cecaad0fd355e4b0f8a3076eb91bfa7160d0664912",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Robert_Mills_House.jpg/220px-Robert_Mills_House.jpg",
				"previous": "Reactivated Camp Jackson became Fort Jackson in 1940, giving the military installation the permanence desired by city leaders at the time. The fort was annexed into the city in the fall of 1968, with approval from the Pentagon. In the early 1940s, shortly after the attacks on Pearl Harbor which began America's involvement in World War II, Lt. Colonel Jimmy Doolittle and his group of now-famous pilots began training for the Doolittle Raid over Tokyo at what is now Columbia Metropolitan Airport.[12] They trained in B-25 Mitchell bombers, the same model as the plane that now rests at Columbia's Owens Field in the Curtiss-Wright hangar. [13] The area's population continued to grow during the 1950s, having experienced a 40 percent increase from 186,844 to 260,828, with 97,433 people residing within the city limits of Columbia.",
				"after": "The 1940s saw the beginning of efforts to reverse Jim Crow laws and racial discrimination in Columbia. In 1945, a federal judge ruled that the city's black teachers were entitled to equal pay to that of their white counterparts. However, in years following, the state attempted to strip many blacks of their teaching credentials. Other issues in which the blacks of the city sought equality concerned voting rights and segregation (particularly regarding public schools). On August 21, 1962, eight downtown chain stores served blacks at their lunch counters for the first time. The University of South Carolina admitted its first black students in 1963; around the same time, many vestiges of segregation began to disappear from the city, blacks attained membership on various municipal boards and commissions, and a non-discriminatory hiring policy was adopted by the city. These and other such signs of racial progress helped earn the city the 1964 All-America City Award for the second time (the first being in 1951), and a 1965 article in Newsweek magazine lauded Columbia as a city that had \"liberated itself from the plague of doctrinal apartheid.\"",
			"color": "dark|0.20394 khaki|0.20394 gray|0.1437 grey|0.1437 dark|0.13586 gray|0.13586 dark|0.13586 grey|0.13586 dark|0.12978 olive|0.12978 green|0.12978 dim|0.099734 gray|0.099734 dim|0.099734 grey|0.099734 black|0.087854 silver|0.034517 olive|0.028687 drab|0.028687 slate|0.017996 gray|0.017996 light|0.016839 slate|0.016839 gray|0.016839 tan|0.012608 light|0.01046 gray|0.01046 light|0.01046 grey|0.01046  "
		}
	}
}
