{
	"add": {
		"doc": {
			"id": "79e4ced0ac88efbc33159a20cc2cbaba82a93444dd5ccbc0530d996ed12259fe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Hafling_Horses.jpg/220px-Hafling_Horses.jpg",
				"previous": "Breed organizations exist in many countries to provide accurate documentation of Haflinger pedigrees and ownership, and to promote the Haflinger breed. Most are linked to each other through membership in the World Haflinger Federation (WHF),[59] established in 1976.[60] The WHF establishes international breeding guidelines, objectives and rules for studbook selection and performance tests. They also authorize European and World Shows and compile an annual list of Haflinger experts, or adjudicators. The WHF is the international umbrella organization, with 21 member organizations in 22 countries. Membership organizations include the Haflinger Horse Society of Australia, the Australian Haflinger Horse Breeders Association, the Canadian Haflinger Association, the Haflinger Pferdezuchtverband Tirol (Tyrolean Haflinger Breeding Association), the Italian Associazione Nazionale Allevatori Cavalli di Razza Haflinger Italia and the American Haflinger Registry, as well as a division for breeders in countries that are not already members.[59] National organizations are allowed to become members of the WHF through agreeing to promote pure breeding and maintain the hereditary characteristics of the Haflinger breed. Member organizations must maintain both a purebred studbook and a separate part-bred studbook for animals with Arabian or other bloodlines.[41]",
				"after": "A strict system of inspection, started in Austria, has evolved to ensure that only good quality stock meeting high standards is used for breeding. This is coupled with close maintenance of the studbook to maintain inspection validity. Mares must be inspected and registered with the stud book before they can be covered, and multiple forms are needed to prove covering and birth of a purebred Haflinger foal. Within six months of birth, foals are inspected, and those considered to have potential as breeding stock are given certificates of pedigree and branded. Horses are reinspected at three years old, checked against written association standards, and if they pass, are then entered into the studbook. After their final inspection[6] Haflingers from Austria and Italy are branded with a firebrand in the shape of an edelweiss. Horses from Austria and from South Tyrol have the letter \"H\" in the center of the brand, while horses from all other parts of Italy have the letters \"HI\".[13][15] Horses are graded based on conformation, action, bone, height, temperament and color. Mares must have a fully registered purebred pedigree extending six generations back to be considered for stud book acceptance. Stallions are registered separately. Colts must have a dam with a fully purebred pedigree, and are inspected based on hereditary reliability and likely breeding strength as well as the other qualifications. Each stallion's registration certification must show a fully purebred pedigree extending back four generations, as well as records of mares covered, percentages of pregnancies aborted, still-born and live-born, and numbers and genders of foals born. This information is used to match stallions and mares for breeding. Tyrolean colts undergo an initial assessment, and those not chosen must be either gelded or sold out of the Tyrolean breeding area. The chosen colts are reassessed every six months until a final inspection at the age of three, when the best stallions are chosen for Tyrolean breeding, after which they are purchased by the Austrian Ministry of Agriculture and made available for breeding throughout the region. The others are either gelded or sold out of the region. Other countries base their registration and selection practices on Tyrolean ones, as is required by the WHF.[61]",
			"color": "light|0.23465 steel|0.23465 blue|0.23465 dark|0.20815 gray|0.20815 dark|0.20815 grey|0.20815 dim|0.17487 gray|0.17487 dim|0.17487 grey|0.17487 gray|0.14557 grey|0.14557 black|0.081264 silver|0.075634 slate|0.019314 gray|0.019314 light|0.01769 slate|0.01769 gray|0.01769 light|0.016968 gray|0.016968 light|0.016968 grey|0.016968 steel|0.0089473 blue|0.0089473 gainsboro|0.0062555  "
		}
	}
}
