{
	"add": {
		"doc": {
			"id": "79f26c2b30aef7b6a0fb85443f5bb05b8bd2ca5c8f2732dc46ef86993001d25f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Gaiteiros_em_romaria_galega.jpg/210px-Gaiteiros_em_romaria_galega.jpg",
				"previous": "In 2005, the population of Europe was estimated to be 731 million according to the United Nations,[207] which is slightly more than one-ninth of the world's population. A century ago, Europe had nearly a quarter of the world's population.[208] The population of Europe has grown in the past century, but in other areas of the world (in particular Africa and Asia) the population has grown far more quickly.[207] Among the continents, Europe has a relatively high population density, second only to Asia. The most densely populated country in Europe (and in the world) is Monaco. Pan and Pfeil (2004) count 87 distinct \"peoples of Europe\", of which 33 form the majority population in at least one sovereign state, while the remaining 54 constitute ethnic minorities.[209] According to UN population projection, Europe's population may fall to about 7% of world population by 2050, or 653 million people (medium variant, 556 to 777 million in low and high variants, respectively).[207] Within this context, significant disparities exist between regions in relation to fertility rates. The average number of children per female of child bearing age is 1.52.[210] According to some sources,[211] this rate is higher among Muslims in Europe. The UN predicts a steady population decline in Central and Eastern Europe as a result of emigration and low birth rates.[212]",
				"after": "Europe is home to the highest number of migrants of all global regions at 70.6 million people, the IOM's report said.[213] In 2005, the EU had an overall net gain from immigration of 1.8 million people. This accounted for almost 85% of Europe's total population growth.[214] The European Union plans to open the job centres for legal migrant workers from Africa.[215][216] In 2008, 696,000 persons were given citizenship of an EU27 member state, a decrease from 707,000 the previous year.[217]",
			"color": "black|0.32639 gray|0.12358 grey|0.12358 dark|0.098467 gray|0.098467 dark|0.098467 grey|0.098467 dim|0.085988 gray|0.085988 dim|0.085988 grey|0.085988 lavender|0.055003 light|0.051056 steel|0.051056 blue|0.051056 silver|0.048747 light|0.027564 gray|0.027564 light|0.027564 grey|0.027564 gainsboro|0.021836 light|0.019626 slate|0.019626 gray|0.019626 slate|0.018787 gray|0.018787 rosy|0.018655 brown|0.018655 alice|0.016934 blue|0.016934 dark|0.014721 slate|0.014721 gray|0.014721 ghost|0.014074 white|0.014074 white|0.010305 smoke|0.010305 lavender|0.0070634 blush|0.0070634 snow|0.0067199 white|0.0060926 azure|0.0056478  "
		}
	}
}
