{
	"add": {
		"doc": {
			"id": "79ffe1b9718147ee5b6c88bcd5f20601b011f73737b90c63cfca0a773a75f776",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Millennium_Park_Map_labels.png/400px-Millennium_Park_Map_labels.png",
				"previous": "In February 1999, the city announced it was negotiating with Frank Gehry to design a proscenium arch and orchestra enclosure for a bandshell, as well as a pedestrian bridge crossing Columbus Drive, and that it was seeking donors to cover his work.[16][17] At the time, the Chicago Tribune dubbed Gehry \"the hottest architect in the universe\"[18] in reference to the acclaim for his Guggenheim Museum Bilbao, and they noted the designs would not include Mayor Richard M. Daley's trademarks, such as wrought iron and seasonal flower boxes.[18] Millennium Park project manager Edward Uhlir said \"Frank is just the cutting edge of the next century of architecture,\"[16] and noted that no other architect was being sought.[16] Gehry was approached several times by Skidmore architect Adrian Smith on behalf of the city.[19] His hesitance and refusal to accept the commission was overcome by Cindy Pritzker, the philanthropist, who had developed a relationship with the architect when he won the Pritzker Prize in 1989. According to John H. Bryan, who led fund-raising for the park, Pritzker enticed Gehry in face-to-face discussions, using a $15 million funding commitment toward the bandshell's creation.[20] Having Gehry get involved helped the city realize its vision of having modern themes in the park; upon rumors of his involvement the Chicago Sun-Times proclaimed \"Perhaps the future has arrived\",[16] while the Chicago Tribune noted that \"The most celebrated architect in the world may soon have a chance to bring Chicago into the 21st Century\".[19]",
				"after": "Plans for the park were officially announced in March 1998 and construction began in September of that year. Initial construction was under the auspices of the Chicago Department of Transportation, because the project bridges the railroad tracks. However, as the project grew and expanded, its broad variety of features and amenities outside the scope of the field of transportation placed it under the jurisdiction of the city's Public Buildings Commission.[21]",
			"color": "dark|0.17772 gray|0.17772 dark|0.17772 grey|0.17772 lemon|0.14123 chiffon|0.14123 light|0.13819 golden|0.13819 rod|0.13819 yellow|0.13819 wheat|0.080517 navajo|0.079618 white|0.079618 moccasin|0.077165 peach|0.075843 puff|0.075843 bisque|0.071007 pale|0.045294 golden|0.045294 rod|0.045294 khaki|0.030892 gray|0.015195 grey|0.015195 dark|0.014682 olive|0.014682 green|0.014682 light|0.01108 yellow|0.01108 silver|0.0087205 tan|0.0081355 olive|0.0067384 drab|0.0067384  "
		}
	}
}
