{
	"add": {
		"doc": {
			"id": "7a18422eae78d8e14d38f42fad75dfa568619299e7f4cd23bc0ad7b0b55cc24e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Flagonb.jpg/170px-Flagonb.jpg",
				"previous": "The 13 acres (5 ha) at Soho included common land that Boulton enclosed, later decrying what he saw as the \"idle beggarly\" condition of the people who had used it.[22] By 1765 his Soho Manufactory had been erected. The warehouse, or \"principal building\", had a Palladian front and 19 bays for loading and unloading, and had quarters for clerks and managers on the upper storeys. The structure was designed by local architect William Wyatt at a time when industrial buildings were commonly designed by engineers.[23] Other buildings contained workshops. Boulton and Fothergill invested in the most advanced metalworking equipment, and the complex was admired as a modern industrial marvel.[24] Although the cost of the principal building alone had been estimated at £2,000[24] (about £276,000 today);[25] the final cost was five times that amount.[24] The partnership spent over £20,000 in building and equipping the premises.[26] The partners' means were not equal to the total costs, which were met only by heavy borrowing and by artful management of creditors.[24]",
				"after": "Among the products Boulton sought to make in his new facility were sterling silver plate for those able to afford it, and Sheffield plate, silver-plated copper, for those less well off. Boulton and his father had long made small silver items, but there is no record of large items in either silver or Sheffield plate being made in Birmingham before Boulton did so.[27] To make items such as candlesticks more cheaply than the London competition, the firm made many items out of thin, die-stamped sections, which were shaped and joined together.[27] One impediment to Boulton's work was the lack of an assay office in Birmingham. The silver toys long made by the family firm were generally too light to require assaying, but silver plate had to be sent over 70 miles (110 km) to the nearest assay office, at Chester, to be assayed and hallmarked, with the attendant risks of damage and loss. Alternatively they could be sent to London, but this exposed them to the risk of being copied by competitors.[28] Boulton wrote in 1771, \"I am very desirous of becoming a great silversmith, yet I am determined not to take up that branch in the large way I intended, unless powers can be obtained to have a marking hall [assay office] at Birmingham.\"[29] Boulton petitioned Parliament for the establishment of an assay office in Birmingham. Though the petition was bitterly opposed by London goldsmiths, he was successful in getting Parliament to pass an act establishing assay offices in Birmingham and Sheffield, whose silversmiths had faced similar difficulties in transporting their wares.[30] The silver business proved not to be profitable due to the opportunity cost of keeping a large amount of capital tied up in the inventory of silver.[31] The firm continued to make large quantities of Sheffield plate, but Boulton delegated responsibility for this enterprise to trusted subordinates, involving himself little in it.[32]",
			"color": "gray|0.62623 grey|0.62623 dim|0.25835 gray|0.25835 dim|0.25835 grey|0.25835 dark|0.044821 gray|0.044821 dark|0.044821 grey|0.044821 silver|0.015983 slate|0.01103 gray|0.01103 light|0.0083812 gray|0.0083812 light|0.0083812 grey|0.0083812 light|0.0071412 slate|0.0071412 gray|0.0071412 gainsboro|0.0059838  "
		}
	}
}
