{
	"add": {
		"doc": {
			"id": "7a249ef20d04f8fd6efa3f004991560cc9fe3221b4ea3a363b35ac8043407c9c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/John_Michael_Wright_-_Lord_Mungo_Murray_%28Am_Morair_Mungo_Moireach%29%2C_1668_-_1700._Son_of_1st_Marquess_of_Atholl_-_Google_Art_Project.jpg/220px-John_Michael_Wright_-_Lord_Mungo_Murray_%28Am_Morair_Mungo_Moireach%29%2C_1668_-_1700._Son_of_1st_Marquess_of_Atholl_-_Google_Art_Project.jpg",
			"previous": [],
				"after": "As antipathy towards Catholics intensified in London from the late 1670s, Wright spent more time working away from court. He painted six family portraits for Sir Walter Bagot of Blithfield in Staffordshire in 1676/7.[1] In 1678, he removed to Dublin for a number of years, perhaps due to the anti-Catholic hysteria generated by Titus Oates's Popish Plot. Here, still styling himself \"Pictor Regis\", he painted \"The Ladies Catherine and Charlotte Talbot\", which is today in the National Gallery of Ireland. He also painted two full-lengths portraits of costumed chieftains, the \"Sir Neil O'Neil\" (c. 1680), now in the Tate Collection, and the \"Lord Mungo Murray\" (c.1683), now in the Scottish National Portrait Gallery.[23] Sir Neil O’Neill was a fellow Roman Catholic, also in exile in Dublin. Wright portrayed him in the dress costume of an Irish chieftain, with suit of rare Japanese armour at his feet. The significance of this armour is that it is thought to be a coded symbol of a triumph over the persecutors of Roman Catholicism, of whom, at that time, the Japanese were notorious.[24] The portrait of Mungo Murray (the 5th son of the Royalist Marquis of Atholl) is notable for being considered one of the first instance of Scottish tartan being portrayed in art.[25]",
			"color": "tan|0.37826 burly|0.18326 wood|0.18326 wheat|0.074807 dim|0.066856 gray|0.066856 dim|0.066856 grey|0.066856 gray|0.048364 grey|0.048364 bisque|0.031253 navajo|0.030093 white|0.030093 blanched|0.025458 almond|0.025458 moccasin|0.023403 peach|0.019201 puff|0.019201 papaya|0.015725 whip|0.015725 dark|0.012565 gray|0.012565 dark|0.012565 grey|0.012565 light|0.011735 golden|0.011735 rod|0.011735 yellow|0.011735 corn|0.011592 silk|0.011592  "
		}
	}
}
