{
	"add": {
		"doc": {
			"id": "7a2e7a94754480b433d72f00e948dcdfd9ad2f23f44f964f5929b31867dc0ee9",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/e/ea/UCR_Bio_Sci_Landscaping.jpg/220px-UCR_Bio_Sci_Landscaping.jpg",
				"previous": "After the drop in enrollment and subsequent restructuring of academic programs in the 1970s, little capacity construction was undertaken over the next two decades. However, enrollment growth in the late 1980s justified considerable further campus expansion over the 1990s. Major additions built in the period include: Bourns Hall, completed in 1995; the Humanities & Social Science building, completed in 1996; and the Science Library, completed in 1998. The Pentland and Stonehaven residence halls were completed in 2000, and the Arts building was completed in 2001.[31] Active construction projects include new buildings for Engineering and Materials Science, Psychology Research, and Genomics.[39][40] The first phase of a new Commons was completed in 2007, and phase II is in development. Other ongoing projects include a new CHASS Instructional and Research Center and Students Academic Support Services Building.[41] Since 1999, more than $730 million has been invested in construction projects.[7]",
				"after": "Of the 511 acres (207 ha) of UCR property constituting West Campus, approximately 216 acres (87 ha) along University Avenue have been developed. These include facilities such as University Extension, the United States Department of Agriculture (USDA) Germplasm Repository, International Village (student housing), Human Resources and Highlander Hall. University Village, a mixed use commercial development, features a movie theater, stores, restaurants, office space, and an apartment complex, along with a parking structure and surface parking. Citrus groves and row crops occupy the remaining 295 acres (119 ha) stretching northwest to the intersection of Chicago Avenue and Le Conte Drive. Plans for future expansion include converting a portion of these fields into new UCR infrastructure.[31]",
			"color": "dark|0.27975 gray|0.27975 dark|0.27975 grey|0.27975 tan|0.1463 silver|0.12481 gray|0.092854 grey|0.092854 dim|0.077476 gray|0.077476 dim|0.077476 grey|0.077476 rosy|0.051629 brown|0.051629 dark|0.048314 slate|0.048314 gray|0.048314 light|0.047139 gray|0.047139 light|0.047139 grey|0.047139 black|0.024915 gainsboro|0.023696 light|0.020462 slate|0.020462 gray|0.020462 slate|0.019562 gray|0.019562  "
		}
	}
}
