{
	"add": {
		"doc": {
			"id": "7a31af776c5ef08cb75cbc086d4afdfc3936415e9c45f6a7bb51c3dd7229075b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Volubilis_panorama_cropped.jpg/600px-Volubilis_panorama_cropped.jpg",
				"previous": "Volubilis remained the capital of the region well into the Islamic period. Islamic coins dating to the 8th century have been found on the site, attesting to the arrival of Islam in this part of Morocco. .[10] They are concentrated outside the city walls, which suggests that Arab settlement remained distinct from the Berber settlement inside them. It was here that Moulay Idriss established the Idrisid dynasty of Morocco in 787-8. A direct descendant of the Islamic prophet, Muhammad, he escaped to Morocco from Syria following the Battle of Fakhkh in 787. He was proclaimed \"imam\" in Volubilis, occupied by the Awraba, under Ishaq ibn Mohammad. He married Kanza, from the Awraba, and fathered a son, Idris II, who was proclaimed imam in Volubilis. He, too, lived outside the walls of the city, along the banks of the Wadi Khoumane, where a complex has recently been excavated that may be identified with his headquarters .[15] Idriss I conquered most of Northern Morocco during the three years of his reign, founding the city of Fes. He was assassinated in Volubilis in 791 on the orders of the caliph of Baghdad, Harun al-Rashid.[16][10] On his majority Idriss II removed to Fes which served as his new capital, depriving Volubilis of its last vestiges of political significance.[16]",
				"after": "A Muslim group known as the Rabedis, who had revolted in Córdoba in Al-Andalus (Andalusia in modern Spain), resettled at Volubilis in 818.[10] Although people continued to live in Volubilis for several more centuries, it was probably almost deserted by the 14th century. Leo Africanus describes its walls and gates, as well as the tomb of Idris, guarded only by two or three castles. [17] His body was subsequently removed to Moulay Idriss Zerhoun, 3 km (1.9 mi), where a great mausoleum was built for it. The name of the city was forgotten and it was termed Ksar Faraoun, or the \"Pharaoh's Castle\", by the local people, alluding to a legend that the ancient Egyptians had built it.[18] Nonetheless some of its buildings remained standing, albeit ruined, until as late as the 17th century when Moulay Ismail ransacked the site to provide building material for his new imperial capital at Meknes. The 1755 Lisbon earthquake caused further severe destruction. However, fortunately for posterity, English antiquarian John Windus sketched the site in 1722.[16] In his 1725 book A Journey to Mequinez, Windus described the scene:",
			"color": "light|0.23414 steel|0.23414 blue|0.23414 tan|0.12717 gray|0.1232 grey|0.1232 dim|0.10012 gray|0.10012 dim|0.10012 grey|0.10012 dark|0.074493 gray|0.074493 dark|0.074493 grey|0.074493 burly|0.056145 wood|0.056145 silver|0.038312 light|0.034919 slate|0.034919 gray|0.034919 slate|0.034381 gray|0.034381 light|0.030741 gray|0.030741 light|0.030741 grey|0.030741 light|0.020964 blue|0.020964 gainsboro|0.018128 black|0.014925 peach|0.01453 puff|0.01453 navajo|0.01302 white|0.01302 wheat|0.012885 rosy|0.010552 brown|0.010552 pale|0.0090478 golden|0.0090478 rod|0.0090478 moccasin|0.0088464  "
		}
	}
}
