{
	"add": {
		"doc": {
			"id": "7a462c55e3e8a931b57c30e5f54681cd06d89aeeee91c4f6dba14616e6832311",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Karachi_ali_2010008_lrg.jpg/500px-Karachi_ali_2010008_lrg.jpg",
			"previous": [],
				"after": "City geographic coordinates are 24°51′ N 67°02′ E. Most of the land consisted largely of flat or rolling plains, with hills on the western and Manora Island and the Oyster Rocks. The Arabian Sea beach lines the southern coastline of Karachi. Mangroves and creeks of the Indus delta can be found toward the southeast side of the city. Toward the west and the north is Cape Monze, locally known as Ras Muari, an area marked by projecting sea cliffs and rocky sandstone promontories. Some excellent beaches can be found in this area. Khasa Hills and Mulri Hills lie in the northwest and form the border between North Nazimabad Town[39] and Orangi Town. The Manghopir Hills lies northwest of Karachi, between Hub River and Manghopir. The hills in Karachi are the off-shoots of the Kirthar Range. The highest point of these hills in Karachi is about 528m in the extreme north. All these hills are devoid of vegetation and have wide intervening plains, dry river beds and water channels.[40] The rivers in Karachi are Malir River and Lyari River. The Indus River flood plain is near Karachi. The city is located on the Arabian Sea coastline. It is known as the Uroos ul Bilaad \"The Bride of the Cities\" and the \"City of Lights\",[19][20] for its liveliness,[citation needed] and the \"City of the Quaid\", having been the birth and burial place of Quaid-e-Azam, the Great Leader, Muhammad Ali Jinnah, the founder of Pakistan, who made the city his home after Pakistan's independence from the British Raj on 14 August 1947.",
			"color": "dark|0.45078 slate|0.45078 gray|0.45078 gray|0.22139 grey|0.22139 dim|0.20627 gray|0.20627 dim|0.20627 grey|0.20627 dark|0.038386 gray|0.038386 dark|0.038386 grey|0.038386 slate|0.033039 gray|0.033039 light|0.015289 slate|0.015289 gray|0.015289 silver|0.010081  "
		}
	}
}
