{
	"add": {
		"doc": {
			"id": "7a53039fbf40f4cce437a7ae0daa7cb2dcf355bbed5be2fb87ff59b021a0f221",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Noisy_miner_chick_and_egg.jpg/220px-Noisy_miner_chick_and_egg.jpg",
				"previous": "The noisy miner breeds all year long, with most activity from July through November, though the peak period is subject to seasonal variations with sharp peaks in laying activity when conditions are particularly favourable for raising young. The nest is built in prickly or leafy trees, and the noisy miner is often recorded nesting in eucalypts, and also in wattles, Araucaria, Banksia, Bursaria, Hibiscus, mistletoe, Melaleuca, Pittosporum, Schinus and jacaranda. It seems to prefer moderately dense foliage for nesting, often near the end of drooping horizontal branches. Support for the nest may be the primary criterion of a suitable nest site, rather than characteristics of the vegetation or location.[54] The female alone builds the nest, which is deep and cup-shaped, woven of twigs and grasses with other plant material, animal hair and spider webs. Occasionally the nest will include man-made materials such as twine, scraps of material, and tissue paper. It is lined with wool, hair, feathers, flowers or plant down, and padded with a circular mat woven from fibres pulled from the cocoons of the processional caterpillar.[23] The female noisy miner walks around on the ground close to the nest site, picking up material.[54] She gathers material from disused nests of other birds, or dismantles its most recent nest to build a new one. The female completes the nest in five or six days.[54] On average nests have an external diameter of 15–17.8 centimetres (5.9–7.0 in) and an external depth of 9–11.4 centimetres (3.5–4.5 in). The internal depth of the nest is around 5.5 centimetres (2.2 in).[23]",
				"after": "Eggs vary greatly in size, shape and markings, but are generally elongated ovals; white to cream or pinkish or buff coloured; freckled, spotted or blotched with reddish brown to chestnut or a purplish red, sometimes with underlying markings of violet or purplish grey.[55] The clutch consists of two to four eggs. Incubation is by the female only, and the incubation period is around sixteen days. Hatching is asynchronous, with up to six days being recorded between the hatching of the first and last chicks in a clutch.[56] Young are naked at hatching, and develop a cover of down within two to three days. The fledging period is around sixteen days, and young begin to find food for themselves between twenty-six and thirty days after fledging, but are still regularly fed by adults to thirty-five days.[56] The young leave the nest before they are fully fledged, and only able to fly downwards, and scramble up. They do not go far from the nest, return to it at night, and take some weeks to completely leave the nest. Many fledglings are found on the ground and in low shrubs during this period, where they continue to be cared for until they can make their way up into the trees. These birds are often mistakenly \"rescued\". The fledglings seek out siblings if separated, and huddle together for up to three weeks after fledging.[57]",
			"color": "misty|0.12191 rose|0.12191 silver|0.076029 light|0.074018 gray|0.074018 light|0.074018 grey|0.074018 dark|0.072968 gray|0.072968 dark|0.072968 grey|0.072968 linen|0.06545 gainsboro|0.059602 antique|0.059146 white|0.059146 sea|0.048011 shell|0.048011 gray|0.047487 grey|0.047487 rosy|0.043005 brown|0.043005 old|0.037679 lace|0.037679 lavender|0.035045 blush|0.035045 floral|0.033463 white|0.033463 dim|0.033291 gray|0.033291 dim|0.033291 grey|0.033291 white|0.030006 smoke|0.030006 snow|0.027226 peach|0.01915 puff|0.01915 white|0.01619 papaya|0.014831 whip|0.014831 ghost|0.012157 white|0.012157 ivory|0.012069 mint|0.0086679 cream|0.0086679 bisque|0.0083492 blanched|0.0083471 almond|0.0083471 tan|0.0081001 alice|0.0044429 blue|0.0044429 beige|0.0043802  "
		}
	}
}
