{
	"add": {
		"doc": {
			"id": "7a5f0934227e8e5d12b610bc298171403a2aa8012ff8930462ceddec401d6c11",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e4/PabloPicasso_Meninas.jpg/250px-PabloPicasso_Meninas.jpg",
				"previous": "The art world developed a new appreciation for Velázquez's less Italianate paintings after 1819, when Ferdinand VII opened the royal collection to the public.[74] In 1879 John Singer Sargent painted a small-scale copy of Las Meninas, and in 1882 painted a homage to the painting in his The Daughters of Edward Darley Boit, while the Irish artist Sir John Lavery chose Velázquez's masterpiece as the basis for his portrait The Royal Family at Buckingham Palace, 1913. George V visited Lavery's studio during the execution of the painting, and, perhaps remembering the legend that Philip IV had daubed the cross of the Knights of Santiago on the figure of Velázquez, asked Lavery if he could contribute to the portrait with his own hand. According to Lavery, \"Thinking that royal blue might be an appropriate colour, I mixed it on the palette, and taking a brush he [George V] applied it to the Garter ribbon.\"[74]",
				"after": "Between August and December 1957, Pablo Picasso painted a series of 58 interpretations of Las Meninas, and figures from it, which currently fill the Las Meninas room of the Museu Picasso in Barcelona, Spain. Picasso did not vary the characters within the series, but largely retained the naturalness of the scene; according to the museum, his works constitute an \"exhaustive study of form, rhythm, colour and movement\".[76] A print of 1973 by Richard Hamilton called Picasso's Meninas draws on both Velázquez and Picasso.[77] Photographer Joel-Peter Witkin was commissioned by the Spanish Ministry of Culture to create a work titled Las Meninas, New Mexico (1987) which references Velázquez's painting as well as other works by Spanish artists.[78]",
			"color": "black|0.21953 light|0.075677 gray|0.075677 light|0.075677 grey|0.075677 dark|0.072618 gray|0.072618 dark|0.072618 grey|0.072618 gray|0.06857 grey|0.06857 silver|0.067213 gainsboro|0.063688 dim|0.053464 gray|0.053464 dim|0.053464 grey|0.053464 linen|0.035317 misty|0.032781 rose|0.032781 white|0.029411 smoke|0.029411 sea|0.029328 shell|0.029328 lavender|0.025495 blush|0.025495 antique|0.023907 white|0.023907 snow|0.021597 floral|0.020346 white|0.020346 old|0.017627 lace|0.017627 ghost|0.016526 white|0.016526 white|0.014741 alice|0.012001 blue|0.012001 lavender|0.01191 mint|0.010799 cream|0.010799 dark|0.0099391 slate|0.0099391 gray|0.0099391 ivory|0.0088282 light|0.0079617 steel|0.0079617 blue|0.0079617 beige|0.0064591 slate|0.0056425 gray|0.0056425 papaya|0.0052103 whip|0.0052103 light|0.0049799 slate|0.0049799 gray|0.0049799  "
		}
	}
}
