{
	"add": {
		"doc": {
			"id": "7a8c998483ea5896f23b735ba656519a8a7c01dcce96b971cb96f716e1bb65a3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Detroit_Photographic_Company_%280645%29.jpg/92px-Detroit_Photographic_Company_%280645%29.jpg",
				"previous": "Portal:Technology/Selected articles/57",
				"after": "The early skyscrapers were a range of tall, commercial buildings built between 1884 and 1939, predominantly in the American cities of New York and Chicago. Cities in the United States were traditionally made up of low-rise buildings, but significant economic growth after the Civil War and increasingly intensive use of urban land encouraged the development of taller buildings beginning in the 1870s. Technological improvements enabled the construction of fireproofed iron-framed structures with deep foundations, equipped with new inventions such as the elevator and electric lighting. These made it both technically and commercially viable to build a new class of taller buildings, the first of which, Chicago's 138-foot (42 m) tall Home Insurance Building, opened in 1884. Their numbers grew rapidly and by 1888 they were being labelled skyscrapers. Chicago initially led the way in skyscraper design, with many constructed in the center of the financial district during the late 1880s and early 1890s. Sometimes termed the products of the Chicago school of architecture, these skyscrapers attempted to balance aesthetic concerns with practical commercial design, producing large, square palazzo-styled buildings hosting shops and restaurants on the ground level and containing rentable offices on the upper floors. In contrast, New York's skyscrapers were frequently narrower towers which, more eclectic in style, were often criticised for their lack of elegance. In 1892, Chicago banned the construction of new skyscrapers taller than 150 feet (46 m), leaving the development of taller buildings to New York. The first decade of the 20th century saw a new wave of skyscraper construction. The demand for new office space to hold America's expanding workforce of white-collar staff continued to grow. Engineering developments made it easier to build and live in yet taller buildings. Chicago built new skyscrapers in its existing style, while New York experimented further with tower design. Iconic buildings such as the Flatiron were followed by the 612-foot (187 m) tall Singer Tower, the 700-foot (210 m) Metropolitan Life Insurance Company Tower and the 792-foot (241 m) Woolworth Building. Though these skyscrapers were commercial successes, criticism mounted as they broke up the ordered city skyline and plunged neighboring streets and buildings into perpetual shadow. Combined with an economic downturn, this led to the introduction of zoning restraints in New York in 1916.",
			"color": "dim|0.27695 gray|0.27695 dim|0.27695 grey|0.27695 gray|0.20389 grey|0.20389 dark|0.17114 gray|0.17114 dark|0.17114 grey|0.17114 silver|0.086106 black|0.074103 light|0.051722 gray|0.051722 light|0.051722 grey|0.051722 gainsboro|0.034693 antique|0.017994 white|0.017994 misty|0.017074 rose|0.017074 linen|0.014137 tan|0.013683  "
		}
	}
}
