{
	"add": {
		"doc": {
			"id": "7a94924494f4e6fff39aef8ae7fb94688a09a8ab1a9297475cc5ef42ced8eacf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/USS_North_Dakota_firing_a_broadside.jpg/220px-USS_North_Dakota_firing_a_broadside.jpg",
				"previous": "After her commissioning, North Dakota was assigned to the Atlantic Fleet; she participated in the normal peacetime routine of training cruises, fleet maneuvers, and gunnery drills in the Atlantic and in the Caribbean Sea. On 2 November 1910, she crossed the Atlantic for the first time, on a good-will visit to Britain and France. Fleet maneuvers followed in the Caribbean the next spring. Midshipmen training cruises for cadets from the Naval Academy occupied North Dakota‍ '​s time in the summers of 1912 and 1913. On 1 January 1913, she joined the honor escort for the British armored cruiser HMS Natal, which was carrying the remains of Whitelaw Reid, the United States Ambassador to Great Britain.[4]",
				"after": "The United States remained neutral when war in Europe broke out in August 1914; in the Americas, political disturbances in Mexico during that country's revolution kept the US Navy occupied that year. North Dakota steamed off Veracruz, where she arrived on 26 April 1914, five days after American sailors had occupied the city. She cruised the coast of Mexico to protect Americans in the country until October, when she returned to Norfolk, Virginia, arriving on 16 October. As war loomed, the Atlantic Fleet began intensive training to prepare for a possible American entrance into the conflict. North Dakota was conducting gunnery training in Chesapeake Bay when the United States declared war on Germany on 6 April 1917. Unlike her sister Delaware, North Dakota remained in American waters for the duration of the war, and did not see action. She was based out of York River, Virginia and New York City, and was tasked with training gunners and engine room personnel for the rapidly expanding wartime fleet.[4][5][6] Admiral Hugh Rodman requested that North Dakota remain behind because he did not trust the reliability of her engines.[7] In 1917, her engines were replaced with new geared turbines,[8] and new fire control equipment was installed.[9]",
			"color": " "
		}
	}
}
