{
	"add": {
		"doc": {
			"id": "7a9acd7ae3b2e5951ed054e8cef9ac43e5e3f9cca12b1bdfc87246067d8584c0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Petrus_christus%2C_nativit%C3%A0_di_washington_03.jpg/220px-Petrus_christus%2C_nativit%C3%A0_di_washington_03.jpg",
				"previous": "Animals are visible in stalls. Behind them is a crumbling wall with three low Romanesque windows.[12] Four shepherds in contemporary 15th-century clothing are chatting amiably, leaning against the wall, looking into the shed.[11] Two are positioned to the left and two to the right; in each pair one is dressed in red and an other in blue.[13] Behind the shed is a small hill where two shepherds herd sheep along a pathway,[14] and beyond is a Netherlandish town with two domed structures in its center, symbolizing Jerusalem and Christ's Passion.[2] The large domed building is based on the Holy Sepulcher in Jerusalem,[11] a replica of which the Adornes family built in Bruges in 1427, called the Jerusalem chapel.[15] A flock of geese is visible high in the sky through the roof's trusses.[16]",
				"after": "Light shines into the shed from outside through the low windows. The shadows cast suggest the dawn of a new day.[17] The four onlookers in the rear are in light and shadow, especially noticeable on the face of the man second from the right. Here Christus borrows an optical device from the work of his predecessors Jan van Eyck and Rogier van der Weyden,[18] but is bolder and more accomplished with his use of light,[19] which art professor Lola Gellman describes as having \"no counterpoint in previous art.\"[18]",
			"color": "tan|0.51038 silver|0.074787 antique|0.054064 white|0.054064 light|0.048009 gray|0.048009 light|0.048009 grey|0.048009 misty|0.038029 rose|0.038029 burly|0.03437 wood|0.03437 gainsboro|0.033846 linen|0.030605 sienna|0.020229 peach|0.017215 puff|0.017215 sea|0.016024 shell|0.016024 bisque|0.015296 old|0.014662 lace|0.014662 papaya|0.013734 whip|0.013734 blanched|0.011554 almond|0.011554 lavender|0.0096572 blush|0.0096572 dark|0.0077294 gray|0.0077294 dark|0.0077294 grey|0.0077294 white|0.0070603 smoke|0.0070603 floral|0.006524 white|0.006524  "
		}
	}
}
