{
	"add": {
		"doc": {
			"id": "7a9b305ed73b6539962a84305ef4ef3391c7b4ae6df1c3db5fc04c579b20ed9b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/The_associated_press_building_in_new_york_city.jpg/220px-The_associated_press_building_in_new_york_city.jpg",
			"previous": [],
				"after": "Associated Press is a not-for-profit news cooperative formed in the spring of 1846 by five daily newspapers in New York City to share the cost of transmitting news of the Mexican–American War by boat, horse express and telegraph. The venture was organized by Moses Yale Beach (1800–68), second publisher of the New York Sun, and agreed to by the Herald, the Courier, and Enquirer, The Journal of Commerce, and the Express. Some historians[who?] believe that the Tribune joined at this time; documents show it was a member in 1849. The New York Times became a member shortly after its founding in September 1851. Initially known as the New York Associated Press (NYAP), the organization faced competition from the Western Associated Press (1862), which criticized its monopolistic news gathering and price setting practices. An investigation completed in 1892 by Victor Lawson, editor and publisher of the Chicago Daily News, revealed that several principals of the NYAP had entered into a secret agreement with United Press, a rival organization, to share NYAP news and the profits of reselling it. The revelations led to the demise of the NYAP and in December 1892, the Western Associated Press was incorporated in Illinois as the Associated Press. A 1900 Illinois Supreme Court decision (Inter Ocean Publishing Co. v. Associated Press)—that the AP was a public utility and operating in restraint of trade—resulted in AP's move from Chicago to New York City, where corporation laws were more favorable to cooperatives.[citation needed]",
			"color": "black|0.91418 dim|0.036671 gray|0.036671 dim|0.036671 grey|0.036671 gray|0.025537 grey|0.025537 dark|0.0098635 gray|0.0098635 dark|0.0098635 grey|0.0098635 silver|0.0040254  "
		}
	}
}
