{
	"add": {
		"doc": {
			"id": "7aa4ce1103f12e782dd4e19cc6e9cad228d083ada62c2b99dae7ef0573120294",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/1955-Franklin-Half-Dollar-Bugs-Bunny-Variety-Close-Up.jpg/220px-1955-Franklin-Half-Dollar-Bugs-Bunny-Variety-Close-Up.jpg",
				"previous": "The Franklin half dollar was struck in relatively small numbers in its first years,[9] as there was limited demand due to a glut of Walking Liberty halves. No half dollars were struck at Denver in 1955 and 1956 due to a lack of demand for additional pieces.[20] The San Francisco Mint closed in 1955; it did not reopen until 1965.[21] In 1957, with improved economic conditions, demand for the pieces began to rise.[20] They were struck in much greater numbers beginning in 1962, which saw the start of the greatly increased demand for coins which would culminate in the great coin shortage of 1964.[9] No Franklin half dollar is rare today, as even low-mintage dates were widely saved. Proof coins were struck at the Philadelphia Mint from 1950. \"Cameo proofs\", with frosted surfaces and mirror-like fields, were struck in small numbers and carry a premium. Just under 498 million Franklin half dollars, including proofs, were struck.[10]",
				"after": "There are only 35 different dates and mintmarks in the series, making it a relatively inexpensive collecting project.[20] A widely known variety is the 1955 \"Bugs Bunny\" half. This variety was caused by a die clash between an obverse die and a reverse die. The impact of the eagle's wings on the other die caused a marking outside of Franklin's mouth which according to some resembles buck teeth.[22] The quality of half dollars struck by the Mint decreased in the late 1950s, caused by deterioration of the master die from which working dies were made for coinage.[23]",
			"color": "dark|0.36809 gray|0.36809 dark|0.36809 grey|0.36809 gray|0.27166 grey|0.27166 dim|0.13708 gray|0.13708 dim|0.13708 grey|0.13708 silver|0.11416 light|0.029332 gray|0.029332 light|0.029332 grey|0.029332 red|0.026844 gainsboro|0.014808  "
		}
	}
}
