{
	"add": {
		"doc": {
			"id": "7acc8592202c20f108fc0413224178cba89d07b1e841e1d2244b0866941c422c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Map_General_American.svg/220px-Map_General_American.svg.png",
				"previous": "It is commonly believed that General American English evolved as a result of an aggregation of rural and suburban Midwestern dialects, though the English of the Upper Midwest can deviate quite dramatically from the sounds of General American, especially since that region's twentieth-century Northern Cities Vowel Shift (NCVS). The local accent often gets more distinct the farther north one goes within the Midwest, with the Northern Midwest featuring its own dialect North Central American English. General American is also highly divergent from the accents typical of larger Midwestern cities and the Great Lakes region in general, such as Chicago and Minneapolis, where speech has undergone the NCVS. The fact that a rural Midwestern dialect became the basis of what is General American English is often attributed to the mass migration of Midwestern farmers to California and the Pacific Northwest from where it spread. However, General American has origins dating back even before conservative Midwestern speech, itself stemming from interior Pennsylvania and upstate New York.[1]",
				"after": "The Telsur Project[16] (of William Labov and others) examines a number of phonetic properties by which regional accents of the U.S. may be identified. The area with Midwestern regional properties is indicated on the map: eastern Nebraska (including Omaha and Lincoln); northwestern, southern, and central Iowa (including Des Moines, Sioux City and the Iowa-side Quad Cities), with an adjacent narrow strip of northern Missouri; and western and central Illinois (including Peoria, the Illinois-side Quad Cities, and Bloomington-Normal). Notably, this section of Illinois does not include the Chicago area.",
			"color": "lavender|0.12263 alice|0.11155 blue|0.11155 antique|0.077434 white|0.077434 papaya|0.073954 whip|0.073954 linen|0.073601 old|0.071302 lace|0.071302 blanched|0.070344 almond|0.070344 sea|0.067237 shell|0.067237 beige|0.066298 floral|0.064997 white|0.064997 corn|0.064924 silk|0.064924 ivory|0.061818 dark|0.0098332 gray|0.0098332 dark|0.0098332 grey|0.0098332 misty|0.0076782 rose|0.0076782 light|0.0071632 blue|0.0071632 light|0.0068504 steel|0.0068504 blue|0.0068504 gray|0.0068156 grey|0.0068156 bisque|0.0060438 silver|0.0047819 gainsboro|0.0040275 light|0.0039489 gray|0.0039489 light|0.0039489 grey|0.0039489 snow|0.0031655  "
		}
	}
}
