{
	"add": {
		"doc": {
			"id": "7ad3b0c709e4b1053ec6c9d6d6c1c6eeb2b2dee0de043d5e4fc14c7cb29b3146",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Typhoon_Rusa_27_aug_2002_0350Z.jpg/220px-Typhoon_Rusa_27_aug_2002_0350Z.jpg",
				"previous": "Before Rusa affected South Korea, the Korea Meteorological Administration (KMA) issued high sea warnings on August 29.[13] Airports were closed in the southern portion of the country,[14] and dams let out water to prevent excessive flooding.[15] Typhoon Rusa affected much of South Korea with heavy rainfall and high winds.[4] Jeju Island off the country's southern coast reported 660 mm (26 in) of rainfall, producing flash flooding that flooded cars. On the island, high winds downed trees and left 60,000 people without power. All lower and middle schools on the island were closed, and residents were stranded after officials halted ferry and airline service.[14] On the South Korean mainland, winds reached as high as 180 km/h (110 mph). High amounts of rainfall were reported on Jeju Province and along the country's southern coast, although the heaviest rainfall was only reported in a small region. In Gangneung, located in the eastern portion of the country, severe thunderstorms developed due to high instability resulting from humid air from the east interacting with the Taebaek Mountains, producing high amounts of precipitation. The city reported the highest rainfall total in the country with 897.5 mm (35.33 in), of which 880 mm (35 in) was observed in one day. The total represented 62% of Gangneung's average yearly rainfall, and became the highest daily rainfall in the country's history, exceeding the previous record set in 1981 by 300 mm (12 in). In the South Korea interior, rainfall rates were considered a 1 in 200 year event.[4]",
				"after": "Damage in South Korea was estimated at $4.2 billion (₩5.15 trillion KRW).[6] Damage was heaviest in Gangneung,[4] where about 36,000 homes and 622 military buildings were flooded. At the airbase in Gangneung, floods submerged 16 jet fighters.[3] Along the coast, high winds damaged 640 boats and about 200,000 marine buildings, and 265 industrial buildings were also damaged.[6] The heavy rainfall left mudslides in the country, one of which covered ten cars in Gangneung.[16] Flooding and the landslides disrupted the country's infrastructure;[6] the storm destroyed 274 bridges and damaged roads and rails at 164 locations.[17] Rusa killed 300,000 livestock and flooded 85,000 hectares (210,000 acres) of crop fields,[17][18] representing 6% of the country's agricultural lands, mostly affecting fruit and vegetables.[6] The storm caused the Vana H Cup KBC Augusta golf tournament to end early,[19] and a stadium to be used for the 2002 Asian Games was damaged.[20] Across the country, 88,625 people were forced to evacuate due to the typhoon,[3] and 17,046 houses were damaged.[21] High winds left 1.25 million people after blowing down 24,000 power lines.[17][18] There were 213 deaths in the country, and another 33 were missing and presumed dead;[6] This made Rusa the deadliest typhoon in the country in more than 43 years.[22]",
			"color": "dark|0.19739 gray|0.19739 dark|0.19739 grey|0.19739 dim|0.1768 gray|0.1768 dim|0.1768 grey|0.1768 gray|0.13956 grey|0.13956 silver|0.10622 light|0.0714 gray|0.0714 light|0.0714 grey|0.0714 slate|0.063299 gray|0.063299 gainsboro|0.056729 light|0.045168 slate|0.045168 gray|0.045168 white|0.02078 smoke|0.02078 linen|0.019594 sea|0.015776 shell|0.015776 snow|0.01325 floral|0.012469 white|0.012469 ghost|0.011648 white|0.011648 mint|0.0090922 cream|0.0090922 old|0.0090578 lace|0.0090578 white|0.0088356 lavender|0.0059775 blush|0.0059775 black|0.0055478 alice|0.0046328 blue|0.0046328  "
		}
	}
}
