{
	"add": {
		"doc": {
			"id": "7ae8a3c92e70d2148c55511636c4a6f0b4129246d5726c2c86cc56b9ef2f9544",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Bhutanese_people.jpg/220px-Bhutanese_people.jpg",
			"previous": [],
				"after": "Bhutanese people primarily consist of the Ngalops and Sharchops, called the Western Bhutanese and Eastern Bhutanese respectively. The Lhotshampa, meaning \"southerners\", are a heterogeneous group of mostly Nepali descent. It was claimed they constituted 45% of the population in 1988 census,[94] and include migrants from as early as the 1890s to as recent as the 1980s, who have fought a bitter war with Bhutan over rights to abode, language, and dress. Consequently there has been mass emigration from Bhutan (both forced and voluntary) resulting in hundreds of thousands of people left stateless in refugee camps. The Ngalops primarily consist of Bhutanese living in the western part of the country. Their culture is closely related to that of Tibet. Much the same could be said of the Sharchops the dominant group, who traditionally follow the Nyingmapa rather than the official Drukpa Kagyu form of Tibetan Buddhism. In modern times, with improved transportation infrastructure, there has been much intermarriage between these groups. In the early 1970s, intermarriage between the Lhotshampas and mainstream Bhutanese society was encouraged by the government, but after the late 1980s, the Bhutanese government forced about 108,000 Lhotshampas from their homes, seized their land, and expelled them to refugee camps.[57]",
			"color": "black|0.34795 rosy|0.066012 brown|0.066012 dim|0.065937 gray|0.065937 dim|0.065937 grey|0.065937 gray|0.040495 grey|0.040495 dark|0.035846 gray|0.035846 dark|0.035846 grey|0.035846 dark|0.034889 slate|0.034889 gray|0.034889 silver|0.026223 slate|0.0203 gray|0.0203 light|0.02015 gray|0.02015 light|0.02015 grey|0.02015 thistle|0.019956 light|0.017019 slate|0.017019 gray|0.017019 gainsboro|0.01602 pale|0.01592 violet|0.01592 red|0.01592 lavender|0.01501 misty|0.011389 rose|0.011389 dark|0.010897 slate|0.010897 blue|0.010897 alice|0.010897 blue|0.010897 light|0.010602 steel|0.010602 blue|0.010602 lavender|0.0095196 blush|0.0095196 white|0.009491 smoke|0.009491 ghost|0.0094496 white|0.0094496  "
		}
	}
}
