{
	"add": {
		"doc": {
			"id": "7af380a08937ca3664f4edd77704a38a3b3580590cf9ea1419f2c6acdd899e92",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Samson_slaying_a_philistine.jpg/200px-Samson_slaying_a_philistine.jpg",
				"previous": "The collection of Italian, Medieval, Renaissance, Baroque and Neoclassical sculpture (both original and in cast form) is unequalled outside of Italy. It includes Canova's The Three Graces, which the museum jointly owns with National Galleries of Scotland. Italian sculptors whose work is held by the museum include: Bartolomeo Bon, Bartolomeo Bellano, Luca della Robbia, Giovanni Pisano, Donatello, Agostino di Duccio, Andrea Riccio, Antonio Rossellino, Andrea del Verrocchio, Antonio Lombardo, Pier Jacopo Alari Bonacolsi, Andrea della Robbia, Michelozzo di Bartolomeo, Michelangelo (represented by a freehand wax model and casts of his most famous sculptures), Jacopo Sansovino, Alessandro Algardi, Antonio Calcagni, Benvenuto Cellini (Medusa's head dated c. 1547), Agostino Busti, Bartolomeo Ammannati, Giacomo della Porta, Giambologna (Samson Slaying a Philistine (Giambologna) c. 1562, his finest work outside Italy), Bernini (Neptune and Triton c. 1622–3), Giovanni Battista Foggini, Vincenzo Foggini (Samson and the Philistines), Massimiliano Soldani Benzi, Antonio Corradini, Andrea Brustolon, Giovanni Battista Piranesi, Innocenzo Spinazzi, Canova, Carlo Marochetti and Raffaelle Monti. An unusual sculpture is the ancient Roman statue of Narcissus restored by Valerio Cioli c1564 with plaster. There are several small scale bronzes by Donatello, Alessandro Vittoria, Tiziano Aspetti and Francesco Fanelli in the collection. The largest item from Italy is the Chancel Chapel from Santa Chiara Florence dated 1493–1500, designed by Giuliano da Sangallo it is 11.1 metres in height by 5.4 metres square, it includes a grand sculpted tabernacle by Antonio Rossellino and coloured terracotta decoration.[139]",
				"after": "Rodin is represented by more than 20 works in the museum collection, making it one of the largest collections of the sculptor's work outside France; these were given to the museum by the sculptor in 1914, as acknowledgement of Britain's support of France in World War I,[140] although the statue of St John the Baptist had been purchased in 1902 by public subscription. Other French sculptors with work in the collection are Hubert Le Sueur, François Girardon, Michel Clodion, Jean-Antoine Houdon, Jean-Baptiste Carpeaux and Jules Dalou.",
			"color": "black|0.27484 gray|0.084835 grey|0.084835 dim|0.083187 gray|0.083187 dim|0.083187 grey|0.083187 dark|0.082629 gray|0.082629 dark|0.082629 grey|0.082629 silver|0.052959 antique|0.041698 white|0.041698 light|0.032328 gray|0.032328 light|0.032328 grey|0.032328 linen|0.028576 old|0.027064 lace|0.027064 beige|0.023807 floral|0.023022 white|0.023022 sea|0.021299 shell|0.021299 ivory|0.021238 gainsboro|0.020704 papaya|0.020312 whip|0.020312 tan|0.017467 corn|0.01636 silk|0.01636 white|0.014291 smoke|0.014291 mint|0.013467 cream|0.013467 blanched|0.01318 almond|0.01318 snow|0.012436 white|0.011276 honeydew|0.010218 wheat|0.0096636 light|0.0088788 yellow|0.0088788 bisque|0.0065078 light|0.0057846 golden|0.0057846 rod|0.0057846 yellow|0.0057846  "
		}
	}
}
