{
	"add": {
		"doc": {
			"id": "7b11e03e413b86af1731fac20b17a73f8c9546e856022d331e7d268df636e6c0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/May_Yohe_4.jpg/220px-May_Yohe_4.jpg",
				"previous": "The song remained popular in the Chicago area for several years.[15] Later in 1887, with McCaull at the Chicago Opera House, she sang \"Bid Me Good-By and Go\" in the musical comedy Natural Gas by Henry Grattan Donnelly.[18] Yohé's unique vocal quality attracted the attention of the manager of the Chicago Opera House, and she was engaged to play princess Zal-Am-Boo in Alfred Thompson's extravaganza Arabian Nights, which premiered on June 2, 1887.[19][20] The following year, she appeared in The Crystal Slipper: or Prince Pretliwittz and Little Cinderella, also at the Chicago Opera House.[9][21] In 1888, on the weekend that preceded the Fourth of July, Yohé travelled to Cleveland, Ohio in the company of Edward Shaw, the son of W. W. Shaw, a major stockholder in the Chicago Opera House. She missed at least two performances before returning. Shaw’s young wife filed for divorce a week later.[9][22] She subsequently toured in America and abroad with George Lederer's Players in the farce comedy U & I and as Celia Cliquot in Hoss and Hoss, both in 1891.[23]",
				"after": "In 1893, Yohé made her London debut as Martina in The Magic Opal by Isaac Albéniz, and the following year she played the title character in the musical The Lady Slavey, composed by Gustave Adolph Kerker, with a book by Sir George Dance, in which she sang “What’s a Poor Girl to Do”.[24] She starred as the title character in the 1894 hit burlesque Little Christopher Columbus, \"a great personal success\" for her.[25] In an interview, Yohé said the music, \"had to be specially written for me – crammed so to speak, into my voice’s shrunken circumference.\"[26] While in London, she became a favorite of the Prince of Wales (later King Edward VII).[4] The next year she played the title role in the comic opera Dandy Dick Whittington, at the Avenue Theatre, written by George Robert Sims and composed by Ivan Caryll.[27] Sims noted that Yohé \"could be rude [to writers, composers and conductors] if she didn't get just what she wanted.\"[25]",
			"color": "dark|0.28499 gray|0.28499 dark|0.28499 grey|0.28499 silver|0.25788 light|0.11992 gray|0.11992 light|0.11992 grey|0.11992 gray|0.08344 grey|0.08344 dim|0.076896 gray|0.076896 dim|0.076896 grey|0.076896 black|0.058276 gainsboro|0.049763 white|0.0083006 smoke|0.0083006 sea|0.0072645 shell|0.0072645 linen|0.0069934 floral|0.0066275 white|0.0066275 snow|0.0065846 white|0.0052881 mint|0.0049367 cream|0.0049367 ghost|0.0047041 white|0.0047041 lavender|0.0033896 blush|0.0033896 old|0.0033554 lace|0.0033554 alice|0.0031317 blue|0.0031317  "
		}
	}
}
