{
	"add": {
		"doc": {
			"id": "7b1572825441cff6a0586b3caebdf3de7eb585e0de6d8832968d049f8c8bd07d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Dromaeosauroides_size.jpg/220px-Dromaeosauroides_size.jpg",
				"previous": "Features used to identify fossil theropod teeth include size, proportion, curvature of the crown and the morphology and number of denticles (serrations). The holotype of D. bornholmensis is a tooth crown 21.7 millimetres (0.85 in) long, 9.7 millimetres (0.38 in) from front to back and 6.6 millimetres (0.26 in) wide at the base. The front part of the tooth was worn, indicating that it was shed when the animal was alive. It was further affected by taphonomic wear; the base of the tooth is irregular, so it may have been slightly longer in life.[1] The curvature and length of the holotype tooth and the length of its hindmost cutting edge (carina) indicates it was in the front of the jaw.[6]",
				"after": "The tooth is recurved with a backward bend, and is oval in cross-section. Its front and back cutting edges are finely serrated, extending two-thirds down each edge.[6] There are six denticles per millimeter (0.04 in), and each denticle is square and chiseled. The overall form of the tooth, its width and shape in cross-section and its curvature resemble those in the maxilla (upper jawbone) and mandible of the species Dromaeosaurus albertensis from North America. Blood grooves are indistinct or absent, also similar to Dromaeosaurus, and differing from members of the Velociraptorinae subfamily. Dromaeosauroides differs from Dromaeosaurus in that the cutting edge at the front side is further from the middle of the tooth. Although the tooth is larger and the denticles similar, each denticle was smaller than those of Dromaeosaurus, which had only 13–20 denticles per 5 millimetres (0.20 in), instead of Dromaeosauroides' 30.[1] The second known tooth is smaller—15 millimetres (0.59 in)—with the same features as the holotype.[2]",
			"color": " "
		}
	}
}
