{
	"add": {
		"doc": {
			"id": "7b4ced26dac59d7b7adf3d0c9962018d5f2ceb2de46029e32bdc885f4b596940",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/US_Navy_020706-N-1485H-055_Trees_blown_over_by_Typhoon_Chataan.jpg/220px-US_Navy_020706-N-1485H-055_Trees_blown_over_by_Typhoon_Chataan.jpg",
				"previous": "The last location Chataan affected was Japan. The typhoon forced the cancellation of 316 flights[22] and 150 train trips. The expressway between Shizuoka and Tokyo was closed.[23] At least 396 schools were closed in the country,[22] and a baseball game between the Yokohama DeNA BayStars and the Yakult Swallows was canceled due to the inclement weather.[24] Toyota temporarily closed most of its factories in the country.[25] Heavy rainfall, peaking at 509 mm (20.0 in) in Gifu Prefecture, fell across Japan. The rains flooded 10,270 houses in the country,[26] resulting in evacuation orders for about 145,000 people.[27] The floods damaged roads in 338 locations, and at least 10 bridges were destroyed.[28] About 15,000 evacuees were in Ogaki after a river exceeded its banks.[5] High rainfall caused hundreds of landslides,[15] two of which resulted in a death.[29] Floods killed at least three people.[15] Winds from the typhoon peaked at 97 km/h (60 mph) at Hachijō-jima.[26] High winds in Sakai, Osaka damaged 20 houses.[22] In Tokyo, the storm produced light winds and rains, despite passing within 102 km (63 mi).[5] Chataan destroyed 21 homes and damaged 239 others to some degree. During its passage, the typhoon destroyed 258.6 km2 (99.8 sq mi) of crops. The typhoon killed six people, left one person missing, and injured 30 others. Overall damage in Japan totaled about $500 million (¥59 billion 2002 JPY).[nb 4][26] During the storm, Yahoo! Japan received a record 359 million views, mostly due to people checking the website's weather section.[31]",
				"after": "After Chataan affected Chuuk state, the island's residents were in need of food, clothes and medicine. Only a few crops were not destroyed by the storm; much of the breadfruit was stripped from the trees, and fruit not destroyed by the storm were damaged by parasites.[9] In the days after the storm, the local Red Cross deployed about 100 volunteers to search for victims buried by landslides.[8] However, rescue operations were hampered by persistent flooding after the storm.[12] Initially the death toll was unknown, and it was feared that hundreds of people had been killed.[8] Six people who were seriously injured on Chuuk were flown to The Queen's Medical Center in Hawaii for treatment; they were initially scheduled to fly to Guam Memorial Hospital, but the facility was full.[32] About 2,000 residents affected by the storm evacuated to government-run shelters.[11] The Red Cross shipped various relief supplies, including raincoats and water, to the affected areas.[8] By July 4, power systems were restored and the airport reopened. Although there was enough food in the immediate aftermath, the destruction of crops and cattle posed a long-term food shortage.[12]",
			"color": "black|0.44071 dim|0.25392 gray|0.25392 dim|0.25392 grey|0.25392 gray|0.13394 grey|0.13394 dark|0.052753 slate|0.052753 gray|0.052753 dark|0.039744 gray|0.039744 dark|0.039744 grey|0.039744 rosy|0.028317 brown|0.028317  "
		}
	}
}
