{
	"add": {
		"doc": {
			"id": "7b628ac4cc80be66427a5c31fa7597677e6ebe66f00d29af4bb82ec7617a3643",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Tunisia589.jpg/150px-Tunisia589.jpg",
				"previous": "Following family tradition, Ibn Khaldūn strove for a political career. In the face of a tumultuous political situation in North Africa, this required a high degree of skill developing and dropping alliances prudently, to avoid falling with the short-lived regimes of the time.[citation needed] Ibn Khaldūn's autobiography is the story of an adventure, in which he spends time in prison, reaches the highest offices and falls again into exile.[citation needed]",
				"after": "At the age of 20, he began his political career at the Chancellery of the Tunisian ruler Ibn Tafrakin with the position of Kātib al-'Alāmah, which consisted of writing in fine calligraphy the typical introductory notes of official documents. In 1352, Abū Ziad, the Sultan of Constantine, marched on Tunis and defeated it. Ibn Khaldūn, in any case unhappy with his respected but politically meaningless position, followed his teacher Abili to Fez. Here the Marinid sultan Abū Inan Fares I appointed him as a writer of royal proclamations, which didn't prevent Ibn Khaldūn from scheming against his employer. In 1357 this brought the 25-year-old a 22-month prison sentence. Upon the death of Abū Inan in 1358, the vizier al-Hasān ibn-Umar granted him freedom and reinstated him in his rank and offices. Ibn Khaldūn then schemed against Abū Inan's successor, Abū Salem Ibrahim III, with Abū Salem's exiled uncle, Abū Salem. When Abū Salem came to power, he gave Ibn Khaldūn a ministerial position, the first position which corresponded with Ibn Khaldūn's ambitions.",
			"color": "black|0.2981 dark|0.27623 gray|0.27623 dark|0.27623 grey|0.27623 gray|0.14405 grey|0.14405 silver|0.12592 dim|0.11087 gray|0.11087 dim|0.11087 grey|0.11087 light|0.019177 gray|0.019177 light|0.019177 grey|0.019177 slate|0.011618 gray|0.011618 light|0.0082894 slate|0.0082894 gray|0.0082894 gainsboro|0.0056351  "
		}
	}
}
