{
	"add": {
		"doc": {
			"id": "7b63226e2214522ef15e1ea5ee5fab38df26ec9fc1022493fe0815a9a7f204f1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/18XER_engine_block.jpg/220px-18XER_engine_block.jpg",
				"previous": "The cylinder head is attached to the engine block by numerous bolts or studs. It has several functions. The cylinder head seals the cylinders on the side opposite to the pistons; it contains short ducts (the ports) for intake and exhaust and the associated intake valves that open to let the cylinder be filled with fresh air and exhaust valves that open to allow the combustion gases to escape. However, 2-stroke crankcase scavenged engines connect the gas ports directly to the cylinder wall without poppet valves; the piston controls their opening and occlusion instead. The cylinder head also holds the spark plug in the case of spark ignition engines and the injector for engines that use direct injection. All CI engines use fuel injection, usually direct injection but some engines instead use indirect injection. SI engines can use a carburetor or fuel injection as port injection or direct injection. Most SI engines have a single spark plug per cylinder but some have 2. A head gasket prevents the gas from leaking between the cylinder head and the engine block. The opening and closing of the valves is controlled by one or several camshafts and springs—or in some engines—a desmodromic mechanism that uses no springs. The camshaft may press directly the stem of the valve or may act upon a rocker arm, again, either directly or through a pushrod.",
				"after": "The crankcase is sealed at the bottom with a sump that collects the falling oil during normal operation to be cycled again. The cavity created between the cylinder block and the sump houses a crankshaft that converts the reciprocating motion of the pistons to rotational motion. The crankshaft is held in place relative to the engine block by main bearings, which allow it to rotate. Bulkheads in the crankcase form a half of every main bearing; the other half is a detachable cap. In some cases a single main bearing deck is used rather than several smaller caps. A connecting rod is connected to offset sections of the crankshaft (the crankpins) in one end and to the piston in the other end through the gudgeon pin and thus transfers the force and translates the reciprocating motion of the pistons to the circular motion of the crankshaft. The end of the connecting rod attached to the gudgeon pin is called its small end, and the other end, where it is connected to the crankshaft, the big end. The big end has a detachable half to allow assembly around the crankshaft. It is kept together to the connecting rod by removable bolts.",
			"color": "black|0.25902 dim|0.17315 gray|0.17315 dim|0.17315 grey|0.17315 dark|0.11723 gray|0.11723 dark|0.11723 grey|0.11723 gray|0.11437 grey|0.11437 silver|0.085328 light|0.043671 gray|0.043671 light|0.043671 grey|0.043671 gainsboro|0.030151 white|0.019003 smoke|0.019003 dark|0.016542 slate|0.016542 gray|0.016542 sea|0.014861 shell|0.014861 snow|0.014764 mint|0.014258 cream|0.014258 white|0.013498 floral|0.013461 white|0.013461 azure|0.012491 ghost|0.012431 white|0.012431 alice|0.01207 blue|0.01207 linen|0.0098067 ivory|0.0074019  "
		}
	}
}
