{
	"add": {
		"doc": {
			"id": "7b90225f042ed858b2672fb0fd58cefd070081929fd3f67c585efb81be9c45e2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Harper%27s_Magazine_Feb_1857_cent.jpg/170px-Harper%27s_Magazine_Feb_1857_cent.jpg",
			"previous": [],
				"after": "The Philadelphia Mint released the new cents to the public on May 25, 1857. In anticipation of large popular demand, Mint authorities built a temporary wooden structure in the courtyard of the Philadelphia facility. On the morning of the date of release, hundreds of people queued, one line for those exchanging Spanish silver for cents, the other for those bringing in old copper cents and half cents. From 9 am clerks paid out cents for the old pieces; outside the Mint precincts, early purchasers sold the new cents at a premium. Snowden wrote to Guthrie, \"the demand for them is enormous ... we had on hand this morning $30,000 worth, that is three million pieces. Nearly all of this amount will be paid out today.\"[20] The 1856 specimen became publicly known about the time of issuance, and had the public checking their pocket change; 1856 small cents sold for as much as $2 by 1859.[26] The public interest in the new cents set off a coin collecting boom: in addition to seeking the rare 1856 cent, some tried to collect sets of large cents back to 1793, and found they would have to pay a premium for the rarer dates.[14]",
			"color": "black|0.12546 dark|0.11665 gray|0.11665 dark|0.11665 grey|0.11665 dim|0.10312 gray|0.10312 dim|0.10312 grey|0.10312 gray|0.10268 grey|0.10268 silver|0.087928 light|0.074999 gray|0.074999 light|0.074999 grey|0.074999 gainsboro|0.066998 white|0.039698 smoke|0.039698 linen|0.035628 sea|0.035293 shell|0.035293 snow|0.032531 floral|0.03034 white|0.03034 lavender|0.028574 blush|0.028574 ghost|0.028194 white|0.028194 white|0.025306 mint|0.018737 cream|0.018737 old|0.014633 lace|0.014633 alice|0.013632 blue|0.013632 azure|0.0078199 misty|0.006186 rose|0.006186 ivory|0.0054299  "
		}
	}
}
