{
	"add": {
		"doc": {
			"id": "7b938388ad5bdfc4a899f86e7cad1130ee79de119686b581e15468ed95c2e928",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Rhesus_Macaques.jpg/220px-Rhesus_Macaques.jpg",
				"previous": "Other terrestrial mammals have been introduced throughout the history of Puerto Rico. Indigenous settlers first introduced dogs and guinea pigs from South or Central America. Afterwards, Taínos introduced hutias as a food source from Hispaniola. When the Spanish colonized the island in the early 16th century, they introduced domesticated animals such as dogs, cats, goats, pigs, cattle, horses, and donkeys.[18] Other species such as black rats (Rattus rattus), Norway rats (Rattus norvegicus) and house mice (Mus sp.) have been unintentionally introduced as stowaways, possibly since Christopher Columbus's arrival in 1493. More recently, species have been introduced as a means of biological pest control. For example, the small Asian mongoose (Herpestes javanicus) was introduced in the 19th century to control the damage caused by rats in sugar cane plantations. The introduction was a failure: the mongoose failed to control the rat population and instead contributed to the decline of native fauna such as the yellow-shouldered blackbird and possibly the elfin-woods warbler.",
				"after": "As part of a study on adaptation, 57 rhesus macaques (Macaca mulatta) were introduced to the island of Desecheo and other southern off-shore islands and cays in 1967.[18] Prior to the introduction, Desecheo was the largest nesting colony of the brown booby, but mainly as a result of egg predation by the introduced macaques, no bird species presently nests in the island. Efforts to trap and remove the species have been unsuccessful and it has expanded its range to southwestern Puerto Rico. Other primates also have established populations in Puerto Rico. As a result of vandalism, 107 squirrel monkeys escaped from a research station at Sabana Seca in the late 1970s. The latest estimate for this population is 35 individuals.[18]",
			"color": "dark|0.56606 gray|0.56606 dark|0.56606 grey|0.56606 rosy|0.14047 brown|0.14047 silver|0.11883 gray|0.07052 grey|0.07052 dim|0.057327 gray|0.057327 dim|0.057327 grey|0.057327  "
		}
	}
}
