{
	"add": {
		"doc": {
			"id": "7b9b522141e6492c0edd144e3989a6496f5c21aa5665d3bd2a282138b3373983",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/United_States_penny%2C_obverse%2C_2002.png/220px-United_States_penny%2C_obverse%2C_2002.png",
				"previous": "In 1964, a rise in the price of silver led to silver coins being hoarded by the public. With change short, hoarding extended to the cent, which also became scarce in circulation. Mint Director Eva Adams felt that part of the reason for the shortage was coin collectors taking pieces from circulation, and Adams ordered that mintmarks no longer appear on coins. Coins continued to be dated 1964 until the end of 1965, using authority given by the Coinage Act of 1965, and almost all 1965 cents were actually struck in 1966.[62] The Mint began striking clad dimes and quarters, replacing the silver pieces which the public would not spend. Although coinage had been stopped at San Francisco after 1955, the California facility began to issue cents again, though without mintmarks.[63] In 1968, mintmarks were restored to the cent. San Francisco began minting a limited number of circulation strikes[64] (which it would cease to do after 1974)[65] and began striking proof coins.[64]",
				"after": "Copper prices began to rise in 1973, to such an extent that the intrinsic value of the coin approached a cent, and citizens began to hoard cents, hoping to realize a profit. The Mint decided to switch to an aluminum cent. Over a million and a half such pieces were struck in the second half of 1973, though they were dated 1974. At congressional hearings, representatives of the vending machine industry testified that aluminum cents would jam their equipment, and the Mint backed away from its proposal.[66] Mint director Mary Brooks sought the return of samples which had been distributed to members of Congress, but 14 remained missing, with the recipients affecting not to know what had become of them. One aluminum cent was donated to the Smithsonian Institution for the National Numismatic Collection;[67][68] another was reportedly found by a US Capitol Police Officer.[67]",
			"color": "black|0.43113 tan|0.060092 antique|0.060014 white|0.060014 peach|0.046993 puff|0.046993 linen|0.038316 bisque|0.036843 old|0.035436 lace|0.035436 sea|0.033516 shell|0.033516 floral|0.03204 white|0.03204 misty|0.031582 rose|0.031582 papaya|0.029789 whip|0.029789 ivory|0.029471 snow|0.026285 white|0.024579 smoke|0.024579 blanched|0.019819 almond|0.019819 lavender|0.012628 blush|0.012628 white|0.0093467 beige|0.0080874 mint|0.0045536 cream|0.0045536 silver|0.0043591 dark|0.0042983 gray|0.0042983 dark|0.0042983 grey|0.0042983 dim|0.0041158 gray|0.0041158 dim|0.0041158 grey|0.0041158 light|0.0040152 gray|0.0040152 light|0.0040152 grey|0.0040152 gray|0.0036598 grey|0.0036598 corn|0.0036346 silk|0.0036346  "
		}
	}
}
