{
	"add": {
		"doc": {
			"id": "7ba0a7d7378170d792ccf8e6e56e31879437ba79b2f053ee6821f62bda500d19",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/D%C3%BCrer_-_Bildnis_der_Mutter.jpg/200px-D%C3%BCrer_-_Bildnis_der_Mutter.jpg",
				"previous": "Barbara is shown wearing a red dress and a matte white bonnet which fully covers her hair, indicating her marital status.[10] Her headdress is draped with a long scarf or train which stretches down her neck and across her left shoulder, contrasting in colour and shape against the black head-wear of her husband. The lines of her face contain touches of white paint to give a highlighting and enlivening effect; they are especially evident around her eyes, the bridge of her nose and around her upper lip.[13] Barbara was attractive in her youth; her son described her as having been \"comely and of erect bearing\".[20][D] However by the time of this portrait the effects of time and losing so many children weigh heavily on her face.[9] The panel was grounded with white paint, while the composition seems to have changed significantly from the imprimatura. Faint traces of the original figuration are visible in parts of the background and in the darkened areas of her hood.[4] At some point the panel was cut down at the left side, shifting the compositional balance and removing a portion of her shoulder and headdress.[9]",
				"after": "The panel closely resembles Dürer's 1514 drawing Portrait of the artist's mother at the age of 63.[21] David Price writes of the drawing's \"rough depiction of her flesh emaciated by old age\", and the \"existential piety in the cast of Barbara Dürer's right eye, which, almost unnaturally, directs her vision heavenward\". Although Barbara is some 25 years older in the later drawing and by then terminally ill, the facial resemblance and pose are unmistakable.[12] However, there is a dramatic difference between the relatively young looking 39-year-old woman in the diptych and the aged and terminally ill widow in the 1514 drawing. A family resemblance can be detected between both works and Dürer's Vienna self-portrait; most evidently around the mouth. Kemperdick concludes that these passages are so closely modeled that it is reasonable to presume they were drawn by the same hand, but is conservative in saying definitively that the sitters were related by blood, as Dürer was very young, and though precociously talented, to some extent still reliant on facial \"types\".[13]",
			"color": "silver|0.1777 dark|0.17596 gray|0.17596 dark|0.17596 grey|0.17596 light|0.15242 gray|0.15242 light|0.15242 grey|0.15242 gainsboro|0.12495 gray|0.11506 grey|0.11506 dim|0.086268 gray|0.086268 dim|0.086268 grey|0.086268 black|0.038415 white|0.02314 smoke|0.02314 linen|0.022608 sea|0.015051 shell|0.015051 snow|0.011355 floral|0.010012 white|0.010012 lavender|0.0098003 blush|0.0098003 ghost|0.0093393 white|0.0093393 white|0.006906 mint|0.0055642 cream|0.0055642 alice|0.0052608 blue|0.0052608 old|0.0050622 lace|0.0050622  "
		}
	}
}
