{
	"add": {
		"doc": {
			"id": "7bb770a25d0000c744b1635bfb53fc1fecaec2161f8d613a14b13587f4ab0bb1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/F-15C.jpg/220px-F-15C.jpg",
				"previous": "The F-16's maneuverability was further enhanced by its slight aerodynamic instability. This technique, called \"relaxed static stability\" (RSS), was made possible by introduction of the \"fly-by-wire\" (FBW) flight control system (FLCS), which in turn was enabled by advances in computers and system integration techniques. Analog avionics, required to enable FBW operations, became a fundamental requirement and began to be replaced by digital flight control systems in the latter half of the 1980s. Likewise, Full Authority Digital Engine Controls (FADEC) to electronically manage powerplant performance was introduced with the Pratt & Whitney F100 turbofan. The F-16's sole reliance on electronics and wires to relay flight commands, instead of the usual cables and mechanical linkage controls, earned it the sobriquet of \"the electric jet\". Electronic FLCS and FADEC quickly became essential components of all subsequent fighter designs.",
				"after": "Other innovative technologies introduced in fourth-generation fighters include pulse-Doppler fire-control radars (providing a \"look-down/shoot-down\" capability), head-up displays (HUD), \"hands on throttle-and-stick\" (HOTAS) controls, and multi-function displays (MFD), all now essential equipment. Aircraft designers began to incorporate composite materials in the form of bonded aluminum honeycomb structural elements and graphite epoxy laminate skins to reduce weight. Infrared search-and-track (IRST) sensors became widespread for air-to-ground weapons delivery, and appeared for air-to-air combat as well. \"All-aspect\" IR AAM became standard air superiority weapons, which permitted engagement of enemy aircraft from any angle (although the field of view remained relatively limited). The first long-range active-radar-homing RF AAM entered service with the AIM-54 Phoenix, which solely equipped the Grumman F-14 Tomcat, one of the few variable-sweep-wing fighter designs to enter production. Even with the tremendous advancement of air-to-air missiles in this era, internal guns were standard equipment.",
			"color": "slate|0.34307 gray|0.34307 light|0.26272 slate|0.26272 gray|0.26272 black|0.088066 dark|0.086851 gray|0.086851 dark|0.086851 grey|0.086851 silver|0.050219 gray|0.034628 grey|0.034628 light|0.027456 gray|0.027456 light|0.027456 grey|0.027456 dim|0.025992 gray|0.025992 dim|0.025992 grey|0.025992 gainsboro|0.018804 white|0.0065216 smoke|0.0065216  "
		}
	}
}
