{
	"add": {
		"doc": {
			"id": "7bdfaf9bd879b4d07e3ab52e0f12b00eb89b609bcb7fec047511b2cc583195a3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/The_Medusa_shown_at_the_Louvre%2C_in_color.jpg/220px-The_Medusa_shown_at_the_Louvre%2C_in_color.jpg",
				"previous": "The Raft of the Medusa was first shown at the 1819 Paris Salon, under the generic title Scène de Naufrage (Scene of Shipwreck), although its real subject would have been unmistakable for contemporary viewers.[27] Géricault's Raft was the star at the Salon of 1819: \"It strikes and attracts all eyes\" (Le Journal de Paris). Louis XVIII visited the Salon three days before the opening, and reportedly said \"Monsieur, vous venez de faire un naufrage qui n'en est pas un pour vous\",[46] freely translated as \"Monsieur Géricault, your shipwreck is certainly no disaster\".[47] Critics were divided: the horror and \"terribilità\" of the subject exercised fascination, but devotees of classicism expressed their distaste for what they described as a \"pile of corpses,\" whose realism they considered a far cry from the \"ideal beauty\" incarnated by Girodet's Pygmalion and Galatea (which triumphed the same year). Géricault's work expressed a paradox: how could a hideous subject be translated into a powerful painting, how could the painter reconcile art and reality? Marie-Philippe Coupin de la Couperie, a French painter and contemporary of Géricault, was categorical: \"Monsieur Géricault seems mistaken. The goal of painting is to speak to the soul and the eyes, not to repel.\" The painting had fervent admirers too, including French writer and art critic Auguste Jal who praised its political theme, its liberal position (the advancement of the \"negro\", the critique of ultra-royalism), and its modernity. For French historian Jules Michelet, \"our whole society is aboard the raft of the Medusa\".[3]",
				"after": "The exhibition was sponsored by Louis XVIII and featured nearly 1,300 individual paintings, 208 sculptures and numerous other engravings and architectural designs. The contemporary critic Frank Anderson Trapp suggested that the volume of work shown and the sheer scale of the event indicates the ambition behind the exhibition. Trapp notes that the fact that \"100 grandiose history paintings [were included] in itself proclaimed a munificent government patronage\", for aside from a few affluent competitors like Géricault, only those favoured by a major commission could afford the outlay of time, energy and money necessary for undertakings of this kind.[7]",
			"color": "black|0.17121 burly|0.13357 wood|0.13357 tan|0.090148 pale|0.088589 golden|0.088589 rod|0.088589 peru|0.080982 saddle|0.061459 brown|0.061459 sienna|0.047007 navajo|0.039122 white|0.039122 wheat|0.038427 lemon|0.03395 chiffon|0.03395 moccasin|0.031347 light|0.022567 golden|0.022567 rod|0.022567 yellow|0.022567 khaki|0.019523 sandy|0.018866 brown|0.018866 dark|0.017132 khaki|0.017132  "
		}
	}
}
