{
	"add": {
		"doc": {
			"id": "7bfbc3f041c7150581566d46870641b716c833c1ce3d3a82f83cfc0430119a0b",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Comtemporary_Ghanaian_men_fashion.jpg/150px-Comtemporary_Ghanaian_men_fashion.jpg",
			"previous": [],
				"after": "Contemporary Ghanaian fashion include traditional and modern styles and fabrics and has made its way into the African and global fashion scene. The cloth known as African print fabric was created out of Dutch wax textiles, it is believed that in the late 1800s, Dutch ships on their way to Asia stocked with machine-made textiles that mimicked Indonesian Batik stopped at many West African ports on the way. The fabrics did not do well in Asia. However, in West Africa mainly Ghana where there was an already established market for cloths and textiles, the client base grew and it was changed to include local and traditional designs, colors and patterns to cater to the taste of the new consumers.[202] Today outside of Africa it is being called \"Ankara\" and it has a client base well beyond Ghana and Africa as a whole. It is very popular among Caribbean peoples and African Americans – celebrities such as Solange Knowles and sister Beyoncé have been seen wearing African print attire.[203] Many European and American designers are now using African prints and it has gained a Global interest.[204] European luxury fashion house Burberry created a collection around Ghanaian styles.[205] American musician Gwen Stefani has repeatedly incorporated African prints into her clothing line and can often be seen wearing it.[206] Internationally acclaimed Ghanaian-British designer Ozwald Boateng introduced African print suits in his 2012 collection.[207]",
			"color": "black|0.43835 dark|0.082242 gray|0.082242 dark|0.082242 grey|0.082242 silver|0.04801 dark|0.046615 slate|0.046615 gray|0.046615 gray|0.042496 grey|0.042496 dim|0.035914 gray|0.035914 dim|0.035914 grey|0.035914 light|0.033538 gray|0.033538 light|0.033538 grey|0.033538 gainsboro|0.026341 white|0.01643 smoke|0.01643 sea|0.014622 shell|0.014622 snow|0.013578 floral|0.012772 white|0.012772 tan|0.012587 white|0.012228 mint|0.011899 cream|0.011899 ghost|0.011716 white|0.011716 linen|0.011512 alice|0.011216 blue|0.011216 antique|0.010354 white|0.010354 azure|0.0091558 lavender|0.0089049 blush|0.0089049 rosy|0.0081869 brown|0.0081869 old|0.0066126 lace|0.0066126 ivory|0.0057017 slate|0.0054384 gray|0.0054384  "
		}
	}
}
