{
	"add": {
		"doc": {
			"id": "7c0c05b403ee42b89428b3362c8339f102ed8719a4d4494caa9c2debb98b689f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Plan_of_the_Tower_House%2C_London.png/950px-Plan_of_the_Tower_House%2C_London.png",
				"previous": "The house has an L-shaped plan, and the exterior is plain, of red brick, with Bath stone dressings and green roof slates from Cumberland.[32] With a floor plan of 50 feet by 50 feet (15 m) square,[36] 2,500 square feet (230 m2), Burges went about its construction on a grand scale. The architect R. Norman Shaw remarked that the concrete foundations were suitable \"for a fortress\".[37] This approach, combined with Burges's architectural skills and the minimum of exterior decoration, created a building that Crook described as \"simple and massive\".[36] Following his usual pattern, Burges re-worked many elements of earlier designs, adapting them as appropriate. The frontages come from the other townhouse he designed, the McConnochie House in Cardiff, although they have been reversed, with the arcaded, street front from the McConnochie House forming the garden front of the Tower House.[38] The staircase is consigned to the conical tower, avoiding the error Burges made at the earlier house, where he placed the staircase in the middle of the hall.[36] The cylindrical tower and conical roof derive from Castell Coch, and the interiors are inspired from examples at Cardiff Castle.[33][36] The house has two main floors, with a basement below and a garret above.[7] The ground floor contains a drawing room, a dining room and a library, while the first floor has two bedrooms and an armoury.",
				"after": "The architectural writer Bridget Cherry wrote that \"the sturdy exterior gives little hint of the fantasy [Burges] created inside\",[39] interiors which the art historian and Burges scholar Charles Handley-Read described as \"at once opulent, aggressive, obsessional, enchanting, their grandeur border[ing] on grandiloquence\".[38] Each room has a complex iconographic scheme of decoration: in the hall it is Time; in the drawing room, Love; in Burges's bedroom, the Sea. Massive fireplaces with elaborate overmantels were carved and installed, described by Crook as \"veritable altars of art ... some of the most amazing pieces of decoration Burges ever designed\".[40] Handley-Read considered that Burges's decorations were \"unique, almost magical [and] quite unlike anything designed by his contemporaries\".[38]",
			"color": "black|0.69948 dim|0.072744 gray|0.072744 dim|0.072744 grey|0.072744 gray|0.043713 grey|0.043713 red|0.034212 misty|0.010817 rose|0.010817 sea|0.010344 shell|0.010344 lavender|0.010191 blush|0.010191 snow|0.010112 white|0.0098611 smoke|0.0098611 pink|0.0096237 floral|0.0095065 white|0.0095065 ghost|0.0094907 white|0.0094907 white|0.0093847 light|0.0087622 coral|0.0087622 alice|0.0087298 blue|0.0087298 mint|0.0085676 cream|0.0085676 light|0.00795 pink|0.00795 azure|0.0079055 dark|0.0067686 gray|0.0067686 dark|0.0067686 grey|0.0067686 salmon|0.0053902  "
		}
	}
}
