{
	"add": {
		"doc": {
			"id": "7c17971795259930a03a198d73ce45aae020d06ae5edfa7173a7855721f51760",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Herrerasaurus_skull.jpg/220px-Herrerasaurus_skull.jpg",
				"previous": "Two other partial skeletons, with skull material, were named Frenguellisaurus ischigualastensis by Fernando Novas in 1986,[35] but this species too is now thought to be a synonym.[13] Frenguellisaurus ischigualastensis was discovered in 1975, and was described by Novas (1986) who considered it a primitive saurischian, and possibly a theropod. Novas (1992) and Sereno and Novas (1992) examined the Freguellisaurus remains and found them referable to Herrerasaurus.[36] Ischisaurus cattoi was discovered in 1960 and described by Reig in 1963. Novas (1992) and Sereno and Novas (1992) reviewed its remains and found them to be referable to Herrerasaurus.[36]",
				"after": "A complete Herrerasaurus skull was not found until 1988, by a team of paleontologists led by Paul Sereno.[4] Based on the new fossils, authors such as Thomas Holtz[37] and José Bonaparte[38] classified Herrerasaurus at the base of the saurischian tree before the divergence between prosauropods and theropods. However, Sereno favored classifying Herrerasaurus (and the Herrerasauridae) as primitive theropods. These two classifications have become the most persistent, with Rauhut (2003)[39] and Bittencourt and Kellner (2004)[40] favoring the early theropod hypothesis, and Max Langer (2004),[9] Langer and Benton (2006),[41] and Randall Irmis and his coauthors (2007)[42] favoring the basal saurischian hypothesis. If Herrerasaurus were indeed a theropod, it would indicate that theropods, sauropodomorphs, and ornithischians diverged even earlier than herrerasaurids, before the middle Carnian, and that \"all three lineages independently evolved several dinosaurian features, such as a more advanced ankle joint or an open acetabulum\".[43] This view is further supported by ichnological records showing large tridactyl (three-toed) footprints that can be attributed only to a theropod dinosaur. These footprints date from the Ladinian (Middle Triassic) of the Los Rastros Formation in Argentina and predate Herrerasaurus by 3 to 5 million years.[44][45]",
			"color": "black|0.48233 peru|0.082429 tan|0.070302 dim|0.047197 gray|0.047197 dim|0.047197 grey|0.047197 sienna|0.039162 saddle|0.038884 brown|0.038884 gray|0.03711 grey|0.03711 sandy|0.034154 brown|0.034154 burly|0.022874 wood|0.022874 dark|0.020335 gray|0.020335 dark|0.020335 grey|0.020335  "
		}
	}
}
