{
	"add": {
		"doc": {
			"id": "7c1adea0b3c357b652e125dda25ba00b220ac628fdb5889ac708083268d11c3d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Blind_monks_examining_an_elephant.jpg/220px-Blind_monks_examining_an_elephant.jpg",
				"previous": "Elephants have been represented in art since Paleolithic times. Africa in particular contains many rock paintings and engravings of the animals, especially in the Sahara and southern Africa.[177] In the Far East, the animals are depicted as motifs in Hindu and Buddhist shrines and temples.[178] Elephants were often difficult to portray by people with no first-hand experience with them.[179] The ancient Romans, who kept the animals in captivity, depicted anatomically accurate elephants on mosaics in Tunisia and Sicily. At the beginning of Middle Ages, when Europeans had little to no access to the animals, elephants were portrayed more like fantasy creatures. They were often depicted with horse- or bovine-like bodies with trumpet-like trunks and tusks like a boar; some were even given hooves. Elephants were commonly featured in motifs by the stonemasons of the Gothic churches. As more elephants began to be sent to European kings as gifts during the 15th century, depictions of them became more accurate, including one made by Leonardo da Vinci. Despite this, some Europeans continued to portray them in a more stylised fashion.[180] Max Ernst's 1921 surrealist painting The Elephant Celebes depicts an elephant as a silo with a trunk-like hose protruding from it.[181]",
				"after": "Elephants have been the subject of religious beliefs. The Mbuti people believe that the souls of their dead ancestors resided in elephants.[178] Similar ideas existed among other African tribes, who believed that their chiefs would be reincarnated as elephants. During the 10th century AD, the people of Igbo-Ukwu buried their leaders with elephant tusks.[182] The animals' religious importance is only totemic in Africa[183] but is much more significant in Asia. In Sumatra, elephants have been associated with lightning. Likewise in Hinduism, they are linked with thunderstorms as Airavata, the father of all elephants, represents both lightning and rainbows.[178] One of the most important Hindu deities, the elephant-headed Ganesha, is ranked equal with the supreme gods Shiva, Vishnu, and Brahma.[184] Ganesha is associated with writers and merchants and it is believed that he can give people success as well as grant them their desires.[178] In Buddhism, Buddha is said to have been a white elephant reincarnated as a human.[185] In Islamic tradition, the year 570, when Muhammad was born, is known as the Year of the Elephant.[186] Elephants were thought to be religious themselves by the Romans, who believed that they worshipped the sun and stars.[178] The 'Land of a Million Elephants' was the name of the ancient kingdom of Lan Xang and later the Lan Chang Province and it is now a nickname for Laos.",
			"color": "tan|0.32713 burly|0.28547 wood|0.28547 wheat|0.12717 navajo|0.082498 white|0.082498 moccasin|0.05943 pale|0.029687 golden|0.029687 rod|0.029687 peach|0.019327 puff|0.019327 bisque|0.017082 blanched|0.010071 almond|0.010071 lemon|0.0086168 chiffon|0.0086168 papaya|0.0048851 whip|0.0048851 light|0.0047087 golden|0.0047087 rod|0.0047087 yellow|0.0047087  "
		}
	}
}
