{
	"add": {
		"doc": {
			"id": "7c4005b78d9ebf4db6a1a3fccfab831adc59b309864c132ad6b4452b100792f6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/United_Arab_Airlines_Comet_Soderstrom.jpg/220px-United_Arab_Airlines_Comet_Soderstrom.jpg",
				"previous": "Development flying and route proving with the Comet 3 allowed accelerated certification of what was destined to be the most successful variant of the type, the Comet 4. All airline customers for the Comet 3 subsequently cancelled their orders and switched to the Comet 4,[63] which was based on the Comet 3 but with improved fuel capacity. BOAC ordered 19 Comet 4s in March 1955, while American operator Capital Airlines ordered 14 Comets in July 1956.[119] Capital's order included 10 Comet 4As, a variant modified for short-range operations with a stretched fuselage and short wings, lacking the pinion (outboard wing) fuel tanks of the Comet 4.[82] However, due to financial problems and a subsequent takeover by United Airlines, Capital would never operate the Comet.",
				"after": "The Comet 4 first flew on 27 April 1958 and received its Certificate of Airworthiness on 24 September 1958; the first was delivered to BOAC the next day.[117][120] The base price of a new Comet 4 was around £1,140,000, equivalent to £23,240,000 in today's pounds.[121][122] The Comet 4 enabled BOAC to inaugurate the first regular jet-powered transatlantic services on 4 October 1958 between London and New York (albeit still requiring a fuel stop at Gander International Airport, Newfoundland, on westward North Atlantic crossings).[68] While BOAC gained publicity as the first to provide transatlantic jet service, by the end of the month rival Pan American World Airways was flying the Boeing 707 on the same route,[123] and in 1960 the Douglas DC-8 as well. The American jets were larger, faster, longer-ranged, and more cost-effective than the Comet.[124] After analysing route structures for the Comet, BOAC reluctantly cast about for a successor, and in 1956 entered into an agreement with Boeing to purchase the 707.[125]",
			"color": "dim|0.12973 gray|0.12973 dim|0.12973 grey|0.12973 silver|0.12427 dark|0.11272 gray|0.11272 dark|0.11272 grey|0.11272 gray|0.097897 grey|0.097897 tan|0.097013 light|0.091254 gray|0.091254 light|0.091254 grey|0.091254 burly|0.065472 wood|0.065472 gainsboro|0.063603 white|0.020261 smoke|0.020261 sea|0.017837 shell|0.017837 snow|0.016473 floral|0.015218 white|0.015218 linen|0.015133 white|0.014524 mint|0.014499 cream|0.014499 ghost|0.011676 white|0.011676 azure|0.01089 alice|0.0099982 blue|0.0099982 ivory|0.0096557 lavender|0.0093395 blush|0.0093395  "
		}
	}
}
