{
	"add": {
		"doc": {
			"id": "7c4d6e8aac54c05a67cc46227b4a72bc569516a6cce6105e29350c5a587ede01",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Stjohnbarmouthfrombeach.jpg/220px-Stjohnbarmouthfrombeach.jpg",
				"previous": "In 1885–87 the partnership designed Abbeystead House for the 4th Earl of Sefton in North Lancashire. Hubbard describes this as \"the finest of Douglas's Elizabethan houses, and one of the largest which he ever designed\".[83][84] During this time additions were made to Jodrell Hall in Cheshire and Halkyn Castle in Flintshire.[85] In 1885 the Castle Hotel at Conwy, Caernarfonshire, was remodelled,[86] and in 1887–88 a strongroom was added to Hawarden Castle, followed by a porch in 1890.[87][88] During this period more buildings were added to the Eaton Hall estate, and these included houses and cottages, such as Eccleston Hill, and Eccleston Ferry House, and farms such as Saighton Lane Farm.[89] In 1890–91 an obelisk was built in the Belgrave Avenue approach to Eaton Hall.[90][91] The last house designed by Douglas on a large scale was Brocksford Hall (1893) in Derbyshire. This was a country house in Elizabethan style using diapered brick and stone dressings with a clock tower.[92] In Chester city centre, 38 Bridge Street (1897) is a timber-framed shop that incorporates a section of Chester Rows and contains heavily decorated carving.[90][93] From 1892 the partnership designed houses and cottages in Port Sunlight for Lever Brothers. Also in the village they designed the Dell Bridge (1894), and the school (1894–96), which is now called the Lyceum.[94][95] In 1896 Douglas designed a house for himself, Walmoor Hill in Dee Banks, Chester, in Elizabethan style.[96][97] Between 1895 and 1897 he designed a range of buildings on the east side of St Werburgh Street in the centre of Chester. At its south end, on the corner of Eastgate Street, is a bank whose ground storey is built in stone, and behind this leading up St Werburgh Street, the ground storey consists of shop fronts. Above this the range consists of two storeys plus an attic, which are covered in highly ornamented timber-framing. On the first floor is a series of oriel windows, the second floor is jettied, and at the top are eleven gables.[98][99] Pevsner considers that this range of buildings is \"Douglas at his best (though also at his showiest)\".[100] Hubbard expresses the opinion that \"in this work, the city's half-timber revival reached its very apogee\".[101]",
				"after": "During the partnership, work continued on designing new churches and restoring older ones. In 1884–85 a chapel was built at Carlett Park at Eastham in the Wirral and in 1884–87 St Deiniol's Church was built in Criccieth, Caernarfonshire.[102] Christ Church, Rossett (1886–92), St Paul's Church, Colwyn Bay (1887–88 with later additions), and St Andrew's Church, West Kirby (1889–91) followed.[103][104] St John's Church in Barmouth, Merionethshire was built between 1889 and 1895. It is one of the largest of Douglas's churches, although in 1891, during its construction, the tower collapsed and had to be rebuilt.[105] Other churches built in North Wales were Christ Church in Bryn-y-Maen, Colwyn Bay, and All Saints, Deganwy (both 1897–99).[106]",
			"color": "gray|0.3341 grey|0.3341 dark|0.24169 gray|0.24169 dark|0.24169 grey|0.24169 dim|0.18455 gray|0.18455 dim|0.18455 grey|0.18455 silver|0.06929 slate|0.040866 gray|0.040866 light|0.034971 slate|0.034971 gray|0.034971 light|0.014362 gray|0.014362 light|0.014362 grey|0.014362 light|0.012667 steel|0.012667 blue|0.012667 tan|0.0074391 wheat|0.0063565 gainsboro|0.0060306 rosy|0.0044216 brown|0.0044216 antique|0.0040045 white|0.0040045 bisque|0.0039394  "
		}
	}
}
