{
	"add": {
		"doc": {
			"id": "7c50765d10c4c02dc1a29551c2510487cbe81a2618f1cf606ca7c3706d39da12",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Platypus-sketch.jpg/220px-Platypus-sketch.jpg",
				"previous": "The body and the broad, flat tail of the platypus are covered with dense, brown fur that traps a layer of insulating air to keep the animal warm.[6][11] The fur is waterproof, and the texture is akin to that of a mole.[15] The platypus uses its tail for storage of fat reserves (an adaptation also found in animals such as the Tasmanian devil[16] and fat-tailed sheep). It has webbed feet and a large, rubbery snout; these features appear closer to those of a duck than to those of any known mammal. The webbing is more significant on the front feet and is folded back when walking on land.[11] Unlike a bird's beak (in which the upper and lower parts separate to reveal the mouth), the snout of the platypus is a sensory organ with the mouth on the underside. The nostrils are located on the dorsal surface of the snout, while the eyes and ears are located in a groove set just back from it; this groove is closed when swimming.[11] Platypuses have been heard to emit a low growl when disturbed and a range of other vocalizations have been reported in captive specimens.[6]",
				"after": "Weight varies considerably from 0.7 to 2.4 kg (1.5 to 5.3 lb), with males being larger than females; males average 50 cm (20 in) in total length, while females average 43 cm (17 in),[11] with substantial variation in average size from one region to another, and this pattern does not seem to follow any particular climatic rule and may be due to other environmental factors, such as predation and human encroachment.[17]",
			"color": "dim|0.29525 gray|0.29525 dim|0.29525 grey|0.29525 gray|0.24353 grey|0.24353 dark|0.2433 gray|0.2433 dark|0.2433 grey|0.2433 silver|0.098666 dark|0.039093 slate|0.039093 gray|0.039093 slate|0.024979 gray|0.024979 light|0.021882 gray|0.021882 light|0.021882 grey|0.021882 light|0.01288 slate|0.01288 gray|0.01288 gainsboro|0.0072767  "
		}
	}
}
