{
	"add": {
		"doc": {
			"id": "7c662df91451c4f111f70a0e4ab07f064ca598feb8693d3d9ada709fd6af9c0d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Floodlight_at_M._A._Chidambaram_Stadium%2C_Chennai.jpg/220px-Floodlight_at_M._A._Chidambaram_Stadium%2C_Chennai.jpg",
				"previous": "Cricket is a unique game where in addition to the laws, the players must abide by the \"Spirit of the Game\".[43] The standard of sportsmanship has historically been considered so high that the phrase \"it's just not cricket\" was coined in the 19th century to describe unfair or underhanded behaviour in any walk of life. In the last few decades though, cricket has become increasingly fast-paced and competitive, increasing the use of appealing and sledging, although players are still expected to abide by the umpires' rulings without argument, and for the most part they do. Beginning in 2001, the MCC has held an annual lecture named after Colin Cowdrey on the spirit of the game.[44] Even in the modern game fielders are known to signal to the umpire that a boundary was hit, despite what could have been considered a spectacular save (though they might be found out by the TV replays anyway). In addition to this, some batsmen have been known to \"walk\" when they think they are out even if the umpire does not declare them out. This is a high level of sportsmanship, as a batsman can easily take advantage of incorrect umpiring decisions.",
			"after": [
				"Cricket is a sport played predominantly in the drier periods of the year. But, even so, the weather is a major factor in all cricket matches.",
				"A scheduled game of cricket cannot be played in wet weather. Dampness affects the bounce of the ball on the wicket and is a risk to all players involved in the game. Many grounds have facilities to cover the cricket pitch (or the wicket). Covers can be in the form of tarpaulins being laid over the wicket to elevated covers on wheels (using the same concept as an umbrella) to even hover covers which form an airtight seal around the wicket. However, most grounds do not have the facilities to cover the outfield. This means that in the event of heavy bouts of bad weather, games may be cancelled, abandoned or suspended due to an unsafe outfield."
			],
			"color": "dim|0.31676 gray|0.31676 dim|0.31676 grey|0.31676 black|0.23404 steel|0.20877 blue|0.20877 light|0.066552 slate|0.066552 gray|0.066552 dark|0.058245 slate|0.058245 gray|0.058245 slate|0.043279 gray|0.043279 gray|0.022507 grey|0.022507 light|0.019767 steel|0.019767 blue|0.019767 dark|0.017213 gray|0.017213 dark|0.017213 grey|0.017213  "
		}
	}
}
