{
	"add": {
		"doc": {
			"id": "7c6ed4e8ff2dca22999d64c670f6cc5c99d9b91ef0a12706c12f6fd971adbcd7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/YF-16_VASC.JPG/220px-YF-16_VASC.JPG",
				"previous": "Increased interest would turn the LWF into a serious acquisition program. North Atlantic Treaty Organization (NATO) allies Belgium, Denmark, the Netherlands, and Norway were seeking to replace their F-104G fighter-bombers.[22] In early 1974, they reached an agreement with the U.S. that if the USAF ordered the LWF winner, they would consider ordering it as well. The USAF also needed to replace its F-105 and F-4 fighter-bombers. The U.S. Congress sought greater commonality in fighter procurements by the Air Force and Navy, and in August 1974 redirected Navy funds to a new Navy Air Combat Fighter (NACF) program that would be a navalized fighter-bomber variant of the LWF. The four NATO allies had formed the \"Multinational Fighter Program Group\" (MFPG) and pressed for a U.S. decision by December 1974; thus the USAF accelerated testing.[23][24][25]",
				"after": "To reflect this serious intent to procure a new fighter-bomber, the LWF program was rolled into a new Air Combat Fighter (ACF) competition in an announcement by U.S. Secretary of Defense James R. Schlesinger in April 1974. Schlesinger also made it clear that any ACF order would be in addition to the F-15, which extinguished opposition to the LWF.[24][25] ACF also raised the stakes for GD and Northrop because it brought in competitors intent on securing what was touted at the time as \"the arms deal of the century\".[26] These were Dassault-Breguet's proposed Mirage F1M-53, the SEPECAT Jaguar, and the proposed Saab 37E \"Eurofighter\". Northrop offered the P-530 Cobra, which was similar to the YF-17. The Jaguar and Cobra were dropped by the MFPG early on, leaving two European and the two U.S. candidates. On 11 September 1974, the U.S. Air Force confirmed plans to order the winning ACF design to equip five tactical fighter wings. Though computer modeling predicted a close contest, the YF-16 proved significantly quicker going from one maneuver to the next, and was the unanimous choice of those pilots that flew both aircraft.[27]",
			"color": "dark|0.25888 gray|0.25888 dark|0.25888 grey|0.25888 gray|0.24013 grey|0.24013 dim|0.14333 gray|0.14333 dim|0.14333 grey|0.14333 silver|0.10145 light|0.04652 gray|0.04652 light|0.04652 grey|0.04652 gainsboro|0.030601 slate|0.026645 gray|0.026645 light|0.021035 slate|0.021035 gray|0.021035 white|0.01419 smoke|0.01419 alice|0.012369 blue|0.012369 ghost|0.011912 white|0.011912 snow|0.011285 white|0.010695 mint|0.010529 cream|0.010529 azure|0.010456 sea|0.01014 shell|0.01014 floral|0.0090815 white|0.0090815 lavender|0.0074772 blush|0.0074772 light|0.0062206 steel|0.0062206 blue|0.0062206 dark|0.0033259 slate|0.0033259 gray|0.0033259  "
		}
	}
}
