{
	"add": {
		"doc": {
			"id": "7c73d5dc0e8672870bccf08630bcf45ebef18b07543f7b2a2e6cfbbf44ada900",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Diplodocus_longus_Chicago.jpg/220px-Diplodocus_longus_Chicago.jpg",
				"previous": "Diplodocus had an extremely long tail, composed of about 80 caudal vertebrae,[14] which is almost double the number some of the earlier sauropods had in their tails (such as Shunosaurus with 43), and far more than contemporaneous macronarians had (such as Camarasaurus with 53). There has been speculation as to whether it may have had a defensive[15] or noisemaking (by cracking it like a coachwhip) function.[16] The tail may have served as a counterbalance for the neck. The middle part of the tail had 'double beams' (oddly shaped chevron bones on the underside, which gave Diplodocus its name). They may have provided support for the vertebrae, or perhaps prevented the blood vessels from being crushed if the animal's heavy tail pressed against the ground. These 'double beams' are also seen in some related dinosaurs.[17]",
				"after": "No skull has ever been found that can be confidently said to belong to Diplodocus, though skulls of other diplodocids closely related to Diplodocus (such as Galeamopus) are well known. The skulls of diplodocids were very small compared with the size of these animals. Diplodocus had small, 'peg'-like teeth that pointed forward and were only present in the anterior sections of the jaws.[18] Its braincase was small. The neck was composed of at least fifteen vertebrae and may have been held parallel to the ground and unable to be elevated much past horizontal.[19]",
			"color": "dark|0.20251 gray|0.20251 dark|0.20251 grey|0.20251 gray|0.182 grey|0.182 dim|0.16416 gray|0.16416 dim|0.16416 grey|0.16416 silver|0.12816 light|0.082514 gray|0.082514 light|0.082514 grey|0.082514 gainsboro|0.060012 black|0.026616 light|0.026447 slate|0.026447 gray|0.026447 slate|0.02386 gray|0.02386 white|0.012225 smoke|0.012225 rosy|0.012145 brown|0.012145 linen|0.0086273 sea|0.0063803 shell|0.0063803 alice|0.0062217 blue|0.0062217 ghost|0.005646 white|0.005646 snow|0.0055629 lavender|0.0052923 light|0.0051186 steel|0.0051186 blue|0.0051186 lavender|0.0047539 blush|0.0047539  "
		}
	}
}
