{
	"add": {
		"doc": {
			"id": "7c8aef49dc1af2d98f887d8a85208a248cd899cb6544acbd576c34a572d61162",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Elogated_cent_assay_commission.jpg/220px-Elogated_cent_assay_commission.jpg",
				"previous": "In 1971, for the first time, the Assay Commission had no silver coins to test; none were struck by the Mint for circulation in 1970.[20] Although part-silver Kennedy half dollars were struck in 1970, they were only for collectors and were not put aside for assay. Commissioners could instead test 21,975 dimes and 11,098 quarters, all made from copper-nickel clad,[24] though as the Associated Press, reporting on the 1973 Assay Commission, put it, \"a discovery of a bum coin hasn't occurred in years.\"[32] Only one in every 100,000 clad or silver-clad pieces was put aside for the Assay Commission, and only one in every 200,000 dimes.[33] At the 1974 meeting, one copper-nickel Eisenhower dollar was discovered which weighed 15 grains (0.97 g) below specification; after reference to the rules, the coin was deemed barely within guidelines. Numismatist Charles Logan, in his 1979 article about the impending end of the Assay Commission, stated that this incident pointed out \"the basic problem with the annual trial. First, the members were not exactly sure how their job was done, or what the requirements were. Second, they really did not want to report a fault in the coinage. Finally, even if the one dollar coin had been found faulty, [it would have had] little consequence, except to prompt greater vigilance at the Mint.\"[34]",
				"after": "In early 1977, outgoing Mint Director Mary Brooks sent a list of 117 nominees to the new president, Jimmy Carter, from which it was expected that about two or three dozen names would be selected. Carter refused to make any public appointments, feeling the Assay Commission was unneeded given that the Mint performed the same work through routine internal checks and that the $2,500 appropriated each year was a poor use of taxpayer money. Only government members served on the Assay Commission in 1977–1980.[34][35] Even so, hundreds of numismatists applied to be on the 1978 commission. Carter made no appointments that year; the only members were those designated by statute.[36]",
			"color": "tan|0.15334 dark|0.13808 gray|0.13808 dark|0.13808 grey|0.13808 gray|0.090685 grey|0.090685 silver|0.087019 dim|0.072619 gray|0.072619 dim|0.072619 grey|0.072619 peach|0.050373 puff|0.050373 burly|0.048066 wood|0.048066 wheat|0.040314 antique|0.038924 white|0.038924 bisque|0.037921 light|0.036116 gray|0.036116 light|0.036116 grey|0.036116 blanched|0.026175 almond|0.026175 rosy|0.0246 brown|0.0246 navajo|0.021067 white|0.021067 papaya|0.020318 whip|0.020318 gainsboro|0.019758 moccasin|0.017829  "
		}
	}
}
