{
	"add": {
		"doc": {
			"id": "7c9c53d517a510446b8edfba2aaa97b85750c2d8378589767e84e6e138da3b1d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Continental_Airlines_B737-200_N7381F.jpg/220px-Continental_Airlines_B737-200_N7381F.jpg",
				"previous": "In the early 1960s Continental added flights from Los Angeles to Houston, both nonstop and 1- and 2-stop flights via Phoenix, Tucson, El Paso, Midland-Odessa, Austin, and San Antonio. In 1963 company headquarters moved from Denver to Los Angeles.[5][6][page needed] Total passenger-miles in 1967 were more than five times greater than in 1960, but 61% of the 1967 total was on unscheduled flights (mostly transpacific charters). During the late 1960s the company disposed of the last of its turboprop and piston-powered aircraft—one of the first U.S. airlines to do so.[6] Continental replaced the Viscount fleet with DC-9s and added Boeing 727s. The DC-9 and 727 were to become the workhorses of the fleet from the late 1960s.[6] The DC-9s were phased out by the late 1970s (although the type reappeared after mergers in the 1980s); Continental used the 727-200 as the mainstay of its narrow-body fleet until the late 1980s. In 1968 a new livery was launched: orange and gold cheatlines on a white fuselage; and a black \"jetstream\" logo (by Six's friend, the noted graphic designer Saul Bass) on the iconic \"Golden Tails\" of the airline's aircraft. The slogans adopted in 1968 and used for more than a decade were, \"The Airline That Pride Built\" and, \"The Proud Bird with the Golden Tail.\".[5][9] 1960s saw international routes awarded to Continental (to New Zealand and Australia) in the Transpacific Case, but these were cancelled by the Nixon Administration.",
				"after": "During the Vietnam War Continental provided extensive cargo and troop transportation for United States Army and Marine Corps forces to Asian and the Pacific bases. Continental's 707-324Cs were the most common non-military aircraft transiting Saigon Tan Son Nhat airport;[9] in 1967, 39% of CO's passenger-miles were on scheduled flights. With Continental's experience in Pacific operations, the carrier formed subsidiary Air Micronesia in May 1968, inaugurating island hopping routes between Yap/Saipan/Guam, Majuro, Rota, Truk, Ponape (Pohnpei) and Honolulu.[5] \"Air Mike\", as it was known, initially operated with Boeing 727–100 aircraft with open-ocean survival gear, doppler radar, and a large complement of spare parts (including tires).[5] A senior mechanic flew on every Air Mike flight until the late 1970s. Air Micronesia operated as subsidiary Continental Micronesia until 2010. In September 1969, Continental introduced service from Los Angeles to Honolulu/Hilo; in 1970 Continental was awarded routes from Seattle and Portland to San Jose, Hollywood-Burbank Airport, and Ontario, California—all of them growing airline markets. Nonstop San Francisco to Albuquerque and Dallas flights were added in the same year.[5]",
			"color": "black|0.30926 dim|0.21992 gray|0.21992 dim|0.21992 grey|0.21992 gray|0.091348 grey|0.091348 dark|0.077375 slate|0.077375 gray|0.077375 dark|0.036556 gray|0.036556 dark|0.036556 grey|0.036556 slate|0.019439 gray|0.019439 silver|0.018793 white|0.015705 smoke|0.015705 mint|0.01534 cream|0.01534 floral|0.015152 white|0.015152 light|0.014454 gray|0.014454 light|0.014454 grey|0.014454 sea|0.014127 shell|0.014127 linen|0.013353 gainsboro|0.013212 snow|0.011913 ivory|0.011752 honeydew|0.01159 white|0.011467 beige|0.011144 old|0.010712 lace|0.010712 azure|0.009926 light|0.0081151 slate|0.0081151 gray|0.0081151 ghost|0.0064873 white|0.0064873 alice|0.0061773 blue|0.0061773  "
		}
	}
}
