{
	"add": {
		"doc": {
			"id": "7cd50e2208b9d9611c0674a2c893c1fd2e30f316fdc7b3affb376dad0c1c7ab5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Westminster_emmeline_pankhurst_statue_1.jpg/220px-Westminster_emmeline_pankhurst_statue_1.jpg",
				"previous": "News of Emmeline Pankhurst's death was announced around the country, and extensively in North America. Her funeral service on 18 June was filled with her former WSPU colleagues and those who had worked beside her in various capacities. The Daily Mail described the procession as \"like a dead general in the midst of a mourning army.\"[122] Women wore WSPU sashes and ribbons, and the organisation's flag was carried alongside the Union Flag. Christabel and Sylvia appeared together at the service, the latter with her child. Adela did not attend.[123] Press coverage around the world recognised her tireless work on behalf of women's right to vote – even if they didn't agree on the value of her contributions. The New York Herald Tribune called her \"the most remarkable political and social agitator of the early part of the twentieth century and the supreme protagonist of the campaign for the electoral enfranchisement of women.\"[124]",
				"after": "Shortly after the funeral, one of Pankhurst's bodyguards from her WSPU days, Katherine Marshall, began raising funds for a memorial statue. In spring 1930 her efforts bore fruit, and on 6 March her statue in Victoria Tower Gardens was unveiled. A crowd of radicals, former suffragettes, and national dignitaries gathered as former Prime Minister Stanley Baldwin presented the memorial to the public. In his address, Baldwin declared: \"I say with no fear of contradiction, that whatever view posterity may take, Mrs. Pankhurst has won for herself a niche in the Temple of Fame which will last for all time.\"[126] Sylvia was the only Pankhurst daughter in attendance; Christabel, touring North America, sent a telegram which was read aloud. While planning the agenda for the day, Marshall had intentionally excluded Sylvia, who in her opinion had hastened Pankhurst's death.[127]",
			"color": "black|0.53474 dark|0.26969 gray|0.26969 dark|0.26969 grey|0.26969 gray|0.076431 grey|0.076431 dim|0.05423 gray|0.05423 dim|0.05423 grey|0.05423 silver|0.028936 tan|0.008891  "
		}
	}
}
