{
	"add": {
		"doc": {
			"id": "7cd5c15bc4f1161c2562641ad87b468960e041690992d72e9910682c1aa21f40",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/M_Reading_Detail.jpg/280px-M_Reading_Detail.jpg",
				"previous": "Van der Weyden often linked form and meaning, and in this fragment the semicircular outline of the Magdalene reinforces her quiet detachment from her surroundings.[9] She is seated on a red cushion and rests her back against a wooden sideboard. By her feet is her usual attribute of an alabaster jar; in the Gospels she brought spices to the tomb of Jesus.[12] The view through the window is of a distant canal, with an archer atop the garden wall and a figure walking on the other side of the water, whose reflection shows in the water.[13]",
				"after": "Van der Weyden's pose for the Magdalene is similar to a number of female religious figures painted by his master Robert Campin or his workshop.[14] It closely resembles, in theme and tone, the figure of Saint Barbara in Campin's Werl Altarpiece,[14] and also the Virgin in an Annunciation attributed to Campin in Brussels.[15] Typically for a van der Weyden, the Magdalen's face has an almost sculpted look, and the elements of her clothes are conveyed in minute detail. She wears a green robe; in medieval art the Magdalene is usually depicted naked (sometimes clad only in her long hair) or in richly coloured dress, typically red, blue or green, almost never in white.[16] Her robe is tightly pulled below her bust by a blue sash, while the gold brocade of her underskirt is adorned by a jewelled hem.[11] Art critic Charles Darwent observed that the Magdalen's past as a \"fallen woman\" is hinted at by the nap in the fur lining of her dress and the few strands of hair loose from her veil. Darwent wrote, \"Even her fingers, absent-mindedly circled, suggest completeness. In her mix of purity and eroticism, van der Weyden's Magdalen feels whole; but she isn't.\"[17] In the medieval period, fur symbolized female sexuality and was commonly associated with the Magdalene. Medieval historian Philip Crispin explains that artists such as Memling and Matsys often portrayed the Magdalen in furs and notes that she \"is noticeably dressed in fur-lined garments in The Magdalen Reading by Rogier van der Weyden\".[18]",
			"color": "tan|0.64543 wheat|0.23487  "
		}
	}
}
