{
	"add": {
		"doc": {
			"id": "7cd9aa11c8668eb491e4ae99c87299c240f8b4ca4dc0ce2785a0f6c4c1387b29",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Stand_up_scene_%288712578924%29.jpg/220px-Stand_up_scene_%288712578924%29.jpg",
				"previous": "Due to differences in state laws regarding the incorporation of communities, there is a great variation in the distribution and nature of unincorporated areas. Unincorporated regions are essentially nonexistent in seven of the northeastern states. All of the land in New Jersey, Pennsylvania, Connecticut, Massachusetts, and Rhode Island, and nearly all of the land in New Hampshire and Vermont, is part of an incorporated area of some type. In these areas, types (and official names) of local government entities can vary. In New England (which includes the last five of those seven states, plus the less fully incorporated state of Maine), local municipalities are known as towns, and are administered by a form of direct democracy, such as the open town meeting or representative town meeting. Larger towns in New England may be incorporated as cities, with some form of mayor-council government. In New Jersey multiple types exist as well, such as city, township, town, borough, or village, but these differences are in the structure of the legislative branches, not in the powers or functions of the entities themselves.",
				"after": "On the opposite end of the spectrum is the Virginia \"strong county\" model.[8] Virginia and other states with this model, such as Alabama, Maryland, and Tennessee, set strict requirements on incorporation or grant counties and townships broad powers that in other states are carried out by cities, creating a disincentive to incorporate, and thus have large, urbanized areas which have no municipal government below the county or township level.",
			"color": "dark|0.32826 slate|0.32826 gray|0.32826 slate|0.19187 gray|0.19187 light|0.1421 slate|0.1421 gray|0.1421 gray|0.04931 grey|0.04931 dim|0.045767 gray|0.045767 dim|0.045767 grey|0.045767 black|0.033688 white|0.020199 smoke|0.020199 mint|0.02 cream|0.02 azure|0.019865 white|0.019029 snow|0.018668 alice|0.01718 blue|0.01718 ghost|0.017114 white|0.017114 floral|0.015596 white|0.015596 sea|0.014221 shell|0.014221 light|0.0098869 cyan|0.0098869 ivory|0.0072931 dark|0.0066204 gray|0.0066204 dark|0.0066204 grey|0.0066204 linen|0.0055429  "
		}
	}
}
