{
	"add": {
		"doc": {
			"id": "7cec1b5c9b122d7a082543e8b95d8a1a33382d56ac15f72a9315353603fcd508",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Wodford_Lodge%2C_Chew_Valley_Lake.jpg/220px-Wodford_Lodge%2C_Chew_Valley_Lake.jpg",
				"previous": "It has two large landscaped picnic areas. Facilities include a tea shop, with indoor and outdoor seating areas with a view of the lake, and information centre. There are also a souvenir shop and small art gallery[3] and two nature trails. The Grebe Trail[4] is a hard-surfaced, all-weather path suitable for pedestrians, pushchairs and wheelchairs and covers a circuit 0.75 miles (1.2 km) long, starting and finishing at the wooded picnic area. The Bittern Trail[5] is reached from the Grebe Trail by the footbridge over Hollow Brook. The grassy path is often waterlogged in winter, but there is a boardwalk over a short section. This trail runs along the east shore, visits an open bird hide and returns to the footbridge, making a 1-mile (1.5-kilometre) circuit. Bristol Water imposes conditions on visitors, particularly related to the areas where dogs are allowed.",
			"after": [
				"Access to the waterside is restricted in places to reduce the disruption to wildlife. Paths around the lake are generally flat and, where paths are surfaced, wheelchair access is possible.",
				"Visitors are officially invited to use public transport, but overwhelmingly arrive by private car, encouraged by the provision of parking spaces. The \"Chew Valley Explorer\" bus route 672/674 provides access.[6]"
			],
			"color": "dark|0.39539 slate|0.39539 gray|0.39539 silver|0.12509 dark|0.11385 gray|0.11385 dark|0.11385 grey|0.11385 light|0.067088 gray|0.067088 light|0.067088 grey|0.067088 thistle|0.045038 gainsboro|0.041356 light|0.026109 steel|0.026109 blue|0.026109 lavender|0.025962 gray|0.02366 grey|0.02366 light|0.011187 slate|0.011187 gray|0.011187 dim|0.01067 gray|0.01067 dim|0.01067 grey|0.01067 lavender|0.010581 blush|0.010581 rosy|0.0095174 brown|0.0095174 misty|0.0087794 rose|0.0087794 white|0.0077598 smoke|0.0077598 ghost|0.0063921 white|0.0063921 linen|0.006271 slate|0.005794 gray|0.005794  "
		}
	}
}
