{
	"add": {
		"doc": {
			"id": "7cf1c22d16eb74b4ec8ab679261a1746ca57bb60eeedd2009d75f54196863474",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Dinorwig1.jpg/240px-Dinorwig1.jpg",
				"previous": "In 1843, the Padarn Railway become the first quarry railway to use steam locomotives, and the transport of slate by train rather than by ship was made easier when the London and North Western Railway built branches to connect Port Penrhyn and Port Dinorwic to the main line in 1852.[26] The Corris Railway opened as the horse-worked Corris, Machynlleth & River Dovey Tramroad in 1859, connecting the slate quarries around Corris and Aberllefenni with wharves on the estuary of the River Dyfi.[32] The Ffestiniog Railway converted to steam in 1863, and the Talyllyn Railway was opened in 1866 to serve the Bryn Eglwys quarry above the village of Abergynolwyn. Bryn Eglwys grew to be one of the largest quarries in mid Wales, employing 300 men and producing 30% of the total output of the Corris district.[33] The Cardigan Railway was opened in 1873, partly to carry slate traffic, and enabled the Glogue quarry in Pembrokeshire to grow to employ 80 men.[34]",
				"after": "Mechanization was gradually introduced to make most aspects of the industry more efficient, particularly at Blaenau Ffestiniog where the Ordovician slate was less brittle than the Cambrian slate further north, and therefore easier to work by machine. The slate mill evolved between 1840 and 1860, powered by a single line shaft running along the building and bringing together operations such as sawing, planing and dressing.[35] In 1859, J. W. Greaves invented the Greaves sawing table to produce blocks for the splitter, then in 1856 introduced a rotary machine to dress the split slate.[36] The splitting of the blocks to produce roofing slates proved resistant to mechanization, and continued to be done with a mallet and chisel. An extra source of income from the 1860s was the production of \"slab\", thicker pieces of slate which were planed and used for many purposes, for example flooring, tombstones and billiard tables.[2]",
			"color": "gray|0.24823 grey|0.24823 dim|0.21304 gray|0.21304 dim|0.21304 grey|0.21304 dark|0.17157 gray|0.17157 dark|0.17157 grey|0.17157 black|0.1067 silver|0.075388 light|0.041238 gray|0.041238 light|0.041238 grey|0.041238 gainsboro|0.029681 light|0.029232 slate|0.029232 gray|0.029232 slate|0.028709 gray|0.028709 white|0.0085842 smoke|0.0085842 ghost|0.0053537 white|0.0053537 alice|0.0052564 blue|0.0052564 snow|0.0051872 sea|0.0051581 shell|0.0051581 lavender|0.0050497 blush|0.0050497 white|0.0042322 linen|0.0039854 mint|0.003341 cream|0.003341 floral|0.0032774 white|0.0032774  "
		}
	}
}
