{
	"add": {
		"doc": {
			"id": "7cf6d105336ebc695ce467d1a666f54ec7b32f441bdbbb8190d781d892d64b5e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Tokugawa_Ieyasu2.JPG/170px-Tokugawa_Ieyasu2.JPG",
			"previous": [],
				"after": "Tokyo was originally a small fishing village named Edo,[8] in what was formerly part of the old Musashi Province.[21] Edo was first fortified by the Edo clan, in the late twelfth century. In 1457, Ōta Dōkan built Edo Castle. In 1590, Tokugawa Ieyasu made Edo his base and when he became shogun in 1603, the town became the center of his nationwide military government. During the subsequent Edo period, Edo grew into one of the largest cities in the world with a population topping one million by the 18th century.[22] Edo became the de facto capital of Japan[23] even while the emperor lived in Kyoto, the imperial capital. During this time, the city enjoyed a prolonged period of peace known as the Pax Tokugawa, and in the presence of such peace, Edo adopted a stringent policy of seclusion, which helped to perpetuate the lack of any serious military threat to the city.[24] The absence of war-inflicted devastation allowed Edo to devote the majority of its resources to rebuilding in the wake of the consistent fires, earthquakes, and other devastating natural disasters that plagued the city. However, this prolonged period of seclusion came to an end with the arrival of American Commodore, Matthew C. Perry in 1853. Commodore Perry negotiated the opening of the ports of Shimoda and Hakodate, leading to an increase in the demand for new foreign goods and subsequently a severe rise in inflation.[25] Social unrest mounted in the wake of these higher prices and culminated in wide spread rebellions and demonstrations, especially in the form of the \"smashing\" of rice establishments.[26] Meanwhile, supporters of the Meiji Emperor leveraged the disruption that these widespread rebellious demonstrations were causing to further consolidate power by overthrowing last Tokugawa shogun, Yoshinobu, in 1867.[27] After about 263 years, the Pax Tokugawa came to an end.",
			"color": "dark|0.44084 slate|0.44084 gray|0.44084 black|0.083598 dark|0.064965 gray|0.064965 dark|0.064965 grey|0.064965 dim|0.058143 gray|0.058143 dim|0.058143 grey|0.058143 rosy|0.046861 brown|0.046861 silver|0.040329 gray|0.035966 grey|0.035966 light|0.024536 gray|0.024536 light|0.024536 grey|0.024536 dark|0.022635 salmon|0.022635 light|0.014753 salmon|0.014753 gainsboro|0.014564 misty|0.013595 rose|0.013595  "
		}
	}
}
