{
	"add": {
		"doc": {
			"id": "7d09fa8d17f57a35f7209af9afdc4f42272b78c770092aae6b825e875d6c344b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Karp_Zolotaryov_Theotokos_Late_17th_century.jpg/170px-Karp_Zolotaryov_Theotokos_Late_17th_century.jpg",
				"previous": "In 1485 Ivan III commissioned the building of a royal Terem Palace within the Kremlin, with Aloisio da Milano being the architect of the first three floors. Aloisio da Milano, as well as the other Italian architects, also greatly contributed to the construction of the Kremlin walls and towers. The small banqueting hall of the Russian Tsars, called the Palace of Facets because of its facetted upper story, is the work of two Italians, Marco Ruffo and Pietro Solario, and shows a more Italian style. In 1505, an Italian known in Russia as Aleviz Novyi or Aleviz Fryazin arrived in Moscow. He may have been the Venetian sculptor, Alevisio Lamberti da Montagne. He built 12 churches for Ivan III, including the Cathedral of the Archangel, a building remarkable for the successful blending of Russian tradition, Orthodox requirements and Renaissance style. It is believed that the Cathedral of the Metropolitan Peter in Vysokopetrovsky Monastery, another work of Aleviz Novyi, later served as an inspiration for the so-called octagon-on-tetragon architectural form in the Moscow Baroque of the late 17th century.",
				"after": "Between the early 16th and the late 17th centuries, however, an original tradition of stone tented roof architecture had been developed in Russia. It was quite unique and different from the contemporary Renaissance architecture elsewhere in Europe, though some researches call that style 'Russian Gothic' and compare it with the European Gothic architecture of the earlier period. The Italians, with their advanced technology, may have influenced the invention of the stone tented roof (the wooden tents were known in Russia and Europe long before). According to one hypothesis, an Italian architect called Petrok Maly may have been an author of the Ascension Church in Kolomenskoye, one of the earliest and most prominent tented roof churches.[98]",
			"color": "black|0.58281 dim|0.068325 gray|0.068325 dim|0.068325 grey|0.068325 dark|0.045859 golden|0.045859 rod|0.045859 burly|0.036183 wood|0.036183 tan|0.031983 peru|0.025601 gray|0.023468 grey|0.023468 golden|0.020481 rod|0.020481 sienna|0.020147  "
		}
	}
}
