{
	"add": {
		"doc": {
			"id": "7d09201669f0d9282b4f5bc1fd4ed89951e1002dd52749db1c0862903f253f11",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Rochester_Castle%2C_Kent_-_geograph.org.uk_-_1582414.jpg/300px-Rochester_Castle%2C_Kent_-_geograph.org.uk_-_1582414.jpg",
			"previous": [],
				"after": "John died in 1216 and was succeeded by his nine-year-old son, Henry, with the support of the barons. With no prospect of becoming King of England, Louis returned to France. Rochester Castle was returned to royal control in 1217. Given the damage incurred during John's siege, the castle was in dire need of repairs. Between 1217 and 1237 around £680 were spent on repairs, of which £530 were taken up by work on the keep. In 1225 and 1226 the town walls were enhanced by the addition of a ditch at the cost of £300. The new ditch enclosed Boley Hill, possibly to deny the position to future aggressors who might attack the castle.[30] Repairs began with the castle's outer curtain wall. At the same time a chapel was built within the castle. In 1226 the hall, buttery, and dispensary were repaired. Work probably did not begin on the keep until 1226. It was mostly repaired by 1227, but work continued on it until 1232.[31] During 1230 and 1231 a stone wall dividing the castle's enclosure into two parts was built which no longer survives.[32] While attention was paid to making the castle a working fortification, Henry III also funded construction of residential and other buildings. In 1244, £132 was spent on building a second chapel next to the royal apartments. Stables and an almonry were added in 1248. The main gatehouse was rebuilt between 1249 and 1250 at a cost of over £120. Further repairs were carried out on the keep in 1256, this time costing more than £120. Later in the decade further attention was paid to the castle's defences, possibly in response to Henry III's worsening relations with his barons.[31]",
			"color": "black|0.51863 tan|0.23871 dim|0.065891 gray|0.065891 dim|0.065891 grey|0.065891 gray|0.044928 grey|0.044928  "
		}
	}
}
