{
	"add": {
		"doc": {
			"id": "7d1821b813dc0bcc43e877f3d0dc460e7f6504450934406c01b0901d35f72084",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/USS_Monitor_plans.jpg/220px-USS_Monitor_plans.jpg",
				"previous": "Another of Coles' designs, HMS Royal Sovereign, was completed in August 1864. Its existing broadside guns were replaced with four turrets on a flat deck and the ship was fitted with 5.5 inches (140 mm) of armour in a belt around the waterline.[2] Early ships like Monitor and the Royal Sovereign had little sea-keeping qualities being limited to coastal waters. Coles, in collaboration with Sir Edward James Reed, went on to design and build HMS Monarch, the first seagoing warship to carry her guns in turrets. Laid down in 1866 and completed in June 1869, it carried two turrets, although the inclusion of a forecastle and poop prevented the guns firing fore and aft.[2]",
				"after": "The gun turret was independently invented by the Swedish inventor John Ericsson in America, although his design was technologically inferior to Coles'.[3] Ericsson designed the USS 'Monitor in 1861. Its most prominent feature was a large cylindrical gun turret mounted amidships above the low-freeboard upper hull, also called the \"raft\". This extended well past the sides of the lower, more traditionally shaped hull. A small armored pilot house was fitted on the upper deck towards the bow, however, its position prevented Monitor from firing her guns straight forward.[4] [b] One of Ericsson's prime goals in designing the ship was to present the smallest possible target to enemy gunfire.[5]",
			"color": "antique|0.13349 white|0.13349 linen|0.10272 old|0.097458 lace|0.097458 beige|0.095553 sea|0.086957 shell|0.086957 floral|0.086514 white|0.086514 corn|0.086273 silk|0.086273 ivory|0.084229 papaya|0.077319 whip|0.077319 light|0.062429 yellow|0.062429 honeydew|0.027394 blanched|0.015595 almond|0.015595 silver|0.012146 light|0.010969 gray|0.010969 light|0.010969 grey|0.010969 mint|0.0079952 cream|0.0079952 gainsboro|0.0058279 dark|0.003577 gray|0.003577 dark|0.003577 grey|0.003577  "
		}
	}
}
