{
	"add": {
		"doc": {
			"id": "7d3c032ea96024c482485b251a773832b4e89b28ab6d3c7f561e1c0c0d02f86f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Fossilised_frog.jpg/220px-Fossilised_frog.jpg",
				"previous": "The origins and evolutionary relationships between the three main groups of amphibians are hotly debated. A molecular phylogeny based on rDNA analysis dating from 2005 suggests salamanders and caecilians are more closely related to each other than they are to frogs and the divergence of the three groups took place in the Paleozoic or early Mesozoic before the breakup of the supercontinent Pangaea and soon after their divergence from the lobe-finned fishes. This would help account for the relative scarcity of amphibian fossils from the period before the groups split.[14] Another molecular phylogenetic analysis conducted about the same time concluded the lissamphibians first appeared about 330 million years ago and that the temnospondyl-origin hypothesis is more credible than other theories. The neobatrachians seemed to have originated in Africa/India, the salamanders in East Asia and the caecilians in tropical Pangaea.[15] Other researchers, while agreeing with the main thrust of this study, questioned the choice of calibration points used to synchronise the data. They proposed that the date of lissamphibian diversification be put in the Permian, rather less than 300 million years ago, a date in better agreement with the palaeontological data.[16] A further study in 2011 using both extinct and living taxa sampled for morphological, as well as molecular data, came to the conclusion that Lissamphibia is monophyletic and that it should be nested within Lepospondyli rather than within Temnospondyli. The study postulated the Lissamphibia originated no earlier than the late Carboniferous, some 290 to 305 million years ago. The split between Anura and Caudata was estimated as taking place 292 million years ago, rather later than most molecular studies suggest, with the caecilians splitting off 239 million years ago.[17]",
				"after": "In 2008, Gerobatrachus hottoni, a temnospondyl with many frog- and salamander-like characteristics, was discovered in Texas. It dated back 290 million years and was hailed as a missing link, a stem batrachian close to the common ancestor of frogs and salamanders, consistent with the widely accepted hypothesis that frogs and salamanders are more closely related to each other (forming a clade called Batrachia) than they are to caecilians.[18][19] However, others have suggested that Gerobatrachus hottoni was only a dissorophoid temnospondyl unrelated to extant amphibians.[20] The earliest known salientians (see below), closer to the extant frogs than to the extant salamanders, are Triadobatrachus massinoti, from the Early Triassic of Madagascar (about 250 million years ago), and the fragmentary Czatkobatrachus polonicus from the Early Triassic of Poland (about the same age as Triadobatrachus).[21] The skull of Triadobatrachus is frog-like, being broad with large eye sockets, but the fossil has features diverging from modern frogs. These include a longer body with more vertebrae. The tail has separate vertebrae unlike the fused urostyle or coccyx found in modern frogs. The tibia and fibula bones are also separate, making it probable that Triadobatrachus was not an efficient leaper.[21]",
			"color": "tan|0.25405 wheat|0.12541 bisque|0.097777 blanched|0.090478 almond|0.090478 antique|0.075535 white|0.075535 papaya|0.069597 whip|0.069597 corn|0.037988 silk|0.037988 beige|0.035996 moccasin|0.034704 peach|0.031252 puff|0.031252 burly|0.025745 wood|0.025745 light|0.018356 golden|0.018356 rod|0.018356 yellow|0.018356 old|0.017352 lace|0.017352 light|0.015085 yellow|0.015085 lemon|0.013692 chiffon|0.013692 navajo|0.012666 white|0.012666 linen|0.011597 ivory|0.0058708 floral|0.004972 white|0.004972  "
		}
	}
}
