{
	"add": {
		"doc": {
			"id": "7d47c53941ac5d4474dd2d83a221c41c79ce1749657e807b3ecd24c59622368c",
			"url": "https://upload.wikimedia.org/math/c/4/d/c4d2ad7b8000ddf6fb8c6aab33301a56.png",
				"previous": "A way to ensure the existence of limits of certain infinite series is to restrict attention to spaces where any Cauchy sequence has a limit; such a vector space is called complete. Roughly, a vector space is complete provided that it contains all necessary limits. For example, the vector space of polynomials on the unit interval [0,1], equipped with the topology of uniform convergence is not complete because any continuous function on [0,1] can be uniformly approximated by a sequence of polynomials, by the Weierstrass approximation theorem.[51] In contrast, the space of all continuous functions on [0,1] with the same topology is complete.[52] A norm gives rise to a topology by defining that a sequence of vectors vn converges to v if and only if",
				"after": "Banach and Hilbert spaces are complete topological vector spaces whose topologies are given, respectively, by a norm and an inner product. Their study—a key piece of functional analysis—focusses on infinite-dimensional vector spaces, since all norms on finite-dimensional topological vector spaces give rise to the same notion of convergence.[53] The image at the right shows the equivalence of the 1-norm and ∞-norm on R2: as the unit \"balls\" enclose each other, a sequence converges to zero in one norm if and only if it so does in the other norm. In the infinite-dimensional case, however, there will generally be inequivalent topologies, which makes the study of topological vector spaces richer than that of vector spaces without additional data.",
			"color": "dim|0.37161 gray|0.37161 dim|0.37161 grey|0.37161 gray|0.25731 grey|0.25731 dark|0.17799 gray|0.17799 dark|0.17799 grey|0.17799 silver|0.097662 light|0.049498 gray|0.049498 light|0.049498 grey|0.049498 gainsboro|0.032917 white|0.0032825 smoke|0.0032825  "
		}
	}
}
