{
	"add": {
		"doc": {
			"id": "7d51666c2040c2e32b433944c213b517c14696ca316b52b89fa7e2f69c033c1c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Children_cheering_the_arrival_of_the_5th_Indian_Division_in_Singapore%2C_5_September_1945._SE4662.jpg/220px-Children_cheering_the_arrival_of_the_5th_Indian_Division_in_Singapore%2C_5_September_1945._SE4662.jpg",
				"previous": "During World War II, the Imperial Japanese Army invaded British Malaya, culminating in the Battle of Singapore. The British surrendered on 15 February 1942. British Prime Minister Winston Churchill called the defeat \"the worst disaster and largest capitulation in British history\".[21] Between 5,000 and 25,000 ethnic Chinese people were killed in the subsequent Sook Ching massacre.[22] From November 1944 to May 1945, the Allies conducted an intensive bombing of Singapore. The Japanese occupied Singapore until the British repossessed it in September 1945, after the Surrender of Japan.[23] David Marshall, pro-independence leader of the Labour Front, won Singapore's first general election in 1955. He led a delegation to London, but Britain rejected his demand for complete self-rule. He subsequently resigned to be replaced by Lim Yew Hock, whose policies convinced Britain to grant Singapore full internal self-government for all matters except defence and foreign affairs.[24]",
				"after": "During the May 1959 elections, the People's Action Party won a landslide victory. Singapore became an internally self-governing state within the Commonwealth and Lee Kuan Yew became the country's first Prime Minister.[25] Governor Sir William Allmond Codrington Goode served as the first Yang di-Pertuan Negara (Head of State), and was succeeded by Yusof bin Ishak, who became the first President of Singapore in 1965.[26] During the 1950s, Chinese Communists with strong ties to the trade unions and Chinese schools carried out an armed uprising against the government, leading to the Malayan Emergency and later, the Communist Insurgency War. The 1954 National Service Riots, Chinese middle schools riots, and Hock Lee bus riots in Singapore were all linked to these events.[27]",
			"color": " "
		}
	}
}
