{
	"add": {
		"doc": {
			"id": "7d74cf2ef1da7081e7ba1551941141ed61e3206ab40bc40c105cd85683476097",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/S%26s-vogue.jpg/170px-S%26s-vogue.jpg",
				"previous": "In 2003, Madonna fans were asked to vote for their Top 20 Madonna singles of all-time by Q-Magazine. \"Vogue\" was allocated the #14 spot. In 2007, VH1 ranked fifth the song on its list of \"Greatest Songs of the 90s\".[16] Slant Magazine listed \"Vogue\" as tenth \"Best Singles of the '90s\"[17] as well as third in their list of the \"100 Greatest Dance Songs\".[18] \"Vogue\", on addition, has received numerous accolades. It won the 1991 Juno Award for Best Selling International Single,[19] as well as winning the American Music Award for Favourite Dance Single. The song, based on the 1990 Rolling Stone Reader's Poll Awards, was voted Best single.[20] The song was also ranked as the fourth best song of 1990 on that year's Pazz & Jop poll by The Village Voice.[21]",
			"after": [
				".",
				"After its release, \"Vogue\" reached number one in over 30 countries worldwide, becoming Madonna's biggest hit at that time.[22][23] It was also the best-selling single of 1990 with sales of more than two million,[24] and has sold more than six million copies worldwide to date.[25] In the U.S., massive airplay and sales demand in response to the popular music video in April 1990 made way for \"Vogue\"'s number 39 debut in the week of April 14. The song shot to number one on the Billboard Hot 100 in its sixth week on the chart, displacing Sinéad O'Connor's four-week run in the top spot with \"Nothing Compares 2 U\". The song also reached number one on the Hot Dance Club Play chart, remaining there for two weeks. On June 28, 1990, \"Vogue\" was certified double platinum by the Recording Industry Association of America (RIAA) for sales of two million copies of the physical single across United States.[26] To date, it remains Madonna's best-selling physical single in the country. After digital sales began in 2005, \"Vogue\" has sold additional 311,000 digital downloads, according to Nielsen SoundScan.[27]"
			],
			"color": "dark|0.1985 magenta|0.1985 purple|0.19476 sienna|0.1025 dark|0.088514 salmon|0.088514 violet|0.055056 magenta|0.025468 fuchsia|0.025468 indian|0.019975 red|0.019975 medium|0.019226 violet|0.019226 red|0.019226 lavender|0.017329  "
		}
	}
}
