{
	"add": {
		"doc": {
			"id": "7d77ba38e91544365990ccabdf8705030548f9e2413e2f991e4521da19a9d610",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/PoliticalJustice3.png/220px-PoliticalJustice3.png",
				"previous": "Godwin took individualism to the radical extent of opposing individuals performing together in orchestras, writing in Political Justice that \"everything understood by the term co-operation is in some sense an evil.\"[40] The only apparent exception to this opposition to cooperation is the spontaneous association that may arise when a society is threatened by violent force. One reason he opposed cooperation is he believed it to interfere with an individual's ability to be benevolent for the greater good. Godwin opposes the idea of government, but wrote that a minimal state as a present \"necessary evil\"[43] that would become increasingly irrelevant and powerless by the gradual spread of knowledge.[4] He expressly opposed democracy, fearing oppression of the individual by the majority, though he believed it to be preferable to dictatorship.",
				"after": "Godwin supported individual ownership of property, defining it as \"the empire to which every man is entitled over the produce of his own industry.\"[43] However, he also advocated that individuals give to each other their surplus property on the occasion that others have a need for it, without involving trade (e.g. gift economy). Thus, while people have the right to private property, they should give it away as enlightened altruists. This was to be based on utilitarian principles; he said: \"Every man has a right to that, the exclusive possession of which being awarded to him, a greater sum of benefit or pleasure will result than could have arisen from its being otherwise appropriated.\"[43] However, benevolence was not to be enforced, being a matter of free individual \"private judgement.\" He did not advocate a community of goods or assert collective ownership as is embraced in communism, but his belief that individuals ought to share with those in need was influential on the later development of anarchist communism.",
			"color": "gray|0.32088 grey|0.32088 dark|0.28032 gray|0.28032 dark|0.28032 grey|0.28032 dim|0.26506 gray|0.26506 dim|0.26506 grey|0.26506 silver|0.08929 light|0.02838 gray|0.02838 light|0.02838 grey|0.02838 gainsboro|0.011513  "
		}
	}
}
