{
	"add": {
		"doc": {
			"id": "7d7fe071df28980821881777e25b9a979c0590f8be89f6e44b8754709fff3ecd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Goldmantelziesel.jpg/133px-Goldmantelziesel.jpg",
			"previous": [],
				"after": "Rodents are mammals of the order Rodentia, characterized by two pairs of continuously growing incisors, one pair in the upper and and one in the lower jaw. About forty percent of all mammal species are rodents, and they are found in vast numbers on all continents except Antarctica. They are the most diversified mammalian order, including mice, rats, squirrels, prairie dogs, porcupines, beavers, guinea pigs, and hamsters, and can be found in a variety of habitats, including manmade environments. There are arboreal, burrowing, and semi-aquatic species. While the largest species, the capybara, can weigh as much as 66 kg (146 lb), most rodents weigh less than 100 g (3.5 oz) and have robust bodies, short limbs and long tails. They use their sharp incisors to gnaw food, defend themselves, and shape their habitat. Most eat seeds or other plant material. Many species live in societies with complex forms of communication. Rodents can be monogamous, polygynous, or promiscuous. The rodent fossil record dates back to the Paleocene on the supercontinent of Laurasia. (Full article...)",
			"color": "dark|0.19777 gray|0.19777 dark|0.19777 grey|0.19777 silver|0.1241 gray|0.089924 grey|0.089924 light|0.080036 gray|0.080036 light|0.080036 grey|0.080036 gainsboro|0.064019 dim|0.060382 gray|0.060382 dim|0.060382 grey|0.060382 tan|0.038485 white|0.030396 smoke|0.030396 linen|0.025856 sea|0.024441 shell|0.024441 snow|0.022061 ghost|0.019393 white|0.019393 floral|0.019149 white|0.019149 white|0.017949 alice|0.017852 blue|0.017852 mint|0.016991 cream|0.016991 lavender|0.016601 blush|0.016601 azure|0.012597 antique|0.011623 white|0.011623 old|0.011441 lace|0.011441 lavender|0.0096743 misty|0.0090405 rose|0.0090405 saddle|0.0086207 brown|0.0086207 ivory|0.0076222 black|0.0064487  "
		}
	}
}
