{
	"add": {
		"doc": {
			"id": "7d822ed5d8aa31a202d7b3876f2c29506a84763520f12ac3274c829e9d063668",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Aachener_dom_oktagon.jpg/220px-Aachener_dom_oktagon.jpg",
				"previous": "The Carolingian dynasty, as the successors to Charles Martel are known, officially took control of the kingdoms of Austrasia and Neustria in a coup of 753 led by Pippin III (r. 752–768). A contemporary chronicle claims that Pippin sought, and gained, authority for this coup from Pope Stephen II (pope 752–757). Pippin's takeover was reinforced with propaganda that portrayed the Merovingians as inept or cruel rulers, exalted the accomplishments of Charles Martel, and circulated stories of the family's great piety. At the time of his death in 768, Pippin left his kingdom in the hands of his two sons, Charles (r. 768–814) and Carloman (r. 768–771). When Carloman died of natural causes, Charles blocked the succession of Carloman's young son and installed himself as the king of the united Austrasia and Neustria. Charles, more often known as Charles the Great or Charlemagne, embarked upon a programme of systematic expansion in 774 that unified a large portion of Europe, eventually controlling modern-day France, northern Italy, and Saxony. In the wars that lasted beyond 800, he rewarded allies with war booty and command over parcels of land.[96] In 774, Charlemagne conquered the Lombards, which freed the papacy from the fear of Lombard conquest and marked the beginnings of the Papal States.[97][L]",
				"after": "The coronation of Charlemagne as emperor on Christmas Day 800 is regarded as a turning point in medieval history, marking a return of the Western Roman Empire, since the new emperor ruled over much of the area previously controlled by the western emperors.[100] It also marks a change in Charlemagne's relationship with the Byzantine Empire, as the assumption of the imperial title by the Carolingians asserted their equivalence to the Byzantine state.[101] There were several differences between the newly established Carolingian Empire and both the older Western Roman Empire and the concurrent Byzantine Empire. The Frankish lands were rural in character, with only a few small cities. Most of the people were peasants settled on small farms. Little trade existed and much of that was with the British Isles and Scandinavia, in contrast to the older Roman Empire with its trading networks centred on the Mediterranean.[100] The empire was administered by an itinerant court that travelled with the emperor, as well as approximately 300 imperial officials called counts, who administered the counties the empire had been divided into. Clergy and local bishops served as officials, as well as the imperial officials called missi dominici, who served as roving inspectors and troubleshooters.[102]",
			"color": "rosy|0.13425 brown|0.13425 tan|0.13213 burly|0.087351 wood|0.087351 saddle|0.058504 brown|0.058504 dark|0.038822 golden|0.038822 rod|0.038822 thistle|0.023551 white|0.022591 smoke|0.022591 snow|0.021365 ghost|0.02135 white|0.02135 alice|0.020501 blue|0.020501 white|0.020464 sea|0.020186 shell|0.020186 pale|0.019732 golden|0.019732 rod|0.019732 floral|0.019585 white|0.019585 lavender|0.019435 blush|0.019435 mint|0.019282 cream|0.019282 lavender|0.018635 khaki|0.017782 azure|0.017711  "
		}
	}
}
