{
	"add": {
		"doc": {
			"id": "7d8e772bf9f31a02cb9466b10f1dd67b42bc9d92e67dbac616d3935bfdca1f36",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/1/13/Macintosh_System_7.5.3_screenshot.png/220px-Macintosh_System_7.5.3_screenshot.png",
				"previous": "It wasn't long until Apple released their first portable computers, beginning with the Macintosh Portable released in 1989. Although due to considerable design issues, it was soon replaced in 1991 with the first of the PowerBook line: the PowerBook 100, a miniaturized Portable; the 16 MHz 68030 PowerBook 140; and the 25 MHz 68030 PowerBook 170.[73] They were the first portable computers with the keyboard behind a palm rest and a built-in pointing device (a trackball) in front of the keyboard.[74] The 1993 PowerBook 165c was Apple's first portable computer to feature a color screen, displaying 256 colors with 640 x 400-pixel resolution.[75] The second generation of PowerBooks, the 68040-equipped 500 series, introduced trackpads, integrated stereo speakers, and built-in Ethernet to the laptop form factor in 1994.[76]",
				"after": "As for Mac OS, System 7 was a 32-bit rewrite from Pascal to C++ that introduced virtual memory and improved the handling of color graphics, as well as memory addressing, networking, and co-operative multitasking. Also during this time, the Macintosh began to shed the \"Snow White\" design language, along with the expensive consulting fees they were paying to Frogdesign. Apple instead brought the design work in-house by establishing the Apple Industrial Design Group, becoming responsible for crafting a new look for all Apple products.[77]",
			"color": "white|0.079598 smoke|0.079598 alice|0.074582 blue|0.074582 ghost|0.074564 white|0.074564 sea|0.073692 shell|0.073692 snow|0.073642 white|0.07255 mint|0.071187 cream|0.071187 lavender|0.070596 blush|0.070596 floral|0.069275 white|0.069275 azure|0.067235 dark|0.065617 gray|0.065617 dark|0.065617 grey|0.065617 silver|0.062002 light|0.049818 gray|0.049818 light|0.049818 grey|0.049818 gainsboro|0.039563 gray|0.018776 grey|0.018776 light|0.0082167 steel|0.0082167 blue|0.0082167 lavender|0.0078861 linen|0.0077801 dim|0.0049656 gray|0.0049656 dim|0.0049656 grey|0.0049656 ivory|0.003548  "
		}
	}
}
