{
	"add": {
		"doc": {
			"id": "7d8e528d0ade85436f572089d4283160206be4906a276446bdb5694ddbfdf494",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Dunvegan_Castle3.jpg/220px-Dunvegan_Castle3.jpg",
			"previous": [
				"Of the island in general, Johnson observed:",
				"After the failure of the Jacobite rebellion of 1745, Flora MacDonald became famous for rescuing Prince Charles Edward Stuart from the Hanoverian troops. Although she was born on South Uist her story is strongly associated with their escape via Skye and she is buried at Kilmuir in Trotternish.[59] Samuel Johnson and James Boswell's visit to Skye in 1773 and their meeting with Flora MacDonald in Kilmuir is recorded in Boswell's The Journal of a Tour to the Hebrides. Boswell wrote, \"To see Dr. Samuel Johnson, the great champion of the English Tories, salute Miss Flora MacDonald in the isle of Sky, [sic] was a striking sight; for though somewhat congenial in their notions, it was very improbable they should meet here\".[60] Johnson's words that Flora MacDonald was \"A name that will be mentioned in history, and if courage and fidelity be virtues, mentioned with honour\" are written on her gravestone.[61] After this rebellion the clan system was broken up and Skye became a series of landed estates.[62]"
			],
				"after": "Skye has a rich heritage of ancient monuments from this period. Dunvegan Castle has been the seat of Clan MacLeod since the 13th century. It contains the Fairy Flag and is reputed to have been inhabited by a single family for longer than any other house in Scotland.[64] The 18th-century Armadale Castle, once home of Clan Donald of Sleat, was abandoned as a residence in 1925 but now hosts the Clan Donald Centre.[65] Nearby are the ruins of two more MacDonald strongholds, Knock Castle, and Dunscaith Castle, the legendary home of warrior woman, martial arts instructor (and, according to some sources, Queen) Scáthach.[16][66] Caisteal Maol, built in the late 15th century near Kyleakin and once a seat of Clan MacKinnon, is another ruin.[47]",
			"color": "black|0.3766 dim|0.2084 gray|0.2084 dim|0.2084 grey|0.2084 dark|0.19698 olive|0.19698 green|0.19698 gray|0.094039 grey|0.094039 slate|0.058516 gray|0.058516 light|0.047098 slate|0.047098 gray|0.047098  "
		}
	}
}
