{
	"add": {
		"doc": {
			"id": "7d8fe1b95c2011fd3e2cce5fbbd1277b6f252c83cc8171b2ad76bb18416b009b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Image-Secundra_Bagh_after_Indian_Mutiny_higher_res.jpg/220px-Image-Secundra_Bagh_after_Indian_Mutiny_higher_res.jpg",
				"previous": "Little is certain about Felice Beato's early development as a photographer, though it is said that he bought his first and only lens in Paris in 1851.[7] He probably met the British photographer James Robertson in Malta in 1850 and accompanied him to Constantinople in 1851. James Robertson (1813–88), became his brother-in-law in 1855. Superintendent of the Imperial Mint, Robertson opened one of the first commercial photography studios in the capital between 1854 and 1856. Robertson had been an engraver at the Imperial Ottoman Mint since 1843 and had probably taken up photography in the 1840s.[8] In 1853 the two began photographing together and they formed a partnership called \"Robertson & Beato\" either in that year or in 1854, when Robertson opened a photographic studio in Pera, Constantinople. Robertson and Beato were joined by Beato's brother Antonio on photographic expeditions to Malta in 1854 or 1856 and to Greece and Jerusalem in 1857. A number of the firm's photographs produced in the 1850s are signed \"Robertson, Beato and Co.\", and it is believed that the \"and Co.\" refers to Antonio.[9]",
				"after": "In late 1854 or early 1855 James Robertson married Beato's sister, Leonilda Maria Matilda Beato. They had three daughters, Catherine Grace (b. 1856), Edith Marcon Vergence (b. 1859), and Helen Beatruc (b. 1861).[7]",
			"color": "dim|0.29234 gray|0.29234 dim|0.29234 grey|0.29234 gray|0.23523 grey|0.23523 dark|0.1541 gray|0.1541 dark|0.1541 grey|0.1541 black|0.12764 silver|0.058667 antique|0.023273 white|0.023273 light|0.022807 gray|0.022807 light|0.022807 grey|0.022807 gainsboro|0.011734 papaya|0.0096668 whip|0.0096668 blanched|0.0084822 almond|0.0084822 beige|0.0081987 linen|0.0077812 old|0.0070359 lace|0.0070359  "
		}
	}
}
