{
	"add": {
		"doc": {
			"id": "7d9261ab657e519bafbb05c550c78eeea8170f2d6e8c16363a2ab22edbf1589e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Planche_Lactuca_sativa.jpg/220px-Planche_Lactuca_sativa.jpg",
				"previous": "A hardy annual, some varieties of lettuce can be overwintered even in relatively cold climates under a layer of straw, and older, heirloom varieties are often grown in cold frames.[25] Lettuces meant for the cutting of individual leaves are generally planted straight into the garden in thick rows. Heading varieties of lettuces are commonly started in flats, then transplanted to individual spots, usually 8 to 14 inches (20 to 36 cm) apart, in the garden after developing several leaves. Lettuce spaced further apart receives more sunlight, which improves color and nutrient quantities in the leaves. Pale to white lettuce, such as the centers in some iceberg lettuce, contain few nutrients.[17]",
				"after": "Lettuce grows best in full sun in loose, nitrogen-rich soils with a pH of between 6.0 and 6.8. Heat generally prompts lettuce to bolt, with most varieties growing poorly above 75 °F (24 °C); cool temperatures prompt better performance, with 60 to 65 °F (16 to 18 °C) being preferred and as low as 45 °F (7 °C) being tolerated. Plants in hot areas that are provided partial shade during the hottest part of the day will bolt more slowly. Temperatures above 80 °F (27 °C) will generally result in poor or non-existent germination of lettuce seeds.[30] After harvest, lettuce lasts the longest when kept at 32 °F (0 °C) and 96 percent humidity. Lettuce quickly degrades when stored with fruit such as apples, pears and bananas that release the ripening agent ethylene gas. The high water content of lettuce (94.9 percent) creates problems when attempting to preserve the plant – it cannot be successfully frozen, canned or dried and must be eaten fresh.[31]",
			"color": "antique|0.13107 white|0.13107 dark|0.12032 olive|0.12032 green|0.12032 light|0.095979 gray|0.095979 light|0.095979 grey|0.095979 silver|0.077621  "
		}
	}
}
