{
	"add": {
		"doc": {
			"id": "7da5290ad484d304267c0bcb6db8d8d753028970997e79df3285a240dc55c289",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/West_Point_Cemetery.JPG/220px-West_Point_Cemetery.JPG",
				"previous": "The academy grounds are home to numerous monuments and statues. The central cadet parade ground, the Plain, hosts the largest number, and includes the Washington Monument, Thayer Monument, Eisenhower Monument, MacArthur Monument, Kosciuszko Monument, and Sedgwick Monument. Patton Monument was first dedicated in front of the cadet library in 1950,[90] but in 2004 it was placed in storage to make room for the construction of Jefferson Hall. With the completion of Jefferson Hall, Patton's statue was relocated and unveiled at a temporary location on 15 May 2009, where it will remain until the completion of the renovation of the old cadet library and Bartlett Hall.[91] There is also a statue commemorating brotherhood and friendship from the École Polytechnique in the cadet central area just outside Nininger Hall. The remaining campus area is home to 27 other monuments and memorials.[92]",
				"after": "The West Point Cemetery is the final resting place of many notable graduates and faculty, including George Armstrong Custer, Winfield Scott, William Westmoreland, Earl Blaik, Maggie Dixon, and sixteen Medal of Honor recipients.[93][94] The cemetery is also the burial place of several recent graduates who have died during the ongoing conflict in Iraq and Afghanistan. Many of the older grave sites have large and ornate grave markers, the largest belonging to Egbert Viele (class of 1847), chief engineer of Brooklyn's Prospect Park.[93] The cemetery is also home to a monument to Revolutionary War heroine Margaret Corbin.[95]",
			"color": "dark|0.20332 gray|0.20332 dark|0.20332 grey|0.20332 dim|0.17763 gray|0.17763 dim|0.17763 grey|0.17763 gray|0.17319 grey|0.17319 silver|0.12075 light|0.065647 gray|0.065647 light|0.065647 grey|0.065647 gainsboro|0.04804 light|0.033892 steel|0.033892 blue|0.033892 light|0.022541 slate|0.022541 gray|0.022541 slate|0.020457 gray|0.020457 white|0.014646 smoke|0.014646 lavender|0.014583 black|0.010873 ghost|0.0099552 white|0.0099552 alice|0.0097674 blue|0.0097674 snow|0.0095144 sea|0.0092687 shell|0.0092687 lavender|0.0089022 blush|0.0089022 linen|0.008336 white|0.0073891 floral|0.0064649 white|0.0064649 mint|0.0060875 cream|0.0060875 azure|0.0046125  "
		}
	}
}
