{
	"add": {
		"doc": {
			"id": "7daa918023b63bcba485c6aba7dbd63927e0d20a2ccef6230a1c52864e4be14a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Man_examining_fan_of_Langley_Research_Center_16_foot_transonic_wind_tunnel.jpg/250px-Man_examining_fan_of_Langley_Research_Center_16_foot_transonic_wind_tunnel.jpg",
				"previous": "There are many applications for boundary layer wind tunnel modeling. For example, understanding the impact of wind on high-rise buildings, factories, bridges, etc. can help building designers construct a structure that stands up to wind effects in the most efficient manner possible. Another significant application for boundary layer wind tunnel modeling is for understanding exhaust gas dispersion patterns for hospitals, laboratories, and other emitting sources. Other examples of boundary layer wind tunnel applications are assessments of pedestrian comfort and snow drifting. Wind tunnel modeling is accepted as a method for aiding in Green building design. For instance, the use of boundary layer wind tunnel modeling can be used as a credit for Leadership in Energy and Environmental Design (LEED) certification through the U.S. Green Building Council.",
				"after": "Wind tunnel tests in a boundary layer wind tunnel allow for the natural drag of the Earth's surface to be simulated. For accuracy, it is important to simulate the mean wind speed profile and turbulence effects within the atmospheric boundary layer. Most codes and standards recognize that wind tunnel testing can produce reliable information for designers, especially when their projects are in complex terrain or on exposed sites.",
			"color": "black|0.4132 saddle|0.12934 brown|0.12934 peru|0.043415 gray|0.030486 grey|0.030486 dim|0.028568 gray|0.028568 dim|0.028568 grey|0.028568 light|0.026824 gray|0.026824 light|0.026824 grey|0.026824 tan|0.023764 gainsboro|0.022827 dark|0.021072 gray|0.021072 dark|0.021072 grey|0.021072 silver|0.020205 sienna|0.017408 linen|0.014991 sea|0.013507 shell|0.013507 white|0.012476 smoke|0.012476 burly|0.011985 wood|0.011985 misty|0.011898 rose|0.011898 antique|0.01165 white|0.01165 rosy|0.011443 brown|0.011443  "
		}
	}
}
