{
	"add": {
		"doc": {
			"id": "7dbc03d3887529b252750eabc564e81e1c31bea6029e3128b8d0deed76b3593c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Pluto_Earth_Moon_Comparison.png/250px-Pluto_Earth_Moon_Comparison.png",
				"previous": "Observations by the Hubble Space Telescope place Pluto's density at between 1.8 and 2.1 g/cm3, suggesting its internal composition consists of roughly 50–70 percent rock and 30–50 percent ice by mass.[84] Because the decay of radioactive elements would eventually heat the ices enough for the rock to separate from them, scientists expect that Pluto's internal structure is differentiated, with the rocky material having settled into a dense core surrounded by a mantle of ice. The diameter of the core is hypothesized to be approximately 7006170000000000000♠1700 km, 70% of Pluto's diameter.[83] It is possible that such heating continues today, creating a subsurface ocean layer of liquid water some 100 to 180 km thick at the core–mantle boundary.[83][85] The DLR Institute of Planetary Research calculated that Pluto's density-to-radius ratio lies in a transition zone, along with Neptune's moon Triton, between icy satellites like the mid-sized moons of Uranus and Saturn, and rocky satellites such as Jupiter's Io.[86]",
				"after": "Pluto's mass is 1.31×1022 kg, less than 0.24 percent that of Earth,[87] and its diameter is 7006230600000000000♠2306±20 km, or roughly 66% that of the Moon.[9] Its surface area (7013166500000000000♠1.665×107 km2) is about 10% smaller than that of South America. Pluto's atmosphere complicates determining its true solid size within a certain margin.[8] Pluto's albedo varies from 0.49–0.66.",
			"color": "dark|0.23009 gray|0.23009 dark|0.23009 grey|0.23009 gray|0.19653 grey|0.19653 dim|0.1901 gray|0.1901 dim|0.1901 grey|0.1901 silver|0.086593 slate|0.075024 gray|0.075024 black|0.068387 light|0.062745 slate|0.062745 gray|0.062745 light|0.031978 gray|0.031978 light|0.031978 grey|0.031978 rosy|0.022816 brown|0.022816 gainsboro|0.013201  "
		}
	}
}
