{
	"add": {
		"doc": {
			"id": "7dc80f70340b363b99d65a6a3596a29204d4bd1335517ef16cc46668d9bf0af2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/1776_Washington_Before_Boston_Comitia_Americana_Second_Restrike_%28Baker-48G%29_%28obv%29.jpg/220px-1776_Washington_Before_Boston_Comitia_Americana_Second_Restrike_%28Baker-48G%29_%28obv%29.jpg",
				"previous": "The reverse is based on an early sketch of the statue of Lafayette by Bartlett. It depicts a mounted statue of Lafayette, riding left. His horse has two feet up, which, by some accounts, in art means Lafayette died on the battlefield, which he did not—one hoof up would mean a battlefield wound, and all four feet on the ground means the subject died a natural death. Barber's monogram does not appear on the coin, but the name \"Bartlett\" appears on the base of the statue. Also on the base, and extending below it, is a palm branch. The reverse inscription, \"Erected by the youth of the United States in honor of Gen. Lafayette/Paris 1900\" is a tribute to the school fundraising efforts that took place in 1898. Swiatek and Breen pointed out that even if one grants that the 1900 date was intended to be that of the exposition and the erection of the statue, the coins would still violate the 1873 act, that required the date of mintage to appear on the coins, and thus \"the Lafayette dollars are technically undated and therefore illegal!\"[23][24]",
				"after": "On the reverse, Lafayette holds a sword, extended upwards.[24] Bartlett described the version of the statue that Barber worked from: \"Lafayette is represented in the statue as a fact and a symbol, offering his sword and services to the American colonists in the cause of liberty. He appears as the emblem of the aristocratic and enthusiastic sympathy shown by France to our forefathers.\"[25] Swiatek and Breen noted, \"We may take Lafayette's pose on the statue, as depicted on the coin, to represent him in triumphal procession rather than charging against the enemy—note his sheathed sword, like a Highland pipe major's baton, serving as a standard rather than brandished unsheathed as a weapon.\"[22]",
			"color": "dark|0.46524 gray|0.46524 dark|0.46524 grey|0.46524 gray|0.19799 grey|0.19799 dim|0.18102 gray|0.18102 dim|0.18102 grey|0.18102 silver|0.088947 black|0.053602 light|0.010169 gray|0.010169 light|0.010169 grey|0.010169  "
		}
	}
}
