{
	"add": {
		"doc": {
			"id": "7dcb7565065e549ca082359b365d362a28ab97a6f9d4fa1576fc95b75dd0b6a4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/SmithsonianCastel_07120014.jpg/220px-SmithsonianCastel_07120014.jpg",
				"previous": "The National Archives houses thousands of documents important to American history including the Declaration of Independence, the United States Constitution, and the Bill of Rights.[126] Located in three buildings on Capitol Hill, the Library of Congress is the largest library complex in the world with a collection of over 147 million books, manuscripts, and other materials.[127] The United States Supreme Court Building was completed in 1935; before then, the court held sessions in the Old Senate Chamber of the Capitol.[128]",
				"after": "The Smithsonian Institution is an educational foundation chartered by Congress in 1846 that maintains most of the nation's official museums and galleries in Washington, D.C. The U.S. government partially funds the Smithsonian and its collections open to the public free of charge.[129] The Smithsonian's locations had a combined total of 30 million visits in 2013. The most visited museum is the National Museum of Natural History on the National Mall.[130] Other Smithsonian Institution museums and galleries on the mall are: the National Air and Space Museum; the National Museum of African Art; the National Museum of American History; the National Museum of the American Indian; the Sackler and Freer galleries, which both focus on Asian art and culture; the Hirshhorn Museum and Sculpture Garden; the Arts and Industries Building; the S. Dillon Ripley Center; and the Smithsonian Institution Building (also known as \"The Castle\"), which serves as the institution's headquarters.[131]",
			"color": "black|0.42592 sienna|0.1247 dark|0.062159 olive|0.062159 green|0.062159 dim|0.060394 gray|0.060394 dim|0.060394 grey|0.060394 dark|0.041459 slate|0.041459 gray|0.041459 peach|0.041456 puff|0.041456 gray|0.038103 grey|0.038103 tan|0.023771 saddle|0.023161 brown|0.023161 dark|0.017299 gray|0.017299 dark|0.017299 grey|0.017299 dark|0.015985 salmon|0.015985 slate|0.012174 gray|0.012174 bisque|0.0112 peru|0.0099051 burly|0.0096006 wood|0.0096006 light|0.0095542 slate|0.0095542 gray|0.0095542  "
		}
	}
}
