{
	"add": {
		"doc": {
			"id": "7dd6c26db15b1e66f886ac610f6b946b2583448f1e8e2074e81ba09d19f0f4f5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/USA%2C_1850_-LARGE_CENT_a_-_Flickr_-_woody1778a_edit.jpg/220px-USA%2C_1850_-LARGE_CENT_a_-_Flickr_-_woody1778a_edit.jpg",
				"previous": "By 1853, silver was overvalued with respect to gold. This was due to large discoveries of gold, especially in California, and silver was heavily exported. To correct this situation, Secretary of the Treasury Thomas Corwin advocated reducing the precious-metal content of most silver coins to prevent their export. The opposition to the bill was led by Tennessee Representative Andrew Johnson, who believed that Congress had no authority to alter the gold/silver price ratio and, if it did, it should not exercise it. Nevertheless, Congress passed the bill, which became law on February 21, 1853.[4] That bill also authorized a three-dollar gold coin; according to numismatic writer Don Taxay, provision for it had been inserted at the behest of gold interests.[5]",
				"after": "According to Breen, Congress believed the new coin \"would be convenient for exchange for rolls or small bags of silver 3¢ pieces, and for buying sheets of 3¢ stamps—always bypassing use of copper cents\".[2] In 1889, then-Mint Director James P. Kimball wrote that \"it is supposed that the three-dollar piece was designed to be a multiple of the three-cent piece, for the convenience of postal transactions\".[6] Numismatist Walter Hagans in his 2003 article on the three-dollar coin notes and dismisses the postal explanation, writing \"the actual reason for the gold $3 coin was the abundant supply of gold discovered in California.\"[7] Coin dealer and author Q. David Bowers notes that \"whether or not the $3 denomination was actually necessary or worthwhile has been a matter of debate among numismatists for well over a century.\"[8]",
			"color": "dim|0.50815 gray|0.50815 dim|0.50815 grey|0.50815 dark|0.18895 slate|0.18895 gray|0.18895 gray|0.15492 grey|0.15492 dark|0.060591 gray|0.060591 dark|0.060591 grey|0.060591  "
		}
	}
}
