{
	"add": {
		"doc": {
			"id": "7ddb454fdf241a2035809f248f60ca5bab0676db3049c2a1cb0385bca6524987",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Esso_gas_station_finland.png/220px-Esso_gas_station_finland.png",
				"previous": "In the area straddling the M25, the huge Compass Group is based in Chertsey as is Samsung UK, Siemon UK, the business facilities company Regus, and Britax. Thales Group UK, Juniper Networks UK (routers), and Royal Caribbean Cruises UK are in Addlestone; at Hamm Moor on the A317 is the UK corporate headquarters of Toshiba, with another base in Camberley. Near Weybridge are the UK headquarters of Sony (situated in Byfleet) and Procter & Gamble (next door to each other near the Brooklands racing circuit), the local newspaper group Newsquest, Gallaher Group (cigarettes), Kia Motors UK, Petroleum Geo-Services UK, Yamaha Motors UK; the Central Veterinary Laboratory, which is run by the Veterinary Laboratories Agency, is in New Haw to the west.",
				"after": "Mouchel is in West Byfleet. Air Products UK is in Walton-on-Thames. Atkins, the civil engineering company, and Toyota UK (towards Banstead) are in Epsom. Dairy Crest is in Esher. SHL Group (former Saville & Holdsworth) is just to the north-east at Thames Ditton. Samaritans is in Ewell. Ann Summers is in Whyteleafe near Caterham. Caterham Cars Sales and Marketing offices are in Caterham. Swift Cover, Berkeley Group Holdings and Cargill Europe are in Cobham. Pfizer UK is in Walton-on-the-Hill. Edmund Nuttall, City Link Ltd., Adaptec UK, Stihl UK, Fluor UK (construction and civil engineering), and Krispy Kreme UK are in Camberley and S.C. Johnson UK is in Frimley Green. Siemens UK, Novartis UK, BAE Systems Integrated System Technologies, and AMD UK are in Frimley, home to the Lakeside Leisure Complex.",
			"color": "dark|0.16716 gray|0.16716 dark|0.16716 grey|0.16716 red|0.16328 silver|0.11697 gray|0.10583 grey|0.10583 light|0.096978 gray|0.096978 light|0.096978 grey|0.096978 gainsboro|0.075034 dim|0.06517 gray|0.06517 dim|0.06517 grey|0.06517 white|0.021651 smoke|0.021651 orange|0.013746 red|0.013746 alice|0.012176 blue|0.012176 ghost|0.010213 white|0.010213 snow|0.0092103 linen|0.0087788 lavender|0.0086243 blush|0.0086243 misty|0.007989 rose|0.007989 sea|0.007715 shell|0.007715 white|0.0069791 light|0.0068325 coral|0.0068325 mint|0.0066097 cream|0.0066097 azure|0.0064961  "
		}
	}
}
