{
	"add": {
		"doc": {
			"id": "7dde7391d49d3b7d5aa887fc9494368add1bff4e3d6448afefc0d24ed0f663e8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Balangkas_Welcome_arch.jpg/220px-Balangkas_Welcome_arch.jpg",
				"previous": "The Feast of San Diego de Alcala is commemorated every 12 November in Poblacion. This is a celebration of the feast of the oldest church in Valenzuela which includes annual boat racing, street dancing and different fabulous activities of the festival.[94] As part of the San Diego de Alcala Feast Day, a unique food festival in the country is celebrated which features the famous putong Polo, the small but classy kakanin which was originally created in the town of Polo.[85] This rice cake was a recipient of Manuel Quezon Presidential Award in 1931 which was cited having its exotic taste and amazingly long shelf-life.[95] The celebration, known as Putong Polo Festival includes a parade featuring artistic creations from the rice cake which showcases creativity among the residents.[96]",
				"after": "The city collaborates with other institutions, government or private, to bring quality education among its citizens under the \"WIN ang Edukasyon Program\" (roughly means Education WIN sic Program, WIN is the nickname of the current mayor Sherwin Gatchalian). In 2010, the government, in partnership with the local school board, funded the purchase and construction of computer laboratories in 10 secondary schools all having a net worth of Php 17.7M (or about US$410,000 as of April 2011). This also includes the distribution of Php 1.46M (or about US$34,000 as of April 2011) computers in Pamantasan ng Lungsod ng Valenzuela and Valenzuela City Polytechnic College, as part of Department of Education's ICT4E Strategic Plan. In this project, information and communication technology education is extended and expanded among all students.[97] In 2009, the City Engineering Office repaired sidewalks and drainage to assist students especially during the wet season; they also repaired and constructed new buildings and classrooms to some schools in the city.[98] Under the same program, elementary school students received free mathematics and English workbooks published by the government especially designed for Valenzuelanos.[98] The steady increase of 3.4% enrollment rate each year forces the government to construct new buildings and classrooms to meet the target 1:45 teacher-to-student ratio, contrary to the current count of 1:50 ratio alternating in three shifts.[99] WIN ang Edukasyon Program was done in partnership with the Synergeia Foundation, a non-government organization that aims to improve education in local governments in the Philippines.[100]",
			"color": "light|0.163 steel|0.163 blue|0.163 black|0.12982 lavender|0.12672 dim|0.096734 gray|0.096734 dim|0.096734 grey|0.096734 gray|0.054227 grey|0.054227 dark|0.046359 gray|0.046359 dark|0.046359 grey|0.046359 alice|0.044417 blue|0.044417 dark|0.035939 slate|0.035939 gray|0.035939 ghost|0.027448 white|0.027448 silver|0.023818 slate|0.022549 gray|0.022549 light|0.019966 sky|0.019966 blue|0.019966 white|0.01969 smoke|0.01969 light|0.01912 slate|0.01912 gray|0.01912 azure|0.018871 gainsboro|0.016468 light|0.016118 gray|0.016118 light|0.016118 grey|0.016118 white|0.013683 snow|0.013429 light|0.013286 blue|0.013286 mint|0.013248 cream|0.013248 light|0.010317 cyan|0.010317 lavender|0.007754 blush|0.007754  "
		}
	}
}
