{
	"add": {
		"doc": {
			"id": "7dea3f33adb215628969b7499da4f89d3cf974fd772cfb654284da6cb2d5a672",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Zayed_bin_Al_Nahayan.jpg/170px-Zayed_bin_Al_Nahayan.jpg",
			"previous": [],
				"after": "By 1966, it had become clear the British government could no longer afford to administer and protect what is now the United Arab Emirates. British MPs debated the preparedness of the Royal Navy to defend the trucial sheikhdoms. Secretary of State for Defence Denis Healey reported that the British Armed Forces were seriously overstretched and in some respects dangerously under-equipped to defend the Trucial Sheikhdoms. On 24 January 1968, British Prime Minister Harold Wilson announced the government's decision, reaffirmed in March 1971 by Prime Minister Edward Heath to end the treaty relationships with the seven Trucial Sheikhdoms, that had been, together with Bahrain and Qatar, under British protection. Days after the announcement, the ruler of Abu Dhabi Sheikh Zayed bin Sultan Al Nahyan, fearing vulnerability, tried to persuade the British to honour the protection treaties by offering to pay the full costs of keeping the British Armed Forces in the Emirates. The British Labour government rejected the offer.[46] After Labour MP Goronwy Roberts informed Sheikh Zayed of the news of British withdrawal, the nine Persian Gulf sheikhdoms attempted to form a union of Arab emirates, but by mid-1971 they were still unable to agree on terms of union even though the British treaty relationship was to expire in December of that year.[47]",
			"color": "misty|0.14657 rose|0.14657 antique|0.098411 white|0.098411 peach|0.079566 puff|0.079566 linen|0.076632 sea|0.056177 shell|0.056177 old|0.052741 lace|0.052741 bisque|0.04715 floral|0.040319 white|0.040319 rosy|0.034551 brown|0.034551 papaya|0.033684 whip|0.033684 lavender|0.030064 blush|0.030064 blanched|0.028304 almond|0.028304 snow|0.028127 white|0.025644 smoke|0.025644 wheat|0.0244 dark|0.024376 salmon|0.024376 sienna|0.02373 ivory|0.021184 burly|0.021051 wood|0.021051 tan|0.02041 white|0.012422 navajo|0.01186 white|0.01186 moccasin|0.0095416 mint|0.0073651 cream|0.0073651 beige|0.0065441 gainsboro|0.0062518 corn|0.0055165 silk|0.0055165 light|0.0047953 salmon|0.0047953  "
		}
	}
}
