{
	"add": {
		"doc": {
			"id": "7df8307779dd16f21fc42ae75b3c2b2b4dcb0b053da3d62c9f620a2ff262f1b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Wirnik_turbiny_parowej_ORP_Wicher.jpg/220px-Wirnik_turbiny_parowej_ORP_Wicher.jpg",
			"previous": [],
				"after": "In steam-powered ships, compelling advantages of steam turbines over reciprocating engines are smaller size, lower maintenance, lighter weight, and lower vibration. A steam turbine is only efficient when operating in the thousands of RPM, while the most effective propeller designs are for speeds less than 300 RPM; consequently, precise (thus expensive) reduction gears are usually required, although numerous early ships through World War I, such as Turbinia, had direct drive from the steam turbines to the propeller shafts. Another alternative is turbo-electric transmission, in which an electrical generator run by the high-speed turbine is used to run one or more slow-speed electric motors connected to the propeller shafts; precision gear cutting may be a production bottleneck during wartime. Turbo-electric drive was most used in large US warships designed during World War I and in some fast liners, and was used in some troop transports and mass-production destroyer escorts in World War II. The purchase cost of turbines is offset by much lower fuel and maintenance requirements and the small size of a turbine when compared to a reciprocating engine having an equivalent power. However, from the 1950s diesel engines were capable of greater reliability and higher efficiencies: propulsion steam turbine cycle efficiencies have yet to break 50%, yet diesel engines today routinely exceed 50%, especially in marine applications.[24][25][26] Diesel power plants also have lower operating costs since fewer operators are required. Thus, conventional steam power is used in very few new ships. An exception is LNG carriers which often find it more efficient to use boil-off gas with a steam turbine than to re-liquify it.",
			"color": "dim|0.21108 gray|0.21108 dim|0.21108 grey|0.21108 dark|0.17669 slate|0.17669 gray|0.17669 black|0.16506 rosy|0.13747 brown|0.13747 gray|0.097281 grey|0.097281 dark|0.072082 gray|0.072082 dark|0.072082 grey|0.072082 silver|0.045081 light|0.019455 gray|0.019455 light|0.019455 grey|0.019455 misty|0.016425 rose|0.016425  "
		}
	}
}
