{
	"add": {
		"doc": {
			"id": "7e00cace8c6904eac05c2543b1bdd3d219a4e22da030818ef24f48a55f9d5dba",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Tyrantgraph.png/300px-Tyrantgraph.png",
			"previous": [],
				"after": "Most age categories of Albertosaurus are represented in the fossil record. Using bone histology, the age of an individual animal at the time of death can often be determined, allowing growth rates to be estimated and compared with other species. The youngest known Albertosaurus is a two-year-old discovered in the Dry Island bonebed, which would have weighed about 50 kilograms (110 lb) and measured slightly more than 2 metres (6.6 feet) in length. The 10 metres (33 feet) specimen from the same quarry is the oldest and largest known, at 28 years of age. When specimens of intermediate age and size are plotted on a graph, an S-shaped growth curve results, with the most rapid growth occurring in a four-year period ending around the sixteenth year of life, a pattern also seen in other tyrannosaurids. The growth rate during this phase was 122 kilograms (269 pounds) per year, based on an adult 1.3 tonnes (1.4 short tons). Other studies have suggested higher adult weights; this would affect the magnitude of the growth rate, but not the overall pattern. Tyrannosaurids similar in size to Albertosaurus had similar growth rates, although the much larger Tyrannosaurus rex grew at almost five times this rate (601 kilograms [1,325 pounds] per year) at its peak.[3] The end of the rapid growth phase suggests the onset of sexual maturity in Albertosaurus, although growth continued at a slower rate throughout the animals' lives.[3][4] Sexual maturation while still actively growing appears to be a shared trait among small[36] and large[37] dinosaurs as well as in large mammals such as humans and elephants.[37] This pattern of relatively early sexual maturation differs strikingly from the pattern in birds, which delay their sexual maturity until after they have finished growing.[26][37]",
			"color": "white|0.075128 smoke|0.075128 snow|0.074807 white|0.074658 ghost|0.074611 white|0.074611 sea|0.073051 shell|0.073051 alice|0.072533 blue|0.072533 mint|0.072422 cream|0.072422 floral|0.071954 white|0.071954 azure|0.069867 lavender|0.063361 blush|0.063361 light|0.043663 green|0.043663 light|0.029941 coral|0.029941 pink|0.023312 lavender|0.018129 ivory|0.017042 light|0.017021 pink|0.017021 salmon|0.016805 misty|0.016711 rose|0.016711 lime|0.015726 honeydew|0.013064 medium|0.010237 slate|0.010237 blue|0.010237 linen|0.0047661 old|0.0045081 lace|0.0045081  "
		}
	}
}
