{
	"add": {
		"doc": {
			"id": "7e207a2794a11049d4ab083e7b3ee587ee6e956507e11a6550949d839f3ac56d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/The_Chaser_APEC_prank_map.png/220px-The_Chaser_APEC_prank_map.png",
				"previous": "In the following episode of The Chaser's War on Everything, the team emphasised that their only realistic attempt to disguise the vehicles was the use of a Canadian flag.[10] Taylor later said that there was \"no particular reason we chose Canada, we just thought they'd be a country who the cops wouldn't scrutinise too closely, and who feasibly would only have three cars in their motorcade—as opposed to the 20 or so gas guzzlers that Bush has brought with him\".[18] There were many deliberate indications that the motorcade was not genuine, particularly on the fake credentials used by the team; members' security passes were printed with JOKE, Insecurity, and It's pretty obvious this isn't a real pass all clearly visible,[15] while the APEC 2007 Official Vehicle stickers included both the name of the series and the text This dude likes trees and poetry and certain types of carnivorous plants excite him.[19] In addition, some of the runners were holding camcorders and one of the motorcyclists was wearing jeans, both highly unusual for an official motorcade.[13]",
				"after": "At 11.30 am (AEDT),[13] the motorcade began its journey towards the \"ring of steel\", a fenced area at the intersection of Bent and Macquarie Streets.[20] The alleged vehicle (or vehicles) stopped for a red light and the police became aware of the motorcade's presence, but waved them towards the checkpoint. The convoy travelled through the first checkpoint without inspection and proceeded in a northerly direction to a second security checkpoint in the prohibited \"red zone\", just before Bridge Street. Both motorcyclists had by now separated from the motorcade,[13] which was waved through the second checkpoint by police officers. It travelled further into the restricted area before stopping outside the InterContinental Hotel. [15]",
			"color": "light|0.45977 green|0.45977 forest|0.23225 green|0.23225 green|0.21936 red|0.0061187 mint|0.0058977 cream|0.0058977 white|0.0057473 smoke|0.0057473 floral|0.0056744 white|0.0056744 azure|0.0055733 sea|0.0055669 shell|0.0055669 white|0.005525 snow|0.0054365 alice|0.0052192 blue|0.0052192 ghost|0.005192 white|0.005192 lavender|0.0047079 blush|0.0047079  "
		}
	}
}
