{
	"add": {
		"doc": {
			"id": "7e2baa7439947b0272908a5062d46fc94149851545f8105893cd1a7043043267",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Angela_Georgina_Burdett-Coutts.jpg/170px-Angela_Georgina_Burdett-Coutts.jpg",
				"previous": "These conditions earned dockers much public sympathy, and after a bitter struggle, the London Dock Strike of 1889 was settled with victory for the strikers, and established a national movement for the unionisation of casual workers, as opposed to the craft unions that already existed.",
				"after": "The philanthropist Angela Burdett-Coutts was active in the East End, alleviating poverty by founding a sewing school for ex-weavers in Spitalfields and building the ornate Columbia Market in Bethnal Green. She helped to inaugurate the London Society for the Prevention of Cruelty to Children, was a keen supporter of the 'Ragged School Union',[41] and operated housing schemes similar to those of the Model Dwellings Companies such as the East End Dwellings Company and the Four Per Cent Industrial Dwellings Company, where investors received a financial return on their philanthropy.[42] Between the 1890s and 1903, when the work was published, the social campaigner Charles Booth instigated an investigation into the life of London poor (based at Toynbee Hall), much of which was centred on the poverty and conditions in the East End.[43] Further investigations were instigated by the 'Royal Commission on the Poor Laws and Relief of Distress 1905-09', the Commission found it difficult to agree, beyond that change was necessary and produced separate minority and majority reports. The minority report was the work of Booth with the founders of the London School of Economics Sidney and Beatrice Webb. They advocated focusing on the causes of poverty and the radical notion of poverty being involuntary, rather than the result of innate indolence. At the time their work was rejected but was gradually adopted as policy by successive governments.[44]",
			"color": " "
		}
	}
}
