{
	"add": {
		"doc": {
			"id": "7e2e74bc7511c385e5cffb359d6fd3fd5230af49db244094b6abe43c91ce0663",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Liberty_Bell_150th_Anniversary_1926_Issue-2c.jpg/286px-Liberty_Bell_150th_Anniversary_1926_Issue-2c.jpg",
				"previous": "In addition to the replicas which are seen at Independence National Historical Park, early replicas of the Liberty Bell include the so-called Justice Bell or Women's Liberty Bell, commissioned in 1915 by suffragists to advocate for women's suffrage. This bell had the same legend as the Liberty Bell, with two added words, \"establish justice\", words taken from the Preamble to the United States Constitution. It also had the clapper chained to the bell so it could not sound, symbolizing the inability of women, lacking the vote, to influence political events. The Justice Bell toured extensively to publicize the cause. After the passage of the Nineteenth Amendment (granting women the vote), the Justice Bell was brought to the front of Independence Hall on August 26, 1920 to finally sound. It remained on a platform before Independence Hall for several months before city officials required that it be taken away, and today is at the Washington Memorial Chapel at Valley Forge.[92]",
				"after": "As part of the Liberty Bell Savings Bonds drive in 1950, 55 replicas of the Liberty Bell (one each for the 48 states, the District of Columbia, and the territories) were ordered by the United States Department of the Treasury and were cast in France by the Fonderie Paccard. The bells were to be displayed and rung on patriotic occasions.[93] Many of the bells today are sited near state capitol buildings.[93] Although Wisconsin's bell is now at its state capitol, initially it was sited on the grounds of the state's Girls Detention Center. Texas's bell is at Texas A & M University in College Station.[93] The Texas bell was presented to the university in appreciation of the service of the school's graduates.[93][94] Walt Disney World has a replica of the Liberty Bell, which is located in Liberty Square in the Magic Kingdom. The replica was cast from the mold of the actual Liberty Bell in 1989.[93][95][96]",
			"color": "crimson|0.13544 light|0.10033 coral|0.10033 indian|0.057353 red|0.057353 blanched|0.054862 almond|0.054862 papaya|0.05314 whip|0.05314 bisque|0.049827 corn|0.046434 silk|0.046434 antique|0.04535 white|0.04535 light|0.040931 pink|0.040931 peach|0.038144 puff|0.038144 beige|0.037706 light|0.03735 golden|0.03735 rod|0.03735 yellow|0.03735 light|0.035188 yellow|0.035188 lemon|0.033892 chiffon|0.033892 firebrick|0.030485 pink|0.029009 misty|0.027897 rose|0.027897 wheat|0.025195 old|0.019676 lace|0.019676 brown|0.016768 moccasin|0.013486 linen|0.010815 ivory|0.0087769 salmon|0.0072195 floral|0.0066738 white|0.0066738 dark|0.0066379 salmon|0.0066379 sea|0.0050778 shell|0.0050778  "
		}
	}
}
