{
	"add": {
		"doc": {
			"id": "7e4320f3bceb23322598981d6984ba6c5a71eaafd458156a1bc0bc966b3a3358",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Sticky_%26_Sweet_Tour_Wembley_Devil_Wouldn%27t_Recognize_You.JPG/220px-Sticky_%26_Sweet_Tour_Wembley_Devil_Wouldn%27t_Recognize_You.JPG",
			"previous": [],
				"after": "The Sticky & Sweet Tour broke many records in terms of its ticket sales, commercial gross and audience attendance. On September 11, 2008, Madonna performed to a sell-out crowd of over 74,000 fans and grossed over $12 million USD, surpassing all previous grosses at both the old and the new Wembley Stadiums.[19] Since that date U2 and their 360° Tour has broken the attendance record at Wembley Stadium with a crowd of 88,000 people.[33] This performance followed the Zurich performance, which was in front of 72,000 people, the largest audience ever for a concert in Switzerland.[19] The September 20, 2008, concert at the Stade de France sold 80,000 tickets in less than ten days, prompting Live Nation to announce a second and final show at the venue.[34] 50,000 tickets for Madonna's Vancouver concert at BC Place Stadium were sold in 29 minutes.[34] Due to instant sellouts in Toronto at Air Canada Centre on October 18 and Montreal at the Bell Centre on October 22, second shows in both markets were added on October 19 in Toronto, at the Air Canada Centre, and October 23, at Montreal's Bell Centre.[34] The two shows in Mexico City sold out in less than three hours.[19] Madonna's show in Montenegro was performed to almost 70,000, the biggest-ever event held in the small Adriatic republic.[35] In New York City, Madonna's four sell-outs at Madison Square Garden shows added up to a record breaking 23 sold out performances since 2001 at that venue – a record for most appearances for a single artist in this decade.[36] Madonna's performances at Stade de France, Wembley Stadium, Madison Square Garden and Military Airfield ranked at numbers 3, 13, 15 and 20 on Billboard‍ '​s Top 25 Boxscores of 2008, respectively.[37] The tour ranked third in Billboard‍ '​s \"Top 25 Tours\", with a gross of over U.S. $162 million ($177.45 in 2015 dollars[1]) by mid-November 2008.[38] Pollstar ranked the tour the leading North American grosser for 2008 at $105.3 million ($115.34 in 2015 dollars[1]).[39] On December 2008, Live Nation announced that the U.S. leg of the tour sold 550,000 tickets and grossed $91.5 million ($100.23 in 2015 dollars[1]). Together with the European and Mexican dates, the tour grossed a total of $282 million ($308.89 in 2015 dollars[1]), making it the highest grossing tour of 2008. It also became the biggest selling tour by a solo artist, breaking the record previously held by her own Confessions Tour in 2006.[4][40][41]",
			"color": "black|0.83937 deep|0.026227 pink|0.026227 dim|0.020532 gray|0.020532 dim|0.020532 grey|0.020532 medium|0.018984 violet|0.018984 red|0.018984 gray|0.011449 grey|0.011449 crimson|0.0061916 dark|0.005734 gray|0.005734 dark|0.005734 grey|0.005734 peru|0.0055199  "
		}
	}
}
