{
	"add": {
		"doc": {
			"id": "7e5a556ed94df6cf7763767a34930ab10888155f6be4b3601f5ec344943bd561",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/MaryJaneKelly_Ripper_100.jpg/220px-MaryJaneKelly_Ripper_100.jpg",
				"previous": "Eddowes' body was found in Mitre Square, in the City of London, three-quarters of an hour after Stride's. The throat was severed, and the abdomen was ripped open by a long, deep, jagged wound. The left kidney and the major part of the uterus had been removed. A local man, Joseph Lawende, had passed through the square with two friends shortly before the murder, and he described seeing a fair-haired man of shabby appearance with a woman who may have been Eddowes.[26] His companions were unable to confirm his description.[26] Eddowes' and Stride's murders were later called the \"double event\".[27] Part of Eddowes' bloodied apron was found at the entrance to a tenement in Goulston Street, Whitechapel. Some writing on the wall above the apron piece, which became known as the Goulston Street graffito, seemed to implicate a Jew or Jews, but it was unclear whether the graffito was written by the murderer as he dropped the apron piece, or merely incidental.[28] Such graffiti were commonplace in Whitechapel. Police Commissioner Charles Warren feared the graffito might spark anti-semitic riots, and ordered it washed away before dawn.[29]",
				"after": "Kelly's mutilated and disemboweled body was discovered lying on the bed in the single room where she lived at 13 Miller's Court, off Dorset Street, Spitalfields, at 10:45 a.m. on Friday 9 November 1888. The throat had been severed down to the spine, and the abdomen almost emptied of its organs. The heart was missing.[30]",
			"color": "dim|0.14228 gray|0.14228 dim|0.14228 grey|0.14228 dark|0.13511 gray|0.13511 dark|0.13511 grey|0.13511 silver|0.1111 gray|0.11017 grey|0.11017 light|0.091043 gray|0.091043 light|0.091043 grey|0.091043 gainsboro|0.070951 linen|0.040821 white|0.035898 smoke|0.035898 sea|0.035634 shell|0.035634 floral|0.031138 white|0.031138 snow|0.030358 white|0.025187 old|0.024457 lace|0.024457 mint|0.023349 cream|0.023349 ivory|0.020234 ghost|0.015351 white|0.015351 lavender|0.014662 blush|0.014662 misty|0.014016 rose|0.014016 azure|0.010611 antique|0.0064627 white|0.0064627 alice|0.0041171 blue|0.0041171  "
		}
	}
}
