{
	"add": {
		"doc": {
			"id": "7e5b9e9207954dc58c2458e5eb385354e7e16129e074a7018a46004485637c17",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Standing_jaguar.jpg/220px-Standing_jaguar.jpg",
				"previous": "The jaguar has been an American cat since crossing the Bering Land Bridge during the Pleistocene epoch; the immediate ancestor of modern animals is Panthera onca augusta, which was larger than the contemporary cat.[23] Its present range extends from Mexico, through Central America and into South America, including much of Amazonian Brazil.[63] The countries included in this range are Argentina, Belize, Bolivia, Brazil, Colombia, Costa Rica (particularly on the Osa Peninsula), Ecuador, French Guiana, Guatemala, Guyana, Honduras, Mexico, Nicaragua, Panama, Paraguay, Peru, Suriname, the United States and Venezuela. The jaguar is now extinct in El Salvador and Uruguay.[1] It occurs in the 400 km² Cockscomb Basin Wildlife Sanctuary in Belize, the 5,300 km² Sian Ka'an Biosphere Reserve in Mexico, the approximately 15,000 km2 Manú National Park in Peru, the approximately 26,000 km2 Xingu National Park in Brazil, and numerous other reserves throughout its range.",
				"after": "The inclusion of the United States in the list is based on occasional sightings in the southwest, particularly in Arizona, New Mexico and Texas. In the early 20th century, the jaguar's range extended as far north as the Grand Canyon, and as far west as Southern California.[58] The jaguar is a protected species in the United States under the Endangered Species Act, which has stopped the shooting of the animal for its pelt. In 1996 and from 2004 on, wildlife officials in Arizona photographed and documented jaguars in the southern part of the state. Between 2004 and 2007, two or three jaguars have been reported by researchers around Buenos Aires National Wildlife Refuge in southern Arizona. One of them, called 'Macho B', had been previously photographed in 1996 in the area.[64] For any permanent population in the USA to thrive, protection from killing, an adequate prey base, and connectivity with Mexican populations are essential.[65] In February 2009, a 53.5 kg (118 lb) jaguar was caught, radio-collared and released in an area southwest of Tucson, Arizona; this is farther north than had previously been expected and represents a sign there may be a permanent breeding population of jaguars within southern Arizona. The animal was later confirmed to be indeed the same male individual ('Macho B') that was photographed in 2004.[66] On 2 March 2009, Macho B was recaptured and euthanized after he was found to be suffering from kidney failure; the animal was thought to be 16 years old, older than any known wild jaguar.[67]",
			"color": "black|0.37785 burly|0.12055 wood|0.12055 sienna|0.10637 tan|0.09987 saddle|0.072717 brown|0.072717 navajo|0.030712 white|0.030712 wheat|0.026183 peach|0.023323 puff|0.023323 moccasin|0.021039 peru|0.018991 dark|0.014793 salmon|0.014793 bisque|0.013766  "
		}
	}
}
