{
	"add": {
		"doc": {
			"id": "7e5fdba152ad3d58f2fbe0beb482f7359726df7e1b4b095b3f7458f46703ac9a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/The_battle_of_the_Saints_12_avril_1782.jpg/250px-The_battle_of_the_Saints_12_avril_1782.jpg",
				"previous": "After a period of relative peace, the Navy became engaged in the War of Jenkins' Ear (1739–1748) against Spain, which was dominated by a series of costly and mostly unsuccessful attacks on Spanish ports in the Caribbean. During the Battle of Cartagena de Indias in 1741, the Navy deployed a huge force of over 27,000 men in 135 transports and 50 warships[32] against the Spanish port city of Cartagena in modern-day Colombia. The siege ended in defeat and huge losses for the British navy and army.[33] In 1742 the Kingdom of the Two Sicilies was driven to withdraw from the war in the space of half an hour by the threat of a bombardment of its capital Naples by a small British squadron. The war became subsumed in the wider War of the Austrian Succession (1744–1748), once again pitting Britain against France. Naval fighting in this war, which for the first time included major operations in the Indian Ocean, was largely inconclusive, the most significant event being the failure of an attempted French invasion of England in 1744.[34] The subsequent Seven Years' War (1756–1763) saw the Navy conduct amphibious campaigns leading to the conquest of French Canada, of French colonies in the Caribbean and in West Africa and of small islands off the French coast, while operations in the Indian Ocean contributed to the destruction of French power in India.[35] A new French attempt to invade Britain was thwarted by the extraordinary Battle of Quiberon Bay in 1759, fought in a gale on a dangerous lee shore. Once again the British fleet effectively eliminated the French navy from the war, leading France to abandon major operations.[36] In 1762 the resumption of hostilities with Spain led to the British capture of Havana (along with a Spanish fleet sheltering there) and of Manila.[37]",
				"after": "In the American Revolutionary War (1775–1783) the Royal Navy readily obliterated the small Continental Navy of frigates fielded by the rebel colonists, but the entry of France, Spain and the Netherlands into the war against Britain produced a combination of opposing forces which deprived the Navy of its position of superiority for the first time since the 1690s, briefly but decisively. The war saw a series of indecisive battles in the Atlantic and Caribbean, in which the Navy failed to achieve the conclusive victories needed to secure the supply lines of British forces in North America and to cut off the colonial rebels from outside support.[38] The most important operation of the war came in 1781 when, in the Battle of the Chesapeake, the British fleet failed to lift the French blockade of Lord Cornwallis's army, resulting in Cornwallis's surrender at Yorktown.[39] Although this disaster effectively concluded the fighting in North America, hostilities continued in the Indian Ocean, where the French were prevented from re-establishing a meaningful foothold in India, and in the Caribbean. British Caribbean victories in the Battle of the Saintes in 1782 and in the relief of Gibraltar later the same year symbolised the restoration of British naval ascendancy, but this came too late to prevent the independence of the Thirteen Colonies.[40]",
			"color": "tan|0.82648 silver|0.06525 dark|0.038876 gray|0.038876 dark|0.038876 grey|0.038876 gray|0.027144 grey|0.027144 burly|0.023627 wood|0.023627  "
		}
	}
}
