{
	"add": {
		"doc": {
			"id": "7e65ae20cb5043f7cf621c0aee6d026b88bd0efc8089c9c5817cef144ce7ef53",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Hammond-Harwood_House_%28Md._Ave._Facade%29.jpg/350px-Hammond-Harwood_House_%28Md._Ave._Facade%29.jpg",
				"previous": "The politician and architect Thomas Jefferson (1743–1826) once referred to Palladio's Quattro Libri as his bible. Jefferson acquired an intense appreciation of Palladio's architectural concepts, and his designs for his own beloved Monticello,[21] the James Barbour Barboursville estate, Virginia State Capitol, and the University of Virginia were based on drawings from Palladio's book.[22] Realizing the powerful political significance pertaining to ancient Roman buildings, Jefferson designed his civic buildings in the Palladian style. Monticello (remodelled between 1796 and 1808) is quite clearly based on Palladio's Villa Capra, however, with modifications, in a style which is described in America today as Colonial Georgian. Jefferson's Pantheon, or Rotunda, at the University of Virginia is undeniably Palladian in concept and style.[23]",
				"after": "In Virginia and Carolina, the Palladian manner is epitomised in numerous Tidewater plantation houses, such as Stratford Hall or Westover Plantation, or Drayton Hall near Charleston. These examples are all classic American colonial examples of a Palladian taste that was transmitted through engravings, for the benefit of masons—and patrons, too—who had no first-hand experience of European building practice. A feature of American Palladianism was the re-emergence of the great portico, which again, as in Italy, fulfilled the need of protection from the sun; the portico in various forms and size became a dominant feature of American colonial architecture. In the north European countries the portico had become a mere symbol, often closed, or merely hinted at in the design by pilasters, and sometimes in very late examples of English Palladianism adapted to become a porte-cochere; in America, the Palladian portico regained its full glory.",
			"color": "black|0.28797 dim|0.15178 gray|0.15178 dim|0.15178 grey|0.15178 gray|0.092545 grey|0.092545 light|0.079346 steel|0.079346 blue|0.079346 rosy|0.063359 brown|0.063359 dark|0.060926 gray|0.060926 dark|0.060926 grey|0.060926 silver|0.034583 light|0.029031 gray|0.029031 light|0.029031 grey|0.029031 gainsboro|0.023812 dark|0.017309 olive|0.017309 green|0.017309 slate|0.015201 gray|0.015201 tan|0.013813 lavender|0.012415 blush|0.012415 light|0.011934 slate|0.011934 gray|0.011934  "
		}
	}
}
