{
	"add": {
		"doc": {
			"id": "7e6640abebb019414cb3757082926d809e3b9f71bff3061def9d7d8a510e3baf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/U.S._Defense_Spending_Trends.png/300px-U.S._Defense_Spending_Trends.png",
				"previous": "The United States currently has nine Combatant Commands, organized either on a geographical basis (known as \"Area of Responsibility\", AOR) or on a global, functional basis:[31]",
			"after": [
				"Department of Defense spending in 2010 was 4.8% of GDP and accounted for approximately 45% of budgeted global military spending – more than the next 17 largest militaries combined.[32][33]",
				"The Department of Defense accounts for the majority of federal discretionary spending. In FY 2010 the Department of Defense budgeted spending accounted for 21% of the U.S. Federal Budget, and 53% of federal discretionary spending, which represents funds not accounted for by pre-existing obligations.[34] However, this does not include many military-related items that are outside of the Defense Department budget, such as nuclear weapons research, maintenance, cleanup, and production, which is in the Department of Energy budget, Veterans Affairs, the Treasury Department's payments in pensions to military retirees and widows and their families, interest on debt incurred in past wars, or State Department financing of foreign arms sales and militarily-related development assistance. Neither does it include defense spending that is not military in nature, such as the Department of Homeland Security, counter-terrorism spending by the FBI, and intelligence-gathering spending by NASA."
			],
			"color": "lime|0.15293 medium|0.11195 blue|0.11195 lime|0.11061 green|0.11061 green|0.10881 blue|0.069128 red|0.062047 dark|0.060586 blue|0.060586 dark|0.058478 green|0.058478 forest|0.048699 green|0.048699 dark|0.048095 red|0.048095 navy|0.043556 maroon|0.033229 dark|0.025797 sea|0.025797 green|0.025797 midnight|0.013151 blue|0.013151 rosy|0.0080931 brown|0.0080931 brown|0.0080228 firebrick|0.0069269 slate|0.0063789 gray|0.0063789 gray|0.0062946 grey|0.0062946 dark|0.0062384 slate|0.0062384 blue|0.0062384  "
		}
	}
}
