{
	"add": {
		"doc": {
			"id": "7e676c3aaa3b4a735b758bec77d0f9bc626936973202eb694c98da2760f0aa48",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/David_Beckham.jpg/220px-David_Beckham.jpg",
				"previous": "On 16 May 2013, Beckham announced that he would retire from professional football at the end of that year's French football season.[155][156] Following his decision to retire at the end of the 2012–13 season, Beckham was given specially designed boots in the colours of the Union Jack to wear in his final game. These boots had the names of his wife, Victoria, and children stitched on to them. On 18 May 2013, Beckham was made captain in his final home game against Brest.[157] In this game Beckham assisted a goal by Matuidi from a corner. Beckham was subbed after 80 minutes, receiving hugs from his fellow players and manager, as well as a standing ovation from fans.[157] PSG went on to win the game 3–1.[157]",
			"after": [
				"Beckham made his first appearance for the England national football team on 1 September 1996, in a World Cup qualifying match against Moldova.[158]",
				"Beckham had played in all of England's qualifying matches for the 1998 World Cup and was part of the England squad at the World Cup finals in France,[159] but the team's manager Glenn Hoddle publicly accused him of not concentrating on the tournament,[160] and he did not start in either of England's first two games. He was picked for the third game against Colombia and scored with a bending 30-yard free kick in a 2–0 victory, which was his first goal for England.[161]"
			],
			"color": "white|0.083921 smoke|0.083921 ghost|0.078122 white|0.078122 alice|0.076964 blue|0.076964 snow|0.076688 white|0.073735 azure|0.068823 sea|0.067511 shell|0.067511 mint|0.067195 cream|0.067195 lavender|0.063577 blush|0.063577 floral|0.059621 white|0.059621 gainsboro|0.04316 lavender|0.035776 light|0.034264 gray|0.034264 light|0.034264 grey|0.034264 dark|0.023576 slate|0.023576 gray|0.023576 ivory|0.01819 silver|0.016508 linen|0.011221 honeydew|0.0094631 burly|0.0084326 wood|0.0084326 tan|0.007989 light|0.0067043 steel|0.0067043 blue|0.0067043 old|0.0061101 lace|0.0061101 dark|0.0056607 gray|0.0056607 dark|0.0056607 grey|0.0056607 beige|0.0056333 dim|0.0046211 gray|0.0046211 dim|0.0046211 grey|0.0046211 rosy|0.0046013 brown|0.0046013 peach|0.0043811 puff|0.0043811  "
		}
	}
}
