{
	"add": {
		"doc": {
			"id": "7e70349161cb74ad410ca091ca28abf24ee02f3aec5efe658900e9cab010e30f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/AQ_IMG_4968.JPG/220px-AQ_IMG_4968.JPG",
				"previous": "In 2005, the total population grew by 13,000 (1.8%)—similar to the Israeli national average, but the religious and ethnic composition is shifting. While 31% of the Jewish population is made up of children below the age fifteen, the figure for the Arab population is 42%.[260] This would seem to corroborate the observation that the percentage of Jews in Jerusalem has declined over the past four decades. In 1967, Jews accounted for 74 percent of the population, while the figure for 2006 is down nine percent.[264] Possible factors are the high cost of housing, fewer job opportunities and the increasingly religious character of the city, although proportionally, young Haredim are leaving in higher numbers.[citation needed] The percentage of secular Jews, or those who 'wear their faith lightly' is dropping, with some 20,000 leaving the city over the past seven years (2012). They now number 31% of the population, the same percentage as the rising ultra-orthodox population.[265] Many move to the suburbs and coastal cities in search of cheaper housing and a more secular lifestyle.[266] In 2009, the percentage of Haredim in the city was increasing. As of 2009, out of 150, 100 schoolchildren, 59,900 or 40% are in state-run secular and National Religious schools, while 90,200 or 60% are in Haredi schools. This correlates with the high number of children in Haredi families.[267][268]",
				"after": "While some Israelis see Jerusalem as poor, rundown and riddled with religious and political tension, the city has been a magnet for Palestinians, offering more jobs and opportunity than any city in the West Bank or Gaza Strip. Palestinian officials have encouraged Arabs over the years to stay in the city to maintain their claim.[269][270] Palestinians are attracted to the access to jobs, healthcare, social security, other benefits, and quality of life Israel provides to Jerusalem residents.[271] Arab residents of Jerusalem who choose not to have Israeli citizenship are granted an Israeli identity card that allows them to pass through checkpoints with relative ease and to travel throughout Israel, making it easier to find work. Residents also are entitled to the subsidized healthcare and social security benefits Israel provides its citizens, and have the right to vote in municipal elections. Arabs in Jerusalem can send their children to Israeli-run schools, although not every neighborhood has one, and universities. Israeli doctors and highly regarded hospitals such as Hadassah Medical Center are available to residents.[272]",
			"color": "silver|0.35196 dark|0.2725 gray|0.2725 dark|0.2725 grey|0.2725 light|0.12343 gray|0.12343 light|0.12343 grey|0.12343 gray|0.1101 grey|0.1101 dim|0.059472 gray|0.059472 dim|0.059472 grey|0.059472 gainsboro|0.047067 antique|0.0095018 white|0.0095018 black|0.0071989 linen|0.0057597  "
		}
	}
}
