{
	"add": {
		"doc": {
			"id": "7ea7cfdcd5cf387038cd971b803bc4f58bd99dd7444410b2730a59fe2156d9d8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Julije_Klovic_2.jpg/220px-Julije_Klovic_2.jpg",
				"previous": "Important for his early biography, El Greco, still in Crete, painted his Dormition of the Virgin near the end of his Cretan period, probably before 1567. Three other signed works of \"Doménicos\" are attributed to El Greco (Modena Triptych, St. Luke Painting the Virgin and Child, and The Adoration of the Magi).[11] In 1563, at the age of twenty-two, El Greco was already an enrolled master of the local guild, presumably in charge of his own workshop.[12] He left for Venice a few years later, and never returned to Crete. His Dormition of the Virgin, of before 1567 in tempera and gold on panel (61,4 x 45 cm, Holy Cathedral of the Dormition of the Virgin, Hermoupolis, Syros) was probably created near the end of El Greco's Cretan period. The painting combines post-Byzantine and Italian Mannerist stylistic and iconographic elements, and incorporates stylistic elements of the Cretan School.",
				"after": "It was natural for the young El Greco to pursue his career in Venice, Crete having been a possession of the Republic of Venice since 1211.[3] Though the exact year is not clear, most scholars agree that El Greco went to Venice around 1567.[f] Knowledge of El Greco's years in Italy is limited. He lived in Venice until 1570 and, according to a letter written by his much older friend, the greatest miniaturist of the age, Giulio Clovio, was a \"disciple\" of Titian, who was by then in his eighties but still vigorous. This may mean he worked in Titian's large studio, or not. Clovio characterized El Greco as \"a rare talent in painting\".[13]",
			"color": "black|0.87489 dim|0.043245 gray|0.043245 dim|0.043245 grey|0.043245 gray|0.027974 grey|0.027974 tan|0.013034 burly|0.012672 wood|0.012672 dark|0.008448 gray|0.008448 dark|0.008448 grey|0.008448 slate|0.0049747 gray|0.0049747  "
		}
	}
}
