{
	"add": {
		"doc": {
			"id": "7ec287b2456c35914560ed2bb361300fa059d98d57e57e92d8c63f930b3a4bbf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Boletus_luridus_239809.jpg/220px-Boletus_luridus_239809.jpg",
				"previous": "The fungus grows in a mycorrhizal association with deciduous trees such as oak, birch and beech on chalky soils.[34] It is also suspected of being a mycorrhizal associate of subshrub rock roses in the genus Helianthemum.[51] Field studies indicate that the fungus, when paired as a mycorrhizal partner with seedlings of the conifer Cunninghamia lanceolata, increases the seedling's survival rate, augments its height and ground diameter, and increases the chlorophyll content in the leaves.[52] A similar growth-enhancing effect had been noted earlier with Pinus taiwanensis seedlings.[53] These beneficial effects on plant growth are a result of multiple interactions among the fungus, host plant, and indigenous soil microbes that increase the biomass of carbon, and increase the bacterial diversity in the mycorrhizosphere.[54] In a study comparing the salinity resistance of three common ectomycorrhizal fungi (the others were Suillus bovinus and S. luteus), S. luridus was the most tolerant to high concentrations of salt, and is a good candidate species for the inoculation of tree seedlings to be planted on saline soil.[55] Fruit bodies grow singly or scattered on the ground,[37] from June to November after summer rains. S. luridus may occur in parks near a single tree, though it will not be found in acidic soils.[34]",
				"after": "The predilection of insects for this mushroom was noted by 19th-century British mycologist Anna Maria Hussey, who wrote in 1847:",
			"color": "black|0.26956 dim|0.16622 gray|0.16622 dim|0.16622 grey|0.16622 gray|0.11329 grey|0.11329 dark|0.076254 gray|0.076254 dark|0.076254 grey|0.076254 rosy|0.055114 brown|0.055114 silver|0.03895 dark|0.036282 slate|0.036282 gray|0.036282 slate|0.03307 gray|0.03307 tan|0.029168 light|0.024953 slate|0.024953 gray|0.024953 light|0.019412 gray|0.019412 light|0.019412 grey|0.019412 sienna|0.017248 burly|0.016491 wood|0.016491 gainsboro|0.012688 dark|0.0093618 olive|0.0093618 green|0.0093618  "
		}
	}
}
