{
	"add": {
		"doc": {
			"id": "7ec70fbea72afca2dea0640dbadbb4dd666f557e48124d2139f8a0b376ee2b7c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/USF_WMG.JPG/220px-USF_WMG.JPG",
				"previous": "The San Francisco 49ers of the National Football League (NFL) were the longest-tenured major professional sports franchise in the city. The team began play in 1946 as an All-America Football Conference (AAFC) league charter member, moved to the NFL in 1950 and into Candlestick Park in 1971. The team began playing its home games at Levi's Stadium in Santa Clara, California in 2014; the team is still named the \"San Francisco 49ers\", even though they are much closer to the city of San Jose.[199][200] The 49ers have won five Super Bowl titles in the 1980s and 1990s behind coaches Bill Walsh and George Seifert, and stars such as Joe Montana, Steve Young, Ronnie Lott, and Jerry Rice.",
				"after": "At the collegiate level, the Dons of the University of San Francisco compete in NCAA Division I, where Bill Russell guided the program to basketball championships in 1955 and 1956. The San Francisco State Gators and the Academy of Art University Urban Knights compete in Division II. AT&T Park has since 2002 hosted an annual post-season college football bowl game, currently named the Fight Hunger Bowl. In 2011, San Francisco hosted the California Golden Bears football team at Candlestick Park and AT&T Park while their home stadium in Berkeley was being renovated.",
			"color": "pale|0.2733 golden|0.2733 rod|0.2733 wheat|0.13991 moccasin|0.10917 lemon|0.10592 chiffon|0.10592 light|0.063199 golden|0.063199 rod|0.063199 yellow|0.063199 navajo|0.052185 white|0.052185 blanched|0.022165 almond|0.022165 beige|0.020252 light|0.019586 yellow|0.019586 corn|0.019019 silk|0.019019 bisque|0.017367 tan|0.01509 papaya|0.014807 whip|0.014807 dark|0.014021 khaki|0.014021 antique|0.0096791 white|0.0096791 khaki|0.0089409 dark|0.006567 gray|0.006567 dark|0.006567 grey|0.006567 silver|0.0063562 light|0.0062638 steel|0.0062638 blue|0.0062638 light|0.0055442 gray|0.0055442 light|0.0055442 grey|0.0055442 old|0.0050298 lace|0.0050298 burly|0.0048439 wood|0.0048439 gainsboro|0.0043406 ivory|0.0041103 gray|0.0037235 grey|0.0037235 black|0.0035497 peach|0.0034881 puff|0.0034881  "
		}
	}
}
