{
	"add": {
		"doc": {
			"id": "7ed8b33d08c23bcd39f530ecb156389c24f29466d1de295d94c5f0dc6ab2feea",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/The_seizure_of_Edessa_in_Syria_by_the_Byzantine_army_and_the_Arabic_counterattack_from_the_Chronicle_of_John_Skylitzes.jpg/250px-The_seizure_of_Edessa_in_Syria_by_the_Byzantine_army_and_the_Arabic_counterattack_from_the_Chronicle_of_John_Skylitzes.jpg",
				"previous": "At the same time, the Empire was faced with new enemies. Provinces in southern Italy faced the Normans, who arrived in Italy at the beginning of the 11th century. During a period of strife between Constantinople and Rome culminating in the East-West Schism of 1054, the Normans began to advance, slowly but steadily, into Byzantine Italy.[98] Reggio, the capital of the tagma of Calabria, was captured in 1060 by Robert Guiscard, followed by Otranto in 1068. Bari, the main Byzantine stronghold in Apulia, was besieged in August 1068 and fell in April 1071.[99] The Byzantines also lost their influence over the Dalmatian coastal cities to Peter Krešimir IV of Croatia (r. 1058–1074/1075) in 1069.[100]",
				"after": "The greatest disaster took place in Asia Minor, however, where the Seljuq Turks made their first explorations across the Byzantine frontier into Armenia in 1065 and 1067. The emergency lent weight to the military aristocracy in Anatolia, who in 1068 secured the election of one of their own, Romanos Diogenes, as emperor. In the summer of 1071, Romanos undertook a massive eastern campaign to draw the Seljuks into a general engagement with the Byzantine army. At the Battle of Manzikert, Romanos suffered a surprise defeat by Sultan Alp Arslan, and he was captured. Alp Arslan treated him with respect and imposed no harsh terms on the Byzantines.[97] In Constantinople, however, a coup put in power Michael Doukas, who soon faced the opposition of Nikephoros Bryennios and Nikephoros Botaneiates. By 1081, the Seljuks had expanded their rule over virtually the entire Anatolian plateau from Armenia in the east to Bithynia in the west, and they had founded their capital at Nicaea, just 90 kilometres (56 miles) from Constantinople.[101]",
			"color": "black|0.1071 thistle|0.085765 dark|0.084065 gray|0.084065 dark|0.084065 grey|0.084065 gray|0.078247 grey|0.078247 dim|0.07799 gray|0.07799 dim|0.07799 grey|0.07799 rosy|0.070123 brown|0.070123 silver|0.063085 light|0.045472 gray|0.045472 light|0.045472 grey|0.045472 lavender|0.044534 gainsboro|0.034454 sienna|0.033875 light|0.031641 steel|0.031641 blue|0.031641 misty|0.025595 rose|0.025595 lavender|0.025344 blush|0.025344 light|0.022049 slate|0.022049 gray|0.022049 slate|0.020812 gray|0.020812 brown|0.019855 ghost|0.014482 white|0.014482 white|0.012813 smoke|0.012813 snow|0.010961 alice|0.010235 blue|0.010235 saddle|0.0094154 brown|0.0094154 sea|0.008847 shell|0.008847 white|0.0080817  "
		}
	}
}
