{
	"add": {
		"doc": {
			"id": "7ed85562ff17be08660a97be8c907ca4fc136a9f1fdbe5d0479860558fbeeb08",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Urville-Viti-Lebouka2.jpg/220px-Urville-Viti-Lebouka2.jpg",
				"previous": "In 1990, the new constitution institutionalised ethnic Fijian domination of the political system. The Group Against Racial Discrimination (GARD) was formed to oppose the unilaterally imposed constitution and to restore the 1970 constitution. In 1992 Sitiveni Rabuka, the Lieutenant Colonel who had carried out the 1987 coup, became Prime Minister following elections held under the new constitution. Three years later, Rabuka established the Constitutional Review Commission, which in 1997 wrote a new constitution which was supported by most leaders of the indigenous Fijian and Indo-Fijian communities. Fiji was re-admitted to the Commonwealth of Nations.",
				"after": "The year 2000 brought along another coup, instigated by George Speight, which effectively toppled the government of Mahendra Chaudhry, who in 1997 had become the country's first Indo-Fijian prime minister following the adoption of the new constitution. Commodore Frank Bainimarama assumed executive power after the resignation, possibly forced, of president Ratu Sir Kamisese Mara. Later in 2000, Fiji was rocked by two mutinies when rebel soldiers went on a rampage at Suva's Queen Elizabeth Barracks. The High Court ordered the reinstatement of the constitution, and in September 2001, to restore democracy, a general election was held which was won by interim prime minister Laisenia Qarase's Soqosoqo Duavata ni Lewenivanua party.[citation needed]",
			"color": "dark|0.158 gray|0.158 dark|0.158 grey|0.158 silver|0.1214 light|0.11151 gray|0.11151 light|0.11151 grey|0.11151 dim|0.10681 gray|0.10681 dim|0.10681 grey|0.10681 gray|0.10238 grey|0.10238 gainsboro|0.096211 white|0.039272 smoke|0.039272 linen|0.030205 slate|0.027962 gray|0.027962 sea|0.026269 shell|0.026269 snow|0.024155 alice|0.022853 blue|0.022853 ghost|0.022249 white|0.022249 light|0.019599 slate|0.019599 gray|0.019599 lavender|0.016822 blush|0.016822 white|0.01522 mint|0.014054 cream|0.014054 floral|0.013094 white|0.013094 azure|0.0097965 dark|0.0094408 slate|0.0094408 gray|0.0094408 black|0.005437 old|0.0045754 lace|0.0045754  "
		}
	}
}
