{
	"add": {
		"doc": {
			"id": "7ed9b504e2c65259fac4c2d8fe29b3a7ffc6b411c2ffd31ac26ba6359db91781",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Diagram_of_Hubble%27s_orbit.jpg/220px-Diagram_of_Hubble%27s_orbit.jpg",
				"previous": "The Space Telescope Science Institute (STScI) is responsible for the scientific operation of the telescope and the delivery of data products to astronomers. STScI is operated by the Association of Universities for Research in Astronomy (AURA) and is physically located in Baltimore, Maryland on the Homewood campus of Johns Hopkins University, one of the 39 US universities and seven international affiliates that make up the AURA consortium. STScI was established in 1981[41][42] after something of a power struggle between NASA and the scientific community at large. NASA had wanted to keep this function in-house, but scientists wanted it to be based in an academic establishment.[43][44] The Space Telescope European Coordinating Facility (ST-ECF), established at Garching bei München near Munich in 1984, provided similar support for European astronomers until 2011, when these activities were moved to the European Space Astronomy Centre.",
				"after": "One rather complex task that falls to STScI is scheduling observations for the telescope.[45] Hubble is in a low-Earth orbit to enable servicing missions, but this means that most astronomical targets are occulted by the Earth for slightly less than half of each orbit. Observations cannot take place when the telescope passes through the South Atlantic Anomaly due to elevated radiation levels, and there are also sizable exclusion zones around the Sun (precluding observations of Mercury), Moon and Earth. The solar avoidance angle is about 50°, to keep sunlight from illuminating any part of the OTA. Earth and Moon avoidance keeps bright light out of the FGSs, and keeps scattered light from entering the instruments. If the FGSs are turned off, however, the Moon and Earth can be observed. Earth observations were used very early in the program to generate flat-fields for the WFPC1 instrument. There is a so-called continuous viewing zone (CVZ), at roughly 90° to the plane of Hubble's orbit, in which targets are not occulted for long periods. Due to the precession of the orbit, the location of the CVZ moves slowly over a period of eight weeks. Because the limb of the Earth is always within about 30° of regions within the CVZ, the brightness of scattered earthshine may be elevated for long periods during CVZ observations.",
			"color": "black|0.51292 dim|0.14458 gray|0.14458 dim|0.14458 grey|0.14458 tan|0.065677 dark|0.046645 slate|0.046645 gray|0.046645 rosy|0.03014 brown|0.03014 peach|0.025705 puff|0.025705 gray|0.024115 grey|0.024115 dark|0.021349 olive|0.021349 green|0.021349  "
		}
	}
}
