{
	"add": {
		"doc": {
			"id": "7eed6d56db6b8bf01bef93272fdb34972fa55b7b963196ff1f604d0b5ee59a82",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Norton_Priory_arcade.jpg/220px-Norton_Priory_arcade.jpg",
			"previous": [],
				"after": "The archaeological remains are recognised as a Grade I listed building and a scheduled ancient monument, and are considered to be the most important monastic remains in Cheshire.[161][162] They consist of the former undercroft and the foundations of the church and monastic buildings that were exposed during the excavations. The undercroft stands outside the museum building. It is a single-storey structure consisting of seven pairs of bays divided into two compartments, one of four and the other of three bays. It is entered through the portico added to the west front of the country house in 1886 by way of a pair of arched doorways in Norman style. The doorway to the right (south) is original, dating from the late 12th century, while the other doorway is a replica dated 1886.[163] The older doorway has been described as \"the finest decorated Norman doorway in Cheshire\".[164] It is in good condition with little evidence of erosion and Greene considers that this is because it has always been protected from the weather.[55] The portico leads into the four-bay compartment. This has a tiled floor and contains a medieval-style fireplace.[165] The roof is ribbed vaulted.[166] On the east wall is a two-arched doorway leading to the former cloisters. To the north another archway leads to the three-bay compartment.[163] This also has a tile floor and contains the brick wine bins added in the 1780s.[165] The roof of this compartment has groined vaults.[166] The undercroft also contains a bell mould, reconstructed from the fragments of the original mould found in the excavations.[165]",
			"color": "dim|0.36959 gray|0.36959 dim|0.36959 grey|0.36959 gray|0.2277 grey|0.2277 black|0.13881 dark|0.093799 gray|0.093799 dark|0.093799 grey|0.093799 slate|0.051072 gray|0.051072 light|0.042823 slate|0.042823 gray|0.042823 silver|0.019175 tan|0.01568 rosy|0.014237 brown|0.014237  "
		}
	}
}
