{
	"add": {
		"doc": {
			"id": "7ef678085ce9f2128b77a4e789ef1ce1e9229a19ed39101174121d89539fb2f5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Pedro_II_angelo_agostini.jpg/210px-Pedro_II_angelo_agostini.jpg",
				"previous": "Republicanism—either support for a presidential or parliamentary republic—as an enduring political movement appeared in Brazil during December 1870 in Rio de Janeiro with the publishing of a manifesto signed by 57 people and with the creation of the Republican Club.[59][60][61] It represented an \"insignificant minority of scholars.\"[62] There was no repudiation of or desire for eliminating slavery in the manifesto.[59] In 1873, the Republican Party of São Paulo was created, and it affirmed that slavery would have to be resolved by the monarchist (Conservative and Liberal) parties. The reason for this was because many of the republicans from São Paulo were themselves slave-owning farmers.[63] The objective of most republicans was to wait until the death of Pedro II and by a plebiscite or other peaceful means, prevent Princess Isabel from ascending the throne.[60][64][65] Republicanism did not envisage any \"social readjustment\" (such as improving the quality of life for former-slaves), and they \"were not revolutionaries in the deep meaning of the word.\"[66] The republican movement \"had a slow and irregular evolution, concentrated in the provinces south of Bahia\"—more precisely in the provinces of São Paulo, Rio de Janeiro, Minas Gerais and Rio Grande do Sul.[63]",
				"after": "It was \"an extremely small group\"[67] with a \"precarious organization in the provinces\"[68] and no cohesion or connection among themselves.[67] The only republican faction to achieve political clout was the Republican Party of São Paulo, which managed to elect two deputies to the Chamber of Deputies in 1884,[60] though none were elected to the Empire's last legislature in 1889.[68] In the 1880s \"it attracted sympathy in lesser numbers than [slavery] abolitionism, and at a slower pace.\"[69] Its numbers only increased after 1888, adding new adherents consisting of farmers who had been slave owners and who perceived themselves victims of an unjust abolition of slavery that had not included any type of indemnity to them.[69][70][71] Even so, in 1889 the \"avowed republicans were probably a small minority\"[72] as the \"republican ideals, in reality, had never managed to seduce the people. Its dissemination was restricted to the intellectual and military fields.\"[73]",
			"color": " "
		}
	}
}
