{
	"add": {
		"doc": {
			"id": "7f0a17b9043378fe5de34805792d70857d5a683c167c501474b491d3be885734",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Russian_prisoners_tannenberg.jpg/300px-Russian_prisoners_tannenberg.jpg",
				"previous": "The outbreak of war on 1 August 1914 found Russia grossly unprepared. Russia and her allies placed their faith in her army, the famous 'Russian steamroller'.[75] Its pre-war regular strength was 1,400,000; mobilisation added 3,100,000 reserves and millions more stood ready behind them. In every other respect, however, Russia was unprepared for war. Germany had ten times as much railway track per square mile, and whereas Russian soldiers travelled an average of 800 miles (1,290 km) to reach the front, German soldiers travelled less than a quarter of that distance. Russian heavy industry was still too small to equip the massive armies the Tsar could raise, and her reserves of munitions were pitifully small; while the German army in 1914 was better equipped than any other, man-for-man, the Russians were severely short on artillery pieces, shells, motorised transports, and even boots. With the Baltic Sea barred by German U-boats and the Dardanelles by the guns of Germany's ally, Turkey, Russia initially could receive help only via Archangel which was frozen solid in winter, or via Vladivostok, which was over 4,000 miles (6,400 km) from the front line. By 1915, a rail line was built north from Petrozavodsk to the Kola Gulf and this connection laid the foundation of the ice-free port of what eventually was called Murmansk. The Russian High Command was moreover greatly weakened by the mutual contempt between Vladimir Sukhomlinov, the Minister of War, and the redoubtable warrior giant Grand Duke Nicholas Nikolayevich who commanded the armies in the field.[75] In spite of all of this, an immediate attack was ordered against the German province of East Prussia. The Germans mobilised there with great efficiency and completely defeated the two Russian armies which had invaded. The Battle of Tannenberg, where an entire Russian army was annihilated, cast an ominous shadow over the empire's future. The loyal officers lost were the very ones needed to protect the dynasty. The Russian armies later had moderate success against both the Austro-Hungarian armies and against the forces of the Ottoman Empire, but they never succeeded against the might of the German Army.",
				"after": "Gradually a war of attrition set in on the vast Eastern Front, where the Russians were facing the combined forces of the German and Austro-Hungarian Empires, and they suffered staggering losses. General Denikin, retreating from Galicia wrote, \"The German heavy artillery swept away whole lines of trenches, and their defenders with them. We hardly replied. There was nothing with which we could reply. Our regiments, although completely exhausted, were beating off one attack after another by bayonet ... Blood flowed unendingly, the ranks became thinner and thinner and thinner. The number of graves multiplied.\"[76] Total losses for the spring and summer of 1915 amounted to 1,400,000 killed or wounded, while 976,000 had been taken prisoner.[citation needed] On 5 August, with the Russian army in retreat, Warsaw fell. Defeat at the front bred disorder at home. At first, the targets were German, and for three days in June shops, bakeries, factories, private houses and country estates belonging to people with German names were looted and burned[citation needed]. The inflamed mobs then turned on the government, declaring the Empress should be shut up in a convent, the Tsar deposed and Rasputin hanged. Nicholas was by no means deaf to these discontents. An emergency session of the Duma was summoned, and a Special Defense Council established, its members drawn from the Duma and the Tsar's ministers.",
			"color": " "
		}
	}
}
