{
	"add": {
		"doc": {
			"id": "7f175bafb299bf049e5ac9e3ef29485db7e183235f759aec23a3fb9c3c21abcc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Primera_Junta_%28detalle%29.jpeg/250px-Primera_Junta_%28detalle%29.jpeg",
				"previous": "Liniers was succeeded by Baltasar Hidalgo de Cisneros a few months later, who pardoned the mutineers to reduce political conflicts. Cisneros allowed free trade as well, as instructed by the Junta of Seville, which benefited British merchants; Britain was allied with Spain in the Peninsular War. The agents of the Consulate of Cadiz asserted that this would hurt the local economy, moral values, social usages, religious practices, and the loyalty to Spain and its monarchy. As a result, Cisneros closed trade again, restoring the Spanish monopsony. A group of hacendados (owners of haciendas), who did not feel adequately represented at the Cabildo, asked Moreno to defend them. Moreno wrote The Representation of the Landowners, a report that represented the export interest of the landowners, encouraged free trade, and condemned the privileges of the merchants benefited from the monopsony. It is considered the most comprehensive economic report from the time of the viceroyalty. It represented the new European economic ideas, and noted that the legal monopsony with Spain did not prevent British goods from being smuggled. Several authors have questioned Moreno's authorship of the paper, considering it instead an update of another, previously drafted by Manuel Belgrano, Secretary of the Commerce Consulate of Buenos Aires, written to make a similar request to the former viceroy Liniers.[19] This report, as well as Moreno's prestige in the colonial society, helped him gain the confidence of Cisneros. Yet secretly, Moreno supported the plan to dismiss the Viceroy.",
				"after": "Mariano Moreno had several contacts with groups seeking the removal of Cisneros, but was not strongly involved with the May Revolution, which considered the fall of the Junta of Seville a reason to depose the viceroy and create a local junta. At the time, Moreno was still loyal to Álzaga. He attended the May 22 open Cabildo, but according to the father of Vicente Fidel López and the father-in-law of Bartolomé Mitre (both direct witness) he stayed silent at one side and did not join the debate.[20] He voted for Saavedra's proposal: to remove viceroy Cisneros and replace him with a Junta. Manuel Hermenegildo Aguirre, captain of hussars, proposed that the Cabildo take the reins of government, with five men appointed as counselors, Moreno among them. However, nobody else voted for that proposal, and it was the only one that included him.[21] Moreno felt betrayed when the Cabildo twisted the results of the open Cabildo and created a Junta that would be headed by Cisneros. He refused any further contacts with the revolutionaries and stayed home during the remaining events. The definitive members of the Junta came from a popular petition signed on May 25, which was given to the Cabildo. The reasons of Moreno's inclusion in the list are unclear, as with all other members of the Junta. A commonly accepted theory considers it to be a balance between Carlotists and Alzaguists.[22]",
			"color": "black|0.6413 antique|0.02883 white|0.02883 dim|0.024076 gray|0.024076 dim|0.024076 grey|0.024076 linen|0.023907 old|0.020444 lace|0.020444 tan|0.019355 sea|0.019083 shell|0.019083 floral|0.018886 white|0.018886 light|0.015808 gray|0.015808 light|0.015808 grey|0.015808 gray|0.015532 grey|0.015532 gainsboro|0.015479 dark|0.01413 gray|0.01413 dark|0.01413 grey|0.01413 ivory|0.014081 beige|0.013867 white|0.01378 smoke|0.01378 silver|0.012235 snow|0.011459 papaya|0.010959 whip|0.010959 mint|0.010735 cream|0.010735  "
		}
	}
}
