{
	"add": {
		"doc": {
			"id": "7f2695647c6eeadc084062cec49ebe4876a0136f859a652f53753cba9486fe63",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Monadnock_Lobby_crop.jpg/220px-Monadnock_Lobby_crop.jpg",
				"previous": "Donnell's goal was that the Monadnock would \"not only look as it originally did, it [would] also live as it used to\",[77] and he sought tenants for the street-level shops that were similar to their 19th-century occupants.[78] Shop windows were cleared of all signs and obstructions to preserve intended view from the corridor through to the street. Fluorescent lighting was prohibited and only gold leaf lettering on the glass was permitted for signage. Shops, all individually owned, were selected to fit the architectural character of the building.[78] A florist, for example, was chosen that evoked a turn-of-the-century atmosphere, as well as a barbershop with vintage fixtures and decor. A tobacconist with oak furnishings, a pen shop with glass cases, a shoe-shine stand, and other service establishments represented, in Donnell's words, \"the kind of small-scale entrepreneurs who occupied those spaces at the turn of the century, the kind of people who bring vitality and life to a building because they have a stake in it.\"[78]",
				"after": "The restoration was a success both critically and commercially. The building was 80 percent occupied when bought in 1979 and rented for $5.50 per square foot ($59.20 per square meter). By 1982, it was 91 percent occupied and commanded rent of $9 per square foot ($96.89 per square meter).[64] The Monadnock was selected as one of top restoration projects in the country by the National Trust for Historic Preservation in 1987, noting \"the outstanding quality of the overall restoration effort\", and the precision, detail and faithfulness of the interior restoration, in particular the lobby, which \"serves as a model for preservation nationwide.\"[70]",
			"color": "black|0.84474 saddle|0.07917 brown|0.07917  "
		}
	}
}
