{
	"add": {
		"doc": {
			"id": "7f58e9e6bb780b5d46061eb23272128dd38fa181a52679ea1f8527d29190801f",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5b/Rafted_parts_of_North_Crater.jpeg/220px-Rafted_parts_of_North_Crater.jpeg",
				"previous": "Kings Bowl Lava Field erupted during a single fissure eruption on the southern part of the Great Rift about 2,250 years ago. This eruption probably lasted only a few hours to a few days. The field preserves explosion pits, lava lakes, squeeze-ups, basalt mounds, and an ash blanket.[7] The Wapi Lava Field probably formed from a fissure eruption at the same time as the Kings Bowl eruption. More prolonged activity over a period of months to a few years led to the formation of low shield volcanos-(?) in the Wapi field. The Bear Trap lava tube, between the Craters of the Moon and the Wapi lava fields, is a cave system more than 15 miles (24 km) long.[27] The lava tube is remarkable for its length and for the number of well-preserved lava cave features, such as lava stalactites and curbs, the latter marking high stands of the flowing lava frozen on the lava tube walls. The lava tubes and pit craters of the monument are known for their unusual preservation of winter ice and snow into the hot summer months, due to shielding from the sun and the insulating properties of basalt.",
				"after": "A typical eruption along the Great Rift and similar basaltic rift systems starts with a curtain of very fluid lava shooting up to 1,000 feet (300 m) high along a segment of the rift up to 1 mile (1.6 km) long.[30] As the eruption continues, pressure and heat decrease and the chemistry of the lava becomes slightly more silica rich. The curtain of lava responds by breaking apart into separate vents. Various types of volcanoes may form at these vents: gas-rich pulverized lava creates cinder cones (such as Inferno Cone – stop 4), and pasty lava blobs form spatter cones (such as Spatter Cones – stop 5).[9] Later stages of an eruption push lava streams out through the side or base of cinder cones, which usually ends the life of the cinder cone (North Crater, Watchmen, and Sheep Trail Butte are notable exceptions). This will sometimes breach part of the cone and carry it away as large and craggy blocks of cinder (as seen at North Crater Flow – stop 2 – and Devils Orchard – stop 3). Solid crust forms over lava streams and lava tubes (a type of cave), and are created when lava vacates its course (examples can be seen at the Cave Area – stop 7).",
			"color": "dim|0.31444 gray|0.31444 dim|0.31444 grey|0.31444 black|0.257 gray|0.20965 grey|0.20965 dark|0.092883 gray|0.092883 dark|0.092883 grey|0.092883 silver|0.034594 light|0.017429 gray|0.017429 light|0.017429 grey|0.017429 slate|0.015191 gray|0.015191 dark|0.014072 olive|0.014072 green|0.014072 gainsboro|0.011858 light|0.0093275 slate|0.0093275 gray|0.0093275  "
		}
	}
}
