{
	"add": {
		"doc": {
			"id": "7f58d0b32d459d8d935aad9f825f088ea7eb9ba228e3bc7249d8a72b431e0c86",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/YogoDikeP420.jpg/150px-YogoDikeP420.jpg",
				"previous": "Montana sapphires were heavily mined during World War II for industrial abrasive and cutting purposes. However, because the Yogo mines were still owned by the English, the United States government could not control those operations, so the mines were little affected by the war, even though industrial sapphires were critical to the war effort.[68] The Yogo Sapphire Mining Corporation of Billings, Montana, was the next company to try to run the English Mine. They made an initial offer in 1946, and reached a deal by 1949. However, the purchase was not complete until 1956 because of legal issues. The sale was finally completed for $65,000 cash and some stock considerations because the company's capital was exhausted, similar to previous Yogo ventures. The Yogo Sapphire Mining Corporation then changed its name to be the same as the former English firm's name: New Mine Sapphire Syndicate. It became informally known as the \"American Syndicate\" to distinguish it from the previous \"English Syndicate\". Production was poor and mining ceased in September 1959.[71] From 1959 to 1963, the mine itself was left unattended and unsecured, resulting in hobbyists, picnickers, and rockhounds' coming from all over the US and Canada to gather loose rough sapphires. The American Syndicate took action to stop this in 1963, with fences and threats of prosecution.[72] The American Syndicate then tried leasing the mine to several operators. One of these was Siskon, Inc. of Nevada, which lost a significant amount of money.[73] They sued, and in May 1965 the Montana Supreme Court ruled in Siskon's favor.[74] Siskon bought the mine at a sheriff's sale and in turn leased it to a group headed by Arnold Baron, who had a background in gemcutting and jewelry. Baron organized German and Thai gemcutters and had success in marketing Yogos in America—the first such success in 50 years. However, owing to the difficulty in mining the hard rock site, he did not exercise his option to buy the mine, and Siskon sold it in August 1968 to Herman Yaras of Oxnard, California, for $585,000.[73]",
				"after": "In 1969, Yaras' Sapphire Village, Inc. created the Sapphire Village, a nearby homesite development offering buyers limited mining rights to gather their own sapphires with hand tools. Having done no significant mining or marketing, Sapphire Village, Inc. sold in 1973 to one of its investors, Chikara Kunisaki, a celery farmer from Oxnard, California. Kunisaki renamed the business Sapphire International Corporation and attempted to create a commercial mining operation. He built a modern 3,000-foot (910 m) tunnel at the site of the old American Mine, named the \"Kunisaki Tunnel\". But operation costs were so high that Sapphire International Corporation shut down in late 1976.[75] This was the last actual attempt to mine the American Mine section of the Yogo dike, and today, only the locked portal to the tunnel still exists.[76]",
			"color": " "
		}
	}
}
