{
	"add": {
		"doc": {
			"id": "7f5bc614c048377eb362f1366a55226d6d5f9fa9c51ff0fc362ca72bbf250274",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Allosaurus_%22Big_Al_II%22.jpg/220px-Allosaurus_%22Big_Al_II%22.jpg",
				"previous": "The left scapula and fibula of an Allosaurus fragilis specimen catalogued as USNM 4734 are both pathological, both probably due to healed fractures. The specimen USNM 8367 preserved several pathological gastralia which preserve evidence of healed fractures near their middle. Some of the fractures were poorly healed and \"formed pseudoarthroses.\" A specimen with a fractured rib was recovered from the Cleveland-Lloyd Quarry. Another specimen had fractured ribs and fused vertebrae near the end of the tail. An apparent subadult male Allosaurus fragilis was reported to have extensive pathologies, with a total of fourteen separate injuries. The specimen MOR 693 had pathologies on five ribs, the sixth neck vertebra the third eighth and thirteenth back vertebrae, the second tail vertebra and its chevron, the gastralia right scapula, manual phalanx I left ilium metatarsals III and V, the first phalanx of the third toe and the third phalanx of the second. The ilium had \"a large hole... caused by a blow from above\".The near end of the first phalanx of the third toe was afflicted by an involucrum.[106]",
				"after": "Other pathologies reported in Allosaurus include: Willow breaks in two ribs. Healed fractures in the humerus and radius. Distortion of joint surfaces in the foot possibly due to osteoarthritis or developmental issues. Osteopetrosis along the endosteal surface of a tibia.[90] Distortions of the joint surfaces of the tail vertebrae possibly due to osetoarthritis or developmental issues. \"[E]xtensive 'neoplastic' ankylosis of caudals,\" possibly due to physical trauma as well as the fusion of chevrons to centra. Coossification of vertebral centra near the end of the tail. Amputation of a chevron and foot bone, both possibly a result of bites. \"[E]xtensive exostoses\" in the first phalanx of the third toe. Lesions similar to those caused by osteomyelitis in two scapulae. Bone spurs in a premaxilla, ungual, and two metacarpals. Exostosis in a pedal phalanx possibly attributable to an infectious disease. A metacarpal with a round depressed fracture.[106]",
			"color": "white|0.063534 smoke|0.063534 snow|0.056017 mint|0.05481 cream|0.05481 white|0.054361 ghost|0.052252 white|0.052252 alice|0.050992 blue|0.050992 sea|0.049083 shell|0.049083 floral|0.048491 white|0.048491 azure|0.047191 lavender|0.043199 blush|0.043199 gainsboro|0.03905 light|0.038908 gray|0.038908 light|0.038908 grey|0.038908 silver|0.029525 honeydew|0.026254 dark|0.026045 gray|0.026045 dark|0.026045 grey|0.026045 red|0.024481 linen|0.022357 ivory|0.022292 lavender|0.019001 light|0.017271 cyan|0.017271 black|0.017062 gray|0.016812 grey|0.016812 dim|0.016602 gray|0.016602 dim|0.016602 grey|0.016602 old|0.012731 lace|0.012731 blue|0.011536 misty|0.010789 rose|0.010789 beige|0.0092661 lime|0.0071958 green|0.0071958 indian|0.0064293 red|0.0064293 thistle|0.0063984 light|0.0060089 green|0.0060089 light|0.0056565 yellow|0.0056565 lime|0.0053783 light|0.0052052 coral|0.0052052 medium|0.0047107 blue|0.0047107 pink|0.0043954 corn|0.0043287 silk|0.0043287 turquoise|0.0034248 antique|0.0033969 white|0.0033969 light|0.0032008 golden|0.0032008 rod|0.0032008 yellow|0.0032008  "
		}
	}
}
