{
	"add": {
		"doc": {
			"id": "7f6743d6eca17427325fb96d01ff830811769587f6877baa22ad376d6af4156e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Vietnam_Airlines_Boeing_777-200ER_in_new_livery_at_Hanoi.jpeg/220px-Vietnam_Airlines_Boeing_777-200ER_in_new_livery_at_Hanoi.jpeg",
				"previous": "As it is expected to be operating 170 aircraft in 2020, Vietnam Airlines is aiming to become the second-largest full-service carrier in Southeast Asia.[91] The airline is interested in launching services to the United States, where more than 1.2 million Vietnamese reside.[92] Such plans have been confirmed in December 2003, but have since been postponed because Vietnam is not yet part of Federal Aviation Administration's International Aviation Safety Assessment Program.[93] Vietnam Airlines also considered \"opening new routes such as Ho Chi Minh City/Hanoi, Vietnam–London; Ho Chi Minh City/Hanoi–Shanghai/Beijing, China; Ho Chi Minh City–Mumbai; Ho Chi Minh City–Brisbane; and Ho Chi Minh City–Doha\", according to CEO Pham Ngoc Minh in 2008.[94]",
				"after": "While the airline had launched flights to London-Gatwick,[95] Beijing[96] and Shanghai,[97] there are currently no flights to Mumbai, Doha, and Brisbane. The airline also plans to re-open flights to Berlin, and commence flights to Adelaide, Perth, Amsterdam, Milan, Prague, Mandalay, Dalian, Nanjing, Hangzhou and African cities; by 2020, Vietnam Airlines is expected to serve 53 international destinations, up from 27 in 2011.[98] By 2020, Vietnam Airlines plans to increase its annual revenue to US$7 billion – up from $1.86 billion in 2010 – by carrying 620,000 tonnes of cargo and 35 million passengers, using a fleet of 163 aircraft (later revised to 41 million passengers using 170 aircraft).[99] It aims to capture a 45% market share of Vietnam's aviation market. During its first 15 years of operation, from 1996 to 2010, Vietnam Airlines carried a total of 82 million passengers on 678,550 flights.[100] In addition, Vietnam Airlines plans to transfer most of its international operations from its current hub, Tan Son Nhat International Airport, to the proposed Long Thanh International Airport. With a cost of approximately US$6 billion,[101][102] the airport will, according to Vietnamese authorities, help Vietnam Airlines boost its operations internationally as it seeks to bypass Thailand as the dominant gateway to the Greater-Mekong region.[103] London operations were transferred from Gatwick to Heathrow in early 2015 (2015). The airline plans to operate Boeing 787 aircraft to this destination since July 2015 (2015-07).[104]",
			"color": "dark|0.36086 gray|0.36086 dark|0.36086 grey|0.36086 gray|0.21065 grey|0.21065 silver|0.13192 dim|0.12079 gray|0.12079 dim|0.12079 grey|0.12079 slate|0.05749 gray|0.05749 light|0.030924 slate|0.030924 gray|0.030924 steel|0.030465 blue|0.030465 light|0.0068196 gray|0.0068196 light|0.0068196 grey|0.0068196 light|0.0061002 steel|0.0061002 blue|0.0061002 golden|0.0052053 rod|0.0052053 black|0.0037624  "
		}
	}
}
