{
	"add": {
		"doc": {
			"id": "7f6839efb1d969fccd6e3970dec5ce58c93a727bc1da18798b9794afb71fb488",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Trait-du-nord01_SDA2012.JPG/133px-Trait-du-nord01_SDA2012.JPG",
			"previous": [],
				"after": "The Trait du Nord is a breed of heavy draft horse developed in the area of Hainaut in western Belgium and in northeastern France. Originating in the fertile Flemish grasslands, it was bred for size and pulling power for agricultural work. Horses of the breed are considered to be gentle and easy to handle. They have many colors, although bay and roan are the most common. Originally considered a subtype of the Ardennes horse, it was recognized as an individual breed with the opening of a studbook in 1903. The Trait du Nord was used extensively in mining from the late 19th century through 1920 (and occasionally through the 1960s), and in agriculture through World War II. During the mid-20th century, the breed was in demand for the production of horse meat, but this demand began to decline by the early 1970s, and the Trait du Nord, like many European draft breeds, was in danger of extinction. In the 1990s the breed experienced a slight revival through an increased interest in recreational riding and driving, but it is still considered to be endangered by the French government, with a high risk of inbreeding: there are fewer than 100 new foal births a year. The national breed registry in France is working with local groups to reverse the decline. (Full article...)",
			"color": "black|0.20155 wheat|0.13876 pale|0.10644 golden|0.10644 rod|0.10644 dark|0.094349 khaki|0.094349 lemon|0.072918 chiffon|0.072918 light|0.067425 golden|0.067425 rod|0.067425 yellow|0.067425 gray|0.040189 grey|0.040189 dim|0.03927 gray|0.03927 dim|0.03927 grey|0.03927 dark|0.025839 gray|0.025839 dark|0.025839 grey|0.025839 light|0.015785 yellow|0.015785 white|0.012198 smoke|0.012198 snow|0.011501 corn|0.011404 silk|0.011404 silver|0.011305 white|0.010979 ghost|0.010927 white|0.010927 alice|0.010589 blue|0.010589 sea|0.010432 shell|0.010432 mint|0.0097759 cream|0.0097759 lavender|0.009678 blush|0.009678 azure|0.0093731 floral|0.0093164 white|0.0093164 tan|0.0088518 light|0.0085595 gray|0.0085595 light|0.0085595 grey|0.0085595 gainsboro|0.0072591  "
		}
	}
}
