{
	"add": {
		"doc": {
			"id": "7f7401e8ff3c9a8fe5757bbf99edbcb1046287b3d08486d3aa3027304c2ca0aa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Map_Byzantine_Empire_1025-en.svg/300px-Map_Byzantine_Empire_1025-en.svg.png",
				"previous": "A great imperial expedition under Leo Phocas and Romanos I Lekapenos ended with another crushing Byzantine defeat at the Battle of Achelous in 917, and the following year the Bulgarians were free to ravage northern Greece. Adrianople was plundered again in 923, and a Bulgarian army laid siege to Constantinople in 924. Simeon died suddenly in 927, however, and Bulgarian power collapsed with him. Bulgaria and Byzantium entered a long period of peaceful relations, and the Empire was now free to concentrate on the eastern front against the Muslims.[83] In 968, Bulgaria was overrun by the Rus' under Sviatoslav I of Kiev, but three years later, John I Tzimiskes defeated the Rus' and re-incorporated Eastern Bulgaria into the Byzantine Empire.[84]",
				"after": "Bulgarian resistance revived under the rule of the Cometopuli dynasty, but the new emperor Basil II (r. 976–1025) made the submission of the Bulgarians his primary goal.[85] Basil's first expedition against Bulgaria, however, resulted in a humiliating defeat at the Gates of Trajan. For the next few years, the emperor would be preoccupied with internal revolts in Anatolia, while the Bulgarians expanded their realm in the Balkans. The war dragged on for nearly twenty years. The Byzantine victories of Spercheios and Skopje decisively weakened the Bulgarian army, and in annual campaigns, Basil methodically reduced the Bulgarian strongholds.[85] At the Battle of Kleidion in 1014 the Bulgarians were annihilated: their army was captured, and it is said that 99 out of every 100 men were blinded, with the hundredth man left with one eye so he could lead his compatriots home. When Tsar Samuil saw the broken remains of his once gallant army, he died of shock. By 1018, the last Bulgarian strongholds had surrendered, and the country became part of the Empire.[85] This victory restored the Danube frontier, which had not been held since the days of the emperor Heraclius.[79]",
			"color": "lavender|0.20718 alice|0.2042 blue|0.2042 light|0.066315 blue|0.066315 powder|0.041648 blue|0.041648 linen|0.035492 old|0.034218 lace|0.034218 sea|0.034201 shell|0.034201 floral|0.033998 white|0.033998 antique|0.03393 white|0.03393 beige|0.032798 ivory|0.032616 snow|0.031786 papaya|0.030139 whip|0.030139 white|0.029795 smoke|0.029795 dark|0.026939 gray|0.026939 dark|0.026939 grey|0.026939 sky|0.021225 blue|0.021225 silver|0.015064 gainsboro|0.011556 light|0.010316 gray|0.010316 light|0.010316 grey|0.010316 light|0.0071232 steel|0.0071232 blue|0.0071232 light|0.0066671 cyan|0.0066671 corn|0.006064 silk|0.006064 pale|0.0057031 turquoise|0.0057031 gray|0.0054724 grey|0.0054724 light|0.0047282 green|0.0047282 mint|0.004395 cream|0.004395 light|0.0036542 slate|0.0036542 gray|0.0036542 azure|0.0033704 dark|0.0031196 sea|0.0031196 green|0.0031196  "
		}
	}
}
