{
	"add": {
		"doc": {
			"id": "7f7da51a5a8b2531484a35087242220bbbd82666b20d77074d587ed37f2319e6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Ranjitsinh.jpeg/220px-Ranjitsinh.jpeg",
			"previous": [],
				"after": "The British brought cricket to India in the early 1700s, with the first cricket match played in 1721.[7] In 1848, the Parsi community in Bombay formed the Oriental Cricket Club, the first cricket club to be established by Indians. After slow beginnings, the Europeans eventually invited the Parsis to play a match in 1877.[8] By 1912, the Parsis, Sikhs, Hindus and Muslims of Bombay played a quadrangular tournament with the Europeans every year.[8] In the early 1900s, some Indians went on to play for the English cricket team. Some of these, such as Ranjitsinhji and KS Duleepsinhji were greatly appreciated by the British and their names went on to be used for the Ranji Trophy and Duleep Trophy – two major first-class tournaments in India. In 1911, an Indian team went on its first official tour of England, but only played English county teams and not the English cricket team.[9] India was invited into The Imperial Cricket Council in 1926, and made its debut as a Test playing nation in 1932, led by CK Nayudu.[10] The match was given Test status despite being only three days in length. The team was not strong in its batting at this point and went on to lose by 158 runs.[11] The Indian team continued to improve throughout the 1930s and '40s but did not achieve an international victory during this period. The team's first series as an independent country was in 1948 against Sir Donald Bradman's Invincibles (a name given to the Australia national cricket team of that time). Australia won the five-match series, 4–0.[12]",
			"color": "antique|0.21693 white|0.21693 peach|0.14975 puff|0.14975 misty|0.1234 rose|0.1234 tan|0.10182 bisque|0.07099 linen|0.06877 papaya|0.060514 whip|0.060514 blanched|0.04803 almond|0.04803 old|0.040773 lace|0.040773 sea|0.030158 shell|0.030158 floral|0.017271 white|0.017271  "
		}
	}
}
