{
	"add": {
		"doc": {
			"id": "7f7ec9837d7d1f40824ab8db4cf911ef5ecfc44bce82c2f70455cda74a3179b4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Pepys_portrait_by_Kneller.png/170px-Pepys_portrait_by_Kneller.png",
				"previous": "There are three such plats depicting naval actions and expeditions that are attributed to Anthony: the route of Anne of Cleves from the Low Countries to England (1539), a French attack on a coastal fort (date unknown) and a French raid on Brighton (July 1545). The design of the ships in these paintings, especially that of the Brighton raid, closely match those in the rolls. It is not known exactly when work on the rolls began nor when it was finished. It is only certain that it was presented to the king the year it was dated, 1546. The inclusion of the Mary Rose that sank at the Battle of the Solent 19 July 1545 does not mean it was necessarily started before this date, since it was still considered possible that she could be raised even as late as 1549. The galleasses, the Antelope, Hart, Bull and Tiger, all present in the second roll, were still being built around March 1546, and the Hart was not at sea until October that year. At the same time the Galley Blanchard, captured from the French 18 May 1546 is not included.[7]",
				"after": "After the rolls were presented to the king they were archived in the royal collections. In 1680 Charles II gave two of the rolls to Samuel Pepys, a navy administrator and avid book collector. Pepys did not disclose the details of how the rolls were given to him, but it is believed that the gift came out of a meeting with King Charles where Pepys took down the king's account of how he escaped from the Battle of Worcester (1651). The plan was that Pepys would edit and publish the already famous story, but he never did so. It is also known that Pepys was planning to write a history of the navy and that he was gathering material for this task, but this project also was never finished. It is considered likely that King Charles was aware of Pepys' plans and presented him with two of the rolls either as a gift or as payment for the intended publication of the escape story. The second roll could not be located at that time, and it was not until 1690 that it was discovered by Henry Thynne, keeper of the royal library 1677–89 and a close friend of Pepys. Thynne arranged for Pepys to make copies of some of the illustrations, but by 1690 Charles was dead and James II was in exile. Pepys had resigned from his position as Secretary of the Admiralty that same year and refused to recognize the reign of William and Mary, which meant that acquisition of the final roll for his collection was out of the question. The creation of the codex from the first and third rolls is therefore assumed to have been completed shortly after that time. After Pepys' death in 1703 his library passed on to his nephew John Jackson. After the death of Jackson in 1724 the library, along with the codex, was then passed on to Pepys' old college at Magdalene, Cambridge, where it remains to this day.[8]",
			"color": "gainsboro|0.17569 light|0.16319 gray|0.16319 light|0.16319 grey|0.16319 white|0.096528 smoke|0.096528 linen|0.084028 alice|0.065278 blue|0.065278 ghost|0.065278 white|0.065278 snow|0.065278 lavender|0.065278 blush|0.065278 sea|0.065278 shell|0.065278 silver|0.041667 mint|0.0375 cream|0.0375 white|0.0375 floral|0.025 white|0.025 azure|0.0125  "
		}
	}
}
