{
	"add": {
		"doc": {
			"id": "7f7ff81313bb7739b2c068572b553f3c8a8bd434b5480edf943b50b429e42d97",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Fulmarus_glacialis_1_8.jpg/220px-Fulmarus_glacialis_1_8.jpg",
				"previous": "Procellariids, as well as having strong natal philopatry, exhibit strong site fidelity, returning to the same nesting site, burrow or territory in sequential years. The figure varies for different species but is high for most species, an estimated 91% for Bulwer's petrels.[32] The strength of this fidelity can also vary with sex; almost 85% of male Cory's shearwaters return to the same burrow to breed the year after a successful breeding attempt, while the figure for females is around 76%.[33] This tendency towards using the same site from year to year is matched by strong mate fidelity, with birds breeding with the same partner for many years; in fact it is suggested that the two are linked,[34] site fidelity being a means by which partnered birds could meet at the beginning of the breeding season. One pair of northern fulmars bred as a pair in the same site for 25 years.[35] Like the albatrosses the procellariids take several years to reach sexual maturity, though due to the greater variety of sizes and lifestyles, the age of first breeding stretches from just three years in the smaller species to 12 years in the larger ones.",
				"after": "The procellariids lack the elaborate breeding dances of the albatrosses, in no small part due to the tendency of most of them to attend colonies at night and breed in burrows, where visual displays are useless. The fulmarine petrels, which nest on the surface and attend their colonies diurnally, do use a repertoire of stereotyped behaviours such as cackling, preening, head waving and nibbling, but for most species courtship interactions are limited to some billing (rubbing the two bills together) in the burrow and the vocalisations made by all species. The calls serve a number of functions: they are used territorially to protect burrows or territories and to call for mates. Each call type is unique to a particular species and indeed it is possible for procellariids to identify the sex of the bird calling as well. It may also be possible to assess the quality of potential mates; a study of blue petrels found a link between the rhythm and duration of calls and the body mass of the bird.[36] The ability of an individual to recognise its mate has also been demonstrated in several species.",
			"color": "tan|0.15321 dark|0.10519 gray|0.10519 dark|0.10519 grey|0.10519 dim|0.10195 gray|0.10195 dim|0.10195 grey|0.10195 silver|0.09744 gray|0.088962 grey|0.088962 light|0.077305 gray|0.077305 light|0.077305 grey|0.077305 gainsboro|0.060326 thistle|0.030261 black|0.028668 lavender|0.027228 white|0.023197 smoke|0.023197 lavender|0.022787 blush|0.022787 ghost|0.020938 white|0.020938  "
		}
	}
}
