{
	"add": {
		"doc": {
			"id": "7f847b3aab9bdea8f633cf8b0d8098ec535eadb3a6ee85774f93529dbe35ec39",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/SerpentineUSGOV.jpg/170px-SerpentineUSGOV.jpg",
				"previous": "Among the oldest rocks in Oregon, some of the formations in these terranes date to the Triassic, nearly 250 million years ago.[26] Between 165 and 170 million years ago, in the Jurassic, faulting consolidated the Klamath terranes offshore during what geologists call the Siskiyou orogeny. This three- to five-million-year episode of intense tectonic activity pushed sedimentary rocks deep enough into the mantle to melt them and then forced them to the surface as granitic plutons. Belts of plutons, which contain gold and other precious metals, run through the Klamaths and include the Ashland pluton, the Grayback batholith east of Oregon Caves National Monument, the Grants Pass pluton, the Gold Hill pluton, the Jacksonville pluton, and others.[25] Miners have worked rich deposits of gold, silver, copper, nickel, and other metals in several districts of the Klamaths. Placer mining in the mid-19th century soon led to lode mining for gold. Aside from a mine in eastern Oregon, the Greenback Mine along Grave Creek, a Rogue tributary, was the most productive gold mine in Oregon.[26]",
				"after": "In Curry County, the lower Rogue passes through the Galice Formation, metamorphosed shale and other rocks formed when a small oceanic basin in the merging Klamath terranes was thrust over other Klamath rocks about 155 million years ago. The lowest part of the seafloor of the Josephine Basin, as this ancient sea came to be called, rests on top of the Kalmiopsis Wilderness, where it is known as the Josephine ophiolite. Some of its rocks are peridotite, reddish-brown when exposed to oxygen but very dark green inside. According to geologist Ellen Morris Bishop, \"These odd tawny peridotites in the Kalmiopsis Wilderness are among the world’s best examples of rocks that form the mantle.\"[25] Metamorphosed peridotite appears as serpentine along the west side of the Illinois River.[25] Chemically unsuited for growing plants, widespread serpentinite in the Klamaths supports sparse vegetation in parts of the watershed.[22] The Josephine peridotite was a source of valuable chromium ore, mined in the region between 1917 and 1960.[25]",
			"color": "black|0.58169 dim|0.14622 gray|0.14622 dim|0.14622 grey|0.14622 dark|0.1265 slate|0.1265 gray|0.1265 gray|0.075575 grey|0.075575 dark|0.030702 gray|0.030702 dark|0.030702 grey|0.030702 slate|0.010193 gray|0.010193 light|0.009219 slate|0.009219 gray|0.009219 silver|0.0088633  "
		}
	}
}
