{
	"add": {
		"doc": {
			"id": "7f8435470292075e919822168f176dec7a3249d5108d344d8db7d8eefdda4ee0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/The_Happy_Land_-_Illustrated_London_News%2C_March_22%2C_1873.PNG/250px-The_Happy_Land_-_Illustrated_London_News%2C_March_22%2C_1873.PNG",
				"previous": "Many of the plot elements of the German Reed Entertainments (as well as some from his earlier plays and Bab Ballads) would be reused by Gilbert later in the Gilbert and Sullivan operas. These elements include paintings coming to life (Ages Ago, used again in Ruddigore), a deaf nursemaid binding a respectable man's son to a \"pirate\" instead of to a \"pilot\" by mistake (Our Island Home, 1870, reused in The Pirates of Penzance), and the forceful mature lady who is \"an acquired taste\" (Eyes and No Eyes, 1875, reused in The Mikado).[33] During this time, Gilbert perfected the 'topsy-turvy' style that he had been developing in his Bab Ballads, where the humour was derived by setting up a ridiculous premise and working out its logical consequences, however absurd.[34] Mike Leigh describes the \"Gilbertian\" style as follows: \"With great fluidity and freedom, [Gilbert] continually challenges our natural expectations. First, within the framework of the story, he makes bizarre things happen, and turns the world on its head. Thus the Learned Judge marries the Plaintiff, the soldiers metamorphose into aesthetes, and so on, and nearly every opera is resolved by a deft moving of the goalposts.... His genius is to fuse opposites with an imperceptible sleight of hand, to blend the surreal with the real, and the caricature with the natural. In other words, to tell a perfectly outrageous story in a completely deadpan way.\"[35]",
				"after": "At the same time, Gilbert created several 'fairy comedies' at the Haymarket Theatre. This series of plays was founded upon the idea of self-revelation by characters under the influence of some magic or some supernatural interference.[36] The first was The Palace of Truth (1870), based partly on a story by Madame de Genlis. In 1871, with Pygmalion and Galatea, one of seven plays that he produced that year, Gilbert scored his greatest hit to date. Together, these plays and their successors such as The Wicked World (1873), Sweethearts (1874), and Broken Hearts (1875), did for Gilbert on the dramatic stage what the German Reed entertainments had done for him on the musical stage: they established that his capabilities extended far beyond burlesque, won him artistic credentials, and demonstrated that he was a writer of wide range, as comfortable with human drama as with farcical humour. The success of these plays, especially Pygmalion and Galatea, gave Gilbert a prestige that would be crucial to his later collaboration with as respected a musician as Sullivan.[37]",
			"color": "dim|0.29801 gray|0.29801 dim|0.29801 grey|0.29801 gray|0.28185 grey|0.28185 dark|0.17844 gray|0.17844 dark|0.17844 grey|0.17844 silver|0.076982 light|0.042264 gray|0.042264 light|0.042264 grey|0.042264 gainsboro|0.031433 black|0.023197 white|0.011012 smoke|0.011012 alice|0.0070603 blue|0.0070603 lavender|0.0069761 blush|0.0069761 ghost|0.0069082 white|0.0069082 sea|0.0067281 shell|0.0067281 snow|0.0065822 white|0.0056846 mint|0.0048618 cream|0.0048618 linen|0.0044261 floral|0.0039053 white|0.0039053 azure|0.0035153  "
		}
	}
}
