{
	"add": {
		"doc": {
			"id": "7fa967ba0eb99cbc9cd0848271b037e292bd20def683edcaf4f390407f7ba687",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Maurzyce_2009_%280%29.jpg/220px-Maurzyce_2009_%280%29.jpg",
				"previous": "Resistance welding was also developed during the final decades of the 19th century, with the first patents going to Elihu Thomson in 1885, who produced further advances over the next 15 years. Thermite welding was invented in 1893, and around that time another process, oxyfuel welding, became well established. Acetylene was discovered in 1836 by Edmund Davy, but its use was not practical in welding until about 1900, when a suitable torch was developed.[12] At first, oxyfuel welding was one of the more popular welding methods due to its portability and relatively low cost. As the 20th century progressed, however, it fell out of favor for industrial applications. It was largely replaced with arc welding, as metal coverings (known as flux) for the electrode that stabilize the arc and shield the base material from impurities continued to be developed.[13]",
				"after": "World War I caused a major surge in the use of welding processes, with the various military powers attempting to determine which of the several new welding processes would be best. The British primarily used arc welding, even constructing a ship, the \"Fullagar\" with an entirely welded hull.[14][15] Arc welding was first applied to aircraft during the war as well, as some German airplane fuselages were constructed using the process.[16] Also noteworthy is the first welded road bridge in the world, the Maurzyce Bridge designed by Stefan Bryła of the Lwów University of Technology in 1927, and built across the river Słudwia near Łowicz, Poland in 1928.[17]",
			"color": "black|0.3953 dark|0.12145 olive|0.12145 green|0.12145 dark|0.083431 gray|0.083431 dark|0.083431 grey|0.083431 gray|0.073181 grey|0.073181 silver|0.055786 dim|0.053495 gray|0.053495 dim|0.053495 grey|0.053495 light|0.045244 gray|0.045244 light|0.045244 grey|0.045244 gainsboro|0.036534 tan|0.013925 white|0.011965 smoke|0.011965 slate|0.010377 gray|0.010377 linen|0.010372 sea|0.0088104 shell|0.0088104 light|0.0079004 slate|0.0079004 gray|0.0079004 snow|0.0072756 floral|0.0064113 white|0.0064113 ghost|0.0060785 white|0.0060785 alice|0.005769 blue|0.005769 lavender|0.0054202 blush|0.0054202 white|0.0053683 mint|0.0050779 cream|0.0050779  "
		}
	}
}
