{
	"add": {
		"doc": {
			"id": "7fb7e74e777762a728092c8ff46a4c472ff8a37a69db3ca44bee8aaa294c856c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Old_norse%2C_ca_900.PNG/220px-Old_norse%2C_ca_900.PNG",
				"previous": "Westrobothnian (måLe or bondska[1]) is a number of closely related non-standardized Scandinavian dialects spoken natively in the coast of the historical province of Westrobothnia in co-existence with Finnish, Sami and during the last centuries, national standard language Swedish. Westrobothnian is the northernmost dialect group of the North Germanic languages in Sweden and borders the traditional Sami speaking Lapland to the west and Finnish speaking Torne Valley to the north. Like all Scandinavian, the different varieties of Westrobothnian originate in Proto-Norse and dialects of Old Norse, spoken by immigrating Germanic settlers during the Viking Age. It has three grammatical genders in most dialects, two plural forms of indefinite nouns, and broad usage of definite nouns. Nouns are also inflected differently in the dative and accusative case. Some adjectives can be serially joined with nouns and some have two plural forms. A pleonastic article is always used before people's and pet's names in the vocative and when referring to a person.",
			"after": {
				"_ArrayType_": "double",
				"_ArraySize_": [0,0],
				"_ArrayData_": null
			},
			"color": "gainsboro|0.082633 white|0.081894 smoke|0.081894 ghost|0.080377 white|0.080377 snow|0.079922 alice|0.079787 blue|0.079787 lavender|0.079074 blush|0.079074 sea|0.079058 shell|0.079058 white|0.078865 linen|0.077566 mint|0.074827 cream|0.074827 lime|0.048734 coral|0.032092 red|0.022683 light|0.017015 steel|0.017015 blue|0.017015 lavender|0.013621 floral|0.0097096 white|0.0097096 light|0.0092195 gray|0.0092195 light|0.0092195 grey|0.0092195 yellow|0.0091507 silver|0.0048103 azure|0.0043387 rosy|0.0041081 brown|0.0041081 indian|0.0035684 red|0.0035684 dark|0.0027629 salmon|0.0027629  "
		}
	}
}
