{
	"add": {
		"doc": {
			"id": "7fca492565b4ed447e55d3564c69b0f1b4364c33b51b0074bb17e3f1a0bdc445",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Eva.air.cargo.arp.750pix.B-16113.jpg/220px-Eva.air.cargo.arp.750pix.B-16113.jpg",
				"previous": "In 1981, a Continental DC-10-10 (registration number N68048) was leased to conduct more research, particularly the effects the newly designed winglets would have on aircraft performance. Different types of winglets were tested during that time in conjunction with NASA. McDonnell Douglas was again planning new DC-10 versions that could incorporate winglets and more efficient engines developed at the time by Pratt & Whitney (PW2037) and Rolls-Royce (RB.211-535F4). The manufacturer finally rationalized all these studies under the MD-EEE (Ecology-Economy-Efficiency) designation, that was later modified to the MD-100 following some more changes. The MD-100 was proposed in two versions: the Series 10, having an airframe shorter by 6 ft 6 in (1.98 m) compared to the DC-10 and seating up to 270 passengers in a mixed-class configuration; and the Series 20, incorporating a fuselage stretch of 20 ft 6 in (6.25 m) over the DC-10 and able to seat up to 333 passengers in the same kind of configuration as the Series 10. Both versions could be powered by the same engine families as the actual MD-11 plus the RB.211-600. However, the situation for the manufacturer, and the airline industry in general, did not look bright. No new DC-10 orders were received, and many among the observers and customers doubted that the manufacturer would be operating much longer. Thus, the Board of Directors decided in November 1983 to once again cease all work on the projected new trijet.[2]",
				"after": "The following year no new orders for the DC-10 were received. The production line was kept active thanks to earlier orders from the U.S. Air Force for 60 KC-10A tankers. McDonnell Douglas was still convinced that a new derivative for the DC-10 was needed, as shown by the second-hand market for their Series 30 and the heavier DC-10-30ER version. Thus, in 1984 a new derivative aircraft version of the DC-10 was designated MD-11. From the very beginning, the MD-11X was conceived in two different versions. The MD-11X-10, based on a DC-10-30 airframe, offered a range of 6,500 nautical miles (12,000 km) with passengers. That first version would have had a maximum takeoff weight (MTOW) of 580,000 pounds (260,000 kg) and would have used CF6-C2 or PW4000 engines. The MD-11X-20 was to have a longer fuselage, accommodating up to 331 passengers in a mixed-class layout, and a range of 6,000 nautical miles (11,000 km).[2]",
			"color": "black|0.4521 dim|0.19216 gray|0.19216 dim|0.19216 grey|0.19216 gray|0.074563 grey|0.074563 dark|0.063758 slate|0.063758 gray|0.063758 dark|0.03976 green|0.03976 forest|0.036252 green|0.036252 sea|0.03371 green|0.03371 medium|0.029744 sea|0.029744 green|0.029744 slate|0.016448 gray|0.016448 dark|0.015202 gray|0.015202 dark|0.015202 grey|0.015202 dark|0.012508 sea|0.012508 green|0.012508  "
		}
	}
}
