{
	"add": {
		"doc": {
			"id": "7fd3c752881c3d17b3e1b33150137fcb7dc39ee2b4344440374fd331e140b67f",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/c/c5/CGMacartney.jpg/250px-CGMacartney.jpg",
				"previous": "Macartney had a moderately successful debut. He bowled three wicketless overs in the first innings,[12] before scoring 35 in Australia's reply while batting at No. 7.[11][14] He took one wicket, that of leading English batsman Wilfred Rhodes.[13] With Australia needing 274 runs to win in the second innings, Noble decided that Macartney's first innings effort warranted promotion to act as Trumper's opening partner. He managed to score only nine, but Australia managed to scrape home to seal a two wicket victory.[11][14][15] Macartney's domestic form after his Test debut was sufficient for him to retain his position for the Second Test in Melbourne. Noble persevered with Macartney as Trumper's opening partner and he scored 37 of an 84 run opening partnership in the first innings.[12][16] He returned to the middle order in the second innings to score 54 and took a total of 1/55 as England squared the series with a narrow one wicket victory.[11][12][15]",
				"after": "His most productive batting of the series came in the Third Test in Adelaide, when he scored 75 batting at No. 3 and took two wickets for 66 runs (2/66) in an Australian victory. His batting was largely ineffectual in the last two Tests; he failed to score more than 30 in any innings as he was moved to No. 8 and then back to the opening position in the Fifth Test. Despite his confused role as a batsman, he contributed with the ball in the Fifth Test victory on a pitch amenable to spin,[11][15] taking match figures of 5/66. His first international series had yielded 273 runs at an average of 27.30 and ten wickets at an average of 26.60.[15] He tasted victory, with Australia taking the series 4–0.[17] His highest score of the season was 96 against England in a later match for New South Wales. The hosts were 12 runs short of victory with one wicket in hand when time ran out.[12] Macartney scored 524 runs at 27.58 and took 25 wickets at 28.76 in 12 matches.[12] In spite of his unsettled role in the batting line up, Macartney had performed well-enough as an all-rounder in the following domestic season in 1908–09 to be selected for the 1909 tour of England, his first overseas tour.[11] Macartney took a total of 6/60 in an innings victory over South Australia in the first match of the season. He then scored 100 in the return match,[12] and ended the six matches of the summer with 319 runs at 53.17 and nine wickets at 29.89.[12]",
			"color": "tan|0.2173 black|0.093702 antique|0.066594 white|0.066594 linen|0.055967 gainsboro|0.05193 light|0.043766 gray|0.043766 light|0.043766 grey|0.043766 sea|0.042614 shell|0.042614 misty|0.037847 rose|0.037847 old|0.037803 lace|0.037803 white|0.032316 smoke|0.032316 floral|0.031985 white|0.031985 dim|0.03132 gray|0.03132 dim|0.03132 grey|0.03132 lavender|0.027772 blush|0.027772 bisque|0.026426 snow|0.026152 gray|0.025908 grey|0.025908 dark|0.025272 gray|0.025272 dark|0.025272 grey|0.025272 silver|0.021561 papaya|0.017087 whip|0.017087 wheat|0.016471 blanched|0.015168 almond|0.015168 ghost|0.011484 white|0.011484  "
		}
	}
}
