{
	"add": {
		"doc": {
			"id": "7fd501007cc9a38becc1b2bd46be7c2620b4598d9ee80f31063714bbf928e17d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Boletus_rex-veris_42967.jpg/220px-Boletus_rex-veris_42967.jpg",
				"previous": "Molecular phylogenetic analyses have proven these three are all distinctive and separate species;[37] other taxa formerly believed to be unique species or subspecies, such as B. betulicola, B. chippewaensis, B. persoonii, B. quercicola and B. venturii, are now known to be part of a B. edulis species complex with a wide morphological, ecological and geographic range,[38][39] and that the genetic variability in this complex is low.[40] Similar molecular technology has been developed to rapidly and accurately identify B. edulis and other commercially important fungi.[41][42]",
				"after": "Western North America has a number of species closely related to B. edulis. The white king bolete (Boletus barrowsii), found in parts of Colorado, New Mexico, Arizona, and California (and possibly elsewhere), is named after its discoverer Chuck Barrows.[43] It is lighter in colour than B. edulis, having a cream-coloured cap with pink tones;[44] often mycorrhizal with Ponderosa pine, it tends to grow in areas where there is less rainfall. Some find its flavour as good as if not better than B. edulis.[45] The California king bolete (Boletus edulis var. grandedulis) can reach massive proportions, and is distinguished from B. edulis by a mature pore surface that is brown to slightly reddish. The cap colour appears to be affected by the amount of light received during its development, and may range from white in young specimens grown under thick canopy, to dark-brown, red-brown or yellow brown in those specimens receiving more light.[46] The queen bolete (Boletus regineus), formerly considered a variety of B. aereus, is also a choice edible. It is generally smaller than B. edulis, and unlike that species, is typically found in mixed forests.[47] The spring king bolete (Boletus rex-veris), formerly considered a variety of B. edulis or B. pinophilus, is found throughout western North America. In contrast to B. edulis, B. rex-veris tends to fruit in clusters, and, as its common name suggests, appears in the spring.[48]",
			"color": "rosy|0.26685 brown|0.26685 light|0.060295 gray|0.060295 light|0.060295 grey|0.060295 gainsboro|0.056431 dark|0.052359 khaki|0.052359 tan|0.05226 silver|0.040722 dark|0.039054 gray|0.039054 dark|0.039054 grey|0.039054 gray|0.02812 grey|0.02812 white|0.026163 smoke|0.026163 khaki|0.021344 linen|0.019937 mint|0.019792 cream|0.019792 burly|0.018851 wood|0.018851 antique|0.017675 white|0.017675 floral|0.017427 white|0.017427 azure|0.017203 sea|0.017058 shell|0.017058 snow|0.015849 alice|0.015099 blue|0.015099 misty|0.014946 rose|0.014946 white|0.014218 beige|0.01277 dim|0.01193 gray|0.01193 dim|0.01193 grey|0.01193 old|0.011688 lace|0.011688 ghost|0.011426 white|0.011426 ivory|0.011339 honeydew|0.010307 wheat|0.0098715 pale|0.0094986 golden|0.0094986 rod|0.0094986 peach|0.0094252 puff|0.0094252 olive|0.0082543 dark|0.0075767 salmon|0.0075767 black|0.0070839  "
		}
	}
}
