{
	"add": {
		"doc": {
			"id": "7fe63017979989a50631f421c6ec7704570994beda021a3197b31ccc8d574b9e",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/0/02/Lftrear40c.jpg/220px-Lftrear40c.jpg",
				"previous": "The Model 40 made its first flight on July 7, 1925. Although the prototype was purchased by the US Post Office, the production order went to the Douglas M-2.[1][3]",
				"after": "The Contract Air Mail Act of 1925 set out the gradual privatization of the Post Office's Air Mail routes. In late 1926, bids were requested for the main transcontinental trunk mail route, which was to be split into eastern and western sections, with Boeing bidding for the western section. Boeing revived the design for the tender, with the Model 40A replacing the Liberty engine with a 425 hp (317 kW) air-cooled Pratt & Whitney Wasp radial engine, which was 200 lb (91 kg) lighter than the Liberty, ignoring the weight of the Liberty's radiator and cooling water. The fuselage was redesigned to make more extensive use of welded steel tubing, and an enclosed cabin was fitted between the mail compartments, allowing two passengers to be carried as well as 1,200 lb (540 kg) of mail. Boeing's bid of $3 per lb was much less than any of the competing bids, and Boeing was awarded the San Francisco to Chicago contract in January 1927, building 24 Model 40As for the route (with a further aircraft being used as a testbed by Pratt & Whitney).[3][4][5]",
			"color": "black|0.33222 dark|0.13957 gray|0.13957 dark|0.13957 grey|0.13957 dim|0.12934 gray|0.12934 dim|0.12934 grey|0.12934 gray|0.10694 grey|0.10694 silver|0.059686 light|0.033546 gray|0.033546 light|0.033546 grey|0.033546 gainsboro|0.019169 slate|0.018165 gray|0.018165 light|0.014593 slate|0.014593 gray|0.014593 antique|0.012564 white|0.012564 dark|0.010839 slate|0.010839 gray|0.010839 linen|0.010332 light|0.0089896 steel|0.0089896 blue|0.0089896 old|0.0086623 lace|0.0086623 floral|0.008016 white|0.008016 sea|0.0077736 shell|0.0077736 ivory|0.0068353  "
		}
	}
}
