{
	"add": {
		"doc": {
			"id": "7ff1850d386997f8a8686e697f5fd5cc43b7b3e0eca6d40c353c517aa8bea5cb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Bramall_2.jpg/220px-Bramall_2.jpg",
				"previous": "There has been a settlement at Bramall since Saxon times.[3] According to Alfred Burton, who wrote about Bramall in the late 19th century, the house has not always been in the present location, and was originally at Crow Holt Wood. This theory was rejected by another historian, Frederick Moorhouse, who became convinced in 1909 that Crow Holt Wood was a place where animals would have been taken to be sorted. There is no conclusive evidence to support either theory.[65] Today the house is situated at the top of two valleys to its south and east sides, which two streams run through. It is a grade I listed building, and the oldest parts date from the late 14th century, with later renovations dating from the 16th and 19th centuries.[1] It was originally accessed from the east side – the drive followed the route of the Ladybrook stream, then uphill towards the Chapel on the south side, reaching the courtyard on the other side. The main entrance is now on the side of the courtyard, in the west,[66] because of the restructuring of the drive in 1888.[42] The current layout of the house can clearly be seen from the west side of the building, in the courtyard: the service wing is on the left, the Great Hall is in the centre, and the Banqueting Hall is on the right.[67] Before the 19th century, the courtyard was enclosed by a gatehouse which was taken down between 1774 and 1819,[68][69] because of its being neither required nor in vogue.[27]",
				"after": "The house is built with stone foundations, and the main structure is made of oak timbers, joined together using mortice and tenon joints, and held in place with oak pegs. Wattle and daub or lath and plaster are used to fill the spaces between the timbers. The black and white appearance from the timber framing construction dates from the Tudor period, though some parts have been repaired in later years.[66]",
			"color": "dim|0.19035 gray|0.19035 dim|0.19035 grey|0.19035 dark|0.18398 gray|0.18398 dark|0.18398 grey|0.18398 gray|0.16628 grey|0.16628 silver|0.10249 light|0.066812 gray|0.066812 light|0.066812 grey|0.066812 gainsboro|0.0514 black|0.049982 slate|0.026883 gray|0.026883 white|0.019957 smoke|0.019957 light|0.018497 slate|0.018497 gray|0.018497 snow|0.013729 sea|0.013213 shell|0.013213 alice|0.013118 blue|0.013118 ghost|0.012947 white|0.012947 white|0.012053 mint|0.011566 cream|0.011566 floral|0.010153 white|0.010153 azure|0.010087 linen|0.0089364 lavender|0.0076831 blush|0.0076831 ivory|0.0034162  "
		}
	}
}
