{
	"add": {
		"doc": {
			"id": "7ff95ead00bf1243534fc024f3feeecb0fc7a03010db3d3b903aaafa2f5912a8",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/3/3c/Aliso_Creek_heron_and_ducklings.JPG/220px-Aliso_Creek_heron_and_ducklings.JPG",
				"previous": "Many of the trees in Aliso Creek's riparian zone were cut down in the Spanish Mission period to construct buildings, ships, and other projects. According to the Flood Protection Corridor Program of the Costa Machado Water Act of 2000, \"Aliso Creek was one of the few streams that contained water most of the year, even during the pre-development period. There are documents describing explorers mooring their ships outside the mouth of the river and harvesting large timbers from the river area. Such large timbers could only be available from a relatively lush environment in which water was somewhat plentiful.\"[4] Some trees survived into the early 20th century, then a second decline of unknown cause began—either erosion or floods in the creek were responsible for their destruction, or the water table has lowered out of reach of the trees' roots. The water table began a drastic decline in the 1960s, after the watershed began to become urbanized.[37]",
				"after": "Although historically many fish species used Aliso Creek, the only remaining one is carp, which is known to survive in areas with high toxicity. Bird life was also abundant in the watershed—and 137 species remain in the less developed areas of the watershed. Some of these birds include California least tern, least Bell's vireo, southwestern willow flycatcher, California gnatcatcher, and western snowy plover.[4] Remaining habitat for native wildlife is now primarily along Wood Canyon Creek, in the upper reaches of Aliso Creek, and along some parts of English Canyon.[25]",
			"color": "gray|0.48168 grey|0.48168 dim|0.25645 gray|0.25645 dim|0.25645 grey|0.25645 light|0.1035 slate|0.1035 gray|0.1035 dark|0.069721 gray|0.069721 dark|0.069721 grey|0.069721 slate|0.060542 gray|0.060542 light|0.0084518 steel|0.0084518 blue|0.0084518 silver|0.0048799  "
		}
	}
}
