{
	"add": {
		"doc": {
			"id": "8000fbabf2d5644a208db945d1cfaa582113110d9b339c9509f337d9f61e1124",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/DSCN0448.jpeg/220px-DSCN0448.jpeg",
				"previous": "During the late 1960s Shimer experienced a period of internal unrest known as the Grotesque Internecine Struggle, with disputes over curriculum changes, the extent to which student behavior should be regulated and inadequate fundraising by president Francis Joseph Mullin. Half the faculty and a large portion of the student body left as a result.[31][32] Its financial problems worsened, and the school's survival was uncertain. Although Shimer's trustees voted to close the college at the end of 1973, the school was saved by intense student and faculty fundraising.[33][34] Its trustees voted three times in the next four years to close the school, only to reverse themselves each time.[35] In the school's 1977 bankruptcy filing the trustees, in the words of board chair Barry Carroll, \"put responsibility for the school's continuing on the shoulders of a very dedicated faculty of 12 and students who volunteered\".[35]",
				"after": "During the 1978 Christmas break, the faculty and 62 students borrowed trucks and moved the college into two \"run-down\"[38] homes in Waukegan, Illinois, a suburb north of Chicago. Shimer emerged from bankruptcy in 1980.[39] During the next 25 years, the college purchased 12 surrounding homes to form a makeshift campus and slowly progressed towards financial stability.[40] By 1988 its enrollment had grown from a low of 40 to 114, and income exceeded expenses. In 1991, Shimer received a grant from the National Endowment for the Humanities with the help of NEH chair and core-curriculum advocate Lynne Cheney; the grant revitalized the school's fundraising, helping it raise $2 million.[40][41] In 2006, struggling with a stagnant enrollment, Shimer again moved to the campus of the Illinois Institute of Technology (IIT) in Chicago. Although the institutions operate independently, they cooperate closely under a long-term agreement.[42][43]",
			"color": "dim|0.16675 gray|0.16675 dim|0.16675 grey|0.16675 gray|0.15279 grey|0.15279 dark|0.14836 gray|0.14836 dark|0.14836 grey|0.14836 silver|0.071991 black|0.046806 dark|0.045751 olive|0.045751 green|0.045751 tan|0.042586 light|0.040212 gray|0.040212 light|0.040212 grey|0.040212 dark|0.032803 slate|0.032803 gray|0.032803 gainsboro|0.029452 rosy|0.023499 brown|0.023499 light|0.021629 slate|0.021629 gray|0.021629 slate|0.018368 gray|0.018368 lavender|0.014306 alice|0.013083 blue|0.013083 light|0.012836 steel|0.012836 blue|0.012836 white|0.01224 smoke|0.01224 steel|0.012181 blue|0.012181 ghost|0.0090222 white|0.0090222  "
		}
	}
}
