{
	"add": {
		"doc": {
			"id": "800d285ae5567575f088023e968945f82904d485e9a70587124e6b78c5b59690",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Brookwood_military_graves.jpg/220px-Brookwood_military_graves.jpg",
				"previous": "Tubbs also oversaw a restructuring of the ailing programme to sell the LNC's surplus lands. The estate was partitioned into three sections, and separate estate agents appointed to oversee the disposal of each.[116] Many of the lands near Woking railway station and around Brookwood were sold, at much higher prices than the LNC disposals had previously fetched. No suitable agent could be found to oversee the sale of the third portion of LNC land, Hook Heath, and as a consequence Tubbs kept it under LNC control and oversaw its development himself. Over the 1890s the site was subdivided into plots for large detached houses, and a golf course was built to attract residents and visitors.[117][note 18]",
				"after": "In August 1914, on the outbreak of the First World War, the LNC offered to donate to the War Office 1 acre (4,000 m2) of land \"for the free interment of soldiers and sailors who have returned from the front wounded and may subsequently die\". The offer was not taken up until 1917, when a section of the cemetery was set aside as Brookwood Military Cemetery, used for the burials of service personnel who died in the London District.[112] In 1921 this area was sold to the Imperial War Graves Commission (later the Commonwealth War Graves Commission), and since then the military cemeteries have been administered and maintained by the IWGC/CWGC and its equivalents for other nations whose military are buried there.[120] In September 1922 the LNC sold an area adjacent to the Military Cemetery to the US government. The LNC was hired by the US government to landscape this area and build a chapel, creating the American Military Cemetery (later the Brookwood American Cemetery and Memorial), the only burial ground in Britain for US casualties of the First World War.[121][122] Although built by the LNC, since 1923 the American Military Cemetery has been administered by the American Battle Monuments Commission.[122] After the Second World War the military cemeteries were extended to include dedicated sections for many of the Allied nations, and in 1958 the Brookwood Memorial, commemorating 3,500 Commonwealth casualties of the Second World War with no known grave, was dedicated at the site.[123] Between them, the military cemeteries occupy around 37 acres (150,000 m2) of the site.[112]",
			"color": "dark|0.22668 gray|0.22668 dark|0.22668 grey|0.22668 gray|0.21482 grey|0.21482 dim|0.17602 gray|0.17602 dim|0.17602 grey|0.17602 dark|0.167 olive|0.167 green|0.167 silver|0.058049 black|0.055386 dark|0.037622 slate|0.037622 gray|0.037622 light|0.027167 slate|0.027167 gray|0.027167 slate|0.023794 gray|0.023794 light|0.0089068 gray|0.0089068 light|0.0089068 grey|0.0089068  "
		}
	}
}
