{
	"add": {
		"doc": {
			"id": "801c83e5f508101fe97c1b91c5d1b8e0dfeb0bd00f2aa2589e0c9c9e2ba24445",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/OliverMadonnaFrozen.jpg/170px-OliverMadonnaFrozen.jpg",
			"previous": [],
				"after": "The central theme of the show was unity versus violence.[14] It was divided into five acts with different themes: French Baroque-Marie Antoinette Revival, Military-Army, Circus-Cabaret, Acoustic and Scottish-Tribal segments. It began with \"The Beast Within\", an ominous recitation from the Book of Revelation by Arabic singer Fairuz and the screens displaying Madonna's X-STaTIC PRo=CeSS installations.[14] Once the introduction had finished, Madonna appeared onstage on a rising platform in a golden corset (for some European shows she wore a lilac one), striking yoga poses to perform \"Vogue\".[15] It was followed by the energetically performed \"Nobody Knows Me\" on a conveyor belt with some of the words to the song appearing on the screens, then \"Frozen\", during which a video of a naked male and a naked female wrestling, caressing and intertwining in water, their faces and genitals darkened by shadows so as to preserve their androgyny, were displayed on the backdrops. This video was directed by Chris Cunningham, who directed Madonna's original music video to the song.[14][16] The military segment started with the sound of a helicopter in the background as Madonna's backup dancers, dressed as soldiers, crawled on their bellies as though in the middle of battle, then hugged each other as if saying goodbye. Madonna appeared onstage, on top of a structure made up of TV sets, wearing camouflage pants, an olive army jacket and black beret. She started performing \"American Life\" as war footage of death and destruction flashed on screens behind her (at the end of the song, it showed a George W. Bush look-alike lovingly resting his head on the shoulder of a Saddam Hussein look-alike, as though the pair were waiting for a marriage license [10]). During the performance Madonna ran down a lengthy V-shaped catwalk that descended from the ceiling and allowed her to reach the middle of the stadium.[10] She also twirled army rifles during a march-like \"Express Yourself\" before strapping on a guitar for rock versions of \"Burning Up\" and \"Material Girl\".[17] During the latter's performances, the backdrops displayed mathematical equations along with DNA helixes rushing through the screens.[14] A remix interlude of \"Hollywood\" featured a breakdancer, a firedancer, a bellydancer, a tapdancer and a skateboarder. The screens displayed animations of tarot cards.[10]",
			"color": "rosy|0.24286 brown|0.24286 dark|0.14212 salmon|0.14212 thistle|0.089901 peru|0.074877 sandy|0.071675 brown|0.071675 pink|0.051478 light|0.0367 pink|0.0367 burly|0.036289 wood|0.036289 tan|0.020977 peach|0.018427 puff|0.018427 light|0.016256 salmon|0.016256 navajo|0.014911 white|0.014911 misty|0.014561 rose|0.014561 sienna|0.014039  "
		}
	}
}
