{
	"add": {
		"doc": {
			"id": "802f539e49dcec06031fb2b9ab6800263a010384bc654f59e58b1d5f57dd4171",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/2015_Dubai_World_Cup_finish.jpg/220px-2015_Dubai_World_Cup_finish.jpg",
			"previous": [],
				"after": "California Chrome began his 2015 four-year-old season with a prep race at Santa Anita in the San Antonio Stakes on February 7, anticipated as a return matchup with Shared Belief, whose traffic problems in the Classic failed to present a true match against California Chrome. Art Sherman and Shared Belief's trainer, Jerry Hollendorfer, are longtime friends and rivals from the Northern California racing circuit and both men anticipated the rivalry between their two horses. Said Sherman, \"I just want both of us to be at the head of the stretch with no excuses and then it's who gets to the wire first.\"[177] Shared Belief went off as the favorite and although California Chrome took the lead by the 3⁄4 pole, Shared Belief edged him in the final sixteenth and won, with California Chrome second by a length and a half.[178] California Chrome next shipped to Meydan Racecourse for his first international start in the Dubai World Cup on March 28, where he needed to run at night under artificial lighting and without Lasix.[179] He went off as the favorite, but finished second to the Irish-bred longshot Prince Bishop, who was trained by Saeed bin Suroor and owned by Hamdan bin Mohammed Al Maktoum of Godolphin Racing. Sherman noted that his horse ran wide on the turns, but said, \"He tried every inch of the way. There's nothing wrong with finishing second in this type of a race.\"[180] After the Dubai World Cup, California Chrome was shipped to Rae Guest's Newmarket stables in preparation for Royal Ascot week in June.[181] His likely target at Royal Ascot will be the Prince of Wales's Stakes.[182]",
			"color": "firebrick|0.099307 brown|0.062749 sandy|0.053223 brown|0.053223 indian|0.037697 red|0.037697 dark|0.034306 red|0.034306 maroon|0.032985 misty|0.032435 rose|0.032435 light|0.030126 pink|0.030126 pink|0.028592 light|0.027283 coral|0.027283 tan|0.025581 red|0.024663 burly|0.0242 wood|0.0242 light|0.024004 gray|0.024004 light|0.024004 grey|0.024004 gainsboro|0.021271 silver|0.020845 peach|0.020623 puff|0.020623 dim|0.020473 gray|0.020473 dim|0.020473 grey|0.020473 lavender|0.018219 blush|0.018219 sea|0.01735 shell|0.01735  "
		}
	}
}
