{
	"add": {
		"doc": {
			"id": "806462426d6d3220ede22e5e0d2795022e16276aa0860a5fc099e695b94902c1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/3/34/Botp.jpeg",
				"previous": "Hogarth replicates all the features of the pastoral scene in an urban landscape. The shepherds and shepherdesses become the beggars and whores, the sun overhead is replaced by the clock on the church, the snow-capped mountains become the snowy rooftops. Even the setting of Covent Garden with piles of fruit and vegetables echoes the country scene. In the centre of the picture the icy goddess of the dawn in the form of the prim churchgoer is followed by her shivering red-nosed pageboy, mirroring Hesperus, the dawn bearer. The woman is the only one who seems unaffected by the cold, suggesting it may be her element. Although outwardly shocked, the dress of the woman, which is too fashionable for a woman of her age and in the painting is shown to be a striking acid yellow, may suggest she has other thoughts on her mind.[4] She is commonly described as a spinster, and considered to be a hypocrite, ostentatiously attending church and carrying a fashionable ermine muff while displaying no charity to her freezing footboy or the half-seen beggar before her. The figure of the spinster is said to be based on a relative of Hogarth, who, recognising herself in the picture, cut him out of her will. Fielding later used the woman as the model for his character of Bridget Allworthy in Tom Jones.[12]",
				"after": "A trail of peculiar footprints shows the path trodden by the woman on her pattens to avoid putting her good shoes in the snow and filth of the street.[14] A small object hangs at her side, interpreted variously as a nutcracker or a pair of scissors in the form of a skeleton or a miniature portrait, hinting, perhaps, at a romantic disappointment. Although clearly a portrait in the painting, the object is indistinct in the prints from the engraving. Other parts of the scene are clearer in the print, however: in the background, a quack is selling his cureall medicine, and while in the painting the advertising board is little more than a transparent outline, in the print, Dr. Rock's name can be discerned inscribed on the board below the royal crest which suggests his medicine is produced by royal appointment. The salesman may be Rock himself.[15] Hogarth's opinion of Rock is made clear in the penultimate plate of A Harlot's Progress where he is seen arguing over treatments with Dr Misaubin while Moll Hackabout dies unattended in the corner.",
			"color": " "
		}
	}
}
