{
	"add": {
		"doc": {
			"id": "8083bdeb944bd628686eefa2c56a6153c198c1c32277f0d4bbd1173ab5ef6643",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Thermohaline_Circulation_2.png/220px-Thermohaline_Circulation_2.png",
				"previous": "Surface currents only affect the top few hundred meters (yards) of the sea, but there are also large-scale flows in the ocean depths caused by the movement of deep water masses. A main deep ocean current flows through all the world's oceans and is known as the thermohaline circulation or global conveyor belt. This movement is slow and is driven by differences in density of the water caused by variations in salinity and temperature.[66] At high latitudes, the water is chilled by the low atmospheric temperature and becomes saltier as sea ice crystallizes out. Both these factors make it denser and the water sinks. From the deep sea near Greenland, such water flows southwards between the continental landmasses on either side of the Atlantic. When it reaches the Antarctic, it is joined by further masses of cold, sinking water and flows eastwards. It then splits into two streams that move northwards into the Indian and Pacific Oceans. Here it is gradually warmed, becomes less dense, rises towards the surface, and loops back on itself. Some flows back into the Atlantic. It takes a thousand years for this circulation pattern to be completed.[63]",
				"after": "Besides gyres, there are temporary surface currents that occur under specific conditions. When waves meet a shore at an angle, a longshore current is created as water is pushed along parallel to the coastline. The water swirls up onto the beach at right angles to the approaching waves but drains away straight down the slope under the effect of gravity. The larger the breaking waves, the longer the beach, and the more oblique the wave's approach, the stronger the longshore current is.[67] These currents can shift great volumes of sand or pebbles, create spits, and make beaches disappear and water channels silt up.[63] A rip current can occur when water piles up near the shore from advancing waves and is funnelled out to sea through a channel in the seabed. It may occur at a gap in a sandbar or near a man-made structure such as a groyne. These strong currents can have a velocity of 1 m/s (3.3 ft/s), can form at different places at different stages of the tide, and can carry away unwary swimmers.[68] Temporary upwelling currents occur when the wind pushes water away from the land and deeper water rises to replace it. This cold water is often rich in nutrients and creates blooms of phytoplankton and a great increase in the productivity of the sea.[63]",
			"color": "dark|0.51859 gray|0.51859 dark|0.51859 grey|0.51859 gray|0.058703 grey|0.058703 pale|0.056296 golden|0.056296 rod|0.056296 powder|0.04206 blue|0.04206 light|0.038624 blue|0.038624 silver|0.035288 firebrick|0.033922 dim|0.028319 gray|0.028319 dim|0.028319 grey|0.028319 dark|0.023899 khaki|0.023899 brown|0.022215 light|0.020976 steel|0.020976 blue|0.020976 dark|0.015347 slate|0.015347 blue|0.015347 light|0.014524 slate|0.014524 gray|0.014524 indian|0.0127 red|0.0127 pale|0.0087234 turquoise|0.0087234 slate|0.0083522 gray|0.0083522 wheat|0.0072463 khaki|0.0066427  "
		}
	}
}
