{
	"add": {
		"doc": {
			"id": "808423adb6990c72412a84abb0241df2dfa67daf5237f7304fdde39700b20959",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Chakri_Naruebet_2001_stern_view.JPEG/220px-Chakri_Naruebet_2001_stern_view.JPEG",
				"previous": "Following the display of Harrier operations from small carriers, the navies of Spain and later Thailand bought the Harrier for use as their main carrier-based fixed-wing aircraft.[N 17] Spain's purchase of Harriers was complicated by long-standing political friction between the British and Spanish governments of the era; even though the Harriers were manufactured in the UK they were sold to Spain with the US acting as an intermediary.[126] Since 1976, the Spanish Navy operated the AV-8S Matador from their aircraft carrier Dédalo (formerly the USS Cabot); the aircraft provided both air defence and strike capabilities for the Spanish fleet.[127] Spain later purchased five Harriers directly from the British government to replace losses.[128]",
				"after": "Hawker Siddeley aggressively marketed the Harrier for export. At one point the company was holding talks with Australia, Brazil, Switzerland, India and Japan. Of these only India became a customer, purchasing the Sea Harrier.[129] At one point China came very close to becoming an operator of the first generation Harrier. Following an overture by the UK in the early 1970s, when relations with the West were warming, China became interested in the aircraft as it sought to modernise its armed forces; British Prime Minister James Callaghan noted significant hostility from the USSR over the sales bid.[130][131] The deal was later cancelled by the UK as part of a diplomatic backlash after China invaded Vietnam in 1979.[132]",
			"color": "gray|0.2676 grey|0.2676 dark|0.23435 gray|0.23435 dark|0.23435 grey|0.23435 dim|0.15859 gray|0.15859 dim|0.15859 grey|0.15859 silver|0.12047 black|0.070098 light|0.059046 gray|0.059046 light|0.059046 grey|0.059046 gainsboro|0.032904 slate|0.022434 gray|0.022434 dark|0.016982 slate|0.016982 gray|0.016982 light|0.0071031 slate|0.0071031 gray|0.0071031  "
		}
	}
}
