{
	"add": {
		"doc": {
			"id": "808beee88e7e97b16d9d7bc17f941bd6b6db15f1acfadeff52352559dfc52969",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Castra-vetera.jpg/220px-Castra-vetera.jpg",
				"previous": "In AD 46, at about age 23, Pliny entered the army as a junior officer, as was the custom for young men of equestrian rank. Ronald Syme, Plinian scholar, reconstructs three periods at three ranks.[12][13] Pliny's interest in Roman literature attracted the attention and friendship of other men of letters in the higher ranks, with whom he formed lasting friendships. Later these friendships assisted his entry into the upper echelons of the state; however, he was trusted for his knowledge and ability as well. According to Syme, he began as a praefectus cohortis, a \"commander of a cohort\" (an infantry cohort, as junior officers began in the infantry), under Gnaeus Domitius Corbulo, himself a writer (whose works did not survive) in Germania Inferior. In AD 47 he took part in the Roman conquest of the Chauci and the construction of the canal between the rivers Maas and Rhine. His description of the Roman ships anchored in the stream overnight having to ward off floating trees has the stamp of an eyewitness account.[14]",
				"after": "At some uncertain date Pliny was transferred to the command of Germania Superior under Publius Pomponius Secundus with a promotion to military tribune,[12] which was a staff position, with duties assigned by the district commander. Pomponius was a half-brother of Corbulo.[15] They had the same mother, Vistilia, a powerful matron of the Roman upper classes, who had seven children by six husbands, some of whom had imperial connections, including a future empress. Pliny's assignments are not clear, but he must have participated in the campaign against the Chatti of AD 50, at age 27, in his fourth year of service. Associated with the commander in the praetorium he became a familiar and close friend of Pomponius, who also was a man of letters.",
			"color": "medium|0.20911 blue|0.20911 beige|0.080606 light|0.060403 steel|0.060403 blue|0.060403 light|0.05365 gray|0.05365 light|0.05365 grey|0.05365 gainsboro|0.053015 antique|0.046603 white|0.046603 linen|0.030985 light|0.030368 golden|0.030368 rod|0.030368 yellow|0.030368 old|0.029584 lace|0.029584 silver|0.029528 corn|0.023332 silk|0.023332 honeydew|0.022997 lemon|0.019988 chiffon|0.019988 light|0.018278 yellow|0.018278 papaya|0.016933 whip|0.016933 white|0.01504 smoke|0.01504 floral|0.014035 white|0.014035 dark|0.013834 gray|0.013834 dark|0.013834 grey|0.013834 sea|0.013521 shell|0.013521 slate|0.012949 blue|0.012949 ivory|0.012904 lavender|0.011795 misty|0.0090199 rose|0.0090199 mint|0.008703 cream|0.008703 pale|0.008428 golden|0.008428 rod|0.008428 light|0.0079256 blue|0.0079256 blanched|0.0075815 almond|0.0075815 lavender|0.0071541 blush|0.0071541 snow|0.0069824 alice|0.0063065 blue|0.0063065 indian|0.0059466 red|0.0059466 ghost|0.0057734 white|0.0057734 royal|0.0057563 blue|0.0057563 thistle|0.0053662 azure|0.0051231 powder|0.0049951 blue|0.0049951 light|0.0046431 slate|0.0046431 gray|0.0046431 light|0.0045957 cyan|0.0045957 white|0.0045394 firebrick|0.0041388  "
		}
	}
}
