{
	"add": {
		"doc": {
			"id": "8091517922667818a84aafc47c74b5c9f5ef6903d81c26e9f6d576644dfadbe1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Russian_ex-USSR_2004.PNG/399px-Russian_ex-USSR_2004.PNG",
				"previous": "In the 20th century, Russian was mandatorily taught in the schools of the members of the old Warsaw Pact and in other countries that used to be satellites of the USSR. In particular, these countries include Poland, Bulgaria, the Czech Republic, Slovakia, Hungary, Albania, former East Germany and Cuba. However, younger generations are usually not fluent in it, because Russian is no longer mandatory in the school system. According to the Eurobarometer 2005 survey,[45] though, fluency in Russian remains fairly high (20–40%) in some countries, in particular those where the people speak a Slavic language and thereby have an edge in learning Russian (namely, Poland, Czech Republic, Slovakia, and Bulgaria). In 2005, it was the most widely taught foreign language in Mongolia,[46] and was compulsory in Year 7 onward as a second foreign language in 2006.[47]",
				"after": "Russian is also spoken in Israel by at least 750,000 ethnic Jewish immigrants from the former Soviet Union, according to the 1999 census. The Israeli press and websites regularly publish material in Russian.[citation needed] Russian is also spoken as a second language by a small number of people in Afghanistan (Awde and Sarwan, 2003).",
			"color": "light|0.11305 coral|0.11305 dark|0.063517 gray|0.063517 dark|0.063517 grey|0.063517 salmon|0.05676 gray|0.054547 grey|0.054547 light|0.04549 golden|0.04549 rod|0.04549 yellow|0.04549 white|0.044885 smoke|0.044885 lemon|0.044236 chiffon|0.044236 alice|0.042378 blue|0.042378 ghost|0.042208 white|0.042208 snow|0.042074 silver|0.041971 white|0.041165 mint|0.040437 cream|0.040437 sea|0.039635 shell|0.039635 azure|0.038906 floral|0.038131 white|0.038131 indian|0.03653 red|0.03653 lavender|0.032747 blush|0.032747 light|0.031972 gray|0.031972 light|0.031972 grey|0.031972 gainsboro|0.027968 light|0.019692 yellow|0.019692 dim|0.01504 gray|0.01504 dim|0.01504 grey|0.01504 corn|0.014146 silk|0.014146 beige|0.007741 ivory|0.0065191 pale|0.0048306 golden|0.0048306 rod|0.0048306 linen|0.0034628  "
		}
	}
}
