{
	"add": {
		"doc": {
			"id": "80a772bd63ce2149b7a148eedf2e8dbb5b988c72b5c77b016b735e1bae1c5b11",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/New_Forest_Pony_Dorset-2.jpg/220px-New_Forest_Pony_Dorset-2.jpg",
				"previous": "The ponies are most commonly bay, chestnut, or grey. Few coat colours are excluded: piebald, skewbald, and blue-eyed cream are not allowed; palomino and very light chestnut are only accepted by the stud book as geldings and mares. Blue eyes are never accepted. White markings on the head and lower legs are allowed, unless they appear behind the head, above the point of the hock in the hind leg, or above the metacarpal bone at the bend in the knee in the foreleg.[2] Ponies failing to pass these standards may not be registered in the purebred section of the stud book, but are recorded in the appendix, known as the X-register. The offspring of these animals may not be registered as purebred New Forest ponies, as the stud book is closed and only the offspring of purebred-approved registered ponies may be registered as purebred.[2][4]",
				"after": "New Forest ponies have a gentle temperament and a reputation for intelligence, strength, and versatility.[3] On the whole, they are a sturdy and hardy breed.[5] The one known hereditary genetic disorder found in the breed is congenital myotonia, a muscular condition also found in humans, dogs, cats, and goats. It was identified in the Netherlands in 2009, after a clinically affected foal was presented to the Equine Clinic of Utrecht University. DNA sequencing revealed that the affected foal was homozygous for a missense mutation in the gene encoding CLCN1, a protein which regulates the excitability of the skeletal muscle.[6][7] The mutated allele was found in both the foal's parents, its siblings, and two other related animals, none of whom exhibited any clinical signs. The researchers concluded that the condition has an autosomal recessive mode of inheritance, whereby both parents have to contribute the mutated allele for a physically affected foal to be produced with that phenotype. The study suggested that the mutation was of relatively recent origin: the founder of the mutated gene, as all the ponies who tested positive for the mutation are direct descendants of this stallion.[6][8] The probable founder stallion has been identified as Kantje's Ronaldo; testing is now underway to identify which of his offspring carry the mutated gene. All carriers will be removed from the breeding section of the New Forest Pony Breeding & Cattle Society's stud book, and all New Forest stallions licensed in the UK also will be tested, whether or not they descend from Kantje's Ronaldo, to cover the possibility that the mutated gene may have appeared earlier in the pedigree, although it is believed that the mutated gene has now been eradicated from the British breeding stock. All breeding stock imported to the UK also will be tested. [9]",
			"color": "tan|0.4493 black|0.15572 wheat|0.12945 bisque|0.053498 peach|0.052892 puff|0.052892 burly|0.034445 wood|0.034445 blanched|0.029011 almond|0.029011 moccasin|0.02101  "
		}
	}
}
