{
	"add": {
		"doc": {
			"id": "80e123d36d4bb59462e72817481c7b606960d9dcec62e083b3f60ddca3d56e25",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Pity.jpg/310px-Pity.jpg",
				"previous": "Soon, however, Shakespeare began to adapt the traditional styles to his own purposes. The opening soliloquy of Richard III has its roots in the self-declaration of Vice in medieval drama. At the same time, Richard's vivid self-awareness looks forward to the soliloquies of Shakespeare's mature plays.[145] No single play marks a change from the traditional to the freer style. Shakespeare combined the two throughout his career, with Romeo and Juliet perhaps the best example of the mixing of the styles.[146] By the time of Romeo and Juliet, Richard II, and A Midsummer Night's Dream in the mid-1590s, Shakespeare had begun to write a more natural poetry. He increasingly tuned his metaphors and images to the needs of the drama itself.",
				"after": "Shakespeare's standard poetic form was blank verse, composed in iambic pentameter. In practice, this meant that his verse was usually unrhymed and consisted of ten syllables to a line, spoken with a stress on every second syllable. The blank verse of his early plays is quite different from that of his later ones. It is often beautiful, but its sentences tend to start, pause, and finish at the end of lines, with the risk of monotony.[148] Once Shakespeare mastered traditional blank verse, he began to interrupt and vary its flow. This technique releases the new power and flexibility of the poetry in plays such as Julius Caesar and Hamlet. Shakespeare uses it, for example, to convey the turmoil in Hamlet's mind:[149]",
			"color": "black|0.25262 dim|0.092279 gray|0.092279 dim|0.092279 grey|0.092279 light|0.075439 slate|0.075439 gray|0.075439 slate|0.073544 gray|0.073544 gray|0.070692 grey|0.070692 dark|0.067908 gray|0.067908 dark|0.067908 grey|0.067908 dark|0.045875 slate|0.045875 gray|0.045875 silver|0.042022 light|0.036349 steel|0.036349 blue|0.036349 light|0.028428 gray|0.028428 light|0.028428 grey|0.028428 gainsboro|0.021441 tan|0.018163 rosy|0.01047 brown|0.01047 steel|0.0099631 blue|0.0099631 light|0.0095738 blue|0.0095738 burly|0.0086174 wood|0.0086174 lavender|0.00755 peach|0.0067664 puff|0.0067664 antique|0.0063907 white|0.0063907  "
		}
	}
}
