{
	"add": {
		"doc": {
			"id": "80f3c945839407836b7fd45391af2fc4d8212a98bb01f0ce4fb9de1b1535ac06",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Betty_Friedan_1960.jpg/170px-Betty_Friedan_1960.jpg",
			"previous": [],
				"after": "The decline in Freud's reputation has been attributed partly to the revival of feminism.[206] Simone de Beauvoir criticizes psychoanalysis from an existentialist standpoint in The Second Sex, arguing that Freud saw an \"original superiority\" in the male that is in reality socially induced.[207] Betty Friedan criticizes Freud and what she considered his Victorian view of women in The Feminine Mystique.[205] Freud's concept of penis envy was attacked by Kate Millett, whose Sexual Politics accused him of confusion and oversights.[208] Naomi Weisstein writes that Freud and his followers erroneously thought that his \"years of intensive clinical experience\" added up to scientific rigor.[209] Freud is also criticized by Shulamith Firestone and Eva Figes. In The Dialectic of Sex, Firestone argues that Freud was a \"poet\" who produced metaphors rather than literal truths; in her view, Freud, like feminists, recognized that sexuality was the crucial problem of modern life, but ignored the social context and failed to question society itself. Firestone interprets Freudian \"metaphors\" in terms of the literal facts of power within the family. Figes tries in Patriarchal Attitudes to place Freud within a \"history of ideas\". Juliet Mitchell defends Freud against his feminist critics in Psychoanalysis and Feminism, accusing them of misreading him and misunderstanding the implications of psychoanalytic theory for feminism. Mitchell helped introduce English-speaking feminists to Lacan.[207] Mitchell is criticized by Jane Gallop in The Daughter's Seduction. Gallop compliments Mitchell for her criticism of \"the distortions inflicted by feminists upon Freud's text and his discoveries\", but finds her treatment of Lacanian theory lacking.[210]",
			"color": " "
		}
	}
}
