{
	"add": {
		"doc": {
			"id": "80ffc606d1c014dd42cadaac06ebb68fb74f7663912c666128392470ae69d8dd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/VT-EVB.jpg/220px-VT-EVB.jpg",
			"previous": [
				"The last few 747-400s delivered features the Boeing Signature Interior, derived from the Boeing 777. [24]",
				"The redesigned 747-400 interior features new cabin sidewalls, heat-resistant phenolic glass, carbon composite paneling, and larger storage bins.[14] An enhanced in-flight entertainment framework, called the Advanced Cabin Entertainment/Service System (ACESS), debuted on 747-400, which integrates 18-channel audio capability, four passenger intercom announcement zones, inter-cabin telephones, and passenger lighting into a central system.[23] An eight-bunk overhead crew rest is installed above the aft cabin, while a second crew rest area is located on the upper deck behind the cockpit for flight crew use.[23]"
			],
				"after": "Airlines using the 747-400 have accelerated its retirement (as at 2015) and are replacing the model with more fuel efficient aircraft. The 747-400's leasing, resale and salvage value has dropped steeply because it is relatively expensive to operate. In most cases, it is being replaced with wide-body twin-engine aircraft. The change in emphasis from hub and spoke operations to point-to-point flights has also reduced the need for jumbo jets. For example, Delta Airlines has reduced the number of flights it operates from the United States to Narita International Airport that are intended to transfer passengers to other destinations in Asia. Instead, Delta will utilize twin-engine widebody aircraft operating from an expanded hub at Seattle-Tacoma International Airport.[25] Total capacity will be cut, but consequentially load factors will increase. In April 2015, Delta announced it would accelerate the retirement of its 747-400 aircraft and replace them either with Airbus A330 aircraft reassigned from cancelled international runs, or with new Airbus A350 aircraft now on order. That will leave just six 747s flying for the airline in 2015. Delta could not keep the 747s full without deeply discounting ticket prices; the discounts and increased maintenance required of a four-engine aircraft led to a drag on profits.[26]Moreover, economic weakness in air cargo markets has slowed demand for cargo conversions. Since the cost of replacing a 747-400 is high (an airline must purchase or lease another wide-body), some operators choose to fly the 747-400 to the conclusion of its accepted useful life and then scrap it. The current parts resale value for this aircraft has been reduced to its engines.[27] Several airlines have retired their 747-400 from the trans-pacific market. Remaining operators in 2014 include Qantas, British Airways and United. United is retaining its 23 747-400s for now, but the airline's deployment of them also reflects a change in emphasis from Asian hubs to domestic hubs, meaning that it will have more direct flights from the United States to secondary Asian market cities. This may reduce the need for jumbo jets.[28]",
			"color": "silver|0.26412 light|0.24238 gray|0.24238 light|0.24238 grey|0.24238 gainsboro|0.16699 light|0.081768 steel|0.081768 blue|0.081768 dark|0.073238 gray|0.073238 dark|0.073238 grey|0.073238 gray|0.039488 grey|0.039488 tan|0.028299 dim|0.021153 gray|0.021153 dim|0.021153 grey|0.021153 light|0.020052 blue|0.020052 slate|0.011626 gray|0.011626 light|0.01097 slate|0.01097 gray|0.01097 lavender|0.0067113 rosy|0.0065519 brown|0.0065519  "
		}
	}
}
