{
	"add": {
		"doc": {
			"id": "8103fe9ed3163c44b527a5b002e8566dd78fbae740b2baf6941117a0c19332f0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/WatersMeet_panorama_Ricketts_Glenn_State_Park.jpg/350px-WatersMeet_panorama_Ricketts_Glenn_State_Park.jpg",
				"previous": "Finally in 1890, Harry Clay Trexler, J.H. Turrell, Ricketts, and partners formed the Trexler and Turrell Lumber Company and leased 5,000 acres (2,000 ha) of Ricketts' land near Ganoga Lake. The company built a sawmill and lumber town named Ricketts on Mehoopany Creek. The town, which was in both Sullivan and Wyoming counties, had 800 inhabitants at its peak and extended into the northernmost section of the park. Rail lines were built to the mills at Ricketts, including the Bowman Creek branch of the Lehigh Valley Railroad which opened in 1883, and also provided passenger service to the hotel on Lake Ganoga.[35][36] According to Petrillo's Ghost Towns of North Mountain: Ricketts, Mountain Springs, Stull: \"Ricketts was on the verge of financial disaster for two decades until the Lehigh Valley Railroad was constructed through his lands.\"[37]",
				"after": "Trexler and Turrell paid Ricketts $50,000 in both 1890 and 1891, and continued to cut his land and pay him for the timber until 1913. By 1911, the main sawmill at Ricketts could cut 125,000 board feet (290 m3) a day and was supported by three locomotives with 62 cars on 22 miles (35 km) of track. Within the park, the area around what became Lake Jean was cut in the 1890s, and Cherry Ridge (east of Red Rock Job Corps Center) and land around Lake Leigh were the last areas cut by the Ricketts mill. Timber in the east part of the park and along Bowman Creek was cut by Lewis' company, which also used logging railroads and even ran track down the Allegheny Front at Phillips Creek.[38][39] Lewis' firm built a splash dam on Bowman Creek to help float logs downstream in 1891, then used the lake to cut ice for refrigeration. A second dam and lake were added in 1909 and the icehouses were on state park land; the ice industry supported the small village and post office of Mountain Springs.[40] Ricketts ran his own ice cutting business on Ganoga Lake from 1895 to about 1915.[41]",
			"color": "dim|0.27859 gray|0.27859 dim|0.27859 grey|0.27859 gray|0.20246 grey|0.20246 dark|0.13816 gray|0.13816 dark|0.13816 grey|0.13816 silver|0.072627 light|0.046078 gray|0.046078 light|0.046078 grey|0.046078 black|0.03936 gainsboro|0.034804 white|0.015492 smoke|0.015492 light|0.013616 slate|0.013616 gray|0.013616 slate|0.013492 gray|0.013492 ghost|0.011849 white|0.011849 snow|0.011744 sea|0.011357 shell|0.011357 alice|0.011023 blue|0.011023 lavender|0.010726 blush|0.010726 white|0.0099092 dark|0.0088309 slate|0.0088309 gray|0.0088309 floral|0.0087734 white|0.0087734 linen|0.0085934 mint|0.0080483 cream|0.0080483 lavender|0.0072572 azure|0.0065544 light|0.0052996 steel|0.0052996 blue|0.0052996  "
		}
	}
}
