{
	"add": {
		"doc": {
			"id": "8114fa2c9aa211c0e3b20e1a9ec9b8e90897a90be0048f04d632553fabc8218d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Pedro_II_of_Brazil_1887.jpg/250px-Pedro_II_of_Brazil_1887.jpg",
				"previous": "Article 99 of the Constitution of 1824 declared that the “person of the Emperor is inviolable and sacred; he is not subject to any responsibility”.[40] This disposition was not characteristic only of the nineteenth century Brazilian constitutional regime. On the contrary, the lack of responsibility of the monarch continues to exist under present-day parliamentary monarchies.[41][42][43][44][45][46] The powers reserved to the Moderating Power were to be exercised only after consulting the Council of State.[47] Most of these powers (which were enumerated in Article 101) were identical to those reserved for monarchs today, such as: to summon the General Assembly (parliament) in the intervals between sessions;[48] to sanction the decrees and resolutions of the General Assembly, for them to take on the force of law;[49][50][51][52][53] extend or postpone the General Assembly and dissolve the Chamber of Deputies (Portuguese: Câmara de Deputados), convoking another immediately to replace the former;[54][55][56][57] freely appointing and firing ministers of state;[58][59][60][61] pardoning and modifying judicial sentences and granting amnesty.[62][63][64][65]",
				"after": "The dissolution of the Chamber of Deputies should not be confused with shutting down a National Congress (or Parliament). The first refers to a legal measure that exist under Parliamentarism, while the second is a dictatorial act. There was a great care on the part of Brazilian monarchs at the time to exercise their prerogative to dissolve the Chamber of Deputies. For example, in the case of Pedro I, he did not dissolve the Chamber of Deputies or postponed the Parliament during his reign.[66] While Pedro II, not once in his 58 years as Emperor that such dissolution occurred by his own initiative; instead, it was always solicited by the President of the Council of Ministers. There were various dissolutions during the period of his reign, eleven in all, and of these, ten occurred only after the Council of State was consulted on the matter, something that was not obligatory.[67] The power to veto laws was not absolute, merely partial: if two consecutive legislatures presented the same legislation without modifications, the Emperor's signature would not be needed to pass it.[68]",
			"color": "tan|0.52622 burly|0.19673 wood|0.19673 wheat|0.04925  "
		}
	}
}
