{
	"add": {
		"doc": {
			"id": "811979ed14e6dc81a0de9b7f4e3e150b3431dee8b5d18712dae11f8d0a943b1f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Basava_Gaint_Statue_108_feet%2C_Basava_Kalyana.JPG/220px-Basava_Gaint_Statue_108_feet%2C_Basava_Kalyana.JPG",
				"previous": "This movement was ushered in by the Haridasas (literally \"servants of Lord Hari\") and took shape in the 13th century - 14th century CE, period, prior to and during the early rule of the Vijayanagara empire. The main objective of this movement was to propagate the Dvaita philosophy of Madhvacharya (Madhva Siddhanta) to the masses through a literary medium known as Dasa Sahitya literature of the servants of the Lord. Purandaradasa is widely recognized as the \"Pithamaha\" of Carnatic Music for his immense contribution. Ramanujacharya, the leading expounder of Viśiṣṭādvaita, spent many years in Melkote. He came to Karnataka in 1098 AD and lived here until 1122 AD. He first lived in Tondanur and then moved to Melkote where the Cheluvanarayana Temple and a well organised Matha were built. He was patronized by the Hoysala king, Vishnuvardhana.[96]",
				"after": "In the twelfth century, Lingayatism emerged in northern Karnataka as a protest against the rigidity of the prevailing social and caste system. Leading figures of this movement were Basava, Akka Mahadevi and Allama Prabhu, who established the Anubhava Mantapa which was the center of all religious and philosophical thoughts and discussions pertaining to Ligayats. These three social reformers did so by the literary means of 'Vachana Sahitya' which is very famous for its simple, straight forward and easily understandable Kannada language. Lingayatism preached women equality by letting women wear Ishtalinga i.e. Symbol of god around their neck. Basava shunned the sharp hierarchical divisions that existed and sought to remove all distinctions between the hierarchically superior master class and the subordinate, servile class. He also supported inter-caste marriages and Kaayaka Tatva of Basavanna. This was the basis of the Lingayat faith which today counts millions among its followers.[97]",
			"color": "silver|0.274 light|0.16536 gray|0.16536 light|0.16536 grey|0.16536 light|0.15966 steel|0.15966 blue|0.15966 sienna|0.10205 gainsboro|0.0713 tan|0.042534 peach|0.03033 puff|0.03033 burly|0.023494 wood|0.023494 dark|0.014912 gray|0.014912 dark|0.014912 grey|0.014912 dark|0.012527 salmon|0.012527 rosy|0.011508 brown|0.011508 bisque|0.011449 black|0.010592 gray|0.010566 grey|0.010566 saddle|0.010439 brown|0.010439 dim|0.0078929 gray|0.0078929 dim|0.0078929 grey|0.0078929 wheat|0.0074267 navajo|0.0061738 white|0.0061738  "
		}
	}
}
