{
	"add": {
		"doc": {
			"id": "813b4436eab64946b184dee9ca74f011cfc36bc28fa1d4ceecb5cb7a161994dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Priestley_Riots_painting.jpg/220px-Priestley_Riots_painting.jpg",
			"previous": [],
				"after": "The animus that had been building against Dissenters and supporters of the American and French Revolutions exploded in July 1791. Priestley and several other Dissenters had arranged to have a celebratory dinner on the anniversary of the storming of the Bastille, a provocative action in a country where many disapproved of the French Revolution and feared that it might spread to Britain. Amid fears of violence, Priestley was convinced by his friends not to attend. Rioters gathered outside the hotel during the banquet and attacked the attendees as they left. The rioters moved on to the New Meeting and Old Meeting churches—and burned both to the ground. Priestley and his wife fled from their home; although their son William and others stayed behind to protect their property, the mob overcame them and torched Priestley's house \"Fairhill\" at Sparkbrook, destroying his valuable laboratory and all of the family's belongings. Twenty-six other Dissenters’ homes and three more churches were burned in the three-day riot.[134] Priestley spent several days hiding with friends until he was able to travel safely to London. The carefully executed attacks of the \"mob\" and the farcical trials of only a handful of the \"leaders\" convinced many at the time—and modern historians later—that the attacks were planned and condoned by local Birmingham magistrates. When George III was eventually forced to send troops to the area, he said: \"I cannot but feel better pleased that Priestley is the sufferer for the doctrines he and his party have instilled, and that the people see them in their true light.\"[135]",
			"color": "dim|0.36203 gray|0.36203 dim|0.36203 grey|0.36203 black|0.21029 gray|0.13792 grey|0.13792 tan|0.080282 dark|0.055976 gray|0.055976 dark|0.055976 grey|0.055976 rosy|0.052042 brown|0.052042  "
		}
	}
}
