{
	"add": {
		"doc": {
			"id": "814ecf5e2c7b625307d864f1737288c8a9aa36d4df58a9e68009fb372bbe71c7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Randy_Johnson_04.jpg/220px-Randy_Johnson_04.jpg",
				"previous": "The Phoenix Suns were the first major sports team in Phoenix, being granted a National Basketball Association (NBA) franchise in 1968.[181] They had originally played at the Arizona Veterans Memorial Coliseum before moving to America West Arena (now Talking Stick Resort Arena) in 1992.[182] The year following their move to the new arena, the Suns made the NBA finals for the second time in franchise history, losing to Michael Jordan's Chicago Bulls, 4 games to 2.[183] In 1997, the Phoenix Mercury were one of the original eight teams to launch the Women's National Basketball Association (WNBA). They also play at Talking Stick Resorts Arena. They have been to the WNBA championship series four times, losing in 1998 to the Houston Comets, before winning their first WNBA championship in 2007, when they defeated the Detroit Shock in five games.[184] They would repeat their championship in 2009, when they defeated the Indiana Fever,[185] and in 2014 when they swept the Chicago Sky.[186]",
				"after": "The Arizona Diamondbacks of Major League Baseball (National League West Division) began play as an expansion team in 1998. The team has played all of its home games in the same downtown park; originally called Bank One Ballpark (or \"BOB\" for short), in 2005 the stadium's name was changed to Chase Field.[187][188] It is the second highest stadium in the U.S. (after Coors Field in Denver), and is famous for its nationally known swimming pool beyond the outfield fence.[189] In 2001, the Diamondbacks defeated the New York Yankees 4 games to 3 in the World Series,[190] becoming the city's first professional sports franchise to win a national championship while located in Arizona. The win was also the fastest an expansion team had ever won the World Series, surpassing the old mark of the Florida Marlins of 5 years, set in 1997.[191]",
			"color": "tan|0.40696 peach|0.12983 puff|0.12983 bisque|0.092484 wheat|0.06741 blanched|0.045756 almond|0.045756 dark|0.045307 olive|0.045307 green|0.045307 antique|0.030609 white|0.030609 papaya|0.027036 whip|0.027036 dim|0.016184 gray|0.016184 dim|0.016184 grey|0.016184 gray|0.011121 grey|0.011121 moccasin|0.0096659 old|0.009563 lace|0.009563 corn|0.0087472 silk|0.0087472 linen|0.0077266 dark|0.0075295 gray|0.0075295 dark|0.0075295 grey|0.0075295 navajo|0.0073251 white|0.0073251 beige|0.0070996  "
		}
	}
}
