{
	"add": {
		"doc": {
			"id": "816094712209c49cbda48c49aed9e52fd7cf826dfbe0633bc925328af8b60871",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Tupolev_Tu-144_CCCP-77102_LEB_02.06.73_edited-3.jpg/220px-Tupolev_Tu-144_CCCP-77102_LEB_02.06.73_edited-3.jpg",
				"previous": "Although studies showed that turbojet engines are highly desirable for supersonic airliners, none were available. The Tu-144 prototype was therefore originally fitted with the inefficient Kuznetsov NK-144 turbofan engines and consequently suffered from higher nacelle aerodynamic drag. While this permitted early test flights, it did not permit cruising at Mach 2 without afterburner. A maximum cruising speed of 2,430 km/h (1,510 mph; 1,310 kn) (Mach 2.29) was obtained with the afterburner.[7] This meant that while Concorde could supercruise (maintain supersonic flight without using its afterburners), the Tu-144 could not. Later work on the Tu-144S resolved this shortcoming.[8] The turbofan engines suffered from heavy fuel consumption, and hence a limited range of about 2,500 km (1,600 mi; 1,300 nmi), far less range than the Rolls-Royce/Snecma Olympus 593 turbojet that powered Concorde.",
				"after": "The Tu-144S model, of which nine were produced, featured the Kuznetsov NK-144F turbofan engines that offered better fuel efficiency over the original engine. The four engines each had a maximum afterburning thrust of 200 kilonewtons (45,000 lbf) and each had separate inlet ducts in each nacelle and variable intake ramps in the inlets,[9] giving a cruising speed of 2,000 km/h (1,200 mph; 1,100 kn) (Mach 1.88). This also gave it a longer range of 3,080 km (1,910 mi; 1,660 nmi), but still less than half the range of Concorde.[10]",
			"color": "dark|0.40877 gray|0.40877 dark|0.40877 grey|0.40877 silver|0.26346 light|0.06588 gray|0.06588 light|0.06588 grey|0.06588 gainsboro|0.050531 black|0.031315 white|0.024786 smoke|0.024786 alice|0.016923 blue|0.016923 ghost|0.016545 white|0.016545 sea|0.01586 shell|0.01586 snow|0.015633 linen|0.013498 white|0.013142 mint|0.011699 cream|0.011699 floral|0.011542 white|0.011542 lavender|0.009597 blush|0.009597 azure|0.0095253 light|0.0064513 steel|0.0064513 blue|0.0064513 gray|0.0036024 grey|0.0036024  "
		}
	}
}
