{
	"add": {
		"doc": {
			"id": "816795a1b2140e0bb51595540dfda214e53930be43b557fe1fbc7af0d0721b06",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/University_of_Calcutta_7383.JPG/300px-University_of_Calcutta_7383.JPG",
				"previous": "West Bengal has eighteen universities.[111][112] The University of Calcutta, the oldest public university in India, has 136 affiliated colleges. Kolkata has played a pioneering role in the development of the modern education system in India. It is the gateway to the revolution of European education. Sir William Jones (philologist) established the Asiatic Society in 1794 for promoting oriental studies. People like Ram Mohan Roy, David Hare, Ishwar Chandra Vidyasagar, Alexander Duff and William Carey played a leading role in the setting up of modern schools and colleges in the city. The Fort William College was established in 1810. The Hindu College was established in 1817. The Scottish Church College, which is the oldest Christian liberal arts college in South Asia, started its journey in 1830. In 1855 the Hindu College was renamed as the Presidency College.[113] The",
				"after": "and Jadavpur University are prestigious technical universities.[114] Visva-Bharati University at Santiniketan is a central university and an institution of national importance.[115] The state has several higher education institutes of national importance including Indian Institute of Foreign Trade, Indian Institute of Management Calcutta (the first IIM), Indian Institute of Science Education and Research, Kolkata, Indian Statistical Institute, Indian Institute of Technology Kharagpur (the first IIT), Indian Institute of Engineering Science and Technology, Shibpur (the first IIEST), National Institute of Technology, Durgapur and West Bengal National University of Juridical Sciences. After 2003 the state govt supported the creation of West Bengal University of Technology, West Bengal State University and Gour Banga University.",
			"color": "black|0.27771 dim|0.16715 gray|0.16715 dim|0.16715 grey|0.16715 dark|0.15163 gray|0.15163 dark|0.15163 grey|0.15163 gray|0.14304 grey|0.14304 dark|0.078595 olive|0.078595 green|0.078595 silver|0.042433 olive|0.02571 drab|0.02571 light|0.017695 gray|0.017695 light|0.017695 grey|0.017695 dark|0.011721 slate|0.011721 gray|0.011721 gainsboro|0.011114 slate|0.0090938 gray|0.0090938  "
		}
	}
}
