{
	"add": {
		"doc": {
			"id": "818328b6eb7af01daf15a58c9271a1576db30bacc3fcc1e49e2662ef99d71fff",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Kenmore_Air_Lake_Union.jpg/220px-Kenmore_Air_Lake_Union.jpg",
				"previous": "Residents in both Seattle near their Lake Union seaport [10] and in Victoria have been growing increasingly concerned about noise and safety on the water. In Sept 2011 Victoria the St. James Community commissioned a report [11] that calls for \"serious restrictions\" on seaplane businesses\" (which include other services like helicopters). Kenmore Air has responded by encouraging their pilots to follow limited flight paths in Seattle [12] In 2013 when new high rise condos were proposed by Vulcan in South Lake Union neighborhood, Kenmore requested that an easemented be placed on new residents to prevent them from filing noise complaints and despite promises to cease operations by 8 pm as of June 2014 flights on Lake Union are occurring as late as 9 pm.",
				"after": "Daily, year-round seaplane service is provided from Seattle's Lake Union to Lopez Island, Orcas Island and San Juan Island in Washington State, as well as to Victoria, BC. Limited year-round service is also provided from Lake Union to the Canadian Gulf Islands and the Saanich Peninsula. Seasonally (May–September), daily seaplane service is provided from Kenmore Air Harbor to more than 30 destinations in British Columbia, including Big Bay, Campbell River, Cortes Island, Desolation Sound, Nanaimo, Port Hardy, Port McNeill, Quadra Island, the Sechelt Peninsula, Sonora Island, and Refuge Cove.",
			"color": "slate|0.21393 gray|0.21393 light|0.17829 slate|0.17829 gray|0.17829 steel|0.13548 blue|0.13548 dim|0.082131 gray|0.082131 dim|0.082131 grey|0.082131 light|0.062413 steel|0.062413 blue|0.062413 dark|0.060383 gray|0.060383 dark|0.060383 grey|0.060383 black|0.054233 gray|0.045726 grey|0.045726 silver|0.025868 light|0.017162 gray|0.017162 light|0.017162 grey|0.017162 dark|0.015966 slate|0.015966 gray|0.015966 lavender|0.014132 gainsboro|0.013291  "
		}
	}
}
