{
	"add": {
		"doc": {
			"id": "81883ead13c2b7e8d5a17303cfa7ab5450dfc01c7f570d17de4f26ea36a847bb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Ok%C4%99cie_LOT_i_BA_1939.jpeg/220px-Ok%C4%99cie_LOT_i_BA_1939.jpeg",
				"previous": "With the building finished in 1933, the new modernist premises of the Warsaw airport cost the State Treasury around 10 million Zloty. The new complex included three hangars, exhibition space, garages, and of course a large, modern terminal building with a concrete taxiway complete with stands for a number of aircraft. Warsaw thus received an airport befitting of any European capital city. In its first year of operation, Okęcie served around 10,750 passengers. After the aerodrome's civilian buildings were finished, the military potential of the site began to be developed, with a Polish Air Force base opening soon after; later followed the buildings of the Institute of Aviation, PZL aircraft-building plant and other pieces of aviation infrastructure.",
				"after": "As air traffic and the number of aircraftmovements grew greatly year on year, the authorities identified the need to develop a new system for air traffic navigation and control. The state, as a result, marked a number of air corridors for use by civil airlines, whilst radio stations were established to regulate such traffic and divert it away from sensitive and restricted areas. By 1938, the airport was equipped with 16 immigration checkpoints for passengers both departing and arriving on international flights. These posts were then manned by the Polish Border Guard. By 1937, the airport had also received new radio navigation equipment and was using Lorenz beam technology to assure the safety of landings and approaches over Warsaw, during periods of poor visibility or bad weather. On the eve of World War II, Okęcie airport was connected by regular scheduled flights with 6 domestic and 17 foreign airports, among which were Tel-Aviv (then in Palestine) and Beirut in Lebanon; there were also plans to soon begin transatlantic service to the United States.[5]",
			"color": "black|0.31104 dim|0.20744 gray|0.20744 dim|0.20744 grey|0.20744 gray|0.20244 grey|0.20244 dark|0.09932 gray|0.09932 dark|0.09932 grey|0.09932 silver|0.047432 light|0.032335 gray|0.032335 light|0.032335 grey|0.032335 gainsboro|0.025678 white|0.011182 smoke|0.011182 alice|0.0077077 blue|0.0077077 ghost|0.0076007 white|0.0076007 snow|0.0074119 sea|0.0073774 shell|0.0073774 lavender|0.0070913 blush|0.0070913 white|0.006652 mint|0.0056238 cream|0.0056238 linen|0.0048616 floral|0.0043467 white|0.0043467 azure|0.0037638  "
		}
	}
}
