{
	"add": {
		"doc": {
			"id": "8192610d840c5e03005e89ee8c7566d8337c4fa3e0b38c7a0164543abb0a948a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/MaryRose-carpentry_tools1.jpg/220px-MaryRose-carpentry_tools1.jpg",
				"previous": "The excavation and salvage in the 1970s and early '80s meant that diving operations ceased, even though modern scaffolding and part of the bow were left on the seabed. The pressure on conservators to treat tens of thousands of artefacts and the high costs of conserving, storing and displaying the finds and the ship meant that there were no funds available for diving. In 2002, the UK Ministry of Defence announced plans to build two new aircraft carriers. Because of the massive size of the new vessels, the outlet from Portsmouth needed to be surveyed to make sure that they could sail no matter the tide. The planned route for the underwater channel ran close to the Mary Rose wrecksite, which meant that funding was supplied to survey and excavate the site once more. Even though the planned carriers were down-sized enough to not require alteration of Portsmouth outlet, the excavations had already exposed timbers and were completed in 2005. Among the most important finds was the ten-metre (32 feet) stem, the forward continuation of the keel, which provided more exact details about the original profile of the ship.[116]",
				"after": "Over 26,000 artefacts and pieces of timber were salvaged along with remains of about half the crew members,[117] The faces of some crew members have been reconstructed. Analysis of the crew skeletons shows many had suffered malnutrition, and had evidence of rickets, scurvy, and other deficiency diseases was found. Crew members also developed arthritis through the stresses on their joints from heavy lifting and maritime life generally, and suffered bone fractures. [118] As the ship was intended to function as a floating, self-contained community, it was stocked with victuals (food and drink) that could sustain its inhabitants for extended periods of time. The casks used for storage on the Mary Rose have been compared with those from a wreck of a trade vessel from the 1560s and have revealed that they were of better quality, more robust and reliable, an indication that supplies for the Tudor navy were given high priority, and their requirements set a high standard for cask manufacturing at the time.[119] As a miniature society at sea, the wreck of the Mary Rose held personal objects belonging to individual crew members. This included clothing, games, various items for spiritual or recreation use, or objects related to mundane everyday tasks such as personal hygiene, fishing and sewing.[120] The master carpenter's chest, for example, contained a backgammon set, a book, three plates, a sundial, and a tankard, goods suggesting he was relatively wealthy.[118]",
			"color": "black|0.23192 burly|0.19929 wood|0.19929 dim|0.11991 gray|0.11991 dim|0.11991 grey|0.11991 gray|0.11679 grey|0.11679 tan|0.11305 dark|0.10037 gray|0.10037 dark|0.10037 grey|0.10037 peru|0.045096  "
		}
	}
}
