{
	"add": {
		"doc": {
			"id": "81986c406b52971c13215c9ae2755657ea709be3513a56f7b0aad37b43763867",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Suillus_salmonicolor_167980.jpg/220px-Suillus_salmonicolor_167980.jpg",
			"previous": [],
				"after": "The cap of S. salmonicolor is bluntly rounded or convex to nearly flattened, reaching a diameter of 3–9.5 cm (1.2–3.7 in). The cap surface is sticky to slimy when moist, but becomes shiny when dry. The cap color is variable, ranging from dingy yellow to yellowish-orange to ochraceous-salmon, cinnamon-brown or olive-brown to yellow-brown. The flesh is pale orange-yellow to orange-buff or orange, and does not stain when exposed to air. The odor and taste are not distinctive. The pore surface on the underside of the cap is yellow to dingy yellow, or yellowish orange to salmon, darkening to brownish with age; it also does not stain when bruised. The pores are circular to angular, measuring 1–2 per mm and 8–10 mm (0.3–0.4 in) deep. The stem is 2.5–10 cm (1.0–3.9 in) long, 6–16 mm (0.2–0.6 in) thick, and either equal in width throughout or slightly enlarged in the lower portion. It is whitish to yellowish or pinkish-ochre, and has reddish-brown to dark brown glandular dots and smears on the surface. Glandular dots are made of clumps of pigmented cells, and, unlike reticulation or scabers (small visible tufts of fibers that occur on the stems of other Suillus species), can be rubbed off with handling. The flesh is ochraceous to yellowish, often salmon-orange at the base of the stem. The partial veil that protects the developing gills is initially thick, baggy, and rubbery. It often has a conspicuously thickened cottony roll of tissue at its base, and sometimes flares outward from the stem on the lower portion. It forms a gelatinous ring on the upper to middle part of the stem. The spore print is cinnamon-brown to brown.[12] The surface of the cap, when applied with a drop of dilute potassium hydroxide (KOH) or ammonia solution (chemical reagents commonly used for mushroom identification), will first turn a fleeting pink color, then dark red as the flesh collapses.[19]",
			"color": "black|0.5047 dim|0.061923 gray|0.061923 dim|0.061923 grey|0.061923 peru|0.052794 tan|0.052503 burly|0.043681 wood|0.043681 gray|0.040625 grey|0.040625 sienna|0.033069 dark|0.029505 gray|0.029505 dark|0.029505 grey|0.029505 saddle|0.019617 brown|0.019617 silver|0.014479 navajo|0.011799 white|0.011799 wheat|0.011301  "
		}
	}
}
