{
	"add": {
		"doc": {
			"id": "819e86cf413ccdf912b1436a47cd284d6aca2adb87d342c3543f35f7c99bb717",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Tirana_Skanderbeg_Square_%282%29.jpg/220px-Tirana_Skanderbeg_Square_%282%29.jpg",
				"previous": "The Great Warrior Skanderbeg (Albanian: Skënderbeu, Russian: Великий воин Албании Скандербег), a 1953 Albanian-Soviet biographical film, earned an International Prize at the 1954 Cannes Film Festival.[165] The film was re-recorded and updated for high-definition for the 100th anniversary of Albanian independence.",
				"after": "Skanderbeg's memory has been engraved in many museums, such as the Skanderbeg Museum next to Krujë Castle. Many monuments are dedicated to his memory in the Albanian cities of Tirana (in Skanderbeg Square by Odhise Paskali),(in and outside Skanderbeg Museum by Janaq Paço) Krujë, and Peshkopi. A palace in Rome in which Skanderbeg resided during his 1466–67 visits to the Vatican is still called Palazzo Skanderbeg and currently houses the Italian museum of pasta:[166] the palace is located between the Fontana di Trevi and the Quirinal Palace. Also in Rome, a statue is dedicated to the Albanian hero in Piazza Albania. Monuments or statues of Skanderbeg have also been erected in the cities of Skopje and Debar, in the Republic of Macedonia; Pristina, in Kosovo; Geneva, in Switzerland; Brussels, in Belgium; London, in England; and other settlements in southern Italy where there is an Arbëreshë community. In 2006, a statue of Skanderbeg was unveiled on the grounds of St. Paul's Albanian Catholic Community in Rochester Hills, Michigan. It is the first statue of Skanderbeg to be erected in the United States.[167]",
			"color": "gray|0.42521 grey|0.42521 dim|0.15102 gray|0.15102 dim|0.15102 grey|0.15102 light|0.14261 slate|0.14261 gray|0.14261 black|0.086146 dark|0.066374 gray|0.066374 dark|0.066374 grey|0.066374 tan|0.029042 silver|0.021902 slate|0.016819 gray|0.016819 dark|0.0068431 olive|0.0068431 green|0.0068431 firebrick|0.0062212 light|0.0059132 gray|0.0059132 light|0.0059132 grey|0.0059132 burly|0.0058894 wood|0.0058894  "
		}
	}
}
