{
	"add": {
		"doc": {
			"id": "819e2962328b491f5b6ef11b0f7bf3ca7a354a4a92b4f8e5590d30d1e4ce1097",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/KellsFol005rCanonTable.jpg/220px-KellsFol005rCanonTable.jpg",
				"previous": "The extant book contains preliminary matter, the complete text of the Gospels of Matthew, Mark and Luke, and the Gospel of John through John 17:13. The remainder of John and an unknown amount of the preliminary matter is missing and was perhaps lost when the book was stolen early in the 11th century AD. The remaining preliminary matter consists of two fragmentary lists of Hebrew names contained in the Gospels, Breves causae (Gospel summaries), Argumenta (short biographies of the Evangelists), and Eusebian canon tables. It is probable that, like the Lindisfarne Gospels and the Books of Durrow and Armagh, part of the lost preliminary material included the letter of Jerome to Pope Damasus I beginning Novum opus, in which Jerome explains the purpose of his translation. It is also possible, though less likely, that the lost material included the letter of Eusebius to Carpianus, in which he explains the use of the canon tables.[27] Of all the insular Gospels, only the Lindisfarne manuscript contains this letter.",
				"after": "There are two fragments of the lists of Hebrew names; one on the recto of the first surviving folio and one on folio 26, which is currently inserted at the end of the prefatory matter for John. The first list fragment contains the end of the list for the Gospel of Matthew. The missing names from Matthew would require an additional two folios. The second list fragment, on folio 26, contains about a fourth of the list for Luke. The list for Luke would require an additional three folios. The structure of the quire in which folio 26 occurs is such that it is unlikely that there are three folios missing between folios 26 and 27, so that it is almost certain that folio 26 is not now in its original location. There is no trace of the lists for Mark and John.[28]",
			"color": "burly|0.38674 wood|0.38674 tan|0.23872 navajo|0.11126 white|0.11126 moccasin|0.063442 wheat|0.059114 pale|0.042781 golden|0.042781 rod|0.042781 dim|0.027522 gray|0.027522 dim|0.027522 grey|0.027522 sandy|0.0097519 brown|0.0097519 peru|0.0095893  "
		}
	}
}
