{
	"add": {
		"doc": {
			"id": "81b17947798b8d6ac90aa605c4ec9cd6dd6b2eb4d58e2f8d1a22bdf3ef0422a8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/1849_%2420_Liberty_Head_double_eagle_pattern_%28obverse%29.jpg/220px-1849_%2420_Liberty_Head_double_eagle_pattern_%28obverse%29.jpg",
				"previous": "Longacre set forth on a third attempt to create a die. He was hampered not only by the continued opposition of Peale, but by poor lighting and the noxious fumes that penetrated his office at the Philadelphia Mint. A friend, New York engraver Charles Cushing Wright, arranged for Peter F. Cross to assist Longacre with making hubs and dies.[20] Cross made the first obverse die in November and December 1849 at Longacre's direction, and the chief engraver made the reverse.[16] On December 22, 1849, Patterson wrote to Treasury Secretary William M. Meredith that the dies were completed. He enclosed a double eagle, asking Meredith, if he approved of the piece, to send word as quickly as possible to allow the coinage of 1849 double eagles in quantity. Before any reply could be received, Peale objected on December 24, complaining that the relief of the head of Liberty was so high that pieces struck using the Philadelphia Mint's steam-powered machinery could not fully bring out the design—the coin sent to Meredith had been coined on a medal press, by hand. In addition, Peale alleged that the head was in such high relief that the coins would not stack. Patterson sent Peale's letter to Meredith on December 25, noting that this meant there would be a lengthy delay.[20]",
				"after": "Longacre completed the lower-relief dies about January 12, 1850. Peale did not test them for two weeks; when he did, he rejected them, stating that Liberty's head opposed the eagle on the reverse, making it difficult for the full design to be brought forth. He stated that Longacre would have to move the position of the head. Longacre, outraged, appealed to Director Patterson, who took no action, but early the next month came to see Longacre in his office. He told the engraver that the Taylor administration (which had taken office in March 1849) had decided on Longacre's removal, and urged him to send in his resignation as quickly as possible. Longacre did not resign, but went to Washington to see Secretary Meredith. He found that Patterson had lied to Meredith about a number of matters. For example, when Longacre took a new double eagle from his pocket, Meredith expressed surprise, believing that the dies from which it had been made had been broken. Longacre kept his job.[24]",
			"color": "golden|0.66654 rod|0.66654 peru|0.11301 dark|0.10692 golden|0.10692 rod|0.10692 saddle|0.040785 brown|0.040785 sienna|0.023751 black|0.017949 sandy|0.011432 brown|0.011432 gold|0.0082314  "
		}
	}
}
