{
	"add": {
		"doc": {
			"id": "81b61c3c9212f761129b612e58fb56c7bc6b9c9a2310fcee148b6ec15182c491",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/CVLdam.JPG/744px-CVLdam.JPG",
				"previous": "Further excavations around the village of Moreton, which has now been totally submerged, found evidence of a thriving community in medieval times and possibly the remains of the Nunnery of Santa Cruz.[10] During the Middle Ages farming was the most important activity in the area covered by the lake, supported by four flour mills powered by the River Chew. Stratford Mill was demolished and re-erected in the grounds of Blaise Castle Museum, in north-west Bristol. The largest settlement was Moreton, which is listed in the Domesday Book and survived until the flooding of the lake, when the remains of the Moreton Cross were moved to Chew Stoke Parish Church. There is also evidence of lime kilns, which were used in the production of mortar for the construction of local churches. Farming, both arable and dairy, continued until the flooding of the lake, with most households also keeping pigs. There were orchards for fruit production, including apples, pears and plums.[8]",
				"after": "Plans for the building of the reservoir were under discussion before the Second World War, and an Act of Parliament submitted by the Bristol Waterworks Company was passed in 1939. Following this, farms were bought by the company and farmed by the previous owners as tenancies. Farms and buildings still remaining in private hands were acquired by compulsory purchase. The sanction for construction was given in 1949 and the contract awarded to A.E. Farr & Co., who employed approximately 300 people on the site. The main dam was initially stabilised by injecting concrete into the cracks in the bedrock. The core of the dam was made of puddled clay mixed with sand. This was the first time the gain in strength brought about by the use of sand drains had been quantified.[11] The lake was inaugurated by Queen Elizabeth II, accompanied by Prince Philip, with the unveiling of a commemorative stone and plaque, which can be seen from the dam, on 17 April 1956, although it was not full until 25 February 1958.[8] Flowers were presented to the Queen at the opening of Chew Valley Lake by Judith Blair Brown, daughter of Kennedy Brown, who worked at Bristol Water Works at the time of construction of the lake.",
			"color": "dim|0.36552 gray|0.36552 dim|0.36552 grey|0.36552 gray|0.16297 grey|0.16297 dark|0.15361 gray|0.15361 dark|0.15361 grey|0.15361 dark|0.065393 slate|0.065393 gray|0.065393 silver|0.050521 light|0.03096 gray|0.03096 light|0.03096 grey|0.03096 antique|0.022485 white|0.022485 slate|0.021565 gray|0.021565 black|0.017946 gainsboro|0.016686  "
		}
	}
}
