{
	"add": {
		"doc": {
			"id": "81b8a2848ee9df3a284820342bfe6e03731dba6e3eda60462cf193310f3ce593",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Aeromexico_Boeing_737-700_Airwim-1.jpg/220px-Aeromexico_Boeing_737-700_Airwim-1.jpg",
				"previous": "The sale of Grupo Cintra was scheduled after several delays in September 1999, and with the looming presidential elections in 2000, everything was delayed once again. The ruling party lost the election after 70 years in office and all the policies changed. Due to the recession in 2000 the new government put everything on hold waiting for better economic conditions to start the stock sell-off, and just when they were everything was about to start, the 11 September 2001 attacks occurred and nothing materialized since the two main carriers Mexicana and Aeroméxico (as most Legacy carriers) were losing large amounts of money.",
			"after": [
				".",
				"In the period between 2000 and 2005 Aeroméxico had an average fleet of 60 aircraft in main line, plus 20 in Aerolitoral, as well as five CEO's during this time. After 9/11 and the Iraq War, it was forced to put in movement an ambitious fleet renovation program. In 2003, the airline acquired its first Boeing 737-700 instead of the Boeing 717 as a replacement for its aging DC-9 aircraft. On 29 March 2006 Aeroméxico CEO, Andrés Conesa announced the inauguration of direct flights between Japan and Mexico City via Tijuana. This was after the purchase of two Boeing 777-200ER, making Aeroméxico the third airline in Latin America to fly regularly to Asia, after Varig and the now defunct VASP. However, because of Varig's redimention, Aeroméxico is currently the sole airline with this service until some other Latin American airline starts flying to Asia. Aeroméxico has resumed its Mexico City-Tijuana-Shanghai route twice a week as of 30 March 2010. Suspension of this flight was due to the 2009 flu pandemic."
			],
			"color": "gray|0.18218 grey|0.18218 dim|0.17871 gray|0.17871 dim|0.17871 grey|0.17871 light|0.14797 slate|0.14797 gray|0.14797 slate|0.11963 gray|0.11963 dark|0.11233 gray|0.11233 dark|0.11233 grey|0.11233 black|0.077768 silver|0.038653 light|0.02073 gray|0.02073 light|0.02073 grey|0.02073  "
		}
	}
}
