{
	"add": {
		"doc": {
			"id": "81eb92f91593db51dfbfa7af8bba389d2a21c55edb54a1be16f3cdcb519397d3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/VulcanUinkart.jpg/300px-VulcanUinkart.jpg",
				"previous": "The time scale and sequence over which the river's present course and the Grand Canyon were formed is uncertain. Before the Gulf of California was formed around 12 to 5 million years ago by faulting processes along the boundary of the North American and Pacific plates,[95] the Colorado flowed west to an outlet on the Pacific Ocean – possibly Monterey Bay on the Central California coast, forming the Monterey submarine canyon. The uplift of the Sierra Nevada mountains began about 4.5 million years ago, diverting the Colorado southwards towards the Gulf.[96] As the Colorado Plateau continued to rise between 5 and 2.5 million years ago, the river maintained its ancestral course (as an antecedent stream) and began to cut the Grand Canyon. Antecedence played a major part in shaping other peculiar geographic features in the watershed, including the Dolores River's bisection of Paradox Valley in Colorado and the Green River's cut through the Uinta Mountains in Utah.[97]",
				"after": "Sediments carried from the plateau by the Colorado River created a vast delta made of more than 10,000 cubic miles (42,000 km3) of material that walled off the northernmost part of the gulf in approximately 1 million years. Cut off from the ocean, the portion of the gulf north of the delta eventually evaporated and formed the Salton Sink, which reached about 260 feet (79 m) below sea level.[98][99] Since then the river has changed course into the Salton Sink at least three times, transforming it into Lake Cahuilla, which at maximum size flooded up the valley to present-day Indio, California. The lake took about 50 years to evaporate after the Colorado resumed flowing to the Gulf. The present-day Salton Sea can be considered the most recent incarnation of Lake Cahuilla, though on a much smaller scale.[100]",
			"color": "sienna|0.35873 rosy|0.16301 brown|0.16301 black|0.0907 peru|0.065053 sandy|0.034218 brown|0.034218 saddle|0.030671 brown|0.030671 indian|0.029905 red|0.029905 dark|0.027814 salmon|0.027814 brown|0.025789  "
		}
	}
}
