{
	"add": {
		"doc": {
			"id": "820281bae59e6a424f15da256b5bfaa9903b02cb32ce6b7d6acac6834565947c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Beath-Dickey_House_2011.jpg/220px-Beath-Dickey_House_2011.jpg",
			"previous": [],
				"after": "Surrounding Atlanta's three high-rise districts are the city's low- and medium-density neighborhoods,[72] where the craftsman bungalow single-family home is dominant.[73] The eastside is marked by historic streetcar suburbs built from the 1890s-1930s as havens for the upper middle class. These neighborhoods, many of which contain their own villages encircled by shaded, architecturally-distinct residential streets, include the Victorian Inman Park, Bohemian East Atlanta, and eclectic Old Fourth Ward.[20][74] On the westside, former warehouses and factories have been converted into housing, retail space, and art galleries, transforming the once-industrial West Midtown into a model neighborhood for smart growth, historic rehabilitation, and infill construction.[75] In southwest Atlanta, neighborhoods closer to downtown originated as streetcar suburbs, including the historic West End, while those farther from downtown retain a postwar suburban layout, including Collier Heights and Cascade Heights, home to much of the city's affluent African American population.[76][77][78] Northwest Atlanta contains the areas of the city to west of Marietta Boulevard and to the north of Martin Luther King, Jr. Drive, including those neighborhoods remote to downtown, such as Riverside, Bolton and Whittier Mill, which is one of Atlanta's designated Landmark Historical Neighborhoods. Vine City, though technically Northwest, adjoins the city's Downtown area and has recently been the target of community outreach programs and economic development initiatives.[79]",
			"color": "gray|0.17392 grey|0.17392 dim|0.17209 gray|0.17209 dim|0.17209 grey|0.17209 black|0.12464 dark|0.090143 gray|0.090143 dark|0.090143 grey|0.090143 dark|0.079193 olive|0.079193 green|0.079193 silver|0.059707 indian|0.039299 red|0.039299 light|0.03391 gray|0.03391 light|0.03391 grey|0.03391 light|0.022915 coral|0.022915 gainsboro|0.01996 tan|0.019706 rosy|0.01805 brown|0.01805 slate|0.011309 gray|0.011309  "
		}
	}
}
