{
	"add": {
		"doc": {
			"id": "821c8e292351d477b5e693336293895a877901273cf3b1348d0dde911f4a2f7a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Toraja_Elders.JPG/220px-Toraja_Elders.JPG",
				"previous": "Another component of the ritual is the slaughter of water buffalo. The more powerful the person who died, the more buffalo are slaughtered at the death feast. Buffalo carcasses, including their heads, are usually lined up on a field waiting for their owner, who is in the \"sleeping stage\". Torajans believe that the deceased will need the buffalo to make the journey and that they will be quicker to arrive at Puya if they have many buffalo. Slaughtering tens of water buffalo and hundreds of pigs using a machete is the climax of the elaborate death feast, with dancing and music and young boys who catch spurting blood in long bamboo tubes. Some of the slaughtered animals are given by guests as \"gifts\", which are carefully noted because they will be considered debts of the deceased's family.[28] However, a cockfight, known as bulangan londong, is an integral part of the ceremony. As with the sacrifice of the buffalo and the pigs, the cockfight is considered sacred because it involves the spilling of blood on the earth. In particular, the tradition requires the sacrifice of at least three chickens. However, it is common for at least 25 pairs of chickens to be set against each other in the context of the ceremony.[29]",
				"after": "There are three methods of burial: the coffin may be laid in a cave or in a carved stone grave, or hung on a cliff. It contains any possessions that the deceased will need in the afterlife. The wealthy are often buried in a stone grave carved out of a rocky cliff. The grave is usually expensive and takes a few months to complete. In some areas, a stone cave may be found that is large enough to accommodate a whole family. A wood-carved effigy, called Tau tau, is usually placed in the cave looking out over the land.[30] The coffin of a baby or child may be hung from ropes on a cliff face or from a tree. This hanging grave usually lasts for years, until the ropes rot and the coffin falls to the ground.",
			"color": "maroon|0.078002 firebrick|0.064871 black|0.057301 dark|0.052072 red|0.052072 lavender|0.046534 dark|0.045315 gray|0.045315 dark|0.045315 grey|0.045315 dim|0.041544 gray|0.041544 dim|0.041544 grey|0.041544 white|0.033972 smoke|0.033972 gray|0.033344 grey|0.033344 silver|0.031216 brown|0.027583 alice|0.027564 blue|0.027564 sea|0.027379 shell|0.027379 ghost|0.027219 white|0.027219 gainsboro|0.026736 snow|0.026656 light|0.026418 gray|0.026418 light|0.026418 grey|0.026418 floral|0.026037 white|0.026037 mint|0.025149 cream|0.025149 white|0.02397 rosy|0.023509 brown|0.023509 light|0.022164 steel|0.022164 blue|0.022164 lavender|0.019399 blush|0.019399 linen|0.018827 azure|0.01833 old|0.016315 lace|0.016315 ivory|0.015879 antique|0.014143 white|0.014143 crimson|0.012783 beige|0.012409 honeydew|0.011423 light|0.0091547 slate|0.0091547 gray|0.0091547 indian|0.0085008 red|0.0085008  "
		}
	}
}
