{
	"add": {
		"doc": {
			"id": "821d5e68ec14347524229959e9b3f8880cdf9d4fe5fe9db2aa5800448846a1b0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Mall_at_Steamtown_atrium_during_Office_convention.jpg/170px-Mall_at_Steamtown_atrium_during_Office_convention.jpg",
				"previous": "The city of Scranton, long known mainly for its industrial past as a coal mining and rail center,[171] has eagerly embraced, and ultimately has been redefined by the show. \"We're really hip now,\" says the mayor's assistant.[50] The Dunder Mifflin logo is on a lamppost banner in front of Scranton City Hall, as well as the pedestrian bridge to The Mall at Steamtown. The Pennsylvania Paper & Supply Company, whose tower is shown in the opening credits, plans to add it to the tower as well.[172] Newspapers in other Northeastern cities have published travel guides to Scranton locations for tourists interested in visiting places mentioned in the show.[171][172][173] Scranton has become identified with the show outside the United States as well. In a 2008 St. Patrick's Day speech in its suburb of Dickson City, former Taoiseach (Irish prime minister) Bertie Ahern identified the city as the home of Dunder Mifflin.[174]",
				"after": "The inaugural The Office convention was held downtown in October 2007. Notable landmarks, some of which have been settings for the show, that served as venues include the University of Scranton, the Radisson Lackawanna Station Hotel and the Mall at Steamtown. Cast appearances were made by B.J. Novak, Ed Helms, Oscar Nunez, Angela Kinsey, Brian Baumgartner, Leslie David Baker, Mindy Kaling, Craig Robinson, Melora Hardin, Phyllis Smith, Creed Bratton, Kate Flannery, Bobby Ray Shafer, and Andy Buckley. Writer appearances, besides Novak and Kaling, were made by Greg Daniels, Michael Schur, Jennifer Celotta, Lee Eisenberg, Gene Stupnitsky, Justin Spitzer, Anthony Ferrell, Ryan Koh, Lester Lewis, and Jason Kessler. Not present were writer-actor Paul Lieberstein (who was originally going to make an appearance), Steve Carell, John Krasinski, Rainn Wilson, and Jenna Fischer.[175]",
			"color": "dark|0.11551 gray|0.11551 dark|0.11551 grey|0.11551 silver|0.096928 light|0.074263 gray|0.074263 light|0.074263 grey|0.074263 dim|0.067811 gray|0.067811 dim|0.067811 grey|0.067811 gray|0.064441 grey|0.064441 gainsboro|0.062287 lavender|0.054903 light|0.03484 steel|0.03484 blue|0.03484 dark|0.03324 slate|0.03324 gray|0.03324 thistle|0.021879 alice|0.020794 blue|0.020794 white|0.020147 smoke|0.020147 ghost|0.018147 white|0.018147 sienna|0.017896 light|0.016539 slate|0.016539 gray|0.016539 slate|0.015875 gray|0.015875 rosy|0.015471 brown|0.015471 lavender|0.013682 blush|0.013682 black|0.013429 snow|0.012021 azure|0.011483 linen|0.01087 pale|0.010473 golden|0.010473 rod|0.010473 white|0.010423 misty|0.0095969 rose|0.0095969 mint|0.0094222 cream|0.0094222 sea|0.0089144 shell|0.0089144 saddle|0.008144 brown|0.008144 dark|0.0071483 slate|0.0071483 blue|0.0071483 crimson|0.0067399 light|0.0058378 blue|0.0058378  "
		}
	}
}
