{
	"add": {
		"doc": {
			"id": "824b85dc76b8f015a0af2eb572ea79cc8f587b633db6d6c3ded89ebf42d01fa2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/George_Romney_-_William_Shakespeare_-_The_Tempest_Act_I%2C_Scene_1.jpg/300px-George_Romney_-_William_Shakespeare_-_The_Tempest_Act_I%2C_Scene_1.jpg",
				"previous": "From the outset, Boydell's project inspired imitators. In April 1788, after the announcement of the Shakespeare Gallery, but a year before its opening, Thomas Macklin opened a Gallery of the Poets in the former Royal Academy building on the south side of Pall Mall. The first exhibition featured one work from each of 19 artists, including Fuseli, Reynolds, and Thomas Gainsborough. The gallery added new paintings of subjects from poetry each year, and from 1790 supplemented these with scenes from the Bible. The Gallery of the Poets closed in 1797, and its contents were offered by lottery.[81] This did not deter Henry Fuseli from opening a Milton Gallery in the same building in 1799. Another such venture was the Historic Gallery opened by Robert Bowyer in Schomberg House at 87 Pall Mall in about 1793. The gallery accumulated 60 paintings (many by the same artists who worked for Boydell) commissioned to illustrate a new edition of David Hume's The History of Great Britain.[82] Ultimately, Bowyer had to seek parliamentary approval for a sale by lottery in 1805, and the other ventures, like Boydell's, also ended in financial failure.[82][83]",
				"after": "The building in Pall Mall was purchased in 1805 by the British Institution, a private club of connoisseurs founded that year to hold exhibitions. It remained an important part of the London art scene until disbanded in 1867, typically holding a Spring exhibition of new works for sale from the start of February to the first week of May, and a loan exhibition of old masters, generally not for sale, from the first week of June to the end of August.[84]",
			"color": "gray|0.11874 grey|0.11874 dark|0.089227 gray|0.089227 dark|0.089227 grey|0.089227 antique|0.076729 white|0.076729 linen|0.068551 old|0.064641 lace|0.064641 beige|0.060357 dim|0.059752 gray|0.059752 dim|0.059752 grey|0.059752 sea|0.05952 shell|0.05952 floral|0.058613 white|0.058613 ivory|0.056997 silver|0.048489 corn|0.046384 silk|0.046384 papaya|0.045099 whip|0.045099 light|0.036994 gray|0.036994 light|0.036994 grey|0.036994 honeydew|0.027134 gainsboro|0.020721 white|0.016465 smoke|0.016465 mint|0.015707 cream|0.015707 snow|0.011103 blanched|0.0078681 almond|0.0078681 light|0.0056741 yellow|0.0056741 white|0.0035956  "
		}
	}
}
