{
	"add": {
		"doc": {
			"id": "824ffb2651a0720e5dffe6bfea78b50ec24823760b1fed2f0a7d23579a156466",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Ceddowes.jpg/100px-Ceddowes.jpg",
				"previous": "At 1:45 am Catherine Eddowes' mutilated body was found by PC Edward Watkins at the south-west corner of Mitre Square, in the City of London, about 12 minutes walk from Berner Street.[51] She had been killed less than 10 minutes earlier by a slash to the throat from left to right with a sharp, pointed knife at least 6 inches (15 cm) long.[52] Her face and abdomen were mutilated, and her intestines were drawn out over the right shoulder with a detached length between her torso and left arm. Her left kidney and most of her uterus were removed. The Eddowes inquest was opened on 4 October by Samuel F. Langham, coroner for the City of London.[53] The examining pathologist, Dr Frederick Gordon Brown, believed the perpetrator \"had considerable knowledge of the position of the organs\" and from the position of the wounds on the body he could tell that the murderer had knelt to the right of the body, and worked alone.[54] However, the first doctor at the scene, local surgeon Dr George William Sequeira, disputed that the killer possessed anatomical skill or sought particular organs.[55] His view was shared by City medical officer William Sedgwick Saunders, who was also present at the autopsy.[56] Because of this murder's location, the City of London Police under Detective Inspector James McWilliam were brought into the enquiry.[57]",
				"after": "At 3 am a blood-stained fragment of Eddowes' apron was found lying in the passage of the doorway leading to 108 to 119 Goulston Street, Whitechapel, about a third of a mile (500 m) from the murder scene. There was chalk writing on the wall of the doorway, which read either \"The Juwes are the men that will not be blamed for nothing\"[59][60] or \"The Juwes are not the men who will be blamed for nothing.\"[61] At 5 am, Commissioner Warren attended the scene and ordered the words erased for fear that they would spark anti-Semitic riots.[62] Goulston Street was on a direct route from Mitre Square to Flower and Dean Street, where both Stride and Eddowes lived.[63]",
			"color": " "
		}
	}
}
