{
	"add": {
		"doc": {
			"id": "825ae17409b0bcc4512c567122d27fc5c72e84e8b9dac9061a37fe1e511a8f73",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/ASA_conference_2008_-_06.JPG/220px-ASA_conference_2008_-_06.JPG",
			"previous": [],
				"after": "Charles Cannan, who had been instrumental in Gell's removal, succeeded Gell in 1898, and Humphrey S. Milford, his younger colleague, effectively succeeded Frowde in 1907. Both were Oxford men who knew the system inside out, and the close collaboration with which they worked was a function of their shared background and worldview. Cannan was known for terrifying silences, and Milford had an uncanny ability, testified to by Amen House employees, to 'disappear' in a room rather like a Cheshire cat, from which obscurity he would suddenly address his subordinates and make them jump. Whatever their reasons for their style of working, both Cannan and Milford had a very hardnosed view of what needed to be done, and they proceeded to do it. Indeed Frowde knew within a few weeks of Milford's entering the London office in [1904] that he would be replaced. Milford, however, always treated Frowde with courtesy, and Frowde remained in an advisory capacity till 1913. Milford rapidly teamed up with J. E. Hodder Williams of Hodder and Stoughton, setting up what was known as the Joint Account for the issue of a wide range of books in education, science, medicine and also fiction. Milford began putting in practice a number of initiatives, including the foundations of most of the Press's global branches.",
			"color": "gray|0.27331 grey|0.27331 dark|0.1597 gray|0.1597 dark|0.1597 grey|0.1597 dim|0.11452 gray|0.11452 dim|0.11452 grey|0.11452 black|0.08624 silver|0.050242 steel|0.04442 blue|0.04442 light|0.038224 gray|0.038224 light|0.038224 grey|0.038224 gainsboro|0.030628 midnight|0.025695 blue|0.025695 light|0.023701 slate|0.023701 gray|0.023701 slate|0.023669 gray|0.023669 light|0.016314 steel|0.016314 blue|0.016314 dark|0.009155 slate|0.009155 blue|0.009155 lavender|0.0087797 white|0.0082878 smoke|0.0082878 alice|0.0054744 blue|0.0054744 ghost|0.0052893 white|0.0052893  "
		}
	}
}
