{
	"add": {
		"doc": {
			"id": "8262f4842bc921d6573905a95985c4ad8602c0d9b69e95e2f62d1927cedc1d1e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/St_Peter_Mancroft.jpg/170px-St_Peter_Mancroft.jpg",
				"previous": "With the powers of the King's Clerk abolished, the bailiffs of Norwich set about regulating the operation of the market for what they felt was the greatest benefit to the city. To encourage fair competition among the market's traders, it was forbidden to sell foodstuffs before the Cathedral bell had tolled for Lady Mass (6.00 am).[3] The practice of forestalling (meeting merchants on their way to the market either to buy their goods for resale, or to prevent them from attending the market and thus make goods of the type they were selling scarce and hence more expensive) was forbidden. Trading anywhere other than in the market was strongly discouraged and the right to re-sell goods at a profit was restricted to Freemen of the city.[3][note 3] The prices of bread and beer were fixed,[note 4] and a set of standardised weights and measures was introduced, against which measures used by merchants would regularly be checked.[3] Shortly after the transfer of the market to the city a market cross was erected near the centre of the main market (opposite the present day entrance to Davey Place), the design of which is not recorded.[11]",
				"after": "In mid-1348, the outbreak of bubonic plague known as the Great Mortality (later referred to as the Black Death), which had swept across Europe during the past year, reached England for the first time with an outbreak in the south coast port of Melcombe.[12] The plague spread gradually over the rest of the country with devastating effect, causing a mortality estimated at between 30%–45%.[13] In late March 1349, the outbreak reached East Anglia and, for reasons which are not understood, increased drastically in intensity.[13] In 1349–50 alone, more than half the population of East Anglia died.[14] In 1369, East Anglia, whose farming economy had collapsed in the wake of the plague, was struck by famine.",
			"color": "steel|0.42705 blue|0.42705 dark|0.090592 gray|0.090592 dark|0.090592 grey|0.090592 light|0.078071 sky|0.078071 blue|0.078071 black|0.076007 gray|0.050938 grey|0.050938 dim|0.050484 gray|0.050484 dim|0.050484 grey|0.050484 sky|0.024995 blue|0.024995 tan|0.02157 dark|0.019529 slate|0.019529 gray|0.019529 wheat|0.01837 silver|0.016677 antique|0.01403 white|0.01403 blanched|0.012517 almond|0.012517 light|0.011653 blue|0.011653 light|0.011256 steel|0.011256 blue|0.011256 beige|0.0095659 papaya|0.0094326 whip|0.0094326 bisque|0.0072514  "
		}
	}
}
