{
	"add": {
		"doc": {
			"id": "827c37850b2f2e76b08ff0c2c26da75de2b88e822a02dd7a416e90b7a38b74c1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/K-T_boundary.jpg/220px-K-T_boundary.jpg",
				"previous": "Within Earth's crust, iridium is found at highest concentrations in three types of geologic structure: igneous deposits (crustal intrusions from below), impact craters, and deposits reworked from one of the former structures. The largest known primary reserves are in the Bushveld igneous complex in South Africa,[42] though the large copper–nickel deposits near Norilsk in Russia, and the Sudbury Basin in Canada are also significant sources of iridium. Smaller reserves are found in the United States.[42] Iridium is also found in secondary deposits, combined with platinum and other platinum group metals in alluvial deposits. The alluvial deposits used by pre-Columbian people in the Chocó Department of Colombia are still a source for platinum-group metals. As of 2003, the world reserves had not been estimated.[11]",
				"after": "The Cretaceous–Paleogene boundary of 66 million years ago, marking the temporal border between the Cretaceous and Paleogene periods of geological time, was identified by a thin stratum of iridium-rich clay.[43] A team led by Luis Alvarez proposed in 1980 an extraterrestrial origin for this iridium, attributing it to an asteroid or comet impact.[43] Their theory, known as the Alvarez hypothesis, is now widely accepted to explain the demise of the dinosaurs. A large buried impact crater structure with an estimated age of about 66 million years was later identified under what is now the Yucatán Peninsula (the Chicxulub crater).[44][45] Dewey M. McLean and others argue that the iridium may have been of volcanic origin instead, because Earth's core is rich in iridium, and active volcanoes such as Piton de la Fournaise, in the island of Réunion, are still releasing iridium.[46][47]",
			"color": "gray|0.30774 grey|0.30774 pale|0.15225 golden|0.15225 rod|0.15225 dim|0.097824 gray|0.097824 dim|0.097824 grey|0.097824 dark|0.079532 gray|0.079532 dark|0.079532 grey|0.079532 beige|0.057832 wheat|0.044001 slate|0.026238 gray|0.026238 light|0.02603 golden|0.02603 rod|0.02603 yellow|0.02603 lemon|0.025535 chiffon|0.025535 dark|0.020405 khaki|0.020405 corn|0.016869 silk|0.016869 light|0.015791 slate|0.015791 gray|0.015791 silver|0.015683 moccasin|0.015523 tan|0.015115 light|0.014319 yellow|0.014319 honeydew|0.0088337 light|0.0080484 gray|0.0080484 light|0.0080484 grey|0.0080484 antique|0.0080122 white|0.0080122 papaya|0.0063138 whip|0.0063138 old|0.0060241 lace|0.0060241 gainsboro|0.0057878 ivory|0.0047487  "
		}
	}
}
