{
	"add": {
		"doc": {
			"id": "8284cf67a6cf6390a3fd389a61192ba743f8b533ce621ab56754bf32eb99496b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/F-15A_first_prototype_2.jpg/220px-F-15A_first_prototype_2.jpg",
				"previous": "Four companies submitted proposals, with the Air Force eliminating General Dynamics and awarding contracts to Fairchild Republic, North American Rockwell, and McDonnell Douglas for the definition phase in December 1968. The companies submitted technical proposals by June 1969. The Air Force announced the selection of McDonnell Douglas on 23 December 1969.[25] The winning design resembled the twin-tailed F-14, but with fixed wings; both designs were based on configurations studied in wind tunnel testing by NASA.[26]",
				"after": "The Eagle's initial versions were the F-15 single-seat variant and TF-15 twin-seat variant. (After the F-15C was first flown the designations were changed to \"F-15A\" and \"F-15B\"). These versions would be powered by new Pratt & Whitney F100 engines to achieve a combat thrust-to-weight ratio in excess of 1:1. A proposed 25 mm Ford-Philco GAU-7 cannon with caseless ammunition suffered development problems. It was dropped in favor of the standard M61 Vulcan gun. The F-15 used conformal carriage of four Sparrow missiles like the Phantom. The fixed wing was put onto a flat, wide fuselage that also provided an effective lifting surface. The first F-15A flight was made on 27 July 1972 with the first flight of the two-seat F-15B following in July 1973.[27]",
			"color": "tan|0.27872 silver|0.20277 dark|0.18979 gray|0.18979 dark|0.18979 grey|0.18979 light|0.070082 gray|0.070082 light|0.070082 grey|0.070082 wheat|0.02986 black|0.028366 dim|0.026305 gray|0.026305 dim|0.026305 grey|0.026305 gainsboro|0.02383 peach|0.018249 puff|0.018249 gray|0.017761 grey|0.017761 orange|0.012171 red|0.012171 bisque|0.0088584 slate|0.0074269 gray|0.0074269 tomato|0.0072283 light|0.0065933 blue|0.0065933 light|0.0062938 slate|0.0062938 gray|0.0062938 antique|0.006272 white|0.006272 dark|0.0061733 slate|0.0061733 gray|0.0061733 firebrick|0.0053658  "
		}
	}
}
