{
	"add": {
		"doc": {
			"id": "8289e93240b913e152353a606ffdfb6a9d2633d2d52bf5258e5c9e0fec9da096",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/VHYFC.JPG/220px-VHYFC.JPG",
				"previous": "Virgin Blue previously used a familiar formula pioneered by airlines such as Southwest Airlines and Ryanair eliminating costs such as included in-flight meals and printed tickets in favour of selling food on-board and using telephone and internet booking systems. It also cut costs in the past by limiting the number of airports serviced and by operating one type of aircraft, the Boeing 737. This strategy changed with the introduction of a second type into the fleet. The airline ordered 20 Embraer E-jets, in a mix of six E170s and 14 E190s.[9] These were ordered specifically so that the airline could re-enter the Sydney–Canberra market that it abandoned in 2004, and to fly to less populous areas.[9][10] The first E-170 arrived in Australia in September 2007 and by the end of the year the three on initial order had been delivered. These were placed on limited-frequency services before full-scale operations were launched on 4 February 2008 with services from Sydney to Canberra (branded as 'Capital Jet' services),[9] Mackay in Queensland, and the New South Wales regional centres of Port Macquarie and Albury, which were promoted with a one-cent fare.[11][12] The flights to Canberra and the regional centres signified an effort to compete more directly with Qantas and its subsidiary QantasLink operation, which flies to all three cities, and with independent Regional Express Airlines.[9]",
				"after": "At its inception in 2000, Virgin Blue did not have interline or marketing alliances with other airlines. However, after the collapse of its domestic competitor Ansett Australia, it began a codeshare agreement with United Airlines. This allowed United customers to fly from the United States to any of Virgin Blue's Australian destinations that United did not already serve. In 2006, in an effort to compete with Qantas, Virgin Blue started exploring these relationships, forming frequent flyer agreements with Emirates Airline, Hawaiian Airlines and Malaysia Airlines. Virgin Blue also has an Interline Agreement with Regional Express Airlines for travellers to and from smaller regional centres in the eastern states of Australia, and operates its own two routes with Virgin Australia Regional Airlines in Western Australia. In November 2007, the airline announced an agreement with Garuda Indonesia, offering easy transfer from a domestic Virgin Blue flight to an international Garuda service departing from Perth, Melbourne, Sydney or Darwin. Since then Virgin Blue has also announced an agreement with Vietnam Airlines which allows passengers to fly from Melbourne and Sydney and connect with Vietnam Airlines's destinations through its flight network.[13]",
			"color": "black|0.17979 misty|0.06591 rose|0.06591 linen|0.058017 sea|0.050953 shell|0.050953 dim|0.044181 gray|0.044181 dim|0.044181 grey|0.044181 floral|0.04292 white|0.04292 old|0.042656 lace|0.042656 lavender|0.039503 blush|0.039503 white|0.039206 smoke|0.039206 antique|0.038314 white|0.038314 snow|0.038206 gray|0.033699 grey|0.033699 dark|0.032326 gray|0.032326 dark|0.032326 grey|0.032326 silver|0.03061 light|0.030263 gray|0.030263 light|0.030263 grey|0.030263 gainsboro|0.029078 white|0.023853 ivory|0.020889 firebrick|0.015932 ghost|0.014899 white|0.014899 mint|0.013248 cream|0.013248 papaya|0.011583 whip|0.011583 brown|0.010887  "
		}
	}
}
