{
	"add": {
		"doc": {
			"id": "828bc498716d09e92ad5cdca95764a351596278fc70aed571494140a67ee8191",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Mukpie-Karluk-survivor.jpeg/170px-Mukpie-Karluk-survivor.jpeg",
				"previous": "Bartlett, celebrated as a hero by press and public, was honoured for \"outstanding bravery\" by the Royal Geographical Society. However, he was later censured by an admiralty commission for taking Karluk into the ice, and for allowing Mackay's party to leave the main group—despite the letter that Mackay and the others had signed, absolving the captain from responsibility.[5][95] Stefansson, too, was privately critical of Bartlett's conduct.[114] Bartlett resumed his career at sea, and over the next 30 years led many more excursions to the Arctic.[95] During the Second World War he carried out surveying and supply work for the Allies; he died, aged 70, in April 1946.[115] His account of the Karluk disaster, published in 1916, makes no direct criticism of Stefansson or anyone else; Niven records, however, that to his friends Bartlett was highly uncomplimentary about his former leader.[95]",
				"after": "In 1918 Stefansson returned after four years' absence, reporting the discovery of three new islands. He was honoured by the National Geographical Society, received tributes from polar veterans such as Peary and Adolphus Greely,[116] and was given the presidency of the Explorers Club of New York.[117] In Canada his reception was more muted; there were questions relating to the overall costs of the expedition,[95] its poor initial organisation, and his handling of the Southern Party which, under Rudolph Anderson, completed its work independently of Stefansson.[118] Anderson and other members of the Southern Party later petitioned the Canadian government to investigate statements made by Stefansson in his 1921 book The Friendly Arctic, which they felt reflected poorly on their honour. The request was declined on the ground that \"no good could come of the enquiry.\"[95] In his book Stefansson takes responsibility for the \"bold\" decision to take Karluk into the ice rather than hugging the coast on the way to Herschel Island, and accepts that he \"chose the wrong alternative\".[119] However, McKinlay felt that the book gave an inaccurate account of the Karluk voyage and its consequences, \"putting the blame ... on everyone but Vilhjalmur Stefansson.\"[116] Historian Tom Henighan believes that McKinlay's biggest complaint against his leader was that \"Stefansson never at any time seemed able to express an appropriate sorrow over his lost men.\"[120] Stefansson, who never returned to the Arctic, died in 1962 at the age of 82.[121]",
			"color": " "
		}
	}
}
