{
	"add": {
		"doc": {
			"id": "829ddc98f2ed03eb5682ac3eaeafed1af5010ab2235e261117bacf916dbd2797",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Mao-DX-schematic-2.svg/220px-Mao-DX-schematic-2.svg.png",
			"previous": [],
				"after": "Nanotechnology is often defined as the study of materials and devices with features on a scale below 100 nanometers. DNA nanotechnology, specifically, is an example of bottom-up molecular self-assembly, in which molecular components spontaneously organize into stable structures; the particular form of these structures is induced by the physical and chemical properties of the components selected by the designers.[4] In DNA nanotechnology, the component materials are strands of nucleic acids such as DNA; these strands are often synthetic and are almost always used outside the context of a living cell. DNA is well-suited to nanoscale construction because the binding between two nucleic acid strands depends on simple base pairing rules which are well understood, and form the specific nanoscale structure of the nucleic acid double helix. These qualities make the assembly of nucleic acid structures easy to control through nucleic acid design. This property is absent in other materials used in nanotechnology, including proteins, for which protein design is very difficult, and nanoparticles, which lack the capability for specific assembly on their own.[5]",
			"color": "black|0.12855 blue|0.072528 dark|0.055139 gray|0.055139 dark|0.055139 grey|0.055139 white|0.052821 smoke|0.052821 snow|0.05157 white|0.050303 ghost|0.049991 white|0.049991 sea|0.047202 shell|0.047202 mint|0.046924 cream|0.046924 alice|0.046555 blue|0.046555 gray|0.045257 grey|0.045257 floral|0.043733 white|0.043733 azure|0.041946 lavender|0.037943 blush|0.037943 silver|0.036273 dim|0.034644 gray|0.034644 dim|0.034644 grey|0.034644 light|0.029877 gray|0.029877 light|0.029877 grey|0.029877 gainsboro|0.026405 lavender|0.015731 ivory|0.015656 light|0.011104 coral|0.011104 misty|0.01072 rose|0.01072 linen|0.0093385 pink|0.0088461 violet|0.0081461 light|0.0077928 pink|0.0077928 medium|0.0053063 slate|0.0053063 blue|0.0053063  "
		}
	}
}
