{
	"add": {
		"doc": {
			"id": "82b7b2dceb16f016dbd615af47b654600c36cf3ecbcebb844819307ab7bf8c4b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Borders_of_Macedonia_according_authors_%281843-1927%29.png/340px-Borders_of_Macedonia_according_authors_%281843-1927%29.png",
				"previous": "Macedonia (as a current geographical term) refers to a region of the Balkan peninsula in south-eastern Europe, covering some 60,000 or 70,000 square kilometers. Although the region's borders are not officially defined by any international organization or state, in some contexts, the territory appears to correspond to the basins of (from west to east) the Haliacmon (Aliákmonas), Vardar / Axios and Struma / Strymónas rivers, and the plains around Thessaloniki and Serres.[20]",
				"after": "In a historic context, the term Macedonia was used in various ways. Macedonia was not an administrative division of the Ottoman Empire; its entire territory was part of the beylerbeylik of Rumelia.[21] The geographer H.R. Wilkinson suggests that the region \"defies definition\" but that many mappers agree \"on its general location\".[5] Macedonia was well enough defined in 1897 for Gladstone to propose \"Macedonia for the Macedonians\"; philhellenes argued that the phrase could not be used by a man of impartiallity, while Turcophiles asserted that there are six different kinds of Macedonians, and only Turkish rule could prevail total anarchy in the region.[22] The Balkan nations began to proclaim their rights to it after the Treaty of San Stefano in 1878 and its revision at the Congress of Berlin.[23]",
			"color": "light|0.29605 sky|0.29605 blue|0.29605 light|0.1105 steel|0.1105 blue|0.1105 dark|0.08664 sea|0.08664 green|0.08664 lavender|0.051781 light|0.045946 coral|0.045946 salmon|0.02989 alice|0.025675 blue|0.025675 white|0.025391 smoke|0.025391 ghost|0.024437 white|0.024437 snow|0.022757 white|0.022194 mint|0.021696 cream|0.021696 lavender|0.021587 blush|0.021587 sea|0.021035 shell|0.021035 linen|0.018049 floral|0.015784 white|0.015784  "
		}
	}
}
