{
	"add": {
		"doc": {
			"id": "82d85ef51a1634b4506023e4d680466cada990b16f1d092b8599074371fcf695",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Thamnophis_sirtalis_sirtalis_Wooster.jpg/220px-Thamnophis_sirtalis_sirtalis_Wooster.jpg",
				"previous": "An area of current investigation in evolutionary developmental biology is the developmental basis of adaptations and exaptations.[206] This research addresses the origin and evolution of embryonic development and how modifications of development and developmental processes produce novel features.[207] These studies have shown that evolution can alter development to produce new structures, such as embryonic bone structures that develop into the jaw in other animals instead forming part of the middle ear in mammals.[208] It is also possible for structures that have been lost in evolution to reappear due to changes in developmental genes, such as a mutation in chickens causing embryos to grow teeth similar to those of crocodiles.[209] It is now becoming clear that most alterations in the form of organisms are due to changes in a small set of conserved genes.[210]",
				"after": "Interactions between organisms can produce both conflict and cooperation. When the interaction is between pairs of species, such as a pathogen and a host, or a predator and its prey, these species can develop matched sets of adaptations. Here, the evolution of one species causes adaptations in a second species. These changes in the second species then, in turn, cause new adaptations in the first species. This cycle of selection and response is called coevolution.[211] An example is the production of tetrodotoxin in the rough-skinned newt and the evolution of tetrodotoxin resistance in its predator, the common garter snake. In this predator-prey pair, an evolutionary arms race has produced high levels of toxin in the newt and correspondingly high levels of toxin resistance in the snake.[212]",
			"color": "burly|0.14775 wood|0.14775 tan|0.12674 pale|0.087176 golden|0.087176 rod|0.087176 black|0.070741 wheat|0.065334 navajo|0.058278 white|0.058278 moccasin|0.052612 dark|0.047119 khaki|0.047119 lemon|0.040828 chiffon|0.040828 khaki|0.039683 light|0.032623 golden|0.032623 rod|0.032623 yellow|0.032623 blanched|0.024813 almond|0.024813 bisque|0.02322 corn|0.020714 silk|0.020714 papaya|0.019791 whip|0.019791 light|0.018672 yellow|0.018672 beige|0.017383 peach|0.015992 puff|0.015992 antique|0.013298 white|0.013298  "
		}
	}
}
