{
	"add": {
		"doc": {
			"id": "82f047cfa95f2f034e11e8dc34969d2469bb924efd94e7d04cdbf6013fd63172",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Marble_Hall_Holkham_Hall.jpg/220px-Marble_Hall_Holkham_Hall.jpg",
				"previous": "The one storey porch at the main north entrance was designed in the 1850s by Samuel Sanders Teulon, although stylistically it is indistinguishable from the 18th century building.",
				"after": "Inside the house, the Palladian form reaches a height and grandeur seldom seen in any other house in England. It has, in fact, been described as \"The finest Palladian interior in England.\"[20] The grandeur of the interior is obtained with an absence of excessive ornament, and reflects Kent's career-long taste for \"the eloquence of a plain surface\".[21] Work on the interiors ran from 1739 to 1773. The first habitable rooms were in the family wing and were in use from 1740, the Long Library being the first major interior completed in 1741. Among the last to be completed and entirely under Lady Leicester's supervision is the Chapel with its alabaster reredos. The house is entered through the \"Marble\" Hall (the chief building fabric is in fact Derbyshire alabaster), modelled by Kent on a Roman basilica. The room is over 50 feet (15 m) from floor to ceiling and is dominated by the broad white marble flight of steps leading to the surrounding gallery, or peristyle: here alabaster Ionic columns support the coffered, gilded ceiling, copied from a design by Inigo Jones, inspired by the Pantheon in Rome. The fluted columns are thought to be replicas of those in the Temple of Fortuna Virilis, also in Rome. Around the hall are statues in niches; these are predominantly plaster copies of classical deities.",
			"color": "gray|0.27439 grey|0.27439 dim|0.24424 gray|0.24424 dim|0.24424 grey|0.24424 dark|0.17123 gray|0.17123 dark|0.17123 grey|0.17123 silver|0.070959 black|0.039117 light|0.027391 gray|0.027391 light|0.027391 grey|0.027391 tan|0.026955 antique|0.016644 white|0.016644  "
		}
	}
}
