{
	"add": {
		"doc": {
			"id": "82f701898e6454a261a9d34861ee8af6de0730899658f33d8d694a349ecb7682",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/MotarFragmentFromParthenon-BritishMuseum-August21-08.jpg/170px-MotarFragmentFromParthenon-BritishMuseum-August21-08.jpg",
			"previous": [],
				"after": "In 1687, the Parthenon was extensively damaged in the greatest catastrophe to befall it in its long history.[59] The Venetians sent an expedition led by Francesco Morosini to attack Athens and capture the Acropolis. The Ottoman Turks fortified the Acropolis and used the Parthenon as a gunpowder magazine – despite having been forewarned of the dangers of this use by the 1656 explosion that severely damaged the Propylaea – and as a shelter for members of the local Turkish community.[80] On 26 September a Venetian mortar round, fired from the Hill of Philopappus, blew up the magazine, and the building was partly destroyed.[81] The explosion blew out the building's central portion and caused the cella's walls to crumble into rubble.[76] Greek architect and archaeologist Kornilia Chatziaslani writes that \"...three of the sanctuary’s four walls nearly collapsed and three-fifths of the sculptures from the frieze fell. Nothing of the roof apparently remained in place. Six columns from the south side fell, eight from the north, as well as whatever remained from eastern porch, except for one column. The columns brought down with them the enormous marble architraves, triglyphs and metopes.\"[58] About three hundred people were killed in the explosion, which showered marble fragments over nearby Turkish defenders[80] and caused large fires that burned until the following day and consumed many homes.[58]",
			"color": "burly|0.15304 wood|0.15304 navajo|0.11385 white|0.11385 pale|0.10422 golden|0.10422 rod|0.10422 moccasin|0.088615 wheat|0.074666 lemon|0.072987 chiffon|0.072987 black|0.070423 light|0.051361 golden|0.051361 rod|0.051361 yellow|0.051361 peach|0.038663 puff|0.038663 sienna|0.033467 tan|0.025289 light|0.023172 yellow|0.023172 bisque|0.018155 dark|0.016368 slate|0.016368 blue|0.016368 corn|0.015934 silk|0.015934 saddle|0.013545 brown|0.013545 peru|0.011864 beige|0.011763 khaki|0.011039 blanched|0.0092627 almond|0.0092627  "
		}
	}
}
