{
	"add": {
		"doc": {
			"id": "82fe54f2b8e35e885a242c3a02087c013ee71b38bf1e6499f7b7f4e64347d315",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Tiree%2C_Balephuil_Bay.jpg/220px-Tiree%2C_Balephuil_Bay.jpg",
				"previous": "The Southern Uplands are a range of hills almost 200 kilometres (124 mi) long, interspersed with broad valleys. They lie south of a second fault line (the Southern Uplands fault) that runs from Girvan to Dunbar.[152][153][154] The geological foundations largely comprise Silurian deposits laid down some 4–500 million years ago. The high point of the Southern Uplands is Merrick with an elevation of 843 m (2,766 ft).[20][155][156][157] The Southern Uplands is home to the UK's highest village, Wanlockhead (430 m or 1,411 ft above sea level).[154]",
				"after": "The climate of Scotland is temperate and oceanic, and tends to be very changeable. As it is warmed by the Gulf Stream from the Atlantic, it has much milder winters (but cooler, wetter summers) than areas on similar latitudes, such as Labrador, southern Scandinavia, the Moscow region in Russia, and the Kamchatka Peninsula on the opposite side of Eurasia. However, temperatures are generally lower than in the rest of the UK, with the coldest ever UK temperature of −27.2 °C (−17.0 °F) recorded at Braemar in the Grampian Mountains, on 11 February 1895.[158] Winter maxima average 6 °C (42.8 °F) in the Lowlands, with summer maxima averaging 18 °C (64.4 °F). The highest temperature recorded was 32.9 °C (91.2 °F) at Greycrook, Scottish Borders on 9 August 2003.[159]",
			"color": "dark|0.32864 olive|0.32864 green|0.32864 olive|0.23705 slate|0.076456 gray|0.076456 light|0.063971 slate|0.063971 gray|0.063971 silver|0.054686 dark|0.051578 gray|0.051578 dark|0.051578 grey|0.051578 dim|0.046275 gray|0.046275 dim|0.046275 grey|0.046275 light|0.039986 gray|0.039986 light|0.039986 grey|0.039986 gainsboro|0.028594 gray|0.024872 grey|0.024872 dark|0.016801 slate|0.016801 gray|0.016801  "
		}
	}
}
