{
	"add": {
		"doc": {
			"id": "83202529c1590e4a0471544c26080b5001dae1206b21613205ffe79a8daf2e78",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Bath_rec.jpg/220px-Bath_rec.jpg",
			"previous": [],
				"after": "Bath Rugby is a rugby union team in the Aviva Premiership league. It plays in black, blue and white kit at the Recreation Ground in the city, where it has been since the late 19th century, following its establishment in 1865.[155] The team's first major honour was winning the John Player Cup, now sponsored as the LV Cup and also known as the Anglo-Welsh Cup, four years consecutively from 1984 until 1987.[155] The team then led the Courage league in six seasons in eight years between 1988–89 and 1995–96, during which time it also won the renamed Pilkington Cup in 1989, 1990, 1992, 1994, 1995 and 1996.[155] It finally won the Heineken Cup in the 1997–98 season, and topped the Zürich Premiership (now Aviva Premiership) in 2003–04.[155] The team's squad includes several members who also play, or have played in the English national team including: Lee Mears, Rob Webber, Dave Attwood, Nick Abendanon and Matt Banahan. Colston's School, Bristol has had a large input in the team over the past decade, providing several current 1st XV squad members. The former England Rugby Team Manager and former Scotland national coach Andy Robinson used to play for Bath Rugby team and was captain and later coach. Both of Robinson's predecessors, Clive Woodward and Jack Rowell, were also former Bath coaches and managers as well as his successor Brian Ashton.[156]",
			"color": "gray|0.33348 grey|0.33348 dim|0.29008 gray|0.29008 dim|0.29008 grey|0.29008 dark|0.11775 gray|0.11775 dark|0.11775 grey|0.11775 slate|0.049384 gray|0.049384 dark|0.046827 slate|0.046827 gray|0.046827 silver|0.031086 light|0.030007 slate|0.030007 gray|0.030007 black|0.024322 light|0.015244 gray|0.015244 light|0.015244 grey|0.015244 light|0.010386 steel|0.010386 blue|0.010386 olive|0.0093856 drab|0.0093856 gainsboro|0.0093393  "
		}
	}
}
