{
	"add": {
		"doc": {
			"id": "833a7d794b5ea24ecc28ca5006cddd96b7b67f7dd39a5d4e1636572f9888e0cf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Percheron_cluny102.jpg/220px-Percheron_cluny102.jpg",
				"previous": "By the 1930s, Percherons accounted for over 70 percent of the purebred draft horses in the United States, and all of the major land grant universities maintained stables of Percherons.[11] A 1930 census of horses found over 33,000 Percherons in the United States, with the next most popular breed, the Belgian, having a population of less than 10,000. One Percheron historian attributes this popularity to the breed's \"strength, energy, activity, robustness and endurance\".[24] After World War II, increasing mechanization prompted a decline in the Percheron population.[10] In 1954, only 85 Percherons were registered in the US, a record low.[11] The 1950s, 1960s and early 1970s were bad years for the US Percheron population, and breeding was reduced to only a few farms. These breeders kept the American population alive through these years, however, and the 1980s saw renewed interest in the breed.[25]",
				"after": "In 1966, the French stud book was changed to include draft types from other areas of France that were closely related to the Percheron – including horses from Berrichon, Nivernais, Marne, Augeron, Bourbonnais, Loire and Saône-et-Loire.[7] French Percherons were also hit hard by the advent of mechanization, and between 1970 and 1990 focus was placed on breeding horses of greater mass for the meat market. The largest and heaviest stallions were selected for breeding.[26][27] Beginning at the 1989 World Percheron Congress, French breeders realized that they needed a lighter breed for tourism, export to Japan for draft work, and other markets.[26][28] In 1993, a trend of importing American stallions to France was started with the gray stallion Silver Shadows Sheik. This stallion and others were used to create a more elegant, smaller and sleeker look in the French Percheron, while still retaining the traditional bone and foot structure. All other imported stallions were black, reviving the popularity of black Percherons in France.[26] French breeders continue to import American-bred Percheron stallions in order to produce lighter foals, moving away from the heavier meat-type horses of the late 20th century.[29] Also in 1993, the Société Hippique Percheronne anticipated the increasing tourist and exportation markets by prohibiting docking, which was not prohibited for other draft breeds until 1996.[30] This was partly at the request of the Germans,[31] and partly due to the influence of magazines such as Cheval.[32]",
			"color": "silver|0.30734 dark|0.23826 gray|0.23826 dark|0.23826 grey|0.23826 light|0.20865 gray|0.20865 light|0.20865 grey|0.20865 gainsboro|0.12364 gray|0.04965 grey|0.04965 dim|0.010715 gray|0.010715 dim|0.010715 grey|0.010715 white|0.0067353 smoke|0.0067353 tan|0.0057623 lavender|0.0051729 blush|0.0051729 lavender|0.0045416 ghost|0.004391 white|0.004391 alice|0.0043298 blue|0.0043298 snow|0.0035845 rosy|0.0035204 brown|0.0035204  "
		}
	}
}
