{
	"add": {
		"doc": {
			"id": "8342abb3099a5b69d96a9e210988b5b1521177e929026364320c4fa9826ce0fc",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/7/73/Poverty_map_old_nichol_1889.jpg/300px-Poverty_map_old_nichol_1889.jpg",
				"previous": "During the Middle Ages, settlements had been established predominantly along the lines of the existing roads, and the principal villages were Stepney, Whitechapel and Bow. Settlements along the river began at this time to service the needs of shipping on the Thames, but the City of London retained its right to actually land the goods. The riverside became more active in Tudor times, as the Royal Navy was expanded and international trading developed. Downstream, a major fishing port developed at Barking to provide fish to the City.",
				"after": "Whereas royalty such as King John had had a hunting lodge at Bromley-by-Bow, and the Bishop of London had a palace at Bethnal Green, later these estates began to be split up, and estates of fine houses for captains, merchants and owners of manufacturers began to be built. Samuel Pepys moved his family and goods to Bethnal Green during the Great Fire of London, and Captain Cook moved from Shadwell to Stepney Green, a place where a school and assembly rooms had been established (commemorated by Assembly Passage, and a plaque on the site of Cook's house on the Mile End Road). Mile End Old Town also acquired some fine buildings, and the New Town began to be built. As the area became built up and more crowded, the wealthy sold their plots for sub-division and moved further afield. Into the 18th and 19th centuries, there were still attempts to build fine houses, for example Tredegar Square (1830), and the open fields around Mile End New Town were used for the construction of estates of workers' cottages in 1820. This was designed in 1817 in Birmingham by Anthony Hughes and finally constructed in 1820 [63]",
			"color": "black|0.19394 tan|0.14053 dim|0.072014 gray|0.072014 dim|0.072014 grey|0.072014 peach|0.054532 puff|0.054532 gray|0.049441 grey|0.049441 wheat|0.045215 bisque|0.043886 dark|0.040376 gray|0.040376 dark|0.040376 grey|0.040376 blanched|0.032399 almond|0.032399 antique|0.026693 white|0.026693 papaya|0.025037 whip|0.025037 silver|0.024251 navajo|0.023004 white|0.023004 moccasin|0.022451 burly|0.018161 wood|0.018161 maroon|0.015959 corn|0.015402 silk|0.015402 beige|0.013808 light|0.012387 gray|0.012387 light|0.012387 grey|0.012387 old|0.0099925 lace|0.0099925 dark|0.0091716 red|0.0091716 light|0.0085724 yellow|0.0085724 linen|0.0080823 gainsboro|0.0079722 rosy|0.007593 brown|0.007593 light|0.00747 golden|0.00747 rod|0.00747 yellow|0.00747 brown|0.0072866  "
		}
	}
}
