{
	"add": {
		"doc": {
			"id": "83529848f31cc65dcdfd6506246570437afca435e273f96d97a6dd4d2f6913e6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Victoria.memorial.london.arp.jpg/220px-Victoria.memorial.london.arp.jpg",
				"previous": "A book published in 1999 by the Royal Collection Department reported that the palace contained 19 state rooms, 52 principal bedrooms, 188 staff bedrooms, 92 offices, and 78 bathrooms.[71] This is actually small in comparison to the Russian imperial palaces in Saint Petersburg and at Tsarskoe Selo, the Papal Palace in Rome, the Royal Palace of Madrid, the Stockholm Palace, or indeed the former Palace of Whitehall, and tiny compared to the Forbidden City and Potala Palace. A minor change was made in 1938, in which the north-west pavilion, designed by Nash as a conservatory and altered in 1911–13 to a racquets court, was converted into a swimming pool.",
				"after": "During World War I the palace, then the home of King George V and Queen Mary, escaped unscathed. Its more valuable contents were evacuated to Windsor but the royal family remained in situ. The King imposed rationing at the palace, much to the dismay of his guests and household.[72] To the King's later regret, David Lloyd George persuaded him to go further by ostentatiously locking the wine cellars and refraining from alcohol, to set a good example to the supposedly inebriated working class. The workers continued to imbibe and the King was left unhappy at his enforced abstinence.[73]",
			"color": "dark|0.12643 gray|0.12643 dark|0.12643 grey|0.12643 silver|0.12084 light|0.11757 gray|0.11757 light|0.11757 grey|0.11757 gray|0.11299 grey|0.11299 dim|0.10811 gray|0.10811 dim|0.10811 grey|0.10811 gainsboro|0.097098 slate|0.037167 gray|0.037167 black|0.036412 white|0.030264 smoke|0.030264 light|0.027618 slate|0.027618 gray|0.027618 alice|0.019379 blue|0.019379 ghost|0.019216 white|0.019216 snow|0.017227 lavender|0.016715 blush|0.016715 sea|0.0161 shell|0.0161 white|0.013481 linen|0.012961 lavender|0.011234 mint|0.010914 cream|0.010914 floral|0.010265 white|0.010265 azure|0.0089086  "
		}
	}
}
