{
	"add": {
		"doc": {
			"id": "8362fbcfa2eea209af5e4a3342cc96b8ab690651fd1ab84e7fb772dcd859a03d",
			"url": "https://upload.wikimedia.org/math/4/5/3/453be8ca35a4dbc1d06873eb83354462.png",
				"previous": "Suppose that a Brownian particle of mass M is surrounded by lighter particles of mass m which are traveling at a speed u. Then, reasons Smoluchowski, in any collision between a surrounding and Brownian particles, the velocity transmitted to the latter will be mu/M. This ratio is of the order of 10−7 cm/s. But we also have to take into consideration that in a gas there will be more than 1016 collisions in a second, and even greater in a liquid where we expect that there will be 1020 collision in one second. Some of these collisions will tend to accelerate the Brownian particle; others will tend to decelerate it. If there is a mean excess of one kind of collision or the other to be of the order of 108 to 1010 collisions in one second, then velocity of the Brownian particle may be anywhere between 10 to 1000 cm/s. Thus, even though there are equal probabilities for forward and backward collisions there will be a net tendency to keep the Brownian particle in motion, just as the ballot theorem predicts.",
				"after": "In 1906 Smoluchowski published a one-dimensional model to describe a particle undergoing Brownian motion.[19] The model assumes collisions with M ≫ m where M is the test particle's mass and m the mass of one of the individual particles composing the fluid. It is assumed that the particle collisions are confined to one dimension and that it is equally probable for the test particle to be hit from the left as from the right. It is also assumed that every collision always imparts the same magnitude of ΔV. If NR is the number of collisions from the right and NL the number of collisions from the left then after N collisions the particle's velocity will have changed by ΔV(2NR−N). The multiplicity is then simply given by:",
			"color": "gray|0.31419 grey|0.31419 dark|0.27864 gray|0.27864 dark|0.27864 grey|0.27864 dim|0.15122 gray|0.15122 dim|0.15122 grey|0.15122 silver|0.12143 light|0.058615 gray|0.058615 light|0.058615 grey|0.058615 gainsboro|0.040657 white|0.0084472 smoke|0.0084472 linen|0.0043634 lavender|0.0038606 blush|0.0038606 alice|0.0036917 blue|0.0036917 ghost|0.0035766 white|0.0035766 sea|0.003445 shell|0.003445 snow|0.0032915  "
		}
	}
}
