{
	"add": {
		"doc": {
			"id": "8388f96cb9e2219afd12253ea10ebbd7a7898599a3ff87f398610d0eb1178d63",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Puerto_Rican_parrot_chick.jpg/220px-Puerto_Rican_parrot_chick.jpg",
				"previous": "The Puerto Rican amazon is a secondary cavity nester, nesting in tree trunk cavities, both naturally occurring and excavated by other species. It prefers to nest in Palo colorado trees (Cyrilla racemiflora), but uses other trees, including the laurel sabino (Magnolia splendens) and tabonuco (Dacryodes excelsa), to a lesser extent. These trees are mature cavity-forming trees which provide protection against predators and the entry of water. Recently, the species has also nested in artificial wooden boxes designed as part of the recovery plan for the species. Nest height varies from 7–15 m (23–49 ft) above ground. The male usually leads the search for nest sites, although the final decision seems to be taken by the female.[36] Once a site is selected, the pair will spend some time inspecting and cleaning it. No lining material is added to the nest.",
				"after": "The Puerto Rican amazon reaches sexual maturity at 4 years of age in the wild and at 3 years in captivity. The species usually reproduces once a year between the months of January and July (the dry season). Copulation between pairs seems to be closely related to food transfers, with this possibly serving as a trigger for intercourse.[37] Amazons have a copulation pattern similar to that found in other parrots throughout the Americas, with the male gripping a perch with one leg while passively placing the other in the female's back.[38] As the time for egg-laying approaches the pair spends more time in the nest, with the male providing food to the female via regurgitation.[39] The female lays 2–4 eggs that she exclusively incubates for a period of 24 to 28 days, while the male will be present in the vicinity of the nest when providing food.[40] Females only leave the nest on rare occasions involving repelling predators or if the male has not brought food in an extended time frame.[41] The chicks are fed by both parents until they leave the nest, usually 60 to 65 days after they hatch.[2] Nonetheless, they remain dependent on their parents and travel with them until the next breeding season.[3]",
			"color": "tan|0.21112 black|0.17291 burly|0.15783 wood|0.15783 peach|0.091861 puff|0.091861 sienna|0.064383 wheat|0.053717 bisque|0.045636 navajo|0.035217 white|0.035217 moccasin|0.033293 rosy|0.028973 brown|0.028973 blanched|0.02308 almond|0.02308 dark|0.017357 salmon|0.017357 dark|0.012877 gray|0.012877 dark|0.012877 grey|0.012877 papaya|0.010755 whip|0.010755 antique|0.01064 white|0.01064 gray|0.0071021 grey|0.0071021 silver|0.0069693  "
		}
	}
}
