{
	"add": {
		"doc": {
			"id": "83b8876a5d633e25777f64bbe9f5879e7a91b1341241c21b9ea5fac437a3b1d4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Canyon_midday.jpg/220px-Canyon_midday.jpg",
				"previous": "During the 18th and early 19th centuries, many Americans and Spanish believed in the existence of the Buenaventura River, purported to run from the Rocky Mountains in Utah or Colorado to the Pacific Ocean.[146] The name Buenaventura was given to the Green River by Silvestre Vélez de Escalante as early as 1776, but Escalante did not know that the Green drained to the Colorado. Many later maps showed the headwaters of the Green and Colorado rivers connecting with the Sevier River (Rio San Ysabel) and Utah Lake (Lake Timpanogos) before flowing west through the Sierra Nevada into California. Mountain man Jedediah Smith reached the lower Colorado by way of the Virgin River canyon in 1826. Smith called the Colorado the \"Seedskeedee\", as the Green River in Wyoming was known to fur trappers, correctly believing it to be a continuation of the Green and not a separate river as others believed under the Buenaventura myth.[147] John C. Frémont's 1843 Great Basin expedition proved that no river traversed the Great Basin and Sierra Nevada, officially debunking the Buenaventura myth.[148]",
				"after": "In 1857, Lieutenant Joseph C. Ives led an expedition to explore the feasibility of using the Colorado River as a navigation route in the Southwest. Ives and his men used a specially built steamboat, the shallow-draft U.S.S. Explorer, and traveled up the river as far as Black Canyon on what is now the Arizona–Nevada border. After experiencing numerous groundings and accidents and having been inhibited by low water in the river, Ives declared: \"Ours has been the first, and will doubtless be the last, party of whites to visit this profitless locality. It seems intended by nature that the Colorado River, along the greater portion of its lonely and majestic way, shall be forever unvisited and undisturbed.\"[149][150]",
			"color": "rosy|0.51548 brown|0.51548 tan|0.13661 black|0.11436 dark|0.044833 olive|0.044833 green|0.044833 peach|0.031894 puff|0.031894 dim|0.020802 gray|0.020802 dim|0.020802 grey|0.020802  "
		}
	}
}
