{
	"add": {
		"doc": {
			"id": "83bde928489b3c273ecc5c3602117425176185c09fede2d84494905e4b852700",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Members_of_SEAL_Delivery_Vehicle_Team_Two_%28SDVT-2%29.jpg/220px-Members_of_SEAL_Delivery_Vehicle_Team_Two_%28SDVT-2%29.jpg",
				"previous": "The Navy needed to determine its role within the special operations arena. In March 1961, Arleigh Burke, Chief of Naval Operations, recommended the establishment of guerrilla and counter-guerrilla units. These units would be able to operate from sea, air or land. This was the beginning of the Navy SEALs. All SEALs came from the Navy's Underwater Demolition Teams, who had already gained extensive experience in commando warfare in Korea; however, the Underwater Demolition Teams were still necessary to the Navy's amphibious force.[20][21]",
				"after": "The first two teams were formed in January 1962[22] and stationed on both US coasts: Team One at Naval Amphibious Base Coronado, in San Diego, California and Team Two at Naval Amphibious Base Little Creek, in Virginia Beach, Virginia. Formed entirely with personnel from UDTs, the SEALs mission was to conduct counter guerilla warfare and clandestine operations in maritime and riverine environments.[7] Men of the newly formed SEAL Teams were trained in such unconventional areas as hand-to-hand combat, high-altitude parachuting, demolitions, and foreign languages. The SEALs attended Underwater Demolition Team replacement training and they spent some time training in UDTs. Upon making it to a SEAL team, they would undergo a SEAL Basic Indoctrination (SBI) training class at Camp Kerry in the Cuyamaca Mountains. After SBI training class, they would enter a platoon and conduct platoon training.",
			"color": "cadet|0.28743 blue|0.28743 black|0.18616 dark|0.17645 slate|0.17645 gray|0.17645 powder|0.13881 blue|0.13881 pale|0.12371 turquoise|0.12371 teal|0.033379 light|0.01791 blue|0.01791 dark|0.012085 cyan|0.012085 light|0.010868 cyan|0.010868  "
		}
	}
}
