{
	"add": {
		"doc": {
			"id": "83d42a8bead72b2a19ff15da76209ec9b133cf58107be031a3bf515c4c44c8df",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Hedley_Fitton09.jpg/220px-Hedley_Fitton09.jpg",
			"previous": [],
				"after": "The theatre was designed as a symmetrical pair with the Carlton Hotel and restaurant on the adjacent site, now occupied by New Zealand House.[51] The frontage formed three parts, each of nine bays. The hotel occupied two parts, the theatre one, and the two buildings were unified by a cornice above the ground floor. The buildings rose to four storeys, with attic floors above, surmounted by large squared domes in a style inspired by the French Renaissance. The theatre has a Corinthian colonnade at the first floor, rising to the second, forming a loggia in front of the circle foyer. This is above a canopy over the main ground floor entrances.[50] The theatre lies on an east–west axis. The stage at the western end was 49 feet (14.9 m) deep and 69.5 feet (21.2 m) wide,[5] and reputedly the first to be flat, rather than raked.[7] The interior was designed by the consulting architect, W. H. Romaine-Walker (1854–1940), after the Opera at Versailles by Gabriel. Stalls and the pit were entered at ground level, with two partly cantilevered tiers above accommodating dress and family circles on the first level, and upper circle, amphitheatre and gallery on the tier above. In all, there were 1,319 seats. Contemporary opinion was critical of the project. Edwin Sachs wrote in his 1897 guide to theatres, \"The treatment is considered to be in the French Renaissance style and stone has been used throughout. The detail cannot, however, be termed satisfactory, nor does the exterior architecturally express the purpose of the building.\"[52]",
			"color": "dark|0.10079 gray|0.10079 dark|0.10079 grey|0.10079 silver|0.078826 gray|0.074769 grey|0.074769 light|0.068116 gray|0.068116 light|0.068116 grey|0.068116 dim|0.06403 gray|0.06403 dim|0.06403 grey|0.06403 white|0.060353 smoke|0.060353 gainsboro|0.05908 sea|0.050508 shell|0.050508 snow|0.050195 black|0.049835 ghost|0.047575 white|0.047575 white|0.04712 mint|0.046856 cream|0.046856 floral|0.043304 white|0.043304 alice|0.042824 blue|0.042824 azure|0.040043 linen|0.027579 lavender|0.023089 blush|0.023089 ivory|0.018554 old|0.0062914 lace|0.0062914  "
		}
	}
}
