{
	"add": {
		"doc": {
			"id": "83e53ec94e44868099e712a73efc7e21fcdde08267e52e729744b527b7ba89e7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/U.S._Total_Deficits_vs._National_Debt_Increases_2001-2010.png/220px-U.S._Total_Deficits_vs._National_Debt_Increases_2001-2010.png",
				"previous": "In March, Obama's Treasury Secretary, Timothy Geithner, took further steps to manage the financial crisis, including introducing the Public-Private Investment Program for Legacy Assets, which contains provisions for buying up to two trillion dollars in depreciated real estate assets.[170] Obama intervened in the troubled automotive industry[171] in March 2009, renewing loans for General Motors and Chrysler to continue operations while reorganizing. Over the following months the White House set terms for both firms' bankruptcies, including the sale of Chrysler to Italian automaker Fiat[172] and a reorganization of GM giving the U.S. government a temporary 60 percent equity stake in the company, with the Canadian government taking a 12 percent stake.[173] In June 2009, dissatisfied with the pace of economic stimulus, Obama called on his cabinet to accelerate the investment.[174] He signed into law the Car Allowance Rebate System, known colloquially as \"Cash for Clunkers\", that temporarily boosted the economy.[175][176][177]",
				"after": "Spending and loan guarantees from the Federal Reserve and the Treasury Department authorized by the Bush and Obama administrations totaled about $11.5 trillion, but only $3 trillion was spent by the end of November 2009.[178] Obama and the Congressional Budget Office predicted the 2010 budget deficit would be $1.5 trillion or 10.6 percent of the nation's gross domestic product (GDP) compared to the 2009 deficit of $1.4 trillion or 9.9 percent of GDP.[179][180] For 2011, the administration predicted the deficit will slightly shrink to $1.34 trillion, while the 10-year deficit will increase to $8.53 trillion or 90 percent of GDP.[181] The most recent increase in the U.S. debt ceiling to $17.2 trillion took effect in February 2014.[182] On August 2, 2011, after a lengthy congressional debate over whether to raise the nation's debt limit, Obama signed the bipartisan Budget Control Act of 2011. The legislation enforces limits on discretionary spending until 2021, establishes a procedure to increase the debt limit, creates a Congressional Joint Select Committee on Deficit Reduction to propose further deficit reduction with a stated goal of achieving at least $1.5 trillion in budgetary savings over 10 years, and establishes automatic procedures for reducing spending by as much as $1.2 trillion if legislation originating with the new joint select committee does not achieve such savings.[183] By passing the legislation, Congress was able to prevent a U.S. government default on its obligations.[184]",
			"color": "silver|0.29207 dark|0.28033 gray|0.28033 dark|0.28033 grey|0.28033 light|0.2603 gray|0.2603 light|0.2603 grey|0.2603 red|0.060824 navy|0.029186 dark|0.017995 blue|0.017995 gainsboro|0.013305 rosy|0.0082069 brown|0.0082069 gray|0.0063535 grey|0.0063535 indian|0.0054979 red|0.0054979 dark|0.0053825 slate|0.0053825 blue|0.0053825 firebrick|0.0051693 midnight|0.0047785 blue|0.0047785 light|0.0037541 slate|0.0037541 gray|0.0037541 slate|0.0032182 gray|0.0032182  "
		}
	}
}
