{
	"add": {
		"doc": {
			"id": "83ebf2c5029c4cd3d72f403756c3430a9f35058cfd061df96e102c86900d3992",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Bamboo_pith_mushroom.jpg/220px-Bamboo_pith_mushroom.jpg",
				"previous": "Like all Phallus species, P. indusiatus is saprobic—deriving nutrients from breaking down wood and plant organic matter. The fruit bodies grow singly or in groups in disturbed ground and among wood chips. In Asia, it grows among bamboo forests, and typically fruits after heavy rains.[22][42] The method of reproduction for stinkhorns, including P. indusiatus, is different from most agaric mushrooms, which forcibly eject their spores. Stinkhorns instead produce a sticky spore mass that has a sharp, sickly-sweet odor of carrion.[43] The cloying stink of mature fruit bodies—detectable from a considerable distance—is attractive to certain insects.[22] Species recorded visiting the fungus include stingless bees of the genus Trigona,[44] and flies of the families Drosophilidae and Muscidae. Insects assist in spore dispersal by consuming the gleba and depositing excrement containing intact spores to germinate elsewhere.[22] Although the function of the indusium is not known definitively, it may visually entice insects not otherwise attracted by the odour, and serve as a ladder for crawling insects to reach the gleba.[45]",
				"after": "In eastern Asia, P. indusiatus is considered a delicacy and an aphrodisiac.[46] Previously only collected in the wild, where it is not abundant, it was difficult to procure. The mushroom's scarcity meant that it was usually reserved for special occasions. In the time of China's Qing Dynasty, the species was collected in Yunnan Province and sent to the Imperial Palaces to satisfy the appetite of Empress Dowager Cixi, who particularly enjoyed meals containing edible fungi.[47] It was one of the eight featured ingredients of the \"Bird's Nest Eight Immortals Soup\" served at a banquet to celebrate her 60th birthday. This dish, served by descendants of the Confucius family in celebrations and longevity banquets, contained ingredients that were \"all precious food, delicacies from land and sea, fresh, tender, and crisp, appropriately sweet and salty\".[48] Another notable use was a state banquet held for American diplomat Henry Kissinger on his visit to China to reestablish diplomatic relations in the early 1970s.[49] One source writes of the mushroom: \"It has a fine and tender texture, fragrance and is attractive, beautiful in shape, fresh and crispy in taste.\"[50] The dried fungus, commonly sold in Asian markets, is prepared by rehydrating and soaking or simmering in water until tender.[51] Sometimes used in stir-frys, it is traditionally used as a component of rich chicken soups.[52] The rehydrated mushroom can also be stuffed and cooked.[53]",
			"color": "dark|0.3861 gray|0.3861 dark|0.3861 grey|0.3861 silver|0.22077 gray|0.17522 grey|0.17522 dim|0.12466 gray|0.12466 dim|0.12466 grey|0.12466 light|0.057444 gray|0.057444 light|0.057444 grey|0.057444 dark|0.015475 slate|0.015475 gray|0.015475 gainsboro|0.014383  "
		}
	}
}
