{
	"add": {
		"doc": {
			"id": "84169aae93a894955f348db46b57d4f19c76cdc6358bad6909a7b6f18c09b3ad",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Procellariidae_phylogeny.svg/350px-Procellariidae_phylogeny.svg.png",
			"previous": [],
				"after": "The more traditional taxonomy of the family, particularly the split into four groups, has been challenged by recent research. A 1998 study by Gary Nunn and Scott Stanley showed that the fulmarine petrels were indeed a discrete group within the family, as were the gadfly petrels in the genus Pterodroma.[5] However the two petrels in the genus Bulweria are no longer considered close to the gadfly petrels, instead being moved closer to the shearwaters in the genus Procellaria. Two genera, Pseudobulweria and Lugensa, have been split from the gadfly petrel genus Pterodroma, with Pseudobulweria being phylogenetically closer to the Puffinus shearwaters than the Pterodroma gadfly petrels,[9] and Lugensa (the Kerguelen petrel) possibly being closely related to the shearwaters or the fulmars.[10] The prions, according to Nunn and Stanley, were among the larger shearwater group.[5] The Calonectris shearwaters were placed close to the two Puffinus clades (closer to the Puffinus, or small, clade) and both were distant to the Procellaria shearwaters. The relationships between the genera and within the genera are still the subject of debate, with researchers lumping and splitting the species and genera within the family and arguing about the position of the genera within the family.[4][7] Many of the confusing species are among the least known of all seabirds; some of them (like the Fiji petrel) have not been seen more than 10 times since their discovery by science, and others' breeding grounds are unknown (like the Heinroth's shearwater).",
			"color": "dim|0.4897 gray|0.4897 dim|0.4897 grey|0.4897 gray|0.29104 grey|0.29104 dark|0.18474 gray|0.18474 dark|0.18474 grey|0.18474 black|0.020609 silver|0.012157  "
		}
	}
}
