{
	"add": {
		"doc": {
			"id": "841893f124b0a3db90a0163f7aef59a27405e48434023063aba43747a4f43769",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Mount_Tom_Summit_House.jpg/180px-Mount_Tom_Summit_House.jpg",
			"previous": [],
				"after": "Increased urbanization and industrialization in Europe and North America resulted in an opposing aesthetic transcendentalist movement characterized in New England by the art of Thomas Cole, Frederic Edwin Church, and other Hudson River School painters, the work of landscape architects such as Frederick Law Olmsted, and the writings of philosophers such as Henry David Thoreau and Ralph Waldo Emerson. As was true of other scenic areas of New England, the philosophical, artistic, and environmental movement of transcendentalism transformed the Metacomet Ridge from a commercial resource to a recreational resource.[1] Hotels, parks, and summer estates were built on the mountains from the mid-1880s to the early 20th century. Notable structures included summit hotels and inns on Mount Holyoke, Mount Tom, Sugarloaf Mountain, and Mount Nonotuck.[27][28] Parks and park structures such as Poet's Seat in Greenfield, Massachusetts, and Hubbard Park (designed with the help of Frederick Law Olmsted) of the Hanging Hills of Meriden, Connecticut, were intended as respites from the urban areas they closely abutted.[4][29] Estates such as Hill-Stead and Heublein Tower were built as mountain home retreats by local industrialists and commercial investors.[30][31] Although public attention gradually shifted to more remote and less developed destinations with the advent of modern transportation and the westward expansion of the United States, the physical, cultural, and historic legacy of that early recreational interest in the Metacomet Ridge still supports modern conservation efforts. Estates became museums; old hotels and the lands they occupied, frequently subject to damaging fires, became state and municipal parkland through philanthropic donation, purchase, or confiscation for unpaid taxes. Nostalgia among former guests of hotels and estates contributed to the aesthetic of conservation.[1][4][12][28][30]",
			"color": "black|0.32509 dark|0.093771 gray|0.093771 dark|0.093771 grey|0.093771 gray|0.090817 grey|0.090817 dim|0.090356 gray|0.090356 dim|0.090356 grey|0.090356 light|0.060056 gray|0.060056 light|0.060056 grey|0.060056 silver|0.059128 gainsboro|0.048532 tan|0.038337 dark|0.021454 slate|0.021454 gray|0.021454 dark|0.011755 olive|0.011755 green|0.011755  "
		}
	}
}
