{
	"add": {
		"doc": {
			"id": "842f45374c20c40db83bf08b4fc897f23de2af4b22d76902acb356bd3a767d91",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Slaves_ruvuma.jpg/240px-Slaves_ruvuma.jpg",
				"previous": "The 19th century was an era of rapidly accelerating scientific discovery and invention, with significant developments in the fields of mathematics, physics, chemistry, biology, electricity, and metallurgy that laid the groundwork for the technological advances of the 20th century.[2] The Industrial Revolution began in Great Britain and spread to continental Europe, North America and Japan.[3] The Victorian era was notorious for the employment of young children in factories and mines, as well as strict social norms regarding modesty and gender roles.[4] Japan embarked on a program of rapid modernization following the Meiji Restoration, before defeating China, under the Qing Dynasty, in the First Sino-Japanese War. Advances in medicine and the understanding of human anatomy and disease prevention took place in the 19th century, and were partly responsible for rapidly accelerating population growth in the western world. Europe's population doubled during the 19th century, from approximately 200 million to more than 400 million.[5] The introduction of railroads provided the first major advancement in land transportation for centuries, changing the way people lived and obtained goods, and fuelling major urbanization movements in countries across the globe. Numerous cities worldwide surpassed populations of a million or more during this century. London became the world's largest city and capital of the British Empire. Its population increased from 1 million in 1800 to 6.7 million a century later. The last remaining undiscovered landmasses of Earth, including vast expanses of interior Africa and Asia, were discovered during this century, and with the exception of the extreme zones of the Arctic and Antarctic, accurate and detailed maps of the globe were available by the 1890s. Liberalism became the pre-eminent reform movement in Europe.[6]",
				"after": "Slavery was greatly reduced around the world. Following a successful slave revolt in Haiti, Britain and France stepped up the battle against the Barbary pirates and succeeded in stopping their enslavement of Europeans. The UK's Slavery Abolition Act charged the British Royal Navy with ending the global slave trade.[7] The first empire to abolish slavery was the Portuguese Empire, followed by Britain, who did so in 1834. America's 13th Amendment following their Civil War abolished slavery there in 1865, and in Brazil slavery was abolished in 1888 (see Abolitionism). Similarly, serfdom was abolished in Russia.",
			"color": " "
		}
	}
}
