{
	"add": {
		"doc": {
			"id": "8431526fc59439d744df9dcf283c0b1675f50aa58857052cf4fdcc499e214540",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/BenjaminP%C3%A9ret.jpg/220px-BenjaminP%C3%A9ret.jpg",
			"previous": [],
				"after": "When his first film was released, Buñuel became the first filmmaker to be officially welcomed into the ranks of the Surrealists by the movement's leader André Breton, an event recalled by film historian Georges Sadoul: \"Breton had convoked the creators to our usual venue [the Café Radio]... one summer's evening. Dalí had the large eyes, grace, and timidity of a gazelle. To us, Buñuel, big and athletic, his black eyes protruding a little, seemed exactly like he always is in Un Chien Andalou, meticulously honing the razor that will slice the open eye in two.\"[230] After he joined the Communist Party in Spain, however, it was quickly made clear to him that he could not be both a Communist and a Surrealist; his artistic collaborator Pierre Unik recounted in a letter of 30 January 1932 that \"a comrade from Agit-Prop\" called Buñuel and others together to tell them that, \"Surrealism was a movement of bourgeois degeneration\", continuing, \"What will the rank-and-file comrades say the day I have to announce to them, 'Comrades, I no longer have the right to militate amongst you...because I'm a degenerate bourgeois?'\"[55]:p.97 In consequence, on 6 May 1932, Buñuel wrote a letter to André Breton renouncing his membership in the Surrealist group: \"Given the current state of things there could be no question for a Communist of doubting for an instant between the choice of his party and any other sort of activity or discipline\".[231] He even went so far as to try to re-issue a drastically cut version of L'Age d'Or (over two-thirds of the original were eliminated) in response to complaints that the full 60-minute original was formally too difficult for the proletariat.[55]:p.138 Nonetheless, he retained a lifelong affinity with the Surrealist movement and longstanding friendships with many of the most prominent Surrealists.[232]",
			"color": " "
		}
	}
}
