{
	"add": {
		"doc": {
			"id": "8434b02178f30bb558b4cf1c1ad589b2836ddee81bbd184aaa35078df7ece18b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Many_glacier_hotel.jpg/220px-Many_glacier_hotel.jpg",
				"previous": "While exploring the Marias River in 1806, the Lewis and Clark Expedition came within 50 miles (80 km) of the area that is now the park.[7] A series of explorations after 1850 helped to shape the understanding of the area that later became the park. In 1885 George Bird Grinnell hired noted explorer (and later well regarded author) James Willard Schultz to guide him on a hunting expedition into what would later become the park.[14] After several more trips to the region, Grinnell became so inspired by the scenery that he spent the next two decades working to establish a national park. In 1901 Grinnell wrote a description of the region in which he referred to it as the \"Crown of the Continent\". His efforts to protect the land make him the premier contributor to this cause.[15] A few years after Grinnell first visited, Henry L. Stimson and two companions, including a Blackfoot, climbed the steep east face of Chief Mountain in 1892.",
				"after": "In 1891 the Great Northern Railway crossed the Continental Divide at Marias Pass 5,213 feet (1,589 m), which is along the southern boundary of the park. In an effort to stimulate use of the railroad, the Great Northern soon advertised the splendors of the region to the public. The company lobbied the United States Congress. In 1897 the park was designated as a forest preserve.[16] Under the forest designation, mining was still allowed but was not commercially successful. Meanwhile, proponents of protecting the region kept up their efforts. In 1910, under the influence of the Boone and Crockett Club,[17] spearheaded by Club members George Bird Grinnell, Henry L. Stimson, and the railroad, a bill was introduced into the U.S. Congress which redesignated the region from a forest reserve to a national park. This bill was signed into law by President William Howard Taft on May 11, 1910.[18][19] In 1910 George Bird Grinnell wrote, \"This Park, the country owes to the Boone and Crockett Club, whose members discovered the region, suggested it being set aside, caused the bill to be introduced into congress and awakened interest in it all over the country\".[20]",
			"color": "steel|0.12524 blue|0.12524 dim|0.11087 gray|0.11087 dim|0.11087 grey|0.11087 tan|0.090968 slate|0.085181 gray|0.085181 light|0.071621 slate|0.071621 gray|0.071621 dark|0.047111 slate|0.047111 gray|0.047111 gray|0.043406 grey|0.043406 dark|0.042727 khaki|0.042727 light|0.036014 gray|0.036014 light|0.036014 grey|0.036014 silver|0.0324 gainsboro|0.032243 dark|0.032172 gray|0.032172 dark|0.032172 grey|0.032172 black|0.028374 white|0.018281 smoke|0.018281 wheat|0.015501 alice|0.013994 blue|0.013994 ghost|0.013792 white|0.013792 snow|0.013665 sea|0.013417 shell|0.013417 white|0.01191 mint|0.01078 cream|0.01078 light|0.010485 steel|0.010485 blue|0.010485 floral|0.010065 white|0.010065 lavender|0.0099136 blush|0.0099136 azure|0.0094784 linen|0.009129 dark|0.0075692 olive|0.0075692 green|0.0075692  "
		}
	}
}
