{
	"add": {
		"doc": {
			"id": "84493f7cf9fabbae6a75dde84d2c1ab426c92033c901ae04d7ee43bc4b3feb1e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Copyright_term.svg/220px-Copyright_term.svg.png",
				"previous": "Another limitation of current U.S. Intellectual Property legislation is its focus on individual and joint works; thus, copyright protection can only be obtained in 'original' works of authorship.[82] This definition excludes any works that are the result of community creativity, for example Native American songs and stories; current legislation does not recognize the uniqueness of indigenous cultural \"property\" and its ever-changing nature. Simply asking native cultures to 'write down' their cultural artifacts on tangible mediums ignores their necessary orality and enforces a Western bias of the written form as more authoritative.",
			"after": [
				"Other criticism of intellectual property law concerns the expansion of intellectual property, both in duration and in scope.",
				"In addition, as scientific knowledge has expanded and allowed new industries to arise in fields such as biotechnology and nanotechnology, originators of technology have sought IP protection for the new technologies. Patents have been granted for living organisms,[83] (and in the United States, certain living organisms have been patentable for over a century)[84]"
			],
			"color": "khaki|0.2284 dark|0.17427 orange|0.17427 blue|0.15509 purple|0.080967 red|0.064835 dark|0.060096 magenta|0.060096 chocolate|0.049638 medium|0.045657 blue|0.045657 dark|0.029735 khaki|0.029735 light|0.0085493 gray|0.0085493 light|0.0085493 grey|0.0085493 gainsboro|0.0078453 silver|0.0071844 white|0.0047034 smoke|0.0047034 ghost|0.0041026 white|0.0041026 alice|0.0040327 blue|0.0040327 snow|0.0039872 dark|0.0039624 gray|0.0039624 dark|0.0039624 grey|0.0039624 sea|0.0038422 shell|0.0038422 dark|0.0038231 blue|0.0038231 white|0.0036834 lavender|0.0036451 floral|0.003603 white|0.003603 lavender|0.0035679 blush|0.0035679 saddle|0.0034859 brown|0.0034859 mint|0.0034432 cream|0.0034432  "
		}
	}
}
