{
	"add": {
		"doc": {
			"id": "8455b1ce4a57bfaaa2cf69a0fce92f98e2f85c2f488ece4e5c28648aa56eb0e3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Mounted_Edmontosaurus.jpg/220px-Mounted_Edmontosaurus.jpg",
				"previous": "The first well-supported species of Edmontosaurus was named in 1892 as Claosaurus annectens by Othniel Charles Marsh. This species is based on USNM 2414, a partial skull-roof and skeleton, with a second skull and skeleton, YPM 2182, designated the paratype. Both were collected in 1891 by John Bell Hatcher from the late Maastrichtian-age Upper Cretaceous Lance Formation of Niobrara County (then part of Converse County), Wyoming.[39] This species has some historical footnotes attached: it is among the first dinosaurs to receive a skeletal restoration, and is the first hadrosaurid so restored;[32][40] and YPM 2182 and UNSM 2414 are, respectively, the first and second essentially complete mounted dinosaur skeletons in the United States.[11] YPM 2182 was put on display in 1901,[32] and USNM 2414 in 1904.[11]",
				"after": "Because of the incomplete understanding of hadrosaurids at the time, following Marsh's death in 1897 Claosaurus annectens was variously classified as a species of Claosaurus, Thespesius or Trachodon. Opinions varied greatly; textbooks and encyclopedias drew a distinction between the \"Iguanodon-like\" Claosaurus annectens and the \"duck-billed\" Hadrosaurus (based on remains now known as adult Edmontosaurus annectens), while Hatcher explicitly identified C. annectens as synonymous with the hadrosaurid represented by those same duck-billed skulls.[32] Hatcher's revision, published in 1902, was sweeping: he considered almost all hadrosaurid genera then known as synonyms of Trachodon. This included Cionodon, Diclonius, Hadrosaurus, Ornithotarsus, Pteropelyx, and Thespesius, as well as Claorhynchus and Polyonax, fragmentary genera now thought to be horned dinosaurs.[41] Hatcher's work led to a brief consensus, until after 1910 new material from Canada and Montana showed a greater diversity of hadrosaurids than previously suspected.[32] Charles W. Gilmore in 1915 reassessed hadrosaurids and recommended that Thespesius be reintroduced for hadrosaurids from the Lance Formation and rock units of equivalent age, and that Trachodon, based on inadequate material, should be restricted to a hadrosaurid from the older Judith River Formation and its equivalents. In regards to Claosaurus annectens, he recommended that it be considered the same as Thespesius occidentalis.[42] His reinstatement of Thespesius for Lance-age hadrosaurids would have other consequences for the taxonomy of Edmontosaurus in the following decades.",
			"color": " "
		}
	}
}
