{
	"add": {
		"doc": {
			"id": "8469825f38a918f701a4ecb96a560ffc6446405495df01c34ac2b83c2356e1d2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Sultan_Battery_2163.JPG/220px-Sultan_Battery_2163.JPG",
				"previous": "Mangalore's historical importance is highlighted by the many references to the city by foreign travellers. During the first century CE, Pliny the Elder, a Roman historian, made references to a place called Nitrias, as a very undesirable place for disembarkation, on account of the pirates which frequent its vicinity,[20] while Greek historian Ptolemy in the second century CE referred to a place called Nitra. Ptolemy's and Pliny the Elder's references were probably made to the Netravati River, which flows through Mangalore.[21] Cosmas Indicopleustes, a Greek monk, in his 6th century work Christian Topography mentions Malabar as the chief seat of the pepper trade, and Mangarouth (port of Mangalore) as one of the five pepper marts which exported pepper.[22][23]",
				"after": "Mangalore is the heart of a distinct multilinguistic—cultural region: Tulu Nadu, the homeland of the Tulu-speaking people, which was nearly coterminous with the modern district of South Canara.[26] In the third century BCE, the town formed part of the Maurya Empire, ruled by the Buddhist emperor, Ashoka of Magadha.[27]:176 From the third century CE to sixth century CE, the Kadamba dynasty, whose capital was based in Banavasi in North Canara, ruled over the entire Canara region as independent rulers.[28] From the middle of the seventh century to the end of the 14th century, the South Canara region was ruled by its own native Alupa rulers. The Alupas ruled over the region as feudatories of major regional dynasties like the Chalukyas of Badami, Rashtrakutas of Manyakheta, Chalukyas of Kalyani, and Hoysalas of Dwarasamudra.[29]:17 During the reign of the Alupa king Kavi Alupendra (c. 1110 - c.1160), the city was visited by the Tunisian Jewish merchant Abraham Ben Yiju, who travelled between the Middle East and India during the 12th century.[30] The Moroccan traveller Ibn Battuta, who had visited the town in 1342, referred to it as Manjarur, and stated that the town was situated on a large estuary, called the \"estuary of the wolf,\" and was the greatest estuary in the country of Malabar.[31][32]:30 By 1345, the Vijayanagara rulers brought the region under their control.[29]:17 During the Vijayanagara period (1345-1550), South Canara was divided into Mangalore and Barkur rajyas (provinces), and two governors were appointed to look after each of them from Mangalore and Barkur. But many times only one governor ruled over both Mangalore and Barkur rajyas, and when the authority passed into the hands of Keladi rulers (c. 1550-1763), they had a governor at Barkur alone.[29]:19 In 1448, Abdur Razzaq, the Persian ambassador of Sultan Shah Rukh of Samarkand, visited Mangalore, en route to the Vijayanagara court.[32]:31 The Italian traveler, Ludovico di Varthema, who visited India in 1506 says that he witnessed nearly sixty ships laden with rice ready for sail in the port of Mangalore.[29]:20",
			"color": "dark|0.31225 olive|0.31225 green|0.31225 dim|0.074409 gray|0.074409 dim|0.074409 grey|0.074409 white|0.058297 smoke|0.058297 sea|0.049081 shell|0.049081 snow|0.048583 gainsboro|0.045662 linen|0.043879 ghost|0.043688 white|0.043688 white|0.041083 floral|0.039014 white|0.039014 mint|0.038683 cream|0.038683 light|0.035173 gray|0.035173 light|0.035173 grey|0.035173 alice|0.030924 blue|0.030924 azure|0.023313 lavender|0.023239 blush|0.023239 ivory|0.017042 old|0.016966 lace|0.016966 black|0.013919 gray|0.012774 grey|0.012774 olive|0.010477 drab|0.010477  "
		}
	}
}
