{
	"add": {
		"doc": {
			"id": "84783f36f571a3fc62cefc105b95abceeec99f047549ab8cef35875693f4bacb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Celtics_game_versus_the_Timberwolves%2C_February%2C_1_2009.jpg/220px-Celtics_game_versus_the_Timberwolves%2C_February%2C_1_2009.jpg",
				"previous": "The Boston Red Sox, a founding member of the American League of Major League Baseball in 1901, play their home games at Fenway Park, near Kenmore Square in the city's Fenway section. Built in 1912, it is the oldest sports arena or stadium in active use in the United States among the four major professional American sports leagues, encompassing Major League Baseball, the National Football League, National Basketball Association, and the National Hockey League.[171] Boston was the site of the first game of the first modern World Series, in 1903. The series was played between the AL Champion Boston Americans and the NL champion Pittsburgh Pirates.[172][173] Persistent reports that the team was known in 1903 as the \"Boston Pilgrims\" appear to be unfounded.[174] Boston's first professional baseball team was the Red Stockings, one of the charter members of the National Association in 1871, and of the National League in 1876. The team played under that name until 1883, under the name Beaneaters until 1911, and under the name Braves from 1912 until they moved to Milwaukee after the 1952 season. Since 1966 they have played in Atlanta as the Atlanta Braves.[175]",
				"after": "The TD Garden, formerly called the FleetCenter, is adjoined to North Station and is the home of three major league teams: the Boston Blazers of the National Lacrosse League, the Boston Bruins of the National Hockey League; and the Boston Celtics of the National Basketball Association. The arena seats 18,624 for basketball games and 17,565 for ice hockey games. The Bruins were the first American member of the National Hockey League and an Original Six franchise.[176] The Boston Celtics were founding members of the Basketball Association of America, one of the two leagues that merged to form the NBA.[177] The Celtics have the distinction of having won more championships than any other NBA team, with seventeen.[178]",
			"color": "black|0.60237 dim|0.079481 gray|0.079481 dim|0.079481 grey|0.079481 rosy|0.065419 brown|0.065419 gray|0.036182 grey|0.036182 burly|0.026815 wood|0.026815 golden|0.020129 rod|0.020129 dark|0.018714 slate|0.018714 gray|0.018714 tan|0.014975 sea|0.014546 green|0.014546 dark|0.012423 gray|0.012423 dark|0.012423 grey|0.012423  "
		}
	}
}
