{
	"add": {
		"doc": {
			"id": "8483c8279ad801b1a032566ced947307cb43c83a6aced1cd701f3ad761342208",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Moche_portrait_ceramic_Quai_Branly_71.1930.19.162_n2.jpg/170px-Moche_portrait_ceramic_Quai_Branly_71.1930.19.162_n2.jpg",
			"previous": [],
				"after": "The earliest evidences of human presence in Peruvian territory have been dated to approximately 9,000 BC.[13] Andean societies were based on agriculture, using techniques such as irrigation and terracing; camelid husbandry and fishing were also important. Organization relied on reciprocity and redistribution because these societies had no notion of market or money.[14] The oldest known complex society in Peru, the Norte Chico civilization, flourished along the coast of the Pacific Ocean between 3,000 and 1,800 BC.[15] These early developments were followed by archaeological cultures that developed mostly around the coastal and Andean regions throughout Peru. The Cupisnique culture which flourished from around 1000 to 200 BC[16] along what is now Peru's Pacific Coast was an example of early pre-Incan culture. The Chavín culture that developed from 1500 to 300 BC was probably more of a religious than a political phenomenon, with their religious centre in Chavin de Huantar.[17] After the decline of the Chavin culture around the beginning of the Christian millennium, a series of localized and specialized cultures rose and fell, both on the coast and in the highlands, during the next thousand years. On the coast, these included the civilizations of the Paracas, Nazca, Wari, and the more outstanding Chimu and Mochica. The Mochica who reached their apogee in the first millennium AD were renowned for their irrigation system which fertilized their arid terrain, their sophisticated ceramic pottery, their lofty buildings, and clever metalwork. The Chimu were the great city builders of pre-Inca civilization; as loose confederation of cities scattered along the coast of northern Peru and southern Ecuador, the Chimu flourished from about 1150 to 1450. Their capital was at Chan Chan outside of modern-day Trujillo. In the highlands, both the Tiahuanaco culture, near Lake Titicaca in both Peru and Bolivia, and the Wari culture, near the present-day city of Ayacucho, developed large urban settlements and wide-ranging state systems between 500 and 1000 AD.[18]",
			"color": "saddle|0.14722 brown|0.14722 burly|0.14059 wood|0.14059 sienna|0.13109 tan|0.094794 peach|0.061333 puff|0.061333 navajo|0.052464 white|0.052464 peru|0.044127 sandy|0.03606 brown|0.03606 dark|0.035657 salmon|0.035657 wheat|0.033782 light|0.032914 salmon|0.032914 moccasin|0.031336 bisque|0.026532 chocolate|0.025976 black|0.01807 blanched|0.018022 almond|0.018022 papaya|0.011532 whip|0.011532 corn|0.0077948 silk|0.0077948 lemon|0.0076073 chiffon|0.0076073 antique|0.007321 white|0.007321  "
		}
	}
}
