{
	"add": {
		"doc": {
			"id": "84a62a93174afb2425ea617d69bf942f9aea7d8fc68e77fdd0baaea2f5c34d9b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Gr%C3%B3b_rodzic%C3%B3w_Jana_Paw%C5%82a_II_na_cmentarzu_Rakowickim_w_Krakowie.jpg/220px-Gr%C3%B3b_rodzic%C3%B3w_Jana_Paw%C5%82a_II_na_cmentarzu_Rakowickim_w_Krakowie.jpg",
				"previous": "In 1939, Nazi German occupation forces closed the university after invading Poland.[16] Able-bodied males were required to work, so from 1940 to 1944 Wojtyła variously worked as a messenger for a restaurant, a manual labourer in a limestone quarry and for the Solvay chemical factory, to avoid deportation to Germany.[17][25] In 1940 he was struck by a tram, suffering a fractured skull. The same year he was hit by a lorry in a quarry, which left him with one shoulder higher than the other and a permanent stoop.[27] His father, a former Austro-Hungarian non-commissioned officer and later officer in the Polish Army, died of a heart attack in 1941,[19] leaving Wojtyła as the immediate family's only surviving member.[18][20][28] \"I was not at my mother's death, I was not at my brother's death, I was not at my father's death,\" he said, reflecting on these times of his life, nearly forty years later, \"At twenty, I had already lost all the people I loved.\"[28]",
				"after": "After his father's death, he started thinking seriously about the priesthood.[29] In October 1942, while the war continued, he knocked on the door of the Bishop's Palace in Kraków and asked to study for the priesthood.[29] Soon after, he began courses in the clandestine underground seminary run by the Archbishop of Kraków, Adam Stefan Cardinal Sapieha. On 29 February 1944, Wojtyła was hit by a German truck. German Wehrmacht officers tended to him and sent him to a hospital. He spent two weeks there recovering from a severe concussion and a shoulder injury. It seemed to him that this accident and his survival was a confirmation of his vocation. On 6 August 1944, a day known as 'Black Sunday',[30] the Gestapo rounded up young men in Kraków to curtail the uprising there, [30] similar to the recent uprising in Warsaw.[31][32] Wojtyła escaped by hiding in the basement of his uncle's house at 10 Tyniecka Street, while the German troops searched above.[29][31][32] More than eight thousand men and boys were taken that day, while Wojtyła escaped to the Archbishop's Palace,[29][30][31] where he remained until after the Germans had left.[18][29][31]",
			"color": "light|0.1212 gray|0.1212 light|0.1212 grey|0.1212 gainsboro|0.11095 silver|0.10041 dark|0.097232 gray|0.097232 dark|0.097232 grey|0.097232 gray|0.05109 grey|0.05109 white|0.038202 smoke|0.038202 black|0.035452 beige|0.028039 mint|0.027839 cream|0.027839 honeydew|0.024104 dark|0.02344 slate|0.02344 gray|0.02344 dim|0.023264 gray|0.023264 dim|0.023264 grey|0.023264 azure|0.022331 floral|0.020593 white|0.020593 linen|0.019631 alice|0.018081 blue|0.018081 sea|0.016683 shell|0.016683 snow|0.016506 white|0.015993 ivory|0.014394 old|0.013565 lace|0.013565 ghost|0.012191 white|0.012191 antique|0.01175 white|0.01175  "
		}
	}
}
