{
	"add": {
		"doc": {
			"id": "84ab3d4d8c9fe6b56e6884fa5447d21266a15604aa5e3e34e8179c1fc81339d5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Lokajski_-_Powstancy_w_%C5%9Ar%C3%B3dmie%C5%9Bciu_%281944%29.jpg/170px-Lokajski_-_Powstancy_w_%C5%9Ar%C3%B3dmie%C5%9Bciu_%281944%29.jpg",
				"previous": "The invasion of Poland on 1 September 1939, started the war in Europe, and the United Kingdom and France declared war on Germany on 3 September. Poland fielded the third biggest army[48] among the European Allies, after the Soviet Union and United Kingdom, but before France. The country never officially surrendered to the Third Reich, nor to the Soviet Union, primarily because either of the totalitarian powers did not request an official surrender, and continued the war effort under the Polish government in exile. However, the Soviet Union unilaterally considered the flight to Romania of President Ignacy Mościcki and Marshal Edward Rydz-Śmigły on 17 September as an evidence of debellatio causing the extinction of Polish State, and consequently declared itself allowed to invade (according to Soviet position: \"to protect\") Eastern Poland starting from the same day.[49] It must be noted that the Red Army had invaded the Second Polish Republic several hours before Polish president fled to Romania. The Soviets invaded on Sept. 17 at 3 a.m.,l [50] while president Mościcki crossed the Polish-Romanian border at 21:45 on the same day.[51] The Polish military continued to fight, and the last major battle of the war, the battle of Kock, ended at 1 a.m. on October 6, 1939 with the Independent Operational Group \"Polesie,\" a field army, surrendering due to lack of ammunition.",
				"after": "Polish soldiers fought under their own flag but under the command of the British military. They were major contributors to the allies in the theatre of war west of Germany and in the theatre of war east of Germany, with the Soviet Union. The Polish armed forces in the West created after the fall of Poland played minor roles in the Battle of France, and important ones in the Italian and North African Campaigns.[52] The Polish People's Army took part in the Battle of Berlin, the closing battle of the European theater of war. They occupied the city alongside the Soviet Red Army.",
			"color": "black|0.32119 dark|0.058903 gray|0.058903 dark|0.058903 grey|0.058903 silver|0.049485 gray|0.04622 grey|0.04622 light|0.046168 gray|0.046168 light|0.046168 grey|0.046168 dim|0.043117 gray|0.043117 dim|0.043117 grey|0.043117 gainsboro|0.040549 white|0.039103 smoke|0.039103 sea|0.036443 shell|0.036443 floral|0.033714 white|0.033714 snow|0.033608 linen|0.031264 mint|0.030797 cream|0.030797 white|0.030287 ghost|0.02909 white|0.02909 dark|0.02872 slate|0.02872 gray|0.02872 alice|0.023535 blue|0.023535 azure|0.022614 lavender|0.012965 blush|0.012965 old|0.010625 lace|0.010625 slate|0.0088662 gray|0.0088662 ivory|0.008414 light|0.0074122 slate|0.0074122 gray|0.0074122  "
		}
	}
}
