{
	"add": {
		"doc": {
			"id": "84af25522ceed2b39a05bd710c16f05dcf29cb717d9bde8ae3b2394e746fea5c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Gary_Cooper_in_Bluebeards_Eighth_Wife_1938.jpg/260px-Gary_Cooper_in_Bluebeards_Eighth_Wife_1938.jpg",
				"previous": "In contrast to his output the previous year, Cooper appeared in only one picture in 1937, Henry Hathaway's adventure film Souls at Sea.[139] A critical and box-office failure,[140] Cooper referred to it as his \"almost picture\", saying, \"It was almost exciting, and almost interesting. And I was almost good.\"[140] In 1938, he appeared in Archie Mayo's biographical film The Adventures of Marco Polo.[141] Plagued by production problems and a weak screenplay,[142] the film became Goldwyn's biggest failure to that date, losing $700,000.[143] During this period, Cooper turned down several important roles,[144] including the role of Rhett Butler in Gone with the Wind.[145] Cooper was producer David O. Selznick's first choice for the part.[145] He made several overtures to the actor,[146] but Cooper had doubts about the project,[146] and did not feel suited to the role.[133] Cooper later admitted, \"It was one of the best roles ever offered in Hollywood ... But I said no. I didn't see myself as quite that dashing, and later, when I saw Clark Gable play the role to perfection, I knew I was right.\"[133][Note 6]",
				"after": "Back at Paramount, Cooper returned to a more comfortable genre in Ernst Lubitsch's romantic comedy Bluebeard's Eighth Wife (1938) with Claudette Colbert.[143][149] In the film, Cooper plays a wealthy American businessman in France who falls in love with an impoverished aristocrat's daughter and persuades her to become his eighth wife.[150] Despite the clever screenplay by Charles Brackett and Billy Wilder,[151] and solid performances by Cooper and Colbert,[149] audiences had trouble accepting Cooper in the role of a shallow philanderer.[151] For many of his fans, Cooper had become \"Mr. Deeds incarnate\".[151] In the fall of 1938, Cooper appeared in H. C. Potter's romantic comedy The Cowboy and the Lady with Merle Oberon, about a sweet-natured rodeo cowboy who falls in love with the wealthy daughter of a presidential hopeful, believing her to be a poor, hard-working lady's maid.[152] The efforts of three directors and several eminent screenwriters could not salvage what could have been a fine vehicle for Cooper.[153] While more successful than its predecessor, the film was Cooper's fourth consecutive box-office failure.[154]",
			"color": " "
		}
	}
}
