{
	"add": {
		"doc": {
			"id": "84cc1549dd69008d7a1ffc4088cf2907a2923c4e09c286eb38881b9a5797b965",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Warsaw_wwII.jpg/220px-Warsaw_wwII.jpg",
				"previous": "The facts of the Warsaw Uprising were inconvenient to Stalin, and were twisted by propaganda of the People's Republic of Poland, which stressed the failings of the Home Army and the Polish government-in-exile, and forbade all criticism of the Red Army or the political goals of Soviet strategy.[181] In the immediate post-war period, the very name of the Home Army was censored, and most films and novels covering the 1944 Uprising were either banned or modified so that the name of the Home Army did not appear.[181] From the 1950s on, Polish propaganda depicted the soldiers of the Uprising as brave, but the officers as treacherous, reactionary and characterized by disregard of the losses.[181][182] The first publications on the topic taken seriously in the West were not issued until the late 1980s. In Warsaw no monument to the Home Army was built until 1989. Instead, efforts of the Soviet-backed People's Army were glorified and exaggerated.[citation needed]",
				"after": "By contrast, in the West the story of the Polish fight for Warsaw was told as a tale of valiant heroes fighting against a cruel and ruthless enemy. It was suggested that Stalin benefited from Soviet non-involvement, as opposition to eventual Soviet control of Poland was effectively eliminated when the Nazis destroyed the partisans.[183] The belief that the Uprising failed because of deliberate procrastination by the Soviet Union contributed to anti-Soviet sentiment in Poland. Memories of the Uprising helped to inspire the Polish labour movement Solidarity, which led a peaceful opposition movement against the Communist government during the 1980s.[184]",
			"color": "dim|0.23751 gray|0.23751 dim|0.23751 grey|0.23751 dark|0.185 gray|0.185 dark|0.185 grey|0.185 silver|0.17606 gray|0.15453 grey|0.15453 light|0.11631 gray|0.11631 light|0.11631 grey|0.11631 black|0.061565 dark|0.028442 slate|0.028442 gray|0.028442 slate|0.018327 gray|0.018327 gainsboro|0.013906 light|0.0080367 slate|0.0080367 gray|0.0080367  "
		}
	}
}
