{
	"add": {
		"doc": {
			"id": "84ce27d17eea269c63220dd141fbf1ed42ace81f46e86c894eb23a4bc43fa4db",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/DF-SD-03-02182.JPEG/220px-DF-SD-03-02182.JPEG",
				"previous": "In September 2008, Alenia North America was awarded a USAF contract to upgrade and refurbish 18 G.222s, to be transferred to and used by the Afghan Air Force and Afghan National Army Air Corps. Ballistic protection, adaptations for serving in the conditions of Afghanistan, and many new avionics systems, including a digital auto-pilot, were installed; two aircraft were also configured for VIP transport duties.[22][24] In January 2013, the USAF decided not to renew the support contract for the Afghan fleet due to claimed servicability issues and operational difficulties; Alenia responded, stating that the fleet was exceeding the requirements laid out by the USAF, with 10-12 aircraft available for operations against the requirement for six.[25] The 16 G.222s delivered to Afghanistan were scrapped in the summer of 2014 by the Defense Logistics Agency.[26] After the U.S. spent $486 million to buy 20 C-27As, 16 were sold as scrap to an Afghan construction company for about $32,000; the planes were scrapped \"to minimize impact on drawdown of U.S. forces in Afghanistan.\" The four remaining aircraft are stored at Ramstein Air Base, Germany, with the U.S. seeking other interested buyers. From January to September 2012, the Afghan C-27A fleet flew only 234 out of 4,500 required hours.[27]",
			"after": [],
			"color": "silver|0.18786 dark|0.14338 gray|0.14338 dark|0.14338 grey|0.14338 light|0.13605 gray|0.13605 light|0.13605 grey|0.13605 gainsboro|0.096404 light|0.079458 steel|0.079458 blue|0.079458 black|0.067808 tan|0.047561 burly|0.034131 wood|0.034131 gray|0.028018 grey|0.028018 white|0.02099 smoke|0.02099 dim|0.015959 gray|0.015959 dim|0.015959 grey|0.015959 lavender|0.013478 alice|0.012986 blue|0.012986 sea|0.011971 shell|0.011971 ghost|0.011891 white|0.011891 linen|0.011653 snow|0.011552 floral|0.0090269 white|0.0090269 white|0.0088562 mint|0.0085634 cream|0.0085634 lavender|0.0082123 blush|0.0082123 azure|0.0063829 light|0.005364 slate|0.005364 gray|0.005364  "
		}
	}
}
