{
	"add": {
		"doc": {
			"id": "84fd3d8142a36bc9c99b60f0dd4dba5ba00ff9aba85a7a0979736d5911ad57d2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Dorset_transport.png/300px-Dorset_transport.png",
			"previous": [],
				"after": "The A350 road is Poole town centre's main artery, running north from Poole Bridge along Holes Bay and on to the A35, and as a single carriageway to Bath and Bristol. To the east, the A337 road leads to Lymington and the New Forest. The A35 trunk road runs from Devon to Southampton and connects to the A31 on the outskirts of the town. The A31, the major trunk road in central southern England, connects to the M27 motorway at Southampton. From here the M3 motorway leads to London, and fast access may also be gained via the A34 to the M4 north of Newbury. A second bridge is being built to connect Poole and Hamworthy as the existing bridge is unsuitable for the traffic flow. The £34 million Twin Sails bridge project was given approval by the Department for Transport in 2006 but construction was initially held up due to a stalemate between the council and the land owners and delays by the Department for Transport in approving a £14 million grant.[120][121] After negotiations between the council and the land owners were settled in August 2009 and the government grant was provided in March 2010, construction began in May 2010 with completion due by early 2012.[122] A road link to Studland and the Isle of Purbeck across the narrow entrance of Poole Harbour is provided by the Sandbanks Ferry.[123]",
			"color": "light|0.1978 golden|0.1978 rod|0.1978 yellow|0.1978 lemon|0.19579 chiffon|0.19579 light|0.18454 yellow|0.18454 corn|0.15506 silk|0.15506 light|0.04325 sky|0.04325 blue|0.04325 light|0.019924 gray|0.019924 light|0.019924 grey|0.019924 gainsboro|0.019039 wheat|0.015155 dark|0.013806 salmon|0.013806 blanched|0.013673 almond|0.013673 beige|0.013038 peach|0.010881 puff|0.010881 light|0.010129 steel|0.010129 blue|0.010129 silver|0.0082708 salmon|0.0081977 light|0.0080609 salmon|0.0080609 papaya|0.0068461 whip|0.0068461 bisque|0.0065208 moccasin|0.006243 white|0.0061503 smoke|0.0061503 navajo|0.0058785 white|0.0058785 antique|0.0053876 white|0.0053876 dim|0.0051041 gray|0.0051041 dim|0.0051041 grey|0.0051041 pale|0.0040403 golden|0.0040403 rod|0.0040403 gray|0.0037171 grey|0.0037171 light|0.0035724 coral|0.0035724 dark|0.0032288 gray|0.0032288 dark|0.0032288 grey|0.0032288  "
		}
	}
}
