{
	"add": {
		"doc": {
			"id": "84fd26367e39e13cef48566afa8772f7791db2c2f864db0a896d7c76672c78d1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/St_Johns_River.jpg/220px-St_Johns_River.jpg",
				"previous": "Broadening more into an 8-foot (2.4 m) deep channel about 100 yards (91 m) wide, after leaving Lake Monroe, the St. Johns meets its most significant tributary in the middle basin, the spring-fed Wekiva River, discharging approximately 42,000,000 US gallons (160,000,000 L) a day into the St. Johns.[22] Near this confluence are the towns of DeBary and Deltona. The forests surrounding the Wekiva River are home to the largest black bear (Ursus americanus floridanus) population in Florida, and several troops of Rhesus monkeys (Macaca mulatta) have adapted to the live near the river as well. The monkeys' introduction to Florida is unclear; they were reportedly brought to Florida either to serve in backdrop scenes of Tarzan movies filmed around the Silver River in the 1930s, or to lend an air of authenticity to \"jungle cruises\", provided by an enterprising boat operator around the same time.[23][24][25]",
				"after": "Of the most vital importance to marshes are invertebrate animals, which are the foundation of food webs. Amphibious invertebrates such as apple snails (Pomacea paludosa), crayfish, and grass shrimp consume plant material, hastening its decomposition and acting as a food source for fish and birds. Insect larvae use water for breeding, feeding upon smaller copepods and amphipods that live in microscopic algae and periphyton formations.[26] Mosquitos are born in water; they are in turn the favorite food of 112 species of dragonflies and 44 species of damselflies in Florida. These animals are water hardy and adaptable to dry conditions when water levels fluctuate from one season to the next, or through drought and flood cycles.[27]",
			"color": "dim|0.3314 gray|0.3314 dim|0.3314 grey|0.3314 gray|0.15957 grey|0.15957 dark|0.083709 gray|0.083709 dark|0.083709 grey|0.083709 black|0.064214 silver|0.041826 light|0.027394 gray|0.027394 light|0.027394 grey|0.027394 dark|0.026479 khaki|0.026479 gainsboro|0.020171 pale|0.019295 golden|0.019295 rod|0.019295 slate|0.015814 gray|0.015814 light|0.013822 slate|0.013822 gray|0.013822 dark|0.012297 olive|0.012297 green|0.012297 beige|0.0097738 antique|0.0093872 white|0.0093872 white|0.0093004 smoke|0.0093004  "
		}
	}
}
