{
	"add": {
		"doc": {
			"id": "8500b38a19ef91f4b442245a2fe4e7a2743454634e132ec1540c02e27f77b7f5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/SBC_Plaza.JPG/220px-SBC_Plaza.JPG",
				"previous": "The Millennium Park project has been the subject of some criticism since its inception. In addition to concerns about cost overruns, individuals and organizations have complained that the money spent on the park might have gone to other worthy causes, citing poverty in Chicago and problems in the city's schools. Although the park's design and architectural elements have won wide praise, there has been some criticism of its aesthetics. Other criticism has revolved around the larger issue of corruption and political favoritism in the city; The New York Times reported in July 2004 that an inflated contract for park cleanup had gone to a company that made large contributions to Mayor Daley's election campaign.[4] The park's only full service restaurant, Park Grill, has been criticized for its connection to numerous friends and associates of the mayor.[234][235]",
				"after": "Concerns have also been raised over the mixed use of taxpayer and corporate funding and associated naming rights for sections of the park. While a monument in Wrigley Square honors the park's many private and corporate donors, many park features are also named for their corporate underwriters, with the sponsors' names prominently indicated with stone markers (The Boeing Gallery, The Exelon Pavilion, The AT&T Plaza, The Wrigley Square). Some critics have deemed this to be inappropriate for a public space. Julie Deardorff, Chicago Tribune health and fitness reporter, described the naming of the McDonald's Cycle Center as a continuation of the \" 'McDonaldization' of America\" and as somewhat \"insidious\" because the company is making itself more prominent as the social sentiment is to move away from fast food.[167] Timothy Gilfoyle, author of Millennium Park: Creating a Chicago Landmark, notes that a controversy surrounds the \"tasteless\" corporate naming of several of the Park's features, including the BP Bridge, named for an oil company.[236] Naming rights were sold for high fees,[237] and Gilfoyle was not the only one who chastised park officials for selling naming rights to the highest bidder. Public interest groups have crusaded against commercialization of Chicago parks.[238] However, many of the donors have a long history of local philanthropy and their funds were essential to provide necessary financing for several park features.[15]",
			"color": "gray|0.75532 grey|0.75532 dim|0.092663 gray|0.092663 dim|0.092663 grey|0.092663 dark|0.074983 gray|0.074983 dark|0.074983 grey|0.074983 rosy|0.07465 brown|0.07465  "
		}
	}
}
