{
	"add": {
		"doc": {
			"id": "8501203ce6fe4cb795ff58309456af211dc909cf8ddd0f62c7e9f14d54b1b2e0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Deinocheirus_vertebrae_en.png/220px-Deinocheirus_vertebrae_en.png",
				"previous": "Deinocheirus and Therizinosaurus possessed the longest forelimbs known for any bipedal dinosaurs.[2] The holotype forelimbs measure 2.4 m (7.9 ft) long — the humerus (upper arm bone) is 93.8 cm (36.9 in), the ulna 68.8 cm (27.1 in), and the hand is 77 cm (30 in) — including the 19.6 cm (7.7 in) long recurved claws. Each scapulocoracoid of the shoulder girdle has a length of 1.53 m (5.0 ft). Each half of the paired ceratobranchialia measure 42 cm (17 in). The shoulder-blade was long and narrow, and the deltopectoralis crest was pronounced and triangular. The upper arm (humerus) was relatively slender, and only slightly longer than the hand. The ulna and radius (lower arm bones) were elongate and not firmly connected to each other in a syndesmosis. The metacarpus was long compared to the fingers. The three fingers were about equal in length, the first being the stoutest and the second the longest. Various rough areas and impressions on the forelimbs indicate the presence of powerful muscles. Most articular surfaces of the arm bones were deeply furrowed, indicating that the animal had thick pads of cartilage between the joints. Though the arms of Deinocheirus were large, the ratio between them and the shoulder girdle was less than that of the smaller ornithomimosaur Ornithomimus.[6] The arm bones of Deinocheirus also had similar proportions to those of the small theropod Compsognathus.[7] The wishbone (furcula), an element not known from any other ornithomimosaurs, was U-shaped. The hindlimbs were relatively short, and the thigh bone (femur) was longer than the shin bone (tibia), as is common for large animals. The metatarsus was short and not arctometatarsalian, as in most other theropods. The claw bones of the feet were blunt and broad-tipped instead of tapered, unlike other theropods, but resembled the unguals of large ornithischian dinosaurs. The proportions of the toe bones resembled those of tyrannosaurs, due to the large weight they had to bear.[1]",
				"after": "Though Deinocheirus was a bulky animal, its dorsal ribs were tall and relatively straight, indicating that the body was narrow.[8] The ten neck vertebrae were low and long, and progressively shorter backwards from the skull. This resulted in a more S-curved neck than seen in other ornithomimosaurs, due to the larger skull. The neural spines of the twelve back vertebrae became increasingly longer from front to back, the last one being 8.5 times the height of the centrum part. This is almost the same as the highest ratio in the neural spines of the theropod Spinosaurus. The neural spines had a system of ligaments, which were probably used to support the abdomen by attaching to the hips and hind legs.[1] Together, the neural spines formed a tall \"sail\" along the lower back, hips, and base of the tail, somewhat similar to that of Spinosaurus.[9]",
			"color": "dim|0.43333 gray|0.43333 dim|0.43333 grey|0.43333 black|0.40513 gray|0.16154 grey|0.16154  "
		}
	}
}
