{
	"add": {
		"doc": {
			"id": "850587ac321b01caa1b36b6d59484e2c0737896be5e8f9c0e7c029842cd0db06",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/The_ottoman_empire_and_its_successors_%281923%29_-_Ottoman_Empire_in_1856.png/145px-The_ottoman_empire_and_its_successors_%281923%29_-_Ottoman_Empire_in_1856.png",
				"previous": "The Age of Enlightenment was a powerful intellectual movement during the 18th century promoting scientific and reason-based thoughts.[112][113][114] Discontent with the aristocracy and clergy's monopoly on political power in France resulted in the French Revolution and the establishment of the First Republic as a result of which the monarchy and many of the nobility perished during the initial reign of terror.[115] Napoleon Bonaparte rose to power in the aftermath of the French Revolution and established the First French Empire that, during the Napoleonic Wars, grew to encompass large parts of Europe before collapsing in 1815 with the Battle of Waterloo.[116][117] Napoleonic rule resulted in the further dissemination of the ideals of the French Revolution, including that of the nation-state, as well as the widespread adoption of the French models of administration, law, and education.[118][119][120] The Congress of Vienna, convened after Napoleon's downfall, established a new balance of power in Europe centred on the five \"Great Powers\": the UK, France, Prussia, Austria, and Russia.[121] This balance would remain in place until the Revolutions of 1848, during which liberal uprisings affected all of Europe except for Russia and the UK. These revolutions were eventually put down by conservative elements and few reforms resulted.[122] The year 1859 saw the unification of Romania, as a nation-state, from smaller principalities. In 1867, the Austro-Hungarian empire was formed; and 1871 saw the unifications of both Italy and Germany as nation-states from smaller principalities.[123]",
				"after": "In parallel, the Eastern Question grew more complex ever since the Ottoman defeat in the Russo-Turkish War (1768–1774). As the dissolution of the Ottoman Empire seemed imminent, the Great Powers struggled to safeguard their strategic and commercial interests in the Ottoman domains. The Russian Empire stood to benefit from the decline, whereas the Habsburg Empire and Britain perceived the preservation of the Ottoman Empire to be in their best interests. Meanwhile, the Serbian revolution and Greek War of Independence marked the birth of nationalism in the Balkans.[124] Formal recognition of the de facto independent principalities of Montenegro, Serbia and Romania ensued at the Congress of Berlin in 1878.",
			"color": "pale|0.265 golden|0.265 rod|0.265 lemon|0.20882 chiffon|0.20882 light|0.20069 golden|0.20069 rod|0.20069 yellow|0.20069 light|0.075933 yellow|0.075933 beige|0.059503 corn|0.057402 silk|0.057402 papaya|0.024231 whip|0.024231 dark|0.012357 sea|0.012357 green|0.012357 antique|0.011617 white|0.011617 ivory|0.011585 old|0.011048 lace|0.011048 blanched|0.0091268 almond|0.0091268 honeydew|0.0067081  "
		}
	}
}
