{
	"add": {
		"doc": {
			"id": "85163a74043094e573880f997ec8ccd67ee6dba86bc5b371b009178f5d3f1ec7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Amesbury_Ashfield.jpg/220px-Amesbury_Ashfield.jpg",
				"previous": "Selfe was a supportive brother, both emotionally and materially. His sister Maybanke bore seven children to her first husband Edmund, four of whom died as infants from tuberculosis.[7] He also provided financial support after Maybanke's marriage came to an end. Maybanke earned fame in her own right as a prominent suffragist and pioneer of education for women and girls. In the 1890s brother and sister campaigned together for education reform.[70]",
				"after": "On 10 October 1872 at St Mary's Church, Balmain Selfe married Emily Ann Booth, the daughter of John Booth, a well-known shipbuilder and Balmain's first mayor (and formerly the member for East Macquarie in the colonial parliament).[71] They lived for many years at Rockleigh in Donnelly Street, Balmain, in a house that has since been demolished. In 1884 their first daughter Rhoda Jane was born, followed by a stillborn daughter in 1886,[72] and then Norma Catherine in 1888.[73] In 1885 Selfe bought land in Ashfield and designed a grand house called Amesbury. Built around 1888 to honour the centenary of the colony, Amesbury still stands at 78 Alt Street, complete with terracotta lyrebird reliefs by artist Lucien Henry on the front wall, and a tower purpose-built for Selfe to pursue his hobby of astronomy.[74] It is now the headquarters of Brahma Kumaris in Australia.[75] As children, Rhoda and Norma attended their Aunt Maybanke's school in Dulwich Hill.[70] As adults, they trained in Italy with educator Maria Montessori and returned to Sydney to open a Montessori school of their own in the building knows as Warwick on Bland Street, Ashfield.[76]",
			"color": "black|0.35008 tan|0.19832 steel|0.19319 blue|0.19319 burly|0.039641 wood|0.039641 wheat|0.02803 dim|0.026108 gray|0.026108 dim|0.026108 grey|0.026108 gray|0.022314 grey|0.022314 dark|0.020872 gray|0.020872 dark|0.020872 grey|0.020872 peach|0.018341 puff|0.018341 bisque|0.015477 antique|0.011935 white|0.011935 blanched|0.0094214 almond|0.0094214  "
		}
	}
}
