{
	"add": {
		"doc": {
			"id": "8516b1e3c59aef241e88d53f1a6875889b6fe78bb09072446d5236d21903ebf3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/A321_final_assembly_%289351765668%29.jpg/220px-A321_final_assembly_%289351765668%29.jpg",
				"previous": "On 26 June 1988, a chartered Air France Airbus A320-111 (F-GFKC)[43] crashed into trees at the end of runway at Mulhouse-Habsheim Airport. Three out of 130 passengers were killed.[43] In February 1990 another A320, flown by Indian Airlines, crashed landed short of the airport runway in Bangalore. The ensuing fire contributed to the casualty count of ninety-two, out of 146 on board.[44] The press and media later questioned the fly-by-wire flight control system.[43] Subsequent investigations by commission of inquiry found \"no malfunction of the aircraft or its equipment which could have contributed towards a reduction in safety or an increase in the crew's workload during the final flight phase ... the response of the engines was normal and in compliance with certification requirement\" .[43]",
				"after": "In 2009, Airbus required about eight months to build one A320.[45] Components from various Airbus plants are transported to the final assembly plant at Hamburg Finkenwerder for the A318/A319/A320/A321[46] and to Toulouse Blagnac for the A320. Nearly all assemblies are moved using Airbus' A300-600ST Beluga outsized transporters. Airbus A320s sold to Chinese airlines scheduled for delivery between 2009 and 2012 are being assembled in Tianjin, China.[47]",
			"color": "gray|0.26253 grey|0.26253 dim|0.22157 gray|0.22157 dim|0.22157 grey|0.22157 dark|0.1387 gray|0.1387 dark|0.1387 grey|0.1387 black|0.11928 silver|0.032873 light|0.023256 gray|0.023256 light|0.023256 grey|0.023256 slate|0.021521 gray|0.021521 light|0.020774 slate|0.020774 gray|0.020774 gainsboro|0.018698 white|0.010355 smoke|0.010355 alice|0.0097132 blue|0.0097132 ghost|0.0094886 white|0.0094886 dark|0.0091808 slate|0.0091808 gray|0.0091808 snow|0.0082909 lavender|0.0081619 blush|0.0081619 light|0.0081442 steel|0.0081442 blue|0.0081442 white|0.0074853 lavender|0.0070567 sea|0.006814 shell|0.006814 azure|0.006706 mint|0.0063682 cream|0.0063682  "
		}
	}
}
