{
	"add": {
		"doc": {
			"id": "85332ba79b7242e486f1bb6797c5e8e94f1e72f7c3dcc642712be97a5a4842e5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Hoover_Dam_star_map_floor_center.jpg/220px-Hoover_Dam_star_map_floor_center.jpg",
				"previous": "Complementing Kaufmann and True's work, the Norwegian-born, naturalized American sculptor Oskar J.W. Hansen designed many of the sculptures on and around the dam. His works include the monument of dedication plaza, a plaque to memorialize the workers killed and the bas-reliefs on the elevator towers. In his words, Hansen wanted his work to express \"the immutable calm of intellectual resolution, and the enormous power of trained physical strength, equally enthroned in placid triumph of scientific accomplishment\", because \"[t]he building of Hoover Dam belongs to the sagas of the daring.\"[69] Hansen's dedication plaza, on the Nevada abutment, contains a sculpture of two winged figures flanking a flagpole.",
				"after": "Surrounding the base of the monument is a terrazzo floor embedded with a \"star map\". The map depicts the Northern Hemisphere sky at the moment of President Roosevelt's dedication of the dam. This is intended to help future astronomers, if necessary, calculate the exact date of dedication.[69][82] The 30 feet (9.1 m) high bronze figures, dubbed \"Winged Figures of the Republic\", were each formed in a continuous pour. To put such large bronzes into place without marring the highly polished bronze surface, they were placed on ice and guided into position as the ice melted.[83] Hansen's bas-relief on the Nevada elevator tower depicts the benefits of the dam: flood control, navigation, irrigation, water storage, and power. The bas-relief on the Arizona elevator depicts, in his words, \"the visages of those Indian tribes who have inhabited mountains and plains from ages distant.\"[69]",
			"color": "gray|0.32717 grey|0.32717 dim|0.31762 gray|0.31762 dim|0.31762 grey|0.31762 dark|0.13221 gray|0.13221 dark|0.13221 grey|0.13221 tan|0.046495 silver|0.028801 wheat|0.021828 burly|0.021052 wood|0.021052 slate|0.010466 gray|0.010466 light|0.010102 gray|0.010102 light|0.010102 grey|0.010102 antique|0.0084304 white|0.0084304 gainsboro|0.0073538 bisque|0.007016 navajo|0.0065602 white|0.0065602 moccasin|0.0058922 light|0.0057167 slate|0.0057167 gray|0.0057167 peach|0.0051593 puff|0.0051593 linen|0.0051114 old|0.003878 lace|0.003878 blanched|0.0034354 almond|0.0034354 sea|0.0034299 shell|0.0034299 floral|0.00304 white|0.00304 white|0.0028827 smoke|0.0028827  "
		}
	}
}
