{
	"add": {
		"doc": {
			"id": "853dfcbdd3bd5bc2465ad9e6a47b2e6ab8e83bad221e1529e0d4779f15b2a125",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Cargolux_747-8F_N5573S_over_Fresno.jpg/220px-Cargolux_747-8F_N5573S_over_Fresno.jpg",
				"previous": "On April 19, 2010, the second flight-test aircraft was moved from Moses Lake to Palmdale to conduct tests on the aircraft's engines in preparation for obtaining a type certification for the aircraft. The remaining aircraft in the test fleet are scheduled to be moved to Palmdale during May.[49] It was reported on June 3, 2010, that an engine on the second 747-8F was struck by a tug during a ground move. The engine cowling was damaged, but there was no damage to the engine itself. After repairs the aircraft is to perform fuel efficiency testing.[50] It was announced on June 14, 2010, that the 747-8 had completed the initial phase of flight-worthiness testing and that the FAA had given Boeing an expanded type inspection authorization for the aircraft.[51]",
				"after": "By the end of June 2010, the three 747-8Fs that composed the flight-test program had flown a total of over 500 hours and had completed hot-weather testing in Arizona.[52] In June 2010, Boeing determined that a fourth −8F aircraft was needed to help complete flight testing. It was decided to use the second production aircraft, RC503, to conduct the non-instrumented or minimally-instrumented tests, such as HIRF and Water Spray Certifications.[53][54] The aircraft, painted in delivery customer Cargolux's new livery, first flew on July 23, 2010.[55]",
			"color": "dark|0.22206 gray|0.22206 dark|0.22206 grey|0.22206 gray|0.13669 grey|0.13669 light|0.10827 steel|0.10827 blue|0.10827 dim|0.069955 gray|0.069955 dim|0.069955 grey|0.069955 light|0.049233 slate|0.049233 gray|0.049233 light|0.031584 sky|0.031584 blue|0.031584 lavender|0.026539 silver|0.023758 slate|0.022477 gray|0.022477 light|0.019238 gray|0.019238 light|0.019238 grey|0.019238 gainsboro|0.018527 alice|0.017642 blue|0.017642 white|0.016562 smoke|0.016562 light|0.01582 blue|0.01582  "
		}
	}
}
