{
	"add": {
		"doc": {
			"id": "854677934a2c6a7535ece8eadb11886701393a8e70bc46edaf3762e7784fb26c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Banksia_attenuata_tree.JPG/220px-Banksia_attenuata_tree.JPG",
			"previous": [],
				"after": "Banksia attenuata is generally encountered as a tree up to 10 m (35 ft) tall. In the north of its range as the climate becomes warmer and dryer, it is often a stunted multistemmed shrub 0.4 to 2 m (1–7 ft) tall. Both forms occur in the vicinity of Hill River but there is otherwise a marked demarcation.[2] In the Wheatbelt and east of the Stirling Range, it is a stunted tree. Tree forms have a solid trunk, generally wavy or bent, with 1–2 cm (0.4–0.8 in) thick crumbly orange-grey bark which is a red-brown underneath.[3] It regenerates from fire via lignotuber or epicormic buds from its fire-tolerant trunk. It has long narrow shiny green linear leaves 4 to 27 cm (1.6–11 in) long and 0.5 to 1.6 cm (0.2–0.7 in) wide.[4][5] The leaf margins have v- or u-shaped serrations along their length. The new growth is a pale grey-green, and occurs mainly in the late spring and summer,[6] often after flowering. The brilliant yellow inflorescences (flower spikes) occur from spring into summer and are up 5 cm (2 in) wide and up to 25–30 cm (10–12 in) tall.[3] They are made up of many small individual flowers; a study at Mount Adams 330 km (200 mi) north of Perth revealed a count of 1933 (± a standard error of 88) flowers per inflorescence,[7] and another in the Fitzgerald River National Park yielded a count of 1720 (± 76) flowers. Anthesis proceeds up the flower spike over about 10 to 20 days, and is asynchronous. That is, a plant produces flower spikes over a several week period and will thus have spikes at different stages of development over the flowering season.[8] Often bright green in bud stage,[9] they are terminal, occurring at the ends of one- to three-year-old branches, and displayed prominently above the foliage.[3] The smell of the open flowers has been likened to a peppery Shiraz wine.[9] Over time, the spikes fade to brown and then grey,[4] and the individual flowers shrivel and lie against the spikes. This coincides with the development of dark furry oval follicles, which measure 2–3.5 cm (0.8–1.4 in) long, 1–1.5 cm (0.4–0.6 in) high, and 1.4–2 cm (0.5–0.8 in) wide.[3] However, only a very small percentage (0.1%) of flowers develop into follicles; the field study at Mount Adams yielded a count of 3.6 ± 1.2 per cone.[7] The follicles develop and mature over seven to eight months, from February to December, while seed development occurs over four months from September to December.[10]",
			"color": "dim|0.28539 gray|0.28539 dim|0.28539 grey|0.28539 gray|0.24229 grey|0.24229 dark|0.15172 gray|0.15172 dark|0.15172 grey|0.15172 silver|0.079795 light|0.052308 gray|0.052308 light|0.052308 grey|0.052308 gainsboro|0.040092 white|0.014972 smoke|0.014972 black|0.010907 alice|0.010686 blue|0.010686 ghost|0.010524 white|0.010524 snow|0.0098961 slate|0.0091158 gray|0.0091158 sea|0.0087576 shell|0.0087576 light|0.0085825 slate|0.0085825 gray|0.0085825 white|0.0083872 lavender|0.0079066 blush|0.0079066 mint|0.0077823 cream|0.0077823 azure|0.0074579  "
		}
	}
}
