{
	"add": {
		"doc": {
			"id": "8560ca2587d6c05f6e5b067b2a6dcefedbe35976d42dacc4123a0d2cf697c1ed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Baboon_eating_elephant_dung.jpg/220px-Baboon_eating_elephant_dung.jpg",
				"previous": "Because of their large size, elephants have a huge impact on their environments and are considered keystone species. Their habit of uprooting trees and undergrowth can transform savannah into grasslands; when they dig for water during drought, they create waterholes that can be used by other animals. They can enlarge waterholes when they bathe and wallow in them. At Mount Elgon, elephants excavate caves that are used by ungulates, hyraxes, bats, birds and insects.[93] Elephants are important seed dispersers; African forest elephants ingest and defecate seeds, with either no effect or a positive effect on germination. The seeds are typically dispersed in large amounts over great distances.[94] In Asian forests, large seeds require giant herbivores like elephants and rhinoceros for transport and dispersal. This ecological niche cannot be filled by the next largest herbivore, the tapir.[95] Because most of the food elephants eat goes undigested, their dung can provide food for other animals, such as dung beetles and monkeys.[93] Elephants can have a negative impact on ecosystems. At Murchison Falls National Park in Uganda, the overabundance of elephants has threatened several species of small birds that depend on woodlands. Their weight can compact the soil, which causes the rain to run off, leading to erosion.[89]",
				"after": "Elephants typically coexist peacefully with other herbivores, which will usually stay out of their way. Some aggressive interactions between elephants and rhinoceros have been recorded. At Aberdare National Park, Kenya, a rhino attacked an elephant calf and was killed by the other elephants in the group.[89] At Hluhluwe–Umfolozi Game Reserve, South Africa, introduced young orphan elephants went on a killing spree that claimed the lives of 36 rhinos during the 1990s, but ended with the introduction of older males.[96] The size of adult elephants makes them nearly invulnerable to predators,[14] though there are rare reports of adult elephants falling prey to tigers.[97] Calves may be preyed on by lions, spotted hyenas, and wild dogs in Africa[17] and tigers in Asia.[14] The lions of Savuti, Botswana, have adapted to hunting juvenile elephants during the dry season, and a pride of 30 lions has been recorded killing juvenile individuals between the ages of four and eleven years.[98] Elephants appear to distinguish between the growls of larger predators like tigers and smaller ones like leopards (which have not been recorded killing calves); the latter they react less fearfully and more aggressively to.[99] Elephants tend to have high numbers of parasites, particularly nematodes, compared to other herbivores. This is due to lower predation pressures that would otherwise kill off many of the individuals with significant parasite loads.[100]",
			"color": "dim|0.37876 gray|0.37876 dim|0.37876 grey|0.37876 gray|0.33249 grey|0.33249 dark|0.17727 gray|0.17727 dark|0.17727 grey|0.17727 silver|0.040784 rosy|0.01844 brown|0.01844 black|0.013508 light|0.011027 gray|0.011027 light|0.011027 grey|0.011027  "
		}
	}
}
