{
	"add": {
		"doc": {
			"id": "856e31f7b760cc5a9552e357e00ab04e825edac1ee901a1a620ec08ac8cc27c1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Tower_of_London_White_Tower.jpg/300px-Tower_of_London_White_Tower.jpg",
				"previous": "William sent an advance party to prepare the city for his entrance, to celebrate his victory and found a castle; in the words of William's biographer, William of Poitiers, \"certain fortifications were completed in the city against the restlessness of the huge and brutal populace. For he [William] realised that it was of the first importance to overawe the Londoners\".[53] At the time, London was the largest town in England; the foundation of Westminster Abbey and the old Palace of Westminster under Edward the Confessor had marked it as a centre of governance, and with a prosperous port it was important for the Normans to establish control over the settlement.[57] The other two castles in London – Baynard's Castle and Montfichet's Castle – were established at the same time.[61] The fortification that would later become known as the Tower of London was built onto the south-east corner of the Roman town walls, using them as prefabricated defences, with the River Thames providing additional protection from the south.[53] This earliest phase of the castle would have been enclosed by a ditch and defended by a timber palisade, and probably had accommodation suitable for William.[62]",
				"after": "Most of the early Norman castles were built from timber, but by the end of the 11th century a few, including the Tower of London, had been renovated or replaced with stone.[61] Work on the White Tower – which gives the whole castle its name –[12] is usually considered to have begun in 1078, however the exact date is uncertain. William made Gundulf, Bishop of Rochester, responsible for its construction, although it may not have been completed until after William's death in 1087.[12] The White Tower is the earliest stone keep in England, and was the strongest point of the early castle. It also contained grand accommodation for the king.[63] At the latest, it was probably finished by 1100 when Bishop Ranulf Flambard was imprisoned there.[19][nb 2] Flambard was loathed by the English for exacting harsh taxes. Although he is the first recorded prisoner held in the Tower, he was also the first person to escape from it, using a smuggled rope secreted in a butt of wine. He was held in luxury and permitted servants, but on 2 February 1101 he hosted a banquet for his captors. After plying them with drink, when no one was looking he lowered himself from a secluded chamber, and out of the Tower. The escape came as such a surprise that one contemporary chronicler accused the bishop of witchcraft.[65]",
			"color": "dark|0.12751 gray|0.12751 dark|0.12751 grey|0.12751 silver|0.1051 gray|0.097564 grey|0.097564 dim|0.091845 gray|0.091845 dim|0.091845 grey|0.091845 light|0.073762 gray|0.073762 light|0.073762 grey|0.073762 black|0.064327 gainsboro|0.054753 tan|0.038194 linen|0.033632 antique|0.030371 white|0.030371 sea|0.024866 shell|0.024866 dark|0.024773 olive|0.024773 green|0.024773 old|0.024055 lace|0.024055 floral|0.022745 white|0.022745 white|0.021526 smoke|0.021526 snow|0.015922 ivory|0.015261 beige|0.014973 mint|0.013448 cream|0.013448 white|0.012009 papaya|0.0097843 whip|0.0097843 misty|0.008964 rose|0.008964 lavender|0.008263 blush|0.008263 honeydew|0.0076925  "
		}
	}
}
