{
	"add": {
		"doc": {
			"id": "858465251486dbbcf01497491a846234d054cc03d6a0c8c05a91d1f270f4378a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/DSC02558_Bucky_%28T.rex_fossil%29%2C_Kelsey_%28Triceratops_fossil%29_and_Stan_%28T._rex_cast%29.jpg/220px-DSC02558_Bucky_%28T.rex_fossil%29%2C_Kelsey_%28Triceratops_fossil%29_and_Stan_%28T._rex_cast%29.jpg",
				"previous": "Sue Hendrickson, amateur paleontologist, discovered the most complete (approximately 85%) and largest Tyrannosaurus fossil skeleton known in the Hell Creek Formation near Faith, South Dakota, on August 12, 1990. This Tyrannosaurus, nicknamed \"Sue\" in her honor, was the object of a legal battle over its ownership. In 1997 this was settled in favor of Maurice Williams, the original land owner. The fossil collection was purchased by the Field Museum of Natural History at auction for USD 7.6 million, making it the most expensive dinosaur skeleton to date. From 1998 to 1999 Field Museum of Natural History preparators spent over 25,000 man-hours taking the rock off each of the bones.[164] The bones were then shipped off to New Jersey where the mount was made. The finished mount was then taken apart, and along with the bones, shipped back to Chicago for the final assembly. The mounted skeleton opened to the public on May 17, 2000 in the great hall (Stanley Field Hall) at the Field Museum of Natural History. A study of this specimen's fossilized bones showed that \"Sue\" reached full size at age 19 and died at age 28, the longest any tyrannosaur is known to have lived.[165] Early speculation that Sue may have died from a bite to the back of the head was not confirmed. Though subsequent study showed many pathologies in the skeleton, no bite marks were found.[166] Damage to the back of the skull may have been caused by post-mortem trampling. Recent speculation indicates that \"Sue\" may have died of starvation after contracting a parasitic infection from eating diseased meat; the resulting infection would have caused inflammation in the throat, ultimately leading \"Sue\" to starve because she could no longer swallow food. This hypothesis is substantiated by smooth-edged holes in her skull which are similar to those caused in modern-day birds that contract the same parasite.[167]",
				"after": "Another Tyrannosaurus, nicknamed \"Stan\", in honor of amateur paleontologist Stan Sacrison, was found in the Hell Creek Formation near Buffalo, South Dakota, in the spring of 1987. It was not collected until 1992, as it was mistakenly thought to be a Triceratops skeleton. Stan is 63% complete and is on display in the Black Hills Institute of Geological Research in Hill City, South Dakota, after an extensive world tour during 1995 and 1996.[35] This tyrannosaur, too, was found to have many bone pathologies, including broken and healed ribs, a broken (and healed) neck and a spectacular hole in the back of its head, about the size of a Tyrannosaurus tooth.[168]",
			"color": "dark|0.16443 slate|0.16443 blue|0.16443 midnight|0.083619 blue|0.083619 slate|0.077605 blue|0.077605 black|0.061684 peru|0.053536 burly|0.044973 wood|0.044973 medium|0.042662 purple|0.042662 saddle|0.035658 brown|0.035658 navy|0.034767 royal|0.030127 blue|0.030127 rosy|0.0285 brown|0.0285 tan|0.028406 dark|0.026257 blue|0.026257 khaki|0.02121 sienna|0.018637 medium|0.018164 slate|0.018164 blue|0.018164 pale|0.017217 golden|0.017217 rod|0.017217 dark|0.016889 khaki|0.016889  "
		}
	}
}
