{
	"add": {
		"doc": {
			"id": "859a9a953918ebd3b65e76a0027d55b57a3d388809805a0a1cd51d7375f6d7d5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Brewers_Quay_Weymouth.jpg/220px-Brewers_Quay_Weymouth.jpg",
				"previous": "Weymouth Harbour is long and narrow, and formed the estuary of the River Wey until the building of a bridge to Westham, which separated the harbour's backwaters from Radipole Lake. For centuries the harbour was a passenger terminal and trade and cargo port: goods handled included wool and spices, and in the 20th century Weymouth was a bulk importer of fertiliser and cars. The old harbourside, on both sides of the seaward end of the harbour, still hosts a fishing fleet, with docks, unloading areas, and a cross-channel ferry terminal. Fishing and cargo trading employ fewer people in the area since their peak in earlier centuries, but local fishermen catch the largest mass of fish in England and the third largest in the United Kingdom.[57] The inner harbour has been refurbished in two phases, in 1994–1996 and in 2002, to include a new marina with hundreds of berths for pleasure boats, cruisers and sailing boats.[57] Local boats offer fishing and diving trips, pleasure cruises along the Jurassic Coast, and thrill-rides to the Isle of Portland.[66]",
				"after": "The main shopping centre in the area is in Melcombe Regis, consisting of two pedestrianised streets (St. Thomas's and St. Mary's Street), shops along the esplanade, and a new precinct stretching from St. Thomas's Street to the harbourside, built in the 1990s. There are shops and restaurants in the pedestrianised Hope Square and Brewers Quay, which are linked to the town centre by town bridge and a small passenger ferry service across the harbour.[9] In 2005 the town centre had 292 shops and 37,500 square metres (404,000 sq ft) of floorspace, and there was 0.4 square kilometres (100 acres) of industrial estate in the area.[1] The shopping catchment area, which extends for approximately 3 miles towards the north and seven miles east and west, has a population of 71,700 (mid-2001).[1] Weymouth, Portland and Chickerell have been a Fairtrade Zone since 2007.[67] Fashion company New Look has its global headquarters in Weymouth, and until 2005 the company's regional distribution centre was based at the same site.[68] Plans were approved in 2007 to develop the New Look site to include new headquarters, retail warehouses and industrial units, a hotel, fire station, and a medical centre with ambulance station.[69]",
			"color": "black|0.31275 steel|0.15897 blue|0.15897 dim|0.12465 gray|0.12465 dim|0.12465 grey|0.12465 sienna|0.09491 slate|0.061558 gray|0.061558 gray|0.057415 grey|0.057415 light|0.051291 slate|0.051291 gray|0.051291 saddle|0.051143 brown|0.051143 dark|0.023829 slate|0.023829 gray|0.023829 dark|0.023667 gray|0.023667 dark|0.023667 grey|0.023667 light|0.015832 steel|0.015832 blue|0.015832  "
		}
	}
}
