{
	"add": {
		"doc": {
			"id": "85a2cb1f63e5cbef7a10f1a1f6dbf7171c4aeba24aa5aee1bbadb6a89bb726a7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Inside_the_Millennium_Stadium%2C_Cardiff.jpg/220px-Inside_the_Millennium_Stadium%2C_Cardiff.jpg",
				"previous": "A 2003 poll found that football is the most popular sport in the United Kingdom.[485] England is recognised by FIFA as the birthplace of club football, and The Football Association is the oldest of its kind, with the rules of football first drafted in 1863 by Ebenezer Cobb Morley.[486][487] Each of the Home Nations has its own football association, national team and league system. The English top division, the Premier League, is the most watched football league in the world.[488] The first-ever international football match was contested by England and Scotland on 30 November 1872.[489] England, Scotland, Wales and Northern Ireland compete as separate countries in international competitions.[490] A Great Britain Olympic football team was assembled for the first time to compete in the London 2012 Olympic Games. However, the Scottish, Welsh and Northern Irish football associations declined to participate, fearing that it would undermine their independent status – a fear confirmed by FIFA president Sepp Blatter.[491]",
				"after": "In 2003, rugby union was ranked the second most popular sport in the UK.[485] The sport was created in Rugby School, Warwickshire, and the first rugby international took place on 27 March 1871 between England and Scotland.[492][493] England, Scotland, Wales, Ireland, France and Italy compete in the Six Nations Championship; the premier international tournament in the northern hemisphere. Sport governing bodies in England, Scotland, Wales and Ireland organise and regulate the game separately.[494] If any of the British teams or the Irish team beat the other three in a tournament, then it is awarded the Triple Crown.[495]",
			"color": "olive|0.19075 drab|0.19075 dim|0.13282 gray|0.13282 dim|0.13282 grey|0.13282 dark|0.12913 slate|0.12913 gray|0.12913 olive|0.092932 gray|0.082915 grey|0.082915 black|0.072196 dark|0.069217 gray|0.069217 dark|0.069217 grey|0.069217 silver|0.03332 light|0.019285 gray|0.019285 light|0.019285 grey|0.019285 dark|0.018769 olive|0.018769 green|0.018769 golden|0.01653 rod|0.01653 slate|0.015683 gray|0.015683 gainsboro|0.013766 rosy|0.013668 brown|0.013668 light|0.013405 slate|0.013405 gray|0.013405  "
		}
	}
}
