{
	"add": {
		"doc": {
			"id": "85a6f45be41b8eab9cf174c1f00fc8a36d76f326c77d83edc6d50bb9fb74c442",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/T._rex_infection.png/220px-T._rex_infection.png",
			"previous": [],
				"after": "In 2001, Bruce Rothschild and others published a study examining evidence for stress fractures and tendon avulsions in theropod dinosaurs and the implications for their behavior. Since stress fractures are caused by repeated trauma rather than singular events they are more likely to be caused by regular behavior than other types of injuries. Of the 81 Tyrannosaurus foot bones examined in the study one was found to have a stress fracture, while none of the 10 hand bones were found to have stress fractures. The researchers found tendon avulsions only among Tyrannosaurus and Allosaurus. An avulsion injury left a divot on the humerus of Sue the T. rex, apparently located at the origin of the deltoid or teres major muscles. The presence of avulsion injuries being limited to the forelimb and shoulder in both Tyrannosaurus and Allosaurus suggests that theropods may have had a musculature more complex and functionally different from those of birds. The researchers concluded that Sue's tendon avulsion was probably obtained from struggling prey. The presence of stress fractures and tendon avulsions in general provide evidence for a \"very active\" predation-based diet rather than obligate scavenging.[149]",
			"color": "burly|0.076251 wood|0.076251 sandy|0.064378 brown|0.064378 linen|0.05274 navajo|0.05151 white|0.05151 antique|0.049285 white|0.049285 sienna|0.041447 old|0.040859 lace|0.040859 peach|0.039435 puff|0.039435 gainsboro|0.036977 sea|0.03637 shell|0.03637 wheat|0.035229 light|0.032626 gray|0.032626 light|0.032626 grey|0.032626 dark|0.032625 salmon|0.032625 moccasin|0.031622 floral|0.031614 white|0.031614 tan|0.029721 white|0.027817 smoke|0.027817 bisque|0.026705 ivory|0.025517 snow|0.02292 coral|0.019165 blanched|0.018159 almond|0.018159 mint|0.017464 cream|0.017464 papaya|0.016749 whip|0.016749 light|0.015683 salmon|0.015683 white|0.015154 misty|0.013742 rose|0.013742 beige|0.013369 corn|0.010481 silk|0.010481 silver|0.0089363 rosy|0.0081208 brown|0.0081208 peru|0.0069839 honeydew|0.0060827 lavender|0.0052264 blush|0.0052264 light|0.0041212 yellow|0.0041212  "
		}
	}
}
