{
	"add": {
		"doc": {
			"id": "85b8c7fe25c39fd000f640465efeb85efb5206787fd726d489619f99c4814017",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/3/35/Panavision3.jpg/400px-Panavision3.jpg",
				"previous": "Another innovation of the era secured Panavision's leading position: the Auto Panatar camera lens for 35 mm anamorphic productions.[3] Early CinemaScope camera lenses were notoriously problematic in close-ups with an optical aberration that was commonly known as \"the mumps\": a widening of the face due to a loss of anamorphic power as a subject approaches the lens.[3] Because of the novelty of the new anamorphic process, early CinemaScope productions compensated for this aberration by avoiding tightly framed shots. As the anamorphic process became more popular, it became more problematic. Panavision invented a solution: adding a rotating lens element that moved in mechanical sync with the focus ring. This eliminated the distortion and allowed for natural close-up anamorphic photography. The Auto Panatar, released in 1958, was rapidly adopted, eventually making CinemaScope lenses obsolete. This innovation earned Panavision the first of its 15 Academy Awards for technical achievement.[3] Soon the screen credit \"Filmed in Panavision\" (as if Panavision itself were a widescreen format) began appearing on motion picture screen credits.",
				"after": "Since 1954, Panavision had been working on a new widescreen process commissioned by MGM.[16] The resulting system used a 65 mm film camera in conjunction with the APO Panatar lens, which was an integrated anamorphic lens (as opposed to a standard prime lens with an anamorphoser mounted on it). This created a 1.25x anamorphic squeeze factor.[17] Movies using the process had an astounding potential aspect ratio of 2.76:1 when exhibited with 70 mm anamorphic projection prints. Introduced as MGM Camera 65, the system was used on just a few films, the first of which was Raintree County (1956).[16] However, the film was released only in 35 mm anamorphic prints because the circuit of 70 mm theaters was booked with Around the World in Eighty Days (1956), shot with the competing, nonanamorphic Todd-AO system. In January 1959, the posters for the 70 mm release of Disney's Sleeping Beauty carried the notation \"Process lenses by Panavision\" next to the Super Technirama 70 logo. The first film to be presented in 70 mm anamorphic—Ben-Hur—was released by MGM in 1959 under the trade name MGM Camera 65.[16] Panavision also developed a nonanamorphic widescreen process called Super Panavision 70, which was essentially identical to Todd-AO. Super Panavision made its screen debut in 1959 with The Big Fisherman, released by Disney's Buena Vista division.",
			"color": "corn|0.49103 flower|0.49103 blue|0.49103 steel|0.13784 blue|0.13784 dodger|0.063445 blue|0.063445 black|0.051481 chocolate|0.032944 sienna|0.014788 dark|0.014776 salmon|0.014776 thistle|0.014147 saddle|0.013728 brown|0.013728 rosy|0.012358 brown|0.012358 peru|0.01078 royal|0.00983 blue|0.00983 golden|0.0077703 rod|0.0077703 sandy|0.0070303 brown|0.0070303  "
		}
	}
}
