{
	"add": {
		"doc": {
			"id": "85c5262d9fbe3de81c6a2227ded2c9be2c9ffe397480f68979c1b24f6ac0e477",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Cardiff_Castle_clock_tower.jpg/250px-Cardiff_Castle_clock_tower.jpg",
				"previous": "As the castle was developed, work continued with alterations to Holland's Georgian range, including his Bute Tower, and to the medieval Herbert and Beauchamp Towers, and the construction of the Guest Tower and the Octagonal Tower.[75] In plan, the castle broadly follows the arrangement of a standard Victorian stately home. The Bute Tower includes Lord Bute's bedroom and ends in another highlight, the Roof Garden, with a sculpture of the Madonna by Fucigna. Bute's bedroom has much religious iconography and a mirrored ceiling. The Marquess's name, John, is repeated in Greek, ΙΩΑИΣ, along the ceiling beams.[80] The Octagon Tower followed, including the oratory, built on the spot where Bute's father died, and the Chaucer Room, the roof of which Mark Girouard cites as \"a superb ... example of Burges's genius in the construction of roofs.\"[81] The Guest Tower contains the site of the original kitchen at its base and above, the Nursery, decorated with painted tiles depicting Aesop's Fables and characters from nursery rhymes.[75]",
				"after": "The central block of the castle comprises the two storey banqueting hall, with the library below. Both are enormous, the former to act as a suitable reception hall where the Marquess could fulfil his civic duties, the latter to hold part of his vast library. Both include elaborate carvings and fireplaces, those in the banqueting hall depicting the castle itself in the time of Robert, Duke of Normandy, who was imprisoned there in 1126–1134.[82] The fireplace in the library contains five figures, four representing the Greek, Egyptian, Hebrew and Assyrian alphabets, while the fifth is said to represent Bute as a Celtic monk.[83] The figures refer to the purpose of the room and to the Marquess, a noted linguist. The decoration of these large rooms is less successful than in the smaller chambers; much was completed after Burges's death and Girouard considers that the muralist, Lonsdale, \"was required to cover areas rather greater than his talents deserved.\"[81] The central portion of the castle also included the Grand Staircase. Illustrated in a watercolour perspective prepared by Axel Haig,[84] the staircase was long thought never to have been built but recent research has shown that it was constructed, only to be torn out in the 1930s,[75] reputedly after the third Marchioness had \"once slipped on its polished surface.\"[85] The Arab Room in the Herbert Tower was the last room on which Burges was working when he fell ill in 1881. Bute placed Burges's initials, together with his own and the date, in the fireplace of that room as a memorial.[86] The room was completed by Burges's brother-in-law, Richard Popplewell Pullan.[58]",
			"color": "black|0.57768 gray|0.097841 grey|0.097841 dim|0.093615 gray|0.093615 dim|0.093615 grey|0.093615 dark|0.046875 gray|0.046875 dark|0.046875 grey|0.046875 silver|0.021177 tan|0.018259 light|0.016363 gray|0.016363 light|0.016363 grey|0.016363 gainsboro|0.013247  "
		}
	}
}
