{
	"add": {
		"doc": {
			"id": "85f16e2a3944ea148087498a899f29d1392cab8fb80bb7e9ad8f1fdf91059992",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Haliaeetus_leucocephalus_MWNH_0839.JPG/220px-Haliaeetus_leucocephalus_MWNH_0839.JPG",
			"previous": [],
				"after": "Compared to most other raptors which mostly nest in April or May, bald eagles are early breeders: nest building or reinforcing is often by mid-February, egg laying is often late February (sometimes during deep snow in the North), and incubation is usually mid-March and early May. Eggs hatch from mid April to early May, and the young fledge late June to early July.[7] The nest is the largest of any bird in North America; it is used repeatedly over many years and with new material added each year may eventually be as large as 4 m (13 ft) deep, 2.5 m (8.2 ft) across and weigh 1 metric ton (1.1 short tons);[2] one nest in Florida was found to be 6.1 m (20 ft) deep, 2.9 meters (9.5 ft) across, and to weigh 3 short tons (2.7 metric tons).[91] This nest is on record as the largest tree nest ever recorded for any animal.[92] Usually nests are used for under five years or so, as they either collapse in storms or break the branches supporting them by their sheer weight. However, one nest in the Midwest was occupied continuously for at least 34 years.[30] The nest is built out of branches, usually in large trees found near water. When breeding where there are no trees, the bald eagle will nest on the ground, as has been recorded largely in areas largely isolated from terrestrial predators, such as Amchitka Island in Alaska.[83] In Sonora, Mexico, eagles have been observed nesting on top of Hecho catcuses (Pachycereus pectinaboriginum).[93] Nests located on cliffs and rock pinnacles have been reported historically in California, Kansas, Nevada, New Mexico and Utah, but currently are only verified to occur only in Alaska and Arizona.[7] The eggs average about 73 mm (2.9 in) long, ranging from 58 to 85 mm (2.3 to 3.3 in), and have a breadth of 54 mm (2.1 in), ranging from 47 to 63 cm (19 to 25 in).[38][42] Eggs in Alaska averaged 130 g (4.6 oz) in mass, while in Saskatchewan they averaged 114.4 g (4.04 oz).[94][95] As with their ultimate body size, egg size tends to increase further away from the Equator.[42] Eagles produce between one and three eggs per year, two being typical. Rarely, four eggs have been found in nests but these may be exceptional cases of polygyny.[96] Eagles in captivity have been capable of producing up to seven eggs.[97] it is rare for all three chicks to successfully reach the fledging stage. The oldest chick often bear the advantage of larger size and louder voice, which tends to draw the parents attention towards them.[7] Occasionally, as is recorded in many large raptorial birds, the oldest sibling sometimes attacks and kills their younger sibling(s), especially early in the nesting period when their sizes are most different.[7] However, nearly half of known bald eagle produce two fledgings (more rarely three), unlike in some other \"eagle\" species such as some in the Aquila genus, in which a second fledging is typically observed in less than 20% of nests despite two eggs being typically laid.[14] Both the male and female take turns incubating the eggs, but the female does most of the incubation. The parent not incubating will hunt for food or look for nesting material during this stage. For the first two to three weeks of the nestling period at least one adult is at the nest almost 100% of the time. After five to six weeks, the attendance of parents usually drops off considerably (with the parents often perching in trees nearby).[7] A young eaglet can gain up to 170 g (6.0 oz) a day, the fastest growth rate of any North American bird.[30] The young eaglets pick up and manipulate sticks, play tug of war with each other, practice holding things in their talons, and stretch and flap their wings. By eight weeks, the eaglets are strong enough to flap their wings, lift their feet off the nest platform, and rise up in the air.[30] The young fledge at anywhere from 8 to 14 weeks of age, though will remain close to the nest and attended to by their parents for a further 6 weeks. Juvenile eagles first start dispersing away from their parents about 8 weeks after they fledge. Variability in departure date related to effects of sex and hatching order on growth and development.[95] For the next four years, immature eagles wander widely in search of food until they attain adult plumage and are eligible to reproduce.[98]",
			"color": "blanched|0.11512 almond|0.11512 beige|0.10647 papaya|0.10151 whip|0.10151 antique|0.094895 white|0.094895 corn|0.09063 silk|0.09063 light|0.085753 golden|0.085753 rod|0.085753 yellow|0.085753 tan|0.075681 light|0.074473 yellow|0.074473 lemon|0.058886 chiffon|0.058886 old|0.048703 lace|0.048703 wheat|0.046175 bisque|0.045009 ivory|0.026879 honeydew|0.0070538  "
		}
	}
}
