{
	"add": {
		"doc": {
			"id": "860085e5ebfa8da60fe40ef7117c986b9dacb649adadbbee0a1082700eedf776",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Biman_Bangladesh_Airlines_Boeing_777-300ER_S2-AFO_DAC_2011-11-8.png/220px-Biman_Bangladesh_Airlines_Boeing_777-300ER_S2-AFO_DAC_2011-11-8.png",
			"previous": [],
				"after": "Although Philippine Airlines (PAL) was officially founded on February 26, 1941, its license to operate as an airliner was derived from merged Philippine Aerial Taxi Company (PATCO) established by mining magnate Emmanuel N. Bachrach on December 3, 1930, making it Asia's oldest scheduled carrier still in operation.[30] Commercial air service commenced three weeks later from Manila to Baguio, making it Asia's first airline route. Bachrach's death in 1937 paved the way for its eventual merger with Philippine Airlines in March 1941 and made it Asia's oldest airline. It is also the oldest airline in Asia still operating under its current name.[31] Bachrach's majority share in PATCO was bought by beer magnate Andres R. Soriano in 1939 upon the advice of General Douglas MacArthur and later merged with newly formed Philippine Airlines with PAL as the surviving entity. Soriano has controlling interest in both airlines before the merger. PAL restarted service on March 15, 1941 with a single Beech Model 18 NPC-54 aircraft, which started its daily services between Manila (from Nielson Field) and Baguio, later to expand with larger aircraft such as the DC-3 and Vickers Viscount.",
			"color": "light|0.24605 gray|0.24605 light|0.24605 grey|0.24605 gainsboro|0.22081 silver|0.12183 dark|0.080571 gray|0.080571 dark|0.080571 grey|0.080571 gray|0.060952 grey|0.060952 dim|0.042586 gray|0.042586 dim|0.042586 grey|0.042586 tan|0.02787 black|0.018171 antique|0.01768 white|0.01768 linen|0.017086 old|0.014008 lace|0.014008 beige|0.012313 sea|0.012278 shell|0.012278 floral|0.011877 white|0.011877 dark|0.01135 slate|0.01135 gray|0.01135 ivory|0.011089  "
		}
	}
}
