{
	"add": {
		"doc": {
			"id": "86029210c6dd0b59059441d394a65208ef57549a21b0fa576e9902f3fa6b582d",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/56/Stripline_via_key.svg/35px-Stripline_via_key.svg.png",
				"previous": "Following the war, one important research avenue was trying to increase the design bandwidth of wide-band filters. The approach used at the time (and still in use today) was to start with a lumped element prototype filter and through various transformations arrive at the desired filter in a distributed element form. This approach appeared to be stuck at a minimum Q of five (see Band-pass filters below for an explanation of Q). In 1957, Leo Young at Stanford Research Institute published a method for designing filters which started with a distributed element prototype.[17] This prototype was based on quarter wave impedance transformers and was able to produce designs with bandwidths up to an octave, corresponding to a Q of about 1.3. Some of Young's procedures in that paper were empirical, but later,[18] exact solutions were published. Young's paper specifically addresses directly coupled cavity resonators, but the procedure can equally be applied to other directly coupled resonator types, such as those found in modern planar technologies and illustrated in this article. The capacitive gap filter (figure 8) and the parallel-coupled lines filter (figure 9) are examples of directly coupled resonators.[15]",
				"after": "The introduction of printed planar technologies greatly simplified the manufacture of many microwave components including filters, and microwave integrated circuits then became possible. It is not known when planar transmission lines originated, but experiments using them were recorded as early as in 1936.[19] The inventor of printed stripline, however, is known; this was Robert M. Barrett who published the idea in 1951.[20] This caught on rapidly, and Barrett's stripline soon had fierce commercial competition from rival planar formats, especially triplate and microstrip. The generic term stripline in modern usage usually refers to the form then known as triplate.[21]",
			"color": "gainsboro|0.14187 light|0.13851 gray|0.13851 light|0.13851 grey|0.13851 silver|0.093772 white|0.070426 smoke|0.070426 linen|0.056734 sea|0.050037 shell|0.050037 lavender|0.049319 blush|0.049319 alice|0.049287 blue|0.049287 ghost|0.04875 white|0.04875 snow|0.047441 tan|0.047247 burly|0.043911 wood|0.043911 white|0.040523 dark|0.029293 gray|0.029293 dark|0.029293 grey|0.029293 mint|0.02668 cream|0.02668 wheat|0.021872 navajo|0.011958 white|0.011958 light|0.008813 steel|0.008813 blue|0.008813 floral|0.0061439 white|0.0061439 azure|0.0058293  "
		}
	}
}
