{
	"add": {
		"doc": {
			"id": "860650f94621ceb45ac6f3685475c06bb9bb8cd8957742776882093ac05d41c7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Dra%C5%BEa_Mihailovi%C4%87_Monument_on_the_Ravna_Gora_%281992%29.jpg/220px-Dra%C5%BEa_Mihailovi%C4%87_Monument_on_the_Ravna_Gora_%281992%29.jpg",
				"previous": "In 1920, Mihailović married Jelica Branković; they had three children. One of his sons, Branko Mihailović, was a communist sympathizer and later supported the Partisans.[177] His daughter, Gordana Mihailović, also sided with the Partisans. She spent most of the war in Belgrade and, after the Partisans took the city, spoke on the radio to denounce her father as a traitor.[178] While Mihailović was in prison, his children did not come to see him, and only his wife visited him.[170] In 2005, Gordana Mihailović personally came to accept her father's posthumous award in the United States. Another son, Vojislav Mihailović, fought alongside his father and was killed in battle in May 1945.[179] His grandson, Vojislav Mihailović (born 1951, named after his uncle) is a Serbian politician, member of the Serbian Renewal Movement and later of the Serbian Democratic Renewal Movement. He was the mayor of Belgrade for one year, from 1999 to 2000 and ran unsuccessfully in the 2000 Yugoslav presidential elections.[180]",
				"after": "Historians vary in their assessments of Mihailović. Tomasevich suggests one main cause of his defeat was his failure to grow professionally, politically or ideologically as his responsibilities increased, rendering him unable to face both the exceptional circumstances of the war and the complex situation of the Chetniks.[181] Tomasevich also criticizes Mihailović's loss of the Allied support through Chetnik collaboration with the Axis, as well as his doctrine of \"passive resistance\" which was perceived as idleness, stating \"of generalship in the general there was precious little.\"[182] Pavlowitch also points to Mihailović's failure to grow and evolve during the conflict and describes him as a man \"generally out of his depth\".[183] Roberts asserts that Mihailović's policies were \"basically static\", that he \"gambled all in the faith of an Allied victory,\" and that ultimately he was unable to control the Chetniks, who, \"although hostile to the Germans and the Italians ... allowed themselves to drift into a policy of accommodations with both in the face of what they considered the greatest danger.\"[184]",
			"color": "dim|0.25815 gray|0.25815 dim|0.25815 grey|0.25815 gray|0.23836 grey|0.23836 rosy|0.16155 brown|0.16155 tan|0.12273 dark|0.06541 gray|0.06541 dark|0.06541 grey|0.06541  "
		}
	}
}
