{
	"add": {
		"doc": {
			"id": "860fcdea6e08de91687f2e1f5d80e614ab85ca864322fa2dc66a4723c829778f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Federico_Faggin_%28cropped%29.jpg/200px-Federico_Faggin_%28cropped%29.jpg",
				"previous": "At its founding, Intel was distinguished by its ability to make semiconductors. Its first product, in 1969, was the 3101 Schottky TTL bipolar 64-bit static random-access memory (SRAM), which was nearly twice as fast as earlier Schottky diode implementations by Fairchild and the Electrotechnical Laboratory in Tsukuba, Japan.[24][25] In the same year Intel also produced the 3301 Schottky bipolar 1024-bit read-only memory (ROM)[26] and the first commercial metal–oxide–semiconductor field-effect transistor (MOSFET) silicon gate SRAM chip, the 256-bit 1101.[18][27][28] Intel's business grew during the 1970s as it expanded and improved its manufacturing processes and produced a wider range of products, still dominated by various memory devices.",
				"after": "While Intel created the first commercially available microprocessor (Intel 4004) in 1971[18] and one of the first microcomputers in 1972,[27][29] by the early 1980s its business was dominated by dynamic random-access memory chips. However, increased competition from Japanese semiconductor manufacturers had, by 1983, dramatically reduced the profitability of this market. The growing success of the IBM personal computer, based on an Intel microprocessor, was among factors that convinced Gordon Moore (CEO since 1975) to shift the company's focus to microprocessors, and to change fundamental aspects of that business model. Moore's decision to sole-source Intel's 386 chip played into the company's continuing success.",
			"color": "silver|0.25174 light|0.17613 gray|0.17613 light|0.17613 grey|0.17613 dark|0.14818 gray|0.14818 dark|0.14818 grey|0.14818 dim|0.11755 gray|0.11755 dim|0.11755 grey|0.11755 gainsboro|0.098714 gray|0.064258 grey|0.064258 rosy|0.055129 brown|0.055129 steel|0.040783 blue|0.040783 black|0.016602  "
		}
	}
}
