{
	"add": {
		"doc": {
			"id": "86343d27e20f7462828dedd7a8edb9d1d7042dd1c7c8fe3c11ebb03c2620b307",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Cathedral_of_the_sacred_heart.JPG/220px-Cathedral_of_the_sacred_heart.JPG",
				"previous": "Richmond has several historic churches. Because of its early English colonial history from the early 17th century to 1776, Richmond has a number of prominent Anglican/Episcopal churches including Monumental Church, St. Paul's Episcopal Church and St. John's Episcopal Church. Methodists and Baptists made up another section of early churches, and First Baptist Church of Richmond was the first of these, established in 1780. In the Reformed church tradition, the first Presbyterian Church in the City of Richmond was First Presbyterian Church, organized on June 18, 1812. On February 5, 1845, Second Presbyterian Church of Richmond was founded, which was a historic church where Stonewall Jackson attended and was the first Gothic building and the first gas-lit church to be built in Richmond.[62] St. Peter's Church was dedicated and became the first Catholic church in Richmond on May 25, 1834.[63] The city is also home to the historic Cathedral of the Sacred Heart which is the motherchurch for the Roman Catholic Diocese of Richmond.[64]",
				"after": "The first Jewish congregation in Richmond was Kahal Kadosh Beth Shalom. Kahal Kadosh Beth Shalom was the sixth congregation in the United States. By 1822 K.K. Beth Shalom members worshipped in the first synagogue building in Virginia. They eventually merged with Congregation Beth Ahabah, an offshoot of Beth Shalom. There are two Orthodox Synagogues, Keneseth Beth Israel and Chabad of Virginia.[65] There is an Orthodox Yeshivah K–12 school system known as Rudlin Torah academy, which also includes a post high-school program. There are two Conservative synagogues, Beth El and Or Atid. There are two Reform synagogues, Beth Ahabah and Or Ami. Along with such religious congregations, there are a variety of other Jewish charitable, educational and social service institutions, each serving the Jewish and general communities. These include the Weinstein Jewish Community Center, Jewish Family Services, Jewish Community Federation of Richmond and Richmond Jewish Foundation.",
			"color": "gray|0.34649 grey|0.34649 dim|0.32234 gray|0.32234 dim|0.32234 grey|0.32234 black|0.082306 dark|0.080549 gray|0.080549 dark|0.080549 grey|0.080549 silver|0.042588 light|0.032509 gray|0.032509 light|0.032509 grey|0.032509 antique|0.019286 white|0.019286 gainsboro|0.017167 linen|0.0096653 misty|0.0074332 rose|0.0074332 rosy|0.0059391 brown|0.0059391 old|0.004754 lace|0.004754  "
		}
	}
}
