{
	"add": {
		"doc": {
			"id": "863e4d39ae5e8539fae1de78a59db82b87c768c486a26c47dba88a6b6ee7f0aa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Saab340.arp.600pix.jpg/220px-Saab340.arp.600pix.jpg",
				"previous": "In June 2006, a survey by market researchers islandopinion.com showed that Aurigny is the most popular airline which served Guernsey. On 21 June 2007, Aurigny got permission from its sole shareholder, the States of Guernsey, to raise a private loan to purchase two new ATR 72-500 aircraft which entered service in March 2009. Aurigny celebrated 40 years in operation in 2008. It was voted 4th best short-haul airline in a poll published in the consumer magazine Which?. In a survey of 30,000 members the magazine looked at 71 airlines and asked readers to rate each carrier for standards of check-in, cabin staff, cleanliness, food and entertainment.",
				"after": "March 2009 saw Aurigny announce that it was to operate a Jersey and London Stansted route, whilst restarting the Guernsey and East Midlands link. Daily flights commenced from 1 May 2009. The frequency of flights from Guernsey to London Gatwick was increased from 4 to 5 daily return flights that day. In August 2009, Aurigny announced that it would be operating winter flights to Grenoble using its ATR 72-500 equipment. The flights ran from 26 December 2009 to mid-way through February 2010. This was repeated for the 2010/2011 winter season, but flights were continued until March. The extension did not prove viable and the previous length of operation was restored for the 2011/2012 season.[7] Thanks to the change, it noted that demand was stronger due to a decreased period of availability.[8]",
			"color": "dim|0.21898 gray|0.21898 dim|0.21898 grey|0.21898 black|0.19324 dark|0.12414 gray|0.12414 dark|0.12414 grey|0.12414 gray|0.1172 grey|0.1172 silver|0.08938 light|0.051635 gray|0.051635 light|0.051635 grey|0.051635 gainsboro|0.035394 peru|0.030456 dark|0.025273 golden|0.025273 rod|0.025273 dark|0.012353 slate|0.012353 gray|0.012353 saddle|0.009584 brown|0.009584  "
		}
	}
}
