{
	"add": {
		"doc": {
			"id": "8645aaf9fc0a8de9163c2216be9ced42499c464f7b160b93974caabac73e5670",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Sukhoi_T-50_Maksimov.jpg/220px-Sukhoi_T-50_Maksimov.jpg",
				"previous": "Such aircraft are sophisticated and expensive. The U.S. Air Force originally planned to acquire 650 F-22s, but now only 187 will be built. As a result, its unit flyaway cost (FAC) is around US$150 million. To spread the development costs – and production base – more broadly, the Joint Strike Fighter (JSF) program enrolls eight other countries as cost- and risk-sharing partners. Altogether, the nine partner nations anticipate procuring over 3,000 Lockheed Martin F-35 Lightning II fighters at an anticipated average FAC of $80–85 million. The F-35, however, is designed to be a family of three aircraft, a conventional take-off and landing (CTOL) fighter, a short take-off and vertical landing (STOVL) fighter, and a Catapult Assisted Take Off But Arrested Recovery (CATOBAR) fighter, each of which has a different unit price and slightly varying specifications in terms of fuel capacity (and therefore range), size and payload.",
				"after": "Other countries have initiated fifth-generation fighter development projects, with Russia's Sukhoi PAK FA and Mikoyan LMFS. In October 2007, Russia and India signed an agreement for joint participation in a Fifth-Generation Fighter Aircraft Program (FGFA), which gives India responsibility for development of a two-seat model of the PAK-FA. India is also developing the Advanced Medium Combat Aircraft (AMCA). In December 2010, it was discovered that China is developing the 5th generation fighter Chengdu J-20.[22] The J-20 took its maiden flight in January 2011 and is planned to be deployed in 2017–19 time frame.[23] The Shenyang J-31 took its maiden flight on 31 October 2012.[24] Japan is exploring its technical feasibility to produce fifth-generation fighters.",
			"color": "dark|0.1616 gray|0.1616 dark|0.1616 grey|0.1616 silver|0.1274 black|0.12366 light|0.075251 gray|0.075251 light|0.075251 grey|0.075251 light|0.05816 slate|0.05816 gray|0.05816 gainsboro|0.053907 gray|0.046198 grey|0.046198 dim|0.041611 gray|0.041611 dim|0.041611 grey|0.041611 slate|0.040197 gray|0.040197 light|0.038065 steel|0.038065 blue|0.038065 white|0.02643 smoke|0.02643 alice|0.024763 blue|0.024763 ghost|0.021684 white|0.021684 snow|0.01881 lavender|0.017949 sea|0.017453 shell|0.017453 mint|0.017331 cream|0.017331 white|0.017233 azure|0.016912 floral|0.014295 white|0.014295 lavender|0.010254 blush|0.010254 dark|0.0098242 slate|0.0098242 gray|0.0098242 linen|0.0096668  "
		}
	}
}
