{
	"add": {
		"doc": {
			"id": "864ccd0013b67851328bf396a9dc7c3b54f9e58aa69c4badc1e2ec097049b59d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Money_for_sale.png/325px-Money_for_sale.png",
				"previous": "A number of proof coins were issued at the suggestion of Barber and Superintendent Bosbyshell. Ellsworth was enthusiastic, intending the special strikes as gifts, but was forced to share them with Company president Higinbotham, to Ellsworth's dismay.[29] The proof coins for the year 1892 represented the first hundred coins struck, as well as numbers 400, 1492, and 1892. The total number of proof coins struck for 1893 is less certain: R.S. Yeoman's A Guide Book of United States Coins states that approximately 100 proofs were struck for 1893,[30] but numismatist Ira Goldberg in a 2011 article gives the number as fewer than ten.[22] The first coin struck in the year 1893, in proof, is in the possession of the Chicago Historical Society.[31] The Mint gave consideration to including the Columbian half dollar in proof sets, but at the time it sold proof coins for only a few cents above face value, and it would have to sell the proof Columbians for more than $1 so as to avoid devaluing the uncirculated commemoratives. Mint authorities decided against a public sale of proof Columbians.[26]",
				"after": "With the New Year, the coins were dated 1893;[32] just over four million of the authorized mintage were struck with an 1893 date, with the remainder dated 1892.[33] A total of 5,002,105 Columbian half dollars were struck, with the excess over the authorized mintage designated for inspection by the annual Assay Commission.[26] By February 1893, sales had fallen off dramatically. The Exposition Company deposited 2,000,000 half dollars in Chicago banks as security for loans. In March, Congress impounded an additional 1,141,700 half dollars to cover costs advanced by the government, such as the expense of judging exhibits and providing medals to the exhibitors. The Company could redeem the half dollars if it agreed to fund that expense, which it refused to do, calling the government's action a breach of faith. In return, the Company stated it was no longer bound by a provision of the 1892 act, which forbade the fair from opening on Sundays.[12][34]",
			"color": " "
		}
	}
}
