{
	"add": {
		"doc": {
			"id": "865db99734f58c7f1b74ae077f0dcf32619767d6e5a761a2c2d85a8814dcfc12",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/German_GDP_in_tax_havens.png/220px-German_GDP_in_tax_havens.png",
			"previous": [],
				"after": "A tax haven is a state, country or territory where certain taxes are levied at a low rate or not at all, which are used by businesses for tax avoidance and tax evasion.[38] Individuals and/or corporate entities can find it attractive to move themselves to areas with reduced taxation. This creates a situation of tax competition among governments. Taxes vary substantially across jurisdictions.[39] Sovereign states have theoretically unlimited powers to enact tax laws affecting their territories, unless limited by previous international treaties. The central feature of a tax haven is that its laws and other measures can be used to evade or avoid the tax laws or regulations of other jurisdictions.[40] In its December 2008 report on the use of tax havens by American corporations,[41] the U.S. Government Accountability Office was unable to provide a satisfactory definition of a tax haven, but regarded the following characteristics as indicative of it: nil or nominal taxes; lack of effective exchange of tax information with foreign tax authorities; lack of transparency in the operation of legislative, legal or administrative provisions; no requirement for a substantive local presence; and self-promotion as an offshore financial center.",
			"color": "white|0.084299 smoke|0.084299 ghost|0.075948 white|0.075948 alice|0.075862 blue|0.075862 sea|0.075555 shell|0.075555 snow|0.075338 white|0.073928 lavender|0.072072 blush|0.072072 mint|0.071098 cream|0.071098 floral|0.067753 white|0.067753 azure|0.066699 light|0.057009 gray|0.057009 light|0.057009 grey|0.057009 gainsboro|0.05534 silver|0.049637 dark|0.043888 gray|0.043888 dark|0.043888 grey|0.043888 gray|0.020697 grey|0.020697 linen|0.012769 dim|0.010722 gray|0.010722 dim|0.010722 grey|0.010722 black|0.004377 ivory|0.0037858  "
		}
	}
}
