{
	"add": {
		"doc": {
			"id": "86601da8550415fe82e1755b13ef9efc40d2946f43b0f403440b344d036894dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Parasaurolophus_juvenile_skeleton.png/170px-Parasaurolophus_juvenile_skeleton.png",
			"previous": [],
				"after": "Parasaurolophus is known from many adult specimens, and a juvenile described in 2013. The juvenile was discovered in the Kaiparowits Formation in 2009. Excavated by the joint expedition by The Webb Schools and Raymond M. Alf Museum of Paleontology (RAM), the juvenile has been identified as around only one year old when it died. Referred to Parasaurolophus sp., the juvenile, under specimen number RAM 14000, is the most complete, as well as youngest Parasaurolophus ever found, and measures 2.5 m (8.2 ft). This individual fits neatly into the currently known Parasaurolophus growth stages, and lived approximately 75 million years ago. Even though no complete skull of the intermediate age between RAM 14000 and adult Parasaurolophus has been found yet, a partial braincase of about the right size is known. At 25% of the total adult size, the juvenile show that crest growth of Parasaurolophus began sooner than in related genera, such as Corythosaurus. It has been suggested that Parasaurolophus adults bore such large crests, especially when compared to the related Corythosaurus, because of this difference in age between when their crests started developing. Its age also means that Parasaurolophus had an very fast growth, which took place in about a year. The crest of the juvenile is not long and tubular like the adults, but low and hemispherical.[27]",
			"color": "dim|0.19279 gray|0.19279 dim|0.19279 grey|0.19279 gray|0.11722 grey|0.11722 light|0.11342 sky|0.11342 blue|0.11342 dark|0.06986 gray|0.06986 dark|0.06986 grey|0.06986 light|0.057937 gray|0.057937 light|0.057937 grey|0.057937 gainsboro|0.056302 white|0.039628 smoke|0.039628 alice|0.037178 blue|0.037178 ghost|0.036946 white|0.036946 lavender|0.036771 blush|0.036771 snow|0.036276 linen|0.035723 sea|0.035688 shell|0.035688 silver|0.031741 white|0.031507 sandy|0.016811 brown|0.016811 sky|0.012626 blue|0.012626 light|0.0072849 blue|0.0072849 tan|0.0066622 light|0.0045245 steel|0.0045245 blue|0.0045245  "
		}
	}
}
