{
	"add": {
		"doc": {
			"id": "8669407e3d47364031a8e4b7504590ba192f216b514897dcd3c49ccfa5ca707f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Christchurch_Art_Gallery_Te_Puna_o_Waiwhetu.jpg/170px-Christchurch_Art_Gallery_Te_Puna_o_Waiwhetu.jpg",
				"previous": "Rail services, both long-distance and commuter, used to focus on the former railway station on Moorhouse avenue. Commuter trains were progressively cancelled in the 1960s and 1970s. The last such service, between Christchurch and Rangiora, ceased in 1976. After the reduction in services a new Christchurch railway station was established at Addington Junction. The Main North Line railway travels northwards via Kaikoura to Picton and is served by the TranzCoastal passenger train, while the Main South Line heads to Invercargill via Dunedin and was used by the Southerner until its cancellation in 2002. The most famous train to depart Christchurch is the TranzAlpine, which travels along the Main South Line to Rolleston and then turns onto the Midland Line, passes through the Southern Alps via the Otira Tunnel, and terminates in Greymouth on the West Coast. This trip is often regarded as one of the ten great train journeys in the world for the amazing scenery through which it passes. The TranzAlpine service is primarily a tourist service and carries no significant commuter traffic.",
			"after": [],
			"color": "dim|0.18233 gray|0.18233 dim|0.18233 grey|0.18233 gray|0.095115 grey|0.095115 black|0.094585 dark|0.094453 gray|0.094453 dark|0.094453 grey|0.094453 tan|0.050224 slate|0.047458 gray|0.047458 silver|0.034534 light|0.033118 slate|0.033118 gray|0.033118 peach|0.019639 puff|0.019639 burly|0.018011 wood|0.018011 antique|0.017059 white|0.017059 bisque|0.015968 floral|0.015633 white|0.015633 wheat|0.015541 sea|0.014708 shell|0.014708 blanched|0.014006 almond|0.014006 white|0.012712 smoke|0.012712 snow|0.012692 papaya|0.012563 whip|0.012563 white|0.012278 mint|0.012187 cream|0.012187 linen|0.011603 old|0.011544 lace|0.011544 rosy|0.011426 brown|0.011426 ivory|0.011294 corn|0.0096747 silk|0.0096747 beige|0.0089854  "
		}
	}
}
