{
	"add": {
		"doc": {
			"id": "868f8a324be9ea99a9ac44478bf2ed975d9dd6d2487dd1df1a0603547370d9d6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Elephant_eating_Yala_Sri_Lanka.ogv/220px--Elephant_eating_Yala_Sri_Lanka.ogv.jpg",
			"previous": [],
				"after": "The African bush elephant can be found in habitats as diverse as dry savannahs, deserts, marshes, and lake shores, and in elevations from sea level to mountain areas above the snow line. Forest elephants mainly live in equatorial forests, but will enter gallery forests and ecotones between forests and savannahs.[21] Asian elephants prefer areas with a mix of grasses, low woody plants and trees, primarily inhabiting dry thorn-scrub forests in southern India and Sri Lanka and evergreen forests in Malaya.[14] Elephants are herbivorous and will eat leaves, twigs, fruit, bark, grass and roots.[21] They are born with sterile intestines, and require bacteria obtained from their mothers feces to digest vegetation.[88] African elephants are mostly browsers while Asian elephants are mainly grazers. They can consume as much as 150 kg (330 lb) of food and 40 L (11 US gal) of water in a day. Elephants tend to stay near water sources.[21] Major feeding bouts take place in the morning, afternoon and night. At midday, elephants rest under trees and may doze off while standing. Sleeping occurs at night while the animal is lying down.[77][89] Elephants average 3–4 hours of sleep per day.[90] Both males and family groups typically move 10–20 km (6–12 mi) a day, but distances as far as 90–180 km (56–112 mi) have been recorded in the Etosha region of Namibia.[91] Elephants go on seasonal migrations in search of food, water and mates. At Chobe National Park, Botswana, herds travel 325 km (202 mi) to visit the river when the local waterholes dry up.[92]",
			"color": "dark|0.27775 gray|0.27775 dark|0.27775 grey|0.27775 gray|0.20979 grey|0.20979 dim|0.20977 gray|0.20977 dim|0.20977 grey|0.20977 light|0.10153 slate|0.10153 gray|0.10153 slate|0.088491 gray|0.088491 silver|0.080904 light|0.021527 gray|0.021527 light|0.021527 grey|0.021527 gainsboro|0.0057342  "
		}
	}
}
