{
	"add": {
		"doc": {
			"id": "8690eaf1f49657b44a57e2f0da5704725f96dab20f32c41fc64463a5da1a2e86",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Malaysia_airlines_b747-400_specialcolours_arp.jpg/220px-Malaysia_airlines_b747-400_specialcolours_arp.jpg",
				"previous": "Malaysia Airlines is listed on the stock exchange of Bursa Malaysia under the name Malaysian Airline System Berhad. The airline suffered high losses over the years due to poor management and fuel price increases. As a result of financial restructuring (Widespread Asset Unbundling)[21] in 2002, led by BinaFikir, Penerbangan Malaysia Berhad became its parent company, incorporated in 2002, in exchange for assuming the airline's long-term liabilities. On the operational side, the Government of Malaysia appointed Idris Jala as the new CEO on 1 December 2005, to execute changes in operations and corporate culture. Under his leadership, Malaysia Airlines unveiled its Business Turnaround Plan (BTP) in February 2006, which identified low yield, an inefficient network and low productivity (overstaffing).",
				"after": "Following the Widespread Asset Unbundling (WAU) restructuring of Malaysia Airlines, Malaysian Government investment arm and holding company, Khazanah Nasional's subsidiary, Penerbangan Malaysia Berhad [51] is the majority shareholder with a 52.0% stake.[51] After Penerbangan Malaysia Berhad, the second-largest shareholder is Khazanah Nasional, which holds 17.33% of the shares. Minority shareholders include Employees Provident Fund Board (10.72%), Amanah Raya Nominees (Tempatan) Sdn Bhd (5.69%), State Financial Secretary Sarawak (2.71%), foreign shareholders (5.13%)[51] and Warisan Harta Sabah (2.4%). It has 19,546 employees (as of March 2007).[52] The Malaysian government reported that the government's holding company, Khazanah Nasional is keen on selling shares of Malaysia Airlines to remain globally competitive in an industry that is fast-consolidating.[53]",
			"color": "black|0.15341 firebrick|0.09216 dim|0.060351 gray|0.060351 dim|0.060351 grey|0.060351 brown|0.058554 gray|0.05768 grey|0.05768 indian|0.057377 red|0.057377 maroon|0.044763 dark|0.043463 gray|0.043463 dark|0.043463 grey|0.043463 rosy|0.040938 brown|0.040938 dark|0.040829 red|0.040829 silver|0.023966 antique|0.020263 white|0.020263 beige|0.019102 light|0.017092 gray|0.017092 light|0.017092 grey|0.017092 linen|0.01403 tan|0.01367 old|0.012981 lace|0.012981 dark|0.012456 salmon|0.012456 gainsboro|0.011608 papaya|0.011339 whip|0.011339 corn|0.0092786 silk|0.0092786 burly|0.0090205 wood|0.0090205 crimson|0.0083042 misty|0.008159 rose|0.008159 floral|0.0078161 white|0.0078161  "
		}
	}
}
