{
	"add": {
		"doc": {
			"id": "86aa1d61b1a0806d4df11ef8776d677fcfd5c6b39619ab35e8df6c9488ee8eba",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Indri_indri_001.jpg/170px-Indri_indri_001.jpg",
				"previous": "In Malagasy culture lemurs, and animals in general, have souls (ambiroa) which can get revenge if mocked while alive or if killed in a cruel fashion. Because of this, lemurs, like many other elements of daily life, have been a source of taboos, known locally as fady, which can be based around stories with four basic principles. A village or region may believe that a certain type of lemur may be the ancestor of the clan. They may also believe that a lemur's spirit may get revenge. Alternatively, the animal may appear as a benefactor. Lemurs are also thought to impart their qualities, good or bad, onto human babies.[164] In general, fady extend beyond a sense of the forbidden, but can include events that bring bad luck.[82]",
				"after": "One example of lemur fady told around 1970 comes from Ambatofinandrahana in the Fianarantsoa Province. According to the account, a man brought a lemur home in a trap, but alive. His children wanted to keep the lemur as a pet, but when the father told them it was not a domestic animal, the children asked to kill it. After the children tortured the lemur, it eventually died and was eaten. A short time later, all the children died of illness. As a result, the father declared that anyone who tortures lemurs for fun shall \"be destroyed and have no descendants.\"[164]",
			"color": "black|0.3291 dim|0.1048 gray|0.1048 dim|0.1048 grey|0.1048 dark|0.089293 gray|0.089293 dark|0.089293 grey|0.089293 dark|0.087942 olive|0.087942 green|0.087942 gray|0.079691 grey|0.079691 silver|0.045631 dark|0.045569 slate|0.045569 gray|0.045569 light|0.017543 gray|0.017543 light|0.017543 grey|0.017543 gainsboro|0.011038 slate|0.010506 gray|0.010506 mint|0.010466 cream|0.010466 white|0.010263 smoke|0.010263 floral|0.010227 white|0.010227 beige|0.010129 olive|0.009887 drab|0.009887 light|0.0092427 slate|0.0092427 gray|0.0092427 sea|0.0088056 shell|0.0088056 white|0.0087254 snow|0.0085206 azure|0.0080416 ivory|0.0080216 honeydew|0.0074222  "
		}
	}
}
