{
	"add": {
		"doc": {
			"id": "86c52021bc28fb10022d95a7706c63bbc5b39a841399eef88e0c494d697aa6f6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/C-123B_in_flight_over_US_1950s.jpg/220px-C-123B_in_flight_over_US_1950s.jpg",
				"previous": "The first recipients of C-123 aircraft were USAF transport units, soon followed by the United States Coast Guard (USCG) who used the aircraft for search and rescue missions, and even the U.S. Air Force Demonstration Team, the \"Thunderbirds,\" would use C-123s for a time as a logistics support aircraft for transporting the team's ground crews and equipment. The type would also be widely exported under various U.S. military assistance programs, directly from USAF stocks.",
				"after": "The aircraft was nearly ignored by the USAF for service in Vietnam, but a political rivalry with the U.S. Army and the Army's use of the CV-2 Caribou and later pre-production order for the de Havilland Canada C-8 Buffalo, led to a decision to deploy C-123s there. To compete with the well-performing CV-2, the USAF and Fairchild furthered development on the C-123 to allow it to do similar work on short runways. This additional development increased the utility of the aircraft and its variants to allow it to perform a number of unique tasks, including the HC-123B which operated with the USCG fitted with additional radar equipment for search and rescue missions through 1971, and the C-123J which were fitted with retractable skis for operations in Greenland and Alaska on compacted snow runways.",
			"color": "gray|0.2585 grey|0.2585 dark|0.22308 gray|0.22308 dark|0.22308 grey|0.22308 dim|0.15643 gray|0.15643 dim|0.15643 grey|0.15643 rosy|0.081669 brown|0.081669 silver|0.069486 light|0.043365 gray|0.043365 light|0.043365 grey|0.043365 gainsboro|0.029191 linen|0.016476 sea|0.013151 shell|0.013151 black|0.012594 white|0.012027 smoke|0.012027 floral|0.011584 white|0.011584 old|0.011301 lace|0.011301 snow|0.0098359 antique|0.0095598 white|0.0095598 ivory|0.0069902 white|0.0069684 mint|0.0068582 cream|0.0068582 misty|0.0057505 rose|0.0057505 lavender|0.0050948 blush|0.0050948  "
		}
	}
}
