{
	"add": {
		"doc": {
			"id": "86cad28a9bb6ec31c39fd329e3958413e160d548d36475a5601eeff551cc1537",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Henry_Labouch%C3%A8re.jpg/220px-Henry_Labouch%C3%A8re.jpg",
				"previous": "While Parke's conviction cleared Euston, another trial began on 16 December 1889 when Newlove's and Somerset's solicitor, Arthur Newton, was charged with obstruction of justice. It was alleged that he conspired to prevent Hammond and the boys from testifying by offering or giving them passage and money to go abroad. Newton was defended by Charles Russell, who had prosecuted Ernest Parke, and the prosecutor was Sir Richard Webster, the Attorney General. Newton pleaded guilty to one of the six charges against him, claiming that he had assisted Hammond to flee merely to protect his clients, who were not at that time charged with any offence or under arrest, from potential blackmail. The Attorney General accepted Newton's pleas and did not present any evidence on the other five charges.[36] On 20 May, the judge, Sir Lewis Cave, sentenced Newton to six weeks in prison,[37] which was widely considered by members of the legal profession to be harsh. A petition signed by 250 London law firms was sent to the Home Secretary, Henry Matthews, protesting at Newton's treatment.[38]",
				"after": "During Newton's trial, a motion in Parliament sought to further investigate Parke's allegations of a cover-up. Henry Labouchère, a Member of Parliament from the Radical wing of the Liberal Party, was staunchly against homosexuality and had campaigned successfully to add the \"gross indecency\" amendment (known as the \"Labouchère Amendment\") to the Criminal Law Amendment Act 1885. He was convinced that the conspiracy to cover up the scandal went further up the government than assumed. Labouchère made his suspicions known in Parliament on 28 February 1890. He denied that \"a gentleman of very high position\"—presumably Prince Albert Victor—was in any way involved with the scandal, but accused the government of conspiracy to pervert the course of justice by hampering the investigation, allowing Somerset and Hammond to escape, delaying the trials and failing to prosecute the case with vigour. Labouchère's accusations were rebutted by the Attorney General, Sir Richard Webster, who was also the prosecutor in the Newton case. Charles Russell, who had prosecuted Parke and was defending Newton, sat on the Liberal benches with Labouchère but refused to be drawn into the debate. After an often passionate debate over seven hours, during which Labouchère was expelled from Parliament after saying \"I do not believe Lord Salisbury\" and refusing to withdraw his remark, the motion was defeated by a wide margin, 206–66.[39]",
			"color": " "
		}
	}
}
