{
	"add": {
		"doc": {
			"id": "86f9a0e81b76ae84f267420b8f57a07e7ef03d1a3d911c5d19d4e501eac989af",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Bufo_bufo_w_Bialogard_Polen_080901_%281%29.jpg/170px-Bufo_bufo_w_Bialogard_Polen_080901_%281%29.jpg",
				"previous": "When attacked, the common toad adopts a characteristic stance, inflating its body and standing with its hindquarters raised and its head lowered. Its chief means of defence lies in the foul tasting secretion that is produced by its paratoid glands and other glands on its skin. This contains a toxin called bufagin and is enough to deter many predators although grass snakes seem to be unaffected by it.[15] Other predators of adult toads include hedgehogs, rats and mink, and even domestic cats.[22] Birds that feed on toads include herons, crows and birds of prey. Crows have been observed to puncture the skin with their beak and then peck out the animal's liver, thus avoiding the toxin.[22] The tadpoles also exude noxious substances which deter fishes from eating them but not the great crested newt. Aquatic invertebrates that feed on toad tadpoles include dragonfly larvae, diving beetles and water boatmen. These usually avoid the noxious secretion by puncturing the tadpole's skin and sucking out its juices.[22]",
				"after": "A parasitic fly, Lucilia bufonivora, attacks adult common toads. It lays its eggs on the toad's skin and when these hatch, the larvae crawl into the toad's nostrils and eat its flesh internally with lethal consequences.[25] The European fingernail clam (Sphaerium corneum) is unusual in that it can climb up water plants and move around on its muscular foot. It sometimes clings to the toe of a common toad and this is believed to be one of the means by which it disperses to new locations.[26]",
			"color": "tan|0.36109 burly|0.2031 wood|0.2031 dim|0.11959 gray|0.11959 dim|0.11959 grey|0.11959 black|0.11234 gray|0.071161 grey|0.071161 saddle|0.032786 brown|0.032786 wheat|0.022784 peach|0.013642 puff|0.013642  "
		}
	}
}
