{
	"add": {
		"doc": {
			"id": "86fe1b2e952d5efc6de2e713341e501cd53478cebb684a2bc101fdfc44fd80f0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Verbascum_thapsus_fruit_kz.jpg/220px-Verbascum_thapsus_fruit_kz.jpg",
				"previous": "A given flower is open only for a single day, opening before dawn and closing in the afternoon.[17] Flowers are self-fecundating and protogynous (with female parts maturing first),[17] and will self-pollinate if they have not been pollinated by insects during the day. While many insects visit the flowers, only some bees actually accomplish pollination. V. thapsus' flowering period lasts from June to August in most of its range, extending to September or October in warmer climates.[7][8][10] Visitors include halictid bees and hoverflies.[9] The hair on lower stamens may serve to provide footholds for visitors.[17]",
				"after": "The seeds maintain their germinative powers for decades, up to a hundred years, according to some studies.[53] Because of this, and because the plant is an extremely prolific seed bearer (each plant produces hundreds of capsules, each containing up to 700+ seeds,[17] with a total up to 180,000[7][8] or 240,000[10] seeds), it remains in the soil seed bank for extended periods of time, and can sprout from apparently bare ground,[8] or shortly after forest fires long after previous plants have died.[10] Its population pattern typically consists of an ephemeral adult population followed by a long period of dormancy as seeds.[17] Great mullein rarely establishes on new grounds without human intervention because its seeds do not disperse very far. Seed dispersion requires the stem to be moved by wind or animal movement; 75% of the seeds fall within 1 m of the parent plant, and 93% fall within 5 m.[8]",
			"color": "olive|0.47822 drab|0.47822 dark|0.1646 olive|0.1646 green|0.1646 olive|0.12819 dark|0.079156 khaki|0.079156 black|0.047669 khaki|0.037993 pale|0.031283 golden|0.031283 rod|0.031283  "
		}
	}
}
