{
	"add": {
		"doc": {
			"id": "8702c8bd1b5a8c8013945b25707bc3c916c0296e6c4d6ba2f3c9139896770102",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/VonderHeydenPavillion.jpg/220px-VonderHeydenPavillion.jpg",
			"previous": [],
				"after": "More than 75 percent of Duke students pursue service-learning opportunities in Durham and around the world through DukeEngage and other programs that advance the university's mission of \"knowledge in service to society.\" Launched in 2007, DukeEngage provides full funding for select Duke undergraduates who wish to pursue an immersive summer of service in partnership with a U.S. or international community. As of summer 2013, more than 2,400 Duke students had volunteered through DukeEngage in 75 nations on six continents. Duke students have created more than 30 service organizations in Durham and the surrounding area. Examples include a weeklong camp for children of cancer patients (Camp Kesem) and a group that promotes awareness about sexual health, rape prevention, alcohol and drug use, and eating disorders (Healthy Devils). The Duke-Durham Neighborhood Partnership, started by the Office of Community Affairs in 1996, attempts to address major concerns of local residents and schools by leveraging university resources.[174] Another community project, \"Scholarship with a Civic Mission,\" is a joint program between the Hart Leadership Program and the Kenan Institute for Ethics.[175] Another program includes Project CHILD, a tutoring program involving 80 first-year volunteers; and an after-school program for at-risk students in Durham that was started with $2.25 million grant from the Kellogg Foundation in 2002.[176] Two prominent civic engagement pre-orientation programs also exist for incoming freshmen: Project CHANGE and Project BUILD. Project CHANGE is a free weeklong program co-sponsored by the Kenan Institute for Ethics and the Duke Women's Center with the focus on ethical leadership and social change in the Durham community; students are challenged in a variety of ways and work closely with local non-profits.[177] Project BUILD is a freshman volunteering group that dedicates 3,300 hours of service to a variety of projects such as schools, Habitat for Humanity, food banks, substance rehabilitation centers, and homeless shelters. Some courses at Duke incorporate service as part of the curriculum to augment material learned in class such as in psychology or education courses (known as service learning courses).[178]",
			"color": "dim|0.27837 gray|0.27837 dim|0.27837 grey|0.27837 gray|0.14671 grey|0.14671 black|0.12551 slate|0.101 gray|0.101 dark|0.073819 gray|0.073819 dark|0.073819 grey|0.073819 dark|0.072051 slate|0.072051 gray|0.072051 light|0.065617 slate|0.065617 gray|0.065617 silver|0.026571 dark|0.016488 olive|0.016488 green|0.016488 dark|0.010604 khaki|0.010604 light|0.0086524 gray|0.0086524 light|0.0086524 grey|0.0086524 olive|0.0080622 light|0.0066337 steel|0.0066337 blue|0.0066337  "
		}
	}
}
