{
	"add": {
		"doc": {
			"id": "871148752e66eec20857defea5e7cc8a324179f5a2bf9a35a279e554591f562f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/SeismosaurusDB.jpg/220px-SeismosaurusDB.jpg",
			"previous": [],
				"after": "Diplodocines have highly unusual teeth compared to other sauropods. The crowns are long and slender, elliptical in cross-section, while the apex forms a blunt triangular point.[18] The most prominent wear facet is on the apex, though unlike all other wear patterns observed within sauropods, diplodocine wear patterns are on the labial (cheek) side of both the upper and lower teeth.[18] What this means is Diplodocus and other diplodocids had a radically different feeding mechanism than other sauropods. Unilateral branch stripping is the most likely feeding behavior of Diplodocus,[48][49][50] as it explains the unusual wear patterns of the teeth (coming from tooth–food contact). In unilateral branch stripping, one tooth row would have been used to strip foliage from the stem, while the other would act as a guide and stabilizer. With the elongated preorbital (in front of the eyes) region of the skull, longer portions of stems could be stripped in a single action.[18] Also the palinal (backwards) motion of the lower jaws could have contributed two significant roles to feeding behaviour: 1) an increased gape, and 2) allowed fine adjustments of the relative positions of the tooth rows, creating a smooth stripping action.[18]",
			"color": "dark|0.14479 gray|0.14479 dark|0.14479 grey|0.14479 gray|0.13334 grey|0.13334 dim|0.095172 gray|0.095172 dim|0.095172 grey|0.095172 antique|0.078245 white|0.078245 silver|0.072086 dark|0.067476 olive|0.067476 green|0.067476 beige|0.056182 light|0.041558 gray|0.041558 light|0.041558 grey|0.041558 papaya|0.039232 whip|0.039232 olive|0.034123 drab|0.034123 blanched|0.03113 almond|0.03113 corn|0.027467 silk|0.027467 gainsboro|0.025731 old|0.022996 lace|0.022996 linen|0.020417 light|0.014914 golden|0.014914 rod|0.014914 yellow|0.014914 light|0.012961 yellow|0.012961 wheat|0.0089973 ivory|0.0083819 lemon|0.0079747 chiffon|0.0079747 floral|0.0079248 white|0.0079248 cadet|0.0064599 blue|0.0064599 sea|0.0061765 shell|0.0061765  "
		}
	}
}
