{
	"add": {
		"doc": {
			"id": "87139e39d4675024f0bad1c523929f8e58e0cba44de2e9b4d628314e2172288a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/5500vc_ex_leg.jpg/160px-5500vc_ex_leg.jpg",
			"previous": [],
				"after": "The prehistory of the area that is now the Netherlands was largely shaped by the sea and the rivers that constantly shifted the low-lying geography. The oldest human (Neanderthal) traces in the Netherlands were found in higher soils, near Maastricht, from 250,000 years ago. After the end of the Ice Age, various Paleolithic groups inhabited the area, and around 8000 BC Mesolithic tribes resided in Friesland and Drenthe, where the oldest canoe in the world was recovered.[27] Autochthonous hunter-gatherers from the Swifterbant culture are attested from around 5600 BC onwards.[28] They are strongly linked to rivers and open water and were related to the southern Scandinavian Ertebølle culture (5300–4000 BC). To the west, the same tribes might have built hunting camps to hunt winter game. People made the switch to animal husbandry sometime between 4800 BC and 4500 BC. Agricultural transformation took place very gradually, between 4300 BC and 4000 BC.[29] The farming Funnelbeaker culture extended from Denmark through northern Germany into the northern Netherlands, and erected the dolmens, large stone grave monuments found in Drenthe (built between 4100 BC and 3200 BC). To the southwest, the Vlaardingen culture (around 2600 BC), an apparently more primitive culture of hunter-gatherers survived well into the Neolithic period. Around 2950 BC there was a quick and smooth transition from the Funnelbeaker farming culture to the pan-European Corded Ware pastoralist culture.[30] The Bell Beaker culture was also present in the Netherlands, that apparently arose out of the Corded Ware culture.[31][32]",
			"color": "khaki|0.088242 pale|0.068429 golden|0.068429 rod|0.068429 floral|0.056693 white|0.056693 sea|0.054246 shell|0.054246 white|0.053645 smoke|0.053645 mint|0.053318 cream|0.053318 snow|0.052994 white|0.052642 ghost|0.050397 white|0.050397 azure|0.049727 alice|0.049309 blue|0.049309 lavender|0.047703 blush|0.047703 gold|0.032275 light|0.025452 golden|0.025452 rod|0.025452 yellow|0.025452 lemon|0.02511 chiffon|0.02511 beige|0.023897 light|0.021325 yellow|0.021325 corn|0.020845 silk|0.020845 ivory|0.01625 papaya|0.016028 whip|0.016028 old|0.014882 lace|0.014882 antique|0.01374 white|0.01374 blanched|0.011891 almond|0.011891 linen|0.010114 honeydew|0.0098094 saddle|0.0086459 brown|0.0086459 golden|0.0059264 rod|0.0059264 chocolate|0.0055416 sienna|0.0053107 wheat|0.0040042 lavender|0.0039262 light|0.0036613 gray|0.0036613 light|0.0036613 grey|0.0036613 gainsboro|0.0036219  "
		}
	}
}
