{
	"add": {
		"doc": {
			"id": "87377633b75674278144f38e8e5ed30d7ff8b052487e1a9760e93bd27f3ae9cb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Josip_Broz_Tito_Biha%C4%87_1942.jpg/170px-Josip_Broz_Tito_Biha%C4%87_1942.jpg",
				"previous": "The terms of the capitulation were extremely severe, as the Axis proceeded to dismember Yugoslavia. Germany occupied northern Slovenia, while retaining direct occupation over a rump Serbian state and considerable influence over its newly created puppet state,[24] the Independent State of Croatia (NDH), which extended over much of today's Croatia and contained all of modern Bosnia and Herzegovina and Syrmia region of modern day Serbia. Mussolini's Italy occupied the remainder of Slovenia (annexed and renamed Province of Ljubljana), Kosovo, and large chunks of the coastal Dalmatia region (along with nearly all its Adriatic islands). It also gained control over the newly created Montenegrin puppet state, and was granted the kingship in the Independent State of Croatia, though wielding little real power within it. Hungary dispatched the Hungarian Third Army to occupy part of Serbian Vojvodina, including Baranja and Bačka, and annexed the Croatian area of Međimurje and the Slovene area of Prekmurje. Bulgaria, meanwhile, annexed nearly all of Macedonia, and small areas of eastern Serbia and Kosovo.[25] The dissolution of Yugoslavia, the creation of the NDH, Independent State of Montenegro and Nedic's Serbia and the annexations of Yugoslav territory by the various Axis countries were incompatible with international law in force at that time.[26]",
				"after": "The occupying forces instituted such severe burdens on the local populace that the Partisans came not only to enjoy widespread support but for many were the only option for survival. Early in the occupation, German forces would hang or shoot indiscriminately, including women, children and the elderly, up to 100 local inhabitants for every one German soldier killed. Furthermore, the country experienced a breakdown of law and order, with collaborationist militias roaming the countryside terrorizing the population. The government of the puppet Independent State of Croatia found itself unable to control its territory in the early stages of the occupation, resulting in a severe crackdown by the Ustaše militias and the German army.[citation needed]",
			"color": " "
		}
	}
}
