{
	"add": {
		"doc": {
			"id": "875f41fa88f867a9ee9bba1863bfc45cdbf054299291a055583050caa5f2865d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Pinus_albicaulis_8574.JPG/220px-Pinus_albicaulis_8574.JPG",
				"previous": "The range of altitude in Grand Teton National Park impacts the types of plant species found at various elevations. In the alpine zone above the tree line, which in Grand Teton National Park is at approximately 10,000 ft (3,000 m), tundra conditions prevail.[88] In this treeless region, hundreds of species of grass, wildflower, moss and lichen are found.[89][90] In the subalpine region from the tree line to the base of the mountains, whitebark pine, limber pine, subalpine fir, and Engelmann spruce are dominant.[87] In the valley floor, lodgepole pine is most common but Rocky Mountain Douglas-fir, and blue spruce inhabit drier areas, while aspen, cottonwood, alder, and willow are more commonly found around lakes, streams and wetlands.[87] However, the tablelands above the Snake River channel are mostly sagebrush plains and in terms of acreage is the most widespread habitat in the park.[91] The sagebrush plains or flats have 100 species of grasses and wildflowers. Slightly more elevated sections of the plains of the northern sections of Jackson Hole form forest islands with one such obvious example being Timbered Island. In this ecotone, forested islands surrounded by sagebrush expanses provide shelter for various animal species during the day and nearby grasses for night time foraging.[91]",
				"after": "While the flora of Grand Teton National Park is generally healthy, the whitebark pine, and to a lesser degree the lodgepole pine, are considered at risk. In the case of the whitebark pine, an invasive species of fungus known as white pine blister rust weakens the tree, making it more susceptible to destruction from endemic mountain pine beetles.[92] Whitebark pines generally thrive at elevations above 8,000 ft (2,400 m) and produce large seeds that are high in fat content and an important food source for various species such as the grizzly bear, red squirrel and Clark's nutcracker.[93] The species is considered to be a keystone and a foundation species; keystone in that its \"ecological role (is) disproportionately large relative to its abundance\"[94] and foundation in that it has a paramount role that \"defines ecosystem structure, function, and process\".[94] Whitebark pine has generally had a lower incidence of blister rust infection throughout the Greater Yellowstone Ecosystem than in other regions such as Glacier National Park and the Cascade Range. The incidence of blister rust on whitebark pines in Yellowstone National Park is slightly lower than in Grand Teton.[93] Though blister rust is not in itself the cause of increased mortality, its weakening effect on trees allows native pine beetles to more easily infest the trees, increasing mortality. While general practice in National Parks is to allow nature to take its course, the alarming trend of increased disease and mortality of the vital whitebark pine trees has sparked a collaborative effort amongst various government entities to intervene to protect the species.[94]",
			"color": "black|0.23685 dark|0.14516 olive|0.14516 green|0.14516 dim|0.10372 gray|0.10372 dim|0.10372 grey|0.10372 gray|0.070605 grey|0.070605 dark|0.057482 gray|0.057482 dark|0.057482 grey|0.057482 dark|0.048215 khaki|0.048215 olive|0.038644 drab|0.038644 slate|0.029645 gray|0.029645 silver|0.029466 light|0.027769 slate|0.027769 gray|0.027769 light|0.018796 gray|0.018796 light|0.018796 grey|0.018796 tan|0.018422 gainsboro|0.013111  "
		}
	}
}
