{
	"add": {
		"doc": {
			"id": "876a4a648925507d2676152198404eb8d4c6da68a784690cfb9fa1f4f7d4ffc8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Lockheed_RC-121C_1955.jpg/220px-Lockheed_RC-121C_1955.jpg",
				"previous": "In 1963, the USAF asked for proposals for an Airborne Warning and Control System (AWACS) to replace its EC-121 Warning Stars, which had served in the airborne early warning role for over a decade.[3] The new aircraft would take advantage of improvements in radar technology which allowed airborne radars to \"look down\" and detect low-flying aircraft (see Look-down/shoot-down), even over land, which was previously impractical due to ground clutter[4] (see terrain mask). Contracts were issued to Boeing, Douglas and Lockheed, the latter being eliminated in July 1966. In 1967, a parallel program was put into place to develop the radar, with Westinghouse Electric and the Hughes Aircraft being asked to compete in producing the radar system. In 1968 it was referred to as Overland Radar Technology (ORT) during development tests on the modified EC-121Q.[5][6] The Westinghouse's radar antenna was going to be used by whichever company won the radar competition, since Westinghouse had pioneered in the design of high-power RF phase-shifters.",
				"after": "Boeing initially proposed a purpose-built aircraft, but tests indicated that it would not outperform the already-operational 707, so the latter was chosen instead. To increase endurance, this design was to be powered by eight General Electric TF34s, or carrying its radar in a rotating dome mounted at the top of a forward-swept tail, above the fuselage.[4][7] Boeing was selected ahead of McDonnell Douglas's DC-8-based proposal in July 1970. Initial orders were placed for two aircraft, designated EC-137D as test beds to evaluate the two competing radars. As the test-beds did not need the same 14-hour endurance demanded of the production aircraft, the EC-137s retained the Pratt & Whitney JT3D commercial engines, and a later reduction in endurance requirement led to retaining the normal engines in production.[6]",
			"color": " "
		}
	}
}
