{
	"add": {
		"doc": {
			"id": "8777343fba4041a95e4d4a4dfc76c09c42245ccb348439fbcbd2a6c2b34acb11",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Dnepr_rocket_lift-off_1.jpg/220px-Dnepr_rocket_lift-off_1.jpg",
			"previous": [
				"This technology was also predicted by US Army General Hap Arnold, who wrote in 1943:",
				"The development of the world's first practical design for an ICBM, A9/10, intended for use in bombing New York and other American cities, was undertaken in Nazi Germany by the team of Wernher von Braun under Projekt Amerika. The ICBM A9/A10 rocket initially was intended to be guided by radio, but was changed to be a piloted craft after the failure of Operation Elster. The second stage of the A9/A10 rocket was tested a few times in January and February 1945. The progenitor of the A9/A10 was the German V-2 rocket, also designed by von Braun and widely used at the end of World War II to bomb British and Belgian cities. All of these rockets used liquid propellants. Following the war, von Braun and other leading German scientists were relocated to the United States to work directly for the US Army through Operation Paperclip, developing the IRBMs, ICBMs, and launchers."
			],
				"after": "In the immediate post-war era, the US and USSR both started rocket research programs based on the German wartime designs, especially the V-2. In the US, each branch of the military started its own programs, leading to considerable duplication of effort. In the USSR, rocket research was centrally organized, although several teams worked on different designs. Early designs from both countries were short-range missiles, like the V-2, but improvements quickly followed.",
			"color": "cadet|0.43979 blue|0.43979 khaki|0.097919 pale|0.07221 golden|0.07221 rod|0.07221 wheat|0.051592 burly|0.039763 wood|0.039763 tan|0.03683 navajo|0.027726 white|0.027726 lemon|0.027131 chiffon|0.027131 moccasin|0.023734 light|0.021218 golden|0.021218 rod|0.021218 yellow|0.021218 peru|0.017425 beige|0.016044 light|0.011964 yellow|0.011964 corn|0.011181 silk|0.011181 light|0.010577 blue|0.010577  "
		}
	}
}
