{
	"add": {
		"doc": {
			"id": "8779493ee04e0a8503649ea99d6e2c2f4bb7df2b972720e54d4ba2020584a278",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/7/72/Power_as_Frederic.jpg/170px-Power_as_Frederic.jpg",
				"previous": "Frederic has never seen any woman other than Ruth, and he believes her to be beautiful. The pirates know better and suggest that Frederic take Ruth with him when he returns to civilisation. Frederic announces that, although it pains him, so strong is his sense of duty that, once free from his apprenticeship, he will be forced to devote himself to the pirates' extermination. He also points out that they are not successful pirates: since they are all orphans, they allow their prey to go free if they too are orphans. Frederic notes that word of this has got about, so captured ships' companies routinely claim to be orphans. Frederic invites the pirates to give up piracy and go with him, so that he need not destroy them, but the Pirate King says that, compared with respectability, piracy is comparatively honest (\"Oh! better far to live and die\"). The pirates depart, leaving Frederic and Ruth. Frederic sees a group of beautiful young girls approaching the pirate lair, and realises that Ruth misled him about her appearance (\"Oh false one! You have deceived me!\"). Sending Ruth away, Frederic hides before the girls arrive.",
				"after": "The girls burst exuberantly upon the secluded spot (\"Climbing over rocky mountain\"). Frederic reveals himself (\"Stop, ladies, pray!\") and appeals to them to help him reform (\"Oh! is there not one maiden breast?\"). One of them, Mabel, responds to his plea, chiding her sisters for their lack of charity (\"Oh sisters deaf to pity's name for shame!\"). She offers Frederic her pity (\"Poor wand'ring one\"), and the two quickly fall in love. The other girls discuss whether to eavesdrop or to leave the new couple alone (\"What ought we to do?\"), deciding to \"talk about the weather,\" although they steal glances at the affectionate couple (\"How beautifully blue the sky\").",
			"color": "black|0.59696 dim|0.24136 gray|0.24136 dim|0.24136 grey|0.24136 gray|0.095388 grey|0.095388 dark|0.026693 gray|0.026693 dark|0.026693 grey|0.026693 slate|0.015864 gray|0.015864 silver|0.0076321  "
		}
	}
}
