{
	"add": {
		"doc": {
			"id": "877c7bcf7f2018a937732978152c511741649c48b9342dcc9229810297d4d5b5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Crested_Tern_breeding_plumage.jpg/220px-Crested_Tern_breeding_plumage.jpg",
				"previous": "A male greater crested tern establishes a small area of the colony in preparation for nesting, and initially pecks at any other tern entering his territory. If the intruder is another male, it retaliates in kind, and is normally vigorously repelled by the incumbent. A female entering the nest area reacts passively to the male's aggression, enabling him to recognise her sex and initiate pair formation by display, including head raising and bowing; this behaviour is frequently repeated during nesting to reinforce the bond between the pair. Terns also use fish as part of the courtship ritual. One bird flies around the colony with a fish in its beak, calling loudly; its partner may also fly, but the pair eventually settle and the gift is exchanged.[25]",
				"after": "The nest is a shallow scrape in the sand on open, flat or occasionally sloping ground. It is often unlined, but sometimes includes stones or cuttlefish bones. One, sometimes two, eggs are laid and incubated by both parents for 25 to 30 days prior to hatching.[14] The eggs are cream with blackish streaks.[26] Egg laying is synchronised within a breeding colony[27] and more tightly so within sub-colonies.[28] Parents do not recognize their own eggs or newly hatched chicks, but are able to distinguish their chicks by the time they are two days-old, shortly before they begin to wander from the nest.[29] The precocial chicks, which are very pale with black speckling, are brooded and fed by both parents, but may gather in crèches when older. The young terns fledge after 38 to 40 days, but remain dependent on the parents after leaving the colony until they are about four months old.[14]",
			"color": "dark|0.31455 gray|0.31455 dark|0.31455 grey|0.31455 silver|0.16392 gray|0.13164 grey|0.13164 light|0.071606 gray|0.071606 light|0.071606 grey|0.071606 dim|0.063797 gray|0.063797 dim|0.063797 grey|0.063797 gainsboro|0.051151 linen|0.02538 old|0.018863 lace|0.018863 sea|0.018592 shell|0.018592 white|0.017047 smoke|0.017047 floral|0.016638 white|0.016638 snow|0.013905 ivory|0.012869 mint|0.012188 cream|0.012188 white|0.011817 antique|0.010566 white|0.010566 black|0.0080942 dark|0.0059235 slate|0.0059235 gray|0.0059235 lavender|0.0050704 blush|0.0050704 ghost|0.0041809 white|0.0041809 dark|0.0035688 khaki|0.0035688  "
		}
	}
}
