{
	"add": {
		"doc": {
			"id": "8791902083a603caf81cafe12c9b781685548dcccf618f852d16bdd51c54f593",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Eisenstein_Potemkin_2.jpg/170px-Eisenstein_Potemkin_2.jpg",
				"previous": "Bacon said that chance played a significant role in his work, and that he often approached a canvas without having a clear idea of what might emerge. This was especially the case in the mid to late 1940s, a period when he was drinking heavily and spending most nights in Soho casinos and poker rooms.[20] The following morning he would often approach his canvas \"in a bad mood of drinking ... under tremendous hangovers and drink; I sometimes hardly knew what I was doing.\"[21] He incorporated his appetite for chance into his work: an image often would morph mid-way through into something quite different from what he had first intended. He actively sought out this freedom and felt it crucial to his progression as an artist. To him, lifestyle and art were intertwined; he said that \"perhaps the drink helped me to be a bit freer.\"[21] This is very evident in the 1949 series, which began as a rather morbid study of a collapsed head, but evolved over the six surviving panels into a reworking of Velázquez masterpieces, and arrived at an image that was to preoccupy Bacon for the subsequent 20 years.[20]",
				"after": "The series marks Bacon's first attempt at depicting lone figures in rooms. For him, the key aspect was that it appeared that the subject felt isolated, unobserved, and had abandoned the need to present an outward face. He believed that under these circumstances all pretence falls away, and the social being becomes the sum of its neuroses, which Bacon attempted to convey by reducing the subject to its bare-bones features: a mouth, ears, eyes, a jaw. According to Russell, \"the view out front ceases to be the only one, and our person is suddenly adrift, fragmented, and subject to strange mutation.\"[6] Russell observed that while the depiction of figures in rooms is common through all eras of painting, the figures are always posed, and usually seemingly aware that they are being portrayed. This conceit is abandoned in Bacon's series.[6]",
			"color": "black|0.7125 dim|0.13427 gray|0.13427 dim|0.13427 grey|0.13427 gray|0.080427 grey|0.080427 dark|0.020826 gray|0.020826 dark|0.020826 grey|0.020826  "
		}
	}
}
