{
	"add": {
		"doc": {
			"id": "8799411a51c839c93126b72f22a82b49f2d0da4c868629c7e9122d401b6eb31d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Royaljet_b737-bbj_a6-rjz_arp.jpg/220px-Royaljet_b737-bbj_a6-rjz_arp.jpg",
				"previous": "The 737-900ER, which was called the 737-900X prior to launch, is the newest addition and the largest variant of the Boeing 737 line and was introduced to meet the range and passenger capacity of the discontinued 757-200 and to directly compete with the Airbus A321. An additional pair of exit doors and a flat rear pressure bulkhead increase seating to 180 passengers in a typical two-class configuration or up to 215 passengers in a single-class layout.[129] Additional fuel capacity and standard winglets improve range to that of other 737NG variants—around 3200 nm.[130] The first 737-900ER was rolled out of the Renton, Washington factory on August 8, 2006 for its launch customer, Indonesian Lion Air. Lion Air received this aircraft on April 27, 2007 in a special dual paint scheme combining the Lion Air lion on the vertical stabilizer and the Boeing livery colors on the fuselage. The 737-900 has been discontinued in favor of the 737-900ER.[citation needed]",
				"after": "The Boeing Business Jet is a customized version of the 737. Plans for a business jet version of the 737 are not new. In the late 1980s, Boeing marketed the 77-33 jet, a business jet version of the 737-300.[131] The name was short-lived. After the introduction of the next generation series, Boeing introduced the Boeing Business Jet (BBJ) series. The BBJ1 was similar in dimensions to the 737-700 but had additional features, including stronger wings and landing gear from the 737-800, and had increased range (through the use of extra fuel tanks) over the other 737 models. The first BBJ rolled out on August 11, 1998 and flew for the first time on September 4.[132]",
			"color": "dark|0.12345 gray|0.12345 dark|0.12345 grey|0.12345 dim|0.11946 gray|0.11946 dim|0.11946 grey|0.11946 light|0.1074 gray|0.1074 light|0.1074 grey|0.1074 black|0.10722 silver|0.093717 gainsboro|0.091452 gray|0.062029 grey|0.062029 slate|0.038443 gray|0.038443 lavender|0.037456 light|0.03347 slate|0.03347 gray|0.03347 alice|0.023126 blue|0.023126 midnight|0.022091 blue|0.022091 white|0.019109 smoke|0.019109 ghost|0.01346 white|0.01346 maroon|0.009646 light|0.0088721 steel|0.0088721 blue|0.0088721 azure|0.0081314 dark|0.0077853 olive|0.0077853 green|0.0077853 dark|0.0076273 slate|0.0076273 gray|0.0076273 snow|0.0069357  "
		}
	}
}
