{
	"add": {
		"doc": {
			"id": "87a1a84140c0396f7f988ea45fc1c458a08fb18256159cb5e4536f72352782b2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Bronwyn_Bancroft_Feb_2010.JPG/120px-Bronwyn_Bancroft_Feb_2010.JPG",
				"previous": "Portal:Arts/Featured biography/1",
				"after": "Bronwyn Bancroft (born 1958) is an Indigenous Australian artist, notable for being the first Australian fashion designer invited to show her work in Paris. Born in Tenterfield, New South Wales, and trained in Canberra and Sydney, Bancroft worked as a fashion designer, and is an artist, illustrator, and arts administrator. In 1985 Bancroft established a shop called Designer Aboriginals, selling fabrics made by Indigenous artists including herself. She was a founding member of Boomalli Aboriginal Artists Co-operative. Artwork by Bancroft is held by the National Gallery of Australia, the Art Gallery of New South Wales and the Art Gallery of Western Australia. She has provided artwork for over 20 children's books, including Stradbroke Dreaming by writer and activist Oodgeroo Noonuccal and books by artist and writer Sally Morgan. She has also received design commissions, including one for the exterior of a sports centre in Sydney. With a long history of involvement in community activism and arts administration, Bancroft has served as a board member for the National Gallery of Australia. Her painting Prevention of AIDS (1992) was used in a campaign to raise awareness of HIV/AIDS in Australia. As of 2010, Bancroft sits on the boards of copyright collection agency Viscopy and Tranby Aboriginal College, as well as being on the Artists Board at the Museum of Contemporary Art, Sydney.",
			"color": "dark|0.20507 gray|0.20507 dark|0.20507 grey|0.20507 gray|0.18314 grey|0.18314 dim|0.15324 gray|0.15324 dim|0.15324 grey|0.15324 black|0.14913 silver|0.11172 light|0.051296 gray|0.051296 light|0.051296 grey|0.051296 gainsboro|0.025126 dark|0.022433 salmon|0.022433 thistle|0.01667 rosy|0.016338 brown|0.016338 steel|0.013488 blue|0.013488 dark|0.011842 slate|0.011842 gray|0.011842 light|0.008913 slate|0.008913 gray|0.008913 slate|0.0082692 gray|0.0082692  "
		}
	}
}
