{
	"add": {
		"doc": {
			"id": "87a60b1fa00196779ddc1e2454abc7cba3c9edee1a28c1b2673aa59011585307",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Tulsa_Skyline.jpg/220px-Tulsa_Skyline.jpg",
				"previous": "Oklahoma had 598 incorporated places in 2010, including four cities over 100,000 in population and 43 over 10,000.[235] Two of the fifty largest cities in the United States are located in Oklahoma, Oklahoma City and Tulsa, and 65 percent of Oklahomans live within their metropolitan areas, or spheres of economic and social influence defined by the United States Census Bureau as a metropolitan statistical area. Oklahoma City, the state's capital and largest city, had the largest metropolitan area in the state in 2010, with 1,252,987 people, and the metropolitan area of Tulsa had 937,478 residents.[236] Between 2000 and 2010, the cities that led the state in population growth were Blanchard 172.4%, Elgin 78.2%, Jenks 77.0%, Piedmont 56.7%, Bixby 56.6%, and Owasso 56.3%.[235]",
				"after": "In descending order of population, Oklahoma's largest cities in 2010 were: Oklahoma City (579,999, +14.6%), Tulsa (391,906, −0.3%), Norman (110,925, +15.9%), Broken Arrow (98,850, +32.0%), Lawton (96,867, +4.4%), Edmond (81,405, +19.2%), Moore (55,081, +33.9%), Midwest City (54,371, +0.5%), Enid (49,379, +5.0%), and Stillwater (45,688, +17.0%). Of the state's ten largest cities, three are outside the metropolitan areas of Oklahoma City and Tulsa, and only Lawton has a metropolitan statistical area of its own as designated by the United States Census Bureau, though the metropolitan statistical area of Fort Smith, Arkansas extends into the state.[86]",
			"color": "dark|0.3439 olive|0.3439 green|0.3439 dim|0.23909 gray|0.23909 dim|0.23909 grey|0.23909 gray|0.13712 grey|0.13712 dark|0.068167 gray|0.068167 dark|0.068167 grey|0.068167 slate|0.0667 gray|0.0667 black|0.059218 light|0.048156 slate|0.048156 gray|0.048156 dark|0.015316 slate|0.015316 gray|0.015316 silver|0.012034  "
		}
	}
}
