{
	"add": {
		"doc": {
			"id": "87aca7e2743de7c6d65f46f50107c22cf6157035921906af798141d710d54c79",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Madonna_New_York.jpg/220px-Madonna_New_York.jpg",
			"previous": [],
				"after": "The song received generally favorable reviews from music critics. Stephen Thomas Erlewine from Allmusic praised the song as one of the best tracks of the album, calling it \"infectious\".[19] Sean O'Brien from The People praised \"Nobody Knows Me\" as \"the best song of the album\" and her \"one of her best ever\". He also said that the song is one of the reasons why Madonna is queen of pop.[20] Jon Pareles from The New York Times considered it as the album's most danceable song.[17] Lucy O'Brien in her book Madonna: Like an Icon, called the song \"dazed-sounding\".[21] Metro Times described Ahmadzai's programming as \"by far the best thing on the album\".[22] James Hannaham from Spin compared \"Nobody Knows Me\" to Donna Summer's \"I Feel Love\", and deemed it as a highlight from the album.[23] Alan Braidwood from BBC Music felt that the song was \"insane\" with its electronic, chaotic, fast and manic pounding synths. \"There is so much going on here several it'll take several plays to really get it, but it's ace.\"[24] Ken Tucker from Entertainment Weekly described \"Nobody Knows Me\" as the \"downright thrilling\" and \"deploys a shrewd little form-versus-content paradox\".[25]",
			"color": "dim|0.18145 gray|0.18145 dim|0.18145 grey|0.18145 gray|0.16557 grey|0.16557 dark|0.10279 gray|0.10279 dark|0.10279 grey|0.10279 light|0.10141 gray|0.10141 light|0.10141 grey|0.10141 silver|0.10011 gainsboro|0.083166 black|0.072823 dark|0.036513 slate|0.036513 gray|0.036513 white|0.013918 smoke|0.013918 rosy|0.01325 brown|0.01325 lavender|0.012598 alice|0.0094061 blue|0.0094061 lavender|0.0082282 blush|0.0082282 ghost|0.0080127 white|0.0080127 linen|0.0078264 steel|0.0076869 blue|0.0076869 slate|0.0074846 gray|0.0074846 light|0.0062203 slate|0.0062203 gray|0.0062203 misty|0.0056492 rose|0.0056492 snow|0.005329 tan|0.0047706  "
		}
	}
}
