{
	"add": {
		"doc": {
			"id": "87b37e9181f5eed41e5f08b9cc60e7a3e6bee18411775f31862528c279d50c42",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Emirates_Airbus_A380_%28A6-EDS%29_departs_London_Heathrow_11April2015.jpg/220px-Emirates_Airbus_A380_%28A6-EDS%29_departs_London_Heathrow_11April2015.jpg",
				"previous": "Emirates announced an order in April 2000 for the Airbus A3XX (later named Airbus A380), the largest widebody airliner ever built. The deal consisted of five Airbus A380s and two Airbus A380Fs. The deal was confirmed on 4 November 2001, when Emirates announced orders for 15 more A380-800s. An additional order 21 A380-800s was placed two years later. In April 2006, Emirates replaced its order for the two variants with an order for two A380-800s. In 2007, Emirates ordered 15 A380-800s, bringing the total number ordered to 58.[49] According to Emirates, the aircraft would allow the airline to maximize its use of scarce takeoff and landing slots at crowded airports such as London Heathrow Airport. In 2005, the first A380-800 in full Emirates livery was displayed at the Dubai Airshow.[50]",
				"after": "On 20 November 2005, Emirates ordered 42 Boeing 777s, to help with its expansion. This order came one day after Airbus announced that the A380-800 would be delayed by another six months.[51] A third delay was announced on 3 October 2006, pushing the initial delivery of the first A380-800 to October 2007.[52] The announcement was met with anger by Emirates' President Tim Clark, who threatened to cancel their Airbus order as it was affecting the airline's expansion plan, saying that \"It's very serious. This will do us serious damage.\"[53] In total as of April 2008, Airbus paid as much as $110 million during 2007 in compensation for the late delivery of the A380-800 to Emirates for the delays.[54] During the same year, on 1 August, Emirates flew its first A380-800 flight, from Dubai to New York-JFK.[55][56]",
			"color": "light|0.29154 slate|0.29154 gray|0.29154 steel|0.24215 blue|0.24215 slate|0.20823 gray|0.20823 dark|0.063521 gray|0.063521 dark|0.063521 grey|0.063521 silver|0.037386 black|0.027135 dim|0.022571 gray|0.022571 dim|0.022571 grey|0.022571 light|0.022531 gray|0.022531 light|0.022531 grey|0.022531 gray|0.018108 grey|0.018108 gainsboro|0.016658 light|0.010053 steel|0.010053 blue|0.010053 lavender|0.0054772 crimson|0.0042955  "
		}
	}
}
