{
	"add": {
		"doc": {
			"id": "87b34affd34b79b3b14c0f09165bd5d3348d002c52ce41490d17902032bd206e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/1880RepublicanPoster.png/220px-1880RepublicanPoster.png",
				"previous": "After speeches in favor of the other front-runners, Garfield rose to place Sherman's name in nomination; his nominating speech was well-received, but the delegates mustered little excitement for the idea of Sherman as the next president.[123] The first ballot showed Grant leading with 304 votes and Blaine in second with 284; Sherman's 93 placed him in a distant third. Subsequent ballots quickly demonstrated a deadlock between the Grant and Blaine forces, with neither having the 379 votes needed for nomination.[124] Jeremiah McLain Rusk, a member of the Wisconsin delegation, and Benjamin Harrison, an Indiana delegate, sought to break the deadlock by shifting a few of the anti-Grant votes to a dark horse candidate—Garfield.[125] Garfield gained 50 votes on the 35th ballot, and the stampede began. Garfield protested to the other members of his Ohio delegation that he had not sought the nomination and had never intended to betray Sherman, but they overruled his objections and cast their ballots for him.[126] In the next round of voting, nearly all of the Sherman and Blaine delegates shifted their support to Garfield, giving him 399 votes and the Republican nomination. Most of the Grant forces backed the former president to the end, creating a disgruntled Stalwart minority in the party.[127] To obtain that faction's support for the ticket, former New York customs collector Chester A. Arthur, a member of Conkling's political machine, was chosen as the vice-presidential nominee and Garfield's running mate.[128]",
				"after": "Despite including a Stalwart on the ticket, animosity between the Republican factions carried over from the convention, and Garfield traveled to New York to meet with party leaders there.[129] After convincing the Stalwart crowd to put aside their differences and unite for the coming campaign, Garfield returned to Ohio, leaving the active campaigning to others, as was traditional at the time.[130] Meanwhile, the Democrats settled on their nominee, Major General Winfield Scott Hancock of Pennsylvania, a career military officer.[129] Hancock and the Democrats expected to carry the Solid South, while much of the North was considered safe territory for Garfield and the Republicans; most of the campaign would involve a few close states, including New York and Indiana.[131]",
			"color": "dim|0.39414 gray|0.39414 dim|0.39414 grey|0.39414 wheat|0.17077 blanched|0.14643 almond|0.14643  "
		}
	}
}
