{
	"add": {
		"doc": {
			"id": "87c15e15de20bb9255b408e0f7739a687ce06b8720047b8bc7bad7d6c3573693",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Dodo_and_seashells.jpg/220px-Dodo_and_seashells.jpg",
				"previous": "Many endemic species of Mauritius became extinct after the arrival of humans, so the ecosystem of the island is badly damaged and hard to reconstruct. Before humans arrived, Mauritius was entirely covered in forests, but very little remains of them today, because of deforestation.[57] The surviving endemic fauna is still seriously threatened.[58] The dodo lived alongside other recently extinct Mauritian birds such as the flightless red rail, the broad-billed parrot, the Mascarene grey parakeet, the Mauritius blue pigeon, the Mauritius owl, the Mascarene coot, the Mauritian shelduck, the Mauritian duck, and the Mauritius night heron. Extinct Mauritian reptiles include the saddle-backed Mauritius giant tortoise, the domed Mauritius giant tortoise, the Mauritian giant skink, and the Round Island burrowing boa. The small Mauritian flying fox and the snail Tropidophora carinata lived on Mauritius and Réunion, but vanished from both islands. Some plants, such as Casearia tinifolia and the palm orchid, have also become extinct.[59]",
				"after": "A 1631 Dutch document, rediscovered in 1887 but now lost, is the only account of the dodo's diet and also mentions that it used its beak for defence:",
			"color": "dim|0.21012 gray|0.21012 dim|0.21012 grey|0.21012 tan|0.1726 gray|0.10872 grey|0.10872 burly|0.084858 wood|0.084858 dark|0.071566 gray|0.071566 dark|0.071566 grey|0.071566 rosy|0.066084 brown|0.066084 silver|0.049927 peach|0.035909 puff|0.035909 light|0.024631 gray|0.024631 light|0.024631 grey|0.024631 antique|0.020733 white|0.020733 bisque|0.019917 black|0.016638 gainsboro|0.013463 wheat|0.012589 blanched|0.012568 almond|0.012568 misty|0.012171 rose|0.012171 papaya|0.010236 whip|0.010236 navajo|0.0087749 white|0.0087749  "
		}
	}
}
