{
	"add": {
		"doc": {
			"id": "87c3e9e1eec91fcd4afd22b48480be89624b0c7384b0a447747576e9c26ba26b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/%D0%A1%D0%92%D0%A1_%D1%83_%D0%BE%D0%B1%D0%BB%D0%BE%D0%BC%D0%BA%D0%BE%D0%B2_%D1%81%D0%B1%D0%B8%D1%82%D0%BE%D0%B3%D0%BE_%D0%91-52_%D0%B2_%D0%BE%D0%BA%D1%80%D0%B5%D1%81%D1%82%D0%BD%D0%BE%D1%81%D1%82%D1%8F%D1%85_%D0%A5%D0%B0%D0%BD%D0%BE%D1%8F_23.12.1972_%281%29.jpg/220px-%D0%A1%D0%92%D0%A1_%D1%83_%D0%BE%D0%B1%D0%BB%D0%BE%D0%BC%D0%BA%D0%BE%D0%B2_%D1%81%D0%B1%D0%B8%D1%82%D0%BE%D0%B3%D0%BE_%D0%91-52_%D0%B2_%D0%BE%D0%BA%D1%80%D0%B5%D1%81%D1%82%D0%BD%D0%BE%D1%81%D1%82%D1%8F%D1%85_%D0%A5%D0%B0%D0%BD%D0%BE%D1%8F_23.12.1972_%281%29.jpg",
			"previous": [],
				"after": "With the escalating situation in Southeast Asia, 28 B-52Fs were fitted with external racks for 24x 750 pound (340 kg) bombs under project South Bay in June 1964; an additional 46 aircraft received similar modifications under project Sun Bath.[70] In March 1965, the United States commenced Operation Rolling Thunder. The first combat mission, Operation Arc Light, was flown by B-52Fs on 18 June 1965, when 30 bombers of the 9th and 441st Bombardment Squadrons struck a communist stronghold near the Bến Cát District in South Vietnam. The first wave of bombers arrived too early at a designated rendezvous point, and while maneuvering to maintain station, two B-52s collided, which resulted in the loss of both bombers and eight crewmen. The remaining bombers, minus one more that turned back due to mechanical problems, continued toward the target.[135] Twenty-seven Stratofortresses dropped on a one-mile by two-mile target box from between 19,000 and 22,000 feet, a little more than 50% of the bombs falling within the target zone.[136] The force returned to Andersen AFB except for one bomber with electrical problems that recovered to Clark AFB, the mission having lasted 13 hours. Post-strike assessment by teams of South Vietnamese troops with American advisors found evidence that the VC had departed the area before the raid, and it was suspected that infiltration of the south's forces may have tipped off the north because of the ARVN troops involved in the post-strike inspection.[137]",
			"color": "dark|0.20933 gray|0.20933 dark|0.20933 grey|0.20933 dim|0.18231 gray|0.18231 dim|0.18231 grey|0.18231 gray|0.17391 grey|0.17391 silver|0.11542 black|0.11478 light|0.066468 gray|0.066468 light|0.066468 grey|0.066468 gainsboro|0.044658 linen|0.014955 misty|0.010236 rose|0.010236 sea|0.0096698 shell|0.0096698 old|0.0079662 lace|0.0079662 white|0.0078133 smoke|0.0078133 antique|0.0074338 white|0.0074338 floral|0.0071431 white|0.0071431 snow|0.0057275 lavender|0.0046104 blush|0.0046104 ivory|0.0037037  "
		}
	}
}
