{
	"add": {
		"doc": {
			"id": "87c8276e4cc0b08d72dfdeab9c9a7a81811eac4aa040775929086c9e4bc81876",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Egypte_louvre_239_masque.jpg/220px-Egypte_louvre_239_masque.jpg",
			"previous": [],
				"after": "Egyptian funerary art was inseparably connected to the religious belief that life continued after death – even more, it expressed a belief that \"death is a mere phase of life\".[15] Aesthetic objects and images connected with this belief were partially intended to preserve material goods, wealth and status for the journey between this life and the next,[16] and to \"commemorate the life of the tomb owner ... depict performance of the burial rites, and in general present an environment that would be conducive to the tomb owner's rebirth.\"[17] In this context, Egyptian mummies encased in one or more layers of decorated coffin, are famous; canopic jars preserved the internal organs. A special category of Ancient Egyptian funerary texts clarify the purposes of the burial customs. The early mastaba type of tomb had a sealed underground burial chamber but an offering-chamber on the ground level for visits by the living, a pattern repeated in later types of tomb. A Ka statue effigy of the deceased might be walled up in a serdab connected to the offering chamber by vents that allowed the smell of incense to reach the effigy.[18] The walls of important tomb-chambers and offering chambers were heavily decorated with reliefs in stone or sometimes wood, or paintings, depicting religious scenes, portraits of the deceased, and at some periods vivid images of everyday life, depicting the afterlife. The chamber decoration usually centred on a \"false door\", through which only the soul of the deceased could pass, to received the offerings left by the living.[19]",
			"color": "gray|0.17716 grey|0.17716 dark|0.11714 gray|0.11714 dark|0.11714 grey|0.11714 dim|0.090923 gray|0.090923 dim|0.090923 grey|0.090923 light|0.045014 slate|0.045014 gray|0.045014 wheat|0.043446 navajo|0.04303 white|0.04303 moccasin|0.042733 peach|0.03596 puff|0.03596 light|0.032066 gray|0.032066 light|0.032066 grey|0.032066 bisque|0.030775 slate|0.030473 gray|0.030473 gainsboro|0.029221 silver|0.02813 misty|0.022653 rose|0.022653 light|0.021925 steel|0.021925 blue|0.021925 lavender|0.016342 blush|0.016342 tan|0.013876 black|0.012524 dark|0.012354 sea|0.012354 green|0.012354 sea|0.012104 shell|0.012104 white|0.011679 smoke|0.011679 linen|0.010941 snow|0.010331 rosy|0.0096277 brown|0.0096277 ghost|0.00891 white|0.00891 floral|0.0085104 white|0.0085104  "
		}
	}
}
