{
	"add": {
		"doc": {
			"id": "87cfbcf8bfc9e53a3faa28505210afc359324a04440b0620bbbfdcf3659aaa66",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/California-Condor.jpg/220px-California-Condor.jpg",
			"previous": [],
				"after": "Wild condors maintain a large home range, often traveling 250 km (160 mi) a day in search of carrion.[41] It is thought that in the early days of its existence as a species, the California condor lived off the carcasses of the \"megafauna\", which are now extinct in North America. They still prefer to feast on large, terrestrial mammalian carcasses such as deer, goats, sheep, donkeys, horses, pigs, cougars, bears, or cattle. Alternatively, they may feed on the bodies of smaller mammals, such as rabbits or coyotes, aquatic mammals such as whales and California sea lions, or salmon. Bird and reptile carcasses are rarely eaten. Since they do not have a sense of smell,[42] they spot these corpses by looking for other scavengers, like eagles and smaller vultures, the latter of which cannot rip through the tougher hides of these larger animals with the efficiency of the larger condor. They can usually intimidate other scavengers away from the carcass, with the exception of bears, which will ignore them, and golden eagles, which will fight a condor over a kill or a carcass.[19] In the wild they are intermittent eaters, often going for between a few days to two weeks without eating,[41] then gorging themselves on 1–1.5 kilograms (2.2–3.3 lb) of meat at once.",
			"color": "black|0.27378 dim|0.18265 gray|0.18265 dim|0.18265 grey|0.18265 gray|0.14806 grey|0.14806 dark|0.11411 gray|0.11411 dark|0.11411 grey|0.11411 silver|0.052361 slate|0.033789 gray|0.033789 tan|0.024642 light|0.021218 gray|0.021218 light|0.021218 grey|0.021218 light|0.018086 slate|0.018086 gray|0.018086 peach|0.016864 puff|0.016864 bisque|0.015478 antique|0.01227 white|0.01227 blanched|0.011307 almond|0.011307 wheat|0.011262 gainsboro|0.01064 papaya|0.0079679 whip|0.0079679 moccasin|0.0062593 navajo|0.005639 white|0.005639 burly|0.0055004 wood|0.0055004  "
		}
	}
}
