{
	"add": {
		"doc": {
			"id": "87d0ec0561e61bb13ef9ded5f309b232ec33f39183e8caae1b1cfc329dc9705e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/B-17-battle-casualty1.gif/220px-B-17-battle-casualty1.gif",
			"previous": [],
				"after": "After examining wrecked B-17s and B-24s, Luftwaffe officers discovered that on average it took around 20 hits with 20 mm shells fired from the rear to bring them down.[95] Pilots of average ability hit the bombers with only about two percent of the rounds they fired, so to obtain 20 hits, the average pilot had to fire one thousand 20 mm (0.79 in) rounds at a bomber.[95] Early versions of the Fw 190, one of the best German interceptor fighters, were equipped with two 20 mm (0.79 in) MG FF cannons, which carried only 500 rounds when belt-fed (normally using 60-round drum magazines in earlier installations), and later with the better Mauser MG 151/20 cannons, which had a longer effective range than the MG FF weapon. Later versions carried four or even six MG 151/20 cannon and twin 13 mm machine guns. The German fighters found that when attacking from the front, where fewer defensive guns were mounted (and where the pilot was exposed and not protected by armor as he was from the rear), it took only four or five hits to bring a bomber down.[95] To address the Fw 190's shortcomings, the number of cannons fitted was doubled to four with a corresponding increase in the amount of ammunition carried, creating the Sturmbock bomber destroyer version. This type replaced the vulnerable twin-engined Zerstörer heavy fighters which could not survive interception by P-51 Mustangs flying well ahead of the combat boxes in an air supremacy role starting very early in 1944 — as ordered by the Eighth Air Force's commander, then-Maj. Gen. Jimmy Doolittle — to clear any Luftwaffe defensive fighters from the skies. By 1944, a further upgrade to Rheinmetall-Borsig's 30 mm (1.2 in) MK 108 cannons mounted either in the wing, or in underwing, conformal mount gun pods, was made for the Sturmbock Focke-Wulfs as either the /R2 or /R8 field modification kits, enabling aircraft to bring a bomber down with just a few hits.[95]",
			"color": " "
		}
	}
}
