{
	"add": {
		"doc": {
			"id": "87dc6631d3d5231a5def4a2f11d115eded68559f8ce2ff71305ff2e6850bb360",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Phagocytosis2.png/220px-Phagocytosis2.png",
				"previous": "A phagocyte has many types of receptors on its surface that are used to bind material.[2] They include opsonin receptors, scavenger receptors, and Toll-like receptors. Opsonin receptors increase the phagocytosis of bacteria that have been coated with immunoglobulin G (IgG) antibodies or with complement. \"Complement\" is the name given to a complex series of protein molecules found in the blood that destroy cells or mark them for destruction.[27] Scavenger receptors bind to a large range of molecules on the surface of bacterial cells, and Toll-like receptors—so called because of their similarity to well-studied receptors in fruit flies that are encoded by the Toll gene—bind to more specific molecules. Binding to Toll-like receptors increases phagocytosis and causes the phagocyte to release a group of hormones that cause inflammation.[2]",
				"after": "The killing of microbes is a critical function of phagocytes[28] that is performed either within the phagocyte (intracellular killing) or outside of the phagocyte (extracellular killing).",
			"color": "lavender|0.36391 light|0.18548 steel|0.18548 blue|0.18548 alice|0.10582 blue|0.10582 ghost|0.078837 white|0.078837 gainsboro|0.071145 white|0.056623 smoke|0.056623 lavender|0.013773 blush|0.013773 azure|0.012372 snow|0.012267 white|0.011548 light|0.0083027 sky|0.0083027 blue|0.0083027 red|0.0082223 mint|0.0078402 cream|0.0078402 thistle|0.0076192 light|0.0074382 slate|0.0074382 gray|0.0074382 slate|0.0049689 gray|0.0049689 dark|0.0043691 gray|0.0043691 dark|0.0043691 grey|0.0043691 steel|0.0041413 blue|0.0041413 sky|0.0041011 blue|0.0041011 sea|0.0039847 shell|0.0039847 dim|0.0036756 gray|0.0036756 dim|0.0036756 grey|0.0036756 light|0.0031719 gray|0.0031719 light|0.0031719 grey|0.0031719  "
		}
	}
}
