{
	"add": {
		"doc": {
			"id": "87e857b1f3e90b0953865fc516b4eb85ff056a557f5c81f12970ddb5a0b1a8b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/USNS_PFC_Dewayne_T._Williams_%28T-AK-3009%29_during_Operation_Desert_Shield.jpeg/220px-USNS_PFC_Dewayne_T._Williams_%28T-AK-3009%29_during_Operation_Desert_Shield.jpeg",
				"previous": "Fore River Shipyard has also appeared in multiple films since it was closed. The final scene from the 2005 film The Departed was filmed in the yard.[43] In 2009, the film The Company Men was filmed at the site of the former yard.[44][43] For the 2015 film The Finest Hours, sets are being constructed at the yard, along with a giant water tank.[45]",
				"after": "During the almost one hundred years that the yard was operational, it produced hundreds of ships, submarines, and personal sailing vessels. Among these orders were the civilian ships the Barnacle and the multiple-masted schooners the Thomas W. Lawson and William L. Douglas. The yard also produced military contracts, including USS Lawrence (DD-8) and USS Macdonough (DD-9). Additionally, submarines were constructed, including USS Octopus (SS-9) for the United States Navy, and others for both the Imperial Japanese Navy and the Royal Navy. As the yard was expanded over the years, it built battleships such as USS New Jersey (BB-16), USS Nevada (BB-36), and the preserved USS Massachusetts (BB-59), itself moored in Battleship Cove. Other naval ships include the preserved heavy cruiser USS Salem (CA-139) (as part of the United States Naval Shipbuilding Museum adjacent to the shipyard), USS Northampton (CLC-1), and USS Long Beach (CGN-9). Finally, the yard constructed multiple aircraft carriers, including the conversion of the battlecruiser USS Lexington CC-1''s hull into USS Lexington (CV-2), USS Lexington (CV-16), USS Bunker Hill (CV-17), and USS Philippine Sea (CV-47).[1]",
			"color": "black|0.40845 silver|0.17785 light|0.15132 gray|0.15132 light|0.15132 grey|0.15132 gainsboro|0.10093 dark|0.05217 gray|0.05217 dark|0.05217 grey|0.05217 dim|0.029825 gray|0.029825 dim|0.029825 grey|0.029825 slate|0.023286 gray|0.023286 dark|0.021644 slate|0.021644 gray|0.021644 gray|0.016991 grey|0.016991 light|0.013723 slate|0.013723 gray|0.013723  "
		}
	}
}
