{
	"add": {
		"doc": {
			"id": "87f8ba3093d2308119f0e734a159b0f63a3521bf2fbd44a50a1efbb5030d7383",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Starr_040723-0267_Verbascum_thapsus.jpg/170px-Starr_040723-0267_Verbascum_thapsus.jpg",
				"previous": "On flowering plants the leaves are alternately arranged up the stem. They are thick and decurrent, with much variation in leaf shape between the upper and lower leaves on the stem, ranging from oblong to oblanceolate, and reaching sizes up to 50 cm long and 14 cm across (19 inches long and 5 inches wide).[6][7] They become smaller higher up the stem,[1][2] and less strongly decurrent down the stem.[1] The flowering stem is solid and 2–2.5 cm (nearly an inch) across, and occasionally branched just below the inflorescence,[2] usually following damage.[8] After flowering and seed release the stem and fruits usually persist in winter,[9] drying into dark brown, stiff structures of densely packed, ovoid-shaped and dry seed capsules. The dried stems may persist into the following spring or even the next summer. The plant produces a shallow taproot.[7]",
				"after": "Flowers are pentamerous with (usually) five stamen, a 5-lobed calyx tube and a 5-petalled corolla, the latter bright yellow and an 1.5–3 cm (0.5–1 inch) wide. The flowers are almost sessile, with very short pedicels (2 mm, 0.08 in). The five stamens are of two types, with the three upper stamens being shorter, their filaments covered by yellow or whitish hairs, and having smaller anthers, while the lower two stamens have glabrous filaments and larger anthers.[4][note 1] The plant produces small ovoid (6 mm, 0.24 in) capsules that split open by way of two valves, each capsule containing large numbers of minute brown seeds less than a millimetre (0.04 in)[10] in size, marked with longitudinal ridges. A white-flowered form, V. thapsus f. candicans, is known to occur.[11] Flowering lasts for up to three months from early to late summer (June to August in northern Europe),[2] with flowering starting at the bottom of the spike and progressing irregularly upward; each flower opens for part of a day and only a few open at the same time around the stem.[9]",
			"color": "dark|0.24759 khaki|0.24759 dark|0.21983 olive|0.21983 green|0.21983 olive|0.10142 dark|0.094712 gray|0.094712 dark|0.094712 grey|0.094712 silver|0.092776 dim|0.050378 gray|0.050378 dim|0.050378 grey|0.050378 light|0.044711 gray|0.044711 light|0.044711 grey|0.044711 gray|0.033333 grey|0.033333 gainsboro|0.025427 dark|0.021955 golden|0.021955 rod|0.021955  "
		}
	}
}
