{
	"add": {
		"doc": {
			"id": "87fd5137091d5b3049b004503e3f2c4abec7ac2260c3683406d2b22e8ed1e59f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/French_Empire_evolution.gif/220px-French_Empire_evolution.gif",
				"previous": "After a short-lived governmental scheme, Napoleon Bonaparte seized control of the Republic in 1799 becoming First Consul and later Emperor of the French Empire (1804–1814/1815). As a continuation of the wars sparked by the European monarchies against the French Republic, changing sets of European Coalitions declared wars on Napoleon's Empire. His armies conquered most of continental Europe, while members of the Bonaparte family were appointed as monarchs in some of the newly established kingdoms.[54] These victories led to the worldwide expansion of French revolutionary ideals and reforms, such as the Metric system, the Napoleonic Code and the Declaration of the Rights of Man. After the catastrophic Russian campaign, and the ensuing uprising of European monarchies against his rule, Napoleon was defeated and the Bourbon monarchy restored. About a million Frenchmen died during the Napoleonic Wars.[54]",
				"after": "After his brief return from exile, Napoleon was finally defeated in 1815 at the Battle of Waterloo, the monarchy was re-established (1815–1830), with new constitutional limitations. The discredited Bourbon dynasty was overthrown by the July Revolution of 1830, which established the constitutional July Monarchy, which lasted until 1848, when the French Second Republic was proclaimed, in the wake of the European Revolutions of 1848. The abolition of slavery and male universal suffrage, both briefly enacted during the French Revolution were re-enacted in 1848. In 1852, the president of the French Republic, Louis-Napoléon Bonaparte, Napoleon I's nephew, was proclaimed emperor of the second Empire, as Napoleon III. He multiplied French interventions abroad, especially in Crimea, in Mexico and Italy. Napoleon III was unseated following defeat in the Franco-Prussian War of 1870 and his regime was replaced by the Third Republic. France had colonial possessions, in various forms, since the beginning of the 17th century, but in the 19th and 20th centuries, its global overseas colonial empire extended greatly and became the second largest in the world behind the British Empire. Including metropolitan France, the total area of land under French sovereignty almost reached 13 million square kilometres in the 1920s and 1930s, 8.6% of the world's land. In 1905, state secularism was officially established.",
			"color": " "
		}
	}
}
