{
	"add": {
		"doc": {
			"id": "880bc83e666ac12b2e322fd88d1bf01d443f636bf1b453a5e1d2ca077c0f7c9b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Canal_Monument_in_Lock_Haven_Pennsylvania.JPG/220px-Canal_Monument_in_Lock_Haven_Pennsylvania.JPG",
				"previous": "Lock Haven was laid out as a town in 1833,[15] and it became the county seat in 1839, when the county was created out of parts of Lycoming and Centre counties.[16] Incorporated as a borough in 1840 and as a city in 1870,[15] Lock Haven prospered in the 19th century largely because of timber and transportation. The forests of Clinton County and counties upriver held a huge supply of white pine and hemlock as well as oak, ash, maple, poplar, cherry, beech, and magnolia. The wood was used locally for such things as frame houses, shingles, canal boats, and wooden bridges, and whole logs were floated to Chesapeake Bay and on to Baltimore, to make spars for ships. Log driving and log rafting, competing forms of transporting logs to sawmills, began along the West Branch around 1800. By 1830, slightly before the founding of the town, the lumber industry was well established.[17]",
				"after": "The West Branch Canal, which opened in 1834, ran 73 miles (117 km) from Northumberland to Farrandsville, about 5 miles (8 km) upstream from Lock Haven. A state-funded extension called the Bald Eagle Cut ran from the West Branch through Lock Haven and Flemington to Bald Eagle Creek. A privately funded extension, the Bald Eagle and Spring Creek Navigation, eventually reached Bellefonte, 24 miles (39 km) upstream. Lock Haven's founder, Jeremiah Church, and his brother, Willard, chose the town site in 1833 partly because of the river, the creek, and the canal. Church named the town Lock Haven because it had a canal lock and because it was a haven for loggers, boatmen, and other travelers. Over the next quarter century, canal boats 12 feet (4 m) wide and 80 feet (24 m) long carried passengers and mail as well as cargo such as coal, ashes for lye and soap, firewood, food, furniture, dry goods, and clothing. A rapid increase in Lock Haven's population (to 830 by 1850)[18] followed the opening of the canal.[19]",
			"color": "dim|0.52293 gray|0.52293 dim|0.52293 grey|0.52293 dark|0.13866 slate|0.13866 gray|0.13866 gray|0.13738 grey|0.13738 dark|0.085184 olive|0.085184 green|0.085184 black|0.042406 dark|0.03155 gray|0.03155 dark|0.03155 grey|0.03155 silver|0.021013 slate|0.0073937 gray|0.0073937 light|0.0058659 slate|0.0058659 gray|0.0058659  "
		}
	}
}
