{
	"add": {
		"doc": {
			"id": "880d1e29e9c8af23ee8150d5e7b68a8a984bc8744b82c1bc908f0a6275f2db34",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Convair-240-color.jpg/220px-Convair-240-color.jpg",
				"previous": "In 1941 Western Air Express changed its name to Western Air Lines (WAL) and later to Western Airlines. The carrier also billed itself as Western Airlines International at one point. After World War II, Western was awarded a route from Los Angeles to Denver via Las Vegas, but financial problems forced Western to sell the route as well as Douglas DC-6 new aircraft delivery positions to United Air Lines in 1947. Western was later awarded a route between Minneapolis and Salt Lake City via Casper, Wyoming, thus allowing the airline to develop from a large regional airline into a major mainline air carrier. This growth also enabled the airline to introduce Douglas DC-6 (DC-6B models), Lockheed L-188 Electra turboprops and eventually Boeing 707 service. The airline's president was Terrell \"Terry\" Drinkwater. Drinkwater got into a dispute with the administration in Washington D.C. which severely hampered WAL's growth. Pressured in a famous phone call by President Dwight D. Eisenhower to \"buy American made aircraft\", Drinkwater reportedly responded: \"Mr. President, you run your country and let me run my airline!\" For years after this exchange, the federal Civil Aeronautics Board (CAB) would not award Western new routes while their major competitors including United and American grew enormous even though all of Western's airliners were of U.S. manufacture while their competitor's fleets included aircraft that had been built in Europe by British or French companies.",
				"after": "In August 1953 Western was serving 38 airports. By June 1968, that number had only grown to 42 airports.",
			"color": "gray|0.47048 grey|0.47048 dim|0.17264 gray|0.17264 dim|0.17264 grey|0.17264 black|0.071792 dark|0.068773 gray|0.068773 dark|0.068773 grey|0.068773 light|0.031012 slate|0.031012 gray|0.031012 light|0.027393 steel|0.027393 blue|0.027393 steel|0.019691 blue|0.019691 slate|0.018675 gray|0.018675 silver|0.018569 light|0.012599 gray|0.012599 light|0.012599 grey|0.012599 light|0.01008 blue|0.01008 gainsboro|0.0096526 dark|0.0077617 slate|0.0077617 gray|0.0077617 lavender|0.0049899  "
		}
	}
}
