{
	"add": {
		"doc": {
			"id": "881e35c51a3af8641d342972f7d4fcc0170d5a87cc5348492f2de743d37fc215",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/1865_Two_Cent_Obverse.png/220px-1865_Two_Cent_Obverse.png",
				"previous": "Mint Director James Pollock had been opposed to striking coins containing nickel but in view of the initial success of the copper-nickel three-cent piece, he became an advocate of striking five-cent pieces in the same metal. In his 1865 report Pollock wrote, \"From this nickel alloy, a coin for the denomination of five cents, and which would be a popular substitute for the five cent note, could easily be made ... [The five cent coin should be struck in base metal] only until the resumption of specie payments ... in time of peace ... coins of inferior alloy should not be permitted to take the place permanently of silver in the coinage of pieces above the denomination of three cents.\"[6]",
				"after": "Industrialist Joseph Wharton had a near-monopoly on the mining of nickel in the United States and sought to promote its use in coinage.[7] He was also highly influential in Congress. His friends there, though they had failed to obtain the metal's use for the two-cent piece, had been more successful with the three-cent coin.[8] Pollock prepared a bill authorizing a five-cent coin of the same alloy as the three-cent piece and a total weight not to exceed 60 grains (3.9 g). At the committee stage in the House of Representatives, the weight was amended to 77.19 grains (5.00 g), ostensibly to make the weight equal to five grams in the metric system[a] but more likely so that Wharton could sell more nickel.[6] This made the new coin heavy in comparison to the three-cent copper-nickel coin. The bill passed without debate on May 16, 1866.[6] The new copper-nickel coin was legal tender for up to one dollar, and would be paid out by the Treasury in exchange for coin of the United States, excluding the half cent, cent and two-cent. It was redeemable in lots of $100 for banknotes. Fractional currency in denominations of less than ten cents was withdrawn.[9][10]",
			"color": "peru|0.83466 sandy|0.097523 brown|0.097523 tan|0.028154  "
		}
	}
}
