{
	"add": {
		"doc": {
			"id": "88319b4a5644d61f5f513ed901a9d1a68d019c1103e5899f6102983ba1d56951",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Herminium_monorchis_%28plant%29.jpg/220px-Herminium_monorchis_%28plant%29.jpg",
				"previous": "Darwin's speculations on the origin of species convinced him that cross-fertilisation played an important role in keeping specific forms consistent. He rejected the doctrine that the characteristics of a species were static, and was aware from animal husbandry that inbreeding could lead to changes, often deleterious. He thought that natural outbreeding through cross-fertilisation would keep wild species homogenous yet vigorous. Cross-fertilisation would confer an evolutionary advantage by spreading favourable changes throughout a reproductive community. His ideas were contrary to the common supposition that plants were usually self-fertilising, and so every summer Darwin investigated the contribution of insect pollination to the cross-pollination of flowers.[3][4]",
				"after": "In the summer of 1841 Charles and Emma Darwin moved from the turmoil of London to the countryside, to Down House, a quiet former parsonage in the village of Downe. He wrote, \"The flowers are here very beautiful\".[5] Darwin followed the recommendation of his friend, the leading botanist Robert Brown, and read Das entdeckte Geheimnis der Natur im Bau und in der Befruchtung der Blumen (The Secret of Nature in the Form and Fertilisation of Flowers Discovered[6]).[3] The little known book, published in 1793 by Christian Konrad Sprengel but never translated into English, introduced the idea that flowers were created by God to fulfill a teleological purpose: insects would act as \"living brushes\" to cross-fertilise plants in a symbiotic relationship. This functional view was rejected and mostly forgotten, as it contradicted the common belief that flowers had been created for beauty, and were generally self-fertilising. For Darwin, the concept of evolution gave new meaning to Sprengel's research into the mechanisms for cross-fertilisation. He welcomed its support for his supposition that cross-fertilisation in flowering plants tended to allow their offspring to avoid possible disadvantages resulting from self-fertilisation,[7] and by 1845 he had verified many of Sprengel's observations.[8]",
			"color": "olive|0.38627 drab|0.38627 olive|0.19188 dark|0.16153 khaki|0.16153 dark|0.13035 olive|0.13035 green|0.13035 khaki|0.054902 pale|0.027927 golden|0.027927 rod|0.027927  "
		}
	}
}
