{
	"add": {
		"doc": {
			"id": "88399744028fc15ed7df17d5b4e6c138905e4e3468db465978339e704475c301",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Himachal_Pradesh_locator_map.svg/300px-Himachal_Pradesh_locator_map.svg.png",
			"previous": [],
				"after": "Himachal Pradesh is a state in the north-west of India. Himachal Pradesh is spread over 55,673 square kilometres (21,495 sq mi) and is bordered by the Indian states of Jammu and Kashmir on the north, Punjab on the west and south-west, Haryana on the south, Uttarakhand on the south-east and by Tibet area of China on the east. The literal meaning of Himachal Pradesh is land of snowy mountains. Himachal Pradesh was also known as Deva Bhoomi (i.e. the land of the gods). The Aryan influence in the region dates back to the period before the Rigveda. After the Anglo Gorkha war British colonial government came into power. In 1950 Himachal was declared as the union territory but after the State of Himachal Pradesh Act was enacted in 1971 Himchal emerged as the 18th state of the Indian Union. The state is located at altitudes ranging from 450 metres (1,476 ft) to 6,500 metres (21,325 ft) above sea level. The state capital is Shimla (formerly British India's summer capital under the name Simla); other major towns include Solan, Dharamsala, Kangra, Mandi, Kullu, Chamba, Hamirpur, Dalhousie and Manali.",
			"color": "lavender|0.41899 misty|0.16308 rose|0.16308 lemon|0.099159 chiffon|0.099159 pale|0.095448 golden|0.095448 rod|0.095448 light|0.094547 golden|0.094547 rod|0.094547 yellow|0.094547 light|0.010616 steel|0.010616 blue|0.010616 alice|0.0077013 blue|0.0077013 ghost|0.0070444 white|0.0070444 white|0.0065627 smoke|0.0065627 beige|0.0064035 lavender|0.0057445 blush|0.0057445 floral|0.0055709 white|0.0055709 sea|0.0055244 shell|0.0055244 snow|0.0054816 honeydew|0.005352 mint|0.0051629 cream|0.0051629 white|0.0051122 salmon|0.0050769 gainsboro|0.0047683 pink|0.0045545 azure|0.004256 ivory|0.0042294 thistle|0.0034934 linen|0.0032993  "
		}
	}
}
