{
	"add": {
		"doc": {
			"id": "88476cd238a4e8dddef4849f7f054c2d8acc0c32ca2d3e6fb5140d1e77455de4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Stanfordchurch-ascension.jpg/220px-Stanfordchurch-ascension.jpg",
			"previous": [],
				"after": "According to architectural historian Willis L. Hall, the church's 20 large stained glass windows \"are as much a feature of the church as the mosaics\".[74] The windows, designed by Frederick Stymetz Lamb (1863–1928) and fabricated by J&R Lamb Studios, his father's firm in New York City, took three years to complete,[9] and eight months to install at Stanford.[82] Jane Stanford hired Lamb because she felt he was more interested in \"the ecclesiastical rather than commercial aspect of the work\".[83] The installation of the windows at Stanford Memorial Church was the largest enterprise of its kind at the time, and the project is considered one of the best examples of Lamb's work.[70] Stanford chose the life of Christ for the windows' theme, inspired by the religious paintings by European master painters such as Shields and Doré. Her personal touch is shown in one of the nave windows, which is based on a cartoon by Paoletti and depicts Christ welcoming the soul of a child into Heaven before the eyes of its grieving mother, an allusion to the death of Leland Stanford, Jr.,[9] the Stanfords' only child and the university's namesake, who died in 1884 of typhoid shortly before his 16th birthday.",
			"color": "black|0.499 dim|0.061515 gray|0.061515 dim|0.061515 grey|0.061515 gray|0.060104 grey|0.060104 dark|0.053502 gray|0.053502 dark|0.053502 grey|0.053502 dark|0.0329 slate|0.0329 gray|0.0329 rosy|0.030491 brown|0.030491 silver|0.028535 slate|0.025484 gray|0.025484 light|0.022593 slate|0.022593 gray|0.022593 light|0.017495 gray|0.017495 light|0.017495 grey|0.017495 gainsboro|0.012217 light|0.010095 steel|0.010095 blue|0.010095 tan|0.0079427 steel|0.0075022 blue|0.0075022 antique|0.006667 white|0.006667 linen|0.0065216 sea|0.0064597 shell|0.0064597 white|0.0061548 smoke|0.0061548 floral|0.0060481 white|0.0060481  "
		}
	}
}
