{
	"add": {
		"doc": {
			"id": "88491d70bd321756260e123541331050ee934dc408cedf76dd08ff0c0d4072e1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/B-58_Escape_Capsule.jpg/220px-B-58_Escape_Capsule.jpg",
				"previous": "Drag Extraction is the lightest and simplest egress system available, and has been used on many experimental aircraft. Halfway between simply \"bailing out\" and using explosive-eject systems, Drag Extraction uses the airflow past the aircraft (or spacecraft) to move the aviator out of the cockpit and away from the stricken craft on a guide rail. Some operate like a standard ejector seat, by jettisoning the canopy, then deploying a drag chute into the airflow. That chute pulls the occupant out of the aircraft, either with the seat or following release of the seat straps, who then rides off the end of a rail extending far enough out to help clear the structure. In the case of the Space Shuttle, the astronauts would have ridden a long, curved rail, blown by the wind against their bodies, then deployed their chutes after free-falling to a safe altitude.",
				"after": "Encapsulated Seat egress systems were developed for use in the B-58 Hustler and B-70 Valkyrie supersonic bombers. These seats were enclosed in an air-operated clamshell, which permitted the aircrew to escape at airspeeds and altitudes high enough to otherwise cause bodily harm. These seats were designed to allow the pilot to control the plane even with the clamshell closed, and the capsule would float in case of water landings.",
			"color": "antique|0.089005 white|0.089005 dim|0.066396 gray|0.066396 dim|0.066396 grey|0.066396 linen|0.060989 old|0.053159 lace|0.053159 orange|0.050534 red|0.050534 sea|0.04715 shell|0.04715 tan|0.046302 floral|0.045588 white|0.045588 gray|0.041684 grey|0.041684 ivory|0.041572 papaya|0.036947 whip|0.036947 beige|0.036681 dark|0.028345 gray|0.028345 dark|0.028345 grey|0.028345 white|0.026975 smoke|0.026975 snow|0.023335 corn|0.022833 silk|0.022833 silver|0.022716 mint|0.022651 cream|0.022651 light|0.021495 gray|0.021495 light|0.021495 grey|0.021495 blanched|0.01983 almond|0.01983 white|0.016622  "
		}
	}
}
