{
	"add": {
		"doc": {
			"id": "884de863b64eaeb34e17ba47450ab433afa64978ddd63542d261303d60cfb996",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Crowd_around_the_Liberty_Bell%2C_1951_-_cropped.jpg/170px-Crowd_around_the_Liberty_Bell%2C_1951_-_cropped.jpg",
				"previous": "In the postwar period, the bell became a symbol of freedom used in the Cold War. The bell was chosen for the symbol of a savings bond campaign in 1950. The purpose of this campaign, as Vice President Alben Barkley put it, was to make the country \"so strong that no one can impose ruthless, godless ideologies on us\".[66] In 1955, former residents of nations behind the Iron Curtain were allowed to tap the bell as a symbol of hope and encouragement to their compatriots.[67] Foreign dignitaries, such as Israeli Prime Minister David Ben-Gurion and West Berlin Mayor Ernst Reuter were brought to the bell, and they commented that the bell symbolized the link between the United States and their nations.[66] During the 1960s, the bell was the site of several protests, both for the civil rights movement, and by various protesters supporting or opposing the Vietnam War.[68]",
				"after": "Almost from the start of its stewardship, the Park Service sought to move the bell from Independence Hall to a structure where it would be easier to care for the bell and accommodate visitors. The first such proposal was withdrawn in 1958, after considerable public protest.[69] The Park Service tried again as part of the planning for the 1976 United States Bicentennial. The Independence National Historical Park Advisory Committee proposed in 1969 that the bell be moved out of Independence Hall, as the building could not accommodate the millions expected to visit Philadelphia for the Bicentennial.[70] In 1972, the Park Service announced plans to build a large glass tower for the bell at the new visitors center at South Third Street and Chestnut Street, two blocks east of Independence Hall, at a cost of $5 million, but citizens again protested the move. Instead, in 1973, the Park Service proposed to build a smaller glass pavilion for the bell at the north end of Independence Mall, between Arch and Race Streets. Philadelphia Mayor Frank Rizzo agreed with the pavilion idea, but proposed that the pavilion be built across Chestnut Street from Independence Hall, which the state feared would destroy the view of the historic building from the mall area.[71] Rizzo's view prevailed, and the bell was moved to a glass-and-steel Liberty Bell Pavilion, about 200 yards (180 m) from its old home at Independence Hall, as the Bicentennial year began.[72]",
			"color": "dim|0.19923 gray|0.19923 dim|0.19923 grey|0.19923 gray|0.1431 grey|0.1431 black|0.12043 dark|0.11695 gray|0.11695 dark|0.11695 grey|0.11695 light|0.082115 gray|0.082115 light|0.082115 grey|0.082115 silver|0.076139 gainsboro|0.075518 white|0.037966 smoke|0.037966 lavender|0.02145 blush|0.02145 alice|0.021407 blue|0.021407 ghost|0.020582 white|0.020582 snow|0.017655 sea|0.017323 shell|0.017323 linen|0.015926 white|0.01317 mint|0.0090269 cream|0.0090269 azure|0.0064115 floral|0.0050723 white|0.0050723  "
		}
	}
}
