{
	"add": {
		"doc": {
			"id": "885b59d2fad32153282d0a8ed68aae79a20db7e1fc27ac7b8bf3b9476339bde4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Tumbler_Ridge_BC_crime.png/220px-Tumbler_Ridge_BC_crime.png",
				"previous": "The Canada 2006 Census reported 2,454 residents living in 1,045 households and 765 families.[26] This was 27% more people than the previous census five years earlier when the town was at its lowest population level since opening. The median age increased from 38.8 years in 2001 to 42.2 in 2006, as the proportion of the population aged over 65 rose from 5% to 11%. In 2006, of those over 15 years of age, 62% were married, higher than the 54% provincial average. The town has few visible minorities as 94% of Tumbler Ridge residents were Canadian-born and 93% had English as their first language.[26] Though not included as a minority, 9% of residents claimed to have an Aboriginal identity.[26] Reflecting the nature of the industrial jobs available in town, in 2001, only 12% of residents between 20 and 64 years of age completed university, half of the provincial average, and 26% did not complete high school, much higher than the 19% provincial average.[25]",
				"after": "In 2005, the five officer Tumbler Ridge Royal Canadian Mounted Police municipal detachment reported 346 Criminal Code of Canada offenses. This translated into a crime rate of 137 Criminal Code offenses per 1,000 people, higher than the provincial average of 119 offenses. During that year, the RCMP reported lower crime rates in Tumbler Ridge, compared with the provincial averages, in all categories except bicycle thefts, property damage, impaired driving, and cannabis-related offenses. Until 2005, the town had a lower crime rate than the province, except between 2001–2003 after the Quintette mine closure and a large out-migration from the town. In 2004 the Tumbler Ridge RCMP reported no robbery or shoplifting offenses, and only 4.5 theft-from-motor-vehicle offenses per 1,000 people compared with 20 provincially.[27]",
			"color": "ghost|0.088577 white|0.088577 white|0.088061 smoke|0.088061 alice|0.08769 blue|0.08769 snow|0.086711 white|0.085913 sea|0.085822 shell|0.085822 lavender|0.085685 blush|0.085685 mint|0.083681 cream|0.083681 floral|0.083277 white|0.083277 azure|0.082708 dark|0.028255 gray|0.028255 dark|0.028255 grey|0.028255 gray|0.017983 grey|0.017983 lavender|0.017411 silver|0.017311 light|0.011422 gray|0.011422 light|0.011422 grey|0.011422 dim|0.010761 gray|0.010761 dim|0.010761 grey|0.010761 misty|0.0097955 rose|0.0097955 gainsboro|0.009196 pink|0.0050468 linen|0.0044519 ivory|0.0039805  "
		}
	}
}
