{
	"add": {
		"doc": {
			"id": "8864fad7d44f2a1864e6f7fc0fa75550f92e9e5e6a59dcdbd8c82f025ef78261",
			"url": "https://upload.wikimedia.org/wikipedia/en/a/a5/Bankes-Myers-Walpole.jpg",
				"previous": "Coleridge and William Wordsworth were close friends and collaborators; when Wordsworth and his sister Dorothy took up residence in the Lake District in late 1799 it was, in Bott's word, inevitable that Coleridge would follow suit. Six months after the Wordsworths moved into Dove Cottage at Grasmere, Coleridge leased Greta Hall in Keswick, 12 miles (19 km) away.[151] In 1803 Robert Southey, Coleridge's brother-in-law, agreed to share the house with Coleridge and his family. Southey remained at Greta Hall after Coleridge left in 1804, and it remained Southey's family home until his death in 1843.[152] Many famous literary figures stayed at Greta Hall in these years, including the Wordsworths, Charles and Mary Lamb, Thomas de Quincey, William Hazlitt, Percy Bysshe Shelley, and Sir Walter Scott.[31] Lamb, a Londoner devoted to his native city, remained doubtful of the attractions of the Lake District, but most of the visitors to Greta Hall wrote eloquently of the beauty of the scenery, and further enhanced the public regard for, and desire to visit, the area.[31] Southey was well regarded locally, but played little part in the life of the town.[31] He is buried in Crosthwaite churchyard and there is a memorial to him inside the church, with an inscription written by Wordsworth.[153]",
				"after": "Among Keswick notables before the Lake Poets was Sir John Bankes, a leading Royalist during the English Civil War. He was Charles I's Attorney General and Chief Justice. Bankes was born at Castlerigg near Keswick in 1589.[154] A bust in his memory is in upper Fitz Park close to the museum.[155] In 2014 he was further commemorated by the conversion of the former Keswick courthouse into a bar named in his honour with his full title, \"The Chief Justice of the Common Pleas\".[156]",
			"color": "tan|0.22538 dark|0.20241 khaki|0.20241 wheat|0.1819 peru|0.12473 bisque|0.03814 blanched|0.034165 almond|0.034165  "
		}
	}
}
