{
	"add": {
		"doc": {
			"id": "886564878ee16d2a119b1001225274e45ed9ca3faa1125f9abc115c6be21755e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Edward_J._Noble.jpg",
				"previous": "In 1934, Mutual filed a complaint with the Federal Communications Commission (FCC) regarding its difficulties in establishing new stations, in a radio market that was already being saturated by NBC and CBS.[4] In 1938, the FCC began a series of investigations into the practices of radio networks[4] and published its report on the broadcasting of network radio programs in 1940. The report recommended that RCA give up control of either NBC Red or NBC Blue.[6] At that time, the NBC Red Network was the principal radio network in the United States and, according to the FCC, RCA was using NBC Blue to eliminate any hint of competition. Having no power over the networks themselves, the FCC established a regulation forbidding licenses to be issued for radio stations if they were affiliated with a network which already owned multiple networks[6] that provided content of public interest.[4]",
				"after": "Once Mutual's appeals against the FCC were rejected, RCA decided to sell NBC Blue in 1941, and gave the mandate to do so to Mark Woods.[7] RCA converted the NBC Blue Network into an independent subsidiary, formally divorcing the operations of NBC Red and NBC Blue on January 8, 1942,[4][8] with the Blue Network being referred to on-air as either \"Blue\" or \"Blue Network\".[9] The newly separated NBC Red and NBC Blue divided their respective corporate assets. Between 1942 and 1943, Woods offered to sell the entire NBC Blue Network,[5][10] a package that included leases on landlines, three pending television licenses (WJZ-TV in New York City, KGO-TV in San Francisco and WENR-TV in Chicago), 60 affiliates, four operations facilities (in New York City, Chicago, Los Angeles and Washington D.C.), contracts with actors, and the brand associated with the Blue Network. Investment firm Dillon, Read & Co. (which was later acquired by the Swiss Bank Corporation in 1997) offered $7.5 million to purchase the network, but the offer was rejected by Woods and RCA president David Sarnoff.[5]",
			"color": "dark|0.33822 gray|0.33822 dark|0.33822 grey|0.33822 silver|0.19495 gray|0.17382 grey|0.17382 light|0.082335 gray|0.082335 light|0.082335 grey|0.082335 dim|0.072905 gray|0.072905 dim|0.072905 grey|0.072905 gainsboro|0.042373 white|0.014458 smoke|0.014458 alice|0.010232 blue|0.010232 lavender|0.010123 blush|0.010123 ghost|0.0099927 white|0.0099927 sea|0.0097292 shell|0.0097292 snow|0.0096158 white|0.0082435 linen|0.0081197 mint|0.0063217 cream|0.0063217 floral|0.0039587 white|0.0039587 azure|0.0030325  "
		}
	}
}
