{
	"add": {
		"doc": {
			"id": "88784485b61973ad0611b9be29e3ccafdced02338e78d291992491fffa81786b",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5e/WABrown.jpg/220px-WABrown.jpg",
			"previous": [],
				"after": "Brown was regarded as a cautious starter who was reluctant to use his full array of strokes.[30] He had an upright stance and was known for his trademark leg glancing and placement of the ball.[1][4][9][77] He hooked occasionally and scored the majority of his off-side runs with the cut shot.[77] Johnnie Moyes said that \"even when slow, he never wearied, as some do, because his style was cultured and free from jarring faults\".[78] Moyes felt that Brown's superior record on English soil was a result of the crowd attitude, which was more respectful.[10] At Australian grounds, impatient spectators who disliked Brown's cautious batting frequently heckled him, blaming Brown for delaying Bradman's arrival to the crease.[7] Moyes felt that the more serene English gallery allowed Brown to play to his game plan without hastening to placate impatient spectators. \"A placid chap was Brown, and he liked to play in peaceful surroundings. When on the job he was as emotionless as a stoic.\"[10] Moyes said that Brown was \"always cool and thoughtful, he preferred finesse to force\".[30] The English journalist Neville Cardus commented \"His cricket is perpetually keeping an appointment leisurely with moments to spare. Does the bat have an engagement this over with a half-volley? Very well, then, put it down in the book. We'll be there for it. Plenty of time.\"[19] Bradman also noted Brown's ability to quickly get into position to play the ball, writing \"One hallmark of good batting is that the player appears to have plenty of time in which to play his strokes. Bill Brown was an outstanding case of one who never seemed to be in a hurry for any stroke.\"[9] Ray Robinson said that Brown was \"the most serene batsman I ever saw play for Australia\".[5] Robinson said that \"for artistry, Brown's leg-glancing could be mentioned in the same breath as Archie Jackson's\".[77] Brown's placid nature extended to his observations of modern cricket—he disliked the emotional displays made by contemporary players.[5]",
			"color": " "
		}
	}
}
