{
	"add": {
		"doc": {
			"id": "88af167c1e979748f61fddb3f4ea61d3a63857c986c21ff918e43bbfabe8fc07",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Jack_Parsons_FBI.jpg/220px-Jack_Parsons_FBI.jpg",
				"previous": "During this period, Parsons also wrote an essay on his individualist philosophy and politics—which he described as standing for \"liberalism and liberal principles\"—titled \"Freedom is a Two-Edged Sword\", in which he condemned the authoritarianism, censorship, corruption, antisexualism and racism he saw as prevalent in American society.[132] None of these works were published in his lifetime. Through Heinlein, Parsons received a visit from writer L. Sprague de Camp, with whom he discussed magic and science fiction, and disclosed that Hubbard had sent a letter offering him Sara back. De Camp later referred to Parsons as \"An authentic mad genius if I ever met one\", and based the character Courtney James on him in his time travel story A Gun for Dinosaur (1956). Parsons was also visited by Jane Wolfe, who unsuccessfully appealed for him to rejoin the dilapidated OTO. He entered a brief relationship with an Irishwoman named Gladis Gohan; they moved to a house on Redondo Beach, a building known by them as the \"Concrete Castle\".[134][128] Cameron returned to Redondo Beach from San Miguel de Allende and violently argued with Parsons upon discovering his infidelity, before she again left for Mexico. Parsons responded by initiating divorce proceedings against her on the grounds of \"extreme cruelty\".[135]",
				"after": "Parsons testified to a closed federal court that the moral philosophy of Thelema was both anti-fascist and anti-communist, emphasizing his belief in individualism. This along with references from his scientific colleagues resulted in his security clearance being reinstated by the Industrial Employment Review Board, which ruled that there was insufficient evidence that he had ever had communist sympathies. This allowed Parsons to obtain a contract in designing and constructing a chemical plant for the Hughes Aircraft Company in Culver City.[136] Von Kármán put Parsons in touch with Herbert T. Rosenfeld, President of the Southern Californian chapter of the American Technion Society—a Zionist group dedicated to supporting the newly created State of Israel. Rosenfeld offered Parsons a job with the Israeli rocket program and hired him to produce technical reports for them.[137] In November 1950, as the Red Scare intensified, Parsons decided to migrate to Israel to pursue Rosenfeld's offer, but a Hughes secretary whom Parsons had asked to type up a portfolio of technical documents reported him to the FBI. She accused Parsons of espionage and attempted theft of classified company documents on the basis of some of the reports that he had sought to submit to the Technion Society. Parsons was immediately fired from Hughes; the FBI investigated the complaint and were suspicious that Parsons was spying for the Israeli government. Parsons denied the allegations when interrogated; he insisted that his intentions were peaceful and had suffered an error of judgment in procurement of the documents. Some of Parsons' scientific colleagues rallied to his defense, but the case against him worsened when the FBI investigated Rosenfeld for being linked to Soviet agents, and more accounts of his occult and sexually permissive activities at the Parsonage came to light. In October 1951 the U.S. attorney decided that because the contents of the reports did not constitute state secrets, Parsons was not guilty of espionage.[138][139]",
			"color": "black|0.21674 dim|0.09892 gray|0.09892 dim|0.09892 grey|0.09892 gray|0.088838 grey|0.088838 dark|0.084048 gray|0.084048 dark|0.084048 grey|0.084048 silver|0.057029 light|0.046371 gray|0.046371 light|0.046371 grey|0.046371 white|0.042578 smoke|0.042578 gainsboro|0.039872 ghost|0.037574 white|0.037574 alice|0.037332 blue|0.037332 snow|0.037201 sea|0.036459 shell|0.036459 white|0.035931 lavender|0.035863 blush|0.035863 mint|0.032946 cream|0.032946 floral|0.031541 white|0.031541 azure|0.029371 linen|0.0094834  "
		}
	}
}
