{
	"add": {
		"doc": {
			"id": "88b933a3b4bb72a8e613f31ade315967aebf14b18b003429cd63b1f0450ef95e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Mariano_Moreno.jpg/220px-Mariano_Moreno.jpg",
			"previous": [],
				"after": "The canonical image of Mariano Moreno is the one from the portrait Mariano Moreno en su mesa de trabajo (Spanish: Mariano Moreno at his work desk). It was done by the Chilean artist Pedro Subercaseaux during the centennial of the May Revolution in 1910. The historian Adolfo Carranza asked him to design various allegorical pictures of the event. Carranza belonged to the mainstream line of historians who professed great admiration for Moreno, who he described as follows: \"He was the soul of the government of the revolution of May, his nerve, the distinguished statesman of the group managing the ship attacked the absolutism and doubt, anxious to reach the goal of his aspirations and his destiny. Moreno was the compass and that also grabbed the helm, as he was the strongest and the ablest of those who came to direct it\". He asked for a picture that was consistent with this image. The portrait depicts him as a friendly man with an open and round face, a wide forehead, and a serene look. Subsequent interpretations, like those of Antonio Estrada, would follow this style, as would portraits of other members of the Junta. However, as this portrait was made a hundred years after the death of the subject, with no known depictions done during his lifetime, it was thus based on the artist's imagination. It was known that Moreno had clearly visible smallpox scars from the age of eight, but not to the point where they disfigured his face.[147]",
			"color": "antique|0.18056 white|0.18056 light|0.12083 gray|0.12083 light|0.12083 grey|0.12083 linen|0.10818 gainsboro|0.096217 old|0.078832 lace|0.078832 sea|0.062751 shell|0.062751 papaya|0.059053 whip|0.059053 misty|0.052059 rose|0.052059 floral|0.050066 white|0.050066 beige|0.038305 ivory|0.031834 white|0.026515 smoke|0.026515  "
		}
	}
}
