{
	"add": {
		"doc": {
			"id": "88bbf1970652f7796c410969bd154c03323824f2b15573c213f7c87ebc4af742",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Ponies_in_the_pound_at_a_drift.png/220px-Ponies_in_the_pound_at_a_drift.png",
				"previous": "Colts are assessed in their two-year-old year by the New Forest Pony Breeding and Cattle Society for suitability to be kept as stallions; any animal failing the assessment must be gelded. Once approved, every spring (usually in March), the stallions must pass the Verderers' assessment before they are permitted onto the Forest to breed.[42] The stallion scheme resulted in a reduction of genetic diversity in the ponies running out on the New Forest, and to counteract this and preserve the hardiness of Forest-run ponies, the Verderers introduced the Bloodline Diversity Project, which will use hardy Forest-run mares, mostly over eleven years old, bred to stallions that have not been run out on the Forest, or closely related to those that have.[44]",
				"after": "Drifts to gather the animals are carried out in autumn. Most colts and some fillies are removed, along with any animals considered too \"poor\" to remain on the Forest over the winter. The remaining fillies are branded with their owner's mark, and many animals are wormed.[45][46] Many owners choose to remove a number of animals from the Forest for the winter, turning them out again the following spring.[47] Animals surplus to their owner's requirements often are sold at the Beaulieu Road Pony Sales, run by the New Forest Livestock Society.[48] Tail hair of the ponies is trimmed, and cut into a recognisable pattern to show that the pony's grazing fees have been paid for the year. Each Agister has his own \"tail-mark\", indicating the area of the Forest where the owner lives.[49] The Agisters keep a constant watch over the condition of the Forest-running stock, and an animal may be \"ordered off\" the Forest at any time.[38] The rest of the year, the lives of the ponies are relatively unhindered unless they need veterinary attention or additional feeding, when they are usually taken off the Forest.[50]",
			"color": "dim|0.4024 gray|0.4024 dim|0.4024 grey|0.4024 gray|0.26596 grey|0.26596 dark|0.083789 gray|0.083789 dark|0.083789 grey|0.083789 tan|0.068597 dark|0.044422 olive|0.044422 green|0.044422 silver|0.024444 burly|0.011943 wood|0.011943 wheat|0.011903 peach|0.010888 puff|0.010888 bisque|0.0094443 light|0.0087769 gray|0.0087769 light|0.0087769 grey|0.0087769 slate|0.0074868 gray|0.0074868  "
		}
	}
}
