{
	"add": {
		"doc": {
			"id": "88c046e68525e654442f3f0218af1d26c754aaa463a339a32eed4ce65f3421e4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Ruffs_%28Philomachus_pugnax%29_W_IMG_6570.jpg/220px-Ruffs_%28Philomachus_pugnax%29_W_IMG_6570.jpg",
				"previous": "The ruff breeds in Europe and Asia from Scandinavia and Great Britain almost to the Pacific. In Europe it is found in cool temperate areas, but over its Russian range it is an Arctic species, occurring mainly north of about 65°N. The largest numbers breed in Russia (more than 1 million pairs), Sweden (61,000 pairs), Finland (39,000 pairs) and Norway (14,000 pairs). Although it also breeds from Britain east through the Low Countries to Poland, Germany and Denmark, there are fewer than 2,000 pairs in these more southerly areas.[23]",
				"after": "It is highly gregarious on migration, travelling in large flocks that can contain hundreds or thousands of individuals. Huge dense groups form on the wintering grounds;[21] one flock in Senegal contained a million birds.[3] A minority winter further east to Burma, south China,[3] New Guinea and scattered parts of southern Australia,[24] or on the Atlantic and Mediterranean coasts of Europe. In Great Britain and parts of coastal western Europe, where the breeding and wintering ranges overlap, birds may be present throughout the year.[20] Non-breeding birds may also remain year round in the tropical wintering quarters. The Ruff is an uncommon visitor to Alaska (where it has occasionally bred), Canada and the contiguous states of the US, and has wandered to Iceland, Middle America, northern South America, Madagascar and New Zealand.[3][25] It has been recorded as breeding well south of its main range in northern Kazakhstan, a major migration stopover area.[26][27]",
			"color": "dim|0.5006 gray|0.5006 dim|0.5006 grey|0.5006 gray|0.39333 grey|0.39333 slate|0.040171 gray|0.040171 light|0.017887 slate|0.017887 gray|0.017887 tan|0.017136 dark|0.0076009 gray|0.0076009 dark|0.0076009 grey|0.0076009  "
		}
	}
}
