{
	"add": {
		"doc": {
			"id": "88c20c6dc1af7786f1d76661e18e6f60241b47af43e343c104bf6ae371db4248",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Boym-durian-Lach-and-Kley-3-4-369.png/220px-Boym-durian-Lach-and-Kley-3-4-369.png",
			"previous": [],
				"after": "The durian has been known and consumed in southeastern Asia since prehistoric times, but has only been known to the western world for about 600 years. The earliest known European reference to the durian is the record of Niccolò Da Conti, who travelled to southeastern Asia in the 15th century.[44] Translated from the Latin in which Poggio Bracciolini recorded Da Conti's travels: \"They (people of Sumatra) have a green fruit which they call durian, as big as a watermelon. Inside there are five things like elongated oranges, and resembling thick butter, with a combination of flavours.\"[45] The Portuguese physician Garcia de Orta described durians in Colóquios dos simples e drogas da India published in 1563. In 1741, Herbarium Amboinense by the German botanist Georg Eberhard Rumphius was published, providing the most detailed and accurate account of durians for over a century. The genus Durio has a complex taxonomy that has seen the subtraction and addition of many species since it was created by Rumphius.[9] During the early stages of its taxonomical study, there was some confusion between durian and the soursop (Annona muricata), for both of these species had thorny green fruit.[46] It is also interesting to note the Malay name for the soursop is durian Belanda, meaning Dutch durian.[47] In the 18th century, Johann Anton Weinmann considered the durian to belong to Castaneae as its fruit was similar to the horse chestnut.[46]",
			"color": "dim|0.094011 gray|0.094011 dim|0.094011 grey|0.094011 dark|0.087381 gray|0.087381 dark|0.087381 grey|0.087381 gray|0.086187 grey|0.086187 white|0.064859 smoke|0.064859 sea|0.059849 shell|0.059849 alice|0.059323 blue|0.059323 snow|0.058909 ghost|0.058883 white|0.058883 silver|0.058571 white|0.056868 mint|0.05628 cream|0.05628 lavender|0.055554 blush|0.055554 floral|0.054886 white|0.054886 azure|0.048036 light|0.045236 gray|0.045236 light|0.045236 grey|0.045236 gainsboro|0.038706 linen|0.016352  "
		}
	}
}
