{
	"add": {
		"doc": {
			"id": "88d8f5f579c0bb8f0535a5655c0323c20734edbabbd8703cd2af6f6e1d2cfb46",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Ponies%2C_Black_Gutter_Bottom%2C_New_Forest_-_geograph.org.uk_-_910087.jpg/220px-Ponies%2C_Black_Gutter_Bottom%2C_New_Forest_-_geograph.org.uk_-_910087.jpg",
				"previous": "In the 1850s and 1860s, the quality of the ponies was noted to be declining, a result of poor choice of breeding stallions, and the introduction of Arab to improve the breed was recommended. The census of stock of 1875 reported just under three thousand ponies grazing the Forest, and by 1884 the number had dropped to 2,250. Profits from the sale of young ponies affected the number of mares that commoners bred in subsequent years. The drop in numbers on the Forest may have been a consequence of introducing Arab blood to the breed in the 1870s, resulting in fewer animals suitable for use as pit ponies, or to the increase in the profits from running dairy cattle instead of ponies. The Arab blood may have reduced the ponies' natural landrace hardiness to thrive on the open Forest over winter. Numbers of ponies on the Forest also declined as a result of demand for more refined-looking ponies for riding and driving work prior to the introduction of motor vehicles. Later, the Second World War drove up the demand for, and thus, the market value of, young animals for horse meat.[25]",
				"after": "Founded in 1891, the Society for the improvement of New Forest Ponies organised a stallion show and offered financial incentives to encourage owners of good stallions to run them on the Forest.[26] In 1905 the Burley and District NF Pony Breeding and Cattle Society was set up to start the stud book and organise the Breed Show;[10] the two societies merged in 1937 to form the New Forest Pony Breeding and Cattle Society.[27] Overall numbers of livestock grazing the Forest, including ponies, tended to decline in the early twentieth century; in 1945 there were just 571 ponies depastured.[28] By 1956 the number of ponies of all breeds on the Forest had more than doubled to 1,341. Twenty years later pony numbers were up to 3,589, rising to 4,112 in 1994, before dipping back below four thousand until 2005. As of 2011, there were 4,604 ponies grazing on the New Forest.[29]",
			"color": "dark|0.67313 olive|0.67313 green|0.67313 black|0.21101 olive|0.0766 drab|0.0766  "
		}
	}
}
