{
	"add": {
		"doc": {
			"id": "88db32c373c4727182811323e4f6bd13707a1d5be1f7afa171fc04d451a176c7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/California_population_map.png/300px-California_population_map.png",
			"previous": [
				"However, during the Twentieth Century, two great disaster happened in California. The 1906 San Francisco earthquake and 1928 St. Francis Dam flood remain the deadliest in U.S history.[67]",
				"Meanwhile, attracted to the mild Mediterranean climate, cheap land, and the state's wide variety of geography, filmmakers established the studio system in Hollywood in the 1920s. California manufactured 8.7 percent of total United States military armaments produced during World War II, ranking third (behind New York and Michigan) among the 48 states.[60] After World War II, California's economy greatly expanded due to strong aerospace and defense industries,[61] whose size decreased following the end of the Cold War.[61][62] Stanford University and its Dean of Engineering Frederick Terman began encouraging faculty and graduates to stay in California instead of leaving the state, and develop a high-tech region in the area now known as Silicon Valley.[63] As a result of these efforts, California is regarded as a world center of the entertainment and music industries, of technology, engineering, and the aerospace industry, and as the U.S. center of agricultural production.[64] Just before the \"Dot Com Bust\" California had the 5th largest economy in the world among nations.[65] Yet since 1991, and starting in the late 1980s in Southern California, California has seen a net loss of domestic migrants most years. This is often referred to by the media as the California exodus.[66]"
			],
				"after": "The United States Census Bureau estimates that the population of California was 38,802,500 on July 1, 2014, a 4.16% increase since the 2010 United States Census.[4] Between 2000 and 2009, there was a natural increase of 3,090,016 (5,058,440 births minus 2,179,958 deaths).[72] During this time period, international migration produced a net increase of 1,816,633 people while domestic migration produced a net decrease of 1,509,708, resulting in a net in-migration of 306,925 people.[72] The state of California's own statistics show a population of 38,292,687 for January 1, 2009.[12] However, according to the Manhattan Institute for Policy Research, since 1990 almost 3.4 million Californians have moved to other states, with most leaving to Texas, Nevada, and Arizona.[73]",
			"color": "khaki|0.28665 medium|0.11753 sea|0.11753 green|0.11753 sandy|0.10431 brown|0.10431 sea|0.088475 green|0.088475 red|0.086843 coral|0.082109 tomato|0.067418 dark|0.033627 khaki|0.033627 dark|0.024921 gray|0.024921 dark|0.024921 grey|0.024921  "
		}
	}
}
