{
	"add": {
		"doc": {
			"id": "88e369ccd16de27118915bf4af06e66d80348604d042fbee6bf0bdbf49d71fb7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/British_European_Airways_BAC_1-11_G-AVMX.jpg/220px-British_European_Airways_BAC_1-11_G-AVMX.jpg",
				"previous": "From August 1968, BEA supplemented its Tempelhof-based Viscount fleet with de Havilland Comet 4B series jetliners.[136][143] Although these aircraft could operate from Tempelhof's short runways without payload restrictions, they were not suited to the airline's ultra short-haul operation from Berlin (average stage length: 230 mi (370 km)) given the high fuel consumption of the Comet, especially when operating at the mandatory 10,000 ft (3,000 m) altitude inside the Allied air corridors.[132][133][153][156] This measure was therefore only a stopgap until most of BEA's Berlin fleet was equipped with 97-seat, single-class BAC One-Eleven 500s.[nb 23][136] BEA's re-equipment of its Berlin fleet with brand-new One-Eleven 500 jets was central to the airline's competitive strategy to regain ground lost to Pan Am's 727s. The new One-Eleven 500, which BEA called the Super One-Eleven, operated its first scheduled service from Berlin on 1 September 1968.[11][136][143][156][157] It began replacing the airline's Berlin-based Viscounts from 17 November 1968.[91]",
				"after": "Air France, West Berlin's third scheduled carrier, which had suffered a continuous traffic decline ever since the transfer of Berlin operations to more distant Tegel at the beginning of 1960 due to Tempelhof's operational limitations that made it unsuitable for its Caravelles, was worst affected by the equipment changes at the latter airport during the mid- to late-1960s. To reverse growing losses on its Berlin routes resulting from load factors as low as 30%, Air France decided to withdraw from the internal German market entirely and instead enter into a joint venture with BEA. This arrangement entailed the latter taking over the former's two remaining German domestic routes to Frankfurt and Munich and operating these with its own aircraft and flightdeck crews from Tempelhof. It also entailed repainting the fins of the BEA One-Eleven 500s in a neutral, dark-blue scheme featuring Super One-Eleven titles instead of BEA's \"Speedjack\" motif. The Air France-BEA joint venture became operational in spring 1969 and terminated in autumn 1972.[3][133][136][153][154][158][159][160][161][162][163]",
			"color": "black|0.27961 tan|0.22601 dim|0.14767 gray|0.14767 dim|0.14767 grey|0.14767 gray|0.081168 grey|0.081168 rosy|0.030839 brown|0.030839 dark|0.022697 slate|0.022697 gray|0.022697 dark|0.019353 gray|0.019353 dark|0.019353 grey|0.019353 antique|0.014402 white|0.014402 dark|0.011842 olive|0.011842 green|0.011842 silver|0.011129 burly|0.011043 wood|0.011043  "
		}
	}
}
