{
	"add": {
		"doc": {
			"id": "88e7a72896659a1aea6af72c9fbbad96a0c407ea866b14d6a436cea9fe747b20",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Timm-Cook_Cessna_172_LV_NV.jpg/220px-Timm-Cook_Cessna_172_LV_NV.jpg",
				"previous": "The Cessna 172 may be modified via a wide array of Supplemental Type Certificates (STCs), including increased engine power and higher gross weights. Available STC engine modifications increase power from 180 to 210 hp (134 to 157 kW), add constant-speed propellers, or allow the use of automobile gasoline. Other modifications include additional fuel tank capacity in the wing tips, added baggage compartment tanks, added wheel pants to reduce drag, or enhanced landing and takeoff performance and safety with a STOL kit.[11]",
			"after": [
				"A Cessna 172 was used in 1958 to set the world record for flight endurance; the record still stands.",
				"On December 4, 1958 Robert Timm and John Cook took off from McCarran Airfield in Las Vegas, NV in a used Cessna 172, registration number N9172B. Sixty-four days, 22 hours, 19 minutes and 5 seconds later, they landed back at McCarran Airfield on February 4, 1959. The flight was part of a fund-raising effort for the Damon Runyon Cancer Fund. Food and water were transferred by matching speeds with a chase car on a straight stretch of road in the desert, and hoisting the supplies aboard with a rope and bucket. Fuel was taken on by hoisting a hose from a fuel truck up to the aircraft, filling an auxiliary belly tank installed for the flight, pumping that fuel into the aircraft's regular tanks and then filling the belly tank again. The drivers steered while a second person matched speeds with the aircraft with his foot on the vehicle's accelerator pedal."
			],
			"color": "tan|0.11552 dark|0.068636 gray|0.068636 dark|0.068636 grey|0.068636 dim|0.06158 gray|0.06158 dim|0.06158 grey|0.06158 gray|0.060643 grey|0.060643 black|0.056583 silver|0.050333 antique|0.042142 white|0.042142 light|0.036647 gray|0.036647 light|0.036647 grey|0.036647 gainsboro|0.027075 linen|0.026494 papaya|0.023046 whip|0.023046 old|0.022024 lace|0.022024 misty|0.021107 rose|0.021107 sea|0.020976 shell|0.020976 blanched|0.020448 almond|0.020448 bisque|0.020037 floral|0.019073 white|0.019073 rosy|0.017758 brown|0.017758 beige|0.016782 white|0.016052 smoke|0.016052 corn|0.014399 silk|0.014399 snow|0.014005 wheat|0.013936 ivory|0.013574 peach|0.013352 puff|0.013352 lavender|0.011547 blush|0.011547 white|0.011039 lavender|0.010381 mint|0.0098636 cream|0.0098636 ghost|0.0089957 white|0.0089957 pale|0.0088782 golden|0.0088782 rod|0.0088782 light|0.0079975 yellow|0.0079975 light|0.0070979 golden|0.0070979 rod|0.0070979 yellow|0.0070979  "
		}
	}
}
