{
	"add": {
		"doc": {
			"id": "88f1754d85b9cd6ef1539e974efcb5ca3c8d7ae54c9e46d6384fe3db1eb95534",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Dutch_Empire35.PNG/260px-Dutch_Empire35.PNG",
				"previous": "With the armed support of revolutionary France, Dutch republicans proclaimed the Batavian Republic, modelled after the French Republic and rendering the Netherlands a unitary state in 19 January 1795. The stadtholder William V of Orange had fled to England. But from 1806 to 1810, Kingdom of Holland was set up by Napoleon Bonaparte as a puppet kingdom governed by his brother Louis Bonaparte to control the Netherlands more effectively. However, King Louis Bonaparte tried to serve Dutch interests instead of his brother's, and he was forced to abdicate on 1 July 1810. The Emperor sent in an army and the Netherlands became part of the French Empire until the autumn of 1813, when Napoleon was defeated in the Battle of Leipzig.",
				"after": "William Frederick, son of the last stadtholder, returned to the Netherlands in 1813 and proclaimed himself Sovereign Prince of the Netherlands. Two years later, the Congress of Vienna added the southern Netherlands to the north to create a strong country on the northern border of France. William Frederick raised this United Netherlands to the status of a kingdom and proclaimed himself King William I. In addition, William became hereditary Grand Duke of Luxembourg in exchange for his German possessions. However, the Southern Netherlands had been culturally separate from the north since 1581, and rebelled. The south gained independence in 1830 as Belgium, while the personal union between Luxembourg and the Netherlands was severed in 1890, when William III died with no surviving male heirs. Ascendancy laws prevented his daughter Queen Wilhelmina from becoming the next Grand Duchess.",
			"color": "yellow|0.16605 lime|0.14719 light|0.071006 green|0.071006 dark|0.054364 sea|0.054364 green|0.054364 honeydew|0.04057 dark|0.039756 green|0.039756 mint|0.029446 cream|0.029446 forest|0.027552 green|0.027552 green|0.027367 floral|0.026094 white|0.026094 white|0.024927 white|0.024671 smoke|0.024671 azure|0.024574 snow|0.023947 sea|0.023335 shell|0.023335 ivory|0.022601 silver|0.020402 alice|0.019822 blue|0.019822 ghost|0.019497 white|0.019497 beige|0.017097 green|0.016395 yellow|0.016395 lawn|0.013807 green|0.013807 chart|0.013067 reuse|0.013067 light|0.011711 gray|0.011711 light|0.011711 grey|0.011711 lavender|0.011663 blush|0.011663 old|0.0075676 lace|0.0075676 pale|0.0073348 golden|0.0073348 rod|0.0073348 lemon|0.0065619 chiffon|0.0065619 gainsboro|0.0065011 dark|0.0062253 gray|0.0062253 dark|0.0062253 grey|0.0062253 cadet|0.0062253 blue|0.0062253 light|0.0060616 golden|0.0060616 rod|0.0060616 yellow|0.0060616 khaki|0.0059172 light|0.0053721 yellow|0.0053721 light|0.0044379 steel|0.0044379 blue|0.0044379  "
		}
	}
}
