{
	"add": {
		"doc": {
			"id": "88f53de1c59ad7d73a37cec47a177e57df414fa182be3d733b94991e657e5a95",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Petrus_Christus_Nativit%C3%A9_Haute_r%C3%A9solution.jpg/370px-Petrus_Christus_Nativit%C3%A9_Haute_r%C3%A9solution.jpg",
			"previous": [],
				"after": "The Nativity is a devotional mid-1450s oil-on-wood panel painting by the Early Netherlandish painter Petrus Christus. It shows a nativity scene with grisaille archways and trompe-l'œil sculptured reliefs. Christus was influenced by the first generation of Netherlandish artists, especially Jan van Eyck and Rogier van der Weyden, and the panel is characteristic of the simplicity and naturalism of art of that period. Placing archways as a framing device is a typical van der Weyden device, and here likely borrowed from that artist's Altar of Saint John and Miraflores Altarpiece. Yet Christus adapts these painterly motifs to a uniquely mid-15th century sensibility, and the unusually large panel – perhaps painted as a central altarpiece panel for a triptych – is nuanced and visually complex. It shows his usual harmonious composition and employment of one-point-perspective, especially evident in the geometric forms of the shed's roof, and his bold use of color. It is one of Christus's most important works. Max Friedländer definitely attributed the panel to Christus in 1930, concluding that \"in scope and importance, [it] is superior to all other known creations of this master.\"[1]",
			"color": "light|0.12631 steel|0.12631 blue|0.12631 gray|0.1206 grey|0.1206 dark|0.078259 olive|0.078259 green|0.078259 steel|0.067473 blue|0.067473 gainsboro|0.047884 dim|0.04644 gray|0.04644 dim|0.04644 grey|0.04644 lavender|0.042345 brown|0.04096 dark|0.039042 gray|0.039042 dark|0.039042 grey|0.039042 light|0.036336 gray|0.036336 light|0.036336 grey|0.036336 alice|0.028303 blue|0.028303 ghost|0.025888 white|0.025888 white|0.025122 smoke|0.025122 tan|0.023278 lavender|0.022824 blush|0.022824 snow|0.019823 sea|0.017532 shell|0.017532 white|0.017353 sienna|0.015717 linen|0.014956  "
		}
	}
}
