{
	"add": {
		"doc": {
			"id": "88f8903dc8721cfff84553741e930d38397adb492f99e2782feb07515e3c69a3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/M%C3%A9rode_Cup.jpg/300px-M%C3%A9rode_Cup.jpg",
				"previous": "Berry died in 1416 with no male heir, and deeply in debt. Those of his works in precious metal and jewels that had not already gone to his creditors were mostly seized by the English when they took Paris in July 1417.[56] This was the first of a number of periods that saw the large-scale destruction of goldsmiths' work that the cup escaped, but thousands of other pieces did not, a survival that Brigitte Buettner finds \"almost miraculous\".[57] In particular, the move to Spain in 1604 enabled it to avoid the dispersal and destruction of the English Crown Jewels and royal collection of plate under the English Commonwealth.[31]",
				"after": "As a secular piece the cup would be an almost unique survival at this level of quality, \"the one representative left to us of medieval secular plate in its most sumptuous development\".[58] Although French plate in silver and gold was made in great quantities, and at a high level of quality, \"French silver made prior to the early 19th century is probably scarcer than that of any other European country.\"[59] The cost of even very skilled labour was low compared to that of the materials, and in the absence of any reliable way of either depositing or investing money, it was turned into lavish objects, in the knowledge that it might well need to be sold or melted down to finance some future project. If it survived long enough to become old-fashioned it was likely to be melted down and remodelled in a new style.[60]",
			"color": "bisque|0.1447 blanched|0.14454 almond|0.14454 papaya|0.139 whip|0.139 antique|0.13567 white|0.13567 wheat|0.060992 peach|0.059234 puff|0.059234 tan|0.058239 peru|0.031248 burly|0.021702 wood|0.021702 linen|0.021283 old|0.021259 lace|0.021259 moccasin|0.020494 corn|0.015167 silk|0.015167 pale|0.015131 golden|0.015131 rod|0.015131 khaki|0.013279 beige|0.012132 lemon|0.0090065 chiffon|0.0090065 navajo|0.008844 white|0.008844  "
		}
	}
}
