{
	"add": {
		"doc": {
			"id": "890a517bfc1400392ee95d1747d40f2d0e4bc7e9fed0dd7b2f45ba035732a79b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/VITC_Hary_08_mar_2002_0700Z.jpg/133px-VITC_Hary_08_mar_2002_0700Z.jpg",
			"previous": [],
				"after": "The 2001–02 South-West Indian Ocean cyclone season had the earliest named storm since 1992. Eleven tropical storms, two more than average, formed in the basin, which lies west of longitude 90°E and south of the equator. Many storms formed in the north-east portion of the basin, and several more originated around Australia. Tropical systems were present during 73 days, 15 more than average. Tropical cyclones in this basin are monitored by the Regional Specialized Meteorological Center in Réunion. The first storm was Andre, which emerged from the Australian basin as Tropical Cyclone Alex in late October, before the conventional storm season began. The strongest storm, Cyclone Hary (pictured), was the first very intense tropical cyclone since 2000; it hit Madagascar, where it caused lighter damage than expected but three deaths. In January, Cyclone Dina left heavy damage in the Mascarene Islands, particularly on Réunion, where it dropped 2,102 mm (82.8 in) of rainfall. The final storm was Cyclone Kesiny, which killed 33 people when it struck Madagascar amid a political crisis in May, after the conventional storm season had ended. (Full article...)",
			"color": "dark|0.21051 gray|0.21051 dark|0.21051 grey|0.21051 silver|0.15744 light|0.11296 gray|0.11296 light|0.11296 grey|0.11296 dim|0.11262 gray|0.11262 dim|0.11262 grey|0.11262 gray|0.11006 grey|0.11006 gainsboro|0.089569 slate|0.039365 gray|0.039365 light|0.027457 slate|0.027457 gray|0.027457 white|0.026149 smoke|0.026149 linen|0.019059 sea|0.014929 shell|0.014929 snow|0.013172 ghost|0.012988 white|0.012988 alice|0.012274 blue|0.012274 lavender|0.011964 blush|0.011964 floral|0.0091318 white|0.0091318 white|0.0089678 mint|0.0062038 cream|0.0062038  "
		}
	}
}
