{
	"add": {
		"doc": {
			"id": "8927fdaa8fb73e867928bb563a602b9f07c7ba5018743aba994f289f0feb0f58",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Idriss_Deby_with_Obamas_%28cropped%292014.png/220px-Idriss_Deby_with_Obamas_%28cropped%292014.png",
				"previous": "Habré consolidated his dictatorship through a power system that relied on corruption and violence with thousands of people estimated to have been killed under his rule.[21][22] The president favoured his own Daza ethnic group and discriminated against his former allies, the Zaghawa. His general, Idriss Déby, overthrew him in 1990.[23] Attempts to prosecute Habré led to his placement under house arrest in Senegal in 2005; in 2013, Habré was formally charged with war crimes committed during his rule.[24]",
				"after": "Déby attempted to reconcile the rebel groups and reintroduced multiparty politics. Chadians approved a new constitution by referendum, and in 1996, Déby easily won a competitive presidential election. He won a second term five years later.[25] Oil exploitation began in Chad in 2003, bringing with it hopes that Chad would at last have some chances of peace and prosperity. Instead, internal dissent worsened, and a new civil war broke out. Déby unilaterally modified the constitution to remove the two-term limit on the presidency; this caused an uproar among the civil society and opposition parties.[26]",
			"color": "saddle|0.12954 brown|0.12954 rosy|0.10461 brown|0.10461 sienna|0.097726 black|0.091268 dark|0.070915 gray|0.070915 dark|0.070915 grey|0.070915 silver|0.064484 gray|0.062447 grey|0.062447 light|0.046075 gray|0.046075 light|0.046075 grey|0.046075 dark|0.034159 salmon|0.034159 gainsboro|0.03301 dim|0.02859 gray|0.02859 dim|0.02859 grey|0.02859 white|0.023711 smoke|0.023711 lavender|0.021101 blush|0.021101 ghost|0.019782 white|0.019782 alice|0.019263 blue|0.019263 medium|0.019214 violet|0.019214 red|0.019214 snow|0.018981 sea|0.018856 shell|0.018856 white|0.016868  "
		}
	}
}
