{
	"add": {
		"doc": {
			"id": "894431671f3f7dc100e91d86a336f4dfe3e882c23022a4cb76a38acf2318f2c5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Suzuki_Harunobu_-_Evening_Snow_on_the_Heater.jpg/220px-Suzuki_Harunobu_-_Evening_Snow_on_the_Heater.jpg",
				"previous": "Typical subjects were female beauties (bijin-ga), kabuki actors (yakusha-e), and landscapes. The women depicted were most often courtesans and geisha at leisure, and promoted the entertainments to be found in the pleasure districts.[149] The detail with which artists depicted courtesans' fashions and hairstyles allows the prints to be dated with some reliability. Less attention was given to accuracy of the women's physical features, which followed the day's pictorial fashions—the faces stereotyped, the bodies tall and lanky in one generation and petite in another.[150] Portraits of celebrities were much in demand, in particular those from the kabuki and sumo worlds, two of the most popular entertainments of the era.[151] While the landscape has come to define ukiyo-e for many Westerners, the genre flourished relatively late in the form's history.[74]",
				"after": "Ukiyo-e prints grew out of book illustration—many of Moronobu's earliest single-page prints were originally pages from books he had illustrated.[12] E-hon books of illustrations were popular[152] and continued be an important outlet for ukiyo-e artists. In the late period, Hokusai produced the three-volume One Hundred Views of Mount Fuji and the fifteen-volume Hokusai Manga, the latter a compendium of over 4000 sketches of a wide variety of realistic and fantastic subjects.[153]",
			"color": "tan|0.43371 burly|0.089665 wood|0.089665 peach|0.078187 puff|0.078187 gray|0.069159 grey|0.069159 dim|0.05971 gray|0.05971 dim|0.05971 grey|0.05971 wheat|0.057389 bisque|0.050888 dark|0.03054 gray|0.03054 dark|0.03054 grey|0.03054 dark|0.024651 salmon|0.024651 moccasin|0.024007 navajo|0.02368 white|0.02368 blanched|0.02322 almond|0.02322 papaya|0.0097383 whip|0.0097383  "
		}
	}
}
