{
	"add": {
		"doc": {
			"id": "894dd5a2f8e7ca968f0b83a73669b88b3d9d10f334fa1dcf6f84389da7084731",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/WDWAK_Tree_of_Life.jpg/220px-WDWAK_Tree_of_Life.jpg",
				"previous": "Within three weeks of recording the Bronson transaction, Florida Ranch Lands had wrapped up deals with 47 owners. Eventually, the firm negotiated agreements with 51 owners to buy 27,443 acres (11,106 ha; 43 sq mi) for more than $5 million, an average price of $182 per acre. Disney wanted to announce his ownership of the land and his plans for Walt Disney World on November 15, 1965, but the secret was divulged earlier than that, when, in October 1965, Emily Bavar, editor of the Sentinel‍ '​s Florida magazine, was in Anaheim for Disneyland's 10th anniversary celebration. During an interview with Walt Disney, Bavar asked whether he was buying up vast acreage in Central Florida. Disney was caught unawares, and Bavar suspected that the rumor was true. Therefore, on October 21, 1965, a story by Bavar, written in the first person and acknowledging that she was sticking her neck out, predicted Disney would build a new theme park on the huge tract. After piecing together more information from various sources, the paper led its Sunday edition three days later with a story headlined, \"We Say: `Mystery Industry' Is Disney\".",
				"after": "Disney allowed Governor Haydon Burns to confirm the next day, October 25, that he intended to build \"the greatest attraction in the history of Florida\" in Central Florida. Disney came in person to Orlando for the formal announcement with Burns on November 15.[6] Disney explained the plans for the site, including Experimental Prototype Community of Tomorrow, (EPCOT), also known as Progress City, was to be a futuristic planned city. He envisioned a working city with commercial and residential areas that also continued to showcase and test new ideas and concepts for urban living.",
			"color": "black|0.51636 dark|0.079895 olive|0.079895 green|0.079895 dim|0.034819 gray|0.034819 dim|0.034819 grey|0.034819 dark|0.031435 slate|0.031435 gray|0.031435 dark|0.029966 sea|0.029966 green|0.029966 dark|0.028444 gray|0.028444 dark|0.028444 grey|0.028444 gray|0.025029 grey|0.025029 dark|0.021844 khaki|0.021844 silver|0.01875 olive|0.016957 olive|0.015396 drab|0.015396 light|0.014351 gray|0.014351 light|0.014351 grey|0.014351 tan|0.012651 gainsboro|0.011121 slate|0.011079 gray|0.011079 light|0.010987 slate|0.010987 gray|0.010987  "
		}
	}
}
