{
	"add": {
		"doc": {
			"id": "8951bbb32b9d9211be9c994e8c4b5fb3ad10add0b37774fd8fc65934c8c2211e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Charles_Darwin_aged_51.jpg/220px-Charles_Darwin_aged_51.jpg",
				"previous": "In the 17th century the new method of modern science rejected Aristotle's approach, and sought explanations of natural phenomena in terms of physical laws which were the same for all visible things, and did not need to assume any fixed natural categories, nor any divine cosmic order. But this new approach was slow to take root in the biological sciences, which became the last bastion of the concept of fixed natural types. John Ray used one of the previously more general terms for fixed natural types, \"species,\" to apply to plant and animal types, but he strictly identified each type of living thing as a species, and proposed that each species can be defined by the features that perpetuate themselves each generation.[23] These species were designed by God, but showing differences caused by local conditions. The biological classification introduced by Carl Linnaeus in 1735 also viewed species as fixed according to a divine plan.[24]",
				"after": "Other naturalists of this time speculated on evolutionary change of species over time according to natural laws. Pierre Louis Maupertuis wrote in 1751 of natural modifications occurring during reproduction and accumulating over many generations to produce new species.[26] Georges-Louis Leclerc, Comte de Buffon, suggested that species could degenerate into different organisms, and Erasmus Darwin proposed that all warm-blooded animals could have descended from a single micro-organism (or \"filament\").[27] The first full-fledged evolutionary scheme was Jean-Baptiste Lamarck's \"transmutation\" theory of 1809[28] which envisaged spontaneous generation continually producing simple forms of life that developed greater complexity in parallel lineages with an inherent progressive tendency, and that on a local level these lineages adapted to the environment by inheriting changes caused by use or disuse in parents.[29][30] (The latter process was later called Lamarckism.)[29][31][32][33] These ideas were condemned by established naturalists as speculation lacking empirical support. In particular, Georges Cuvier insisted that species were unrelated and fixed, their similarities reflecting divine design for functional needs. In the meantime, Ray's ideas of benevolent design had been developed by William Paley into the Natural Theology or Evidences of the Existence and Attributes of the Deity (1802) which proposed complex adaptations as evidence of divine design, and was admired by Charles Darwin.[34][35][36]",
			"color": " "
		}
	}
}
