{
	"add": {
		"doc": {
			"id": "8955649da123ff0ebb6ee6d238d727ed2ecf3fb93a9d414703db6d65af1ddbd2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/SAR-Mainstem-Map_med.jpg/220px-SAR-Mainstem-Map_med.jpg",
				"previous": "1934 and 1938 saw a further pair of devastating floods that in part brought an end to the area's citrus industry.[56] In 1938, the Santa Ana again burst its banks and flooded Anaheim and Orange in up to 4 feet (1.2 m) of water, stripping away thousands of acres of rich topsoil and destroying many of the citrus groves. Almost 60 people were killed in the disaster and about 68,400 acres (277 km2) of land were flooded,[43] despite the fact that the flow in the river was only one-third of that of the 1862 flood.[57] With the extreme damage from the floods, the U.S. Army Corps of Engineers made the decision to dam and concrete the river beginning in the 1940s, and declared it as the greatest flood hazard in the U.S. west of the Mississippi River.[50] Prado Dam, built in 1941, was designed to capture floodwaters from the Inland Empire about 30 miles (48 km) upstream from the river's mouth. The dam's impoundment, Prado Flood Control Basin, was designed to handle a 70-year flood.[58]",
				"after": "With the increased flood protection afforded by the Prado Dam, major industrial development migrating south from the Los Angeles Basin, and the Southern California housing boom in the 1950s and 1960s, the Santa Ana River watershed began its third and final transition—from agricultural to urban.[50] The population of the Santa Ana River basin increased dramatically, but brought with it the threat of greater damage from floods, somewhat compromising the protection afforded by Prado Dam. Because housing and urban areas encroached on the river's historic floodplain—an area once occupied by farms—and the river became confined to a narrow channel—a flood similar to the ones surrounding the turn of the 20th century would cause much more damage. The construction of roads and buildings also heightened the runoff that would flow into the river during rainfall, a process known as urban runoff.[50] In fact, the river flooded again in 1969, and while much of the runoff from the Inland Empire was captured behind Prado Dam—probably saving Orange County from an even greater flood—Santiago Creek, a large tributary flowing from the Santa Ana Mountains, eroded its banks until it swept away portions of residential communities in the cities of Tustin and Orange.[59]",
			"color": "dark|0.069967 gray|0.069967 dark|0.069967 grey|0.069967 white|0.065063 smoke|0.065063 snow|0.059575 mint|0.059252 cream|0.059252 white|0.059124 floral|0.056823 white|0.056823 sea|0.054983 shell|0.054983 azure|0.053944 silver|0.050943 ghost|0.048937 white|0.048937 gray|0.045498 grey|0.045498 light|0.042849 gray|0.042849 light|0.042849 grey|0.042849 alice|0.041661 blue|0.041661 dim|0.038894 gray|0.038894 dim|0.038894 grey|0.038894 ivory|0.036741 gainsboro|0.036568 linen|0.029619 lavender|0.018796 blush|0.018796 rosy|0.017018 brown|0.017018 black|0.015335 honeydew|0.015098 misty|0.014765 rose|0.014765 old|0.011334 lace|0.011334 light|0.0089451 cyan|0.0089451 light|0.0062465 slate|0.0062465 gray|0.0062465 slate|0.0059516 gray|0.0059516 pink|0.0056639 light|0.003799 pink|0.003799 dark|0.0030011 slate|0.0030011 gray|0.0030011 lavender|0.0029047  "
		}
	}
}
