{
	"add": {
		"doc": {
			"id": "8961686e4aaf3e49050df3717a3c67b10b4e58bf6bca0dcd69707e4740c55940",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/The_Entombment_by_Martin_Schongauer.jpg/200px-The_Entombment_by_Martin_Schongauer.jpg",
				"previous": "Bouts did not inscribe any of his paintings, which makes attribution and dating difficult. His developing skill with perspective and unified vanishing points is used by art historians to date his works from the period. Although its colourisation is among the best of his work, the perspective is clumsy in areas, thus the painting can be assumed to date no later than 1460. Bouts often quoted visual passages from artists and paintings that influenced his work, so the influences are well established and datable. Along with the companion Resurrection, British art historian Martin Davies believes the work shows influences from Rogier van der Weyden's Descent (c. 1435) and Miraflores Altarpiece (1440s), which places it after 1440.[4][29] Robert Koch dates it to between 1450 and 1455.[3]",
				"after": "During a period of aggressive acquisition intended to establish the international prestige of Britain's collection, it was acquired for the National Gallery in 1860 in Milan from the Guicciardi family by Charles Lock Eastlake for just over £120, along with a number of other Netherlandish works.[4][22][30] Eastlake's notes mention that the works were \"originally in the possession of the Foscari family\".[25] The Foscaris were a wealthy Venetian family which included Francesco Foscari who was Doge of Venice at the time the work was painted; the dramatic story of him and his son is told in Lord Byron's play The Two Foscari, and Verdi's opera I due Foscari. There is no documentary evidence to substantiate the claim that the painting came from the Foscari collection, and some art historians believe that representatives of the Guicciardis invented this provenance to impress Eastlake. Lorne Campbell considers the provenance \"probable\", noting that a descendant, Fergio Foscari (1732–1811), an ambassador to Saint Petersburg, squandered his fortune and may have been forced into selling pictures belonging to the family.[4] Campbell speculates that the painting was produced on commission for export to Venice, noting that unrolled linen would have been easier to transport than canvas, and that the row of holes just below the upper border could be explained if it had been stretched, mounted and framed by someone other than Bouts or a member of his workshop.[4][31]",
			"color": "antique|0.31304 white|0.31304 bisque|0.1606 blanched|0.14713 almond|0.14713 papaya|0.13401 whip|0.13401 linen|0.03985 old|0.039159 lace|0.039159 black|0.038399 beige|0.035409 corn|0.032955 silk|0.032955  "
		}
	}
}
