{
	"add": {
		"doc": {
			"id": "89628e8ee6d475c829a05f98b9b39d8e3aea0c87e0ce2318de15199d73239806",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/2-Grinder_Use_Test_Cut.jpg/220px-2-Grinder_Use_Test_Cut.jpg",
				"previous": "In 1967, Pennsylvania leased the reactor complex to the Nuclear Materials and Equipment Corporation (NUMEC), which already had a federal license to work with nuclear materials. NUMEC, which soon became a subsidiary of Atlantic-Richfield Corporation (ARCO), set up a large irradiator in what had been the reactor pool. The irradiator contained over 1 million curies of cobalt-60 to produce intense gamma rays, which were used to sterilize medical equipment and irradiate food and wood. In the spring of 1967 the state had concluded that radiation contamination at the Quehanna site \"could never be completely cleaned up\", and so was glad to find a tenant with nuclear experience.[8][38]",
				"after": "A group of NUMEC employees discovered that irradiating hardwood treated with plastics produced very durable flooring. In 1978 they formed PermaGrain Products, Inc. as a separate company from ARCO, and purchased the rights to the process as well as \"the main irradiator, a smaller shielded irradiator and related equipment\".[38] PermaGrain sold the flooring for use in basketball courts and gymnasiums, and was the longest occupant of the Quehanna facility, operating there from 1978 to December 2002. PermaGrain also let Neutron Products, Inc., a Maryland company, do cobalt-60 work in its hot cells, which required an amendment of their license from the Nuclear Regulatory Commission (NRC, the successor to the AEC).[8][38][52]",
			"color": "gray|0.31086 grey|0.31086 dim|0.28242 gray|0.28242 dim|0.28242 grey|0.28242 dark|0.21037 gray|0.21037 dark|0.21037 grey|0.21037 black|0.034114 dark|0.022933 slate|0.022933 gray|0.022933 silver|0.012326 rosy|0.010975 brown|0.010975 tan|0.0082998 slate|0.007349 gray|0.007349 peach|0.0057883 puff|0.0057883 sea|0.0047427 shell|0.0047427 light|0.0046701 slate|0.0046701 gray|0.0046701 floral|0.0046232 white|0.0046232 white|0.0046146 smoke|0.0046146  "
		}
	}
}
