{
	"add": {
		"doc": {
			"id": "896725f8692b1da0f9bfe916108e9735d5335f9bc8d4a75177d8919913258cfb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/EffectiveTemperature_300dpi_e.png/220px-EffectiveTemperature_300dpi_e.png",
				"previous": "The thermal columns in the convection zone form an imprint on the surface of the Sun as the solar granulation and supergranulation. The turbulent convection of this outer part of the solar interior sustains \"small-scale\" dynamo action over the near-surface volume of the Sun.[67] The Sun's thermal columns are Bénard cells and take the shape of hexagonal prisms.[77]",
				"after": "The visible surface of the Sun, the photosphere, is the layer below which the Sun becomes opaque to visible light.[78] Above the photosphere visible sunlight is free to propagate into space, and its energy escapes the Sun entirely. The change in opacity is due to the decreasing amount of H− ions, which absorb visible light easily.[78] Conversely, the visible light we see is produced as electrons react with hydrogen atoms to produce H− ions.[79][80] The photosphere is tens to hundreds of kilometers thick, being slightly less opaque than air on Earth. Because the upper part of the photosphere is cooler than the lower part, an image of the Sun appears brighter in the center than on the edge or limb of the solar disk, in a phenomenon known as limb darkening.[78] The spectrum of sunlight has approximately the spectrum of a black-body radiating at about 6,000 K, interspersed with atomic absorption lines from the tenuous layers above the photosphere. The photosphere has a particle density of ~1023 m−3 (about 0.37% of the particle number per volume of Earth's atmosphere at sea level). The photosphere is not fully ionized—the extent of ionization is about 3%, leaving almost all of the hydrogen in atomic form.[81]",
			"color": "dark|0.18666 golden|0.18666 rod|0.18666 white|0.072233 smoke|0.072233 sea|0.071168 shell|0.071168 snow|0.071075 ghost|0.070975 white|0.070975 alice|0.07093 blue|0.07093 white|0.070627 lavender|0.070026 blush|0.070026 mint|0.06985 cream|0.06985 floral|0.069028 white|0.069028 azure|0.068027 dark|0.027601 gray|0.027601 dark|0.027601 grey|0.027601 silver|0.024557 light|0.018837 gray|0.018837 light|0.018837 grey|0.018837 gainsboro|0.014275 gray|0.0079355 grey|0.0079355 linen|0.0038035 golden|0.0031257 rod|0.0031257  "
		}
	}
}
