{
	"add": {
		"doc": {
			"id": "896ce41e19bce3fb8e46c103f25a4386fbf8d53e6de6cb9fe56e6c689015d7e7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Aluminium_MacBook.png/166px-Aluminium_MacBook.png",
				"previous": "In engineering, design is a component of the engineering process. Many overlapping methods and processes can be seen when comparing Product design, Industrial design and Engineering. The American Heritage Dictionary defines design as: \"To conceive or fashion in the mind; invent,\" and \"To formulate a plan\", and defines engineering as: \"The application of scientific and mathematical principles to practical ends such as the design, manufacture, and operation of efficient and economical structures, machines, processes, and systems.\".[34][35] Both are forms of problem-solving with a defined distinction being the application of \"scientific and mathematical principles\". The increasingly scientific focus of engineering in practice, however, has raised the importance of new more \"human-centered\" fields of design.[36] How much science is applied in a design is a question of what is considered \"science\". Along with the question of what is considered science, there is social science versus natural science. Scientists at Xerox PARC made the distinction of design versus engineering at \"moving minds\" versus \"moving atoms\" (probably in cotradiction to the origin of term \"engineering - engineer\" from Latin \"in genio\" in meaning of a \"genius\" what assumes existence of a \"mind\" not of an \"atom\").",
			"after": [],
			"color": "gray|0.2896 grey|0.2896 black|0.19777 dark|0.15594 gray|0.15594 dark|0.15594 grey|0.15594 sea|0.10634 green|0.10634 medium|0.068665 sea|0.068665 green|0.068665 dim|0.064435 gray|0.064435 dim|0.064435 grey|0.064435 light|0.020237 sea|0.020237 green|0.020237 silver|0.013904 turquoise|0.009781 dark|0.008391 cyan|0.008391 dark|0.0071903 green|0.0071903 medium|0.0056789 turquoise|0.0056789 teal|0.0056579 medium|0.0054944 spring|0.0054944 green|0.0054944 dark|0.0046837 turquoise|0.0046837 forest|0.0042469 green|0.0042469  "
		}
	}
}
