{
	"add": {
		"doc": {
			"id": "8970f0db6b641c41ed7925c9bf0cc105870ae4a8c49f9a8187bb2096297e475e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Colshaw_Green_Road%2C_Chadderton.jpg/220px-Colshaw_Green_Road%2C_Chadderton.jpg",
				"previous": "New markets in Europe and South America increased the demand for Britain's cheap cotton goods. Supplies of raw cotton were exported from plantations in the United States to Manchester.[27][28] From the markets in Manchester, mill owners from Chadderton and neighbouring towns bought their cotton to be processed into yarn and cloth. Supplies were cut during the Lancashire Cotton Famine of 1861–65 as a result of the American Civil War, leading to the formation of the Chadderton Local Board of Health in 1873, whose purpose was to ensure social security and maintain hygiene and sanitation in the locality following the crisis.[29] Despite a brief economic depression, the urban growth of Chadderton accelerated after the famine. The profitability of factory based cotton spinning meant that much of Chadderton's plentiful cheap open land, used for farming since antiquity, vanished under distinctive rectangular multi-storey brick-built factories—35 by 1891.[18] Chadderton's former villages and hamlets agglomerated as a mill town around these factories and a network of newly created roads, canals and railways.[19][30][31] The Chadderton landscape was \"dominated by mill chimneys, many with the mill name picked out in white brick\".[32] Neighbouring Oldham (which by the 1870s had emerged as the largest and most productive mill town in the world)[17][33] encroached upon Chadderton's eastern boundary, urbanising the town and surrounds,[34] and forming a continuous urban cotton-spinning district with Royton, Lees and Shaw and Crompton—the Oldham parliamentary constituency—which at its peak was responsible for 13 per cent of the world's cotton production.[35] These Victorian era developments shifted the commercial focus away from Chadderton Fold to the major arterial Middleton Road, by Chadderton's eastern boundary with Oldham.[12][30] Sixty cotton mills were constructed in Chadderton between 1778 and 1926,[18] and 6,000 people, a quarter of Chadderton's population, worked in these factories by the beginning of the 20th century.[36] Industries ancillary to cotton spinning, such as engineering, coal mining, bleaching and dyeing became established during this period, meaning the rest of Chadderton's population were otherwise involved in the sector. Philip Stott was a Chadderton-born architect, civil engineer and surveyor of cotton mills. Stott's mills in Chadderton were some of the largest to be built in the United Kingdom, multiplying the town's industrial capacity and in turn increasing its population and productivity.[33]",
				"after": "The boomtown of Chadderton reached its industrial zenith in the 1910s, with over 50 cotton mills within the town limits.[19] A social consequence of this industrial growth was a densely populated metropolitan landscape, home to an extensive and enlarged working class community living in an urban sprawl of low quality terraced houses.[37] However, Chadderton developed an abundance of civic institutions including public street lighting, Carnegie library, public swimming baths, and council with its own town hall. The development of the town meant that the district council made initial steps to petition the Crown for honorific borough status for Chadderton in the 1930s.[12][29] However, the Great Depression, and the First and Second World Wars each contributed to periods of economic decline. As imports of cheaper foreign yarns and textile goods increased during the mid-20th century, Chadderton's textile sector declined to a halt; cotton spinning reduced dramatically in the 1960s and 1970s, and by 1997 only two mills were operational.[19] In spite of efforts to increase the efficiency and competitiveness of its production, the last cotton was spun in the town in 1998.[16][38] Many of the redundant mills have now been demolished. Non-textile based industries continued on throughout the 20th century and into the 21st century, particularly in the form of aircraft and chemical manufacture at plants in south Chadderton and Foxdenton respectively.[5]",
			"color": "dark|0.47781 gray|0.47781 dark|0.47781 grey|0.47781 gray|0.14252 grey|0.14252 silver|0.13589 dim|0.084227 gray|0.084227 dim|0.084227 grey|0.084227 light|0.031936 gray|0.031936 light|0.031936 grey|0.031936 black|0.031552 gainsboro|0.020295 white|0.0077124 smoke|0.0077124 mint|0.0061206 cream|0.0061206 azure|0.005545  "
		}
	}
}
