{
	"add": {
		"doc": {
			"id": "8998f6b34f0ba71813df33baddbd12797c09e3c826e377d3b64c2c5bbf02c74a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/GD-FR-Paris-Louvre-Sculptures034.JPG/120px-GD-FR-Paris-Louvre-Sculptures034.JPG",
				"previous": "Portal:Arts/Featured article/14",
				"after": "Funerary art is any work of art forming, or placed in, a repository for the remains of the dead. Tomb is a general term for the repository, while grave goods are objects—other than the primary human remains—which have been placed inside. Such objects may include the personal possessions of the deceased, objects specially created for the burial, or miniature versions of things believed to be needed in an afterlife. Knowledge of many non-literate cultures is drawn largely from these sources. Funerary art can serve many cultural functions. It can play a role in burial rites, serve as an article for use by the dead in the afterlife, and celebrate the life and accomplishments of the dead, whether as part of kinship-centered practices of ancestor veneration or as a publicly directed dynastic display. It can also function as a reminder of the mortality of humankind, as an expression of cultural values and roles, and help to propitiate the spirits of the dead, maintaining their benevolence and preventing their unwelcome intrusion into the affairs of the living. The deposit of objects with an apparent aesthetic intention may go back to the Neanderthals over 50,000 years ago, and is found in almost all subsequent cultures—the Hindu culture, which has little, is a notable exception. Many of the best-known artistic creations of past cultures—from the Egyptian pyramids and the Tutankhamun treasure to the Terracotta Army surrounding the tomb of the Qin Emperor, the Mausoleum of Halicarnassus, the Sutton Hoo ship burial and the Taj Mahal—are tombs or objects found in and around them.",
			"color": "dim|0.31898 gray|0.31898 dim|0.31898 grey|0.31898 gray|0.18176 grey|0.18176 dark|0.12719 gray|0.12719 dark|0.12719 grey|0.12719 silver|0.097866 black|0.065735 light|0.064638 gray|0.064638 light|0.064638 grey|0.064638 rosy|0.047093 brown|0.047093 gainsboro|0.04363 slate|0.0147 gray|0.0147 light|0.010539 slate|0.010539 gray|0.010539  "
		}
	}
}
