{
	"add": {
		"doc": {
			"id": "899bc454a4003d247931c29011110892c4234d32df0e527aec27fa76a433ea76",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Okabe_-_The_cat_witch.jpg/220px-Okabe_-_The_cat_witch.jpg",
				"previous": "Belief in the supernatural is strong in all parts of India, and lynchings for witchcraft are reported in the press from time to time.[117] Around 750 people were killed as witches in Assam and West Bengal between 2003 and 2008.[118] Officials in the state of Chhattisgarh reported in 2008 that at least 100 women are maltreated annually as suspected witches.[119] A local activist stated that only a fraction of cases of abuse are reported.[120]",
			"after": [
				"In Japanese folklore, the most common types of witch can be separated into two categories: those who employ snakes as familiars, and those who employ foxes.[121]",
				"The fox witch is, by far, the most commonly seen witch figure in Japan. Differing regional beliefs set those who use foxes into two separate types: the kitsune-mochi, and the tsukimono-suji. The first of these, the kitsune-mochi, is a solitary figure who gains his fox familiar by bribing it with its favourite foods. The kitsune-mochi then strikes up a deal with the fox, typically promising food and daily care in return for the fox's magical services. The fox of Japanese folklore is a powerful trickster in and of itself, imbued with powers of shape changing, possession, and illusion. These creatures can be either nefarious; disguising themselves as women in order to trap men, or they can be benign forces as in the story of \"The Grateful foxes\".[122] However, once a fox enters the employ of a human it almost exclusively becomes a force of evil to be feared. A fox under the employ of a human can provide many services. The fox can turn invisible and find secrets its master desires. It can apply its many powers of illusion to trick and deceive its master's enemies. The most feared power of the kitsune-mochi is the ability to command his fox to possess other humans. This process of possession is called Kitsunetsuki."
			],
			"color": "black|0.30626 rosy|0.18343 brown|0.18343 tan|0.10413 dim|0.047646 gray|0.047646 dim|0.047646 grey|0.047646 gray|0.037463 grey|0.037463 peru|0.034611 burly|0.02963 wood|0.02963 dark|0.02614 gray|0.02614 dark|0.02614 grey|0.02614 sienna|0.022287 peach|0.019303 puff|0.019303 firebrick|0.012069 saddle|0.011039 brown|0.011039 bisque|0.010843 wheat|0.010716 silver|0.010553 brown|0.0082737  "
		}
	}
}
