{
	"add": {
		"doc": {
			"id": "89a08ab26803735b51c7fdf710157ce4fe669b9c81fd614d51b3ebc13c49891d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Bundesarchiv_Bild_183-2000-0110-500%2C_BDM%2C_Gymnastikvorf%C3%BChrung.jpg/220px-Bundesarchiv_Bild_183-2000-0110-500%2C_BDM%2C_Gymnastikvorf%C3%BChrung.jpg",
				"previous": "Women were encouraged to leave the workforce, and the creation of large families by racially suitable women was promoted through a propaganda campaign. Women received a bronze award—known as the Ehrenkreuz der Deutschen Mutter (Cross of Honour of the German Mother)—for giving birth to four children, silver for six, and gold for eight or more.[358] Large families received subsidies to help with their utilities, school fees, and household expenses. Though the measures led to increases in the birth rate, the number of families having four or more children declined by five per cent between 1935 and 1940.[361] Removing women from the workforce did not have the intended effect of freeing up jobs for men. Women were for the most part employed as domestic servants, weavers, or in the food and drink industries—jobs that were not of interest to men.[362] Nazi philosophy prevented large numbers of women from being hired to work in munitions factories in the build-up to the war, so foreign labourers were brought in. After the war started, slave labourers were extensively used.[363] In January 1943 Hitler signed a decree requiring all women under the age of fifty to report for work assignments to help the war effort.[364] Thereafter, women were funnelled into agricultural and industrial jobs. By September 1944, 14.9 million women were working in munitions production.[365]",
				"after": "The Nazi regime discouraged women from seeking higher education. Nazi leaders held conservative views about women and endorsed the idea that rational and theoretical work was alien to a woman's nature since they were considered inherently emotional and instinctive – as such, engaging in academics and careerism would only \"divert them from motherhood.\"[366] The number of women allowed to enrol in universities dropped drastically, as a law passed in April 1933 limited the number of females admitted to university to ten per cent of the number of male attendees.[367] Female enrolment in secondary schools dropped from 437,000 in 1926 to 205,000 in 1937. The number of women enrolled in post-secondary schools dropped from 128,000 in 1933 to 51,000 in 1938. However, with the requirement that men be enlisted into the armed forces during the war, women comprised half of the enrolment in the post-secondary system by 1944.[368]",
			"color": " "
		}
	}
}
