{
	"add": {
		"doc": {
			"id": "89a4874d3bcfacac029a08e50b75c21a80a68936c692c1a4f0f1e0552ffae69c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Acclamation_of_Princess_Isabel_1887.jpg/220px-Acclamation_of_Princess_Isabel_1887.jpg",
				"previous": "The nation enjoyed great international prestige during the final years of the Empire.[11] Predictions of economic and labor disruption caused by the abolition of slavery failed to materialize and the 1888 coffee harvest was successful, both of which boosted Princess Isabel's popularity.[144] José do Patrocínio, a \"leading abolitionist journalist, an inveterate republican notable for his disrespect for the Imperial Family, not only renounced his former views\" but also \"took a leading role in organizing a 'Black Guard'.\" This was an association of former slaves dedicated to the monarchy's defense, and which also harassed republican meetings.[144]",
				"after": "The cabinet responsible for enacting the law abolishing slavery suffered a vote of no confidence on 3 May 1889 and was forced to resign.[145] Pedro II called José Antônio Saraiva to form a new cabinet. Saraiva, a highly pragmatic politician, cared neither for monarchy nor republic, so long as he held power.[84] He frankly warned the Emperor that Isabel had little chance of reigning as empress and that the government itself should take an active role in facilitating a peaceful transition to a republic.[84] The Emperor accepted this proposal, without bothering to inform his daughter and heiress.[84] Pedro II's behavior in this meeting revealed how little commitment he had to the monarchy. He gave little consideration to his daughter's opinion, or that of the Brazilian people who overwhelmingly supported the imperial system. The reason, unknown to but a very few, was that Pedro II was very sympathetic towards the idea of a republican system.[c][78][146] Through action and inaction, consciously and unconsciously, he had been sabotaging both the monarchy and the prospects of his daughter's future reign for nearly a decade. A quite astonished historian Heitor Lyra remarked: \"Was he not the head of the Brazilian monarchy, it would be said that he had been allied with the Republic's advertisers!\"[79] Saraiva, however, changed his mind and declined the office. Pedro II instead appointed Afonso Celso de Assis Figuereido, viscount of Ouro Preto, in his place.[145]",
			"color": "dim|0.086727 gray|0.086727 dim|0.086727 grey|0.086727 gray|0.080561 grey|0.080561 dark|0.07207 gray|0.07207 dark|0.07207 grey|0.07207 silver|0.060117 light|0.049691 gray|0.049691 light|0.049691 grey|0.049691 antique|0.044743 white|0.044743 floral|0.04337 white|0.04337 linen|0.043243 sea|0.042475 shell|0.042475 rosy|0.040889 brown|0.040889 gainsboro|0.036133 white|0.035472 smoke|0.035472 old|0.035106 lace|0.035106 mint|0.030768 cream|0.030768 snow|0.030709 ivory|0.030172 white|0.027893 misty|0.021479 rose|0.021479 beige|0.020372 azure|0.018529 honeydew|0.017463 ghost|0.016858 white|0.016858 papaya|0.016368 whip|0.016368 alice|0.014659 blue|0.014659 tan|0.014117  "
		}
	}
}
