{
	"add": {
		"doc": {
			"id": "89a48ee51b69a57252c680fb728b5605ad4b5ce6c84cceb0c032ab95946be3be",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Northumberland_Street_-_geograph.org.uk_-_1134691.jpg/220px-Northumberland_Street_-_geograph.org.uk_-_1134691.jpg",
			"previous": [],
				"after": "In 2010, Newcastle was positioned ninth in the retail centre expenditure league of the UK.[92] There are several major shopping areas in Newcastle City Centre. The largest of these is the Eldon Square Shopping Centre, one of the largest city centre shopping complexes in the UK.[93] It incorporates a flagship Debenhams store as well as one of the largest John Lewis stores in the UK. John Lewis is still known to many in Newcastle as Bainbridges. Newcastle store Bainbridge's, opened in 1838, is often cited as the world’s first department store.[94] Emerson Bainbridge (1817–1892),[95] a pioneer and the founder of Bainbridges,[96] sold goods via department, a new for merchant custom for that time. The Bainbridge’s official legers reported revenue by department, giving birth to the name department store.[95][96] Eldon Square is currently undergoing a full redevelopment. A new bus station, replacing the old underground bus station, was officially opened in March 2007.[97] The wing of the centre, including the undercover Green Market, near Grainger Street was demolished in 2007 so that the area could be redeveloped.[98] This was completed in February 2010 with the opening of a flagship Debenhams department store as well as other major stores including Apple, Hollister and Guess.[99]",
			"color": "black|0.22845 dim|0.19664 gray|0.19664 dim|0.19664 grey|0.19664 gray|0.090776 grey|0.090776 slate|0.078201 gray|0.078201 light|0.072682 slate|0.072682 gray|0.072682 dark|0.067007 gray|0.067007 dark|0.067007 grey|0.067007 white|0.022355 smoke|0.022355 ghost|0.021715 white|0.021715 alice|0.021634 blue|0.021634 snow|0.021458 white|0.021177 sea|0.020952 shell|0.020952 mint|0.020601 cream|0.020601 azure|0.020434 floral|0.019792 white|0.019792 silver|0.017806 lavender|0.016997 blush|0.016997 light|0.0081962 gray|0.0081962 light|0.0081962 grey|0.0081962 gainsboro|0.0065786  "
		}
	}
}
