{
	"add": {
		"doc": {
			"id": "89a5870deedccc3a6621e4469fcb0062923d5aa390a1e9b724caadb03096c5ef",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Bors_and_Lionel.jpg/220px-Bors_and_Lionel.jpg",
			"previous": [],
				"after": "The upper class or nobility, represented chiefly by the Knight and his Squire, was in Chaucer's time steeped in a culture of chivalry and courtliness. Nobles were expected to be powerful warriors who could be ruthless on the battlefield, yet mannerly in the King's Court and Christian in their actions.[45] Knights were expected to form a strong social bond with the men who fought alongside them, but an even stronger bond with a woman whom they idealised to strengthen their fighting ability.[46] Though the aim of chivalry was to noble action, often its conflicting values degenerated into violence. Church leaders often tried to place restrictions on jousts and tournaments, which at times ended in the death of the loser. The Knight's Tale shows how the brotherly love of two fellow knights turns into a deadly feud at the sight of a woman whom both idealise, with both knights willing to fight the other to the death to win her. Chivalry was in Chaucer's day on the decline, and it is possible that The Knight's Tale was intended to show its flaws, although this is disputed.[47] Chaucer himself had fought in the Hundred Years' War under Edward III, who heavily emphasised chivalry during his reign.[48] Two tales, Sir Topas and The Tale of Melibee are told by Chaucer himself, who is travelling with the pilgrims in his own story. Both tales seem to focus on the ill-effects of chivalry—the first making fun of chivalric rules and the second warning against violence.[49]",
			"color": "tan|0.25407 burly|0.13269 wood|0.13269 black|0.061487 peach|0.052639 puff|0.052639 wheat|0.047663 antique|0.040937 white|0.040937 bisque|0.040506 dim|0.031683 gray|0.031683 dim|0.031683 grey|0.031683 gray|0.030237 grey|0.030237 blanched|0.025434 almond|0.025434 dark|0.023585 gray|0.023585 dark|0.023585 grey|0.023585 light|0.020836 gray|0.020836 light|0.020836 grey|0.020836 navajo|0.020463 white|0.020463 papaya|0.019952 whip|0.019952 silver|0.019494 misty|0.01841 rose|0.01841 moccasin|0.016638 linen|0.016135 gainsboro|0.015082 old|0.011528 lace|0.011528 dark|0.010096 khaki|0.010096 peru|0.0087453 sea|0.0083733 shell|0.0083733  "
		}
	}
}
