{
	"add": {
		"doc": {
			"id": "89b24b6f2b9367adc914ec7a1e56a29ea84989d091f5bf3d00e9aa626c5eee84",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Pink_Mountain_Berries_Lake_St_Clair.jpg/220px-Pink_Mountain_Berries_Lake_St_Clair.jpg",
				"previous": "Péron's interview describes some aspects of the behaviour of the King Island emu. He writes that the bird was generally solitary but gathered in flocks of ten to twenty at breeding time, then wandered off in pairs. They ate berries, grass and seaweed, and foraged mainly during morning and evening. They were swift runners, but were apparently slower than the mainland birds, due to being fat. They swam well, but only did so when necessary. They reportedly liked the shade of lagoons and the shoreline, rather than open areas. They used a claw on each wing for scratching themselves. If unable to flee from the hunting dogs of the sealers, they would defend themselves by kicking, which could inflict a great deal of harm.[20]",
				"after": "Captain Matthew Flinders did not encounter emus when he visited King Island in 1802, but his naturalist, Robert Brown, examined their dung and noted they had chiefly fed on the berries of Leptecophylla juniperina.[4] An account by English ornithologist John Latham about the \"Van Diemen's cassowary\" may also refer to the King Island emu, based on the small size described. In addition to a physical description, he stated that they gathered in groups of 70 to 80 individuals in a given location while foraging, behaviour that was exploited by hunters.[10]",
			"color": "black|0.22859 hot|0.060778 pink|0.060778 dark|0.059819 olive|0.059819 green|0.059819 deep|0.051185 pink|0.051185 olive|0.039674 drab|0.039674 crimson|0.038475 dark|0.036111 red|0.036111 maroon|0.033861 olive|0.033164 firebrick|0.032456 dark|0.01946 khaki|0.01946 violet|0.01898 lavender|0.017215 brown|0.014846 lavender|0.013937 blush|0.013937 saddle|0.01343 brown|0.01343 plum|0.012539 tan|0.011918 sienna|0.0098671  "
		}
	}
}
