{
	"add": {
		"doc": {
			"id": "89b270bbc494d625cfb048c2fca94f3f872cde62b31fcb3ae984b29b467c7bf5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Normal-slip_fault.png/150px-Normal-slip_fault.png",
				"previous": "The Jordan Subbasin, as defined by the United States Geological Survey, is located entirely within Salt Lake and Davis counties in a roughly rectangular area of 791 square miles (2,050 km2). The Subbasin is part of the larger 3,830-square-mile (9,900 km2) Jordan River Basin that includes the upper Jordan River, Utah Lake, Provo and Spanish Fork Subbasins.[5][13] Four of the six largest cities in Utah are in Salt Lake County. The Jordan River flows through Sandy, with a 2010 population of 87,461; West Jordan, population 103,712; West Valley City, population 129,480; and Salt Lake City, population 186,440.[14] Flanked on either side by mountain ranges, the topography of the land varies greatly. The Wasatch Mountains rise on the east, with a high point of 11,100 feet (3,400 m) above sea level at Twin Peaks, near the town of Alta. The Oquirrh Mountains rise on the west, with a high point of over 9,000 feet (2,700 m) above sea level at Farnsworth Peak. The low point of 4,200 feet (1,300 m) is at the river's mouth, where the river enters the Great Salt Lake. Both the Oquirrh and Wasatch Mountains are fault-block mountains created from normal-slip faults where the mountains rise at the fault and the valley floor drops. The Wasatch Fault runs along the western edge of the Wasatch Mountains and the Oquirrh Fault runs along the eastern edge of the Oquirrh Mountains.[15][16]",
				"after": "From approximately 75,000 to 8,000 years ago, much of what is now northern Utah was covered by a Pleistocene lake called Lake Bonneville. At its greatest extent, Lake Bonneville reached an elevation of 5,200 feet (1,600 m) above sea level and had a surface area of 19,800 square miles (51,000 km2). The lake left behind lacustrine sediments, which resulted in a relatively flat lake bed, and the valley floors seen today. As the region experienced increasingly warmer and drier climate over time, Lake Bonneville's water levels receded, leaving the Great Salt Lake and Utah Lake as remnants.[17] The river's greatest slope, 27 feet per mile (5.1 m/km), is in the Jordan Narrows, while the rest of the river has a more gentle slope of 2 to 4 feet per mile (0.4 to 0.8 m/km).[18]",
			"color": "yellow|0.52858 black|0.14926 dark|0.12014 olive|0.12014 green|0.12014 gray|0.075598 grey|0.075598 dim|0.049222 gray|0.049222 dim|0.049222 grey|0.049222 dark|0.038221 gray|0.038221 dark|0.038221 grey|0.038221 olive|0.016766  "
		}
	}
}
