{
	"add": {
		"doc": {
			"id": "89d80aa1eedd3549500b81cde5000e4414729349bdd4e6d24b88a621ef37762d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Sir_Arthur_Seymour_Sullivan.jpg/170px-Sir_Arthur_Seymour_Sullivan.jpg",
				"previous": "Gilbert prepared meticulously for each new work, making models of the stage, actors and set pieces, and designing every action and bit of business in advance.[45] Gilbert would not work with actors who challenged his authority.[46][47] Even during long runs and revivals, Gilbert closely supervised the performances of his plays, making sure that the actors did not make unauthorised additions, deletions or paraphrases.[48] Gilbert was famous for demonstrating the action himself, even as he grew older.[49] Gilbert himself went on stage in a number of productions throughout his lifetime, including several performances as the Associate in Trial by Jury, as substitute for an ailing actor in his play Broken Hearts, and in charity matinees of his one-act plays, such as King Claudius in Rosencrantz and Guildenstern.[50]",
				"after": "In 1871, John Hollingshead commissioned Gilbert to work with Sullivan on a holiday piece for Christmas, Thespis, or The Gods Grown Old, at the Gaiety Theatre. Thespis outran five of its nine competitors for the 1871 holiday season, and its run was extended beyond the length of a normal run at the Gaiety,[51] However, nothing more came of it at that point, and Gilbert and Sullivan went their separate ways. Gilbert worked again with Clay on Happy Arcadia (1872), and with Alfred Cellier on Topsyturveydom (1874), as well as writing several farces, operetta libretti, extravaganzas, fairy comedies, adaptations from novels, translations from the French, and the dramas described above. Also in 1874, he published his last contribution for Fun magazine (\"Rosencrantz and Guildenstern\"), after a gap of three years, then resigned due to disapproval of the new owner's other publishing interests.[52]",
			"color": "black|0.96404 dim|0.031759 gray|0.031759 dim|0.031759 grey|0.031759  "
		}
	}
}
