{
	"add": {
		"doc": {
			"id": "89dc791de345d5e31587d3c1f31cfb5e41612fa95e33c6e0e651f0f7980d1afb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Qantas_Airbus_A380-800_at_Perth_Airport_Monty-1.jpg/220px-Qantas_Airbus_A380-800_at_Perth_Airport_Monty-1.jpg",
			"previous": [],
				"after": "While most of the fuselage is aluminium, composite materials comprise more than 20% of the A380's airframe.[138] Carbon-fibre reinforced plastic, glass-fibre reinforced plastic and quartz-fibre reinforced plastic are used extensively in wings, fuselage sections (such as the undercarriage and rear end of fuselage), tail surfaces, and doors.[139][140][141] The A380 is the first commercial airliner to have a central wing box made of carbon fibre reinforced plastic. It is also the first to have a smoothly contoured wing cross section. The wings of other commercial airliners are partitioned span-wise into sections. This flowing, continuous cross section optimises aerodynamic efficiency. Thermoplastics are used in the leading edges of the slats.[142] The composite material GLARE (GLAss-REinforced fibre metal laminate) is used in the upper fuselage and on the stabilisers' leading edges.[143] This aluminium-glass-fibre laminate is lighter and has better corrosion and impact resistance than conventional aluminium alloys used in aviation.[144] Unlike earlier composite materials, GLARE can be repaired using conventional aluminium repair techniques.[citation needed] The application of GLARE on the A380 has a long history, which shows the complex nature of innovations in the aircraft industry.[145][146]",
			"color": "light|0.52096 slate|0.52096 gray|0.52096 dim|0.064305 gray|0.064305 dim|0.064305 grey|0.064305 dark|0.048392 gray|0.048392 dark|0.048392 grey|0.048392 silver|0.033908 gray|0.03316 grey|0.03316 light|0.033076 gray|0.033076 light|0.033076 grey|0.033076 gainsboro|0.028747 firebrick|0.023528 black|0.020478 slate|0.019672 gray|0.019672 white|0.014904 smoke|0.014904 dark|0.013348 red|0.013348 snow|0.010511 sea|0.010476 shell|0.010476 mint|0.0099595 cream|0.0099595 alice|0.0099398 blue|0.0099398 ghost|0.009261 white|0.009261 dark|0.0091348 slate|0.0091348 gray|0.0091348 linen|0.009124 floral|0.0090869 white|0.0090869 maroon|0.0090802 white|0.0090418 azure|0.0085375 brown|0.0078441  "
		}
	}
}
