{
	"add": {
		"doc": {
			"id": "89e53e9ea5258dc2f8894d1708c724773fc3de556fc7485bec33df15ee288a5c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Rogier_van_der_Weyden_-_The_Altar_of_St._John.jpg/500px-Rogier_van_der_Weyden_-_The_Altar_of_St._John.jpg",
				"previous": "The painting contains several geometric constructions.[14] The roof of the shed's trusses form series of triangles connecting lines joining the base of the pedestals and the crossbeams. These surround the gathering of the Holy Family, who form an inverse pattern. According to art historian Lawrence Steefel, \"the detail participates in an almost emblematic pattern of repeated triangles which establish a rhyme scheme above and below, of roof structure and figure disposition.\"[29] Upton writes that a \"clearly defined diamond\" is visible within the apex in the roof. From there it extends down to Eve, and the bottom apex is formed where the infant lies on the ground. It then extends up to Adam and back up to the roof. \"This diamond shape,\" he writes, \"supplemented by the rectangle within it, formed by the shed supports, the base of the triangle and the ground line in the shed, circumscribes the main event of the painting.\"[35]",
				"after": "Spatial and temporal borders separating the earthly and heavenly spheres are often seen in Netherlandish art, usually in the form of frames or arches.[36] A boundary is achieved here with the grisaille archway,[20] strongly reminiscent of van der Weyden's work. Art historians speculate Christus may have imitated his c. 1455 Altar of Saint John.[31] Instead of merely imitating, Christus innovated and extended the use of van der Weyden's arch motif; his arch is meant to be an opening, or a screen, for the viewer to see into the holy space, instead of a simple framing device in which figures are placed directly in-line or under the arch. The multi-hued threshold stones at the bottom emphasize its function says Upton, who writes: \"it is an opening through which one passes: a true frame or doorway to the picture ... Yet, since this arch is painted in grisaille, distinct from the rest of the panel, it must also be seen as a separate entity, much like an elaborate border around an illuminated manuscript page.\"[6] The shadows cast by the grisaille figures stress \"its function as a diaphragm between real and illusory space\".[17]",
			"color": "black|0.45365 dim|0.089058 gray|0.089058 dim|0.089058 grey|0.089058 gray|0.0573 grey|0.0573 dark|0.050911 gray|0.050911 dark|0.050911 grey|0.050911 silver|0.039993 tan|0.03663 light|0.034946 steel|0.034946 blue|0.034946 light|0.03456 gray|0.03456 light|0.03456 grey|0.03456 gainsboro|0.026258 light|0.015616 slate|0.015616 gray|0.015616 slate|0.015575 gray|0.015575 lavender|0.0094179 white|0.0091273 smoke|0.0091273 linen|0.0090795 antique|0.0079342 white|0.0079342 sea|0.0077997 shell|0.0077997  "
		}
	}
}
