{
	"add": {
		"doc": {
			"id": "89f54d3f94b38680f3201af17b26a463f3fb37547dd37144a61fcfbd97a89a9e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/CopalmeDAmerique.jpg/100px-CopalmeDAmerique.jpg",
			"previous": [],
				"after": "Autumn or Fall is one of the four temperate seasons. Autumn is the period between summer and winter, usually in September (northern hemisphere) or March (southern hemisphere) when the arrival of night becomes noticeably earlier. In the northern hemisphere, the meteorological start of autumn is on September 1 and it ends on November 30; in the southern hemisphere it starts on March 1 and ends on May 31. The astronomical start of autumn is on the Autumnal Equinox (September 22–23) and ends on the Winter Solstice (December 21–22) in the northern hemisphere, and March 20 and June 21 in the southern hemisphere. Autumn starts on or around August 7 and ends on about November 6 in solar term. The word autumn comes from the Old French word autompne (automne in modern French), and was later normalized to the original Latin word autumnus. There are rare examples of its use as early as the 14th century, but it became common by the 16th century. Before the 16th century, harvest was the term usually used to refer to the season. However as more people gradually moved from working the land to living in towns, the word harvest lost its reference to the time of year and came to refer only to the actual activity of reaping, and fall and autumn began to replace it as a reference to the season.",
			"color": "sienna|0.11345 light|0.102 steel|0.102 blue|0.102 light|0.080214 sky|0.080214 blue|0.080214 peru|0.07963 saddle|0.076237 brown|0.076237 light|0.070244 blue|0.070244 chocolate|0.046136 dark|0.044987 olive|0.044987 green|0.044987 sky|0.039879 blue|0.039879 silver|0.034214 light|0.033346 gray|0.033346 light|0.033346 grey|0.033346 brown|0.025668 gainsboro|0.023296 dark|0.0216 gray|0.0216 dark|0.0216 grey|0.0216 powder|0.020186 blue|0.020186 indian|0.016473 red|0.016473 maroon|0.013938 black|0.012697 lavender|0.012236 rosy|0.01215 brown|0.01215 gray|0.011858 grey|0.011858 sandy|0.011548 brown|0.011548  "
		}
	}
}
