{
	"add": {
		"doc": {
			"id": "8a1ef2fb75410c1bf9e1d6b04d5f6396caa61b75fb6a2971b450ec17f3b7614a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/The_Big_Game_of_Africa_%281910%29_-_Male_lion_Sotik_Plains_May_1909.png/220px-The_Big_Game_of_Africa_%281910%29_-_Male_lion_Sotik_Plains_May_1909.png",
				"previous": "Most lions now live in eastern and southern Africa, and their numbers there are rapidly decreasing, with an estimated 30–50% decline per 20 years in the late half of the 20th century.[2] Estimates of the African lion population range between 16,500 and 47,000 living in the wild in 2002–2004,[152][153] down from early 1990s estimates that ranged as high as 100,000 and perhaps 400,000 in 1950. Primary causes of the decline include disease and human interference.[2] Habitat loss and conflicts with humans are considered the most significant threats to the species.[154][155] The remaining populations are often geographically isolated from one another, which can lead to inbreeding, and consequently, reduced genetic diversity. Therefore the lion is considered a vulnerable species by the International Union for Conservation of Nature, while the Asiatic subspecies is endangered.[156] The lion population in the region of West Africa is isolated from lion populations of Central Africa, with little or no exchange of breeding individuals. The number of mature individuals in West Africa is estimated by two separate recent surveys at 850–1,160 (2002/2004). There is disagreement over the size of the largest individual population in West Africa: the estimates range from 100 to 400 lions in Burkina Faso's Arly-Singou ecosystem.[2] Another population in northwestern Africa is found in Waza National Park, where approximately 14–21 animals persist.[157]",
				"after": "Conservation of both African and Asian lions has required the setup and maintenance of national parks and game reserves; among the best known are Etosha National Park in Namibia, Serengeti National Park in Tanzania, and Kruger National Park in eastern South Africa. The Ewaso Lions Project protects lions in the Samburu National Reserve, Buffalo Springs National Reserve and Shaba National Reserve of the Ewaso Ng'iro ecosystem in Northern Kenya.[158] Outside these areas, the issues arising from lions' interaction with livestock and people usually results in the elimination of the former.[159] In India, the last refuge of the Asiatic lion is the 1,412 km2 (545 sq mi) Gir Forest National Park in western India, which had approximately 180 lions in 1974 and about 400 in 2010.[24] As in Africa, numerous human habitations are close by with the resultant problems between lions, livestock, locals and wildlife officials.[160] The Asiatic Lion Reintroduction Project plans to establish a second independent population of Asiatic lions at the Kuno Wildlife Sanctuary in the Indian state of Madhya Pradesh.[161] It is important to start a second population to serve as a gene pool for the last surviving Asiatic lions and to help develop and maintain genetic diversity enabling the species to survive.",
			"color": "black|0.97633  "
		}
	}
}
