{
	"add": {
		"doc": {
			"id": "8a4f30a86372a8b452db572f2e0b718621469b58abf2b363882bc423ce5d932b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/CarrollCountyMD.jpg/220px-CarrollCountyMD.jpg",
				"previous": "Maryland has a large food-production sector. A large component of this is commercial fishing, centered in the Chesapeake Bay, but also including activity off the short Atlantic seacoast. The largest catches by species are the blue crab, oysters, striped bass, and menhaden. The Bay also has overwintering waterfowl in its wildlife refuges. The waterfowl support a tourism sector of sportsmen.",
				"after": "Maryland has large areas of fertile agricultural land in its coastal and Piedmont zones, though this land use is being encroached upon by urbanization. Agriculture is oriented to dairy farming (especially in foothill and piedmont areas) for nearby large city milksheads plus specialty perishable horticulture crops, such as cucumbers, watermelons, sweet corn, tomatoes, muskmelons, squash, and peas (Source:USDA Crop Profiles). In addition, the southern counties of the western shoreline of Chesapeake Bay are warm enough to support a tobacco cash crop zone, which has existed since early Colonial times but declined greatly after a state government buyout in the 1990s. There is also a large automated chicken-farming sector in the state's southeastern part; Salisbury is home to Perdue Farms. Maryland's food-processing plants are the most significant type of manufacturing by value in the state.",
			"color": "black|0.16025 dark|0.11873 slate|0.11873 gray|0.11873 slate|0.095156 gray|0.095156 light|0.092294 slate|0.092294 gray|0.092294 dim|0.079397 gray|0.079397 dim|0.079397 grey|0.079397 dark|0.05934 gray|0.05934 dark|0.05934 grey|0.05934 dark|0.054248 sea|0.054248 green|0.054248 gray|0.05324 grey|0.05324 light|0.042412 steel|0.042412 blue|0.042412 silver|0.033062 dark|0.03063 olive|0.03063 green|0.03063 cadet|0.024585 blue|0.024585  "
		}
	}
}
