{
	"add": {
		"doc": {
			"id": "8a4f470ae084c643bf862193d60304cfee781b8fcda9412bf7467122683bfd27",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Barn_Owl_Tyto_alba_Carrizo_2.jpg/220px-Barn_Owl_Tyto_alba_Carrizo_2.jpg",
				"previous": "In North America and most of Europe, voles predominate in the diet and shrews are the second most common food choice. Mice and rats form the main foodstuffs in the Mediterranean region, the tropics, sub-tropics and Australia. Barn owls are usually more specialist feeders in productive areas and generalists in drier areas.[28] On the Cape Verde Islands, geckos are the mainstay of the diet, supplemented by birds such as plovers, godwits, turnstones, weavers and pratincoles,[29] and on a rocky islet off the coast of California, a clutch of four young were being reared on a diet of Leach's storm petrel (Oceanodroma leucorhoa).[30] In Ireland, the accidental introduction of the bank vole in the 1950s led to a major shift in the barn owl's diet: where their ranges overlap, the vole is now by far the largest prey item.[31] Locally superabundant rodent species in the weight class of several grams per individual usually make up the single largest proportion of prey.[32] In the United States, rodents and other small mammals usually make up ninety-five percent of the diet[33] and worldwide, over ninety percent of the prey caught.[34]",
				"after": "The barn owl hunts by flying slowly, quartering the ground and hovering over spots that may conceal prey. It may also use branches, fence posts or other lookouts to scan its surroundings, and this is the main means of prey location in the oil palm plantations of Malaysia. The bird has long, broad wings, enabling it to manoeuvre and turn abruptly. Its legs and toes are long and slender which improves its ability to forage among dense foliage or beneath the snow and gives it a wide spread of talons when attacking prey.[26] Studies have shown that an individual barn owl may eat one or more voles (or their equivalent) per night, equivalent to about twenty-three percent of the bird's bodyweight. Excess food is often cached at roosting sites and can be used when food is scarce.[35]",
			"color": "light|0.73705 steel|0.73705 blue|0.73705 tan|0.031739 lavender|0.019692 dark|0.019149 gray|0.019149 dark|0.019149 grey|0.019149 burly|0.019091 wood|0.019091 gray|0.01844 grey|0.01844 silver|0.01399 light|0.01043 gray|0.01043 light|0.01043 grey|0.01043 black|0.0093433 navajo|0.0083099 white|0.0083099 dim|0.0082862 gray|0.0082862 dim|0.0082862 grey|0.0082862 antique|0.0079462 white|0.0079462 gainsboro|0.0078706 wheat|0.007682 light|0.0071278 blue|0.0071278 moccasin|0.0058315  "
		}
	}
}
