{
	"add": {
		"doc": {
			"id": "8a68d795832557a94464e8be8303d21577b998623186210c71e0b4c3e7c262d4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/A_Darjeeling_street_scene%2C_1880.jpg/220px-A_Darjeeling_street_scene%2C_1880.jpg",
				"previous": "Under British rule, the Darjeeling area was initially a \"Non-Regulation District\", a scheme of administration applicable to economically less advanced districts in the British Raj; acts and regulations of the British Raj did not automatically apply to the district in line with rest of the country. In 1919, the area was declared a \"backward tract\".[14] During the Indian independence movement, the Non-cooperation Movement spread through the tea estates of Darjeeling.[15] There was also a failed assassination attempt by revolutionaries on Sir John Anderson, the Governor of Bengal in 1934.[16] Subsequently, during the 1940s, Communist activists continued the nationalist movement against the British by mobilising the plantation workers and the peasants of the district.[17]",
				"after": "Socio-economic problems of the region that had not been addressed during British rule continued to linger and were reflected in a representation made to the Constituent Assembly of India in 1947, which highlighted the issues of regional autonomy and Nepali nationality in Darjeeling and adjacent areas.[17] After the independence of India in 1947, Darjeeling was merged with the state of West Bengal. A separate district of Darjeeling was established consisting of the hill towns of Darjeeling, Kurseong, Kalimpong and some parts of the Terai region. While the hill population comprised mainly ethnic Nepalis, the plains harboured a large ethnic Bengali population who were refugees from the Partition of India.[18] A cautious and non-receptive response by the West Bengal government to most demands of the ethnic Nepali population led to increased calls, in the 1950s and 1960s, for Darjeeling's autonomy and for the recognition of the Nepali language; the state government acceded to the latter demand in 1961.[19]",
			"color": " "
		}
	}
}
