{
	"add": {
		"doc": {
			"id": "8a6ae0a11760107608611325787d0707f8a2b5bd1471fb66bf9eb92c5a01b504",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/MiG-29_gun.jpg/220px-MiG-29_gun.jpg",
				"previous": "The N019 radar was not a new design, but rather a development of the Sapfir-23ML architecture used on the MiG-23ML. During the initial design specification period in the mid-1970s, Phazotron NIIR was tasked with producing a modern radar for the MiG-29. To speed development, Phazotron based its new design on work undertaken by NPO Istok on the experimental \"Soyuz\" radar program. Accordingly, the N019 was originally intended to have a flat planar array antenna and full digital signal processing, for a detection and tracking range of at least 100 km against a fighter-sized target. Prototype testing revealed this could not be attained in the required timeframe and still fit within the MiG-29's nose. Rather than design a new radar, Phazotron reverted to a version of the Sapfir-23ML's twisted-polarization cassegrain antenna and traditional analog signal processors, coupled with a new NII Argon-designed Ts100 digital computer to save time and cost. This produced a working radar system, but inherited the weak points of the earlier design, plaguing the MiG-29's ability to detect and track airborne targets at ranges available with the R-27 and R-77 missiles. New radars like the digital N010 Zhuk-M have addressed the signal processing shortcomings of the analog design.[citation needed]",
				"after": "The N019 was further compromised by Phazotron designer Adolf Tolkachev’s betrayal of the radar to the CIA, for which he was executed in 1986. In response to all of these problems, the Soviets hastily developed a modified N019M Topaz radar for the upgraded MiG-29S aircraft. However, VVS was reportedly still not satisfied with the performance of the system and demanded another upgrade. The latest upgraded aircraft offered the N010 Zhuk-M, which has a planar array antenna rather than a dish, improving range, and a much superior processing ability, with multiple-target engagement capability and compatibility with the Vympel R-77 (or RVV-AE). Most MiG-29 continue to use the analog N019 or N019M radar, VVS has indicated its desire to upgrade all MiG-29s to a fully digital system.[citation needed]",
			"color": "dark|0.24094 slate|0.24094 gray|0.24094 slate|0.17593 gray|0.17593 light|0.14891 slate|0.14891 gray|0.14891 gray|0.14595 grey|0.14595 dim|0.12656 gray|0.12656 dim|0.12656 grey|0.12656 dark|0.085042 gray|0.085042 dark|0.085042 grey|0.085042 black|0.034104 silver|0.019572  "
		}
	}
}
