{
	"add": {
		"doc": {
			"id": "8a6f51bd34a6289cb1f9b60948b6fc4a4e5c740067b0ab99356e4ee105599e37",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Kosovo_map-en.svg/120px-Kosovo_map-en.svg.png",
			"previous": [],
				"after": "Kosovo is a region in southeastern Europe. In antiquity, the Dardanian kingdom, and later Roman province of Dardania was located in the country. It was part of Serbia in the Middle Ages, during which time many important monasteries, some of which are now UNESCO World Heritage sites, were built. The Battle of Kosovo, in 1389, is regarded by Serbs as a defining moment in their history and identity. It was conquered by the Ottoman Empire in the 15th century and would remain under Ottoman rule for the next five centuries. Kosovo was incorporated into the Kingdom of Serbia after the First Balkan War, and with the constitution of Yugoslavia, the Autonomous Province of Kosovo and Metohija was created (Serbian: Аутономна Покрајина Косово и Метохија, Autonomna Pokrajina Kosovo i Metohija) within the Yugoslav republic of Serbia. Long-term severe ethnic tensions between Kosovo's Albanian and Serb populations have left Kosovo ethnically divided, resulting in inter-ethnic violence, including the Kosovo War of 1999. The Kosovo War ended with the Federal Republic of Yugoslavia accepting that it would give up the exercise of its sovereignty pending a final status settlement. Under UNSCR 1244, governance passed to the United Nations in 1999. The partially recognised Republic of Kosovo, declared itself an independent state in 2008, and has control over most of the territory, although North Kosovo, the largest Serb enclave, is largely under the control of institutions of the Republic of Serbia or parallel structures subsidised by Serbia. Serbia and a number of other countries do not recognise the secession of Kosovo and consider it a UN-governed entity within its sovereign territory.",
			"color": "beige|0.23209 dark|0.15606 sea|0.15606 green|0.15606 antique|0.098474 white|0.098474 tan|0.06379 corn|0.060523 silk|0.060523 papaya|0.051982 whip|0.051982 wheat|0.049312 light|0.027877 golden|0.027877 rod|0.027877 yellow|0.027877 blanched|0.025081 almond|0.025081 old|0.024946 lace|0.024946 light|0.023109 yellow|0.023109 alice|0.016742 blue|0.016742 linen|0.016062 ivory|0.014864 lemon|0.01362 chiffon|0.01362 burly|0.013319 wood|0.013319 light|0.010972 cyan|0.010972 gainsboro|0.010634 azure|0.0093952 light|0.0089213 gray|0.0089213 light|0.0089213 grey|0.0089213 floral|0.0085665 white|0.0085665 sea|0.0082278 shell|0.0082278  "
		}
	}
}
