{
	"add": {
		"doc": {
			"id": "8a904861e9e96fce5350742741dcc1fe9050da155016a91b9a11db8939c0c5f2",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e6/Timucua_owl_totem.jpg/170px-Timucua_owl_totem.jpg",
				"previous": "Humans arrived on the Florida Peninsula about 12,000 years ago when the ocean was about 350 feet (110 m) lower than today, and the peninsula was double its current size.[80] These earliest people are called Paleo-Indians. They were primarily hunter–gatherers who followed large game, such as mastodons, horses, camels, and bison. Much of the land was far from water—most fresh water was contained in glaciers and polar ice caps. As a result, Florida was an arid landscape with few trees, dominated by grasslands and scrub vegetation.[81]",
				"after": "Around 9,000 years ago, the climate warmed, melting many of the polar ice caps and glaciers, creating a wetter environment and submerging half the peninsular shelf. As Paleo-Indians did not have to travel as far to find water, their camps became more permanent, turning into villages. With evidence of a wide variety of tools constructed around this time, archeologists note the transition into Archaic people. The Archaic people made tools from bone, animal teeth, and antlers. They wove fibers from plants such as cabbage palms and saw palmettos. A few burial sites have been excavated—including the Windover Archaeological Site in Brevard County near Titusville—that provide evidence of burial rituals. Archaic peoples interred their dead in shallow peat marshes, which preserved much of the human tissue.[82] Further climate change between 5,000 and 3,000 years ago led to the Middle Archaic period; evidence suggests that human habitation near the St. Johns River first occurred during this era. Populations of indigenous people increased significantly at this time, and numerous settlements near the St. Johns have been recorded from this era; the banks of the St. Johns and its arteries are dotted with middens filled with thousands of shells, primarily those of Viviparus georgianus—a freshwater snail—and oysters.[83][84]",
			"color": "sienna|0.24216 khaki|0.22486 saddle|0.093694 brown|0.093694 burly|0.093165 wood|0.093165 pale|0.071306 golden|0.071306 rod|0.071306 sandy|0.055135 brown|0.055135 peru|0.049369 tan|0.034456 navajo|0.032216 white|0.032216 moccasin|0.024974 wheat|0.022848  "
		}
	}
}
