{
	"add": {
		"doc": {
			"id": "8a929b25dc554c0e129cdc7b091d81323e7b03f8778ec9befb576c8b89f5d191",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Stwlan.dam.jpg/220px-Stwlan.dam.jpg",
			"previous": [],
			"after": [
				"Energy storage is accomplished by devices or physical media that store energy to perform useful processes at a later time. A device that stores energy is sometimes called an accumulator.",
				"Many forms of energy produce useful work, heating or cooling to meet societal needs. These energy forms include chemical energy, gravitational potential energy, electrical potential, electricity, temperature differences, latent heat, and kinetic energy. Energy storage involves converting energy from forms that are difficult to store (electricity, kinetic energy, etc.) to more conveniently or economically storable forms. Some technologies provide only short-term energy storage, and others can be very long-term such as power to gas using hydrogen or methane and the storage of heat or cold between opposing seasons in deep aquifers or bedrock. A wind-up clock stores potential energy (in this case mechanical, in the spring tension), a rechargeable battery stores readily convertible chemical energy to operate a mobile phone, and a hydroelectric dam stores energy in a reservoir as gravitational potential energy. Ice storage tanks store ice (thermal energy in the form of latent heat) at night to meet peak demand for cooling. Fossil fuels such as coal and gasoline store ancient energy derived from sunlight by organisms that later died, became buried and over time were then converted into these fuels. Even food (which is made by the same process as fossil fuels) is a form of energy stored in chemical form."
			],
			"color": "black|0.17266 dark|0.14003 khaki|0.14003 silver|0.12834 dark|0.12152 gray|0.12152 dark|0.12152 grey|0.12152 light|0.078297 gray|0.078297 light|0.078297 grey|0.078297 dim|0.042332 gray|0.042332 dim|0.042332 grey|0.042332 gray|0.041769 grey|0.041769 gainsboro|0.041746 antique|0.029759 white|0.029759 tan|0.025744 linen|0.023053 misty|0.019572 rose|0.019572 sea|0.015385 shell|0.015385 old|0.015298 lace|0.015298 floral|0.011847 white|0.011847 papaya|0.0095392 whip|0.0095392 white|0.0078205 smoke|0.0078205 burly|0.0076714 wood|0.0076714 ivory|0.0070506 snow|0.0069676 beige|0.0052425 wheat|0.0050112  "
		}
	}
}
