{
	"add": {
		"doc": {
			"id": "8aa05dda64f41c3ddcca93b5b2937086bfd79238ee35050621cf83d42af0a971",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Diving_bell.jpg/170px-Diving_bell.jpg",
			"previous": [],
				"after": "The total cost of Kronan was estimated at 326,000 silver dalers in contemporary currency, and about half of the cost, 166,000 dalers, lay in the armaments. It was therefore in the interest of the Swedish navy to salvage as many of the cannons as possible. In the early 1660s almost all the guns from Vasa had been brought up through greatly improved technology. Commander Paul Rumpf and Admiral Hans Wachtmeister were put in charge of the salvage of Kronan's cannons. With the help of diving bells, they were able to raise 60 cannons worth 67,000 daler in the summers (c. June-August) of 1679–86, beginning as soon as the war with Denmark had ended. In the 1960s, diving expert Bo Cassel made some successful descents to Vasa with a diving bell made according to 17th-century specifications. In 1986, further experiments were done on Kronan. The tests proved successful and the conclusion was that the 17th-century operations must have required considerable experience, skill and favorable weather conditions.[59] Though the conditions off Öland were often difficult, with cold water and unpredictable weather, and required a large crew, the expeditions were very profitable. Historian Björn Axel Johansson has calculated that the total cost for the entire crew for all eight diving seasons was less than 2,000 dalers, the value of one of Kronan's 36-pounder guns.[60]",
			"color": "dim|0.097826 gray|0.097826 dim|0.097826 grey|0.097826 dark|0.077912 gray|0.077912 dark|0.077912 grey|0.077912 gray|0.064307 grey|0.064307 silver|0.060255 white|0.058767 smoke|0.058767 sea|0.05374 shell|0.05374 snow|0.053083 white|0.051207 mint|0.051133 cream|0.051133 ghost|0.050959 white|0.050959 floral|0.050873 white|0.050873 light|0.050019 gray|0.050019 light|0.050019 grey|0.050019 alice|0.049505 blue|0.049505 azure|0.047535 gainsboro|0.041476 lavender|0.040438 blush|0.040438 slate|0.025175 gray|0.025175 light|0.017555 slate|0.017555 gray|0.017555 linen|0.015155 black|0.013208 ivory|0.011147 old|0.0045744 lace|0.0045744  "
		}
	}
}
