{
	"add": {
		"doc": {
			"id": "8aaf15ad62ddc6af9d666bf2049cb92d00b132b9b57db445cce6782d1e1acd19",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Persoonia_levis_bark_3.jpg/220px-Persoonia_levis_bark_3.jpg",
			"previous": [],
				"after": "Persoonia levis grows as a tall shrub to small tree, and can reach 5 m (16 ft) in height. The flaky soft bark is dark grey on the surface,[9] while deeper layers are reddish in colour.[16] Within the bark are epicormic buds, which sprout new growth after bushfire.[13] The new growth is smooth to slightly hairy. The large green leaves measure 6 to 14 cm (2.2–5.5 in) in length, and 1.3 to 8 cm (0.5–3.2 in) in width, and are oblong or sickle-shaped (falcate).[9] The asymmetrical shape helps distinguish the species from P. lanceolata.[16] The bright green foliage, particularly of new growth, stands out against the more subdued tones of the surrounding vegetation and the stems, which are reddish in colour. The yellow flowers appear in summer and autumn (December to April),[9][16] and peak over December to February.[17] They are arranged on short axillary racemes along the branchlets. Each individual flower consists of a cylindrical perianth, consisting of tepals fused for most of their length, within which are both male and female parts. The central style is surrounded by the anther, which splits into four segments; these curl back and resemble a cross when viewed from above.[13] They provide a landing area for insects attending to the stigma, which is located at the tip of the style.[5] The smooth fleshy fruit, known as a drupe, is green and more or less round, measuring 1 cm (0.4 in) by 0.8 cm (0.3 in) in diameter.[18] It contains two seeds,[5] and has a spike at the end.[19] The drupe is juicy but stringy when unripe, and the seeds and skin are inedible.[19]",
			"color": "black|0.24292 rosy|0.10045 brown|0.10045 dim|0.07858 gray|0.07858 dim|0.07858 grey|0.07858 dark|0.065207 gray|0.065207 dark|0.065207 grey|0.065207 light|0.058081 slate|0.058081 gray|0.058081 slate|0.055618 gray|0.055618 gray|0.051448 grey|0.051448 silver|0.041551 misty|0.040881 rose|0.040881 light|0.031173 coral|0.031173 dark|0.030711 slate|0.030711 gray|0.030711 light|0.028197 gray|0.028197 light|0.028197 grey|0.028197 dark|0.027478 olive|0.027478 green|0.027478 gainsboro|0.01877 brown|0.017613 indian|0.014817 red|0.014817 lavender|0.012857 blush|0.012857  "
		}
	}
}
