{
	"add": {
		"doc": {
			"id": "8ab7ca97621418cc2193e8519217919253b340be7a286c09d8f097a5bbea661f",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/7/7b/AC-130_Spectre.jpg/220px-AC-130_Spectre.jpg",
			"previous": [],
				"after": "One of the first seven AC-130A aircraft deployed to Vietnam was AF Serial No. 53-3129, named First Lady in November 1970. This aircraft was a conversion of the first production C-130. On 25 March 1971, it took an anti-aircraft artillery hit in the belly just aft of the nose gear wheel well over the Ho Chi Minh trail in Laos. The 37 mm shell destroyed everything below the crew deck and barely missed striking two crew members. The pilot was able to crash land the aircraft safely.[54] In 1975, after the conclusion of US involvement in the Vietnam war, it was transferred to the Air Force Reserve, where it served with the 711th Special Operations Squadron of the 919th Special Operations Wing. In 1980, the aircraft was upgraded from the original three-bladed propellers to the quieter four-bladed propellers and was eventually retired in late 1995. The retirement also marked an end to the Air Force Reserve Command flying the AC-130A. The aircraft now sits on display in the final Air Force Reserve Command configuration with grey paint, black markings, and the four-bladed Hamilton Sunstrand 54H60-91 props at the Air Force Armament Museum at Eglin Air Force Base, Florida, USA.[55][56]",
			"color": "slate|0.21085 gray|0.21085 light|0.14622 slate|0.14622 gray|0.14622 steel|0.14006 blue|0.14006 dim|0.10027 gray|0.10027 dim|0.10027 grey|0.10027 cadet|0.054712 blue|0.054712 gray|0.052085 grey|0.052085 dark|0.03768 gray|0.03768 dark|0.03768 grey|0.03768 dark|0.037031 slate|0.037031 gray|0.037031 light|0.028262 gray|0.028262 light|0.028262 grey|0.028262 silver|0.027935 gainsboro|0.025827 white|0.01678 smoke|0.01678 alice|0.014904 blue|0.014904 ghost|0.013725 white|0.013725 snow|0.012017 white|0.010482 lavender|0.0098268 blush|0.0098268 sea|0.0096327 shell|0.0096327 mint|0.0093084 cream|0.0093084 azure|0.0092501 light|0.0061718 steel|0.0061718 blue|0.0061718 floral|0.006071 white|0.006071 lavender|0.0059787 linen|0.0050411  "
		}
	}
}
