{
	"add": {
		"doc": {
			"id": "8ad2057c282c31cfa142b2c2fc9a4c5e0d900fc53509797fad0475b1b82945c6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Kmtarmy.JPG/170px-Kmtarmy.JPG",
			"previous": [],
				"after": "Prior to the alliance of Germany and Italy to Japan, the Nationalist Government held close relations with both Germany and Italy. In the early 1930s, Sino-German cooperation between the Nationalist Government and Germany in military and industrial matters. Nazi Germany provided the largest proportion of Chinese arms imports and technical expertise. Relations between the Nationalist Government and Italy during the 1930s varied, however even after the Nationalist Government followed League of Nations sanctions against Italy for its invasion of Ethiopia, the international sanctions proved unsuccessful, and relations between the Fascist government in Italy and the Nationalist Government in China returned to normal shortly afterwards.[9] Up until 1936, Mussolini had provided the Nationalists with Italian military air and naval missions to help the Nationalists fight against Japanese incursions and communist insurgents.[9] Italy also held strong commercial interests and a strong commercial position in China supported by the Italian concession in Tianjin.[9] However after 1936 the relationship between the Nationalist Government and Italy changed due to a Japanese diplomatic proposal to recognize the Italian Empire that included occupied Ethiopia within it in exchange for Italian recognition of Manchukuo, Italian Foreign Minister Galeazzo Ciano accepted this offer by Japan, and on 23 October 1936 Japan recognized the Italian Empire and Italy recognized Manchukuo, as well as discussing increasing commercial links between Italy and Japan.[10]",
			"color": "rosy|0.5904 brown|0.5904 black|0.15429 misty|0.12344 rose|0.12344 lavender|0.032191 blush|0.032191 thistle|0.015377 gainsboro|0.012475 dim|0.012294 gray|0.012294 dim|0.012294 grey|0.012294 light|0.0087786 gray|0.0087786 light|0.0087786 grey|0.0087786 linen|0.0075669  "
		}
	}
}
