{
	"add": {
		"doc": {
			"id": "8afb5bd9a1e9ddcc7794a4fc02806c5b83c07ce3d80a6d5c9a78680396c7f50e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Verifiability_and_Neutral_point_of_view_%28Common_Craft%29-en.ogv/170px--Verifiability_and_Neutral_point_of_view_%28Common_Craft%29-en.ogv.jpg",
			"previous": [],
				"after": "Articles make up the bulk of Wikipedia's mainspace. Each article is on one topic (rather than a word and its definition, which belong, if at all, in Wikimedia's dictionary project called Wiktionary). The goal of a Wikipedia article is to create a comprehensive and neutrally-written summary of existing mainstream knowledge about a topic. Accordingly, Wikipedia does not publish original research. An encyclopedia is, by its nature, a tertiary source that provides a survey of information already the subject of publication in the wider world. Accordingly, and because Wikipedia is open to editing by anyone, we require that information be verifiable in reliable sources. Ideally all information should be actually cited to reliable sources to evidence it is verifiable. However, we only mandate citations for quotations, and any material whose verifiability has been challenged or is likely to be challenged. Sourcing requirements are significantly stricter in articles on living persons. Please note though that we strongly discourage people from writing about themselves, their friends, bands, websites, companies or organizations, pet projects, personal vendettas, campaigns and any other topic in which they have a conflict of interest.",
			"color": "gainsboro|0.11793 white|0.11595 smoke|0.11595 lavender|0.1075 blush|0.1075 light|0.10027 gray|0.10027 light|0.10027 grey|0.10027 ghost|0.09834 white|0.09834 alice|0.094534 blue|0.094534 snow|0.07295 sea|0.070895 shell|0.070895 linen|0.068364 lavender|0.048438 floral|0.041314 white|0.041314 dark|0.010606 gray|0.010606 dark|0.010606 grey|0.010606 white|0.010278 gray|0.0096862 grey|0.0096862 silver|0.0070924 old|0.0057409 lace|0.0057409 dim|0.0055373 gray|0.0055373 dim|0.0055373 grey|0.0055373 misty|0.0053557 rose|0.0053557 mint|0.0046378 cream|0.0046378  "
		}
	}
}
