{
	"add": {
		"doc": {
			"id": "8b0622aaffcc67902609b1aedeb9923ebce5af717fcb110150e7c08a78e51c37",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Lith_side_wash_petroglyphs_1.jpg/220px-Lith_side_wash_petroglyphs_1.jpg",
				"previous": "The early farmers from the Early Basketmaker II Era, lived in the Petrified Forest from about 1 CE to about 800 CE. They occupied pit houses at fewer than 100 sites, at first on mesas or other vantage points and later at the base of bluffs and in lowlands, where the soil was better. As climatic conditions worsened for farming between 750 and 900 CE, the settlements changed with the Pueblo I Era. Rather than below-ground pits, the Pueblo Builders constructed above-ground houses and storerooms that may have been capable of storing food for more than one year. At the same time, climatic conditions changed again, this time for the better, between 900 and 1275 CE. More than 200 pueblo-builder sites have been identified in the park at a wide variety of locations—at the mouths of washes, near seeps, and on moisture-holding sand dunes.[21]",
				"after": "During the Pueblo I Era, most sites were single-family homes, but as soils became exhausted many sites were abandoned by 1250 CE in favor of very large multi-room pueblos close to more dependable sources of water.[22] The Pueblo Builders constructed two of these large pueblos, one called Stone Axe, about 0.5 miles (0.8 km) east of the park, and the other at Puerco Pueblo, which overlooks the Puerco River near the middle of the park.[23] There they built about 100 one-story rooms around an open plaza.[23] The rooms had no windows or doors but each could be entered by climbing a ladder and descending through a hole in the roof. At its peak, perhaps 200 people lived in this pueblo.[23] Over time, however, a persistently dry climate led to out-migration, and the last residents abandoned Puerco Pueblo in about 1380 CE.[24]",
			"color": "tan|0.21438 gray|0.15862 grey|0.15862 peach|0.14465 puff|0.14465 rosy|0.10456 brown|0.10456 bisque|0.052978 antique|0.050492 white|0.050492 black|0.040072 misty|0.038648 rose|0.038648 burly|0.038477 wood|0.038477 blanched|0.021417 almond|0.021417 dim|0.020763 gray|0.020763 dim|0.020763 grey|0.020763 papaya|0.01868 whip|0.01868 linen|0.014715 wheat|0.014344 dark|0.009112 khaki|0.009112 old|0.0090108 lace|0.0090108  "
		}
	}
}
