{
	"add": {
		"doc": {
			"id": "8b0fc24912c9671f5709bbc7ff4ccf70438dd919e222cd27b6e1915243e11b11",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/AC-130_Training.jpg/220px-AC-130_Training.jpg",
				"previous": "In 1967, JC-130A USAF 54-1626 was selected for conversion into the prototype AC-130A gunship (Project Gunship II). The modifications were done at Wright-Patterson Air Force Base by the Aeronautical Systems Division. A direct view night vision telescope was installed in the forward door, an early forward looking infrared (FLIR) in the forward part of the left wheel well, and Gatling guns fixed facing down and aft along the left side. The analog fire control computer prototype was handcrafted by RAF Wing Commander Tom Pinkerton at the USAF Avionics Laboratory at Wright-Patterson AFB. Flight testing of the prototype was performed primarily at Eglin Air Force Base, followed by further testing and modifications. By September 1967, the aircraft was certified ready for combat testing and was flown to Nha Trang Air Base, South Vietnam for a 90-day test program.[6] The AC-130 was later supplemented by the AC-119 Shadow (Project Gunship III), which later proved to be underpowered.",
				"after": "Seven more warplanes were converted to the \"Plain Jane\" configuration like the AC-130 prototype in 1968,[8] and one aircraft received the \"Surprise Package\" equipment in 1969.[9] Surprise Package included the latest 20 mm rotary cannons and 40 mm Bofors cannon but no 7.62 mm close support armament. Surprise Package served as a test bed for the avionic systems and armament for the AC-130E.",
			"color": "dark|0.26078 gray|0.26078 dark|0.26078 grey|0.26078 silver|0.14794 slate|0.1208 gray|0.1208 light|0.11106 slate|0.11106 gray|0.11106 gray|0.080106 grey|0.080106 light|0.053016 gray|0.053016 light|0.053016 grey|0.053016 dim|0.038796 gray|0.038796 dim|0.038796 grey|0.038796 gainsboro|0.024249 antique|0.020384 white|0.020384 black|0.01718 peach|0.010287 puff|0.010287 bisque|0.0096515 papaya|0.0095466 whip|0.0095466 linen|0.0092554 blanched|0.0087046 almond|0.0087046 old|0.0073212 lace|0.0073212 beige|0.0063428 corn|0.0059992 silk|0.0059992 tan|0.0057986 misty|0.0053278 rose|0.0053278 wheat|0.0038621 rosy|0.0037554 brown|0.0037554 floral|0.0036455 white|0.0036455 light|0.0036328 yellow|0.0036328  "
		}
	}
}
