{
	"add": {
		"doc": {
			"id": "8b1993c1c16ba73f9b65397bada3ae043f5e20ba7dc6192f89f6abd4feb5ad54",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/WTC-remnant_highres.jpg/170px-WTC-remnant_highres.jpg",
				"previous": "In the largest restructuring of the U.S. government in contemporary history, the United States enacted the Homeland Security Act of 2002, creating the Department of Homeland Security. Congress also passed the USA PATRIOT Act, saying it would help detect and prosecute terrorism and other crimes.[188] Civil liberties groups have criticized the PATRIOT Act, saying it allows law enforcement to invade the privacy of citizens and that it eliminates judicial oversight of law enforcement and domestic intelligence.[189][190][191] In an effort to effectively combat future acts of terrorism, the National Security Agency (NSA) was given broad powers. NSA commenced warrantless surveillance of telecommunications, which was sometimes criticized since it permitted the agency \"to eavesdrop on telephone and e-mail communications between the United States and people overseas without a warrant\".[192] In response to requests by various intelligence agencies, the United States Foreign Intelligence Surveillance Court permitted an expansion of powers by the U.S. government in seeking, obtaining, and sharing information on U.S. citizens as well as non-U.S. people from around the world.[193]",
				"after": "Shortly after the attacks, President Bush made a public appearance at Washington's largest Islamic Center and acknowledged the \"incredibly valuable contribution\" that millions of American Muslims made to their country and called for them \"to be treated with respect.\"[194] However, numerous incidents of harassment and hate crimes against Muslims and South Asians were reported in the days following the attacks.[195][196][197] Sikhs were also targeted because Sikh males usually wear turbans, which are stereotypically associated with Muslims. There were reports of attacks on mosques and other religious buildings (including the firebombing of a Hindu temple), and assaults on people, including one murder: Balbir Singh Sodhi, a Sikh mistaken for a Muslim, was fatally shot on September 15, 2001, in Mesa, Arizona.[197]",
			"color": "black|0.49462 dim|0.056671 gray|0.056671 dim|0.056671 grey|0.056671 gray|0.045177 grey|0.045177 dark|0.04408 gray|0.04408 dark|0.04408 grey|0.04408 silver|0.028769 light|0.025866 gray|0.025866 light|0.025866 grey|0.025866 alice|0.024808 blue|0.024808 gainsboro|0.024263 light|0.020577 steel|0.020577 blue|0.020577 white|0.01923 smoke|0.01923 ghost|0.017699 white|0.017699 azure|0.017328 lavender|0.014263 mint|0.014213 cream|0.014213 snow|0.013389 white|0.013281 tan|0.01098 light|0.0097237 cyan|0.0097237 sea|0.0085339 shell|0.0085339 floral|0.0084834 white|0.0084834 lavender|0.0069925 blush|0.0069925 wheat|0.0046371 blanched|0.0045747 almond|0.0045747  "
		}
	}
}
