{
	"add": {
		"doc": {
			"id": "8b1d92bde825dbede152c6c5425b7c0e5c0cd4b6d843e8b8b5fcbc1f8a624eba",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Tulsa%2C_Oklahoma.jpg/220px-Tulsa%2C_Oklahoma.jpg",
				"previous": "Downtown Tulsa is an area of approximately 1.4 square miles (3.6 km2) surrounded by an inner-dispersal loop created by Interstate 244, Highway 64, and Highway 75.[48] The area serves as Tulsa's financial and business district, and is the focus of a large initiative to draw tourism, which includes plans to capitalize on the area's historic architecture.[49] Much of Tulsa's convention space is located in downtown, such as the Tulsa Performing Arts Center, the Tulsa Convention Center, and the BOK Center. Prominent downtown sub-districts include the Blue Dome District, the Brady Arts district, the \"Oil Capital Historic District\", the Greenwood Historical District, Owen Park Historical Neighborhood, and the site of ONEOK Field, a baseball stadium for the Tulsa Drillers opened in 2010.[50][51][52]",
				"after": "The city's historical residential core lies in an area known as Midtown, containing upscale neighborhoods built in the early 20th century with architecture ranging from art deco to Greek Revival. The University of Tulsa, the Swan Lake neighborhood, Philbrook Museum, and the upscale shopping districts of Utica Square, Cherry Street, and Brookside are located in this region. A large portion of the city's southern half has developed since the 1970s, containing low density housing and retail developments. This region, marked by secluded homes and suburban neighborhoods, contains one of the state's largest shopping malls, Woodland Hills Mall, as well as Southern Hills Country Club, and Oral Roberts University. East of Highway 169 and north of 61st street, a diverse racial makeup marks the eastern portions of the city, with large Asian and Mexican communities and much of the city's manufacturing industry.",
			"color": "gray|0.35365 grey|0.35365 dark|0.21145 gray|0.21145 dark|0.21145 grey|0.21145 dim|0.16268 gray|0.16268 dim|0.16268 grey|0.16268 light|0.10897 slate|0.10897 gray|0.10897 black|0.075242 slate|0.054782 gray|0.054782 dark|0.013874 slate|0.013874 gray|0.013874 dark|0.013786 olive|0.013786 green|0.013786 silver|0.0050755  "
		}
	}
}
