{
	"add": {
		"doc": {
			"id": "8b284c82636f9874ed051b117d50b5c77911a704a977b201ff29329af3f26c8e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Miami_PanAm_Terminal_1940.jpg/220px-Miami_PanAm_Terminal_1940.jpg",
				"previous": "Six large, long-range Boeing 314 flying boats were delivered to Pan Am in early 1939, and the new type enabled the start of scheduled weekly contract Foreign Air Mail (F.A.M. 18) service and later passenger flights from New York (Port Washington, L.I.) to both France and Britain. The Southern route to France was inaugurated for Air Mail on May 20, 1939 by the Yankee Clipper piloted by Arthur E. LaPorte flying via Horta, Azores and Lisbon, Portugal to Marseilles.[30] Passenger service over the route was added on June 28, 1939 by the Dixie Clipper piloted by R.O.D. Sullivan.[31] The Eastbound trip departed every Wednesday at Noon and arrived at Marseilles on Friday at 3 pm GCT with return service leaving Marseilles on Sunday at 8 am and arriving at Port Washington on Tuesday at 7 am. The Northern transatlantic route to Britain was inaugurated for Air Mail service on June 24, 1939 by the Yankee Clipper piloted by Harold Gray flying via Shediac (New Brunswick), Botwood (Newfoundland), and Foynes (Ireland) to Southampton.[32][33] Passenger service was added on the Northern route on July 8, 1939 by the Yankee Clipper.[34] Eastbound flights left on Saturday at 7:30 am and arrived at Southampton on Sunday at 1 pm GCT. Westbound service departed Southampton on Wednesday at Noon and arrived at Port Washington on Thursday at 3 pm. After the outbreak of World War II in Europe on September 1, 1939 the terminus became Foynes until the service ceased for the winter on October 5 while transatlantic service to Lisbon via the Azores continued into 1941. During the war Pan Am flew over 90 million miles (145 million kilometers) worldwide in support of military operations.[10]",
				"after": "In 1940 Pan Am and TWA began using the Boeing 307 Stratoliner, the first pressurized airliner in service and the first with a flight engineer in the crew. The Boeing 307's airline service was short-lived, as all were commandeered for military service at the outbreak of World War II.[35]",
			"color": " "
		}
	}
}
