{
	"add": {
		"doc": {
			"id": "8b2c047f7d0a3681106a22fcbf8c37bfbd0dfa0b1ad15ac495b58f539de00a2e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/88-1803_RIAT_Bthebest.JPG/220px-88-1803_RIAT_Bthebest.JPG",
				"previous": "The first fully operational MC-130H Combat Talon II (87-0024) was received by the 8th SOS on June 29, 1991, with three others delivered over the summer. The official acceptance ceremony for the Talon II was held at Hurlburt in October, and by December 1991 the 8th SOS was equipped with six.[87] The Combat Talon II features a stronger airframe and modifications to the rear and aft cargo doors. The electronics suite has been upgraded, and includes Global Positioning System navigation, special radars for navigating in adverse weather, and night vision goggles (NVG) capability. These new technologies allow the Combat Talon II to fly as low as 250 feet (76 m) above ground level (AGL) in inclement weather, and make faster, more accurate airdrops. Increases in automation also reduce the aircrew by two. Initial Operational capability was reached on June 30, 1993.[88]",
				"after": "Three MC-130H Combat Talon IIs of the 7th SOS were deployed in December 1995 to deliver peacekeeping forces to Tuzla and Sarajevo, Bosnia and Herzegovina, as part of Operation Joint Endeavor, during which one Talon was hit by ground fire.[89] The first combat deployment of a Combat Talon II was on April 8, 1996, during Operation Assured Response. Special operations forces were deployed to Liberia to assist in the evacuation of 2000 civilians from the American embassy when the country broke down into civil war. However orders to combat drop an 18-man SEAL team off Monrovia were rescinded and the mission landed in Sierra Leone.[90] Similar circumstances brought the Combat Talon II to Zaire in 1997.",
			"color": "dim|0.52892 gray|0.52892 dim|0.52892 grey|0.52892 gray|0.2178 grey|0.2178 dark|0.082739 slate|0.082739 gray|0.082739 dark|0.062687 gray|0.062687 dark|0.062687 grey|0.062687 slate|0.030716 gray|0.030716 black|0.02718 light|0.021412 slate|0.021412 gray|0.021412 silver|0.01651  "
		}
	}
}
