{
	"add": {
		"doc": {
			"id": "8b366f28f174eed1a9e5da4653cf1e466f9ffb4fa3f88833c1410b320f14d442",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Macaroni_%28js%291.jpg/170px-Macaroni_%28js%291.jpg",
			"previous": [],
				"after": "The macaroni penguin is a large, crested penguin, similar in appearance to other members of the genus Eudyptes. An adult bird has an average length of around 70 cm (28 in);[3] the weight varies markedly depending on time of year and sex. Males average from 3.3 kg (7 lb) after incubating, or 3.7 kg (8 lb) after moult to 6.4 kg (14 lb) before moult, while females average 3.2 kg (7 lb) after to 5.7 kg (13 lb) before moult.[12] Among standard measurements, the thick bill (from the gape) measures 7 to 8 cm (2.8 to 3.1 in), the culmen being around a centimetre less. The wing, from the shoulder to the tip, is around 20.4 cm (8.0 in) and the tail is 9–10 cm (3.5–3.9 in) long.[13] The head, chin, throat, and upper parts are black and sharply demarcated against the white under parts. The black plumage has a bluish sheen when new and brownish when old. The most striking feature is the yellow crest that arises from a patch on the centre of the forehead, and extends horizontally backwards to the nape. The flippers are blue-black on the upper surface with a white trailing edge, and mainly white underneath with a black tip and leading edge. The large, bulbous bill is orange-brown. The iris is red and a patch of pinkish bare skin is found from the base of the bill to the eye. The legs and feet are pink. The male and female are similar in appearance, although males tend to be slightly larger.[3] Males also bear relatively larger bills, which average around 6.1 cm (2.4 in) compared to 5.4 cm (2.1 in) in females; this feature has been used to tell the sexes apart.[12]",
			"color": "gray|0.37637 grey|0.37637 dark|0.24138 gray|0.24138 dark|0.24138 grey|0.24138 dim|0.1218 gray|0.1218 dim|0.1218 grey|0.1218 silver|0.086452 black|0.08491 light|0.027941 gray|0.027941 light|0.027941 grey|0.027941 gainsboro|0.018495 rosy|0.0057641 brown|0.0057641 peru|0.0052838  "
		}
	}
}
