{
	"add": {
		"doc": {
			"id": "8b36e0c5a37356cfc5fe2b72b261d07e90b7581ab17c804ea03881e9d793d69d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/La_Suisse_secourant_Strasbourg.JPG/200px-La_Suisse_secourant_Strasbourg.JPG",
			"previous": [],
				"after": "Basel has a thriving cultural life. (In 1997, it contended to become the \"European Capital of Culture\", though the honor went instead to Thessaloniki) Basel is the home of the Schola Cantorum Basiliensis, founded in 1933, a worldwide centre for research on and performance of music from the Medieval through the Baroque eras. Theater Basel presents a busy schedule of plays in addition to being home to the city's opera and ballet companies. Basel is home to the largest orchestra in Switzerland, the Sinfonieorchester Basel. It is also the home of the Kammerorchester Basel, which is recording the complete symphonies of Ludwig van Beethoven for the Sony label led by its music director Giovanni Antonini. The Schola Cantorum and the Basler Kammerorchester were both founded by the conductor Paul Sacher who went on to commission works by many leading composers. The Paul Sacher Foundation, opened in 1986, houses a major collection of manuscripts, including the entire Igor Stravinsky archive. The baroque orchestras La Cetra and Capriccio Basel are also based in Basel. In May 2004, the fifth European Festival of Youth Choirs (Europäisches Jugendchorfestival, or EJCF) choir festival opened: this Basel tradition started in 1992. Host of this festival is the local Basel Boys Choir.",
			"color": "dark|0.19983 gray|0.19983 dark|0.19983 grey|0.19983 dim|0.14869 gray|0.14869 dim|0.14869 grey|0.14869 gray|0.13365 grey|0.13365 silver|0.11195 black|0.086832 dark|0.0631 olive|0.0631 green|0.0631 light|0.043167 gray|0.043167 light|0.043167 grey|0.043167 tan|0.032589 gainsboro|0.030342 burly|0.022198 wood|0.022198 light|0.021523 slate|0.021523 gray|0.021523 slate|0.012236 gray|0.012236 linen|0.010151 white|0.0082952 smoke|0.0082952 sea|0.007474 shell|0.007474  "
		}
	}
}
