{
	"add": {
		"doc": {
			"id": "8b3c5cda3db9327ca0b6dcb3b9171dd0f5234b1c31ac638ac92c0a832f62f1df",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Nuremberg_chronicles_-_Strange_People_-_Umbrella_Foot_%28XIIr%29.jpg/220px-Nuremberg_chronicles_-_Strange_People_-_Umbrella_Foot_%28XIIr%29.jpg",
				"previous": "Nature for Pliny was divine, a pantheistic concept inspired by the Stoic philosophy which underlies much of his thought. But the deity in question was a goddess whose main purpose was to serve the human race: \"nature, that is life\" is human life in a natural landscape. After an initial survey of cosmology and geography, Pliny starts his treatment of animals with the human race, \"for whose sake great Nature appears to have created all other things\".[6] This teleological view of nature was common in antiquity and is crucial to the understanding of the Natural History.[7] The components of nature are not just described in and for themselves, but also with a view to their role in human life. Pliny devotes a number of the books to plants, with a focus on their medicinal value; the books on minerals include descriptions of their uses in architecture, sculpture, painting and jewellery. If Pliny's premise seems remote from modern ecological theories, the result is a compendium of an entire culture.[8]",
				"after": "Pliny's work frequently reflects Rome's imperial expansion which brought new and exciting things to the capital: exotic eastern spices, strange animals to be put on display or herded into the arena, even the alleged phoenix sent to the emperor Claudius in AD 47 – although, as Pliny admits, this was generally acknowledged to be a fake. Pliny repeated Aristotle's maxim that Africa was always producing something new. Nature's variety and versatility were claimed to be infinite: \"When I have observed nature she has always induced me to deem no statement about her incredible.\"[9] This led Pliny to recount rumours of strange peoples on the edges of the world.[a] These monstrous races – the Cynocephali or Dog-Heads, the Sciapodae, whose single foot could act as a sunshade, the mouthless Astomi, who lived on scents – were not strictly new. They had been mentioned by the Greek historian Herodotus in the 5th century BC, but Pliny made them better known.[10]",
			"color": "wheat|0.17143 moccasin|0.14124 lemon|0.12652 chiffon|0.12652 pale|0.096104 golden|0.096104 rod|0.096104 bisque|0.087888 blanched|0.080699 almond|0.080699 navajo|0.07437 white|0.07437 peach|0.067054 puff|0.067054 light|0.058467 golden|0.058467 rod|0.058467 yellow|0.058467 papaya|0.042286 whip|0.042286 tan|0.021212 antique|0.01551 white|0.01551 corn|0.012204 silk|0.012204 light|0.0038709 yellow|0.0038709  "
		}
	}
}
