{
	"add": {
		"doc": {
			"id": "8b6788b893ae51222644e5c983b0ac9849cc836d28b343b2e159608f1a3626dd",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/9/95/Surrender_hill_01.jpg/220px-Surrender_hill_01.jpg",
				"previous": "Roberts launched his main attack on 10 February 1900 and although hampered by a long supply route, managed to outflank the Boers defending Magersfontein. On 14 February, a cavalry division under Major General John French launched a major attack to relieve Kimberley. Although encountering severe fire, a massed cavalry charge split the Boer defences on 15 February, opening the way for French to enter Kimberley that evening, ending its 124 days' siege.",
				"after": "Meanwhile, Roberts pursued Piet Cronje's 7,000-strong force, which had abandoned Magersfontein to head for Bloemfontein. General French's cavalry was ordered to assist in the pursuit by embarking on an epic 50-kilometre (31 mi) drive towards Paardeberg where Cronje was attempting to cross the Modder River. At the Battle of Paardeberg from 18 to 27 February, Roberts then surrounded General Piet Cronje's retreating Boer army. On 17 February, a pincer movement involving both French's cavalry and the main British force attempted to take the entrenched position, but the frontal attacks were uncoordinated and so were easily repulsed by the Boers. Finally, Roberts resorted to bombarding Cronje into submission, but it took a further ten precious days and with the British troops using the polluted Modder River as water supply, resulting in a typhoid epidemic killing many troops. General Cronje was forced to surrender at Surrender Hill with 4000 men.",
			"color": "tan|0.5222 black|0.15738 burly|0.06769 wood|0.06769 wheat|0.031285 dark|0.026082 gray|0.026082 dark|0.026082 grey|0.026082 peach|0.025197 puff|0.025197 bisque|0.022235 silver|0.020837 dim|0.016854 gray|0.016854 dim|0.016854 grey|0.016854 antique|0.014578 white|0.014578 blanched|0.012934 almond|0.012934 gray|0.012777 grey|0.012777 light|0.010035 gray|0.010035 light|0.010035 grey|0.010035 papaya|0.0093268 whip|0.0093268  "
		}
	}
}
