{
	"add": {
		"doc": {
			"id": "8b7a1ce26ade50a5127900fa980269f1560d04c0aeaa1bd04d68b9d6d460a37b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/131_Ponce_de_Leon_Ave.%2C_Atlanta_-_I.M._Pei_building.JPG/220px-131_Ponce_de_Leon_Ave.%2C_Atlanta_-_I.M._Pei_building.JPG",
				"previous": "His first project for Webb and Knapp was an apartment building with funding from the Housing Act of 1949. Pei's design was based on a circular tower with concentric rings. The areas closest to the supporting pillar handled utilities and circulation; the apartments themselves were located toward the outer edge. Zeckendorf loved the design and even showed it off to Le Corbusier when they met. The cost of such an unusual design was too high, however, and the building never moved beyond the model stage.[28]",
				"after": "Pei finally saw his architecture come to life in 1949,[29] when he designed a two-story corporate building for Gulf Oil in Atlanta, Georgia. The building was demolished in February 2013 although the front facade will be retained as part of an apartment development. His use of marble for the exterior curtain wall brought praise from the journal Architectural Forum.[30] Pei's designs echoed the work of Mies van der Rohe in the beginning of his career as also shown in his own weekend-house in Katonah in 1952. Soon Pei was so inundated with projects that he asked Zeckendorf for assistants, which he chose from his associates at the GSD, including Henry N. Cobb and Ulrich Franzen. They set to work on a variety of proposals, including the Roosevelt Field Shopping Mall. The team also redesigned the Webb and Knapp office building, transforming Zeckendorf's office into a circular space with teak walls and a glass clerestory. They also installed a control panel into the desk that allowed their boss to control the lighting in his office. The project took one year and exceeded its budget, but Zeckendorf was delighted with the results.[31]",
			"color": "dim|0.41125 gray|0.41125 dim|0.41125 grey|0.41125 black|0.24717 gray|0.19647 grey|0.19647 dark|0.047734 gray|0.047734 dark|0.047734 grey|0.047734 slate|0.028791 gray|0.028791 light|0.017353 slate|0.017353 gray|0.017353 silver|0.012307 light|0.0082177 gray|0.0082177 light|0.0082177 grey|0.0082177 gainsboro|0.0061448  "
		}
	}
}
