{
	"add": {
		"doc": {
			"id": "8b7c05cbbbb9c4a3230c32dcff05bf4180c82727e83945baa9f66c9863feb099",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Jwstudy.jpg/220px-Jwstudy.jpg",
				"previous": "An Experiment on a Bird in the Air Pump followed in 1768, the emotionally charged experiment contrasting with the orderly scene from The Orrery. The painting, which measures 72 by 94½ inches (183 by 244 cm), shows a white cockatoo fluttering in panic as the air is slowly withdrawn from the vessel by the pump. The witnesses display various emotions: one of the girls worriedly watches the fate of the bird, while the other is too upset to observe and is comforted by her father; two gentlemen (one of them dispassionately timing the experiment) and a boy look on with interest, while the young lovers to the left of the painting are absorbed only in each other.[19] The scientist himself looks directly out of the picture, as if challenging the viewer to judge whether the pumping should continue, killing the bird, or whether the air should be replaced and the cockatoo saved.[20] Aside from that of the children, little sympathy is directed toward the bird; David Solkin suggests the subjects of the painting show the dispassionate detachment of the evolving scientific society. Individuals are concerned for each other: the father for his children, the young man for the girl, but the distress of the cockatoo elicits only careful study.[21] To one side of the boy at the rear, the cockatoo's empty cage can be seen on the wall, and to further heighten the drama it is unclear whether the boy is lowering the cage on the pulley to allow the bird to be replaced after the experiment or hoisting the cage back up, certain of its former occupant's death. It has also been suggested that he may be drawing the curtains to block out the light from the full moon.",
				"after": "Jenny Uglow believes that the boy echoes the figure in the last print of William Hogarth's The Four Stages of Cruelty by pointing out the arrogance and potential cruelty of experimentation,[18] while David Fraser also sees the compositional similarities with the audience grouped round a central demonstration.[23] The neutral stance of the central character and the uncertain intentions of the boy with the cage were both later ideas: an early study, discovered on the back of a self-portrait, omits the boy and shows the natural philosopher reassuring the girls. In this sketch it is obvious that the bird will survive, and thus the composition lacks the power of the final version.[24] Wright, who took many of his subjects from English poetry, probably knew the following passage from \"The Wanderer\" (1729) by Richard Savage:[25]",
			"color": " "
		}
	}
}
