{
	"add": {
		"doc": {
			"id": "8b97482ebdfe4edb7e242f43f43c726428b47b28f008e52525876914f6715260",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/NSDAP-Logo.svg/165px-NSDAP-Logo.svg.png",
				"previous": "The party grew out of smaller political groups with a nationalist orientation that formed in the last years of World War I. In 1918, a league called the Freien Arbeiterausschuss für einen guten Frieden (Free Workers' Committee for a good Peace)[27] was created in Bremen, Germany. On 7 March 1918, Anton Drexler, an avid German nationalist, formed a branch of this league in Munich called the \"Committee of Independent Workmen\".[28] Drexler was a local locksmith in Munich who had been a member of the militarist Fatherland Party[29] during World War I, and was bitterly opposed to the armistice of November 1918 and the revolutionary upheavals that followed. Drexler followed the typical views of militant nationalists of the day, such as opposing the Treaty of Versailles, having antisemitic, anti-monarchist and anti-Marxist views, as well as believing in the superiority of Germans whom nationalists claimed to be part of the Aryan \"master race\" (Herrenvolk), but he also accused international capitalism of being a Jewish-dominated movement and denounced capitalists for war profiteering in World War I.[30] Drexler saw the situation of political violence and instability in Germany as the result of the new Weimar Republic being out-of-touch with the masses, especially the lower classes.[30] Drexler emphasized the need for a synthesis of völkisch nationalism with a form of economic socialism, in order to create a popular nationalist-oriented workers' movement that could challenge the rise of Communism and internationalist politics.[31] These were all well-known themes popular with various Weimar paramilitary groups such as the Freikorps.",
				"after": "Though very small, Drexler's movement did receive attention and support from some influential figures. Supporter Dietrich Eckhart brought military figure Count Felix Graf von Bothmer, a prominent supporter of the concept of \"national socialism\", to address the movement.[32] Later in 1918, Karl Harrer (a journalist and member of the Thule Society), along with Drexler and several others formed the Politischer Arbeiterzirkel (Political Workers' Circle).[27] The members met periodically for discussions with themes of nationalism and racism directed against the Jews.[27] In December 1918, Drexler decided a new political party should be formed based on the political principles which he endorsed by combining his Committee of Independent Workmen with the Political Workers' Circle.[27][33]",
			"color": "snow|0.068633 white|0.068458 smoke|0.068458 white|0.067577 light|0.066969 coral|0.066969 ghost|0.066035 white|0.066035 alice|0.062336 blue|0.062336 mint|0.062278 cream|0.062278 sea|0.061206 shell|0.061206 floral|0.060678 white|0.060678 misty|0.059418 rose|0.059418 azure|0.056988 pink|0.053765 lavender|0.046908 blush|0.046908 light|0.044864 pink|0.044864 ivory|0.027171 salmon|0.021275 dark|0.019277 gray|0.019277 dark|0.019277 grey|0.019277 linen|0.018883 silver|0.016557 light|0.013549 gray|0.013549 light|0.013549 grey|0.013549 gainsboro|0.011387 gray|0.0095543 grey|0.0095543 light|0.0074408 cyan|0.0074408  "
		}
	}
}
