{
	"add": {
		"doc": {
			"id": "8b9f90755964666ba7adfe113930b7c233d944b312df5a3d3d5a266dd0cd983b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/T-45A_Goshawk_04.jpg/220px-T-45A_Goshawk_04.jpg",
				"previous": "The Goshawk's origins began in the mid-1970s, when the US Navy began looking for replacement for its T-2 and TA-4 trainers.[4][5] The US Navy started the VTXTS advanced trainer program in 1978. British Aerospace (BAe) and McDonnell Douglas (MDC) proposed a version of the Hawk and were awarded the T-45 contract in 1981.[6]",
				"after": "The Hawk had not been designed for carrier operations and numerous modifications were required to make it suitable for use on carriers. These included improvements to the low-speed handling characteristics and a reduction in the approach speed.[4] It was found that the aircraft was apt to stall at the low approach speed required. Modifications were designed by BAe in England; most notably a simple slat system was devised, operated by an actuator and linkage mechanism to fit into the small space available. Strakes were also added on the fuselage to improve airflow. The re-design allowed the T-45 to become carrier capable.[citation needed] Other changes were strengthened airframe,[7] more robust and wider landing gear with catapult tow bar attachment and an arresting hook.[4] It features a two-wheel nose landing gear.[8]",
			"color": "dim|0.38738 gray|0.38738 dim|0.38738 grey|0.38738 dark|0.21832 slate|0.21832 gray|0.21832 gray|0.076937 grey|0.076937 white|0.022875 smoke|0.022875 gainsboro|0.021735 light|0.019859 gray|0.019859 light|0.019859 grey|0.019859 dark|0.019591 gray|0.019591 dark|0.019591 grey|0.019591 snow|0.019257 ghost|0.018806 white|0.018806 alice|0.018414 blue|0.018414 sea|0.018287 shell|0.018287 white|0.017158 lavender|0.016651 blush|0.016651 silver|0.01658 mint|0.015367 cream|0.015367 floral|0.014306 white|0.014306 linen|0.01185 azure|0.011208 indian|0.0087989 red|0.0087989 brown|0.0067198 slate|0.005203 gray|0.005203 firebrick|0.0049113 misty|0.0043069 rose|0.0043069  "
		}
	}
}
