{
	"add": {
		"doc": {
			"id": "8bb0d723b764903a81f440316c4ffbcbe9df266e776f4012cfeae3d882020f7b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/MH_-map_A.png/220px-MH_-map_A.png",
				"previous": "On 28 April 2015 the Iranian navy seized the Marshall Island-flagged MV Maersk Tigris near the Strait of Hormuz. The ship had been charted by Germany's Rickmers ship management, who stated that the ship contained no special cargo including military weapons. The ship was reported to be under the control of the Iranian Revolutionary Guard according to the Pentagon amid escalating tensions in the region due to the intensifying of Saudi-led coalition attacks in Yemen. The Pentagon reported that the destroyer USS Farragut and a maritime reconnaissance aircraft were dispatched upon receiving a distress call from the ship Tigris and was also reported that all 34 crew members were detained.US defense officials have said that they would review their defense obligations to the Government of Marshall Islands in wake of the recent events and also condemned the shots fired at the bridge as \"inappropriate\".It was reported in may that Tehran would release the ship after a paid a penalty.[24][25]",
			"after": [
				"The islands are located north of Nauru and Kiribati, east of the Federated States of Micronesia, and south of the U.S. territory of Wake Island, to which it lays claim.",
				"The country consists of 29 atolls and 5 isolated islands.[26] The atolls and islands form two groups: the Ratak Chain and the Ralik Chain (meaning \"sunrise\" and \"sunset\" chains). 24 of them are inhabited (see above section). The uninhabited atolls are:"
			],
			"color": "light|0.28809 steel|0.28809 blue|0.28809 silver|0.19668 dark|0.093721 gray|0.093721 dark|0.093721 grey|0.093721 rosy|0.092336 brown|0.092336 sky|0.083564 blue|0.083564 light|0.075408 blue|0.075408 light|0.05494 slate|0.05494 gray|0.05494 light|0.052016 sky|0.052016 blue|0.052016 indian|0.024931 red|0.024931 slate|0.018006 gray|0.018006 dark|0.01662 sea|0.01662 green|0.01662  "
		}
	}
}
