{
	"add": {
		"doc": {
			"id": "8bc2a38ab9b852adbde9a806a0a25594f0c2733ecb4139430da84fe69a607c7b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/CottonField.PhoenixAZ.140320.jpg/220px-CottonField.PhoenixAZ.140320.jpg",
				"previous": "The early economy of Phoenix was focused primarily on agriculture and natural resources, dependent mainly on the \"5Cs\", which were copper, cattle, climate, cotton, and citrus.[11] Once the Salt River Project was completed, the city, and the valley in general, began to develop more rapidly, due to a now fairly reliable source of water. Led by agriculture, the number one crop in the 1910s was alfalfa, followed by citrus, cotton, and other crops, with almost a quarter-million acres under cultivation by the middle of the decade. World War I would greatly change the agricultural landscape of the valley, and teach the farmers of the region an invaluable, if difficult lesson.[105][106]",
				"after": "As the war began, imports of foreign cotton were no longer available to American manufacturing, since cotton was a major material used in the production of tires and airplane fabric, those manufacturers began to look for new sources. The Salt River Valley looked to be an ideal location for expansion of the cotton crop. Led by Goodyear, tire and airplane manufacturers began to buy more and more cotton from valley growers. In fact, the town of Goodyear was founded during this period when the company purchased desert acreage southwest of Phoenix to grow cotton. By 1918, cotton had replaced alfalfa as the number one industry in Phoenix. As the price of cotton rose, more and more of Phoenix acreage was devoted to the crop. However, in 1920, when cotton accounted for three-quarters of the cultivated acreage in the valley, the bottom fell out of the cotton market due to the dual reasons of lower demand due to the end of the war production machine and foreign growers now once again having access to the American market, resulting in their shipping large amounts of cotton to the U.S. This led to a diversification of crops in the valley from that point forward.[107][106]",
			"color": "black|0.38495 dark|0.25896 olive|0.25896 green|0.25896 dark|0.21829 gray|0.21829 dark|0.21829 grey|0.21829 dim|0.045911 gray|0.045911 dim|0.045911 grey|0.045911 light|0.041852 slate|0.041852 gray|0.041852 silver|0.022907 gray|0.018575 grey|0.018575 olive|0.0066759 drab|0.0066759  "
		}
	}
}
