{
	"add": {
		"doc": {
			"id": "8bcc0b8c503aadead07e90efdbd1291a25937fb8b546942bb99a883090a7c91a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Second_world_war_europe_animation_large_de.gif/220px-Second_world_war_europe_animation_large_de.gif",
				"previous": "Germany's foreign policy during the war involved the creation of allied governments under direct or indirect control from Berlin. A main goal was obtaining soldiers from the senior allies, such as Italy and Hungary, and millions of workers and ample food supplies from subservient allies such as Vichy France.[66] By the fall of 1942, there were 24 divisions from Romania on the Eastern Front, 10 from Italy, and 10 from Hungary.[67] When a country was no longer dependable, Germany assumed full control, as it did with France in 1942, Italy in 1943, and Hungary in 1944. Although Japan was an official powerful ally, the relationship was distant and there was little co-ordination or co-operation. For example, Germany refused to share their formula for synthetic oil from coal until late in the war.[68]",
				"after": "Germany invaded Poland on 1 September 1939. Britain and France declared war on Germany two days later. World War II was under way.[69] Poland fell quickly, as the Soviets attacked from the east on 17 September.[70] Reinhard Heydrich, then head of the Gestapo, ordered on 21 September that Jews should be rounded up and concentrated into cities with good rail links. Initially the intention was to deport the Jews to points further east, or possibly to Madagascar.[71] Using lists prepared ahead of time, some 65,000 Polish intelligentsia, noblemen, clergy, and teachers were killed by the end of 1939 in an attempt to destroy Poland's identity as a nation.[72][73] The Soviets continued to attack, advancing into Finland in the Winter War, and German forces were involved in action at sea. But little other activity occurred until May, so the period became known as the \"Phoney War\".[74]",
			"color": " "
		}
	}
}
