{
	"add": {
		"doc": {
			"id": "8bec2ccc18cd2425d74c72218967447c0a5503578f228f114fcee6fc5211f135",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/1/19/London_Necropolis_bombing.jpg/300px-London_Necropolis_bombing.jpg",
				"previous": "On 13 April 1927 Cyril Tubbs died, after almost 40 years as surveyor, general manager and later a director of the LNC.[2] Shortly afterwards, during meetings of the LNC's shareholders on 16 June and 14 July 1927, the words \"National Mausoleum\" were formally dropped from the LNC's name, the company being officially renamed the London Necropolis Company.[2] On 28 December 1927 George Barratt, who had worked for the LNC for 63 years and been Superintendent of Brookwood Cemetery for 41 years, also died.[2] Although the number of burials was gradually declining, it remained relatively steady. However, by this time mechanical hearses had begun to affect the numbers of people using the London Necropolis Railway. Trains still ran to the cemetery when there was demand, but the service which had previously operated almost every day was now generally only running around twice a week.[2] By now the trees planted by the LNC in its early years of operations were mature, and Brookwood Cemetery was becoming a tourist attraction in its own right, often featuring in excursion guides of the 1920s and 1930s.[124]",
				"after": "During the Second World War Waterloo station and the nearby Thames bridges were a significant target for bombing, and there were several near-misses on the station during the London Blitz of 1940–41.[125] Although there were several interruptions to the Necropolis train service owing to enemy action elsewhere on the line, the Necropolis station was undamaged during the early stages of the bombing campaign.[125] During the night of 16–17 April 1941, in one of the last major air raids on London, this good fortune came to an end. As bombs repeatedly fell on the Waterloo area, the rolling stock parked in the Necropolis siding was burned, and the railway arch connecting the main line to the Necropolis terminus was badly damaged.[126] Multiple incendiary devices and high explosive bombs struck the central section of the terminus building. While the LNC's office building and the station platforms survived, the central section of the station was reduced to rubble.[126][127][note 19] On 11 May 1941 the station was officially declared closed.[126][note 20]",
			"color": " "
		}
	}
}
