{
	"add": {
		"doc": {
			"id": "8bf2b64e341e498819ef83d30133095943d44fe09cbf9831a1426b848ed848cd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Miamimetroarea.jpg/200px-Miamimetroarea.jpg",
				"previous": "A street grid stretches from downtown Miami throughout the county. This grid was adopted by the City of Miami following World War I after the United States Post Office threatened to cease mail deliveries in the city because the original system of named streets, with names often changing every few blocks and multiple streets in the city sharing the same name, was too confusing for the mail carriers.[64] The new grid was later extended throughout the county as the population grew west, south, and north of city limits. The grid is laid out with Miami Avenue as the meridian going North-South and Flagler Street the baseline going east-west. The grid is primarily numerical so that, for example, all street addresses north of Flagler and west of Miami Avenue have NW in their address (e.g. NW 27th Avenue). Because its point of origin is in downtown Miami which is close to the coast, the NW and SW quadrants are much larger than the SE and NE quadrants. Many roads, especially major ones, are also named, although, with a few notable exceptions, the number is in more common usage among locals. Although this grid is easy to understand once one is oriented to it, it is not universal in the entire county. Hialeah uses its own grid system which is entirely different in its orientation. Coral Gables and Miami Lakes use named streets almost exclusively, and various smaller municipalities such as Florida City and Homestead use their own grid system along with the Miami-Dade grid system adding to the confusion. In the beach cities and parks of Miami Beach, Surfside, Bal Harbor, Haulover, Sunny Isles, and Golden Beach, the streets are coordinated with the main grid; however, their avenues are named.",
			"after": [
				"Miami-Dade County holds the majority of sports arenas, stadiums and complexes in South Florida. Some of these sports facilities are:",
				"Former venues include:"
			],
			"color": "dark|0.10114 gray|0.10114 dark|0.10114 grey|0.10114 gray|0.087952 grey|0.087952 dim|0.0779 gray|0.0779 dim|0.0779 grey|0.0779 silver|0.074493 antique|0.063438 white|0.063438 light|0.055518 gray|0.055518 light|0.055518 grey|0.055518 linen|0.054004 gainsboro|0.047488 old|0.044417 lace|0.044417 sea|0.042408 shell|0.042408 misty|0.041886 rose|0.041886 floral|0.035721 white|0.035721 black|0.032169 papaya|0.031901 whip|0.031901 dark|0.024794 slate|0.024794 gray|0.024794 white|0.023365 smoke|0.023365 snow|0.018153 ivory|0.017954 blanched|0.016727 almond|0.016727 beige|0.015462 lavender|0.014424 blush|0.014424 tan|0.011835 corn|0.0090363 silk|0.0090363 bisque|0.0084688 slate|0.0071649 gray|0.0071649 white|0.0068215 mint|0.0056097 cream|0.0056097 light|0.0047604 slate|0.0047604 gray|0.0047604  "
		}
	}
}
