{
	"add": {
		"doc": {
			"id": "8c06bdc92e9eb1ca829363b950fc374e11e40233fe276991767921f0ee961c36",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Deinonychus_foot_flexion.png/170px-Deinonychus_foot_flexion.png",
				"previous": "A 2007 study by Roach and Brinkman has called into question the cooperative pack hunting behavior of Deinonychus, based on what is known of modern carnivore hunting and the taphonomy of tenontosaur sites. Modern archosaurs (birds and crocodiles) and komodo dragons display little cooperative hunting; instead, they are usually either solitary hunters, or are drawn to previously killed carcasses, where much conflict occurs between individuals of the same species. For example, in situations where groups of komodo dragons are eating together, the largest individuals eat first and will attack smaller komodos that attempt to feed; if the smaller animal is killed, it is cannibalized. When this information is applied to the tenontosaur sites, it appears that what is found is consistent with Deinonychus having a komodo- or crocodile-like feeding strategy. Deinonychus skeletal remains found at these sites are from subadults, with missing parts consistent with having been eaten by other Deinonychus.[40] On the other hand, a paper by Li et al. describes track sites with similar foot spacing and parallel trackways, implying gregarious packing behavior instead of uncoordinated feeding behavior.[41]",
				"after": "In 2011, Denver Fowler and colleagues suggested a new method by which Deinonychus and other dromaeosaurs may have captured and restrained prey.[42] This model, known as the \"raptor prey restraint\" (RPR) model of predation, proposes that Deinonychus killed its prey in a manner very similar to extant accipitrid birds of prey: by leaping onto its quarry, pinning it under its body weight, and gripping it tightly with the large, sickle-shaped claws. Like accipitrids, the dromaeosaur would then begin to feed on the animal while still alive, until it eventually died from blood loss and organ failure. This proposal is based primarily on comparisons between the morphology and proportions of the feet and legs of dromaeosaurs to several groups of extant birds of prey with known predatory behaviors. Fowler found that the feet and legs of dromaeosaurs most closely resemble those of eagles and hawks, especially in terms of having an enlarged second claw and a similar range of grasping motion. However, the short metatarsus and foot strength would have been more similar to that of owls. The RPR method of predation would be consistent with other aspects of Deinonychus's anatomy, such as their unusual jaw and arm morphology. The arms were likely covered in long feathers, and may have been used as flapping stabilizers for balance while atop a struggling prey animal, along with the stiff counterbalancing tail. Its jaws, thought to have had a comparatively weak bite force,[43] might be used for saw motion bites, like the modern komodo dragon which also has a weak bite force, to finish off its prey if its kicks weren't powerful enough.[44]",
			"color": " "
		}
	}
}
