{
	"add": {
		"doc": {
			"id": "8c0730910ae3852e57de24390316fd891b98bc0eb98a9535a651144975df1f88",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Hydnellum_peckii_62842.jpg/220px-Hydnellum_peckii_62842.jpg",
				"previous": "As in all mushroom-producing fungi, the fruit bodies (sporocarps) are the reproductive structures that are produced from fungal mycelium when the appropriate environmental conditions of temperature, humidity and nutrient availability are met. Hydnellum peckii is a stipitate hydnoid fungus, meaning that it has a cap atop a stipe (stem), and a form resembling a Hydnum—characterized by a teeth-like hymenium, rather than gills or pores on the underside of the cap. Fruit bodies growing closely together often appear to fuse together (this is called \"confluence\"). They can reach a height of up to 10.5 cm (4.1 in).[5] Fresh fruit bodies exude a striking, thick red fluid when they are moist.[2]",
				"after": "The cap's surface is convex to flattened, more or less uneven and sometimes slightly depressed in the center. It is usually densely covered with \"hairs\" that give it a texture similar to felt or velvet; these hairs are sloughed off in age, leaving the caps of mature specimens smooth.[5] Its shape varies from somewhat round to irregular, 4 to 10 cm (1.6 to 3.9 in), or even as much as 20 cm (7.9 in) wide as a result of confluence. The cap is initially whitish, but later turns slightly brownish, with irregular dark-brown to nearly black blotches where it is bruised. In maturity, the surface is fibrous and tough, scaly and jagged, grayish-brown in the upper part of the cap, and somewhat woody. The flesh is a pale pinkish-brown.[12]",
			"color": "black|0.19344 light|0.087416 gray|0.087416 light|0.087416 grey|0.087416 dark|0.083442 gray|0.083442 dark|0.083442 grey|0.083442 silver|0.082351 rosy|0.08123 brown|0.08123 gainsboro|0.076305 gray|0.065375 grey|0.065375 lavender|0.058145 lavender|0.048507 blush|0.048507 dim|0.042471 gray|0.042471 dim|0.042471 grey|0.042471 ghost|0.030878 white|0.030878 white|0.024149 smoke|0.024149 alice|0.023043 blue|0.023043 thistle|0.019092 snow|0.018559 misty|0.018156 rose|0.018156 white|0.012837 sea|0.0096016 shell|0.0096016  "
		}
	}
}
