{
	"add": {
		"doc": {
			"id": "8c07d89f16397c0856ed70d5f69edbdc212ea8c5b5a1ab8bfa7727adb64b99cf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Opened_Oral_Birth_Control.jpg/120px-Opened_Oral_Birth_Control.jpg",
				"previous": "Portal:Society/Featured article/36",
				"after": "Birth control, also known as contraception and fertility control, refers to methods or devices used to prevent pregnancy. Planning and provision of birth control is called family planning. Safe sex, such as the use of male or female condoms, can also help prevent transmission of sexually transmitted diseases. Contraceptive use in developing countries has cut the number of maternal deaths by 44% (about 270,000 deaths averted in 2008) but could prevent 73% if the full demand for birth control were met. Because teenage pregnancies are at greater risk of adverse outcomes such as preterm birth, low birth weight and infant mortality, adolescents need comprehensive sex education and access to reproductive health services, including contraception. By lengthening the time between pregnancies, birth control can also improve adult women's delivery outcomes and the survival of their children. Effective birth control methods include barriers such as condoms, diaphragms, and the contraceptive sponge; hormonal contraception including oral pills, patches, vaginal rings, and injectable contraceptives; and intrauterine devices (IUDs). Emergency contraception can prevent pregnancy after unprotected sex. Long-acting reversible contraception such as implants, IUDs, or vaginal rings are recommended to reduce teenage pregnancy. Sterilization by means such as vasectomy and tubal ligation is permanent contraception. Some people regard sexual abstinence as birth control, but abstinence-only sex education often increases teen pregnancies when offered without contraceptive education. Birth control methods have been used since ancient times, but effective and safe methods only became available in the 20th century. For some people, contraception involves moral issues, and many cultures limit access to birth control due to the moral and political issues involved. About 222 million women who want to avoid pregnancy in developing countries are not using a modern contraception method. Birth control increases economic growth because of fewer dependent children, more women participating in the workforce, and less consumption of scarce resources. Women's earnings, assets, body mass index, and their children's schooling and body mass index all substantially improve with greater access to contraception.",
			"color": " "
		}
	}
}
