{
	"add": {
		"doc": {
			"id": "8c087c1b8fe03dd9cc0b3e5794951c8a21d1d4b69850fcf13a785e3834f71809",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Tamar_wallabies.jpg/220px-Tamar_wallabies.jpg",
				"previous": "During the day, tammars stay close to scrub for shade and move out to more open grassland by nightfall.[5]:335 Like all macropods, the tammar is herbivorous. They are known to both graze and browse, but the latter is less effective, as they commonly drop leaves when chewing on them. When eating large leaves, tammars handle them with their forelimbs.[25]:116 This species spends more time chewing its food than other similar sized macropods, which likely aids digestion.[25]:115–16 Tammars commonly feed on acacia seeds. Other species consumed include heart-leaved poison (Gastrolobium bilobum), small-flowered wallaby grass (Austrodanthonia setacea), and marri (Corymbia calophylla).[6] Tammars survive on several islands that have no fresh water, subsisting on seawater and the moisture in plants.[5]:335",
				"after": "The tammar rests in two positions: a \"sitting tail forward\" position, in which the hind legs are outstretched with tail brought forward in between, the body prone and the head above ground; and a \"lying\" position, in which the animal lies on its side with the head touching the ground. The former position is typically used during the day for long periods, and the latter position is used at night for brief periods.[25]:217–19 Tammars are known to live in stable groups,[26] which lessens the chance of an individual being taken by a predator. As the group increases in size, tammars spend more time foraging, grooming and interacting and less time being vigilant and moving around.[27] Predators of the tammar include dingos, feral cats, red foxes and wedge-tailed eagles. They may also have been preyed upon by the extinct thylacine. Tammars appear to respond more to the sight than the sound of predators.[28] They can also use their acute sense of smell to detect a predator.[29] When a predator is detected, a tammar will alert others by thumping its foot.[28] When lost, young tammars are known to emit a coarse screeching call and adult females may respond with a similar call.[26]",
			"color": "dark|0.31259 gray|0.31259 dark|0.31259 grey|0.31259 gray|0.2279 grey|0.2279 dim|0.12658 gray|0.12658 dim|0.12658 grey|0.12658 silver|0.087663 rosy|0.066705 brown|0.066705 light|0.02887 slate|0.02887 gray|0.02887 slate|0.028492 gray|0.028492 light|0.026284 gray|0.026284 light|0.026284 grey|0.026284 dark|0.015536 slate|0.015536 gray|0.015536 gainsboro|0.014845 dark|0.014335 olive|0.014335 green|0.014335 light|0.0098342 steel|0.0098342 blue|0.0098342 black|0.009147  "
		}
	}
}
