{
	"add": {
		"doc": {
			"id": "8c14a47f93666ea42036ec3a1fbc514d946313953f3da0bacf1efcc9f46cb823",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/The_Bedroom_of_William_Burges.jpg/220px-The_Bedroom_of_William_Burges.jpg",
				"previous": "The dining room is devoted to Geoffrey Chaucer's The House of Fame and the art of story-telling, Crook explaining that \"tall stories are part of the dining room rite\".[53] The hooded chimneypiece, of Devonshire marble, contained a bronze figure above the fireplace representing the Goddess of Fame;[53] its hands and face were made of ivory, with sapphires for eyes. It was later stolen.[23][54] The tiles on the walls depict fairy stories, including Reynard the Fox, Jack and the Beanstalk and Little Red Riding Hood.[c] The room also shows Burges's innovative use of materials: Handley-Read observed that the Victorians had \"a horror of food smells\"[47] and therefore the room was constructed using materials that did not absorb odours and could be washed. The walls are covered with Devonshire marble, surmounted by glazed picture tiles,[41] while the ceiling is of sheet metal.[47] The ceiling is divided into coffered compartments by square beams, and features symbols of the Sun, the planets and the signs of the Zodiac.[54] Burges designed most of the cutlery and plate used in this room, which display his skills as a designer of metalwork, including the claret jug and Cat Cup chosen by Lord and Lady Bute as mementos from Burges's collection after his death.[55] The panels of the wine cupboard were decorated by Dante Gabriel Rossetti.[51]",
				"after": "The windows of the stair turret represent \"the Storming of the Castle of Love\".[7] On the first floor are two bedrooms and an armoury. Burges's bedroom, with a theme of sea creatures, overlooks the garden.[7] Its elaborate ceiling is segmented into panels by gilded and painted beams, studded with miniature convex mirrors set in to gilt stars. Fish and eels swim in a frieze of waves painted under the ceiling, and fish are also carved in relief on the chimneypiece. On the fire-hood, a sculpted mermaid gazes into a looking-glass, with seashells, coral, seaweed and a baby mermaid also represented.[7] Charles Handley-Read described the frieze around the Mermaid fireplace as \"proto-Art Nouveau\" and noted \"the debt of international art nouveau to Victorian Gothic designers, Burges included\".[45] In this room, Burges placed two of his most personal pieces of furniture, the Red Bed, in which he died, and the Narcissus Washstand, both of which originally came from Buckingham Street. [56] The bed is painted blood red and features a panel depicting Sleeping Beauty. The washstand is red and gold; its tip-up basin of marble inlaid with fishes is silver and gold.[57]",
			"color": " "
		}
	}
}
