{
	"add": {
		"doc": {
			"id": "8c2472b374476cf1c520b54f1345841f4f992ebc220f824d75c885d9f53464be",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/D%C3%BCrer_Melancholia_I.jpg/200px-D%C3%BCrer_Melancholia_I.jpg",
				"previous": "In the right panel, Dyer is shown with his eyes shut, vomiting into a hand basin. In the two outer frames his figure is shadowed by arrows, pictorial devices that Bacon often used to place a sense of energy into his paintings. In this work, the arrows point to a man about to die, and according to Tóibín they scream \"Here!\", \"Him!\".[1] The arrow of the right panel, according to Tóibín, points to a \"dead figure on the lavatory bowl, as though telling the Furies where to find him\".[1] The triptych is centralised by the lightbulb, and by the fact that Dyer faces inwards in the two outer canvasses. The triptych's composition and setting are poised to suggest instability, and the doors in each side panel are splayed outwards as if to look into the darkness of the foreground.[22]",
				"after": "Triptych, May–June 1973 has been said to achieve its tension by locating voluptuously described figures in an austere, cage-like space. The foreground of each panel is bounded by a wall, which runs parallel to a framing door. Each door admits a stark black into its frame, while the walls establish a link between each of the three Black Triptychs.[23] In 1975, the curator Hugh M. Davis noted that while Bacon's earlier triptychs had been set in public spaces \"open to all kinds of visitor\", the Black Triptychs are set in a \"deeply private realm, to which only the individual—accompanied, perhaps, by one or two of his closest friends—has access\".[24] In 1999, Yard wrote that the sense of foreboding and ill-omen conjured by the Eumenides of Bacon's Three Studies for Figures at the Base of a Crucifixion (1944) reappears in the triptych as a \"batlike void that snared the figure of George Dyer as he subsides into the supple curves of death\".[25] John Russell observed that the painting's background describes an area which is half studio, half condemned cell. A reviewer of the 1975 Metropolitan Museum of Art exhibition found a resemblance between the concept of the central panel and Albrecht Dürer's engraving Melencolia I (1514)—in the figure's pose, the bat form, and the panel's radiance—suggesting that Bacon's late triptychs evoke \"memorable figural formulations\" of classic Western culture.[26]",
			"color": " "
		}
	}
}
