{
	"add": {
		"doc": {
			"id": "8c2fe651d1a28d5c2881bf06f292ae011d697b7fb72625f886170e740952827c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Komodo_Dragon_AdF.jpg/220px-Komodo_Dragon_AdF.jpg",
				"previous": "The evolutionary development of the Komodo dragon started with the Varanus genus, which originated in Asia about 40 million years ago and migrated to Australia. Around 15 million years ago, a collision between Australia and Southeast Asia allowed the varanids to move into what is now the Indonesian archipelago, extending their range as far east as the island of Timor. The Komodo dragon was believed to have differentiated from its Australian ancestors 4 million years ago. However, recent fossil evidence from Queensland suggests the Komodo dragon evolved in Australia before spreading to Indonesia.[1][13] Dramatic lowering of sea level during the last glacial period uncovered extensive stretches of continental shelf that the Komodo dragon colonized, becoming isolated in their present island range as sea levels rose afterwards.[1][12]",
				"after": "In the wild, an adult Komodo dragon usually weighs around 70 kg (150 lb), although captive specimens often weigh more.[14] According to the Guinness Book of World Records, an average adult male will weigh 79 to 91 kg (174 to 201 lb) and measure 2.59 m (8.5 ft), while an average female will weigh 68 to 73 kg (150 to 161 lb) and measure 2.29 m (7.5 ft).[15] The largest verified wild specimen was 3.13 m (10.3 ft) long and weighed 166 kg (366 lb), including undigested food.[12] The Komodo dragon has a tail as long as its body, as well as about 60 frequently replaced, serrated teeth that can measure up to 2.5 cm (1 in) in length. Its saliva is frequently blood-tinged, because its teeth are almost completely covered by gingival tissue that is naturally lacerated during feeding.[16] This creates an ideal culture for the bacteria that live in its mouth.[17] It also has a long, yellow, deeply forked tongue.[12] Komodo dragon skin is reinforced by armoured scales, which contain tiny bones called osteoderms that function as a sort of natural chain-mail.[18][19] This rugged hide makes Komodo dragon skin poorly suited for making into leather.",
			"color": "gray|0.31417 grey|0.31417 dim|0.25988 gray|0.25988 dim|0.25988 grey|0.25988 dark|0.17595 gray|0.17595 dark|0.17595 grey|0.17595 silver|0.054613 tan|0.049155  "
		}
	}
}
