{
	"add": {
		"doc": {
			"id": "8c3f711d65e12ad6f1e7fcae72fe4966fd55e7ebe5b72b977fea7fec5af8922b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Nla.pic-vn3723098LesterBrain1930s.jpg/120px-Nla.pic-vn3723098LesterBrain1930s.jpg",
				"previous": "Portal:Geography/Featured biography/14",
				"after": "Lester Brain was a pioneer Australian aviator and airline executive. Born in New South Wales, he trained with the Royal Australian Air Force (RAAF) before joining Qantas as a pilot in 1924. He was awarded the Air Force Cross in 1929, after locating the lost aircraft Kookaburra in northern Australia. As a member of the RAAF reserve, Brain coordinated his airline's support for the Australian military during World War II. He earned a King's Commendation for his rescue efforts during an air raid on Broome, Western Australia in 1942, and was promoted to wing commander in 1944. Brain left Qantas to join the fledgling government-owned domestic carrier Trans Australia Airlines (TAA) in June 1946. Appointed its first General Manager, he swiftly built up the organisation to the stage where it could commence scheduled operations later in the year. By the time he resigned in March 1955, TAA was firmly established as one half of the Commonwealth government's two-airline system. After his departure from TAA, Brain became managing director of de Havilland Aircraft in Sydney, before joining the board of East-West Airlines as a consultant in January 1961. Appointed an Officer of the Order of Australia in January 1979, Lester Brain died in June the following year, at the age of seventy-seven.",
			"color": "black|0.30177 gray|0.12373 grey|0.12373 dark|0.10666 gray|0.10666 dark|0.10666 grey|0.10666 dim|0.089445 gray|0.089445 dim|0.089445 grey|0.089445 silver|0.074688 light|0.055708 gray|0.055708 light|0.055708 grey|0.055708 gainsboro|0.047328 linen|0.028041 sea|0.022457 shell|0.022457 old|0.021803 lace|0.021803 white|0.021341 smoke|0.021341 floral|0.020189 white|0.020189 snow|0.017868 antique|0.017126 white|0.017126 lavender|0.012695 blush|0.012695 ivory|0.012034 misty|0.010328 rose|0.010328 white|0.0084427 mint|0.0053299 cream|0.0053299  "
		}
	}
}
