{
	"add": {
		"doc": {
			"id": "8c5c24109e7188d4677b48eeae693ab2874316ccbb53843eb431eec81492d16b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/B-36_tracked_gear_edit.jpg/220px-B-36_tracked_gear_edit.jpg",
				"previous": "Some main gear struts on World War II aircraft, in order to allow a single-leg main gear to more efficiently store the wheel within either the wing or an engine nacelle, rotated the single gear strut through a 90° angle during the rearwards-retraction sequence to allow the main wheel to rest \"flat\" above the lower end of the main gear strut, or flush within the wing or engine nacelles, when fully retracted. Examples are the Curtiss P-40, Vought F4U Corsair, Grumman F6F Hellcat, Messerschmitt Me 210 and Junkers Ju 88. The Aero Commander family of twin-engined business aircraft also shares this feature on the main gears, which retract aft into the ends of the engine nacelles. The rearward-retracting nosewheel strut on the Heinkel He 219 and the forward-retracting nose gear strut on the later Cessna Skymaster similarly rotated 90 degrees as they retracted.[citation needed]",
				"after": "On most World War II single-engined fighter aircraft (and even one German heavy bomber design) with sideways retracting main gear, the main gear that retracted into the wings was meant to be raked forward, towards the aircraft's nose in the \"down\" position for better ground handling, with a retracted position that placed the main wheels at some angle \"behind\" the main gear's attachment point to the airframe – this led to a complex angular geometry for setting up the angles for the retraction mechanism's axis of rotation, with some aircraft, like the P-47 Thunderbolt and Grumman Bearcat, even mandating that the main gear struts lengthen as they were extended down from the wings to assure proper ground clearance for their large four-bladed propellers. One exception to the need for this complexity in many WW II fighter aircraft was Japan's famous Zero fighter, whose main gear stayed at a perpendicular angle to the centerline of the aircraft when extended, as seen from the side.",
			"color": " "
		}
	}
}
