{
	"add": {
		"doc": {
			"id": "8c5da0345ac1475b2903486f250343114c2bda4ddfc7c83f07e2f9071cf92975",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Map_of_Manchester.png/170px-Map_of_Manchester.png",
				"previous": "At 53°28′0″N 2°14′0″W﻿ / ﻿53.46667°N 2.23333°W﻿ / 53.46667; -2.23333, 160 miles (260 km) northwest of London, Manchester lies in a bowl-shaped land area bordered to the north and east by the Pennines, a mountain chain that runs the length of northern England, and to the south by the Cheshire Plain. Manchester is 35.0 miles (56.3 km) north-east of Liverpool and 35.0 miles (56.3 km) north-west of Sheffield, making the city the halfway point between the two. The city centre is on the east bank of the River Irwell, near its confluences with the Rivers Medlock and Irk, and is relatively low-lying, being between 35 to 42 metres (115 to 138 feet) above sea level.[61] The River Mersey flows through the south of Manchester. Much of the inner city, especially in the south, is flat, offering extensive views from many highrise buildings in the city of the foothills and moors of the Pennines, which can often be capped with snow in the winter months. Manchester's geographic features were highly influential in its early development as the world's first industrial city. These features are its climate, its proximity to a seaport at Liverpool, the availability of water power from its rivers, and its nearby coal reserves.[62]",
				"after": "The name Manchester, though officially applied only to the metropolitan district within Greater Manchester, has been applied to other, wider divisions of land, particularly across much of the Greater Manchester county and urban area. The \"Manchester City Zone\", \"Manchester post town\" and the \"Manchester Congestion Charge\" are all examples of this.",
			"color": "gray|0.071724 grey|0.071724 firebrick|0.066569 old|0.061096 lace|0.061096 linen|0.060751 ivory|0.059845 floral|0.059725 white|0.059725 sea|0.05909 shell|0.05909 beige|0.058931 honeydew|0.058392 corn|0.055855 silk|0.055855 antique|0.05433 white|0.05433 mint|0.045825 cream|0.045825 dim|0.043229 gray|0.043229 dim|0.043229 grey|0.043229 brown|0.038602 silver|0.036654 light|0.028007 gray|0.028007 light|0.028007 grey|0.028007 dark|0.025978 gray|0.025978 dark|0.025978 grey|0.025978 gainsboro|0.022062 black|0.021189 light|0.015006 yellow|0.015006 light|0.0097418 slate|0.0097418 gray|0.0097418 indian|0.0077935 red|0.0077935 slate|0.0070628 gray|0.0070628 papaya|0.0055774 whip|0.0055774 snow|0.0041754 white|0.0041107 smoke|0.0041107 white|0.0038506  "
		}
	}
}
