{
	"add": {
		"doc": {
			"id": "8c603a26b23a7f7492754cb22acbe46381bf08bee53bac80a9342e7263920681",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Hyderabad_slum_scene.jpg/220px-Hyderabad_slum_scene.jpg",
			"previous": [],
				"after": "In the greater metropolitan area, 13% of the population live below the poverty line.[114] According to a 2012 report submitted by GHMC to the World Bank, Hyderabad has 1,476 slums with a total population of 1.7 million, of whom 66% live in 985 slums in the \"core\" of the city (the part that formed Hyderabad before the April 2007 expansion) and the remaining 34% live in 491 suburban tenements.[115] About 22% of the slum-dwelling households had migrated from different parts of India in the last decade of the 20th century, and 63% claimed to have lived in the slums for more than 10 years.[66]:55 Overall literacy in the slums is 60–80% and female literacy is 52–73%. A third of the slums have basic service connections, and the remainder depend on general public services provided by the government. There are 405 government schools, 267 government aided schools, 175 private schools and 528 community halls in the slum areas.[116]:70 According to a 2008 survey by the Centre for Good Governance, 87.6% of the slum-dwelling households are nuclear families, 18% are very poor, with an income up to ₹20000 (US$320) per annum, 73% live below the poverty line (a standard poverty line recognised by the Andhra Pradesh Government is ₹24000 (US$380) per annum), 27% of the chief wage earners (CWE) are casual labour and 38% of the CWE are illiterate. About 3.72% of the slum children aged 5–14 do not go to school and 3.17% work as child labour, of whom 64% are boys and 36% are girls. The largest employers of child labour are street shops and construction sites. Among the working children, 35% are engaged in hazardous jobs.[66]:59",
			"color": "tan|0.34529 burly|0.16824 wood|0.16824 dim|0.055242 gray|0.055242 dim|0.055242 grey|0.055242 peach|0.054638 puff|0.054638 wheat|0.053791 navajo|0.051078 white|0.051078 gray|0.04407 grey|0.04407 moccasin|0.038798 bisque|0.03571 dark|0.028419 gray|0.028419 dark|0.028419 grey|0.028419 blanched|0.018706 almond|0.018706 black|0.017431 silver|0.014132 antique|0.0095302 white|0.0095302 papaya|0.0092515 whip|0.0092515 light|0.0071815 gray|0.0071815 light|0.0071815 grey|0.0071815 dark|0.0055115 slate|0.0055115 gray|0.0055115  "
		}
	}
}
