{
	"add": {
		"doc": {
			"id": "8c6048d62bbeb7fdc6f3339be60e1fe9820f6798923c95cc80324a1347071ac2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Pankhurst_Centre_1.jpg/220px-Pankhurst_Centre_1.jpg",
				"previous": "The individual identities of the Pankhurst children began to emerge around the time of their father's death. Before long they were all involved in the struggle for women's suffrage. Christabel enjoyed a privileged status among the daughters, as Sylvia noted in 1931: \"She was our mother's favourite; we all knew it, and I, for one, never resented the fact.\"[51] Christabel did not share her mother's fervour for political work, however, until she befriended the suffrage activists Esther Roper and Eva Gore-Booth. She soon became involved with the suffrage movement and joined her mother at speaking events.[52] Sylvia took lessons from a respected local artist, and soon received a scholarship to the Manchester School of Art. She went on to study art in Florence and Venice.[53] The younger children, Adela and Harry, had difficulty finding a path for their studies. Adela was sent to a local boarding school, where she was cut off from her friends and contracted head lice. Harry also had difficulty at school; he suffered from measles and vision problems.[54]",
				"after": "By 1903 Pankhurst believed that years of moderate speeches and promises about women's suffrage from members of parliament (MPs) had yielded no progress. Although suffrage bills in 1870, 1886, and 1897 had shown promise, each was defeated. She doubted that political parties, with their many agenda items, would ever make women's suffrage a priority. She even broke with the ILP when it refused to focus on Votes for Women. It was necessary to abandon the patient tactics of existing advocacy groups, she believed, in favour of more militant actions. Thus on 10 October 1903 Pankhurst and several colleagues founded the Women's Social and Political Union (WSPU), an organisation open only to women and focused on direct action to win the vote.[56] \"Deeds,\" she wrote later, \"not words, was to be our permanent motto.\"[4]",
			"color": "dark|0.28423 gray|0.28423 dark|0.28423 grey|0.28423 gray|0.18461 grey|0.18461 black|0.16809 dim|0.1399 gray|0.1399 dim|0.1399 grey|0.1399 silver|0.097409 light|0.04046 slate|0.04046 gray|0.04046 slate|0.029226 gray|0.029226 light|0.023011 gray|0.023011 light|0.023011 grey|0.023011 gainsboro|0.012963  "
		}
	}
}
