{
	"add": {
		"doc": {
			"id": "8c6dcae37d62ef3c56cfcec30de636ef3aab406c5c642254d0b97621df37980f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/BIAL_check_in_counters.jpg/220px-BIAL_check_in_counters.jpg",
				"previous": "A pier design uses a small, narrow building with aircraft parked on both sides. One end connects to a ticketing and baggage claim area. Piers offer high aircraft capacity and simplicity of design, but often result in a long distance from the check-in counter to the gate (up to half a mile in the cases of Kansai International Airport or Lisbon Portela Airport's Terminal 1). Most large international airports have piers, including Chicago's O'Hare International Airport, Larnaca International Airport, Frankfurt International Airport, London Heathrow Airport, Amsterdam Schiphol Airport, Murtala Muhammed International Airport, Kuala Lumpur International Airport, Mérida International Airport, Bangkok International Airport, Mazatlan International Airport, Beirut International Airport, Hong Kong International Airport, Allama Iqbal International Airport, Tijuana International Airport, Rome Fiumicino Airport, Toronto-Pearson International Airport, Delhi International Airport, Fort Lauderdale–Hollywood International Airport and Miami International Airport.",
				"after": "A satellite terminal is a building detached from other airport buildings, so that aircraft can park around its entire circumference. The first airport to use a satellite terminal was London Gatwick Airport. It used an underground pedestrian tunnel to connect the satellite to the main terminal. This was also the first setup at Los Angeles International Airport, but it has since been converted to a pier layout. The first airport to use an automatic people mover to connect the main terminal with a satellite was Tampa International Airport, which is the standard today. Other examples include the following:",
			"color": "gray|0.38924 grey|0.38924 dim|0.27495 gray|0.27495 dim|0.27495 grey|0.27495 dark|0.12622 gray|0.12622 dark|0.12622 grey|0.12622 black|0.082563 dark|0.028552 slate|0.028552 gray|0.028552 silver|0.024912 light|0.010965 gray|0.010965 light|0.010965 grey|0.010965 slate|0.010426 gray|0.010426 light|0.0099542 slate|0.0099542 gray|0.0099542 gainsboro|0.007363  "
		}
	}
}
