{
	"add": {
		"doc": {
			"id": "8c798739da7d20f1dc4f51e8508a776c28dd8ab3108b234eb236f4b535032b86",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Memchu_outerwindows.jpg/220px-Memchu_outerwindows.jpg",
				"previous": "Charles A. Coolidge, a protégé of Henry Hobson Richardson, was the church's architect; he also developed the massing of Richardson's Trinity Church in Boston in 1876.[7] Like Trinity Church, Memorial Church originally had a large central tower with turrets and a twelve-sided spire, but this was lost as a result of the 1906 earthquake.[20] The church's blueprints were prepared by Clinton E. Day of San Francisco, and Charles E. Hodges was the supervising architect for the project. Jane Stanford hired builder John McGilvray, who was responsible for constructing the St. Francis Hotel, the City Hall complex in San Francisco, and much of Stanford University, for the actual construction of Stanford Memorial Church.[8]",
				"after": "Jane Stanford's taste and knowledge of both contemporary and classical art is evident in several aspects of the plan, appearance, and architecture of the church, which \"dazzle the eye yet also produce an atmosphere of quiet contemplation\".[63] On her direction, Coolidge imitated the \"glorious color\"[65] of the European cathedrals, especially those in Italy. Although the iconography in the church is Christian, Stanford was a \"late Victorian progressive\",[63] and chose the art less for its religious themes and more for its \"humanitarian ethics\".[63] She requested that the designs include women, \"to show the uplifting influence of religion for women\";[66] there are many women depicted in the 24 mosaics throughout the church.[66] Art historian Judy Oberhausen reports that Stanford used compendium of biblical illustrations like The Story of the Bible by Charles Foster, which contained 300 illustrations and summarized the events and stories she wished to depict in the church's windows and mosaics.[63]",
			"color": "dark|0.34978 gray|0.34978 dark|0.34978 grey|0.34978 silver|0.16342 gray|0.083171 grey|0.083171 dim|0.064704 gray|0.064704 dim|0.064704 grey|0.064704 black|0.059037 light|0.05848 slate|0.05848 gray|0.05848 slate|0.05135 gray|0.05135 light|0.051255 sky|0.051255 blue|0.051255 light|0.032934 gray|0.032934 light|0.032934 grey|0.032934 steel|0.02311 blue|0.02311 sky|0.019679 blue|0.019679 tan|0.016604 light|0.015957 steel|0.015957 blue|0.015957  "
		}
	}
}
