{
	"add": {
		"doc": {
			"id": "8c9ce40a4d5fcf35f6cc9635cb3db8cc56fa7109d8dcdeddc8bf54e02873d6e0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Brock_Lesnar_in_2003.jpg/115px-Brock_Lesnar_in_2003.jpg",
			"previous": [],
				"after": "Brock Edward Lesnar (born July 12, 1977) is an American professional wrestler, actor, mixed martial artist and amateur wrestler. He is currently signed with professional wrestling promotion WWE. He is also a former UFC Heavyweight Champion and was ranked the No.5 Heavyweight in the world by Sherdog before he announced his retirement at the end of 2011. Lesnar is an accomplished amateur wrestler, winning the 2000 NCAA heavyweight wrestling championship and placing second in 1999, losing in the finals to 1999 world freestyle wrestling champion and future New England Patriots offensive lineman Stephen Neal. He then gained prominence in World Wrestling Entertainment (WWE), where he was a three-time WWE Champion, becoming the youngest WWE Champion at age 25 with his first reign. Lesnar was the 2002 King of the Ring and the winner of the 2003 Royal Rumble. After leaving WWE in 2004, Lesnar pursued a career in the NFL. He played during the preseason for the Minnesota Vikings, but ended up being a late cut. Lesnar returned to professional wrestling at the end of 2005, and joined New Japan Pro Wrestling, where he won the IWGP Heavyweight Championship in his first match. He was stripped of the title in July 2006, although he held the physical belt until June 2007. Lesnar started a career in mixed martial arts and won his first fight in June 2007. He then signed with the Ultimate Fighting Championship (UFC) in October 2007. He lost his UFC debut against Frank Mir. He captured the UFC Heavyweight Championship from Randy Couture on November 15, 2008, then avenged his loss to Mir at UFC 100 to become the Undisputed Champion. After being sidelined from fighting in late 2009 due to diverticulitis, Lesnar returned to defeat the Interim UFC Heavyweight Champion Shane Carwin at UFC 116. Lesnar lost the Heavyweight belt against Cain Velasquez at UFC 121. He was once again stricken with a bout of diverticulitis in May 2011 and had surgery to try to cope with the ailment. In August 2011, Lesnar stated that he was ready to return to fighting in the UFC. Lesnar retired from the UFC following his loss to Alistair Overeem at UFC 141.",
			"color": "light|0.12188 salmon|0.12188 sienna|0.11815 dark|0.099656 salmon|0.099656 coral|0.09349 black|0.080872 salmon|0.072555 dim|0.050545 gray|0.050545 dim|0.050545 grey|0.050545 gray|0.037544 grey|0.037544 sandy|0.031402 brown|0.031402 steel|0.028678 blue|0.028678 rosy|0.024663 brown|0.024663 saddle|0.023229 brown|0.023229 slate|0.017852 gray|0.017852 tan|0.017852  "
		}
	}
}
