{
	"add": {
		"doc": {
			"id": "8cab0fbab6dcda81404b54459851945b74c68e677cb19ad8453295154de7fd14",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/20071027_Chicago_Picasso_with_kids.JPG/170px-20071027_Chicago_Picasso_with_kids.JPG",
				"previous": "Crown Fountain, Trevi Fountain, and Buckingham Fountain, as well as natural water features such as Old Faithful, are examples of the ability of water to attract people and hold their attention.[64] Crown Fountain has more interactivity than other Chicago fountains, such as Buckingham Fountain and Lorado Taft's Fountain of the Great Lakes and Fountain of Time[29][52] (all but the last are in Grant Park). These other Chicago fountains are traditional in that they discourage viewer touching; Buckingham Fountain is surrounded by a fence, and Taft's fountains are surrounded by moats. In contrast, Crown Fountain provides an open invitation to play in the fountain's water.[29]",
				"after": "U.S. News & World Report describes the fountain as an exemplary feature of the city's numerous urban parks.[65] Chicago Tribune architecture critic Blair Kamin, who is pleased with the sculptures' verticalness, says the fountain helps appropriately depict the modern 21st-century urban park.[5] The Chicago Sun-Times describes the fountain as \"eye-catching, crowd-friendly ... high-tech [and] ... contemporary\".[6] The New York Times calls the fountain an \"extraordinary art object\".[66] Frommer's describes the fountain as public art at its best.[67] The beauty of the fountain is, as the San Francisco Chronicle explains, that it is high-concept art for all to enjoy.[7] The Financial Times refers to the fountain as a \"techno-fountain\".[68] The fountain is praised for its technical features by industry magazines and has won various awards.[3][69] The project won the 2006 Bombay Sapphire prize for its design work with glass.[69][70] Critical reviews were not unanimous in their praise. One Chicago Tribune critic was not impressed with JumboTron-like art, although he conceded the participatory element reminded him in a positive way of the jungle gym element of the Chicago Picasso.[48]",
			"color": "dim|0.31466 gray|0.31466 dim|0.31466 grey|0.31466 gray|0.22991 grey|0.22991 dark|0.14192 gray|0.14192 dark|0.14192 grey|0.14192 slate|0.099802 gray|0.099802 light|0.080016 slate|0.080016 gray|0.080016 silver|0.031857 light|0.019338 steel|0.019338 blue|0.019338 light|0.011567 gray|0.011567 light|0.011567 grey|0.011567 lavender|0.0099944 gainsboro|0.0075741 alice|0.005064 blue|0.005064 ghost|0.0046121 white|0.0046121 white|0.0044557 smoke|0.0044557 thistle|0.003538 snow|0.0034869 azure|0.0033826  "
		}
	}
}
