{
	"add": {
		"doc": {
			"id": "8cc3de36563bceb33b4c24384af849e65ec0dd0018a2f4b7100e195d3cf283b9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Imperial_State_Crown2.JPG/220px-Imperial_State_Crown2.JPG",
			"previous": [],
				"after": "The tradition of housing the Crown Jewels in the Tower of London probably dates from the reign of Henry III (1216-1272). The Jewel House was built specifically to house the royal regalia, including jewels, plate, and symbols of royalty such as the crown, sceptre, and sword. When money needed to be raised, the treasure could be pawned by the monarch. The treasure allowed the monarch independence from the aristocracy, and consequently was closely guarded. A new position for \"keeper of the jewels, armouries and other things\" was created,[151] which was well rewarded; in the reign of Edward III (1312–1377) the holder was paid 12d a day. The position grew to include other duties including purchasing royal jewels, gold, and silver, and appointing royal goldsmiths and jewellers.[151] In 1649, during the English Civil War, the contents of the Jewel House were disposed of along with other royal properties. Metal items were sent to the Mint to be melted down and re-used, and the crowns were \"totallie broken and defaced\".[152] When the monarchy was restored in 1660, the only surviving items of the coronation regalia were a 12th-century spoon and three ceremonial swords. The rest of the Crown Jewels had to be recreated. In 1669, the Jewel House was demolished[27] and the Crown Jewels moved into Martin Tower where they could be viewed by the paying public. This was exploited two years later when Colonel Thomas Blood attempted to steal them.[130] Blood and his accomplices bound and gagged the Jewel House keeper. Although they laid their hands on the Imperial State Crown, Sceptre and Orb, they were foiled when the keeper's son turned up unexpectedly and raised the alarm.[152][153] The Crown Jewels are currently stored in the Waterloo Barracks at the Tower.[44]",
			"color": "black|0.44273 dark|0.079409 slate|0.079409 gray|0.079409 dim|0.056544 gray|0.056544 dim|0.056544 grey|0.056544 dark|0.043047 gray|0.043047 dark|0.043047 grey|0.043047 gray|0.034721 grey|0.034721 powder|0.031145 blue|0.031145 light|0.030853 blue|0.030853 slate|0.030499 gray|0.030499 silver|0.029067 light|0.02819 slate|0.02819 gray|0.02819 light|0.022018 gray|0.022018 light|0.022018 grey|0.022018 gainsboro|0.019566 light|0.01937 cyan|0.01937 azure|0.01586 alice|0.01446 blue|0.01446 cadet|0.014441 blue|0.014441 mint|0.011443 cream|0.011443 white|0.010678 smoke|0.010678 ghost|0.0082835 white|0.0082835 white|0.007702 sky|0.0073684 blue|0.0073684 snow|0.0065882 pale|0.0054355 turquoise|0.0054355 light|0.0050477 steel|0.0050477 blue|0.0050477  "
		}
	}
}
