{
	"add": {
		"doc": {
			"id": "8cc5be06be05f5e2cd1f4ae45e90ada5692d62ce958053161cb15cc949f9dd68",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Graph_of_cubic_polynomial.svg/200px-Graph_of_cubic_polynomial.svg.png",
				"previous": "Cubic equations were known to the ancient Babylonians, Greeks, Chinese, Indians, and Egyptians.[2][3][4] Babylonian (20th to 16th centuries BC) cuneiform tablets have been found with tables for calculating cubes and cube roots.[5][6] The Babylonians could have used the tables to solve cubic equations, but no evidence exists to confirm that they did.[7] The problem of doubling the cube involves the simplest and oldest studied cubic equation, and one for which the ancient Egyptians did not believe a solution existed.[8] In the 5th century BC, Hippocrates reduced this problem to that of finding two mean proportionals between one line and another of twice its length, but could not solve this with a compass and straightedge construction,[9] a task which is now known to be impossible. Methods for solving cubic equations appear in The Nine Chapters on the Mathematical Art, a Chinese mathematical text compiled around the 2nd century BC and commented on by Liu Hui in the 3rd century.[3] In the 3rd century, the ancient Greek mathematician Diophantus found integer or rational solutions for some bivariate cubic equations (Diophantine equations).[4][10] Hippocrates, Menaechmus and Archimedes are believed to have come close to solving the problem of doubling the cube using intersecting conic sections,[9] though historians such as Reviel Netz dispute whether the Greeks were thinking about cubic equations or just problems that can lead to cubic equations. Some others like T. L. Heath, who translated all Archimedes' works, disagree, putting forward evidence that Archimedes really solved cubic equations using intersections of two cones, but also discussed the conditions where the roots are 0, 1 or 2.[11]",
				"after": "In the 7th century, the Tang dynasty astronomer mathematician Wang Xiaotong in his mathematical treatise titled Jigu Suanjing systematically established and solved 25 cubic equations of the form , 23 of them with , and two of them with .[12]",
			"color": "red|0.91703 salmon|0.037118 dark|0.013724 gray|0.013724 dark|0.013724 grey|0.013724 light|0.0090455 coral|0.0090455 indian|0.0062383 red|0.0062383 rosy|0.0049906 brown|0.0049906 black|0.0049906  "
		}
	}
}
