{
	"add": {
		"doc": {
			"id": "8cdcd3a88c34ce4f3f13672885d006a7486547d5bfff150d7f70d8ad7530b1d4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/WOA09_sea-surf_O2_AYool.png/220px-WOA09_sea-surf_O2_AYool.png",
				"previous": "The unusually high concentration of oxygen gas on Earth is the result of the oxygen cycle. This biogeochemical cycle describes the movement of oxygen within and between its three main reservoirs on Earth: the atmosphere, the biosphere, and the lithosphere. The main driving factor of the oxygen cycle is photosynthesis, which is responsible for modern Earth's atmosphere. Photosynthesis releases oxygen into the atmosphere, while respiration and decay remove it from the atmosphere. In the present equilibrium, production and consumption occur at the same rate of roughly 1/2000th of the entire atmospheric oxygen per year.",
				"after": "Free oxygen also occurs in solution in the world's water bodies. The increased solubility of O 2 at lower temperatures (see Physical properties) has important implications for ocean life, as polar oceans support a much higher density of life due to their higher oxygen content.[43] Water polluted with plant nutrients such as nitrates or phosphates may stimulate growth of algae by a process called eutrophication and the decay of these organisms and other biomaterials may reduce amounts of O 2 in eutrophic water bodies. Scientists assess this aspect of water quality by measuring the water's biochemical oxygen demand, or the amount of O 2 needed to restore it to a normal concentration.[44]",
			"color": "orchid|0.2741 violet|0.12872 lime|0.080249 green|0.080249 royal|0.072535 blue|0.072535 medium|0.055954 purple|0.055954 plum|0.050858 gold|0.040734 orange|0.031575 medium|0.029035 aqua|0.029035 marine|0.029035 medium|0.023465 sea|0.023465 green|0.023465 dark|0.021755 orange|0.021755 dark|0.02017 gray|0.02017 dark|0.02017 grey|0.02017 corn|0.018759 flower|0.018759 blue|0.018759 sky|0.017506 blue|0.017506 yellow|0.01114 green|0.01114 gray|0.010536 grey|0.010536 yellow|0.0099211 dodger|0.0082281 blue|0.0082281 light|0.0079911 sky|0.0079911 blue|0.0079911 silver|0.0073195 salmon|0.0069583 dim|0.006552 gray|0.006552 dim|0.006552 grey|0.006552  "
		}
	}
}
