{
	"add": {
		"doc": {
			"id": "8cea4bd1e3b0f6f5361c892c3c5079246e9a03e8c5950dd4faa3ca3349b05669",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Flag_of_Algeria.svg/23px-Flag_of_Algeria.svg.png",
				"previous": "A system of electronic flight strips replacing the old paper strips is being used by several Service Providers, such as NAV CANADA, MASUAC, DFS, DECEA. E-strips allows controllers to manage electronic flight data online without Paper Strips, reducing the need for manual functions, creating new tools and reducing the ATCO's workload. The firsts electronic flight strips systems were independently and simultaneously invented and implemented by NAV CANADA and Saipher ATC in 1999. The NAV CANADA system known as EXCDS[13] and rebranded in 2011 to NAVCANstrips and Saipher's first generation system known as SGTC, which is now being updated by its 2nd genreration system, the TATIC TWR. DECEA in Brazil is the world's largest user of Tower e-strips system, ranging from very small airports up to the busiest ones, taking the advantage of real time information and data collection from each of more than 150 sites for use in ATFM, Billing and Statistics.",
			"after": [
				"In the United States, some alterations to traffic control procedures are being examined.",
				"In Europe, the SESAR[12] (Single European Sky ATM Research) Programme plans to develop new methods, technologies, procedures, and systems to accommodate future (2020 and beyond) air traffic needs."
			],
			"color": "crimson|0.15641 misty|0.13903 rose|0.13903 pink|0.13049 brown|0.080592 light|0.073986 pink|0.073986 lavender|0.072462 blush|0.072462 rosy|0.034299 brown|0.034299 sea|0.031477 shell|0.031477 snow|0.027555 white|0.027522 smoke|0.027522 linen|0.026265 ghost|0.024162 white|0.024162 dark|0.020304 gray|0.020304 dark|0.020304 grey|0.020304 sea|0.019961 green|0.019961 white|0.019136 floral|0.018199 white|0.018199 alice|0.016108 blue|0.016108 silver|0.015822 pale|0.015369 violet|0.015369 red|0.015369 gainsboro|0.015333 light|0.014191 gray|0.014191 light|0.014191 grey|0.014191 mint|0.0081159 cream|0.0081159  "
		}
	}
}
