{
	"add": {
		"doc": {
			"id": "8d0b76717a628504785b4067b23e97c399438a96a688afd6c3cfc0050ed6fe70",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/F8J_TU95_CV34.JPEG/220px-F8J_TU95_CV34.JPEG",
			"previous": [
				"In 1962, the Defense Department standardized military aircraft designations generally along Air Force lines. Consequently, the F8U became the F-8, with the original F8U-1 redesignated F-8A.",
				"The first fleet squadron to fly the Crusader was VF-32 at NAS Cecil Field, Florida, in 1957, deploying to the Mediterranean late that year on Saratoga. VF-32 renamed the squadron the \"Swordsmen\" in keeping with the Crusader theme. The Pacific Fleet received the first Crusaders at NAS Moffett Field in Northern California and the VF-154 \"Grandslammers\" (named in honor of the new 1,000 mph jets and subsequently renamed the \"Black Knights\") began their F-8 operations. Later in 1957, in San Diego VMF-122 accepted the first Marine Corps Crusaders.[citation needed]"
			],
				"after": "The Crusader became a \"day fighter\" operating off the aircraft carriers. At the time, U.S. Navy carrier air wings had gone through a series of day and night fighter aircraft due to rapid advances in engines and avionics. Some squadrons operated aircraft for very short periods before being equipped with a newer higher performance aircraft. The Crusader was the first post-Korean War aircraft to have a relatively long tenure with the fleet and like the USAF Republic F-105 Thunderchief, a contemporary design, might have stayed in service longer if not for the Vietnam war and resulting attrition from combat and operational losses.",
			"color": "black|0.33075 gray|0.1551 grey|0.1551 dim|0.14663 gray|0.14663 dim|0.14663 grey|0.14663 dark|0.11863 gray|0.11863 dark|0.11863 grey|0.11863 silver|0.045427 light|0.03546 gray|0.03546 light|0.03546 grey|0.03546 gainsboro|0.029529 slate|0.024847 gray|0.024847 light|0.012811 slate|0.012811 gray|0.012811 linen|0.010679 dark|0.010427 slate|0.010427 gray|0.010427 white|0.010324 smoke|0.010324 sea|0.0092436 shell|0.0092436 snow|0.0077775 floral|0.007164 white|0.007164 lavender|0.007086 blush|0.007086 ghost|0.0063972 white|0.0063972  "
		}
	}
}
