{
	"add": {
		"doc": {
			"id": "8d18509103cc81c9058f2f0666c772f785efc335594812ce7590c822ff1a9fc8",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a8/C_Company_3RAR_occupying_Hill_Salmon_16_April_1951_%28AWM_P01813%29.jpg/150px-C_Company_3RAR_occupying_Hill_Salmon_16_April_1951_%28AWM_P01813%29.jpg",
				"previous": "Following the Battle of Maehwa-San the 27th British Commonwealth Brigade had enjoyed a period in corps reserve as the UN forces had continued to push steadily northwards.[7] By April 1951, the brigade consisted of four infantry battalions, one Australian, one Canadian and two British, including: the 3rd Battalion, Royal Australian Regiment; the 2nd Battalion, Princess Patricia's Canadian Light Infantry; the 1st Battalion, Middlesex Regiment and the 1st Battalion, Argyll and Sutherland Highlanders. Brigadier Basil Coad had departed for Hong Kong on compassionate leave on 23 March and the brigade was now under the command of Brigadier Brian Arthur Burke.[4] In direct support was the 16th Field Regiment, Royal New Zealand Artillery (16 RNZA) with its 3.45-inch (88 mm) 25 pounder field guns.[8][9] 3 RAR was now under the command of Lieutenant Colonel Bruce Ferguson, who had replaced Lieutenant Colonel Floyd Walsh following his dismissal in the wake of the Battle of Pakchon on 5 November 1950.[10] 2 PPCLI was commanded at this time by Lieutenant Colonel James Riley Stone.[11] Deployed in the central sector, the brigade was part of the US IX Corps which also included the US 24th Division, South Korean 2nd Division, US 7th Division and the South Korean 6th Division, under the overall command of Major General William M. Hoge.[12][13]",
				"after": "During this time 27th Brigade was attached to the US 24th Division, advancing north through the Chojong valley in late-March, reaching the Benton Line on 31 March. The brigade was then released, advancing with IX Corps up the deep and narrow valley of the Kapyong River, 10 kilometres (6.2 mi) to the east.[14] From 3 April, the 27th Brigade moved further up the river, advancing 30 kilometres (19 mi) over the next twelve days as part of Operation Rugged. Although the valley was not held in strength by the Chinese, it was skilfully defended by small groups of infantry dug-in on the hilltops that overlooked it. Advancing along the flanking hills and ridges the brigade captured successive positions, while encountering heavy resistance before reaching the Kansas Line on 8 April.[6] Following a brief operational pause, the advance 5 kilometres (3.1 mi) to the Utah Line began on 11 April, the day after MacArthur's dismissal. Chinese resistance strengthened noticeably and the brigade's initial objectives were not captured by the Middlesex until 13 April.[15]",
			"color": " "
		}
	}
}
