{
	"add": {
		"doc": {
			"id": "8d2a902852e285840e188a82535c7b689ed1cf6416012f3236e5f8249e875267",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/UNAL-Bloque_M5-Facultad_de_Minas-Medellin2.JPG/220px-UNAL-Bloque_M5-Facultad_de_Minas-Medellin2.JPG",
				"previous": "The educational experience of many Colombian children begins with attendance at a preschool academy until age five (Educación preescolar). Basic education (Educación básica) is compulsory by law.[252] It has two stages: Primary basic education (Educación básica primaria) which goes from first to fifth grade – children from six to ten years old, and Secondary basic education (Educación básica secundaria), which goes from sixth to ninth grade. Basic education is followed by Middle vocational education (Educación media vocacional) that comprises the tenth and eleventh grades. It may have different vocational training modalities or specialties (academic, technical, business, and so on.) according to the curriculum adopted by each school.",
				"after": "After the successful completion of all the basic and middle education years, a high-school diploma is awarded. The high-school graduate is known as a bachiller, because secondary basic school and middle education are traditionally considered together as a unit called bachillerato (sixth to eleventh grade). Students in their final year of middle education take the ICFES test (now renamed Saber 11) in order to gain access to higher education (Educación superior). This higher education includes undergraduate professional studies, technical, technological and intermediate professional education, and post-graduate studies. Technical professional institutions of Higher Education are also opened to students holder of a qualification in Arts and Business. This qualification is usually awarded by the SENA after a two years curriculum.[253]",
			"color": "dim|0.20592 gray|0.20592 dim|0.20592 grey|0.20592 tan|0.19101 gray|0.13659 grey|0.13659 burly|0.070599 wood|0.070599 lavender|0.039413 dark|0.027255 gray|0.027255 dark|0.027255 grey|0.027255 black|0.0233 wheat|0.021283 dark|0.017973 olive|0.017973 green|0.017973 slate|0.014391 gray|0.014391 antique|0.014081 white|0.014081 bisque|0.014034 peach|0.013857 puff|0.013857 blanched|0.01294 almond|0.01294 papaya|0.012512 whip|0.012512 corn|0.01063 silk|0.01063 beige|0.0096303 old|0.0086993 lace|0.0086993 light|0.0082111 golden|0.0082111 rod|0.0082111 yellow|0.0082111 moccasin|0.0081586 light|0.0078782 yellow|0.0078782 linen|0.0077485 lemon|0.0077214 chiffon|0.0077214 light|0.0076938 slate|0.0076938 gray|0.0076938 silver|0.0075083 ghost|0.0071952 white|0.0071952 sea|0.0071661 shell|0.0071661 floral|0.0070669 white|0.0070669 alice|0.0068219 blue|0.0068219 white|0.0064414 smoke|0.0064414 gainsboro|0.0062925 ivory|0.0061733 light|0.006061 gray|0.006061 light|0.006061 grey|0.006061 navajo|0.0059633 white|0.0059633 lavender|0.0058725 blush|0.0058725 snow|0.0057616 pale|0.0051293 golden|0.0051293 rod|0.0051293 white|0.0048758  "
		}
	}
}
