{
	"add": {
		"doc": {
			"id": "8d2f74779d0fa519040c41644729a7434891dc9f60391eafb4d09baa837fc307",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Apollo_synthetic_diamond.jpg/137px-Apollo_synthetic_diamond.jpg",
				"previous": "Portal:Technology/Selected articles/29",
				"after": "Synthetic diamond is diamond produced in a technological process, as opposed to natural diamond which is created in geological processes. Numerous claims of diamond synthesis were documented between 1879 and 1928; every attempt has been carefully analyzed and none has been confirmed. In the 1940s, systematic research began in the United States, Sweden and the Soviet Union to grow diamond using chemical vapor deposition (CVD) and high-pressure high-temperature synthesis (HPHT) processes. The first reproducible synthesis was reported around 1953. Those two processes still dominate the production of synthetic diamond. The properties of synthetic diamond depend on the details of the manufacturing processes, and can be inferior or superior to those of natural diamond; the hardness, thermal conductivity and electron mobility are superior in some synthetic diamonds. Consequently, synthetic diamond is widely used in abrasives, cutting and polishing tools and in heat sinks. Electronic applications of synthetic diamond are being developed, including high-power switches at power stations, high-frequency field-effect transistors and light-emitting diodes. Both CVD and HPHT diamonds can be cut into gems and various colors can be produced: clear white, yellow, brown, blue, green and orange.",
			"color": "dark|0.2412 gray|0.2412 dark|0.2412 grey|0.2412 gray|0.13566 grey|0.13566 slate|0.11418 gray|0.11418 silver|0.11417 light|0.10706 slate|0.10706 gray|0.10706 light|0.071934 gray|0.071934 light|0.071934 grey|0.071934 dim|0.062785 gray|0.062785 dim|0.062785 grey|0.062785 gainsboro|0.053997 dark|0.021148 slate|0.021148 gray|0.021148 light|0.012227 steel|0.012227 blue|0.012227 lavender|0.010196 white|0.0085647 smoke|0.0085647 alice|0.0076931 blue|0.0076931 ghost|0.0058526 white|0.0058526 black|0.0046254 steel|0.0038339 blue|0.0038339  "
		}
	}
}
