{
	"add": {
		"doc": {
			"id": "8d56580d297592efd00613e89956090f5eea501ae8de6091fe081cdb315fa03b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Tsou_youth_of_Taiwan_%28pre-1945%29.jpg/170px-Tsou_youth_of_Taiwan_%28pre-1945%29.jpg",
				"previous": "Beginning nearly a century later, as the rule of the Qing Empire expanded over wider groups of people, writers and gazetteers recast their descriptions away from reflecting degree of acculturation, and toward a system that defined the aborigines relative to their submission or hostility to Qing rule. Qing literati used the term \"raw/wild\" (\"生番\") to define those people who had not submitted to Qing rule, and \"cooked; tamed or subjugated\" (\"熟番\") for those who had pledged their allegiance through their payment of a head tax.[8] According to the standards of the Qianlong Emperor and successive regimes, the epithet \"cooked\" was synonymous with having assimilated to Han cultural norms, and living as a subject of the Empire, but it retained a pejorative designation to signify the perceived cultural lacking of the non-Han people (Harrell 1996:19), (Diamond 1995:100). This designation reflected the prevailing idea that anyone could be civilized/tamed by adopting Confucian social norms (Crossley 1999:281–95; Dikotter 1992:8–9).",
				"after": "As the Qing consolidated their power over the plains and struggled to enter the mountains in the late 19th century, the terms Pingpu (平埔族; Píngpǔzú; \"Plains tribes\") and Gaoshan (高山族; Gāoshānzú; \"High Mountain tribes\") were used interchangeably with the epithets \"cooked\" and \"raw\" (Teng 2004:125–27). During the 50 years of Japanese colonial rule (1895–1945), anthropologists from Japan maintained the binary classification. In 1900 they incorporated it into their own colonial project by employing the term Peipo (平埔) for the \"cooked tribes\", and creating a category of \"recognized tribes\" for the aborigines who had formerly been called \"raw\". The Wushe Incident of 1930 led to many changes in aboriginal policy, and the Japanese government began referring to them as Takasago-zoku (高砂族) (Tai 1999:294). The latter group included the Atayal, Bunun, Tsou, Saisiat, Paiwan, Puyuma, and Ami peoples. The Yami (Tao) and Rukai were added later, for a total of nine recognized tribes (Harrison 2001:54–5). During the early period of Chinese Nationalist Kuomintang (KMT) rule the terms Shandi Tongbao (山地同胞) \"mountain compatriots\" and Pingdi Tongbao (平地同胞) \"plains compatriots\" were invented, to remove the presumed taint of Japanese influence and reflect the place of Taiwan's indigenous people in the Chinese Nationalist state (Harrison 2001:60). The KMT later adopted the use of all the earlier Japanese groupings except Peipo.",
			"color": "silver|0.09684 rosy|0.093147 brown|0.093147 dark|0.090001 gray|0.090001 dark|0.090001 grey|0.090001 black|0.077349 misty|0.073406 rose|0.073406 dark|0.061961 salmon|0.061961 dim|0.054165 gray|0.054165 dim|0.054165 grey|0.054165 tan|0.038285 firebrick|0.036366 light|0.035809 gray|0.035809 light|0.035809 grey|0.035809 burly|0.032933 wood|0.032933 peru|0.029647 brown|0.024877 peach|0.02476 puff|0.02476 sienna|0.024313 gray|0.022808 grey|0.022808  "
		}
	}
}
