{
	"add": {
		"doc": {
			"id": "8d71144abcd9a9069d585106183e480dbda25c1c50d84bbfa7ee13d3f634a9c1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/U.S._Marines_in_the_Korean_War_003.jpg/170px-U.S._Marines_in_the_Korean_War_003.jpg",
				"previous": "In early February, the South Korean 11th Division ran the operation to destroy the guerrillas and their sympathizer citizens in Southern Korea.[211] During the operation, the division and police conducted the Geochang massacre and Sancheong-Hamyang massacre.[211] In mid-February, the PVA counterattacked with the Fourth Phase Offensive and achieved initial victory at Hoengseong. But the offensive was soon blunted by the IX Corps positions at Chipyong-ni in the center.[207] Units of the U.S. 2nd Infantry Division and the French Battalion fought a short but desperate battle that broke the attack's momentum.[207] The battle is sometimes known as the Gettysburg of the Korean War. The battle saw 5,600 Korean, American and French troops defeat a numerically superior Chinese force. Surrounded on all sides, the U.S. 2nd Infantry Division Warrior Division's 23rd Regimental Combat Team with an attached French Battalion was hemmed in by more than 25,000 Chinese Communist forces. United Nations forces had previously retreated in the face of large Communist forces instead of getting cut off, but this time they stood and fought at odds of roughly 15 to 1.[212]",
				"after": "In the last two weeks of February 1951, Operation Roundup was followed by Operation Killer, carried out by the revitalized Eighth Army. It was a full-scale, battlefront-length attack staged for maximum exploitation of firepower to kill as many KPA and PVA troops as possible.[207] Operation Killer concluded with I Corps re-occupying the territory south of the Han River, and IX Corps capturing Hoengseong.[213] On 7 March 1951, the Eighth Army attacked with Operation Ripper, expelling the PVA and the KPA from Seoul on 14 March 1951. This was the city's fourth conquest in a years' time, leaving it a ruin; the 1.5 million pre-war population was down to 200,000, and people were suffering from severe food shortages.[213][157]",
			"color": " "
		}
	}
}
