{
	"add": {
		"doc": {
			"id": "8d773f186cb307adc8dc191a9fa0632c29f1ca25753e1a1f671fe5ae3055003b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Olmec2.jpg/220px-Olmec2.jpg",
				"previous": "La Venta Monument 2 measures 1.63 metres (5.3 ft) high by 1.35 metres (4.4 ft) wide by 0.98 metres (3.2 ft) deep; the head weighs 11.8 tons.[115] The face has a broadly smiling expression that reveals four of the upper teeth. The cheeks are given prominence by the action of smiling; the brow that is normally visible in other heads is covered by the rim of the headdress.[117] The face is badly eroded, distorting the features.[118] In addition to the severe erosion damage, the upper lip and a part of the nose have been deliberately mutilated.[119] The head was found in its original context a few metres north of the northwest corner of pyramid-platform A-2. Radiocarbon dating of the monument's context dates it to between 1000 and 600 BC. Monument 2 has suffered erosion damage from its exposure to the elements prior to discovery. The head has a prominent headdress but this is badly eroded and any individual detail has been erased. A strap descends in front of the ear on each side of the head, descending as far as the earlobe. The head is adorned with ear ornaments in the form of a disc that covers the earlobe, with an associated clip or peg.[120] The surviving details of the headdress and earflares are stylistically similar to those of Tres Zapotes Monument A.[121] The head has been moved to the Museo del Estado de Tabasco in Villahermosa.[120]",
				"after": "La Venta Monument 3 stands 1.98 metres (6.5 ft) high and measures 1.6 metres (5.2 ft) wide by 1 metre (3.3 ft) deep; it weighs 12.8 tons. Monument 3 was located a few metres to the east of Monument 2, but was moved to the Parque-Museo La Venta in Villahermosa. Like the other La Venta heads, its context has been radiocarbon dated to between 1000 and 600 BC.[122] It appears unfinished and has suffered severe damage through weathering, making analysis difficult. It had a large headdress that reaches to the eyebrows but any details have been lost through erosion. Straps descend in front of each ear and continue to the base of the monument. The ears are wearing large flattened rings that overlap the straps; they probably represent jade ornaments of a type that have been recovered in the Olmec region. Although most of the facial detail is lost, the crinkling of the bridge of the nose is still evident, a feature that is common to the frowning expressions of the other Olmec colossal heads.[123]",
			"color": "gray|0.38735 grey|0.38735 dim|0.25722 gray|0.25722 dim|0.25722 grey|0.25722 dark|0.22444 gray|0.22444 dark|0.22444 grey|0.22444 silver|0.052065 light|0.025433 gray|0.025433 light|0.025433 grey|0.025433 gainsboro|0.01798 slate|0.016568 gray|0.016568 light|0.010063 slate|0.010063 gray|0.010063 linen|0.0029993  "
		}
	}
}
