{
	"add": {
		"doc": {
			"id": "8d7ff802a2641692e5eaa02c8c55887d7dbbc0d7de3e5b0f9740f13e103fe1b7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Wikimania_2011_-_Group_Picture_%282%29.jpg/220px-Wikimania_2011_-_Group_Picture_%282%29.jpg",
				"previous": "It was the first conference which included a big focus on the cultural aspects of the hosting nation, particularly a concert of a philharmonic orchestra, celebrating the tenth anniversary of the death of the most important contemporary Polish composer Władysław Szpilman and the premiere of the film Truth in Numbers?. At the conference, Sue Gardner, executive director of the Wikimedia Foundation, said that the foundation's aim was to grow the number of visitors to Wikimedia sites from 371 million to 680 million a month, over the next five years.",
				"after": "Wikimania 2011 was held in Haifa, Israel, on August 4–7.[23] The conference venue was the Haifa Auditorium and adjoining Beit Hecht cultural center on Mount Carmel. Keynote speakers at the conference included Yochai Benkler, a fellow at the Berkman Center for Internet and Society at Harvard University and Joseph M. Reagle Jr. of MIT, author of Good Faith Collaboration: The Culture of Wikipedia.[24] Head of the Science and Technology Committee at the Knesset, Meir Sheetrit, also spoke at the conference, as did Yonah Yahav, the Mayor of Haifa.[25] One of the sponsors of the event was Haifa University.[26] The conference featured 125 sessions in five simultaneous tracks and was attended by 720 Wikimedians[7] from 56 different countries,[25] including some that have no diplomatic relations with Israel.[27]",
			"color": "dark|0.1312 gray|0.1312 dark|0.1312 grey|0.1312 gray|0.098728 grey|0.098728 black|0.098028 dim|0.090422 gray|0.090422 dim|0.090422 grey|0.090422 silver|0.063271 light|0.053277 steel|0.053277 blue|0.053277 thistle|0.047285 light|0.041456 slate|0.041456 gray|0.041456 lavender|0.040221 slate|0.03885 gray|0.03885 rosy|0.036897 brown|0.036897 light|0.034564 gray|0.034564 light|0.034564 grey|0.034564 gainsboro|0.026115 alice|0.018434 blue|0.018434 light|0.01827 blue|0.01827 ghost|0.013598 white|0.013598 white|0.011874 smoke|0.011874 dark|0.011663 slate|0.011663 gray|0.011663 azure|0.010029 dark|0.0097409 sea|0.0097409 green|0.0097409 light|0.0093227 cyan|0.0093227 lavender|0.0092436 blush|0.0092436 snow|0.0078549 white|0.0074101 powder|0.0071434 blue|0.0071434 mint|0.0070593 cream|0.0070593 misty|0.0070547 rose|0.0070547 sky|0.006472 blue|0.006472 light|0.006031 sky|0.006031 blue|0.006031  "
		}
	}
}
