{
	"add": {
		"doc": {
			"id": "8d97c4c9f4eee127d131e3703c00ef36f3b9574e5c6db4a4e0cc0106dac21d58",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Kennedy-Thorndike_experiment_DE.svg/220px-Kennedy-Thorndike_experiment_DE.svg.png",
				"previous": "The Michelson–Morley experiment was designed to detect second order effects of the \"aether wind\" – the motion of the aether relative to the earth. Michelson designed an instrument called the Michelson interferometer to accomplish this. The apparatus was more than accurate enough to detect the expected effects, but he obtained a null result when the first experiment was conducted in 1881,[12] and again in 1887.[13] Although the failure to detect an aether wind was a disappointment, the results were accepted by the scientific community.[11] In an attempt to salvage the aether paradigm, Fitzgerald and Lorentz independently created an ad hoc hypothesis in which the length of material bodies changes according to their motion through the aether.[14] This was the origin of FitzGerald–Lorentz contraction, and their hypothesis had no theoretical basis. The interpretation of the null result of the Michelson–Morley experiment is that the round-trip travel time for light is isotropic (independent of direction), but the result alone is not enough to discount the theory of the aether or validate the predictions of special relativity.[15][16]",
				"after": "While the Michelson–Morley experiment showed that the velocity of light is isotropic, it said nothing about how the magnitude of the velocity changed (if at all) in different inertial frames. The Kennedy–Thorndike experiment was designed to do that, and was first performed in 1932 by Roy Kennedy and Edward Thorndike.[17] They obtained a null result, and concluded that \"there is no effect ... unless the velocity of the solar system in space is no more than about half that of the earth in its orbit\".[16][18] That possibility was thought to be too coincidental to provide an acceptable explanation, so from the null result of their experiment it was concluded that the round-trip time for light is the same in all inertial reference frames.[15][16]",
			"color": "dim|0.14712 gray|0.14712 dim|0.14712 grey|0.14712 dark|0.13797 gray|0.13797 dark|0.13797 grey|0.13797 black|0.13413 gray|0.13332 grey|0.13332 silver|0.081732 lime|0.031107 green|0.031107 white|0.030919 smoke|0.030919 snow|0.028785 white|0.028641 ghost|0.02795 white|0.02795 mint|0.026946 cream|0.026946 alice|0.026707 blue|0.026707 light|0.02559 gray|0.02559 light|0.02559 grey|0.02559 sea|0.025297 shell|0.025297 floral|0.025044 white|0.025044 azure|0.024931 gainsboro|0.018694 lavender|0.01645 blush|0.01645 ivory|0.010055 linen|0.0040977  "
		}
	}
}
