{
	"add": {
		"doc": {
			"id": "8ddc4b15d3f42042e405f4b0181ff37cad6dfe21cfc3843d8bbf6e25a108b55e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Steamer_Frank_J._Hecker.jpg/220px-Steamer_Frank_J._Hecker.jpg",
			"previous": [
				"On launching, the vessel slides backwards down the slipway on the ways until it floats by itself.[3]",
				"Normally, ways are arranged perpendicular to the shore line (or as nearly so as the water and maximum length of vessel allows) and the ship is built with its stern facing the water. Modern slipways take the form of a reinforced concrete mat of sufficient strength to support the vessel, with two \"barricades\" that extend to well below the water level taking into account tidal variations. The barricades support the two launch ways. The vessel is built upon temporary cribbing that is arranged to give access to the hull's outer bottom, and to allow the launchways to be erected under the complete hull. When it is time to prepare for launching a pair of standing ways are erected under the hull and out onto the barricades. The surface of these ways are greased. (Tallow and whale oil were used as grease in sailing ship days.)[2] A pair of sliding ways is placed on top, under the hull, and a launch cradle with bow and stern poppets is erected on these sliding ways. The weight of the hull is then transferred from the build cribbing onto the launch cradle. Provision is made to hold the vessel in place and then release it at the appropriate moment in the launching ceremony, these are either a weak link designed to be cut at a signal or a mechanical trigger controlled by a switch from the ceremonial platform."
			],
				"after": "Some slipways are built so that the vessel is side on to the water and is launched sideways. This is done where the limitations of the water channel would not allow lengthwise launching, but occupies a much greater length of shore. The Great Eastern designed by Brunel was built this way as were many landing craft during World War II. This method requires many more sets of ways to support the weight of the ship.",
			"color": " "
		}
	}
}
