{
	"add": {
		"doc": {
			"id": "8def6d3011cfc15c42125f4ae7206d9ce40ca7f4213ec7e6e416003e6ce17a99",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Colbert_Report_studio.jpg/220px-Colbert_Report_studio.jpg",
				"previous": "On January 16, 2008, the \"three-deep\" Colbert portrait was placed on display \"right between the bathrooms near the 'America's Presidents' exhibit\" at the National Portrait Gallery in Washington, DC.[33] After first being rejected by the National Museum of American History, Colbert petitioned the Smithsonian to display his portrait, who agreed to \"go along with the joke\", though they stressed that it was only temporary. Colbert said \"I don't mean to brag, but as it contains three portraits, my portrait has more portraits than any other portrait in the National Portrait Gallery!\" The portrait was then put on display at the Smithsonian until April 13. On October 16, 2008, the three-deep portrait was officially donated to the permanent collection of the Smithsonian's American Treasures exhibit. In September 2009, the portrait was retired to the Smithsonian's collection. At the end of that show, a new 5-deep portrait was unveiled, with the newest Colbert holding his newly won Primetime Emmy Award with another Primetime Emmy Award and a Peabody by the mantle.",
				"after": "The graphics used throughout the show and the studio itself are saturated with American flags, bald eagles, Captain America's shield, and other patriotic imagery.[29] The set contains many references to Colbert, and on the show's first episode he pointed out several examples: his name, initials and the name of the show appear on the desk's plasma screen, on the rafters above the desk, and the desk itself is shaped like a giant \"C\".[27] In an interview with The A.V. Club, Colbert explained that much of the design for the set was inspired by Leonardo da Vinci's The Last Supper. \"All the architecture of that room points at Jesus' head, the entire room is a halo\", Colbert said. \"On the set, I'd like the lines of the set to converge on my head. And so if you look at the design, it all does, it all points at my head...there's a sort of sun-god burst quality about the set around me.\"[28] On the floor to the front stage right of his desk there is an eagle's nest, and a tape outline of where he injured his wrist, akin to those seen at murder scenes on television police procedurals.",
			"color": "dark|0.28064 gray|0.28064 dark|0.28064 grey|0.28064 silver|0.17884 gray|0.09886 grey|0.09886 light|0.09491 gray|0.09491 light|0.09491 grey|0.09491 dim|0.077817 gray|0.077817 dim|0.077817 grey|0.077817 gainsboro|0.048052 black|0.040717 light|0.023515 slate|0.023515 gray|0.023515 slate|0.016044 gray|0.016044 peru|0.01457 rosy|0.0067402 brown|0.0067402 dark|0.0062892 slate|0.0062892 gray|0.0062892 peach|0.006153 puff|0.006153 white|0.0052103 smoke|0.0052103 linen|0.0045591 sea|0.0041184 shell|0.0041184 misty|0.0039755 rose|0.0039755 tan|0.0037919 snow|0.0037658  "
		}
	}
}
