{
	"add": {
		"doc": {
			"id": "8dfed1218beb1b3419e90bf6570fc5393f8aced7eac752d6e6054bc4e86dcc7a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/China_topography_full_res.jpg/400px-China_topography_full_res.jpg",
			"previous": [],
				"after": "The topography of China has been divided by the government into five homogeneous physical macro-regions, namely Eastern China (subdivided into the northeast plain, north plain, and southern hills), Xinjiang-Mongolia, and the Tibetan highlands[2] It is diverse with snow-capped mountains, deep river valleys, broad basins, high plateaus, rolling plains, terraced hills, sandy dunes, craggy karsts, volcanic calderas, low-latitude glaciers and other landforms present in myriad variations. In general, the land is high in the west and descends to the east coast. Mountains (33 percent), plateaus (26 percent) and hills (10 percent) account for nearly 70 percent of the country's land surface. Most of the country's arable land and population are based in lowland plains (12 percent) and basins (19 percent), though some of the greatest basins are filled with deserts. The country's rugged terrain presents problems for the construction of overland transportation infrastructure and requires extensive terracing to sustain agriculture, but is conducive to the development of forestry, mineral and hydropower resources, and tourism.",
			"color": "light|0.5697 sky|0.5697 blue|0.5697 light|0.075836 gray|0.075836 light|0.075836 grey|0.075836 gainsboro|0.065138 silver|0.063018 sky|0.044356 blue|0.044356 dark|0.032059 gray|0.032059 dark|0.032059 grey|0.032059 linen|0.016897 antique|0.015585 white|0.015585 white|0.01411 smoke|0.01411 old|0.01038 lace|0.01038 sea|0.0097146 shell|0.0097146 papaya|0.0080717 whip|0.0080717 beige|0.0069254 floral|0.0067221 white|0.0067221 blanched|0.0061408 almond|0.0061408 alice|0.0059772 blue|0.0059772 misty|0.005064 rose|0.005064 ghost|0.0041586 white|0.0041586 snow|0.0041546 corn|0.0038522 silk|0.0038522 light|0.0036429 blue|0.0036429 light|0.0034785 steel|0.0034785 blue|0.0034785 lavender|0.003422 ivory|0.0028816  "
		}
	}
}
