{
	"add": {
		"doc": {
			"id": "8e0d893a01c0f66f158297fd2ac99fdc635df1741402b187c4570de34f7f95b3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Zak_Sobranie_SverdlOblasti.jpg/200px-Zak_Sobranie_SverdlOblasti.jpg",
			"previous": [],
				"after": "The oblast's Charter, adopted on December 17, 1994, with subsequent amendments, establishes the oblast government. The Governor is the chief executive, who appoints the Government, consisting of ministries and departments. The Chairman of the Government, commonly referred to as the Prime Minister, is appointed with the consent of the lower house of the legislature, a process similar to the appointment of the federal Prime Minister. But the Governor cannot nominate the same candidate more than twice, yet he/she can dismiss the house after three failed attempts to appoint the Premier. The Legislative Assembly consists of the Oblast Duma, the lower house, and the House of Representatives, the upper house. Members of the legislature serve four year terms. However, half of the Duma is re-elected every two years. The Duma (28 members) is elected by party lists. The 21 members of the House of Representatives are elected in single-seat districts in a first-past-the-post system. The Sverdlovsk Legislative Assembly was the first bicameral legislature outside an autonomous republic, and the first regional legislature in Russia to elect members based on both party lists and single-seat districts.",
			"color": "gray|0.14956 grey|0.14956 dim|0.14476 gray|0.14476 dim|0.14476 grey|0.14476 slate|0.13275 gray|0.13275 light|0.12547 slate|0.12547 gray|0.12547 dark|0.0793 gray|0.0793 dark|0.0793 grey|0.0793 light|0.076514 gray|0.076514 light|0.076514 grey|0.076514 gainsboro|0.067392 silver|0.055244 light|0.033225 steel|0.033225 blue|0.033225 black|0.025481 linen|0.023479 antique|0.013982 white|0.013982 sea|0.010079 shell|0.010079 old|0.0094984 lace|0.0094984 white|0.0089798 smoke|0.0089798 floral|0.0061159 white|0.0061159 misty|0.0060746 rose|0.0060746 dark|0.0057571 slate|0.0057571 gray|0.0057571  "
		}
	}
}
