{
	"add": {
		"doc": {
			"id": "8e0f0f789d9fa09f805c0ae639afc549eb5328a0eeeea43129aeb9ab97bb0fb6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/BroncoBusterRemingtonSculpture.png/220px-BroncoBusterRemingtonSculpture.png",
				"previous": "Hogg and her brothers were avid art collectors; she owned a large collection, including Native American art and works by Picasso, Chagall, Matisse and Modigliani.[73] Her interest in collecting began during her convalescence in Philadelphia.[66] Her first purchase, in 1922, was a Spanish foot chair or Queen Anne maple chair with carved feet.[74][75] She researched the early American furniture market extensively, personally visiting Luke Vincent Lockwood, the author of the standard work on the topic, for more information.[75] At the time, Hogg was one of a small number of people who believed that American antiques had value—by contrast, most collectors concentrated on furniture built in Europe.[76] Other collectors soon saw the value in early American pieces. Hogg remained one of the few collectors not located on the East Coast. As her collection grew, she was often asked to loan pieces for exhibit in New England; Hogg always refused, stating \"they've got plenty of these things up there\".[77]",
				"after": "In the 1920s, Hogg's brothers began to develop a new elite neighborhood, which they called River Oaks, on the outskirts of Houston.[78] For their home, the Hoggs chose the largest lot, 14.5 acres (5.9 ha). Ima worked closely with architect John Staub to design a house that would show off the art the family had purchased.[79][80] William and Ima moved into the house, which she christened Bayou Bend, in 1928.[80] In 1939, when she restored her estate along American lines,[73] she donated more than 100 works on paper to Houston's Museum of Fine Arts (MFAH), including works by Cézanne, Sargent, Picasso, and Klee.[81] Following the death of her brother Michael in 1941, she donated his collection of Frederic Remington works to the museum. Consisting of 53 oil paintings, 10 watercolors, and one bronze, it is known as the Hogg Brothers Collection, and is \"one of the most important groupings of Western paintings on display in an American museum\", according to Hogg biographer Neely.[70] Hogg donated her collection of Native American art to MFAH in 1944,[81] including 168 pieces of pottery, 95 pieces of jewelry, and 81 paintings.[82]",
			"color": "dim|0.6663 gray|0.6663 dim|0.6663 grey|0.6663 gray|0.20504 grey|0.20504 black|0.095389 dark|0.029346 gray|0.029346 dark|0.029346 grey|0.029346  "
		}
	}
}
