{
	"add": {
		"doc": {
			"id": "8e18f289ba0dde621266dd7b5048f145eb2d0fc8294aaa5f508245768590215e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Aerial_photo_of_Bodiam_Castle.jpg/300px-Aerial_photo_of_Bodiam_Castle.jpg",
				"previous": "The Treaty of Bruges (1375) ensured peace for two years, but after it expired, fighting resumed between England and France.[7] In 1377 Edward III was succeeded by Richard II. During the war, England and France struggled for control of the English Channel, with raids on both coasts. With the renewed hostilities, Parliament voted that money should be spent on defending and fortifying England's south coast, and defences were erected in Kent in anticipation of a French invasion.[8] There was internal unrest as well as external threats, and Dalyngrigge was involved in suppressing the Peasants' Revolt of 1381.[3] The manor of Bodiam was granted a charter in 1383 permitting a weekly market and an annual fair to be held.[9][10] In 1385, a fleet of 1,200 ships – variously cogs, barges, and galleys – gathered across the English Channel at Sluys, Flanders; the population of southern England was in a state of panic. Later in the year, Edward Dalyngrigge was granted a licence to fortify his manor house.[8]",
				"after": "Dalyngrigge's licence from Richard II permitted him to refortify his existing manor house, but instead he chose a fresh site to build a castle on. Construction was completed in one phase, and most of the castle is in the same architectural style. Archaeologist David Thackray has deduced from this that Bodiam Castle was built quickly, probably because of the threat from the French.[12] Stone castles were usually time-consuming and expensive to build, often costing thousands of pounds.[13] Dalyngrigge was Captain of the port of Brest in France from 1386 to 1387, and as a result was probably absent for the first years of the castle's construction.[10] It replaced the old manor house as Dalyngrigge's main residence and the administrative centre of the manor.[14] It is not recorded when Bodiam Castle was completed, but Thackray suggests that it was before 1392; Dalyngrigge did not have long to spend in the completed castle, as he was dead by 1395.[10]",
			"color": "dim|0.29579 gray|0.29579 dim|0.29579 grey|0.29579 dark|0.15887 olive|0.15887 green|0.15887 olive|0.1576 gray|0.12719 grey|0.12719 olive|0.099244 drab|0.099244 dark|0.03622 khaki|0.03622 tan|0.026368 dark|0.023762 gray|0.023762 dark|0.023762 grey|0.023762 dark|0.016118 slate|0.016118 gray|0.016118 slate|0.015862 gray|0.015862 black|0.014398  "
		}
	}
}
