{
	"add": {
		"doc": {
			"id": "8e1b396a0aa0d0dffb316638447890cd7607a74aa8b6de4ef565498612a7e19f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/MSC_2014_Klychko-Kerry-Yatsenyuk_Mueller_MSC2014.jpg/220px-MSC_2014_Klychko-Kerry-Yatsenyuk_Mueller_MSC2014.jpg",
				"previous": "On 27 September 2013, he met with the Iranian Foreign Minister Mohammad Javad Zarif during the P5+1 and Iran summit. It was the highest-level direct contact between the United States and Iran in the last six years, and made him the first U.S. Secretary of State to have met with his Iranian counterpart since the Iranian Revolution.[137][138][139]",
				"after": "In the State Department, Kerry quickly earned a reputation \"for being aloof, keeping to himself, and not bothering to read staff memos.\" Career State Department officials have complained that power has become too centralized under Kerry's leadership, which slows department operations when Kerry is on one of his frequent overseas trips. Others in State describe Kerry as having \"a kind of diplomatic attention deficit disorder\" as he shifts from topic to topic instead of focusing on long-term strategy. When asked whether he was traveling too much, he responded, \"Hell no. I'm not slowing down.\" Despite Kerry's early achievements, morale at State is lower than under Hillary Clinton according to department employees.[140] However, after Kerry's first six months in the State Department, a Gallup poll found he had high approval ratings among Americans as Secretary of State.[141] After a year, another poll showed Kerry's favorability continued to rise.[142] Less than two years into Kerry's term, the Foreign Policy Magazine's 2014 Ivory Tower survey of international relations scholars asked, \"Who was the most effective U.S. Secretary of State in the past 50 years?\"; John Kerry and Lawrence Eagleburger tied for 11th place out of the 15 confirmed Secretaries of State in that period.[143][144]",
			"color": "dark|0.11735 salmon|0.11735 black|0.078906 silver|0.076521 gold|0.067944 crimson|0.06284 light|0.062022 gray|0.062022 light|0.062022 grey|0.062022 dark|0.061724 gray|0.061724 dark|0.061724 grey|0.061724 gainsboro|0.047239 dim|0.043351 gray|0.043351 dim|0.043351 grey|0.043351 gray|0.036364 grey|0.036364 light|0.026609 salmon|0.026609 firebrick|0.021742 rosy|0.017572 brown|0.017572 brown|0.016805 linen|0.01532  "
		}
	}
}
