{
	"add": {
		"doc": {
			"id": "8e1e45ed227eb2507c223a0d1177df856bd61129ed475d80c724e59b2a44c225",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Hamilton_Disston_Land_Sale_Notice.jpg/170px-Hamilton_Disston_Land_Sale_Notice.jpg",
				"previous": "A national push for expansion and progress in the United States occurred in the later part of the 19th century, which stimulated interest in draining the Everglades for agricultural use. According to historians, \"From the middle of the nineteenth century to the middle of the twentieth century, the United States went through a period in which wetland removal was not questioned. Indeed, it was considered the proper thing to do.\"[97] Draining the Everglades was suggested as early as 1837,[5] and a resolution in Congress was passed in 1842 that prompted Secretary of Treasury Robert J. Walker to request those with experience in the Everglades to give their opinion on the possibility of drainage. Many officers who had served in the Seminole Wars favored the idea.[5] In 1850 Congress passed a law that gave several states wetlands within their state boundaries. The Swamp and Overflowed Lands Act ensured that the state would be responsible for funding the attempts at developing wetlands into farmlands.[98] Florida quickly formed a committee to consolidate grants to pay for any attempts, though the The Civil War and Reconstruction halted progress until after 1877.",
				"after": "After the Civil War, a state agency called the Internal Improvement Fund (IIF), whose purpose was to improve Florida's roads, canals, and rail lines, was discovered to be deeply in debt. The IIF found a Pennsylvania real estate developer named Hamilton Disston interested in implementing plans to drain the land for agriculture. Disston purchased 4,000,000 acres (16,000 km2) of land for $1 million in 1881,[99] and he began constructing canals near St. Cloud. At first the canals seemed to work in lowering the water levels in the wetlands surrounding the rivers.[100] They were effective in lowering the groundwater, but it became apparent that their capacity was insufficient for the wet season.[101] Though Disston's canals did not drain well, his purchase primed the economy of Florida. It made news and attracted tourists and land buyers. Within four years property values doubled, and the population increased significantly.[99]",
			"color": " "
		}
	}
}
