{
	"add": {
		"doc": {
			"id": "8e2000edb7062d15f3db750081765da5be303922d9a2d16fcc6cbf7dea9fd348",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Abraham_Lincoln%2C_Bronze_Plaque_by_Victor_Brenner.jpg/170px-Abraham_Lincoln%2C_Bronze_Plaque_by_Victor_Brenner.jpg",
				"previous": "Saint-Gaudens originally conceived a flying eagle design for the cent,[4] but at Roosevelt's request, developed it for the double eagle after learning that by law, an eagle could not appear on the cent.[5] Writer and friend Witter Bynner recalled that in January 1907, Saint-Gaudens was seriously ill with cancer, and was carried to his studio for ten minutes a day to critique the work of his assistants on current projects, including the cent. Saint-Gaudens sent Roosevelt a design in February for the obverse of the cent showing a figure of Liberty. Roosevelt suggested the addition of a Native American war bonnet, stating, \"I don't see why we should not have a conventional head-dress of purely American type for the Liberty figure.\"[6] In May 1907, Roosevelt instructed that the Indian design be developed for the eagle instead. Saint-Gaudens was by then in declining health; he died on August 3, 1907, without having submitted another design for the cent.[2]",
				"after": "With the redesign of the four gold denominations completed by 1908, Roosevelt turned his attention to the cent. The centennial of the birth of assassinated president Abraham Lincoln would occur in February 1909, and large numbers of privately manufactured souvenirs were already being issued. Many citizens had written to the Treasury Department, proposing a Lincoln coin, and Roosevelt was interested in honoring his fellow Republican. This was a break with previous American numismatic tradition; before the Lincoln cent, no regularly circulating U.S. coin had featured an actual person (as opposed to idealized personifications, as of \"liberty\").[7] Many writers had suggested a Lincoln half dollar, but that coin's design had been changed in 1892 and could not yet be altered without congressional approval. By then a lame duck in office, Roosevelt was reluctant to involve Congress.[8]",
			"color": "dim|0.68957 gray|0.68957 dim|0.68957 grey|0.68957 black|0.2575  "
		}
	}
}
