{
	"add": {
		"doc": {
			"id": "8e21886c6189f39bcdd3d6c7ce17680ad7be85c037a1f13b2f834ee0cf455fd6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/K._S._Ranjitsinhji_Vanity_Fair_26_August_1897.jpg/220px-K._S._Ranjitsinhji_Vanity_Fair_26_August_1897.jpg",
			"previous": [],
				"after": "Ranjitsinhji's fame increased after 1896, and among the praise for his cricket were hints in the press that he intended to pursue a political career, following other Indians in England. Instead he began to turn his attention to the Nawanagar succession, beginning to make enquiries in India as to his position.[92] Meanwhile, he began to cultivate potentially beneficial connections; at Queen Victoria's jubilee celebrations, he established a friendship with Pratap Singh, the regent of Jodhpur, whom he later falsely described as his uncle.[93] Ranjitsinhji decided to return to India to further his case, prompted by the decision of Vibhaji's grandson Lakhuba to dispute the succession. Meanwhile, the financial expectations of behaving as a price pushed Ranjitsinhji even further into debt, and his allowance had been stopped after he had been given an advance on it to cover earlier money owed. He wrote to Willoughby Kennedy, the English Administrator of Nawanagar, asking for money but none was forthcoming.[93][94] His financial situation eased when a serious illness confined him to the house of an acquaintance. He took the opportunity to begin work on a cricket book which a publisher had invited him to write; Ranjitsinhji contributed seven chapters and other writers contributed the rest, then he and Fry revised the book together while travelling through Europe in the spring of 1897. The book was released in August 1897 under the title The Jubilee Book of Cricket,[note 5] and was a success, both commercially and with the critics:[95] the review by Francis Thompson was entitled, \"A Prince of India on the Prince of Games\".[78] Nevertheless, he was approaching bankruptcy by the end of 1897 and there are indications, such as an increased temper, that he felt the pressure.[93]",
			"color": "dark|0.51729 gray|0.51729 dark|0.51729 grey|0.51729 gray|0.14818 grey|0.14818 silver|0.071554 light|0.055405 slate|0.055405 gray|0.055405 slate|0.054511 gray|0.054511 dim|0.04101 gray|0.04101 dim|0.04101 grey|0.04101 light|0.03487 gray|0.03487 light|0.03487 grey|0.03487 gainsboro|0.023361 bisque|0.010364 peach|0.0050563 puff|0.0050563 blanched|0.0049378 almond|0.0049378 antique|0.0044656 white|0.0044656 tan|0.0039539 wheat|0.0039408  "
		}
	}
}
