{
	"add": {
		"doc": {
			"id": "8e29a47f1a10ea51a92046910265b2976a56227e59c3512541a46184c7ac5eab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Alcazar_of_Toledo_-_Toledo%2C_Spain_-_Dec_2006.jpg/170px-Alcazar_of_Toledo_-_Toledo%2C_Spain_-_Dec_2006.jpg",
				"previous": "The cultures of the Celtic and Iberian populations were gradually Romanised (Latinised) at differing rates in different parts of Hispania. Local leaders were admitted into the Roman aristocratic class[h][19] Hispania served as a granary for the Roman market, and its harbours exported gold, wool, olive oil, and wine. Agricultural production increased with the introduction of irrigation projects, some of which remain in use. Emperors Hadrian, Trajan, Theodosius I, and the philosopher Seneca were born in Hispania.[i] Christianity was introduced into Hispania in the 1st century CE and it became popular in the cities in the 2nd century CE.[19] Most of Spain's present languages and religion, and the basis of its laws, originate from this period.[18]",
				"after": "The weakening of the Western Roman Empire's jurisdiction in Hispania began in 409, when the Germanic Suebi and Vandals, together with the Sarmatian Alans crossed the Rhine and ravaged Gaul until the Visigoths drove them into Iberia that same year. The Suebi established a kingdom in what is today modern Galicia and northern Portugal. As the western empire disintegrated, the social and economic base became greatly simplified: but even in modified form, the successor regimes maintained many of the institutions and laws of the late empire, including Christianity.",
			"color": "dim|0.34975 gray|0.34975 dim|0.34975 grey|0.34975 gray|0.29908 grey|0.29908 dark|0.12821 gray|0.12821 dark|0.12821 grey|0.12821 silver|0.038228 slate|0.033498 gray|0.033498 tan|0.028891 light|0.026021 slate|0.026021 gray|0.026021 rosy|0.01823 brown|0.01823 light|0.015005 gray|0.015005 light|0.015005 grey|0.015005 black|0.010061 dark|0.0092302 slate|0.0092302 gray|0.0092302 steel|0.0089071 blue|0.0089071 gainsboro|0.0080828 light|0.0070919 steel|0.0070919 blue|0.0070919  "
		}
	}
}
