{
	"add": {
		"doc": {
			"id": "8e3ad8d63d5e07a5c706fdb7021522885f55dce19c7c5c970b64bb21a667c2a9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Byggingen_av_R%C3%A5dhuset_Oslo.jpg/220px-Byggingen_av_R%C3%A5dhuset_Oslo.jpg",
				"previous": "The company started a corporation with four regional steam ship companies—Vesterålske, Nordenfjeldske, Stavangerske and Arendalske—and on 21 November they established the company Norske Kystflyveruter and applied for all concessions to fly postal services around the coast, as well as to Gothenburg in Sweden. At the same time, Fred. Olsen & Co. and Bergenske bought Det Norske Luftfartselskap (DNL) and also applied for the routes. Widerøe wanted to use seaplanes, while DNL was going to use land planes. The government urged to companies to split the routes between them, but before the negotiations were completed, Cabinet Nygaardsvold was appointed, and they granted DNL a ten-year concession on all domestic flights.[4]",
				"after": "After losing all scheduled flights, Widerøe expanded to Northern Norway and started taxi flights. In 1935, the company also started in the cartography business. In Oslo, the company built a summer base for sea planes at Ingierstand, and a winter base for ski planes at Bogstadvannet. Around Bergen, the airline would land at cruise ships and offer flights to tourists to see the fjords and mountains. In March 1936, 51% of the company was taken over by DNL as part of a private placement. This allowed DNL to transfer some of its concessions to Widerøe, who started flying Oslo – Lillehammer/Tretten – Golå – Fefor – Tyinholmen/Nystuen, mainly aimed at tourists. For this route, a Bellanca Senior Pacemaker was bought. Widerøe also wet operated DNL's route from Oslo to Gothenburg, the route Tromsø to Honningsvåg and Bergen – Vadheim – Slidre – Balestrand. This routes in part used a Stinson Reliant.[5]",
			"color": "black|0.30883 silver|0.097172 dark|0.093813 gray|0.093813 dark|0.093813 grey|0.093813 light|0.075569 gray|0.075569 light|0.075569 grey|0.075569 gray|0.05511 grey|0.05511 gainsboro|0.053285 dim|0.04818 gray|0.04818 dim|0.04818 grey|0.04818 linen|0.036162 antique|0.034716 white|0.034716 old|0.026004 lace|0.026004 sea|0.025193 shell|0.025193 floral|0.022629 white|0.022629 white|0.019791 smoke|0.019791 ivory|0.017098 snow|0.015679 mint|0.013935 cream|0.013935 white|0.012266  "
		}
	}
}
