{
	"add": {
		"doc": {
			"id": "8e3c589ad4128f0472f49262f11db36f09768cd83a9a5656cd58d780b9bf4bd9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Wernher_von_Braun_1960.jpg/220px-Wernher_von_Braun_1960.jpg",
				"previous": "At age twelve, Parsons began attending Washington Junior High School, where he performed poorly—something biographer George Pendle attributed to undiagnosed dyslexia—and was bullied for his upper-class status and perceived effeminacy.[10] Although unpopular, he formed a strong friendship with Edward Forman, a boy from a poor working class family who defended him from bullies and shared his interest in science fiction and rocketry, with the well-read Parsons enthralling Forman with his literary and academic knowledge. In 1928 the pair—adopting the Latin motto per aspera ad astra—began engaging in homemade gunpowder-based rocket experiments in the nearby Arroyo Seco canyon, as well as the Parsons family's back garden, which left it pockmarked with craters from explosive test failures. They incorporated commonly available fireworks such as cherry bombs into their rockets, and Parsons suggested using glue as a binding agent to reduce the rocket fuel's volatility, which was noted by Forman as early example of the former's inventiveness. This research became more complex when they began using materials such as aluminium foil to enhance the castability of the gunpowder.[10][11][12] Parsons had also begun to investigate occultism, and independently performed a ritual intended to invoke the Devil into his bedroom; he worried that the invocation was successful and was so frightened that he ceased such activities until adulthood.[13] In 1929 Parsons began attending John Muir High School, where he maintained an insular friendship with Forman and was a keen participant in the sports of fencing and archery. After receiving poor school results, Parsons' mother sent him away to study at a private boarding school in San Diego—the Brown Military Academy for Boys—but he was expelled for blowing up the toilets.[14]",
				"after": "The Parsons family spent the summer of 1929 on a tour of Europe before returning to Pasadena, where they moved into a house on San Rafael Avenue. With the onset of the Great Depression their fortune began to dwindle, and in July 1931 Jack's grandfather Walter died.[15] Parsons began studying at the privately-run University School, a liberal institution that took an unconventional approach to teaching. He flourished at the school, becoming editor of the school's newspaper El Universitano and winning an award for literary excellence, while teachers that had trained at the nearby California Institute of Technology (Caltech) honed his attentions on the study of chemistry through practical demonstrations.[16] With the family's financial difficulties deepening, Parsons began working during weekends and school holidays at the offices of the Hercules Powder Company, where he learned more about explosives and their potential use in rocket propulsion.[17] He and Forman continued to independently explore the subject in their spare time, building and testing different rockets—sometimes with materials that Parsons had stolen from work. Parsons soon constructed his own solid-fuel rocket engine, and with Forman corresponded with pioneer rocket engineers including Robert H. Goddard, Russians Hermann Oberth and Konstantin Tsiolkovsky, and Germans Willy Ley and Wernher von Braun. Parsons and von Braun talked for hours over the telephone about rocketry in their respective countries as well as their own research. Pendle attributes the sudden dissipation of their conversations to the men's mutual reticence about disclosing the technical details of their discoveries.[18][19][11][20]",
			"color": "dim|0.3963 gray|0.3963 dim|0.3963 grey|0.3963 gray|0.23802 grey|0.23802 dark|0.12244 gray|0.12244 dark|0.12244 grey|0.12244 silver|0.072499 light|0.050602 gray|0.050602 light|0.050602 grey|0.050602 gainsboro|0.03912 black|0.024831 white|0.011244 smoke|0.011244 alice|0.0058892 blue|0.0058892 lavender|0.0058404 blush|0.0058404 ghost|0.0056997 white|0.0056997 sea|0.0054616 shell|0.0054616 snow|0.005275 linen|0.0050609 white|0.0039653  "
		}
	}
}
