{
	"add": {
		"doc": {
			"id": "8e45561eec1cbcbde4b63129c452937da9fc2f2ebc13a3a530a383ef2803a1fd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/MiG-29SMT_on_the_MAKS-2009_%2801%29.jpg/220px-MiG-29SMT_on_the_MAKS-2009_%2801%29.jpg",
				"previous": "On 20 April 2008, Georgian officials claimed a Russian MiG-29 shot down a Georgian Hermes 450 unmanned aerial vehicle and provided video footage from the ill-fated drone showing an apparent MiG-29 launching an air-to-air missile at it. Russia denies that the aircraft was theirs and says they did not have any pilots in the air that day. Abkhazia’s administration claimed its own forces shot down the drone with an L-39 aircraft \"because it was violating Abkhaz airspace and breaching ceasefire agreements.\"[26] UN investigation concluded that the video was authentic and that the drone was shot down by a Russian MiG-29 or Su-27 using a R-73 heat seeking missile.[27]",
				"after": "The Russian Air Force grounded all its MiG-29s following a crash in Siberia on 17 October 2008.[28] Following a second crash with an MiG-29 in east Siberia in December 2008,[29][30] Russian officials admitted that most MiG-29 fighters in the Russian Air Force were incapable of performing combat duties due to poor maintenance. The age of the aircraft was also an important factor as about 70% of the MiGs were considered to be too old to take to the skies.[31] The Russian MiG-29s have not received updates since the collapse of the Soviet Union. This is because the Russian Air Force chose to upgrade the Su-27 and MiG-31 instead. On 4 February 2009, the Russian Air Force resumed flights with the MiG-29.[32] However, in March 2009, 91 MiG-29s of the Russian Air Force required repair after inspections due to corrosion; approximately 100 MiGs were cleared to continue flying at the time.[33][34] The Russian Air Force started an update of its early MiG-29s to the more current MiG-29SMT standard,[35] but financial difficulties prevented delivery of more than three MiG-29 SMT upgrade to the Russian Air Force.[36] Instead, the 35 MiG-29SMT/UBTs rejected by Algeria were bought by the Russian Air Force.[37][verification needed] Russia placed an order for 16 new-build MiG-29SMTs on 15 April 2014, with delivery expected by 2017.[38]",
			"color": "dim|0.16745 gray|0.16745 dim|0.16745 grey|0.16745 black|0.15724 dark|0.1523 gray|0.1523 dark|0.1523 grey|0.1523 gray|0.15174 grey|0.15174 light|0.065254 slate|0.065254 gray|0.065254 silver|0.058419 slate|0.050601 gray|0.050601 light|0.033252 gray|0.033252 light|0.033252 grey|0.033252 gainsboro|0.023177 tan|0.016718 maroon|0.011858 dark|0.010041 slate|0.010041 gray|0.010041 lavender|0.0092694 light|0.0072793 steel|0.0072793 blue|0.0072793  "
		}
	}
}
