{
	"add": {
		"doc": {
			"id": "8e496e127bf1c6ad7997249731aecd3065f3186144a7a7a8b6b045e67bafe866",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Iguanodon_28-12-2007_14-18-33.jpg/170px-Iguanodon_28-12-2007_14-18-33.jpg",
				"previous": "The science of conserving fossil remains was in its infancy, and new techniques had to be improvised to deal with what soon became known as \"pyrite disease\". Crystalline pyrite in the bones was being oxidized to iron sulphate, accompanied by an increase in volume that caused the remains to crack and crumble. When in the ground, the bones were isolated by anoxic moist clay that prevented this from happening, but when removed into the drier open air, the natural chemical conversion began to occur. To limit this effect, De Pauw immediately, in the mine-gallery, re-covered the dug-out fossils with wet clay, sealing them with paper and plaster reinforced by iron rings, forming in total about six hundred transportable blocks with a combined weight of a hundred and thirty tons. In Brussels after opening the plaster he impregnated the bones with boiling gelatine mixed with oil of cloves as a preservative. Removing most of the visible pyrite he then hardened them with hide glue, finishing with a final layer of tin foil. Damage was repaired with papier-mâché.[60] This treatment had the unintended effect of sealing in moisture and extending the period of damage. In 1932 museum director Victor van Straelen decided that the specimens had to be completely restored again to safeguard their preservation. From December 1935 to August 1936 the staff at the museum in Brussels treated the problem with a combination of alcohol, arsenic, and 390 kilograms of shellac. This combination was intended to simultaneously penetrate the fossils (with alcohol), prevent the development of mold of (with arsenic), and harden them (with shellac). The fossils entered a third round of conservation from 2003 until May 2007, when the shellac, hide glue and gelatine were removed and impregnated with polyvinyl acetate and cyanoacrylate and epoxy glues.[61] Modern treatments of this problem typically involve either monitoring the humidity of fossil storage, or, for fresh specimens, preparing a special coating of polyethylene glycol that is then heated in a vacuum pump, so that moisture is immediately removed and pore spaces are infiltrated with polyethelene glycol to seal and strengthen the fossil.[5]",
				"after": "Dollo's specimens allowed him to show that Owen's prehistoric pachyderms were not correct for Iguanodon. He instead modelled the skeletal mounts after the cassowary and wallaby, and put the spike that had been on the nose firmly on the thumb.[62][63] He was not completely correct, but he also had the disadvantage of being faced with some of the first complete dinosaur remains. A problem that was later recognised was the bend he introduced into the tail. This organ was more or less straight, as shown by the skeletons he was excavating, and the presence of ossified tendons. In fact, to get the bend in the tail for a more wallaby or kangaroo-like posture, the tail would have had to be broken. With its correct, straight tail and back, the animal would have walked with its body held horizontal to the ground, arms in place to support the body if needed.[5]",
			"color": "dark|0.20671 gray|0.20671 dark|0.20671 grey|0.20671 silver|0.13238 gray|0.10878 grey|0.10878 dim|0.081062 gray|0.081062 dim|0.081062 grey|0.081062 light|0.064215 gray|0.064215 light|0.064215 grey|0.064215 light|0.063319 slate|0.063319 gray|0.063319 slate|0.055704 gray|0.055704 gainsboro|0.040175 black|0.036863 light|0.027526 steel|0.027526 blue|0.027526 light|0.018106 blue|0.018106 corn|0.014913 flower|0.014913 blue|0.014913 beige|0.010778 steel|0.010612 blue|0.010612 white|0.010044 smoke|0.010044 powder|0.0088435 blue|0.0088435 honeydew|0.0081575 linen|0.007919 alice|0.0074202 blue|0.0074202 mint|0.0072199 cream|0.0072199 lavender|0.0070649 azure|0.0065986 old|0.005825 lace|0.005825 floral|0.0057501 white|0.0057501 sea|0.0053114 shell|0.0053114 ghost|0.0049762 white|0.0049762 snow|0.0048686 antique|0.0046885 white|0.0046885 light|0.00458 cyan|0.00458 white|0.0045287 ivory|0.0044144  "
		}
	}
}
