{
	"add": {
		"doc": {
			"id": "8e567fa88e7ed6104c727bd382eb0ff6c2714c7507d78fee7dcfe286d3a36a65",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Sulphur-crested_Cockatoos_damaging_a_shopping_centre_facade_4.jpg/220px-Sulphur-crested_Cockatoos_damaging_a_shopping_centre_facade_4.jpg",
				"previous": "Several species of cockatoo can be serious agricultural pests.[81] They are sometimes controlled by shooting, poisoning or capture followed by gassing. Non-lethal damage mitigation methods used include scaring, habitat manipulation and the provision of decoy food dumps or sacrifice crops to distract them from the main crop. They can be a nuisance in urban areas due to destruction of property. They maintain their bills in the wild by chewing on wood but, in suburbia, they may chew outdoor furniture, door and window frames;[51] soft decorative timbers such as Western Red Cedar are readily demolished.[82] Birds may also target external wiring and fixtures such as solar water heaters,[51] television antennae and satellite dishes.[82] A business in central Melbourne suffered as sulphur-crested cockatoos repeatedly stripped the silicone sealant from the plate glass windows.[83] Galahs and red-tailed black cockatoos have stripped electrical cabling in rural areas and tarpaulin is targeted elsewhere.[83] Outside Australia, the Tanimbar corella is a pest on Yamdena Island where it raids maize crops.[84]",
				"after": "In 1995 the Government of the state of Victoria published a report on problems caused by long-billed corellas, sulphur-crested cockatoos and galahs, three species which, along with the little corella, have large and growing populations, having benefited from anthropogenic changes to the landscape. Subsequent to the findings and publication of the report, these three species were declared unprotected by a Governor in Council Order under certain conditions and are allowed to be destroyed where serious damage is being caused by them to trees, vineyards, orchards, recreational reserves and commercial crops.[85] Damage covered by the report included not only that to cereal crops, fruit and nut orchards and some kinds of vegetable crops but also to houses and communications equipment.[86] The little corella is a declared pest of agriculture in Western Australia, where it is an aviculturally introduced species. The birds damage sorghum, maize, sunflower, chickpeas and other crops. They also defoliate amenity trees in parks and gardens, dig for edible roots and corms on sports grounds and race tracks, as well as chew wiring and household fittings.[87] In South Australia, where flocks can number several thousand birds and the species is listed as unprotected, they are accused of defoliating red gums and other native or ornamental trees used for roosting, damaging tarpaulins on grain bunkers, wiring and flashing on buildings, taking grain from newly seeded paddocks and creating a noise nuisance.[88]",
			"color": "gainsboro|0.11983 light|0.11393 gray|0.11393 light|0.11393 grey|0.11393 silver|0.084619 dark|0.077057 gray|0.077057 dark|0.077057 grey|0.077057 gray|0.071472 grey|0.071472 white|0.056157 smoke|0.056157 dim|0.055203 gray|0.055203 dim|0.055203 grey|0.055203 lavender|0.051373 blush|0.051373 alice|0.04937 blue|0.04937 ghost|0.049311 white|0.049311 snow|0.043473 sea|0.040584 shell|0.040584 lavender|0.040082 white|0.039683 mint|0.032214 cream|0.032214 azure|0.028391 floral|0.020273 white|0.020273 linen|0.01638  "
		}
	}
}
