{
	"add": {
		"doc": {
			"id": "8e70c0fe6f78a514a8c6fca5d2288f86898a2e6babbe3e1194ba88a465ae7f78",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/The_Earth_seen_from_Apollo_17.jpg/125px-The_Earth_seen_from_Apollo_17.jpg",
				"previous": "Venus was the first target of interplanetary flyby and lander missions and, despite one of the most hostile surface environments in the Solar System, has had more landers sent to it (nearly all from the Soviet Union) than any other planet in the Solar System. The first successful Venus flyby was the American Mariner 2 spacecraft, which flew past Venus in 1962. Mariner 2 has been followed by several other flybys by multiple space agencies often as part of missions using a Venus flyby to provide a gravitational assist en route to other celestial bodies. In 1967 Venera 4 became the first probe to enter and directly examine the atmosphere of Venus. In 1970 Venera 7 became the first successful lander to reach the surface of Venus and by 1985 it had been followed by eight additional successful Soviet Venus landers which provided images and other direct surface data. Starting in 1975 with the Soviet orbiter Venera 9 some ten successful orbiter missions have been sent to Venus, including later missions which were able to map the surface of Venus using radar to pierce the obscuring atmosphere.",
			"after": [],
			"color": "light|0.21188 steel|0.21188 blue|0.21188 slate|0.14902 gray|0.14902 light|0.14527 slate|0.14527 gray|0.14527 lavender|0.10078 dark|0.057789 gray|0.057789 dark|0.057789 grey|0.057789 dim|0.048197 gray|0.048197 dim|0.048197 grey|0.048197 silver|0.036897 gray|0.032216 grey|0.032216 light|0.030001 gray|0.030001 light|0.030001 grey|0.030001 gainsboro|0.029635 thistle|0.024551 alice|0.022905 blue|0.022905 ghost|0.021405 white|0.021405 white|0.015915 smoke|0.015915 lavender|0.013296 blush|0.013296 snow|0.011559 white|0.010117 azure|0.0090312 mint|0.0073273 cream|0.0073273 sea|0.0068516 shell|0.0068516 rosy|0.0055862 brown|0.0055862 floral|0.005343 white|0.005343  "
		}
	}
}
