{
	"add": {
		"doc": {
			"id": "8e8621fb3c518a06ce77403f76a5c838e4043df1a373b2aa1696db982b34b170",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Evergreen_clocktower.jpg/220px-Evergreen_clocktower.jpg",
				"previous": "In 1969, the Project Management Institute (PMI) was formed to serve the interest of the project management industry. The premise of PMI is that the tools and techniques of project management are common even among the widespread application of projects from the software industry to the construction industry. In 1981, the PMI Board of Directors authorized the development of what has become A Guide to the Project Management Body of Knowledge (PMBOK), containing the standards and guidelines of practice that are widely used throughout the profession. The International Project Management Association (IPMA), founded in Europe in 1967, has undergone a similar development and instituted the IPMA Project Baseline. Both organizations are now participating in the development of a global project management standard.",
				"after": "Although relatively rare compared with collaboration in popular music, there have been some notable examples of music written in collaboration between classical composers. Perhaps the best-known examples are:",
			"color": "light|0.29546 steel|0.29546 blue|0.29546 light|0.11518 gray|0.11518 light|0.11518 grey|0.11518 light|0.10769 blue|0.10769 gainsboro|0.098137 silver|0.069371 tan|0.051246 sky|0.043303 blue|0.043303 dim|0.021886 gray|0.021886 dim|0.021886 grey|0.021886 white|0.020476 smoke|0.020476 gray|0.0196 grey|0.0196 lavender|0.01941 alice|0.017205 blue|0.017205 dark|0.013771 gray|0.013771 dark|0.013771 grey|0.013771 ghost|0.012862 white|0.012862 powder|0.011467 blue|0.011467 snow|0.0088912 lavender|0.0074769 blush|0.0074769 white|0.0070216 sea|0.0070173 shell|0.0070173 mint|0.0065487 cream|0.0065487 azure|0.006364 black|0.0060587 light|0.005248 sky|0.005248 blue|0.005248 linen|0.0052005 floral|0.0047915 white|0.0047915  "
		}
	}
}
