{
	"add": {
		"doc": {
			"id": "8e97be55be614d962cef70959357dbe6ebe10bc0bf855289b73d6d003873e0af",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/1/1c/Why_are_we_interested_in_HTTP.png/220px-Why_are_we_interested_in_HTTP.png",
				"previous": "The plaintiffs are the Wikimedia Foundation,[7] the National Association of Criminal Defense Lawyers, Human Rights Watch, Amnesty International USA, the PEN American Center, the Global Fund for Women, The Nation magazine,[8] the Rutherford Institute, and the Washington Office on Latin America.[5][9]",
				"after": "Upstream surveillance was first revealed by Edward Snowden, a former NSA analyst.[10] A previous challenge by the ACLU, Clapper v. Amnesty International USA, failed for lack of standing, but Wikimedia and the ACLU believe their new lawsuit will succeed in the light of Snowden's disclosures, citing a classified NSA slide that specifically referred to Wikipedia.[11] Since Clapper, the government itself has confirmed many of the key facts about NSA's upstream surveillance, including that it conducts suspicionless searches.[7] ACLU attorney Patrick Toomey noted the lawsuit is particularly relevant as the plaintiffs engage in \"hundreds of billions of international communications\" annually. Any program of upstream surveillance must necessarily sweep up a substantial part of these communications.[7][12]",
			"color": "dim|0.13389 gray|0.13389 dim|0.13389 grey|0.13389 gray|0.12082 grey|0.12082 dark|0.1043 gray|0.1043 dark|0.1043 grey|0.1043 black|0.099338 silver|0.054282 light|0.045907 gray|0.045907 light|0.045907 grey|0.045907 gainsboro|0.040872 slate|0.03595 gray|0.03595 white|0.02528 smoke|0.02528 light|0.023808 slate|0.023808 gray|0.023808 light|0.020816 steel|0.020816 blue|0.020816 alice|0.020451 blue|0.020451 ghost|0.019739 white|0.019739 snow|0.018857 sea|0.018688 shell|0.018688 white|0.016778 lavender|0.016139 blush|0.016139 steel|0.015832 blue|0.015832 mint|0.01514 cream|0.01514 sienna|0.014357 floral|0.01305 white|0.01305 azure|0.012642  "
		}
	}
}
