{
	"add": {
		"doc": {
			"id": "8ead47a72561e3bdd4684eca6e21d3bdc85cbae1926b89f4300c42f86f92af6f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Everglades_Nat%27l_Park_Mangrove.jpg/220px-Everglades_Nat%27l_Park_Mangrove.jpg",
				"previous": "Cypress trees are conifers that are adapted to live in standing fresh water. They grow in compact structures called cypress domes and in long strands over limestone. Water levels may fluctuate dramatically around cypress domes and strands, so cypresses develop \"knees\" that protrude from the water at high levels to provide oxygen for the root systems. Dwarf cypress trees grow in drier areas with poorer soil. Epiphytes, such as bromeliads, Spanish moss (Tillandsia usneoides), orchids and ferns grow on the branches and trunks of cypress trees. Everglades National Park features twenty-five species of orchids.[35] Tall cypress trees provide excellent nesting areas for birds including wild turkeys (Meleagris gallopavo), ibis, herons, egrets, anhingas (Anhinga anhinga), and belted kingfishers (Megaceryle alcyon). Mammals in cypress regions include white-tailed deer, squirrels, raccoons, opossums, skunks, swamp rabbits, river otters (Lontra canadensis), and bobcats, as well as small rodents.[36][37]",
				"after": "Mangrove trees cover the coastlines of South Florida, sometimes growing inland depending on the amount of salt water present within the Everglades ecosystems. During dryer years when less fresh water flows to the coast, mangroves will appear among fresh water plants. When rain is abundant, sawgrass and other fresh water plants may be found closer to the coast. Three species of mangrove trees—red (Rhizophora mangle), black (Avicennia germinans), and white (Laguncularia racemosa)—can be found in the Everglades. Due to their high tolerance of salt water, winds, extreme tides, high temperatures, and muddy soils, mangrove trees are uniquely adapted to extreme conditions. They act as nurseries for many marine and bird species. They are also Florida's first defense against the destructive forces of hurricanes, absorbing flood waters and preventing coastal erosion.[38] The mangrove system in Everglades National Park is the largest continuous system of mangroves in the world.[39]",
			"color": "silver|0.17022 dark|0.16489 gray|0.16489 dark|0.16489 grey|0.16489 light|0.13844 gray|0.13844 light|0.13844 grey|0.13844 gainsboro|0.09544 gray|0.095439 grey|0.095439 dim|0.08012 gray|0.08012 dim|0.08012 grey|0.08012 black|0.076051 antique|0.044785 white|0.044785 light|0.023377 steel|0.023377 blue|0.023377 linen|0.019865 beige|0.012452 old|0.010722 lace|0.010722 papaya|0.0095792 whip|0.0095792 sea|0.0062918 shell|0.0062918 white|0.0059535 smoke|0.0059535 blanched|0.0052147 almond|0.0052147 floral|0.0048767 white|0.0048767  "
		}
	}
}
