{
	"add": {
		"doc": {
			"id": "8eb741f2b1de1c125729e05fb9c5b57207926d393fd6b4fb0072f7d4547c5aa1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Vadaspark_Madarak_01.jpg/220px-Vadaspark_Madarak_01.jpg",
				"previous": "Sexual dimorphism in beak size may have affected behaviour. Such dimorphism is common in other parrots, for example in the palm cockatoo and the New Zealand kaka, and in species where it occurs, the sexes prefer food of different sizes, the males use their beaks in rituals, or the sexes have specialised roles in nesting and rearing. Similarly, the large difference between male and female head size may have been reflected in the ecology of each sex, though it is impossible to determine how.[5][22]",
				"after": "Masauji Hachisuka suggested the broad-billed parrot was nocturnal, like the kakapo and the night parrot, two extant ground-dwelling parrots. Contemporary accounts do not corroborate this, and the orbits are of similar size to those of other large diurnal parrots.[5] The broad-billed parrot was recorded on the dry leeward side of Mauritius, which was the most accessible for people, and it was noted that birds were more abundant near the coast, which may indicate that the fauna of such areas was more diverse. It may have nested in tree cavities or rocks, like the Cuban amazon. The terms raven or crow may have been suggested by the bird's harsh call, its behavioural traits, or just its dark plumage.[5] The following description by Jacob Granaet from 1666 mentions some of the broad-billed parrot's co-inhabitants of the forests, and might indicate its demeanour:",
			"color": "dark|0.11908 gray|0.11908 dark|0.11908 grey|0.11908 light|0.1023 blue|0.1023 dim|0.096421 gray|0.096421 dim|0.096421 grey|0.096421 silver|0.092945 gray|0.081423 grey|0.081423 dark|0.067293 slate|0.067293 gray|0.067293 light|0.055801 steel|0.055801 blue|0.055801 light|0.05459 gray|0.05459 light|0.05459 grey|0.05459 light|0.046526 slate|0.046526 gray|0.046526 powder|0.044919 blue|0.044919 slate|0.042982 gray|0.042982 gainsboro|0.041447 alice|0.023435 blue|0.023435 azure|0.016817 light|0.016627 cyan|0.016627 black|0.015926 white|0.013641 smoke|0.013641 mint|0.011854 cream|0.011854 ghost|0.011089 white|0.011089 white|0.0084262 snow|0.0077253 floral|0.0051233 white|0.0051233 sea|0.0050123 shell|0.0050123 lavender|0.0046135  "
		}
	}
}
