{
	"add": {
		"doc": {
			"id": "8ec481627fcf0687b984889f25ab2acf0215be8fec658deedf267a574181c764",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Civil_Jack_of_the_United_Kingdom.svg/220px-Civil_Jack_of_the_United_Kingdom.svg.png",
			"previous": [],
				"after": "The flag in a white border occasionally seen on merchant ships was sometimes referred to as the Pilot Jack. It can be traced back to 1823 when it was created as a signal flag, never intended as a civil jack. A book[clarification needed] issued to British consuls in 1855 states that the white bordered Union Flag is to be hoisted for a pilot. Although there was some ambiguity regarding the legality of it being flown for any other purpose on civilian vessels, its use as an ensign or jack was established well in advance of the 1864 Act that designated the Red Ensign for merchant shipping. In 1970, the white-bordered Union Flag ceased to be the signal for a pilot, but references to it as national colours were not removed from the current Merchant Shipping Act and it was legally interpreted as a flag that could be flown on a merchant ship, as a jack if desired. This status was confirmed to an extent by the Merchant Shipping (Registration, etc.) Act 1993 and the consolidating Merchant Shipping Act 1995 which, in Section 4, Subsection 1, prohibits the use of any distinctive national colours or those used or resembling flags or pendants on Her Majesty's Ships, \"except the Red Ensign, the Union flag (commonly known as the Union Jack) with a white border\", and some other exceptions permitted elsewhere in the Acts. However, Section 2 regards the 'British flag', and states that \"The flag which every British ship is entitled to fly is the Red Ensign (without any defacement or modification) and, subject to (a warrant from Her Majesty or from the Secretary of State, or an Order of Council from her Majesty regarding a defaced Red Ensign), no other colours.\"[67] The ultimate determination of legality, however, is that many civil vessels routinely fly the white bordered Union Flag without official opposition, making it the de facto Civil Jack.[citation needed]",
			"color": "midnight|0.39426 blue|0.39426 crimson|0.34901 light|0.033928 steel|0.033928 blue|0.033928 misty|0.026495 rose|0.026495 snow|0.016221 white|0.016114 ghost|0.016108 white|0.016108 white|0.016092 smoke|0.016092 alice|0.015395 blue|0.015395 mint|0.015288 cream|0.015288 sea|0.015039 shell|0.015039 floral|0.015007 white|0.015007 azure|0.014761 lavender|0.013997 blush|0.013997 pink|0.010618 light|0.009605 pink|0.009605 light|0.0054232 coral|0.0054232 ivory|0.0046679 lavender|0.0041923  "
		}
	}
}
