{
	"add": {
		"doc": {
			"id": "8ed939c16fd3056140e2d933cc9591274140507d67e0fc77fc39f505e8c36e0e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Woolly_mammoth.jpg/220px-Woolly_mammoth.jpg",
				"previous": "Woolly mammoths had several adaptations to the cold, most noticeably the layer of fur covering all parts of the body. Other adaptations to cold weather include ears that are far smaller than those of modern elephants; they were about 38 cm (15 in) long and 18–28 cm (7.1–11.0 in) across, and the ear of the 6–12 month old frozen calf \"Dima\" was under 13 cm (5.1 in) long. The small ears reduced heat loss and frostbite, and the tail was short for the same reason, only 36 cm (14 in) long in the \"Berezovka mammoth\". The tail contained 21 vertebrae, whereas the tails of modern elephants contain 28–33. Their skin was no thicker than that of present-day elephants, between 1.25 and 2.5 cm (0.49 and 0.98 in). They had a layer of fat up to 10 cm (3.9 in) thick under the skin, which helped to keep them warm. Woolly mammoths had broad flaps of skin under their tails which covered the anus; this is also seen in modern elephants.[33]",
				"after": "Other characteristic features depicted in cave paintings include a large, high, single-domed head and a sloping back with a high shoulder hump; the shape resulting from the spinous processes of the back vertebrae decreasing in length from front to rear. These features were not present in juveniles, which had convex backs like Asian elephants. Another feature shown in cave paintings was confirmed by the discovery of a frozen specimen in 1924, an adult nicknamed the \"Middle Kolyma mammoth\", which was preserved with a complete trunk tip. Unlike the trunk lobes of modern elephants, the upper \"finger\" at the tip of the trunk had a long pointed lobe and was 10 cm (3.9 in) long, while the lower \"thumb\" was 5 cm (2.0 in) and was broader. The trunk of \"Dima\" was 76 cm (2.49 ft) long, whereas the trunk of the adult \"Liakhov mammoth\" was 2 metres (6.6 ft) long.[33] The well preserved trunk of a juvenile specimen nicknamed \"Yuka\" was described in 2015, and it was shown that it possessed a fleshy expansion a third above the tip. Rather than oval as the rest of the trunk, this part was ellipsoidal in cross section, and double the size in diameter. The feature was also shown to be present in two other specimens, of different sexes and ages.[34]",
			"color": "black|0.44492 dim|0.29591 gray|0.29591 dim|0.29591 grey|0.29591 gray|0.11955 grey|0.11955 dark|0.029875 gray|0.029875 dark|0.029875 grey|0.029875 dark|0.010975 khaki|0.010975 silver|0.010257 slate|0.0095919 gray|0.0095919 dark|0.0090846 slate|0.0090846 gray|0.0090846 dark|0.0085774 sea|0.0085774 green|0.0085774 light|0.008147 slate|0.008147 gray|0.008147  "
		}
	}
}
