{
	"add": {
		"doc": {
			"id": "8edf0b211f040c57587398a9b0cda618730aa61070118e912b74e53a25817bb1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/UCR_Belltower_night.JPG/220px-UCR_Belltower_night.JPG",
				"previous": "Further major construction largely ceased on the site until the groundbreaking for the College of Letters and Science (CHASS) in April 1951. A group of five buildings designed by different architects in a decidedly more Modern style were completed by 1954: the Rivera Library, Webber Hall, Geology Building, Physical Education Building and Watkins Hall. After the Regents declared UCR a \"general campus\" of the UC system in 1958, many new buildings and additions were laid out over the following decade. Following an east–west axis, new student residence halls and athletic facilities were developed along the southeastern quadrant of the main campus, while academic and research facilities were built along the central campus area closer to the freeway.[31] The Bell Tower, one of only five carillons in California, was built in this period. Designed by A. Quincy Jones, the tower is 161 ft (49 m) tall and contains 48 bells, each weighing from 28 pounds (13 kg) to 5,091 pounds (2,309 kg), covering four chromatic octaves.[38]",
				"after": "After the drop in enrollment and subsequent restructuring of academic programs in the 1970s, little capacity construction was undertaken over the next two decades. However, enrollment growth in the late 1980s justified considerable further campus expansion over the 1990s. Major additions built in the period include: Bourns Hall, completed in 1995; the Humanities & Social Science building, completed in 1996; and the Science Library, completed in 1998. The Pentland and Stonehaven residence halls were completed in 2000, and the Arts building was completed in 2001.[31] Active construction projects include new buildings for Engineering and Materials Science, Psychology Research, and Genomics.[39][40] The first phase of a new Commons was completed in 2007, and phase II is in development. Other ongoing projects include a new CHASS Instructional and Research Center and Students Academic Support Services Building.[41] Since 1999, more than $730 million has been invested in construction projects.[7]",
			"color": "rosy|0.1753 brown|0.1753 dim|0.097663 gray|0.097663 dim|0.097663 grey|0.097663 gray|0.093002 grey|0.093002 black|0.085824 dark|0.080049 gray|0.080049 dark|0.080049 grey|0.080049 silver|0.046509 tan|0.038341 misty|0.037507 rose|0.037507 saddle|0.031817 brown|0.031817 peach|0.025423 puff|0.025423 light|0.024775 gray|0.024775 light|0.024775 grey|0.024775 peru|0.024724 sienna|0.019658 chocolate|0.014692 gainsboro|0.014567 antique|0.014553 white|0.014553 linen|0.013264  "
		}
	}
}
