{
	"add": {
		"doc": {
			"id": "8ee41ff643dd3c131e56f5754d57e0a51667910d36cf5587e7eca96f5f5d69e1",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Study_for_the_Head_of_George_Dyer.jpg/220px-Study_for_the_Head_of_George_Dyer.jpg",
				"previous": "Bacon's relationships prior to Dyer had all been with older men who were as tumultuous in temperament as the artist himself, but each had been the dominating presence. Peter Lacy, his first lover, would often tear up the young artist's paintings, beat him up in drunken rages, and leave him on the street half-conscious.[9] Bacon was attracted to Dyer's vulnerability and trusting nature. Dyer was impressed by Bacon's self-confidence and his artistic success, and Bacon acted as a protector and father figure to the insecure younger man.[10] Dyer was, like Bacon, a borderline alcoholic and similarly took obsessive care with his appearance. Pale-faced and a chain-smoker, Dyer typically confronted his daily hangovers by drinking again. His compact and athletic build belied a docile and inwardly tortured personality; the art critic Michael Peppiatt described him as having the air of a man who could \"land a decisive punch\". Their behaviours eventually overwhelmed their affair, and by 1970, Bacon was merely providing Dyer with enough money to stay more or less permanently drunk.[10]",
				"after": "As Bacon's work moved from the extreme subject matter of his early paintings to portraits of friends in the mid-1960s, Dyer became a dominating presence in the artist's work.[11] Bacon's treatment of his lover in these canvasses emphasises his subject's physicality while remaining uncharacteristically tender. More than any other of the artist's close friends portrayed during this period, Dyer came to feel inseparable from his effigies. The paintings gave him stature, a raison d'etre, and offered meaning to what Bacon described as Dyer's \"brief interlude between life and death\".[12] Many critics have cited Dyer's portraits as favourites, including Michel Leiris and Lawrence Gowling. Yet as Dyer's novelty diminished within Bacon's circle of sophisticated intellectuals, the younger man became increasingly bitter and ill at ease. Although Dyer welcomed the attention the paintings brought him, he did not pretend to understand or even like them. \"All that money an' I fink they're reely 'orrible\", he observed with choked pride.[13] He abandoned crime but soon descended into alcoholism. Bacon's money allowed Dyer to attract hangers-on who would accompany him on massive benders around London's Soho. Withdrawn and reserved when sober, Dyer was insuppressible when drunk, and would often attempt to \"pull a Bacon\" by buying large rounds and paying for expensive dinners for his wide circle. Dyer's erratic behaviour inevitably wore thin—with his cronies, with Bacon, and with Bacon's friends. Most of Bacon's art world associates regarded Dyer as a nuisance—an intrusion into the world of high culture to which their Bacon belonged.[14] Dyer reacted by becoming increasingly needy and dependent. By 1971, he was drinking alone and was only in occasional contact with his former lover.",
			"color": "dark|0.57961 slate|0.57961 gray|0.57961 rosy|0.08871 brown|0.08871 light|0.066795 slate|0.066795 gray|0.066795 gray|0.064204 grey|0.064204 dim|0.063316 gray|0.063316 dim|0.063316 grey|0.063316 slate|0.045207 gray|0.045207 dark|0.038639 gray|0.038639 dark|0.038639 grey|0.038639 silver|0.01825 indian|0.013145 red|0.013145 light|0.0093692 gray|0.0093692 light|0.0093692 grey|0.0093692  "
		}
	}
}
