{
	"add": {
		"doc": {
			"id": "8f0df2fa99183ac5153b0bbf1dcfe4833dbc9bf6d475fc6b0fedf4dd28fa1d1f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Trier_BW_2014-06-21_11-11-49.jpg/200px-Trier_BW_2014-06-21_11-11-49.jpg",
				"previous": "Karl Marx was born on 5 May 1818 to Heinrich Marx and Henrietta Pressburg (1788-1863). He was born at 664 Brückergasse in Trier, a town then part of the Kingdom of Prussia's Province of the Lower Rhine.[15] Ancestrally Jewish, his maternal grandfather was a Dutch rabbi, while his paternal line had supplied Trier's rabbis since 1723, a role taken by his grandfather Meier Halevi Marx.[16] Karl's father, as a child known as Herschel, was the first in the line to receive a secular education; he became a lawyer and lived a relatively wealthy and middle-class existence, with his family owning a number of Moselle vineyards. Prior to his son's birth, and to escape the constraints of anti-semitic legislation, Herschel converted from Judaism to Lutheranism, the main Protestant denomination in Germany and Prussia at the time, taking on the German forename of Heinrich over the Yiddish Herschel.[17]",
				"after": "Largely non-religious, Heinrich was a man of the Enlightenment, interested in the ideas of the philosophers Immanuel Kant and Voltaire. A classical liberal, he took part in agitation for a constitution and reforms in Prussia, then governed by an absolute monarchy.[19] In 1815 Heinrich Marx began work as an attorney, in 1819 moving his family to a ten-room property near the Porta Nigra.[20] His wife, a Dutch Jewish woman, Henrietta Pressburg, was semi-literate and was said to suffer from \"excessive mother love\", devoting much time to her family and insisting on cleanliness within her home.[21] She was from a prosperous business family that later founded the company Philips Electronics: she was great-aunt to Anton and Gerard Philips, and great-great-aunt to Frits Philips. Her sister Sophie Presburg 1797-1854,was Marx's aunt and was married to Lion Philips 1794-1866 Marx's uncle through this marriage,and was the grandfather of both Gerald and Anton Philips. Lion Philips was a wealthy Dutch Tobacco manufacturer and industrialist, upon whom Karl and Jenny Marx would later often come to rely for loans while they were exiled in London.[22] In contrast to her husband, Henrietta retained her Jewish faith.[23]",
			"color": "dim|0.18705 gray|0.18705 dim|0.18705 grey|0.18705 gray|0.18098 grey|0.18098 black|0.12157 dark|0.098493 gray|0.098493 dark|0.098493 grey|0.098493 slate|0.080291 gray|0.080291 silver|0.079338 light|0.07473 gray|0.07473 light|0.07473 grey|0.07473 gainsboro|0.064766 light|0.063786 slate|0.063786 gray|0.063786 lavender|0.015384 light|0.0065475 steel|0.0065475 blue|0.0065475 white|0.0052109 smoke|0.0052109 thistle|0.004584  "
		}
	}
}
