{
	"add": {
		"doc": {
			"id": "8f0eb2d1e14b4e245aafd39fcaec8abf55044bcac3b3eb8eef6ca514002d3760",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/F4F-3_new_pitot_tube_of_later_model.jpg/220px-F4F-3_new_pitot_tube_of_later_model.jpg",
				"previous": "Major air combat during the war in the Pacific began with the entry of the Western Allies following Japan's attack against Pearl Harbor. The Imperial Japanese Navy Air Service primarily operated the Mitsubishi A6M Zero, and the Imperial Japanese Army Air Service flew the Nakajima Ki-27 and the Nakajima Ki-43, initially enjoying great success, as these fighters generally had better range, maneuverability, speed and climb rates than their Allied counterparts.[10][11] Additionally, Japanese pilots had received excellent training and many were combat veterans from Japan's campaigns in China. They quickly gained air superiority over the Allies, who at this stage of the war were often disorganized, under-trained and poorly equipped, and Japanese air power contributed significantly to their successes in the Philippines, Malaysia and Singapore, the Dutch East Indies and Burma.",
				"after": "By mid-1942, the Allies began to regroup and while some Allied aircraft such as the Brewster Buffalo and the P-39 were hopelessly outclassed by fighters like Japan's Zero, others such as the Army's P-40 and the Navy's Wildcat possessed attributes such as superior firepower, ruggedness and dive speed, and the Allies soon developed tactics (such as the Thach weave) to take advantage of these strengths. These changes soon paid dividends, as the Allied ability to deny Japan air superiority was critical to their victories at Coral Sea, Midway, Guadalcanal and New Guinea. In China, the Flying Tigers also used the same tactics with some success, although they were unable to stem the tide of Japanese advances there.",
			"color": "slate|0.32968 gray|0.32968 light|0.25183 slate|0.25183 gray|0.25183 black|0.14585 gray|0.12862 grey|0.12862 dim|0.075704 gray|0.075704 dim|0.075704 grey|0.075704 dark|0.044865 gray|0.044865 dark|0.044865 grey|0.044865 silver|0.0063246  "
		}
	}
}
