{
	"add": {
		"doc": {
			"id": "8f1cfa6ac54a8f170ade7c72a6a3effb84f0db0a8dd6fb3952fb9f674783008f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Edmontosaurus_annectens_specimen.jpg/220px-Edmontosaurus_annectens_specimen.jpg",
				"previous": "Edmontosaurus itself was coined in 1917 by Lawrence Lambe for two partial skeletons found in the Horseshoe Canyon Formation (formerly the lower Edmonton Formation) along the Red Deer River of southern Alberta, Canada.[45] These rocks are older than the rocks in which Claosaurus annectens was found.[9] The Edmonton Formation lends Edmontosaurus its name.[32] The type species, E. regalis (\"regal,\" or, more loosely, \"king-sized\"),[32] is based on NMC 2288, consisting of a skull, articulated vertebrae up to the sixth tail vertebra, ribs, partial hips, an upper arm bone, and most of a hind limb. It was discovered in 1912 by Levi Sternberg. The second specimen, paratype NMC 2289, consists of a skull and skeleton lacking the beak, most of the tail, and part of the feet. It was discovered in 1916 by George F. Sternberg. Lambe found that his new dinosaur compared best to Diclonius mirabilis (specimens now assigned to Edmontosaurus annectens), and drew attention to the size and robustness of Edmontosaurus.[45] Initially, Lambe only described the skulls of the two skeletons, but returned to the genus in 1920 to describe the skeleton of NMC 2289.[2] The postcrania of the type specimen remains undescribed, still in its plaster jackets.[6]",
				"after": "Two more species that would come to be included with Edmontosaurus were named from Canadian remains in the 1920s, but both would initially be assigned to Thespesius. Gilmore named the first, Thespesius edmontoni, in 1924. T. edmontoni also came from the Horseshoe Canyon Formation. It was based on NMC 8399, another nearly complete skeleton lacking most of the tail. NMC 8399 was discovered on the Red Deer River in 1912 by a Sternberg party.[3] Its forelimbs, ossified tendons, and skin impressions were briefly described in 1913 and 1914 by Lambe, who at first thought it was an example of a species he'd named Trachodon marginatus,[46] but then changed his mind.[47] The specimen became the first dinosaur skeleton to be mounted for exhibition in a Canadian museum. Gilmore found that his new species compared closely to what he called Thespesius annectens, but left the two apart because of details of the arms and hands. He also noted that his species had more vertebrae than Marsh's in the back and neck, but proposed that Marsh was mistaken in assuming that the annectens specimens were complete in those regions.[3]",
			"color": "dim|0.14319 gray|0.14319 dim|0.14319 grey|0.14319 gray|0.12181 grey|0.12181 dark|0.074415 gray|0.074415 dark|0.074415 grey|0.074415 white|0.058066 smoke|0.058066 linen|0.055831 gainsboro|0.055095 sea|0.054506 shell|0.054506 snow|0.051306 ghost|0.048894 white|0.048894 lavender|0.047231 blush|0.047231 floral|0.047216 white|0.047216 light|0.041749 gray|0.041749 light|0.041749 grey|0.041749 white|0.04174 alice|0.039882 blue|0.039882 silver|0.037001 black|0.035804 mint|0.025322 cream|0.025322 old|0.010315 lace|0.010315 azure|0.0059146 misty|0.0029751 rose|0.0029751  "
		}
	}
}
