{
	"add": {
		"doc": {
			"id": "8f2a0417973150264af22e618978daffa75197354ac48dcd8d57bfe85fd4b159",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Drosera_regia_leaf_Darwiniana.jpg/220px-Drosera_regia_leaf_Darwiniana.jpg",
			"previous": [
				"",
				"The tentacle-covered leaves can capture large prey, such as beetles, moths, and butterflies. The tentacles of all Drosera species are specialised stalked glands on the leaf's upper surface that produce a sticky mucilage. The leaves are considered active flypaper traps that respond to captured prey by bending to surround it. In its native fynbos habitat, the plants compete for space with native marsh grasses and low evergreen shrubs. Of the two known populations of D. regia, the higher altitude site appears to be overgrown and is essentially extirpated. The lower altitude site is estimated to have about 50 mature plants, making it the most endangered Drosera species, since it is threatened with extinction in the wild. It is often cultivated by carnivorous plant enthusiasts, and a single cultivar has been registered."
			],
				"after": "Drosera regia plants are fairly large herbs that produce horizontal woody rhizomes and a crown of large, linear leaves up to 70 cm (28 in) long and 2 cm (0.8 in) wide. The leaves possess stalked glands (tentacles) on the upper surface of the lamina along nearly the entire length of the leaf. The leaves lack petioles and stipules, emerging by circinate vernation (uncurling) and tapering to a filiform point. The tentacles and the leaf itself are capable of responding to prey by bending toward insects trapped in the sticky mucilage produced by the glands. Leaves are even capable of folding over themselves several times. Each leaf can possess thousands of tentacles, which can aid in the retention of larger prey when combined with the leaf wrapping tightly around captured insects. In its native habitat, D. regia has been known to capture large beetles, moths and butterflies. Plants go dormant during the colder season and form a dormant bud, consisting of a tight cluster of short, immature leaves. Plants begin to break dormancy in mid-July with a typical growing season lasting from October to April, though this is variable and plants can continue growing year-round without dormancy.[1][2][3] Individual leaves die back but remain attached to the short stem, clothing the bottom portion of the plant in the blackened dead leaves of former years.[4]",
			"color": "gray|0.20814 grey|0.20814 dark|0.1819 gray|0.1819 dark|0.1819 grey|0.1819 dim|0.17014 gray|0.17014 dim|0.17014 grey|0.17014 silver|0.11852 light|0.067566 gray|0.067566 light|0.067566 grey|0.067566 gainsboro|0.045929 black|0.038139 rosy|0.026237 brown|0.026237 misty|0.024853 rose|0.024853 lavender|0.018523 blush|0.018523 white|0.011863 smoke|0.011863 sea|0.011382 shell|0.011382 linen|0.01074 snow|0.010466  "
		}
	}
}
