{
	"add": {
		"doc": {
			"id": "8f2b55a2526676da07677e8db78c1d4839f0af71de90a0b32a5cb50d222d59e6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Warren_County%2C_Indiana_map_from_1877_atlas.png/280px-Warren_County%2C_Indiana_map_from_1877_atlas.png",
				"previous": "The first county courthouse was a log house in Warrenton that belonged to (and was occupied by) Enoch Farmer, one of the county's earliest settlers. When the county seat moved to Williamsport, a log house belonging to the town's founder, William Harrison, served this purpose for several years. The first purpose-built courthouse was completed in 1835 at a cost of $2,000;[n 1] in 1872, it was replaced with a new building that cost $48,000.[n 2] The third courthouse was built in 1886, in a new section of town that grew around the newly constructed railroad. That building burned in 1907, and the fourth and current Warren County courthouse was completed on the same site in 1908 at a cost of $115,000.[20][n 3]",
				"after": "As the 19th century progressed, the United States government's Indian removal policy pushed Native American tribes west of the Mississippi River. In 1830, the Indian Removal Act was signed into law, and though that act did not directly address the Potawatomi people of Indiana, it led to several additional treaties that resulted in their removal. In what came to be known as the Potawatomi Trail of Death, about 860 Potawatomi Indians who had refused to leave were forced to move from Indiana to Kansas. On September 14, 1838, the group camped near Williamsport, and on September 15 they camped in the southwestern part of the county before moving into Illinois. Before reaching their destination in Kansas, over 40 of them had died, many of them children; two children died and were buried at the second Warren County campsite.[21]",
			"color": "wheat|0.14881 bisque|0.12928 peach|0.10865 puff|0.10865 blanched|0.10756 almond|0.10756 papaya|0.083506 whip|0.083506 tan|0.079488 antique|0.070424 white|0.070424 moccasin|0.066196 corn|0.050376 silk|0.050376 beige|0.03621 navajo|0.030895 white|0.030895 light|0.028461 golden|0.028461 rod|0.028461 yellow|0.028461 lemon|0.027524 chiffon|0.027524 light|0.013144 yellow|0.013144 light|0.011667 coral|0.011667 indian|0.0035001 red|0.0035001  "
		}
	}
}
