{
	"add": {
		"doc": {
			"id": "8f2dfec9f99af66a1825182e8124208cbbb63b07c2602446cd3e91d233007cec",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/LHSP_Pine_Creek.JPG/170px-LHSP_Pine_Creek.JPG",
				"previous": "Several species have been reintroduced to the gorge. White-tailed deer were imported from Michigan and released throughout Pennsylvania to reestablish what had once been a thriving population. The current population of deer in Pennsylvania are descended from the original stock introduced since 1906, after the lumbermen had moved out of the area.[60] The deer population has grown so much that today they exceed their carrying capacity in many areas. River otters were successfully reintroduced in 1983 and now breed in the gorge. Despite the otters' diet of 5 percent trout, some anglers fear the animals would deplete the game fish in the gorge.[58]",
				"after": "Fishers, medium-sized weasels, were reintroduced to Pine Creek Gorge as part of an effort to establish a healthy population of fishers in Pennsylvania.[59] Prior to the lumber era, fishers were numerous throughout the forests of Pennsylvania.[61] They are generalized predators and will hunt any smaller creatures in their territory, including porcupines.[58][62] Elk have been reintroduced west of the gorge in Clinton County and occasionally wander near the west rim of the canyon. Coyotes have come back on their own.[58] Invasive insect species in the gorge include gypsy moth larvae, which eat all the leaves off trees, especially oaks,[58] and hemlock woolly adelgids, which weaken and kill hemlocks. Invasive plant species include purple loosestrife and Japanese knotweed.[56]",
			"color": "light|0.21029 steel|0.21029 blue|0.21029 lavender|0.072755 gainsboro|0.072384 light|0.071884 gray|0.071884 light|0.071884 grey|0.071884 dim|0.068684 gray|0.068684 dim|0.068684 grey|0.068684 light|0.05827 slate|0.05827 gray|0.05827 light|0.055397 blue|0.055397 alice|0.046229 blue|0.046229 silver|0.042211 ghost|0.035922 white|0.035922 white|0.034558 smoke|0.034558 slate|0.034245 gray|0.034245 azure|0.028037 snow|0.023213 white|0.022494 mint|0.021271 cream|0.021271 dark|0.020608 gray|0.020608 dark|0.020608 grey|0.020608 dark|0.019848 slate|0.019848 gray|0.019848 lavender|0.014449 blush|0.014449 sea|0.014285 shell|0.014285 floral|0.012973 white|0.012973 light|0.0063101 cyan|0.0063101 ivory|0.0037841  "
		}
	}
}
