{
	"add": {
		"doc": {
			"id": "8f2f8422938b986f71e17297b77ec8774706e3da6f51346cf24524e2bea35f65",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Nature_cover%2C_November_4%2C_1869.jpg/170px-Nature_cover%2C_November_4%2C_1869.jpg",
			"previous": [],
				"after": "Not long after the conclusion of The Reader, a former editor, Norman Lockyer, decided to create a new scientific journal titled Nature,[12] taking its name from a line by William Wordsworth: \"To the solid ground of nature trusts the Mind that builds for aye\".[13] First owned and published by Alexander Macmillan, Nature was similar to its predecessors in its attempt to \"provide cultivated readers with an accessible forum for reading about advances in scientific knowledge.\"[12] Janet Browne has proposed that \"far more than any other science journal of the period, Nature was conceived, born, and raised to serve polemic purpose.\"[12] Many of the early editions of Nature consisted of articles written by members of a group that called itself the X Club, a group of scientists known for having liberal, progressive, and somewhat controversial scientific beliefs relative to the time period.[12] Initiated by Thomas Henry Huxley, the group consisted of such important scientists as Joseph Dalton Hooker, Herbert Spencer, and John Tyndall, along with another five scientists and mathematicians; these scientists were all avid supporters of Darwin's theory of evolution as common descent, a theory which, during the latter-half of the 19th century, received a great deal of criticism among more conservative groups of scientists.[14] Perhaps it was in part its scientific liberality that made Nature a longer-lasting success than its predecessors. John Maddox, editor of Nature from 1966 to 1973 as well as from 1980 to 1995, suggested at a celebratory dinner for the journal's centennial edition that perhaps it was the journalistic qualities of Nature that drew readers in; \"journalism\" Maddox states, \"is a way of creating a sense of community among people who would otherwise be isolated from each other. This is what Lockyer's journal did from the start.\"[15] In addition, Maddox mentions that the financial backing of the journal in its first years by the Macmillan family also allowed the journal to flourish and develop more freely than scientific journals before it.[15]",
			"color": " "
		}
	}
}
