{
	"add": {
		"doc": {
			"id": "8f3d020082d854715d1b68decb52802e946538d825908d23488aa7be85be15d1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Queene_Ferry_Coonley.JPG/220px-Queene_Ferry_Coonley.JPG",
				"previous": "Morse died in 1940, after 34 years as director, and several years went by without a strong local leadership. To ensure a sounder footing for the future, Coonley merged Avery Coonley with the National College of Education (NCE, formerly the Chicago Kindergarten College and now National-Louis University) in Evanston, Illinois, in 1943.[44] The two institutions had close ties dating back to Morse's Kindergarten College days, and the arrangement took advantage of the NCE's financial and teaching resources while Avery Coonley provided a living laboratory for teacher training and educational research. Under NCE management, ACS continued to offer a curriculum that emphasized practical learning, outdoor education—including farming—and hands-on activities like automobile repair. German and French were added in 1949, with students beginning conversational French in first grade.[45]",
				"after": "Coonley died in 1958;[46] ACS had looked to Coonley for her leadership over the years but even more so for her philanthropy. ACS began charging tuition in 1929, but still relied on Coonley's financial support, and her death caused serious financial hardship. Under the direction of newly appointed headmaster John Malach, a summer program was launched in 1960, open to all children from the surrounding area, to increase revenues and visibility. A swimming pool was added in 1961 to bolster the program. Enrollment had declined over the years and Malach marketed the program aggressively, personally interviewing prospective students. In 1964 enrollment again reached 200 students, which brought in additional tuition and much needed financial stability.[47]",
			"color": "dim|0.44752 gray|0.44752 dim|0.44752 grey|0.44752 dark|0.3018 gray|0.3018 dark|0.3018 grey|0.3018 gray|0.15425 grey|0.15425 silver|0.084692 light|0.0098822 gray|0.0098822 light|0.0098822 grey|0.0098822  "
		}
	}
}
