{
	"add": {
		"doc": {
			"id": "8f673366e70dce8def1c9837a8c1689a402061a674015dccace5de0289e89444",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Collossal_hand_and_torch._Bartholdi%27s_statue_of_%22Liberty.%22%2C_from_Robert_N._Dennis_collection_of_stereoscopic_views.jpg/350px-Collossal_hand_and_torch._Bartholdi%27s_statue_of_%22Liberty.%22%2C_from_Robert_N._Dennis_collection_of_stereoscopic_views.jpg",
				"previous": "By 1875, France was enjoying improved political stability and a recovering postwar economy. Growing interest in the upcoming Centennial Exposition in Philadelphia led Laboulaye to decide it was time to seek public support.[34] In September 1875, he announced the project and the formation of the Franco-American Union as its fundraising arm. With the announcement, the statue was given a name, Liberty Enlightening the World.[35] The French would finance the statue; Americans would be expected to pay for the pedestal.[36] The announcement provoked a generally favorable reaction in France, though many Frenchmen resented the United States for not coming to their aid during the war with Prussia.[35] French monarchists opposed the statue, if for no other reason than it was proposed by the liberal Laboulaye, who had recently been elected a senator for life.[36] Laboulaye arranged events designed to appeal to the rich and powerful, including a special performance at the Paris Opera on April 25, 1876, that featured a new cantata by composer Charles Gounod. The piece was titled La Liberté éclairant le monde, the French version of the statue's announced name.[35]",
				"after": "Despite its initial focus on the elites, the Union was successful in raising funds from across French society. Schoolchildren and ordinary citizens gave, as did 181 French municipalities. Laboulaye's political allies supported the call, as did descendants of the French contingent in the American Revolutionary War. Less idealistically, contributions came from those who hoped for American support in the French attempt to build the Panama Canal. The copper may have come from multiple sources and some of it is said to have come from a mine in Visnes, Norway,[37] though this has not been conclusively determined after testing samples.[38] According to Cara Sutherland in her book on the statue for the Museum of the City of New York, 90,800 kilos (200,000 pounds) was needed to build the statue, and the French copper industrialist Eugène Secrétan donated 58,100 kilos (128,000 pounds) of copper.[39] Historian Yasmin Khan, in her 2010 book about the statue, states that the firm of Japy Frères, copper merchants, donated copper valued at 64,000 francs (about $16,000 at the time or the equivalent of US$ 354,000 in 2015).[40][41]",
			"color": "burly|0.78259 wood|0.78259 navajo|0.11644 white|0.11644 tan|0.076459 moccasin|0.0095683 wheat|0.0063214  "
		}
	}
}
