{
	"add": {
		"doc": {
			"id": "8f6a5a1ec9115c55b8e0ead72aa602a9460a9af093b2f51ba5cf185403dbdad1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Armenian_cotton.jpg/220px-Armenian_cotton.jpg",
				"previous": "Following a lengthy debate among the members of Politburo over the course of economic development, by 1928–1929, upon gaining control of the country, Joseph Stalin abandoned the NEP and pushed for full central planning, starting forced collectivisation of agriculture and enacting draconian labor legislation. Resources were mobilised for rapid industrialisation, which greatly expanded Soviet capacity in heavy industry and capital goods during the 1930s.[78] Preparation for war was one of the main driving forces behind industrialisation, mostly due to distrust of the outside capitalistic world.[79] As a result, the USSR was transformed from a largely agrarian economy into a great industrial power, leading the way for its emergence as a superpower after World War II.[80] During the war, the Soviet economy and infrastructure suffered massive devastation and required extensive reconstruction.[81]",
				"after": "By the early 1940s, the Soviet economy had become relatively self-sufficient; for most of the period until the creation of Comecon, only a very small share of domestic products was traded internationally.[82] After the creation of the Eastern Bloc, external trade rose rapidly. Still the influence of the world economy on the USSR was limited by fixed domestic prices and a state monopoly on foreign trade.[83] Grain and sophisticated consumer manufactures became major import articles from around the 1960s.[82] During the arms race of the Cold War, the Soviet economy was burdened by military expenditures, heavily lobbied for by a powerful bureaucracy dependent on the arms industry. At the same time, the Soviet Union became the largest arms exporter to the Third World. Significant amounts of Soviet resources during the Cold War were allocated in aid to the other socialist states.[82]",
			"color": " "
		}
	}
}
