{
	"add": {
		"doc": {
			"id": "8f6ac26cdce3274c0153522803e4f29b418002273f352571c72d07b930b9f15d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Three_Persons_Viewing_the_Gladiator_by_Candlelight.jpg/220px-Three_Persons_Viewing_the_Gladiator_by_Candlelight.jpg",
				"previous": "There was a long history of painting candlelit scenes in Western art, although as Wright had not at this date travelled abroad, there remains uncertainty as to what paintings he might have seen in the original, as opposed to prints. Nicolson, who made studies of both Wright and other candlelight painters such as the 17th-century Utrecht Caravaggisti, thought their paintings, among the largest in the style, those most likely to have influenced Wright. However Judy Egerton wonders if he could have seen any, preferring as influences the far smaller works of the Leiden fijnschilder Godfried Schalcken (1643–1706), whose reputation was much greater in the early 18th century than subsequently. He had worked in England from 1692 to 1697, and several of his paintings can be placed in English collections in Wright's day.[9] Although he was the leading expert on them who wrote in English, Nicolson does not suggest that Wright is likely to have known of the 17th-century candlelit narrative religious subjects of Georges de La Tour and Trophime Bigot, which, in their seriousness, are the closest works to Wright that are lit only by candle. The Dutch painters' works and other candlelit scenes by 18th-century English painters such as Henry Morland (father of George) tended instead to exploit the possibilities of semi-darkness for erotic suggestiveness. Some of Wright's own later candlelit scenes were by no means as serious as his first ones, as seen from their titles: Two Boys Fighting Over a Bladder and Two Girls Dressing a Kitten by Candlelight.[10]",
			"after": [],
			"color": "black|0.31722 tan|0.16495 sienna|0.067639 peach|0.062974 puff|0.062974 bisque|0.051623 dim|0.04875 gray|0.04875 dim|0.04875 grey|0.04875 burly|0.045505 wood|0.045505 antique|0.039549 white|0.039549 blanched|0.037289 almond|0.037289 papaya|0.0297 whip|0.0297 gray|0.021528 grey|0.021528 wheat|0.018832 corn|0.010838 silk|0.010838  "
		}
	}
}
