{
	"add": {
		"doc": {
			"id": "8f78706b3976e8b5c8f7e935af04b5496d9be50374771f1fb9c5a25ac66b1883",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Chinesischer_Maler_des_10._Jahrhunderts_%28I%29_001.jpg/200px-Chinesischer_Maler_des_10._Jahrhunderts_%28I%29_001.jpg",
				"previous": "Scholar-officials and gentry also distinguished themselves through their intellectual pursuits. While some such as Shen Kuo (1031–1095) and Su Song (1020–1101) dabbled in every known field of science, study, and statecraft, Song elites were generally most interested in the leisurely pursuits of composing and reciting poetry, art collecting, and antiquarianism.[49] Yet even this pursuit could turn into a scholarly one. It was the official, historian, poet, and essayist Ouyang Xiu (1007–1072) who compiled an analytical catalogue of ancient rubbings on stone and bronze which pioneered ideas in early epigraphy and archeology.[50] Shen Kuo even took an interdisciplinary approach to archeological study, in order to aid his work in astronomy, mathematics, and recording ancient musical measures.[51] The scholar-official and historian Zeng Gong (1019–1083) reclaimed last chapters of the ancient Zhan Guo Ce, proofreading and editing the version that would become the accepted modern version. The ideal official and gentry scholars were also expected to employ these intellectual pursuits for the good of the community, such as writing local histories or gazetteers.[52] In the case of Shen Kuo and Su Song, their pursuits in academic fields such as classifying pharmaceuticals and improving calendrical science through court work in astronomy fit this ideal.",
				"after": "Along with intellectual pursuits, the gentry exhibited habits and cultured hobbies which marked their social status and refinement. The erudite term of enjoying the company of the 'nine guests' (jiuke)—an extension of the Four Arts of the Chinese Scholar—was a metaphor for accepted gentry pastimes of playing the Chinese zither, playing Chinese chess, Zen Buddhist meditation, ink (calligraphy and painting), tea drinking, alchemy, chanting poetry, conversation, and drinking wine.[53] The painted artwork of the gentry shifted dramatically in style from Northern to Southern Song, due to underlying political, demographic, and social circumstance. Northern Song gentry and officials, who were concerned largely with tackling issues of national interest and not much for local affairs, preferred painting huge landscape scenes where any individuals were but tiny figures immersed within a larger context.[54] During the Southern Song, political, familial, and social concerns became heavily embedded with localized interests; these changes correlate with the chief style of Southern Song paintings, where small, intimate scenes with a primary focus on individuals was emphasized.[54]",
			"color": " "
		}
	}
}
