{
	"add": {
		"doc": {
			"id": "8fa08a0d63fe1ff7cb957c977ec228ebf1a3274463bcc802a5bb5043e1558bad",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Gangtok_from_Tibet_Road.jpg/220px-Gangtok_from_Tibet_Road.jpg",
			"previous": [],
				"after": "Gangtok features a monsoon-influenced subtropical highland climate. Because of its elevation and sheltered environment, Gangtok enjoys a mild, temperate climate all year round. Like most Himalayan towns, Gangtok has five seasons: summer, monsoons, autumn, winter and spring. Temperatures range from an average maximum of 22 °C (72 °F) in summer to an average minimum of 4 °C (39 °F) in winter.[16] Summers (lasting from late April to June) are mild, with maximum temperatures rarely crossing 25 °C (77 °F). The monsoon season from June to September is characterised by intense torrential rains often causing landslides that block Gangtok's land access to the rest of the country. Rainfall starts to rise from pre-monsoon in May, and peaks during the monsoon, with July recording the highest monthly average of 649.6 mm (25.6 in).[16] In winter temperature averages between 4 °C (39 °F) and 7 °C (45 °F).[16] Snowfall is rare, and in recent times Gangtok has received snow only in 1990, 2004, 2005 and January 2011.[15] Temperatures below freezing are also rare.[15] During this season the weather can be unstable, and change abruptly from bright sunshine and clear skies to heavy rain within a couple of hours. During spring and autumn the weather is generally sunny and mild. Owing to its elevation, Gangtok is often enveloped in fog during the monsoon and winter months.",
			"color": "black|0.51396 dark|0.11143 slate|0.11143 gray|0.11143 dim|0.085106 gray|0.085106 dim|0.085106 grey|0.085106 gray|0.047794 grey|0.047794 slate|0.040887 gray|0.040887 dark|0.037312 gray|0.037312 dark|0.037312 grey|0.037312 light|0.031979 slate|0.031979 gray|0.031979 silver|0.017855 tan|0.011753 light|0.009861 gray|0.009861 light|0.009861 grey|0.009861  "
		}
	}
}
