{
	"add": {
		"doc": {
			"id": "8fcfdb78cc1284d092b219f0016b71f5a5d0a801f388b27a262cdd1575542e78",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Nuffield_College_lower_quadrangle.jpg/220px-Nuffield_College_lower_quadrangle.jpg",
			"previous": [],
				"after": "Administration of Nuffield's donation was the responsibility of the University, as the college did not become an independent body until after the Second World War. A sub-committee, consisting of three heads of Oxford colleges (Sir William Beveridge from University College; Alfred Emden from St Edmund Hall; and Linda Grier from Lady Margaret Hall), was appointed to choose the architect; Emden appears to have played the major part in the group's work.[20] Eight architects were initially asked to compete, including Louis de Soissons, Vincent Harris, Austen Harrison, Charles Holden, Edward Maufe, and Hubert Worthington. All but Holden and Maufe submitted photographs of their work, and the sub-committee then recommended Harrison, a decision confirmed after he was interviewed on 17 June 1938. At that time, Harrison had never worked in Britain: although he had qualified there, he had practised in Greece and Palestine.[21] Indeed the college seems to have been his only project in the country, and remains his best known work, along with his later University of Ghana. Harrison was not given any restrictions or limitations on style; Nuffield agreed to Harrison's appointment, but was not consulted on the architectural style of the college before Harrison started work.[22] When Nuffield's donation was announced, it was reported that the \"general idea\" was that the college buildings should be sited behind gardens, similar to the memorial gardens at Christ Church, Oxford, so that those entering Oxford from the west would be faced with a \"beautiful vista of well-planned gardens seen through railings\";[15] this idea did not form part of Harrison's designs.",
			"color": "dark|0.42893 olive|0.42893 green|0.42893 black|0.25926 gray|0.10903 grey|0.10903 dark|0.058635 gray|0.058635 dark|0.058635 grey|0.058635 dim|0.056215 gray|0.056215 dim|0.056215 grey|0.056215 olive|0.044345 drab|0.044345 silver|0.016976  "
		}
	}
}
