{
	"add": {
		"doc": {
			"id": "8fe28c9804e505ba776241cd9bf06e6aa2a94f59ee16da294f14b10be5fa17c4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/BOAC_Boeing_747-136_landing_at_Heathrow.jpg/220px-BOAC_Boeing_747-136_landing_at_Heathrow.jpg",
				"previous": "In 1953 Vickers had started building the swept wing VC-7/V-1000 with Rolls-Royce Conway turbofan engines, but BOAC short-sightedly decided the Britannia and Comet 4 would be adequate for its purposes, and when the military version of the V-1000 was cancelled in 1955 the 75% complete prototype was scrapped. In October 1956 BOAC ordered 15 Boeing 707s with Conway engines (briefly the most economical commercial engine option). They entered service in 1960. (The British Airworthiness Authorities insisted on tail-fin modifications which Boeing made available to all 707 users). Sir Giles Guthrie,[5] who took charge of BOAC in 1964, preferred Boeing aircraft for economic reasons, and indeed BOAC began turning a profit in the late 1960s. After a row in Parliament the government instructed BOAC to purchase 17 Vickers VC-10 aircraft from a 30-aircraft order which Guthrie had cancelled.[6] The Standard VC-10 had higher operating costs than the 707, largely due to BOAC's requirement at the design stage for the aircraft to have excellent hot and high performance for Commonwealth (African/Asian) routes, but the larger Super VC-10 was a success with American passengers on the North Atlantic and was profitable.",
				"after": "The next major order of Boeing aircraft was for 11 747-100s. On 22 April 1970 BOAC received its first 747, but the aircraft did not enter commercial service until 14 April 1971 due to BOAC's inability to settle crewing and pay rates with the British Air Line Pilots' Association. BOAC's successor British Airways later became the largest Boeing customer outside North America.[citation needed]",
			"color": "light|0.11565 slate|0.11565 gray|0.11565 slate|0.11444 gray|0.11444 light|0.09334 steel|0.09334 blue|0.09334 dark|0.063156 olive|0.063156 green|0.063156 black|0.060221 white|0.041517 smoke|0.041517 snow|0.038831 ghost|0.038285 white|0.038285 white|0.038096 gray|0.036389 grey|0.036389 alice|0.034773 blue|0.034773 mint|0.03442 cream|0.03442 sea|0.034385 shell|0.034385 azure|0.034164 lavender|0.032249 floral|0.031748 white|0.031748 dim|0.024395 gray|0.024395 dim|0.024395 grey|0.024395 lavender|0.022058 blush|0.022058 dark|0.021156 gray|0.021156 dark|0.021156 grey|0.021156 gainsboro|0.017232 silver|0.016286 ivory|0.016198 light|0.015998 gray|0.015998 light|0.015998 grey|0.015998  "
		}
	}
}
