{
	"add": {
		"doc": {
			"id": "8ff8b468aff32ea08e206c63a0cedb9265a17017890c73160ffc30d8aa160e0d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Colonial_Williamsburg_Governors_Palace_Front_Dscn7232.jpg/220px-Colonial_Williamsburg_Governors_Palace_Front_Dscn7232.jpg",
				"previous": "Several European expeditions, including a group of Spanish Jesuits, explored the Chesapeake Bay during the 16th century.[58] In 1583, Queen Elizabeth I of England granted Walter Raleigh a charter to plant a colony north of Spanish Florida.[59] In 1584, Raleigh sent an expedition to the Atlantic coast of North America.[60] The name \"Virginia\" may have been suggested then by Raleigh or Elizabeth, perhaps noting her status as the \"Virgin Queen,\" and may also be related to a native phrase, \"Wingandacoa,\" or name, \"Wingina.\"[61] Initially the name applied to the entire coastal region from South Carolina to Maine, plus the island of Bermuda.[62] The London Company was incorporated as a joint stock company by the proprietary Charter of 1606, which granted land rights to this area. The Company financed the first permanent English settlement in the \"New World\", Jamestown. Named for King James I, it was founded in May 1607 by Christopher Newport.[63] In 1619, colonists took greater control with an elected legislature called the House of Burgesses. With the bankruptcy of the London Company in 1624, the settlement was taken into royal authority as an English crown colony.[64]",
				"after": "Life in the colony was perilous, and many died during the Starving Time in 1609 and the Anglo-Powhatan Wars, including the Indian massacre of 1622, which fostered the colonists' negative view of all tribes.[65] By 1624, only 3,400 of the 6,000 early settlers had survived.[66] However, European demand for tobacco fueled the arrival of more settlers and servants.[67] The headright system tried to solve the labor shortage by providing colonists with land for each indentured servant they transported to Virginia.[68] African workers were first imported to Jamestown in 1619 initially under the rules of indentured servitude. The shift to a system of African slavery in Virginia was propelled by the legal cases of John Punch, who was sentenced to lifetime slavery in 1640 for attempting to run away,[69] and of John Casor, who was claimed by Anthony Johnson as his servant for life in 1655.[70] Slavery first appears in Virginia statutes in 1661 and 1662, when a law made it hereditary based on the mother's status.[71]",
			"color": "dark|0.22363 olive|0.22363 green|0.22363 light|0.11971 sky|0.11971 blue|0.11971 gray|0.089671 grey|0.089671 dark|0.07088 gray|0.07088 dark|0.07088 grey|0.07088 dim|0.067195 gray|0.067195 dim|0.067195 grey|0.067195 light|0.051789 slate|0.051789 gray|0.051789 light|0.050105 steel|0.050105 blue|0.050105 slate|0.039111 gray|0.039111 tan|0.038112 black|0.030901 dark|0.030085 salmon|0.030085 silver|0.019188 burly|0.018616 wood|0.018616 sky|0.013648 blue|0.013648 light|0.013149 blue|0.013149 rosy|0.011713 brown|0.011713 dark|0.0091558 khaki|0.0091558 light|0.0088423 gray|0.0088423 light|0.0088423 grey|0.0088423  "
		}
	}
}
