{
	"add": {
		"doc": {
			"id": "900a068469f68797fad07353fac5743ccb5bd8c43474d4800cced4fc841fedd0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/US_Navy_SEALs_at_Zhawar_Kili_cave_entrance.jpg/220px-US_Navy_SEALs_at_Zhawar_Kili_cave_entrance.jpg",
				"previous": "The SR mission in the region of Camp Rhino lasted for four days, after which two United States Air Force Combat Control Teams made a nighttime HALO jump to assist the SEALs in guiding in Marines from the 15th Marine Expeditionary Unit who seized control of the area and established a Forward operating base. While at Camp Rhino, the CIA passed on intelligence from a Predator drone operating in the Paktia province that Taliban Mullah Khirullah Said Wali Khairkhwa was spotted leaving a building by vehicle convoy. SEALs and Danish Jægerkorpset commandos boarded Air Force Pave Low helicopters and seized Khairkhwa on the road less than two hours later. The SEALs continued to perform reconnaissance operations for the Marines until leaving after having spent 45 days on the ground.",
				"after": "Subsequent SEAL operations during the invasion of Afghanistan were conducted within Task Force K-Bar, a joint special operations unit of Army Special Forces, United States Air Force Special Tactics Teams, and special operations forces from Norway, Germany, Australia, New Zealand, Canada, and Denmark, under the command of Navy SEAL Captain Robert Harward. Task Force K-Bar conducted combat operations in the massive cave complexes at Zhawar Kili, the city of Kandahar and surrounding territory, the town of Prata Ghar and hundreds of miles of rough terrain in southern and eastern Afghanistan. Over the course of six months Task Force K-Bar killed or captured over 200 Taliban and al Qaeda fighters, and destroyed tens of thousands of pounds of weapons and ordnance.",
			"color": "dark|0.31134 gray|0.31134 dark|0.31134 grey|0.31134 gray|0.30496 grey|0.30496 dim|0.11801 gray|0.11801 dim|0.11801 grey|0.11801 black|0.10179 silver|0.083519 light|0.028792 gray|0.028792 light|0.028792 grey|0.028792 gainsboro|0.016422 light|0.0038896 slate|0.0038896 gray|0.0038896 slate|0.0038814 gray|0.0038814 white|0.0030505 smoke|0.0030505  "
		}
	}
}
