{
	"add": {
		"doc": {
			"id": "900c9714d03145cb6e2e280dad9903799952aadddf45dc0178543476296fdb46",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Turkey_Point_FL1.jpg/220px-Turkey_Point_FL1.jpg",
				"previous": "One vision of Islandia, supported by land owners, would have connected the northern Florida Keys – from Key Biscayne to Key Largo – with bridges and created new islands using the fill from the SeaDade channel. Although Ludwig's SeaDade plans were not supported by Miami-area politicians or the state of Florida, Islandia's supporters continued to lobby for development support. In 1968, when it appeared the area was about to become a national monument, Islandia supporters bulldozed a highway six lanes wide right down the center of the island, destroying the forest for 7 miles (11 km). Islandia landowners called it Elliott Key Boulevard, but called it \"Spite Highway\" privately. It was hoped that since there was so much environmental damage, no one would want it for a national monument. Over time in the near-tropical climate, the forest grew back and now the only significant hiking trail on Elliott Key now follows the path of Elliott Key Boulevard.[39]",
				"after": "The oil-fired Turkey Point power stations were completed in 1967–68 and experienced immediate problems from the discharge of hot cooling water into Biscayne Bay, where the heat killed marine grasses.[43] In 1964 FP&L announced plans for two 693 MW nuclear reactors at the site,[44] which were expected to compound the cooling water problem. Because of the shallowness of Biscayne Bay, the power stations were projected to consume a significant proportion of the bay's waters each day for cooling. After extensive negotiations and litigation with both the state and with Ludwig, who owned lands needed for cooling water canals, a closed-loop canal system was built south of the power plants and the nuclear units became operational in the early 1970s.[45]",
			"color": "light|0.2519 gray|0.2519 light|0.2519 grey|0.2519 gainsboro|0.22985 silver|0.13109 dark|0.064957 gray|0.064957 dark|0.064957 grey|0.064957 white|0.048975 smoke|0.048975 linen|0.047199 gray|0.046683 grey|0.046683 dim|0.039452 gray|0.039452 dim|0.039452 grey|0.039452 slate|0.028312 gray|0.028312 light|0.021674 slate|0.021674 gray|0.021674 black|0.019445 sea|0.017875 shell|0.017875 dark|0.011248 slate|0.011248 gray|0.011248 floral|0.010474 white|0.010474 old|0.010413 lace|0.010413 mint|0.007543 cream|0.007543 snow|0.0058664  "
		}
	}
}
