{
	"add": {
		"doc": {
			"id": "900eac742e05d943f71f486e775a593ac07373f4a72fc5c567825358d2405fa0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Chicago_sunrise_1.jpg/500px-Chicago_sunrise_1.jpg",
			"previous": [],
				"after": "Fodor's Chicago 2010 ranks the hotel as having one of the best spas and one of the best pools in the city. It also ranked the hotel as a Fodor's Choice among Chicago lodging options.[151] Fodor's also notes that the hotel has impeccable service and lavish amenities, but also notes that the hotel may be a bit \"too decadent\", with offerings such as $25 bottles of water.[152] Frommer's Chicago 2010 describes the hotel as having the gorgeous views and upscale amenities to provide a place to go to live the life of a wealthy tourist.[153] The building is praised for its location, which provides as many views along the Chicago River as possible. Its modern architecture is praised for \"contemporary synthesis of adjacent building fabrics and modulations\" that preserve the city's architectural heritage and integrate the riverfront setting.[11] BlackBook Magazine's Guide to Chicago describes the Hotel as an embodiment of poshness which gives the visitor bragging rights upon his/her return home.[154] Forbes Travel Guide describes the hotel as having an understated upscale lobby, sophisticated lounge, gorgeous restaurant and lavish rooms with amazing views.[155] It also describes the hotel as befitting of the Trump name in several ways.[156] Time Out describes the building as a \"testament to a vibrant 21st-century optimism in Chicago\".[157] It notes that the hotel meets all expectations attached to the name Trump in terms of luxury, modern conveniences and speaks highly of the views.[158] Insight Guides describes the building's architectural swagger as fitting for the post-September 11 attacks skyline.[159] Ten years after the September 11 attacks, Kamin described the building as the one that \"best reveals how the Sept. 11 terrorist attacks either did or did not change architecture\". Kamin clarified his belief",
			"color": "steel|0.37019 blue|0.37019 rosy|0.10108 brown|0.10108 dim|0.098113 gray|0.098113 dim|0.098113 grey|0.098113 light|0.084321 slate|0.084321 gray|0.084321 gray|0.08193 grey|0.08193 slate|0.071338 gray|0.071338 dark|0.040675 gray|0.040675 dark|0.040675 grey|0.040675 silver|0.020596 tan|0.017845 light|0.017167 steel|0.017167 blue|0.017167  "
		}
	}
}
