{
	"add": {
		"doc": {
			"id": "901ca7f8e552a3d720c742c727b1ca4b871abe6307b36fc32f1b3f548a129bc5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Tabernacle_wide.jpg/220px-Tabernacle_wide.jpg",
				"previous": "As a national center for the arts,[142] Atlanta is home to significant art museums and institutions. The renowned High Museum of Art is arguably the South's leading art museum and among the most-visited art museums in the world.[143] The Museum of Design Atlanta (MODA), a design museum, is the only such museum in the Southeast.[144] Contemporary art museums include the Atlanta Contemporary Art Center and the Museum of Contemporary Art of Georgia. Institutions of higher education also contribute to Atlanta's art scene, with the Savannah College of Art and Design's Atlanta campus providing the city's arts community with a steady stream of curators, and Emory University's Michael C. Carlos Museum containing the largest collection of ancient art in the Southeast.[145]",
				"after": "Atlanta has played a major or contributing role in the development of various genres of American music at different points in the city's history. Beginning as early as the 1920s, Atlanta emerged as a center for country music, which was brought to the city by migrants from Appalachia.[146] During the countercultural 1960s, Atlanta hosted the Atlanta International Pop Festival, with the 1969 festival taking place more than a month before Woodstock and featuring many of the same bands. The city was also a center for Southern rock during its 1970s heyday: the Allman Brothers Band's hit instrumental \"Hot 'Lanta\" is an ode to the city, while Lynyrd Skynyrd's famous live rendition of \"Free Bird\" was recorded at the Fox Theatre in 1976, with lead singer Ronnie Van Zant directing the band to \"play it pretty for Atlanta\".[147] During the 1980s, Atlanta had an active Punk rock scene that was centered on two of the city's music venues, 688 Club and the Metroplex, and Atlanta famously played host to the Sex Pistols first U.S. show, which was performed at the Great Southeastern Music Hall.[148] The 1990s saw the birth of Atlanta hip hop, a subgenre that gained relevance following the success of home-grown duo OutKast; however, it was not until the 2000s that Atlanta moved \"from the margins to becoming hip-hop's center of gravity, part of a larger shift in hip-hop innovation to the South\".[149] Also in the 2000s, Atlanta was recognized by the Brooklyn-based Vice magazine for its impressive yet under-appreciated Indie rock scene, which revolves around the various live music venues found on the city's alternative eastside.[150][151]",
			"color": "black|0.85038 midnight|0.010161 blue|0.010161 dim|0.0049376 gray|0.0049376 dim|0.0049376 grey|0.0049376 yellow|0.0048888 royal|0.0047349 blue|0.0047349 olive|0.0047199 dark|0.0047086 slate|0.0047086 blue|0.0047086  "
		}
	}
}
