{
	"add": {
		"doc": {
			"id": "902a0073dede26554d8d95bee74fbb5917fc5c1dd780fe7e4d6a9a9159d234f9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/British_Isles_-_UK_%26_Ireland.png/350px-British_Isles_-_UK_%26_Ireland.png",
			"previous": [],
				"after": "There are two sovereign states in the isles: Ireland and the United Kingdom of Great Britain and Northern Ireland. Ireland, sometimes called the Republic of Ireland, governs five sixths of the island of Ireland, with the remainder of the island forming Northern Ireland. Northern Ireland is a part of the United Kingdom of Great Britain and Northern Ireland, usually shortened to simply the United Kingdom, which governs the remainder of the archipelago with the exception of the Isle of Man and the Channel Islands. The Isle of Man and the two states of the Channel Islands, Jersey and Guernsey, are known as the Crown Dependencies. They exercise constitutional rights of self-government and judicial independence;[60] responsibility for international representation rests largely upon the UK (in consultation with the respective governments); and responsibility for defence is reserved by the UK. The United Kingdom is made up of four constituent parts: England, Scotland and Wales, forming Great Britain, and Northern Ireland in the north-east of the island of Ireland. Of these, Scotland, Wales and Northern Ireland have \"devolved\" governments meaning that they have their own parliaments/assemblies and are self-governing with respect to certain areas set down by law. For judicial purposes, Scotland, Northern Ireland and England and Wales (the latter being one entity) form separate legal jurisdiction, with there being no single law for the UK as a whole.",
			"color": "light|0.83179 steel|0.83179 blue|0.83179 white|0.0090347 smoke|0.0090347 alice|0.008546 blue|0.008546 ghost|0.0084153 white|0.0084153 snow|0.0083472 sea|0.0082675 shell|0.0082675 white|0.0081487 light|0.0081279 slate|0.0081279 gray|0.0081279 dark|0.0079596 gray|0.0079596 dark|0.0079596 grey|0.0079596 lavender|0.0077284 blush|0.0077284 mint|0.0075992 cream|0.0075992 floral|0.0074495 white|0.0074495 azure|0.0070746 gray|0.0069968 grey|0.0069968 dim|0.006889 gray|0.006889 dim|0.006889 grey|0.006889 slate|0.0057403 gray|0.0057403 crimson|0.0057304 silver|0.0056181 midnight|0.0049513 blue|0.0049513 light|0.0049375 gray|0.0049375 light|0.0049375 grey|0.0049375 gainsboro|0.0046168  "
		}
	}
}
