{
	"add": {
		"doc": {
			"id": "9032009a7589daf1dc96db6acd27ded1d5b1ffa1233b2eaeb513509031bf88cd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Litoria_aurea_Rana_comparison.jpg/300px-Litoria_aurea_Rana_comparison.jpg",
				"previous": "The common name, \"green and golden bell frog\", was first adopted by Harold Cogger in his 1975 book Reptiles and Amphibians of Australia. Before this, its common names were \"golden frog\" and \"golden tree frog\". The green and golden bell frog has many physical and behavioural characteristics representative of ranids, hence its original classification as Rana. It has a pointy snout, long legs, and almost complete toe webbing; the tympanum is large and distinct; and the overall body shape is similar to many Rana species. Like many frogs in the Rana genus, green and golden bell frogs are mostly aquatic, and only travel over land during periods of rainfall. It was removed from the genus because of anatomical differences with the family Ranidae. The bone and cartilage structural formations of the green and golden bell frog are closest to those of species in the family Hylidae; it was therefore reclassified.",
				"after": "The green and golden bell frog was first described as Rana aurea by Lesson in 1827. It has changed classification 20 times; it was first named Litoria aurea in 1844 by Günther, and changed another 9 times before being named again as Litoria aurea.[2] The specific epithet aurea derived from the Latin aureus for 'golden'.[3] The species is now classified within the Litoria aurea complex, a closely related group of frogs in the Litoria genus.[4] This complex is scattered throughout Australia: three species occur in south-east Australia, one in northern Australia, and two in Southwest Australia.[4] The complex consists of the green and golden bell frog (L. aurea), growling grass frog (L. raniformis), yellow-spotted bell frog (L. castanea), Dahl's aquatic frog (L. dahlii), spotted-thighed frog (L. cyclorhyncha) and the motorbike frog (L. moorei).[4] The ranges of L. raniformis and L. castanea overlap with the green and golden bell frog;[4] this, as well as physical similarities, may make it difficult to distinguish between the species, and until 1972, L. raniformis and the green and golden bell frog were regarded as the same, when electrophoretic studies proved them to be distinct.[5] The tablelands bell frog has not been seen since 1980 and may now be extinct, although the large yellow spots present on its thighs help distinguish it from the green and golden bell frog. The growling grass frog, which is very similar to the green and golden bell frog, can only be readily distinguished by raised bumps on the dorsal surface. It has also been proposed that some populations of L. aurea located near Ulong, New South Wales, be a separate subspecies, L. a. ulongae, but this was not accepted.[5]",
			"color": "dim|0.23544 gray|0.23544 dim|0.23544 grey|0.23544 black|0.16031 dark|0.13164 olive|0.13164 green|0.13164 gray|0.074975 grey|0.074975 dark|0.048581 sea|0.048581 green|0.048581 dark|0.041859 gray|0.041859 dark|0.041859 grey|0.041859 slate|0.041582 gray|0.041582 olive|0.025308 drab|0.025308 dark|0.023737 slate|0.023737 gray|0.023737 sea|0.021988 green|0.021988 light|0.02189 slate|0.02189 gray|0.02189 forest|0.019204 green|0.019204 tan|0.018122 silver|0.016908  "
		}
	}
}
