{
	"add": {
		"doc": {
			"id": "9041e15e5080c59cfa869b01eeaa5bbd3df64c45911dad5ce6c87e139dbc8d01",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Helmet_of_Skanderbeg.JPG/170px-Helmet_of_Skanderbeg.JPG",
				"previous": "Later that same year, two other Ottoman armies appeared on the borders. The commander of one of the Ottoman armies was Ballaban Pasha, who, together with Jakup Bey, the commander of the second army, planned a double-flank envelopment. Skanderbeg, however, attacked Ballaban's forces at the Second Battle of Vajkal, where the Ottomans were defeated. This time, all Ottoman prisoners were slain in an act of revenge for the previous execution of Albanian captains.[114] The other Ottoman army, under the command of Jakup Bey, was also defeated some days later in Kashari field near Tirana.[114]",
				"after": "In 1466, Sultan Mehmed II personally led an army of 30,000 into Albania and laid the Second Siege of Krujë, as his father had attempted 16 years earlier.[115] The town was defended by a garrison of 4,400 men, led by Prince Tanush Thopia.[115] After several months of siege, destruction and killings all over the country, Mehmed II, like his father, saw that seizing Krujë was impossible for him to accomplish by force of arms. Subsequently, he left the siege to return to Constantinople.[115] However, he left the force of 30,000 men under Ballaban Pasha to maintain the siege by building a castle in central Albania, which he named Il-basan (modern Elbasan), in order to support the siege. Durazzo would be the next target of the sultan in order to be used as a strong base opposite the Italian coast.[115]",
			"color": "dark|0.31465 gray|0.31465 dark|0.31465 grey|0.31465 gray|0.22535 grey|0.22535 dim|0.14428 gray|0.14428 dim|0.14428 grey|0.14428 silver|0.10217 slate|0.02157 gray|0.02157 light|0.020737 slate|0.020737 gray|0.020737 light|0.019381 gray|0.019381 light|0.019381 grey|0.019381 gainsboro|0.0083571 floral|0.0069386 white|0.0069386 sea|0.0065555 shell|0.0065555  "
		}
	}
}
