{
	"add": {
		"doc": {
			"id": "9041c08e02278ccaa0d1f43770a829fdbe830c170315be063422f40a6846eae9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Tectonic_plate_boundaries.png/220px-Tectonic_plate_boundaries.png",
			"previous": [],
				"after": "Bathymetry is the mapping and study of the topography of the ocean floor. Methods used for measuring the depth of the sea include single or multibeam echosounders, laser airborne depth sounders and the calculation of depths from satellite remote sensing data. This information is used for determining the routes of undersea cables and pipelines, for choosing suitable locations for siting oil rigs and offshore wind turbines and for identifying possible new fisheries.[69] The Earth is composed of a magnetic central core, a mostly liquid mantle, and a hard rigid outer shell (or lithosphere), which is composed of the Earth's rocky crust and the deeper and mostly solid outer layer of the mantle. The crust below land is known as continental while that under the abyssal sea is called oceanic. The latter is composed of relatively dense basalt and is some five to ten kilometers (three to six miles) thick. The relatively thin lithosphere floats on the weaker and hotter mantle below and is fractured into a number of tectonic plates.[70] In mid-ocean, magma is constantly being thrust through the seabed between adjoining plates to form mid-oceanic ridges and here convection currents within the mantle tend to drive the two plates apart. Parallel to these ridges and nearer the coasts, one oceanic plate may slide beneath another oceanic plate in a process known as subduction. Deep trenches are formed here and the process is accompanied by friction as the plates grind together. The movement proceeds in jerks which cause earthquakes. Heat is also produced and magma is forced up, creating underwater mountains, some of which grow into volcanic islands. Near some boundaries between the land and sea, the slightly denser oceanic plates slide beneath the continental plates and more subduction trenches are formed. As they grate together, the continental plates are deformed and buckle causing mountain building and seismic activity.[71][72]",
			"color": "light|0.20295 steel|0.20295 blue|0.20295 coral|0.19986 light|0.16067 blue|0.16067 sky|0.11119 blue|0.11119 tan|0.084116 sandy|0.042376 brown|0.042376 burly|0.037661 wood|0.037661 lavender|0.033306 light|0.016183 salmon|0.016183 silver|0.013542 light|0.012886 slate|0.012886 gray|0.012886 navajo|0.010684 white|0.010684 light|0.010526 sky|0.010526 blue|0.010526 light|0.0078621 gray|0.0078621 light|0.0078621 grey|0.0078621 moccasin|0.0071929 wheat|0.0065961 dark|0.0052038 salmon|0.0052038 slate|0.0046422 gray|0.0046422 gainsboro|0.0038026  "
		}
	}
}
