{
	"add": {
		"doc": {
			"id": "90506a7ffacbd6459d95a1585256a02dde56045e2314733b29385f5ec6e050dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Netzstieliger_Hexenr%C3%B6hrling-1.jpg/220px-Netzstieliger_Hexenr%C3%B6hrling-1.jpg",
				"previous": "Boletus luridus was described by German botanist Jacob Christian Schäffer in 1774, in his series on fungi of Bavaria and the Palatinate, Fungorum qui in Bavaria et Palatinatu circa Ratisbonam nascuntur icones.[3] The specific epithet is the Latin adjective luridus, 'sallow'.[4] French botanist Pierre Bulliard's 1791 Boletus rubeolarius[5] is a heterotypic synonym (based on a different type).[1] The following year, Johann Friedrich Gmelin called it Boletus subvescus,[6] from the Latin words sub \"nearly\" or \"under\",[7] and vescus \"edible\".[8] However, this is a nomen nudum.[9] Several taxonomical synonyms arose when the species was transferred to different genera within the family Boletaceae by different authorities, including Leccinum by Samuel Frederick Gray in 1821,[10] Tubiporus by Petter Karsten in 1881,[11] Dictyopus by Lucien Quélet in 1888,[12] and Suillellus by William Murrill in 1909.[1][13]",
				"after": "The variety Boletus luridus var. erythropus, published as \"beta\" by Elias Magnus Fries in his 1821 Systema Mycologicum,[14] is synonymous with Boletus erythropus.[15] Boletus luridus var. rubriceps was originally described from Spain (as a species of Tubiporus) by René Maire in 1937,[16] and later formally transferred to Boletus by Aurel Dermek in 1987.[17] Other varieties of B. luridus include Roman Schulz's var. obscurus and var. rubromaculatus published in 1924;[18] Josef Velenovský's 1939 var. tenuipes, found in the Czech Republic;[19] and Jean Blum's 1969 var. lupiniformis and var. queletiformis, originally described from France and Spain, respectively.[20] Boletus erythrentheron, originally described as a distinct species by Jan Bezděk, was later published as the variety B. luridus var. erythrentheron by Albert Pilát and Dermek in 1979,[21] and finally as a subspecies by Jiri Hlavácek in 1995.[22] Carmine Lavorato and Giampaolo Simonini defined the form primulicolor from Sardinia in 1997.[23] Rolf Singer's 1947 variety caucasicus is currently considered an independent species, Boletus caucasicus Singer ex. Alessio.[24] Similarly, B. luridus f. sinensis, found in Hainan Province, China, was later elevated to distinct species status as B. sinensis.[25]",
			"color": "saddle|0.31787 brown|0.31787 peru|0.1875 dark|0.096784 golden|0.096784 rod|0.096784 sandy|0.063497 brown|0.063497 burly|0.049158 wood|0.049158 golden|0.041826 rod|0.041826 khaki|0.0319 chocolate|0.026179 sienna|0.020891 tan|0.016946 navajo|0.016659 white|0.016659 wheat|0.015676 peach|0.015303 puff|0.015303 bisque|0.011906  "
		}
	}
}
