{
	"add": {
		"doc": {
			"id": "90597e99ad8c7a910f556470f1e0e0e0116ed56177f939345cad97e87ad752d4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Emile_Durkheim.jpg/120px-Emile_Durkheim.jpg",
				"previous": "Portal:Society/Featured biography/22",
				"after": "David Émile Durkheim (French: [emil dyʁkɛm] or [dyʁkajm]; April 15, 1858 – November 15, 1917) was a French sociologist. He formally established the academic discipline and, with Karl Marx and Max Weber, is commonly cited as the principal architect of modern social science and father of sociology. Much of Durkheim's work was concerned with how societies could maintain their integrity and coherence in modernity; an era in which traditional social and religious ties are no longer assumed, and in which new social institutions have come into being. His first major sociological work was The Division of Labor in Society (1893). In 1895, he published his Rules of the Sociological Method and set up the first European department of sociology, becoming France's first professor of sociology. In 1898, he established the journal L'Année Sociologique. Durkheim's seminal monograph, Suicide (1897), a study of suicide rates amongst Catholic and Protestant populations, pioneered modern social research and served to distinguish social science from psychology and political philosophy. The Elementary Forms of Religious Life (1912), presented a theory of religion, comparing the social and cultural lives of aboriginal and modern societies. Durkheim was also deeply preoccupied with the acceptance of sociology as a legitimate science. He refined the positivism originally set forth by Auguste Comte, promoting what could be considered as a form of epistemological realism, as well as the use of the hypothetico-deductive model in social science. He remained a dominant force in French intellectual life until his death in 1917, presenting numerous lectures and published works on a variety of topics, including the sociology of knowledge, morality, social stratification, religion, law, education, and deviance. Durkheimian terms such as \"collective consciousness\" have since entered the popular lexicon.",
			"color": " "
		}
	}
}
