{
	"add": {
		"doc": {
			"id": "905da379e777ab7a86ec05f1f2078a9d79af2ab3b7c1cd447e03990f1e30a1d6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Elias_Boudinot.jpg/170px-Elias_Boudinot.jpg",
				"previous": "It is unknown exactly when production of the new design began, as precise records relating to design were not kept at that time.[5] R.W. Julian, however, places the beginning of production in either late September or early October 1795,[5] while Taxay asserts that the first new silver dollars were struck in October.[8] In September 1795, de Saussure wrote his resignation letter to President Washington.[9] In his letter, de Saussure mentioned the unauthorized silver standard and suggested that Congress be urged to make the standard official, but this was not done.[9] In response to de Saussure's letter, Washington expressed his displeasure in the resignation, stating that he had viewed de Saussure's tenure with \"entire satisfaction\".[10] As de Saussure's resignation would not take effect until October, the president was given time to select a replacement.[9]",
				"after": "The person chosen to fill the position was statesman and former congressman Elias Boudinot. Upon assuming his duties at the Mint on October 28, Boudinot was informed of the silver standard that had been used since the first official silver coins were struck.[9] He immediately ordered that this practice be ceased and that coinage would begin in the 89.2% fineness approved by the Coinage Act of 1792.[9] The total production of 1795 dollars (including both the Flowing Hair and Draped Bust types) totalled 203,033.[11] It is estimated that approximately 42,000 dollars were struck bearing the Draped Bust design.[12] Boudinot soon ordered that production of minor denominations be increased. Later, assayer Albian Cox died suddenly from a stroke in his home on November 27, 1795, leaving the vital post of assayer vacant.[9] This, together with Boudinot's increased focus on smaller denominations, as well as a lull in private bullion deposits (the fledgling Mint's only source of bullion), caused a decrease in silver dollar production in 1796.[13] The total mintage for 1796 was 79,920,[12] which amounts to an approximate 62% reduction from the previous year's total.",
			"color": "dim|0.19342 gray|0.19342 dim|0.19342 grey|0.19342 gray|0.18441 grey|0.18441 dark|0.14871 slate|0.14871 gray|0.14871 black|0.13742 dark|0.084701 gray|0.084701 dark|0.084701 grey|0.084701 silver|0.041814 slate|0.031544 gray|0.031544 light|0.029484 gray|0.029484 light|0.029484 grey|0.029484 light|0.026316 slate|0.026316 gray|0.026316 gainsboro|0.023049 rosy|0.018769 brown|0.018769  "
		}
	}
}
