{
	"add": {
		"doc": {
			"id": "9066db9ec5a14448cd77da87de464e5f2793f33ad8b410bb020893e5abb41563",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Rogier_van_der_Weyden_-_Portrait_of_a_Lady_-_Google_Art_Project.jpg/200px-Rogier_van_der_Weyden_-_Portrait_of_a_Lady_-_Google_Art_Project.jpg",
				"previous": "The first generation were literate, well educated and mostly from middle-class backgrounds. Van Eyck and van der Weyden were both highly placed in the Burgundian court, with van Eyck in particular assuming roles for which an ability to read Latin was necessary; inscriptions found on his panels indicate that he had a good knowledge of both Latin and Greek.[31][B] A number of artists were financially successful and much sought-after in the Low Countries and by patrons across Europe.[32] Many artists, including David and Bouts, could afford to donate large works to the churches, monasteries and convents of their choosing. Van Eyck was a valet de chambre at the Burgundian court and had easy access to Philip the Good.[32] Van der Weyden was a prudent investor in stocks and property; Bouts was commercially minded and married the heiress Catherine \"Mettengelde\" (\"with the money\").[33][34] Vrancke van der Stockt invested in land.[31]",
				"after": "The Early Netherlandish masters' influence reached artists such as Stefan Lochner and the painter known as the Master of the Life of the Virgin, both of whom, working in mid-15th-century Cologne, drew inspiration from imported works by van der Weyden and Bouts.[36] New and distinctive painterly cultures sprang up; Ulm, Nuremberg, Vienna and Munich were the most important artistic centres in the Holy Roman Empire at the start of the 16th century. There was a rise in demand for printmaking (using woodcuts or copperplate engraving) and other innovations borrowed from France and southern Italy.[25] Some 16th-century painters borrowed heavily from the previous century's techniques and styles. Even progressive artists such as Jan Gossaert made copies, such as his reworking of van Eyck's Madonna in the Church.[37] Gerard David linked the styles of Bruges and Antwerp, often travelling between the cities. He moved to Antwerp in 1505, when Quentin Matsys was the head of the local painters' guild, and the two became friends.[38]",
			"color": "tan|0.43863 brown|0.22529 dark|0.1064 gray|0.1064 dark|0.1064 grey|0.1064 silver|0.065761  "
		}
	}
}
