{
	"add": {
		"doc": {
			"id": "907f8344921dbc4f8d0c8335746de255f9f6c965527f4ddca5ef4cd32763b46a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Toison.jpg/170px-Toison.jpg",
			"previous": [],
				"after": "In 2007,[59] an important discovery was made which enabled a slew of activity to help scientists, historians and gemologists further explore the history of the Hope Diamond, as well as create replicas of the larger pieces, from which it had been cut, believed to have been owned by eighteenth-century French monarchs. A lead cast of the French Blue diamond was discovered in the gemmological collections of the National Museum of Natural History in Paris, reported in a bilingual French–English press release,[60] and the unique finding triggered an investigation by an international team of researchers into the stone's history. It was an important event since previously investigators had to rely on two-dimensional sketches of the diamond, but now they had a three-dimensional structure with which to apply techniques such as computer-aided drawing analysis. It allowed creation of the first numeric reconstruction of the French Blue including a virtual snapshot video. Even the emblem of the Golden Fleece of Louis XV was numerically reconstructed around the French Blue, including the \"Côte de Bretagne\" spinel of 107 carats (21.4 g), the \"Bazu\" diamond of 32.62 carats (6.524 g), 3 oriental topazes (yellow sapphires), five brillants of up to 5 carats (1,000 mg) brillants and nearly 300 smaller diamonds. Special care was taken to reconstruct the major gemstones precisely by using CAD analysis as well as knowledge of historical gemsetting techniques. As part of the investigation, the \"Tavernier Blue\" diamond was also reconstructed from the original French edition of Tavernier's Voyages (rather than the later London edition that somewhat distorted and modified Tavernier's original figures), and the Smithsonian Institution provided ray-tracing and optical spectroscopic data about the Hope diamond. These events culminated in an event and a documentary to celebrate the making of these replicas, with celebrations by the French museum including H. Horovitz, Martin du Daffoy who was the historian and jeweller from the Place Vendôme in Paris, as well as directors and leaders from the museum. The event was filmed by Gédéon programmes for a documentary on the French Blue diamond, to be presented by 2011 worldwide.",
			"color": "wheat|0.20286 dark|0.10055 gray|0.10055 dark|0.10055 grey|0.10055 dark|0.099517 khaki|0.099517 gray|0.072648 grey|0.072648 silver|0.054816 rosy|0.050032 brown|0.050032 pale|0.045149 golden|0.045149 rod|0.045149 dim|0.043455 gray|0.043455 dim|0.043455 grey|0.043455 blanched|0.042452 almond|0.042452 light|0.029228 golden|0.029228 rod|0.029228 yellow|0.029228 light|0.028059 gray|0.028059 light|0.028059 grey|0.028059 khaki|0.025153 gainsboro|0.021292 light|0.019396 slate|0.019396 gray|0.019396 slate|0.019016 gray|0.019016 beige|0.014254 papaya|0.013557 whip|0.013557 light|0.010845 steel|0.010845 blue|0.010845 antique|0.010513 white|0.010513 tan|0.0096449 lemon|0.0078025 chiffon|0.0078025 white|0.0062963 smoke|0.0062963 alice|0.0061685 blue|0.0061685 bisque|0.005278 powder|0.0051642 blue|0.0051642 light|0.0050294 cyan|0.0050294 azure|0.0049428  "
		}
	}
}
