{
	"add": {
		"doc": {
			"id": "90922fe34eb6fb396875216d12fb2b95c919dc31a39380db9abdf9e7cb1d786b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Pigment_Berliner_Blau.JPG/220px-Pigment_Berliner_Blau.JPG",
				"previous": "While colour printing in Japan dates to the 1640s, early ukiyo-e prints used only black ink. Colour was sometimes added by hand, using a red lead ink in tan-e prints, or later in a pink safflower ink in beni-e prints. Colour printing arrived in books in the 1720s, and in single-sheet prints in the 1740s, with a different block and printing for each colour. Early colours were limited to pink and green; techniques expanded over the following two decades to allow up to five colours.[173] The mid-1760s brought full-colour nishiki-e prints[173] made from ten or more woodblocks.[200] To keep the blocks for each colour aligned correctly registration marks called kentō were placed on one corner and an adjacent side.[173]",
				"after": "Printers used natural colour dyes made from mineral or vegetable sources. The dyes had a translucent quality that allowed a variety of colours to be mixed from primary red, blue, and yellow pigments.[201] In the 18th century, Prussian blue became popular, and was particularly prominent in the landscapes of Hokusai and Hiroshige,[201] as was bokashi, where the printer produced gradations of colour or the blending of one colour into another.[202] Cheaper and more consistent synthetic aniline dyes arrived from the West in 1864. The colours were harsher and brighter than traditional pigments, and the effects could be garish. The Meiji government promoted their use as part of broader policies of Westernization.[203]",
			"color": "silver|0.20823 light|0.20159 gray|0.20159 light|0.20159 grey|0.20159 dark|0.17854 gray|0.17854 dark|0.17854 grey|0.17854 gainsboro|0.15813 cadet|0.075487 blue|0.075487 gray|0.040408 grey|0.040408 dim|0.035182 gray|0.035182 dim|0.035182 grey|0.035182 light|0.03131 slate|0.03131 gray|0.03131 slate|0.030249 gray|0.030249 white|0.023899 smoke|0.023899 dark|0.0094062 slate|0.0094062 gray|0.0094062  "
		}
	}
}
