{
	"add": {
		"doc": {
			"id": "9094512974d0ae08ac9967c1f004a7b7c707748ab2f1e03e76e7439a31accbb9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Goldcrest_-_Winter_-_Mote_Park%2C_Maidstone%2C_Kent%2C_UK.JPG/220px-Goldcrest_-_Winter_-_Mote_Park%2C_Maidstone%2C_Kent%2C_UK.JPG",
				"previous": "Outside the breeding season, small groups of goldcrests maintain exclusive winter feeding territories, which they defend against neighbouring groups. As they roam around their territory, they frequently join loose flocks of other wanderers such as tits and warblers.[6] This kinglet, like other species that prefer mixed-species foraging flocks in winter, hunts over a greater range of heights and vegetation types than when feeding alone. For species that tend to feed in flocks, foraging success while in a flock was about twice that for solitary birds.[49] A consequence of feeding in a flock is that foraging sites may be restricted to avoid competition with other species. In a Swedish study, coal tits and goldcrests foraged in the outer foliage, while the larger willow and European crested tits used the inner canopy. In sites where the numbers of willow and crested tits was artificially reduced, goldcrests and coal tits extended their foraging to include the inner canopy, but did not do so where the larger tits were retained.[50] In some areas, wintering birds have developed the habit of coming to feeding stations and bird tables to take fat, sometimes with warblers such as the common chiffchaff and blackcap.[5]",
			"after": [],
			"color": "dark|0.2309 gray|0.2309 dark|0.2309 grey|0.2309 silver|0.22788 light|0.20919 gray|0.20919 light|0.20919 grey|0.20919 gainsboro|0.14868 gray|0.047113 grey|0.047113 light|0.02993 steel|0.02993 blue|0.02993 lavender|0.022999 dim|0.016852 gray|0.016852 dim|0.016852 grey|0.016852 light|0.01268 slate|0.01268 gray|0.01268 alice|0.0072234 blue|0.0072234 slate|0.0065885 gray|0.0065885 light|0.0058602 blue|0.0058602 white|0.0056475 smoke|0.0056475 ghost|0.004693 white|0.004693 dark|0.0043703 slate|0.0043703 gray|0.0043703 azure|0.003372 light|0.0028888 cyan|0.0028888 powder|0.0027811 blue|0.0027811  "
		}
	}
}
