{
	"add": {
		"doc": {
			"id": "9099e7ae8e78135423851fbcfaf67301a427387f29a57d0569d81c16f1ee6158",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Petronila_Ramon_Berenguer.jpg/200px-Petronila_Ramon_Berenguer.jpg",
				"previous": "Córdoba, the capital of the caliphate since Abd-ar-Rahman III, was the largest, richest and most sophisticated city in western Europe. Mediterranean trade and cultural exchange flourished. Muslims imported a rich intellectual tradition from the Middle East and North Africa. Muslim and Jewish scholars played an important part in reviving and expanding classical Greek learning in Western Europe. Some important philosophers at the time were Averroes, Ibn Arabi and Maimonides. The Romanised cultures of the Iberian Peninsula interacted with Muslim and Jewish cultures in complex ways, giving the region a distinctive culture.[23] Outside the cities, where the vast majority lived, the land ownership system from Roman times remained largely intact as Muslim leaders rarely dispossessed landowners and the introduction of new crops and techniques led to an expansion of agriculture.",
				"after": "In the 11th century, the Muslim holdings fractured into rival Taifa kingdoms, allowing the small Christian states the opportunity to greatly enlarge their territories.[23] The arrival from North Africa of the Islamic ruling sects of the Almoravids and the Almohads restored unity upon the Muslim holdings, with a stricter, less tolerant application of Islam, and saw a revival in Muslim fortunes. This re-united Islamic state experienced more than a century of successes that partially reversed Christian gains.",
			"color": "black|0.18344 dim|0.14708 gray|0.14708 dim|0.14708 grey|0.14708 dark|0.054684 salmon|0.054684 coral|0.052612 sienna|0.052464 sandy|0.04314 brown|0.04314 rosy|0.037295 brown|0.037295 gray|0.035852 grey|0.035852 tomato|0.03378 light|0.030662 gray|0.030662 light|0.030662 grey|0.030662 silver|0.030228 misty|0.026256 rose|0.026256 gainsboro|0.025148 dark|0.025011 gray|0.025011 dark|0.025011 grey|0.025011 light|0.024185 slate|0.024185 gray|0.024185 slate|0.022865 gray|0.022865 tan|0.015823 indian|0.013973 red|0.013973 light|0.013135 salmon|0.013135 peach|0.012156 puff|0.012156  "
		}
	}
}
