{
	"add": {
		"doc": {
			"id": "90a68d8034b145811a3754630d570933d8b6d74c90310eaab195cfd6be8fb818",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Tonalist_and_Rosario_Belmont_2014_02.png/220px-Tonalist_and_Rosario_Belmont_2014_02.png",
				"previous": "California Chrome's loss extended the longest Triple Crown drought in history. He became the twelfth straight horse to fail in the Belmont after winning the first two legs of the contest.[2] (A thirteenth horse, I’ll Have Another, did not compete in the Belmont due to injury.) Espinoza felt that something wasn't right with California Chrome when the horse didn't break boldly, and he held the horse back a bit instead of going to the lead. Midway through the race he took the horse to the outside to give him running room, but the horse did not unleash his usual burst of speed.[11] \"As soon as he came out of the gate, he wasn't the same,\" Espinoza remarked after the race.[2] Initial post-race analysts thought that California Chrome had stepped on his own feet, or \"grabbed a quarter\" in equestrian parlance, as he had some blood on his right front heel.[11] Further review of the video and photos of the race showed that the horse next to him, Matterhorn, accidentally stepped on California Chrome as both horses broke from the gate. As a result, he had run the race with a \"chunk\" of tissue taken out of his right front heel, and also had a cut on his tendon that was not serious. Trainer Art Sherman said that both injuries would heal, probably in two or three weeks, but after that, he wanted to turn out California Chrome on pasture for a rest period of six or seven weeks, adding \"Hey listen, we'll be here to fight another day, I'm just happy he's all in one piece.\"[12]",
				"after": "After the race, California Chrome co-owner Steve Coburn said the horses who had not taken part in the Kentucky Derby or Preakness Stakes took \"the coward's way out\".[2] He predicted he would not see another Triple Crown winner in his lifetime due to fresh horses coming in at each stage of the contest; including Tonalist, six of the last eight Belmont winners did not compete in the first two legs of the Triple Crown.[2] Two days later, he apologized for the remarks, saying he wanted to tell the owners of Tonalist, \"Congratulations, you've got a fantastic horse ... He won the race fair and square. He deserved to win.\"[13]",
			"color": "rosy|0.33643 brown|0.33643 black|0.15286 tan|0.096049 dark|0.032998 salmon|0.032998 dim|0.031531 gray|0.031531 dim|0.031531 grey|0.031531 light|0.025719 salmon|0.025719 peach|0.02541 puff|0.02541 burly|0.023447 wood|0.023447 gray|0.022369 grey|0.022369 bisque|0.01611  "
		}
	}
}
