{
	"add": {
		"doc": {
			"id": "90a968cc18e47f84ccbe6e9ce6ef7a04386f6534b22c1844662012c57e0c1e30",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Banksia_violacea.jpg/220px-Banksia_violacea.jpg",
			"previous": [],
				"after": "Banksia violacea grows as a shrub up to 1.5 m (5 ft) tall, with narrow leaves 1–2 cm (0.4–0.8 in) long and about 0.15 cm (0.06 in) wide.[2] New growth occurs in summer, and flowering ranges from November to April with a peak in February, but can be irregular in timing.[3] Flowers arise from typical Banksia \"flower spikes\", and the inflorescences are made up of hundreds of pairs of flowers densely packed in a spiral around a woody axis. Roughly spherical with a diameter of 2–3 cm (0.8–1.2 in), the flower spikes arise from lateral stems lie partly within the foliage. Unusually for Banksia species, the inflorescences are often violet in colour, ranging anywhere from a dark violet-black through various combinations of violet and greenish-yellow in less pigmented blooms. Each flower consists of a tubular perianth made up of four fused tepals, and one long wiry style. The styles are hooked rather than straight, and are initially trapped inside the upper perianth parts, but break free at anthesis. The old flowers gradually fade to brown. The fruiting structure or follicle is a stout woody \"cone\", with a hairy appearance caused by the persistence of old withered flower parts.[4] These follicles are crowded around the globular spike (called an infructescence at this point) and are oval to rhomboid, although the crowding makes some irregularly shaped. They measure 1–2.5 cm (0.4–1 in) long, 0.6 cm (0.2 in) high and 0.8–2.2 cm (0.3–0.9 in) wide. They are quite flattened and lack a ridge along the valve line. When young, the follicles are greenish in colour and slightly sticky, and covered in fine white hairs, fading to tan or grey with age. They open with fire, releasing a winged wedge-shaped (cuneate) seed 2–2.5 cm (0.8–1 in) long. The mottled dark grey seed body is falcate (crescent-shaped) and measures 1.2–1.8 cm (0.5–0.7 in) long and 0.2–0.25 cm (0.1 in) wide, with a flattened dark brown wing 1.1–1.7 cm (0.4–0.5 in) wide. The woody separator has the same dimensions as the seed.[2]",
			"color": " "
		}
	}
}
