{
	"add": {
		"doc": {
			"id": "90b5f1e56677c1047566f2d4bff15bda6339682dfe27bee761510e2946e22923",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Rogier_van_der_Weyden_%281399of1400-1464%29_-_Buste_van_Ste._Catharina_-_Lissabon_Museu_Calouste_Gulbenkian_21-10-2010_13-11-07.jpg/220px-Rogier_van_der_Weyden_%281399of1400-1464%29_-_Buste_van_Ste._Catharina_-_Lissabon_Museu_Calouste_Gulbenkian_21-10-2010_13-11-07.jpg",
				"previous": "Virgin and Child with Saints,[23] a drawing in Stockholm's Nationalmuseum, is believed to be a study of a portion of the original altarpiece by a follower of van der Weyden,[24] who possibly may have been the Master of the Koberger Ründblatter. The drawing has a loosely sketched background and shows, from left to right: an unidentified bishop saint with mitre and crosier making a blessing gesture; a narrow gap with a few wavy vertical lines suggesting a start at the outline of a further kneeling figure; a barefoot bearded figure in a rough robe identified as Saint John the Baptist; a seated Virgin holding on her lap the Christ Child who leans to the right, looking at a book; and holding the book, a kneeling beardless male identified as John the Evangelist. The drawing stops at the end of John's robe, at about the point on the London panel where Joseph's walking stick meets John and the Magdalene's robes.[24] This suggests that the Magdalene panel was the first to be cut from the larger work.",
				"after": "At an unknown point before 1811, the original altarpiece was broken into at least three pieces,[25] possibly due to damage, although The Magdalen fragment is in good condition. The black overpaint was likely added after the early 17th century when Netherlandish painting had fallen from favour and was unfashionable. Campbell believes that after the removal of the background detail \"it looked sufficiently like a genre piece to hang in a well-known collection of Dutch seventeenth-century paintings\".[7] From the size of three surviving panels in relation to the drawing, it is estimated that the original was at least 1 m high by 1.5 m wide; the bishop and the Magdalene seem to clearly mark the horizontal extremities, but the extent of the picture above and below the surviving elements and the drawing cannot be judged. Such a size is comparable with smaller altarpieces of the period.[24] The background was overpainted with a thick layer of black/brown pigment until it was cleaned in 1955; it was only after the layer's removal that it was linked to the upper body and head of Joseph from the Lisbon piece. These two works were not recorded in inventory until 1907, when they appear in the collection of Léo Lardus in Suresnes, France.[23]",
			"color": "tan|0.52582 burly|0.43165 wood|0.43165 black|0.03604  "
		}
	}
}
