{
	"add": {
		"doc": {
			"id": "90b95a1e9e67192e2c9369d1a3fe2cac6522193b73281bb04481f3631f4bbf6a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Wooden_hourglass_3.jpg/59px-Wooden_hourglass_3.jpg",
				"previous": "Portal:Technology/Selected articles/39",
				"after": "The history of timekeeping devices begins thousands of years ago with the invention of the sexagesimal system of time measurement in approximately 2000 BC, in Sumer. The Ancient Egyptians divided the day into two 12-hour periods and used large obelisks to track the movement of the Sun. They also developed water clocks, which were probably first used in the Precinct of Amun-Re, and later outside Egypt as well. Other ancient timekeeping devices include the candle clock, used in China, Japan, England, and Iraq; the timestick, used in India and Tibet, as well as some parts of Europe; and the hourglass, which functioned similarly to a water clock. The first clock with an escapement, which transferred rotational energy into discrete motions, appeared in China in the 8th century, and Muslim engineers invented weight-driven clocks in the 11th century. Mechanical clocks were introduced to Europe at the turn of the 14th century, and became the standard timekeeping device until the 20th century. During the 20th century, quartz oscillators were invented, followed by atomic clocks. Atomic clocks are far more accurate than any previous timekeeping device, and are used to calibrate other clocks and to calculate the proper time on Earth; a standardized civil system, Coordinated Universal Time, is based on atomic time.",
			"color": "light|0.10292 gray|0.10292 light|0.10292 grey|0.10292 tan|0.10025 gainsboro|0.087324 silver|0.084073 gray|0.070874 grey|0.070874 dark|0.064922 gray|0.064922 dark|0.064922 grey|0.064922 dim|0.053587 gray|0.053587 dim|0.053587 grey|0.053587 white|0.038391 smoke|0.038391 sea|0.036781 shell|0.036781 linen|0.036272 floral|0.031361 white|0.031361 snow|0.030938 white|0.026277 ghost|0.025471 white|0.025471 mint|0.024834 cream|0.024834 alice|0.020932 blue|0.020932 lavender|0.019342 blush|0.019342 azure|0.01856 antique|0.017585 white|0.017585 old|0.016007 lace|0.016007 misty|0.014278 rose|0.014278 light|0.014107 slate|0.014107 gray|0.014107 saddle|0.013909 brown|0.013909 ivory|0.011792 slate|0.010624 gray|0.010624  "
		}
	}
}
