{
	"add": {
		"doc": {
			"id": "90ba612f9aa6f4d330ba5c7f0d250aca44a131101e0132f921db91de9ba7ae5b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Babakotia_radofilai.jpg/170px-Babakotia_radofilai.jpg",
				"previous": "In a 1996 review of the first edition in the International Journal of Primatology, Lisa Gould spoke favorably of the book, citing passages about lemur descriptions from the 17th and 18th centuries that she found entertaining and informative. She was particularly fascinated with Chapter four, \"The Extinct Lemurs\", and the reconstructions by Nash that accompanied the descriptions of morphology, behavior, and diet. She praised Nash's artwork as being one of the most enjoyable aspects of the book. The book was hailed as an excellent source for identifying lemur species for both tourists and researchers.[1] The book was also briefly reviewed in College & Research Libraries News by George Eberhart in April 1996. The review noted Conservation International's promotion of ecotourism while also providing a count of the book's illustrations: 35 color plates, 50 distribution maps, and 135 drawings of postures and behaviors.[51]",
				"after": "In the 1996 edition (volume 2) of Lemur News, Alison Jolly praised the first edition for its \"contribution to knowledge in general\" and \"its effect on its intended audience.\" Like Gould, Jolly praised the work as a field guide, as well as Nash's high-quality illustrations. She noted the attraction of Nash's subfossil lemur reconstruction, claiming that it was \"rapidly becoming one of the most pirated single book illustration on the primate lecture-slide circuit.\" Jolly went on to praise the thoroughness of the natural history information provided for each species, including recently described species, noting that the information covered existing knowledge better than any other published literature, even when only a single paragraph was provided for poorly known species. The book was recommended not only for lemur specialists, but also for tourists, hoping it would spark an interest in ecotourism in impoverished Madagascar. The checklist of species, as well as the information on where to most easily spot them, earned a special mention from Jolly, who could only boast seeing 30 of the 50 known species at that time. Finally, the \"most significant and most appreciative\" audience Jolly mentioned was the Malagasy researchers, to whom Mittermeier reportedly gave 50 copies of the book during a workshop in 1995.[7]",
			"color": "dark|0.6655 olive|0.6655 green|0.6655 dim|0.16967 gray|0.16967 dim|0.16967 grey|0.16967 black|0.076803 gray|0.071551 grey|0.071551  "
		}
	}
}
