{
	"add": {
		"doc": {
			"id": "90d07dbf576ce52b0ded069da2d77996d24ede6890f53140211525a115f731da",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/IglesiaDeSanPablo20110905170422P1120849.jpg/220px-IglesiaDeSanPablo20110905170422P1120849.jpg",
				"previous": "Spain was Europe's leading power throughout the 16th century and most of the 17th century, a position reinforced by trade and wealth from colonial possessions and became the world's leading maritime power. It reached its apogee during the reigns of the first two Spanish Habsburgs—Charles I (1516–1556) and Philip II (1556–1598). This period saw the Italian Wars, the Revolt of the Comuneros, the Dutch Revolt, the Morisco Revolt, clashes with the Ottomans, the Anglo-Spanish War and wars with France.[34]",
				"after": "Through exploration and conquest or royal marriage alliances and inheritance, the Spanish Empire expanded to include vast areas in the Americas, islands in the Asia-Pacific area, areas of Italy, cities in Northern Africa, as well as parts of what are now France, Germany, Belgium, Luxembourg, and the Netherlands. The first circumnavigation of the world was carried out in 1519-1521. It was the first empire on which it was said that the sun never set. This was an Age of Discovery, with daring explorations by sea and by land, the opening-up of new trade routes across oceans, conquests and the beginnings of European colonialism. Spanish explorers brought back precious metals, spices, luxuries, and previously unknown plants, and played a leading part in transforming the European understanding of the globe.[35] The cultural efflorescence witnessed during this period is now referred to as the Spanish Golden Age. The expansion of the empire caused immense upheaval in the Americas as the collapse of societies and empires and new diseases from Europe devastated American populations. The rise of humanism, the Counter-Reformation and new geographical discoveries and conquests raised issues that were addressed by the intellectual movement now known as the School of Salamanca, which developed the first modern theories of what are now known as international law and human rights.",
			"color": "gray|0.10376 grey|0.10376 light|0.10323 gray|0.10323 light|0.10323 grey|0.10323 gainsboro|0.090429 antique|0.080825 white|0.080825 silver|0.080709 dark|0.068494 gray|0.068494 dark|0.068494 grey|0.068494 dim|0.056367 gray|0.056367 dim|0.056367 grey|0.056367 linen|0.054907 black|0.042087 old|0.040635 lace|0.040635 tan|0.034208 sea|0.031078 shell|0.031078 floral|0.028055 white|0.028055 beige|0.02681 white|0.025988 smoke|0.025988 ivory|0.019162 papaya|0.016675 whip|0.016675 mint|0.013744 cream|0.013744 snow|0.012115 blanched|0.011713 almond|0.011713 honeydew|0.0083206 bisque|0.0071513 corn|0.0068123 silk|0.0068123 white|0.0062581  "
		}
	}
}
