{
	"add": {
		"doc": {
			"id": "90d2b3e727cd816b1a74b7f8701fdd0f09cfc3185f8800f8f3d12b6442b291a4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Eckfeldt_press.jpg/220px-Eckfeldt_press.jpg",
				"previous": "During Eckfeldt's childhood, the thirteen British colonies along the Atlantic coast of what is now the United States revolted, and so the United States of America secured its independence. After the United States Constitution was ratified, Congress and many government offices came to be housed in Philadelphia, including the newborn Mint of the United States.[5] Adam Eckfeldt built the first screw press for the new facility in 1792, the same year that the Mint Act of 1792 was passed by Congress authorizing a mint, and cut the obverse die for the experimental Birch cent of that year.[3] He also built other machinery for the Mint, and helped superintend the early coining.[1][6]",
				"after": "In 1792, the Mint acquired three balances from Eckfeldt, who also lent the Mint his lathe (used for turning dies).[7] Eckfeldt is believed to have made the die from which the 1792 half disme, considered by some the first official U.S. coin, was struck—in 1829, a visitor to the Mint met Eckfeldt and later described him as \"an artist [who] made the first die used in it\".[8] Other later accounts document Eckfeldt's role in this striking: an 1863 auction sold a half disme supposedly given by Eckfeldt to demonstrate his work. Eckfeldt is given as the source for the tradition that the half dismes were struck at the request of President George Washington to be used as presents.[9] Eckfeldt operated his screw press to strike these roughly 1,500 pieces on July 13, 1792.[3] Since the first Philadelphia Mint was still under construction at the time, these coins were produced in the cellar of John Harper, saw maker, at Sixth and Cherry Streets in Philadelphia.[5][10] In his annual message to Congress late that year, Washington noted the ongoing construction of a mint building and stated: \"There has also been a small beginning in the coinage of half dismes, the want of small coins in circulation calling the first attention to them.\"[11]",
			"color": "black|0.62762 dim|0.28526 gray|0.28526 dim|0.28526 grey|0.28526 gray|0.043588 grey|0.043588 khaki|0.01556 dark|0.010849 khaki|0.010849  "
		}
	}
}
