{
	"add": {
		"doc": {
			"id": "90de5bd1dba352c48053cce6117547d7559a1b8addabcfba4818abfc92b25a3f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/FishingCormorants.jpg/170px-FishingCormorants.jpg",
				"previous": "Domesticated birds raised for meat and eggs, called poultry, are the largest source of animal protein eaten by humans; in 2003, 76 million tons of poultry and 61 million tons of eggs were produced worldwide.[205] Chickens account for much of human poultry consumption, though domesticated turkeys, ducks, and geese are also relatively common. Many species of birds are also hunted for meat. Bird hunting is primarily a recreational activity except in extremely undeveloped areas. The most important birds hunted in North and South America are waterfowl; other widely hunted birds include pheasants, wild turkeys, quail, doves, partridge, grouse, snipe, and woodcock.[206] Muttonbirding is also popular in Australia and New Zealand.[207] Though some hunting, such as that of muttonbirds, may be sustainable, hunting has led to the extinction or endangerment of dozens of species.[208]",
				"after": "Other commercially valuable products from birds include feathers (especially the down of geese and ducks), which are used as insulation in clothing and bedding, and seabird feces (guano), which is a valuable source of phosphorus and nitrogen. The War of the Pacific, sometimes called the Guano War, was fought in part over the control of guano deposits.[209]",
			"color": "black|0.19505 dim|0.17907 gray|0.17907 dim|0.17907 grey|0.17907 gray|0.13742 grey|0.13742 dark|0.11597 gray|0.11597 dark|0.11597 grey|0.11597 silver|0.060353 light|0.030386 gray|0.030386 light|0.030386 grey|0.030386 antique|0.024328 white|0.024328 rosy|0.0215 brown|0.0215 gainsboro|0.018619 linen|0.015413 misty|0.015158 rose|0.015158 papaya|0.015135 whip|0.015135 peach|0.01507 puff|0.01507 blanched|0.013425 almond|0.013425 old|0.012866 lace|0.012866 bisque|0.011958 beige|0.0099359 corn|0.0094177 silk|0.0094177 tan|0.0094135 slate|0.0091328 gray|0.0091328 sea|0.0090291 shell|0.0090291 floral|0.0079968 white|0.0079968  "
		}
	}
}
