{
	"add": {
		"doc": {
			"id": "90ea17b88c60208f7ded6e98b52451b2663a36a4f53893e5ec0e81237ba6ddac",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Border_Collie_sheepdog_trial.jpg/220px-Border_Collie_sheepdog_trial.jpg",
			"previous": [],
				"after": "Sheep are flock animals and strongly gregarious; much sheep behavior can be understood on the basis of these tendencies. The dominance hierarchy of sheep and their natural inclination to follow a leader to new pastures were the pivotal factors in sheep being one of the first domesticated livestock species.[46] Furthermore, in contrast to the red deer and gazelle (two other ungulates of primary importance to meat production in prehistoric times), sheep do not defend territories although they do form home ranges.[47] All sheep have a tendency to congregate close to other members of a flock, although this behavior varies with breed,[13] and sheep can become stressed when separated from their flock members.[1] During flocking, sheep have a strong tendency to follow and a leader may simply be the first individual to move. Relationships in flocks tend to be closest among related sheep: in mixed-breed flocks, subgroups of the same breed tend to form, and a ewe and her direct descendants often move as a unit within large flocks.[7] Sheep can become hefted to one particular local pasture (heft) so they do not roam freely in unfenced landscapes. Lambs learn the heft from ewes and if whole flocks are culled it must be retaught to the replacement animals.[1][48]",
			"color": "black|0.20214 light|0.074239 gray|0.074239 light|0.074239 grey|0.074239 silver|0.069972 dark|0.069892 gray|0.069892 dark|0.069892 grey|0.069892 gainsboro|0.062508 linen|0.049006 antique|0.0418 white|0.0418 gray|0.041541 grey|0.041541 dim|0.040465 gray|0.040465 dim|0.040465 grey|0.040465 sea|0.036422 shell|0.036422 old|0.035651 lace|0.035651 dark|0.034079 olive|0.034079 green|0.034079 floral|0.031586 white|0.031586 white|0.028997 smoke|0.028997 snow|0.021931 ivory|0.019525 mint|0.015523 cream|0.015523 misty|0.015237 rose|0.015237 white|0.014383 beige|0.014358 papaya|0.011102 whip|0.011102 tan|0.010553 lavender|0.010421 blush|0.010421  "
		}
	}
}
