{
	"add": {
		"doc": {
			"id": "91158a18b82f6652b2b53f22f0c4301be4ce01f836c3e2bb2e6d5bd8a4adaee8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/TasmanianDevil_1888.jpg/220px-TasmanianDevil_1888.jpg",
			"previous": [],
				"after": "The Tasmanian devil is the largest surviving carnivorous marsupial. It has a squat, thick build, with a large head and a tail which is about half its body length. Unusually for a marsupial, its forelegs are slightly longer than its hind legs, and devils can run up to 13 km/h (8.1 mph) for short distances. The fur is usually black, often with irregular white patches on the chest and rump (although approximately 16% of wild devils do not have white patches).[37][38] These markings suggest that the devil is most active at dawn and dusk, and they are thought to draw biting attacks toward less important areas of the body, as fighting between devils often leads to a concentration of scars in that region.[38] Males are usually larger than females, having an average head and body length of 652 mm (25.7 in), a 258 mm (10.2 in) tail and an average weight of 8 kg (18 lb). Females have an average head and body length of 570 mm (22 in), a 244 mm (9.6 in) tail and an average weight of 6 kg (13 lb),[37] although devils in western Tasmania tend to be smaller.[39] Devils have five long toes on their forefeet, four pointing to the front and one coming out from the side, which gives the devil the ability to hold food. The hind feet have four toes, and the devils have non-retractable claws.[35] The stocky devils have a relatively low centre of mass.[40]",
			"color": "black|0.20307 dim|0.10055 gray|0.10055 dim|0.10055 grey|0.10055 dark|0.080572 gray|0.080572 dark|0.080572 grey|0.080572 silver|0.071734 antique|0.060583 white|0.060583 light|0.059792 gray|0.059792 light|0.059792 grey|0.059792 gray|0.042796 grey|0.042796 gainsboro|0.03857 slate|0.035233 gray|0.035233 linen|0.03467 tan|0.028468 old|0.024467 lace|0.024467 misty|0.024021 rose|0.024021 light|0.021644 slate|0.021644 gray|0.021644 sea|0.019882 shell|0.019882 papaya|0.019643 whip|0.019643 rosy|0.01928 brown|0.01928 floral|0.015324 white|0.015324 blanched|0.012027 almond|0.012027 bisque|0.010772 beige|0.0096946 white|0.0089592 smoke|0.0089592 ivory|0.0089537 peach|0.0078821 puff|0.0078821  "
		}
	}
}
