{
	"add": {
		"doc": {
			"id": "9126ddf9dea989a63616900d31dfd24069472417212794ee84c6b81750bc27a9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Avianca_Douglas_DC-4_Volpati.jpg/220px-Avianca_Douglas_DC-4_Volpati.jpg",
			"previous": {
				"_ArrayType_": "double",
				"_ArraySize_": [0,0],
				"_ArrayData_": null
			},
				"after": "The airline traces its history back to 5 December 1919, in the city of Barranquilla, Colombia. Colombians Ernesto Cortissoz (the first President of the Airline), Rafael Palacio, Cristóbal Restrepo, Jacobo Correa and Aristides Noguera and Germans Werner Kämerer, Stuart Hosie and Alberto Tietjen founded the Colombo-German Company, called Sociedad Colombo-Alemana de Transporte Aéreo or SCADTA. The company accomplished their first flight between Barranquilla and the nearby town of Puerto Colombia using a Junkers F.13, transporting 57 pieces of mail. The flight was piloted by German Helmuth von Krohn. This and another aircraft of the same type were completely mechanically constructed monoplanes, the engines of which had to be modified to efficiently operate in the climate of the country. There were nine aircraft in the fleet with a total range of 850 km (528 mi) which could carry up to four passengers and two crewmen. Due to the topographic characteristics of the country and the lack of airports at the time, floats were adapted for two of the Junkers aircraft to make water landings in the rivers near different towns. Using these floats, Helmuth von Krohn was able to perform the first inland flight over Colombia on 20 October 1920, following the course of the Magdalena River; the flight took eight hours and required four emergency landings in the water.",
			"color": "dark|0.32969 gray|0.32969 dark|0.32969 grey|0.32969 gray|0.20434 grey|0.20434 dim|0.17935 gray|0.17935 dim|0.17935 grey|0.17935 black|0.091375 silver|0.043707 light|0.022443 gray|0.022443 light|0.022443 grey|0.022443 gainsboro|0.020925 white|0.01125 smoke|0.01125 alice|0.010839 blue|0.010839 ghost|0.010367 white|0.010367 lavender|0.010147 snow|0.0085803 lavender|0.0083459 blush|0.0083459 white|0.0075231 slate|0.0068019 gray|0.0068019 light|0.0064504 slate|0.0064504 gray|0.0064504 azure|0.006396 sea|0.0057091 shell|0.0057091 mint|0.0056609 cream|0.0056609  "
		}
	}
}
