{
	"add": {
		"doc": {
			"id": "9129ddb5514b8eceecf9afa8077dc3facd0696b6be9536fec9648c8ca5fad75a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Longestdinosaurs.svg/220px-Longestdinosaurs.svg.png",
			"previous": [],
				"after": "One of the best-known sauropods, Diplodocus was a very large long-necked quadrupedal animal, with a long, whip-like tail. Its forelimbs were slightly shorter than its hind limbs, resulting in a largely horizontal posture. The long-necked, long-tailed animal with four sturdy legs has been mechanically compared with a suspension bridge.[6] In fact, Diplodocus is the longest dinosaur known from a complete skeleton.[6] The partial remains of D. hallorum have increased the estimated length, though not as much as previously thought; when first described in 1991, discoverer David Gillette calculated it may have been up to 52 m (170 ft) long,[7] making it the longest known dinosaur (excluding those known from exceedingly poor remains, such as Amphicoelias). Some weight estimates ranged as high as 113 tons (125 US short tons). The estimated length was later revised downward to 33 metres (108 ft)[8] based on findings that show that Gillette had originally misplaced vertebrae 12–19 as vertebrae 20–27. The nearly complete Diplodocus skeleton at the Carnegie Museum of Natural History in Pittsburgh, Pennsylvania, on which estimates of Seismosaurus are based, also was found to have had its 13th tail vertebra come from another dinosaur, throwing size estimates for Seismosaurus further off. While dinosaurs such as Supersaurus were probably longer, fossil remains of these animals are only fragmentary.[9] Modern mass estimates for Diplodocus (exclusive of D. hallorum) have tended to be in the 10 to 16 tonne (11–17.6 ton) range: 10 tonnes (11 tons);[10] 11.5 tonnes (12.7 tons);[11] 12.7 tonnes (14 tons);[12] and 16 tonnes (17.6 tons).[13]",
			"color": "indian|0.39391 red|0.39391 rosy|0.065737 brown|0.065737 light|0.046405 steel|0.046405 blue|0.046405 misty|0.041639 rose|0.041639 brown|0.039497 dark|0.037896 sea|0.037896 green|0.037896 gainsboro|0.029075 light|0.028504 salmon|0.028504 coral|0.025731 dark|0.024558 salmon|0.024558 light|0.024347 gray|0.024347 light|0.024347 grey|0.024347 lavender|0.017549 lavender|0.017424 blush|0.017424 white|0.015601 smoke|0.015601 sea|0.013848 shell|0.013848 linen|0.013198 snow|0.011809 ghost|0.011339 white|0.011339 tan|0.010765 alice|0.010734 blue|0.010734 floral|0.0093994 white|0.0093994 white|0.0089837 mint|0.0087778 cream|0.0087778 light|0.0086922 blue|0.0086922 dark|0.0084224 gray|0.0084224 dark|0.0084224 grey|0.0084224 silver|0.0082982 honeydew|0.0080553 peach|0.0079415 puff|0.0079415 burly|0.0077193 wood|0.0077193 thistle|0.0075981 azure|0.0075944 antique|0.0065095 white|0.0065095  "
		}
	}
}
