{
	"add": {
		"doc": {
			"id": "912f0683518eedfb97572f68be4bc3c7ccc898a55952692e8265275d697b7592",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/AvHumboldt.jpg/220px-AvHumboldt.jpg",
			"previous": [],
				"after": "While the emerging field of Big History in its present state is generally seen as having emerged in the past two decades beginning around 1990, there have been numerous precedents going back almost 150 years. In the mid-19th century, Alexander von Humboldt's book Kosmos, and Robert Chambers's 1844 book Vestiges of the Natural History of Creation[15] were seen as early precursors to the field.[15] In a sense, Darwin's theory of evolution was, in itself, an attempt to explain a biological phenomenon by examining longer term cause-and-effect processes. In the first half of the 20th century, secular biologist Julian Huxley originated the term \"evolutionary humanism\".,[1] while around the same time the French Jesuit paleontologist Pierre Teilhard de Chardin examined links between cosmic evolution and a tendency towards complexification (including human consciousness), while envisaging compatibility between cosmology, evolution, and theology. In the mid and later 20th century, The Ascent of Man by Jacob Bronowski examined history from a multidisciplinary perspective. Later, Eric Chaisson explored the subject of cosmic evolution quantitatively in terms of the energy rate density, and the astronomer Carl Sagan wrote Cosmos.[1] Thomas Berry, a cultural historian, and the academic Brian Swimme explored meaning behind myths and encouraged academics to explore themes beyond organized religion.[1]",
			"color": "black|0.30473 burly|0.1293 wood|0.1293 tan|0.092962 wheat|0.060641 sandy|0.055252 brown|0.055252 bisque|0.04881 peru|0.041733 blanched|0.038063 almond|0.038063 peach|0.036205 puff|0.036205 moccasin|0.029173 papaya|0.02679 whip|0.02679 antique|0.020428 white|0.020428 corn|0.018448 silk|0.018448 navajo|0.018116 white|0.018116 sienna|0.014535 light|0.013875 golden|0.013875 rod|0.013875 yellow|0.013875 beige|0.01379 lemon|0.01337 chiffon|0.01337 light|0.010603 yellow|0.010603  "
		}
	}
}
