{
	"add": {
		"doc": {
			"id": "9146dcbc2e7903d6a62309bc0dcfe2d18b10c5f52f23a2bcc496dd15e907a5e0",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/0/0a/DNA_in_Monty_Python.jpg/220px-DNA_in_Monty_Python.jpg",
				"previous": "After leaving university Adams moved back to London, determined to break into TV and radio as a writer. An edited version of the Footlights Revue appeared on BBC2 television in 1974. A version of the Revue performed live in London's West End led to Adams being discovered by Monty Python's Graham Chapman. The two formed a brief writing partnership, earning Adams a writing credit in episode 45 of Monty Python for a sketch called \"Patient Abuse\". He is one of only two people outside the original Python members to get a writing credit (the other being Neil Innes).[12] The sketch plays on the idea of mind-boggling paper work in an emergency, a joke later incorporated into the Vogons' obsession with paperwork. Adams also contributed to a sketch on the album for Monty Python and the Holy Grail.",
				"after": "Adams had two brief appearances in the fourth series of Monty Python's Flying Circus. At the beginning of episode 42, \"The Light Entertainment War\", Adams is in a surgeon's mask (as Dr. Emile Koning, according to on-screen captions), pulling on gloves, while Michael Palin narrates a sketch that introduces one person after another but never gets started. At the beginning of episode 44, \"Mr. Neutron\", Adams is dressed in a pepper-pot outfit and loads a missile on to a cart driven by Terry Jones, who is calling for scrap metal (\"Any old iron...\"). The two episodes were broadcast in November 1974. Adams and Chapman also attempted non-Python projects, including Out of the Trees.",
			"color": "tan|0.44666 black|0.15205 dark|0.10984 slate|0.10984 gray|0.10984 burly|0.085908 wood|0.085908 dark|0.036697 salmon|0.036697 wheat|0.014536 dim|0.014171 gray|0.014171 dim|0.014171 grey|0.014171 cadet|0.013335 blue|0.013335 bisque|0.011087 peach|0.0108 puff|0.0108 gray|0.010077 grey|0.010077 antique|0.0091959 white|0.0091959 blanched|0.0087272 almond|0.0087272 beige|0.007445 papaya|0.007358 whip|0.007358 navajo|0.0070392 white|0.0070392 dark|0.0068849 gray|0.0068849 dark|0.0068849 grey|0.0068849  "
		}
	}
}
