{
	"add": {
		"doc": {
			"id": "91585e85d4fc91ac9e6966a9ca9c5e00f9ca6f598bed8586abc3cd6acf82abc7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/BlackVulture2.JPG/220px-BlackVulture2.JPG",
				"previous": "The black vulture lays its eggs on the ground in a wooded area, a hollow log, or some other cavity, seldom more than 3 m (9.8 ft) above the ground.[28] While it generally does not use any nesting materials, it may decorate the area around the nest with bits of brightly colored plastic, shards of glass, or metal items such as bottle caps.[36] Clutch size is generally two eggs, though this can vary from one to three. The egg is oval and on average measures 7.56 cm × 5.09 cm (2.98 in × 2.00 in). The smooth, gray-green, bluish, or white shell is variably blotched or spotted with lavender or pale brown around the larger end.[36] Both parents incubate the eggs, which hatch after 28 to 41 days.[36] Upon hatching, the young are covered with white down.[42] Both parents feed the nestlings, regurgitating food at the nest site. The young remain in the nest for two months, and after 75 to 80 days they are able to fly skillfully.[39] Predation of black vultures is relatively unlikely, though eggs and nestlings are readily eaten if found by mammalian predators such as raccoons, coatis and foxes. Due to its aggressiveness and size, few predators can threaten the fully-grown vulture. However, various eagles may kill vultures in conflicts and even the ornate hawk-eagle, a slightly smaller bird than the vulture, have preyed on adult black vultures.[48]",
				"after": "The black vulture is considered a threat by cattle ranchers due to its predation on newborn cattle.[49] The droppings produced by black vultures and other vultures can harm or kill trees and other vegetation.[50] The bird is also considered a threat to the safety of aerial traffic, especially when it congregates in large numbers in the vicinity of garbage dumps[51] — as is the case in the Rio de Janeiro Tom Jobim International Airport.[52]",
			"color": "black|0.29388 dim|0.16937 gray|0.16937 dim|0.16937 grey|0.16937 gray|0.12769 grey|0.12769 dark|0.11637 gray|0.11637 dark|0.11637 grey|0.11637 slate|0.062519 gray|0.062519 silver|0.058307 light|0.040216 slate|0.040216 gray|0.040216 light|0.025647 gray|0.025647 light|0.025647 grey|0.025647 gainsboro|0.015721 thistle|0.013971 light|0.0081542 steel|0.0081542 blue|0.0081542  "
		}
	}
}
