{
	"add": {
		"doc": {
			"id": "9159dd5fb64b1fbe09327801afaf6e11de62f70b220c3557a0b6bb8a07f7e7ae",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/1099jerusalem.jpg/170px-1099jerusalem.jpg",
				"previous": "Byzantine Jerusalem was conquered by the Arab armies of Umar ibn al-Khattab in 638 CE.[120] Among Muslims of Islam's earliest era it was referred to as Madinat bayt al-Maqdis (\"City of the Temple\")[121] which was restricted to the Temple Mount. The rest of the city \"... was called Iliya, reflecting the Roman name given the city following the destruction of 70 CE: Aelia Capitolina\".[122] Later the Temple Mount became known as al-Haram al-Sharif, “The Noble Sanctuary\", while the city around it became known as Bayt al-Maqdis,[123] and later still, al-Quds al-Sharif \"The Noble City\". The Islamization of Jerusalem began in the first year A.H. (623 CE), when Muslims were instructed to face the city while performing their daily prostrations and, according to Muslim religious tradition, Muhammad's night journey and ascension to heaven took place. After 13 years, the direction of prayer was changed to Mecca.[124][125] In 638 CE the Islamic Caliphate extended its dominion to Jerusalem.[126] With the Arab conquest, Jews were allowed back into the city.[127] The Rashidun caliph Umar ibn al-Khattab signed a treaty with Monophysite Christian Patriarch Sophronius, assuring him that Jerusalem's Christian holy places and population would be protected under Muslim rule.[128] Christian-Arab tradition records that, when led to pray at the Church of the Holy Sepulchre, the holiest site for Christians, the caliph Umar refused to pray in the church so that Muslims would not request conversion of the church to a mosque.[129] He prayed outside the church, where the Mosque of Umar (Omar) stands to this day, opposite the entrance to the Church of the Holy Sepulchre. According to the Gaullic bishop Arculf, who lived in Jerusalem from 679 to 688, the Mosque of Umar was a rectangular wooden structure built over ruins which could accommodate 3,000 worshipers.[130] When the Muslims went to Bayt Al-Maqdes for the first time, they searched for the site of the Al-Aqsa Mosque (\"The Farthest Mosque\") that was mentioned in Quran and Hadith according to Islamic beliefs. Contemporary Arabic and Hebrew sources say the site was full of rubbish, and that Arabs and Jews cleaned it.[131] The Umayyad caliph Abd al-Malik commissioned the construction of the Dome of the Rock in the late 7th century.[132] The 10th-century historian al-Muqaddasi writes that Abd al-Malik built the shrine in order to compete in grandeur with Jerusalem's monumental churches.[130] Over the next four hundred years Jerusalem's prominence diminished as Arab powers in the region jockeyed for control.[133] A messianic Karaite movement to gather in Jerusalem took place at the turn of the millennium, leading to a \"Golden Age\" of Karaite scholarship there, which was only terminated by the Crusades.[134]",
				"after": "Jerusalem was captured in 1073 by the Seljukid commander Atsız.[135] After Atsız was killed, the Suljukid prince Tutush I granted the city to Artuk Bey, another Seljukid commander, After Artuk's death in 1091 his sons Sökmen and Ilghazi governed in the city up to 1098 when the Fatimids captured the city.",
			"color": "tan|0.13644 burly|0.093904 wood|0.093904 rosy|0.056083 brown|0.056083 dark|0.045058 salmon|0.045058 peach|0.04207 puff|0.04207 sienna|0.040024 indian|0.039906 red|0.039906 wheat|0.033481 brown|0.029271 antique|0.027343 white|0.027343 bisque|0.026466 navajo|0.022871 white|0.022871 papaya|0.022145 whip|0.022145 blanched|0.022059 almond|0.022059 moccasin|0.019476 pale|0.019 golden|0.019 rod|0.019 old|0.018555 lace|0.018555 beige|0.018549 corn|0.018066 silk|0.018066 black|0.017655 linen|0.016278 floral|0.013503 white|0.013503 ivory|0.013469 light|0.012875 golden|0.012875 rod|0.012875 yellow|0.012875 light|0.012872 yellow|0.012872 dark|0.012845 gray|0.012845 dark|0.012845 grey|0.012845 lemon|0.012832 chiffon|0.012832  "
		}
	}
}
