{
	"add": {
		"doc": {
			"id": "915e1d4452c8cd92b8bfc62fb46fc678f3536fc02d8c161a842602e3e9564b57",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Whitetowerlondon.jpg/170px-Whitetowerlondon.jpg",
				"previous": "The White Tower is a keep (also known as a donjon), which was often the strongest structure in a medieval castle, and contained lodgings suitable for the lord – in this case the king or his representative.[10] According to military historian Allen Brown, \"The great tower [White Tower] was also, by virtue of its strength, majesty and lordly accommodation, the donjon par excellence\".[11] As one of the largest keeps in the Christian world,[12] the White Tower has been described as \"the most complete eleventh-century palace in Europe\".[13]",
				"after": "The White Tower, not including its projecting corner towers, measures 36 by 32 metres (118 by 105 ft) at the base, and is 27 m (90 ft) high at the southern battlements. The structure was originally three storeys high, comprising a basement floor, an entrance level, and an upper floor. The entrance, as is usual in Norman keeps, was above ground, in this case on the south face, and accessed via a wooden staircase which could be removed in the event of an attack. It was probably during Henry II's reign (1154–1189) that a forebuilding was added to the south side of the tower to provide extra defences to the entrance, but it has not survived. Each floor was divided into three chambers, the largest in the west, a smaller room in the north-east, and the chapel taking up the entrance and upper floors of the south-east.[14] At the western corners of the building are square towers, while to the north-east a round tower houses a spiral staircase. At the south-east corner there is a larger semi-circular projection which accommodates the apse of the chapel. As the building was intended to be a comfortable residence as well as a stronghold, latrines were built into the walls, and four fireplaces provided warmth.[13]",
			"color": "black|0.11265 olive|0.10132 drab|0.10132 silver|0.070606 dark|0.066748 gray|0.066748 dark|0.066748 grey|0.066748 light|0.063312 gray|0.063312 light|0.063312 grey|0.063312 antique|0.062246 white|0.062246 gainsboro|0.048964 linen|0.039769 gray|0.037342 grey|0.037342 old|0.032219 lace|0.032219 dim|0.028829 gray|0.028829 dim|0.028829 grey|0.028829 sea|0.026953 shell|0.026953 floral|0.025364 white|0.025364 beige|0.02521 dark|0.021677 olive|0.021677 green|0.021677 papaya|0.021416 whip|0.021416 white|0.021403 smoke|0.021403 tan|0.02133 ivory|0.019555 snow|0.015659 blanched|0.014565 almond|0.014565 mint|0.013851 cream|0.013851 corn|0.013519 silk|0.013519 white|0.01148 dark|0.010253 khaki|0.010253 honeydew|0.008531 bisque|0.0068164 lavender|0.0067855 blush|0.0067855 ghost|0.0065802 white|0.0065802 wheat|0.0061654  "
		}
	}
}
