{
	"add": {
		"doc": {
			"id": "916addc945802425495a855c9f2c9f969f91774dc24abf9f082e3987fdf854fe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/JGSDF_22nd_Inf._official.jpg/220px-JGSDF_22nd_Inf._official.jpg",
				"previous": "SDF soldiers are trained in the military self-defence art of toshu kakuto, developed in 1952 by Major Chiba Sansu from a synthesis of jujutsu, karate, aikijujutsu, boxing and wrestling. The techniques of toshu kakuto are simplified and direct, to allow for their application whilst in combat dress and carrying field kit. There is an emphasis on the rapid transmission of maximum force in strikes, and for this reason toshu kakuto eschews the fully rotated punches and instep kicks of most karate forms in favour of vertical thrust punches and straight heel kicks.[37]",
				"after": "The outline specified quotas of personnel and equipment for each force that were deemed necessary to meet its tasks. Particular elements of each force's mission were also identified. The GSDF was to defend against ground invasion and threats to internal security, be able to deploy to any part of the nation, and protect the bases of all three services of the Self-Defense Forces. The MSDF was to meet invasion by sea, sweep mines, patrol and survey the surrounding waters, and guard and defend coastal waters, ports, bays, and major straits. The ASDF was to render aircraft and missile interceptor capability, provide support fighter units for maritime and ground operations, supply air reconnaissance and air transport for all forces, and maintain airborne and stationary early warning units.[citation needed]",
			"color": "black|0.39617 dim|0.23115 gray|0.23115 dim|0.23115 grey|0.23115 gray|0.15886 grey|0.15886 dark|0.069453 gray|0.069453 dark|0.069453 grey|0.069453 dark|0.031121 slate|0.031121 gray|0.031121 silver|0.02148 slate|0.01783 gray|0.01783 light|0.014238 slate|0.014238 gray|0.014238 light|0.0092182 gray|0.0092182 light|0.0092182 grey|0.0092182 dark|0.0082933 khaki|0.0082933 dark|0.0079328 olive|0.0079328 green|0.0079328  "
		}
	}
}
