{
	"add": {
		"doc": {
			"id": "917416b461f5f1f0a6e7b41ab815ce5b8cf8b56812cb4d23cbccf6d87181e2e8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/El_Pardo_mapa.png/220px-El_Pardo_mapa.png",
				"previous": "Mount of El Pardo (Monte de El Pardo) is a mediterranean forest inside the city of Madrid. It is one of the best preserved Mediterranean Forests in Europe. The European Union has designated the Monte de El Pardo as a Special Protection Area for bird-life. This meadow, which has been used as hunting grounds by the royalty given the variety of game animals that have inhabited it since the Middle Ages, is home to 120 flora species and 200 vertebrae species. Rabbits, red partridges, wild cats, stags, deer and wild boars live among ilexes, cork oaks, ash trees, black poplars, oaks, junipers and rockroses. Monte del Pardo is part of the Regional Park of the High Basin of the Manzanares, spreading out from the Guadarrama Mountains range to the centre of Madrid, and protected by strong legal regulations. Just before crossing the city, the River Manzanares forms a valley composed by sandy elements and detritus from the mountain range.",
				"after": "Soto de Viñuelas, also known as Mount Viñuelas, is a meadow-oak forest north of the city of Madrid and east of the Monte de El Pardo. It is a fenced property of about 3,000 hectares, which includes important ecological values, landscape and art. Soto de Viñuelas is part of the Regional Park of the High Basin of the Manzanares, a nature reserve which is recognised as a biosphere reserve by UNESCO, where it has been classified as Area B, the legal instrument that allows agricultural land use. Soto de Viñuelas has also received the statement of Special Protection Area for Birds.",
			"color": "light|0.11637 coral|0.11637 silver|0.091938 light|0.091287 gray|0.091287 light|0.091287 grey|0.091287 dark|0.085981 gray|0.085981 dark|0.085981 grey|0.085981 white|0.057381 smoke|0.057381 alice|0.053761 blue|0.053761 sea|0.053634 shell|0.053634 ghost|0.053623 white|0.053623 snow|0.053377 lavender|0.052902 blush|0.052902 white|0.052651 mint|0.051819 cream|0.051819 floral|0.050952 white|0.050952 azure|0.050394 gainsboro|0.024284 gray|0.01724 grey|0.01724 dim|0.011508 gray|0.011508 dim|0.011508 grey|0.011508 forest|0.005966 green|0.005966 linen|0.0045987 salmon|0.0042627 dark|0.0028839 sea|0.0028839 green|0.0028839 light|0.0028658 steel|0.0028658 blue|0.0028658  "
		}
	}
}
