{
	"add": {
		"doc": {
			"id": "91754486f5eb4ec1aabb14bfd9116dcd59b1576d90cee35c2d175d540db28fd1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Jerome_Library.jpg/220px-Jerome_Library.jpg",
				"previous": "The BGSU campus police station as well as counseling services are located in the College Park Office Building on the southern edge. Kohl Hall is a dormitory exclusive to members of the Chapman Learning Community, Partners in Context and Community for Urban Educators.[65] A new, predominately freshman dormitory known as Centennial Hall was established in 2011 and is equipped with its own dining hall, known as Carillon Place Dining.[66][67] The southern edge hosts on-campus fraternity and sorority houses, although the majority of sororities are near the Student Union on the western edge.[68]",
				"after": "Arts programs are located to the east of Anderson Arena and Jerome Library in the east-central area. The Fine Arts Center is home to the School of Art and houses classrooms, a studio, workshop spaces, art galleries a glassblowing studio and faculty offices. BGSU is one of only a few schools that offer degrees in glassblowing. The Moore Musical Arts Center is located along Ridge St and is the home to the College of Musical Arts. Moore includes classrooms, recording studios, rehearsal halls, and Kobacker Hall, a large theater where many performances on campus are held.[69] Moore also includes MidAmerican Center for Contemporary Music, a national center with a focus on the study, performance, creative work and promotion of contemporary music.[70] The Wolfe Center for the Arts opened in December 2011.[71] It is the new centerpiece for the Arts, located between Fine Arts and Moore. The 93,000 sq ft (9,000 m2) building houses the School of Art, the Department of Theatre and Film, and the School of Musical Arts.[51] It includes classrooms, rehearsal space, performance/theater space, as well as design and office space, the 400-seat Thomas and Kathleen Donnell Theatre,[72] and a black-box stage, editing and digital laboratories, classrooms, studios, faculty space, and choral rehearsal rooms.[51][73]",
			"color": "silver|0.25827 light|0.21606 gray|0.21606 light|0.21606 grey|0.21606 gainsboro|0.13885 dark|0.093951 gray|0.093951 dark|0.093951 grey|0.093951 sienna|0.084006 peru|0.038398 black|0.035818 dark|0.032266 olive|0.032266 green|0.032266 burly|0.021674 wood|0.021674 saddle|0.017994 brown|0.017994 sandy|0.013828 brown|0.013828 chocolate|0.013088 tan|0.008641  "
		}
	}
}
