{
	"add": {
		"doc": {
			"id": "91783cbecaecda0c5a02067ceaac0a63b82654b4bf6adc3d99f6bc5d322eb1af",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Magpie_chasing_Brown_Goshawk_%28Immature%29.jpg/220px-Magpie_chasing_Brown_Goshawk_%28Immature%29.jpg",
				"previous": "Magpie attacks can cause injuries, typically wounds to the head and particularly the eyes, with potential detached retinas and bacterial infections from a beak used to fossick in the ground.[89] A 13-year-old boy died from tetanus, apparently from a magpie injury, in northern New South Wales in 1946.[89] Being unexpectedly swooped while cycling is not uncommon, and can result in loss of control of the bicycle, which may cause injury.[90][91] In Ipswich, a 12-year-old boy was killed in traffic while trying to evade a swooping magpie on 16 August 2010.[92]",
				"after": "If it is necessary to walk near the nest, wearing a broad-brimmed or legionnaire's hat or using an umbrella will deter attacking birds, but beanies and bicycle helmets are of little value as birds attack the sides of the head and neck.[93] Eyes painted on hats or helmets will deter attacks on pedestrians but not cyclists.[94] Attaching a long pole with a flag to a bike is an effective deterrent.[95] As of 2008, the use of cable ties on helmets has become common and appears to be effective.[96] Magpies prefer to swoop at the back of the head; therefore, keeping the magpie in sight at all times can discourage the bird. Using a basic disguise to fool the magpie as to where a person is looking (such as painting eyes on a hat, or wearing sunglasses on the back of the head) can also prove effective. In some cases, magpies may become extremely aggressive and attack people's faces; it may become very difficult to deter these birds from swooping. Once attacked, shouting aggressively and waving one's arms at the bird should deter a second attack. If a bird presents a serious nuisance the local authorities may arrange for that bird to be legally destroyed, or more commonly, to be caught and relocated to an unpopulated area.[97] Magpies have to be moved some distance as almost all are able to find their way home from distances of less than 25 km (15 mi).[98] Removing the nest is of no use as birds will breed again and possibly be more aggressive the second time around.[99]",
			"color": "black|0.47836 dim|0.12885 gray|0.12885 dim|0.12885 grey|0.12885 dark|0.12738 gray|0.12738 dark|0.12738 grey|0.12738 gray|0.10343 grey|0.10343 silver|0.047345 light|0.034776 slate|0.034776 gray|0.034776 slate|0.031817 gray|0.031817 light|0.010348 gray|0.010348 light|0.010348 grey|0.010348 dark|0.0094691 slate|0.0094691 gray|0.0094691 tan|0.0093986 light|0.0090745 steel|0.0090745 blue|0.0090745  "
		}
	}
}
