{
	"add": {
		"doc": {
			"id": "917a616cacbc35b28b843bdf9d672fd2bddcc4a21bc6a08c82efe3820162e353",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/St_John%27s_Chapel%2C_Tower_of_London.jpg/220px-St_John%27s_Chapel%2C_Tower_of_London.jpg",
				"previous": "The tower was terraced into the side of a mound, so the northern side of the basement is partially below ground level.[16] As was typical of most keeps,[17] the bottom floor was an undercroft used for storage. One of the rooms contained a well. Although the layout has remained the same since the tower's construction, the interior of the basement dates mostly from the 18th century when the floor was lowered and the pre-existing timber vaults were replaced with brick counterparts.[16] The basement is lit through small slits.[13]",
				"after": "The entrance floor was probably intended for the use of the Constable of the Tower, Lieutenant of the Tower of London and other important officials. The south entrance was blocked during the 17th century, and not reopened until 1973. Those heading to the upper floor had to pass through a smaller chamber to the east, also connected to the entrance floor. The crypt of St John's Chapel occupied the south-east corner and was accessible only from the eastern chamber. There is a recess in the north wall of the crypt; according to Geoffrey Parnell, Keeper of the Tower History at the Royal Armouries, \"the windowless form and restricted access, suggest that it was designed as a strong-room for safekeeping of royal treasures and important documents\".[16]",
			"color": "black|0.20392 dim|0.19973 gray|0.19973 dim|0.19973 grey|0.19973 gray|0.10304 grey|0.10304 slate|0.055099 gray|0.055099 light|0.052774 slate|0.052774 gray|0.052774 dark|0.044159 gray|0.044159 dark|0.044159 grey|0.044159 silver|0.026027 light|0.022702 steel|0.022702 blue|0.022702 light|0.020551 gray|0.020551 light|0.020551 grey|0.020551 alice|0.018459 blue|0.018459 white|0.01816 smoke|0.01816 dark|0.017096 slate|0.017096 gray|0.017096 ghost|0.016582 white|0.016582 azure|0.016571 gainsboro|0.01623 mint|0.016033 cream|0.016033 snow|0.015533 white|0.015431 tan|0.013867 floral|0.013815 white|0.013815 sea|0.013295 shell|0.013295 light|0.0097876 blue|0.0097876 burly|0.0088492 wood|0.0088492 lavender|0.0071691 blush|0.0071691 lavender|0.0064608 ivory|0.0059663  "
		}
	}
}
