{
	"add": {
		"doc": {
			"id": "91918c99cdc198dabd170523cafdd5faab5544c842dc10d3031b6b115cefcc2f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/KentOhioCanal.jpg/220px-KentOhioCanal.jpg",
				"previous": "Franklin Township was surveyed in 1803 and settled in November 1805 when John Haymaker and his family moved west from Warren to the banks of the Cuyahoga River. They were joined by John's brother George and their father Jacob Haymaker and their families early the next year, and built a gristmill in 1807.[5] Initial growth in the area was slow, but eventually two small villages would develop due to the potential for power generated by the Cuyahoga River that could be used in gristmills and manufacturing. The first village, known as Franklin Mills, or locally as the \"Lower Village\", developed mostly around the original Haymaker property. In 1818, Joshua Woodard arrived in the area and began constructing buildings just north of the village forming the \"Upper Village\" that would come to be known briefly as Carthage.[6]",
				"after": "In the 1820s, Franklin Mills was included in the route of the Pennsylvania and Ohio Canal (P & O Canal). When construction began on the canal in the mid-1830s, land speculation was rampant in many areas of northeast Ohio along the canal, including Franklin Mills. As a result, an industrial and business region was established along the east side of the river in what is now downtown Kent. Factories and mills were either planned or constructed along the Cuyahoga River, some of which either were never built or ultimately failed, due mostly to effects of the Panic of 1837. A lock and attached arch dam, however, was completed in 1836.[7] The canal officially opened in 1840, but would only operate into the 1860s. By the 1870s the canal was completely shut down.[8]",
			"color": "gray|0.21808 grey|0.21808 dim|0.16156 gray|0.16156 dim|0.16156 grey|0.16156 dark|0.12634 gray|0.12634 dark|0.12634 grey|0.12634 silver|0.093016 light|0.059559 gray|0.059559 light|0.059559 grey|0.059559 black|0.053933 gainsboro|0.043113 dark|0.025979 olive|0.025979 green|0.025979 linen|0.021321 light|0.02112 slate|0.02112 gray|0.02112 sea|0.016317 shell|0.016317 slate|0.015507 gray|0.015507 white|0.015289 smoke|0.015289 floral|0.014439 white|0.014439 old|0.013622 lace|0.013622 snow|0.0109 antique|0.010546 white|0.010546 mint|0.0099856 cream|0.0099856 ivory|0.0097871 white|0.0086709 beige|0.0079868 misty|0.0071608 rose|0.0071608 lavender|0.006215 blush|0.006215 honeydew|0.0059842 ghost|0.0052163 white|0.0052163  "
		}
	}
}
