{
	"add": {
		"doc": {
			"id": "91bd47d4cdd4e04d2213f58ce85be38678a88a6be9dae236ddf78a147b88e4e3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Roman.Britain.Severan.Campaigns.jpg/220px-Roman.Britain.Severan.Campaigns.jpg",
				"previous": "Archaeological evidence shows that Senecio had been rebuilding the defences of Hadrian's Wall and the forts beyond it, and Severus's arrival in Britain prompted the enemy tribes to sue for peace immediately. The emperor had not come all that way to leave without a victory, however, and it is likely that he wished to provide his teenage sons Caracalla and Geta with first-hand experience of controlling a hostile barbarian land.",
				"after": "An invasion of Caledonia led by Severus and probably numbering around 20,000 troops moved north in 208 or 209, crossing the Wall and passing through eastern Scotland on a route similar to that used by Agricola. Harried by punishing guerrilla raids by the northern tribes and slowed by an unforgiving terrain, Severus was unable to meet the Caledonians on a battlefield. The emperor's forces pushed north as far as the River Tay, but little appears to have been achieved by the invasion, as peace treaties were signed with the Caledonians. By 210 Severus had returned to York, and the frontier had once again become Hadrian's Wall. He assumed the title Britannicus but the title meant little with regard to the unconquered north, which clearly remained outside the authority of the Empire. Almost immediately, another northern tribe, the Maeatae, again went to war. Caracalla left with a punitive expedition, but by the following year his ailing father had died and he and his brother left the province to press their claim to the throne.",
			"color": "tan|0.12966 wheat|0.10912 burly|0.088264 wood|0.088264 peach|0.063193 puff|0.063193 bisque|0.061909 moccasin|0.048397 navajo|0.044644 white|0.044644 blanched|0.03981 almond|0.03981 pale|0.038468 golden|0.038468 rod|0.038468 antique|0.024329 white|0.024329 papaya|0.024074 whip|0.024074 beige|0.023736 dark|0.023529 khaki|0.023529 dodger|0.023446 blue|0.023446 dark|0.021659 sea|0.021659 green|0.021659 light|0.021247 golden|0.021247 rod|0.021247 yellow|0.021247 dark|0.019268 gray|0.019268 dark|0.019268 grey|0.019268 lemon|0.015799 chiffon|0.015799 corn|0.01503 silk|0.01503 silver|0.014439 black|0.013344 rosy|0.011515 brown|0.011515 gray|0.010753 grey|0.010753 steel|0.010019 blue|0.010019 light|0.0092753 yellow|0.0092753 cadet|0.0081896 blue|0.0081896 light|0.0079478 gray|0.0079478 light|0.0079478 grey|0.0079478 dim|0.0068177 gray|0.0068177 dim|0.0068177 grey|0.0068177 old|0.0060944 lace|0.0060944  "
		}
	}
}
