{
	"add": {
		"doc": {
			"id": "91c89d5b1a9a0872c4f6ee7f3f88720b2eaa40db1d6249fa064e19106066905b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Major_Bosbyshell.jpg/220px-Major_Bosbyshell.jpg",
				"previous": "The Washington Artillerists were redesignated as Company H of the 25th Pennsylvania Volunteers, and were sent down the Potomac River to Fort Washington, where the company spent three months strengthening the fortifications. Bosbyshell was offered a first lieutenancy in the regular Army, which he declined, stating that he preferred volunteer service. When the company's term of enlistment expired, Bosbyshell rejoined Union forces as a second lieutenant in Company G, 48th Pennsylvania Volunteers, to serve a three-year term from October 1, 1861.[7][8]",
				"after": "For about a month after his re-enlistment, Bosbyshell was regimental recruiting officer in Harrisburg, but on November 11, sailed with his regiment from Fortress Monroe, Virginia, to Hatteras, North Carolina. There he served as acting adjutant of his regiment, and as judge advocate for courts-martial. When General Ambrose Burnside launched an attack on New Bern, he took six companies of the 48th with him, as well as Bosbyshell, though Company G was not included among the Union forces. In April and May 1862, Bosbyshell received successive promotions to first lieutenant and captain and was assigned to command his company, which he did at such battles as Second Bull Run, Antietam, and Fredericksburg. After Fredericksburg, he was again assigned to serve in courts-martial; when the regiment was moved west in early 1863, Bosbyshell was assigned as provost marshal of Louisville, Kentucky. While stationed at Louisville, he returned home to Pennsylvania on leave of absence to marry Martha Stem, daughter of a minister.[9]",
			"color": "light|0.18413 gray|0.18413 light|0.18413 grey|0.18413 gainsboro|0.17248 antique|0.11639 white|0.11639 gray|0.10609 grey|0.10609 dim|0.10354 gray|0.10354 dim|0.10354 grey|0.10354 linen|0.097715 dark|0.05318 gray|0.05318 dark|0.05318 grey|0.05318 silver|0.051662 old|0.048775 lace|0.048775 sea|0.022597 shell|0.022597 black|0.012535 floral|0.0091808 white|0.0091808 beige|0.0080521 misty|0.0040445 rose|0.0040445  "
		}
	}
}
