{
	"add": {
		"doc": {
			"id": "91d4dd235e9cb45390283706cbd4101d68cbb5c99d20424d475c4a736da3a966",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Bacteriorhodopsin.png/220px-Bacteriorhodopsin.png",
				"previous": "Some Euryarchaeota are methanogens living in anaerobic environments, such as swamps. This form of metabolism evolved early, and it is even possible that the first free-living organism was a methanogen.[103] A common reaction involves the use of carbon dioxide as an electron acceptor to oxidize hydrogen. Methanogenesis involves a range of coenzymes that are unique to these archaea, such as coenzyme M and methanofuran.[104] Other organic compounds such as alcohols, acetic acid or formic acid are used as alternative electron acceptors by methanogens. These reactions are common in gut-dwelling archaea. Acetic acid is also broken down into methane and carbon dioxide directly, by acetotrophic archaea. These acetotrophs are archaea in the order Methanosarcinales, and are a major part of the communities of microorganisms that produce biogas.[105]",
				"after": "Other archaea use CO 2 in the atmosphere as a source of carbon, in a process called carbon fixation (they are autotrophs). This process involves either a highly modified form of the Calvin cycle[107] or a recently discovered metabolic pathway called the 3-hydroxypropionate/4-hydroxybutyrate cycle.[108] The Crenarchaeota also use the reverse Krebs cycle while the Euryarchaeota also use the reductive acetyl-CoA pathway.[109] Carbon–fixation is powered by inorganic energy sources. No known archaea carry out photosynthesis.[110] Archaeal energy sources are extremely diverse, and range from the oxidation of ammonia by the Nitrosopumilales[111][112] to the oxidation of hydrogen sulfide or elemental sulfur by species of Sulfolobus, using either oxygen or metal ions as electron acceptors.[100]",
			"color": "black|0.76854 magenta|0.10764 fuchsia|0.10764 dark|0.051433 magenta|0.051433 purple|0.0475  "
		}
	}
}
