{
	"add": {
		"doc": {
			"id": "91d7378ab4c998fc9a56569434fcb36d184bc1f61d91d0efe5f031e51d9bb755",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Deinonychus_ewilloughby.png/220px-Deinonychus_ewilloughby.png",
				"previous": "Based on the few fully mature specimens,[3] Deinonychus could reach 3.4 metres (11.2 ft) in length, with a skull length of 410 mm (16.1 in), a hip height of 0.87 metres (2.9 ft) and a weight of 73 kg (161 lb), though there is a higher estimate of 100 kg (220 lb).[4][5] The skull was equipped with powerful jaws lined with around seventy curved, blade-like teeth. Studies of the skull have progressed a great deal over the decades. Ostrom reconstructed the partial, imperfectly preserved skulls that he had as triangular, broad, and fairly similar to Allosaurus. Additional Deinonychus skull material and closely related species found with good three-dimensional preservation[6] show that the palate was more vaulted than Ostrom thought, making the snout far narrower, while the jugals flared broadly, giving greater stereoscopic vision. The skull of Deinonychus was different from that of Velociraptor, however, in that it had a more robust skull roof, like that of Dromaeosaurus, and did not have the depressed nasals of Velociraptor.[7] Both the skull and the lower jaw had fenestrae (skull openings) which reduced the weight of the skull. In Deinonychus, the antorbital fenestra, a skull opening between the eye and nostril, was particularly large.[6]",
				"after": "Deinonychus possessed large \"hands\" (manus) with three claws on each forelimb. The first digit was shortest and the second was longest. Each hind foot bore a sickle-shaped claw on the second digit, which was probably used during predation.[8]",
			"color": "dim|0.32032 gray|0.32032 dim|0.32032 grey|0.32032 gray|0.28625 grey|0.28625 dark|0.19747 gray|0.19747 dark|0.19747 grey|0.19747 silver|0.070438 light|0.036636 gray|0.036636 light|0.036636 grey|0.036636 slate|0.035839 gray|0.035839 gainsboro|0.024455 light|0.023567 slate|0.023567 gray|0.023567  "
		}
	}
}
