{
	"add": {
		"doc": {
			"id": "91df12ad4aa84a527d6e05bf9f23d7c8306659aeab5f36f8728edfcd4be0b543",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Edward_Drinker_Cope_Houses%2C_2100-2102_Pine_Street%2C_Philadelphia_%28Philadelphia_County%2C_Pennsylvania%29.jpg/170px-Edward_Drinker_Cope_Houses%2C_2100-2102_Pine_Street%2C_Philadelphia_%28Philadelphia_County%2C_Pennsylvania%29.jpg",
				"previous": "The 1870s were the golden years of Cope's career, marked by his most prominent discoveries and rapid flow of publications. Among his descriptions were the therapsid Lystrosaurus (1870),[43] the archosauromorph Champsosaurus (1876),[44] and the sauropod Amphicoelias (1878),[45] possibly the largest dinosaur ever discovered.[46] In the period of one year, from 1879 to 1880, Cope published 76 papers based on his travels through New Mexico and Colorado, and on the findings of his collectors in Texas, Kansas, Oregon, Colorado, Wyoming, and Utah.[47] During the peak years, Cope published around 25 reports and preliminary observations each year. The hurried publications led to errors in interpretation and naming—many of his scientific names were later canceled or withdrawn. In comparison, Marsh wrote and published less frequently and more succinctly—his works appearance in the widespread American Journal of Science led to faster reception abroad, and subsequently Marsh's reputation grew more rapidly than Cope's.[48]",
				"after": "In autumn 1871, Cope began prospecting farther west to the fossil fields of Kansas. Leidy and Marsh had been to the region earlier, and Cope employed one of Marsh's guides, Benjamin Mudge, who was in want of a job.[49] Cope's companion Charles Sternberg described the lack of water and good food available to Cope and his helpers on these expeditions. Cope would suffer from a \"severe attack of nightmare\" in which \"every animal of which we had found trace during the day played with him at night ... sometimes he would lose half the night in this exhausting slumber.\" Nevertheless, Cope continued to lead the party from sunrise to sunset, sending letters to his wife and child describing his finds.[50] The severe desert conditions and Cope's habit of overworking himself till he was bedridden caught up with him, and in 1872, he broke down from exhaustion.[51] Cope maintained a regular pattern of summers spent prospecting and winters writing up his findings from 1871 to 1879.[52]",
			"color": " "
		}
	}
}
