{
	"add": {
		"doc": {
			"id": "91e3311c4d96b2d57dcf154a393330e5abe0e15f502705caf8fdd2f65ff5b2be",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Mating_plug.jpg/220px-Mating_plug.jpg",
				"previous": "In polygynous species, males will try to monopolize and mate with multiple females. As with monogamy, polygyny in rodents can come in two forms; defense and non-defense. Defense polygyny involves males controlling territories that contain resources that attract females. This occurs in ground squirrels like yellow-bellied marmots, California ground squirrels, Columbian ground squirrels and Richardson's ground squirrels. Males with territories are known as \"resident\" males and the females that live within the territories are known as \"resident\" females. In the case of marmots, resident males do not appear to ever lose their territories and always win encounters with invading males. Some species are also known to directly defend their resident females and the ensuing fights can lead to severe wounding. In species with non-defense polygyny, males are not territorial and wander widely in search of females to monopolize. These males establish dominance hierarchies, with the high ranking males having access to the most females. This occurs in species like Belding's ground squirrels and some tree squirrel species.[66]",
				"after": "Promiscuity, in which both males and females mate with multiple partners, also occurs in rodents. In species such as the white-footed mouse, females give birth to litters with multiple paternities. Promiscuity leads to increased sperm competition and males tend to have larger testicles. In the Cape ground squirrel, the male's testes can be 20 percent of its head-body length.[66] Several rodent species have flexible mating systems that can vary between monogamy, polygyny and promiscuity.[66]",
			"color": "tan|0.24006 wheat|0.1881 burly|0.14967 wood|0.14967 pale|0.098594 golden|0.098594 rod|0.098594 lemon|0.056919 chiffon|0.056919 light|0.053801 golden|0.053801 rod|0.053801 yellow|0.053801 moccasin|0.040227 dark|0.020182 gray|0.020182 dark|0.020182 grey|0.020182 blanched|0.020024 almond|0.020024 corn|0.01797 silk|0.01797 beige|0.017562 light|0.017463 yellow|0.017463 navajo|0.014983 white|0.014983 dark|0.013605 khaki|0.013605 silver|0.012968 papaya|0.012793 whip|0.012793  "
		}
	}
}
