{
	"add": {
		"doc": {
			"id": "91e50af2ced1b6511898435700593352e9e58a34a31fb1f3f2d526fdcc7d81d6",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Lot0622_jpg.jpg/150px-Lot0622_jpg.jpg",
				"previous": "Yorkshire historian R.S. Holmes described Yorkshire as \"prodigious\" in 1896, when they won their second title with some outstanding batting performances including a championship record total of 887 against Warwickshire.[62] Hawke began the practice of paying the professionals over the winter, initially £2 per week; the scheme was later modified to include bonuses.[67] Peel was sacked in 1897 after appearing drunk on the field and was replaced in 1898 by Wilfred Rhodes, who took 141 wickets in his debut season.[68] In the same season, Brown and Tunnicliffe established a record partnership for the first wicket when they scored 554 against Derbyshire at Chesterfield. Yorkshire won their third Championship in 1898 and narrowly failed in 1899 when only a defeat late in the season by Kent prevented the retention of the title.[69]",
				"after": "Between 1900 and 1902, Yorkshire lost only twice in the County Championship, both times to Somerset, and won the County Championship in all three seasons largely thanks to their two outstanding all-rounders Hirst and Rhodes.[70] When Joseph Wolstinholm retired as club secretary after the 1902 season, he was succeeded by Frederick Toone who held the post until his death in June 1930 and formed a successful liaison with Hawke. Toone and Hawke worked together to improve the terms and conditions of professional players' contracts. To 1914, they were paid £5 for a home match and £6 for an away match with a £1 win bonus. Players who had received their county cap were obliged to join the Cricketers' Friendly Society and were paid a winter wage of £2 a week.[71]",
			"color": "black|0.46981 tan|0.3263 wheat|0.091269 dim|0.033137 gray|0.033137 dim|0.033137 grey|0.033137 pale|0.016454 golden|0.016454 rod|0.016454  "
		}
	}
}
