{
	"add": {
		"doc": {
			"id": "91ebaaa4935e1601d9c60ea3e7e4503ac4b4f71c412c7ef981ee62510e124151",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Podiceps_grisegena9.jpg/170px-Podiceps_grisegena9.jpg",
				"previous": "The red-necked grebe is a medium-large grebe, smaller than the great crested grebe of Eurasia, and the western and Clark's grebes of North America.[8][9] The adult of the nominate European subspecies is 40–50 cm (16–20 in) long with a 77–85 cm (30–33 in) average wingspan,[10] and weighs 692–925 g (24.4–32.6 oz).[10] In breeding plumage, it has a black cap that extends below the eye, very pale grey cheeks and throat, a rusty red neck, dark grey back and flanks, and white underparts. The eyes are dark brown and the long, pointed bill is black with a yellow base.[11]",
				"after": "The winter plumage of the red-necked grebe is duskier than that of other grebes; its dark grey cap is less defined, and merges into the grey face, and a pale crescent that curves around the rear of the face contrasts with the rest of the head. The front of the neck is whitish or light grey, the hind neck is darker grey, and the yellow of the bill is less obvious than in summer.[11] Although the red-necked grebe is unmistakable in breeding plumage, it is less distinctive in winter and can be confused with similar species. It is larger than the Slavonian (horned) grebe, with a relatively larger bill and a grey, rather than white face.[12] It is closer in size to the Eurasian great crested grebe, but that species is longer-necked, has a more contrasting head pattern, and always shows white above the eye.[11]",
			"color": "dark|0.43146 olive|0.43146 green|0.43146 dark|0.11023 gray|0.11023 dark|0.11023 grey|0.11023 gray|0.10962 grey|0.10962 dim|0.057759 gray|0.057759 dim|0.057759 grey|0.057759 silver|0.057457 light|0.029824 gray|0.029824 light|0.029824 grey|0.029824 gainsboro|0.020949 misty|0.018277 rose|0.018277 black|0.017155 dark|0.010977 salmon|0.010977 rosy|0.010781 brown|0.010781 peach|0.01051 puff|0.01051 linen|0.0094396 lavender|0.009005 blush|0.009005 sea|0.0088099 shell|0.0088099 white|0.0078765 smoke|0.0078765 snow|0.0068445 floral|0.0060125 white|0.0060125  "
		}
	}
}
