{
	"add": {
		"doc": {
			"id": "91f74be0e164680a71a971ac5ca6b8e2871334cdd04bfb0ef62f7b4a45bc552f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/CF-188A_BANKING.jpg/220px-CF-188A_BANKING.jpg",
				"previous": "Fourth-generation fighters continued the trend towards multirole configurations, and were equipped with increasingly sophisticated avionics and weapon systems. Fighter designs were significantly influenced by the Energy-Maneuverability (E-M) theory developed by Colonel John Boyd and mathematician Thomas Christie, based upon Boyd's combat experience in the Korean War and as a fighter tactics instructor during the 1960s. E-M theory emphasized the value of aircraft specific energy maintenance as an advantage in fighter combat. Boyd perceived maneuverability as the primary means of getting \"inside\" an adversary's decision-making cycle, a process Boyd called the \"OODA loop\" (for \"Observation-Orientation-Decision-Action\"). This approach emphasized aircraft designs that were capable of performing \"fast transients\" – quick changes in speed, altitude, and direction – as opposed to relying chiefly on high speed alone.",
				"after": "E-M characteristics were first applied to the McDonnell Douglas F-15 Eagle, but Boyd and his supporters believed these performance parameters called for a small, lightweight aircraft with a larger, higher-lift wing. The small size would minimize drag and increase the thrust-to-weight ratio, while the larger wing would minimize wing loading; while the reduced wing loading tends to lower top speed and can cut range, it increases payload capacity and the range reduction can be compensated for by increased fuel in the larger wing. The efforts of Boyd's \"Fighter Mafia\" would result in the General Dynamics F-16 Fighting Falcon (now Lockheed Martin's).",
			"color": "dark|0.27375 gray|0.27375 dark|0.27375 grey|0.27375 silver|0.18072 black|0.15754 light|0.081738 slate|0.081738 gray|0.081738 light|0.070249 gray|0.070249 light|0.070249 grey|0.070249 slate|0.056339 gray|0.056339 dim|0.039233 gray|0.039233 dim|0.039233 grey|0.039233 light|0.035631 steel|0.035631 blue|0.035631 gray|0.035239 grey|0.035239 gainsboro|0.026799 dark|0.0072172 slate|0.0072172 gray|0.0072172 white|0.0047115 smoke|0.0047115  "
		}
	}
}
