{
	"add": {
		"doc": {
			"id": "92252c2dec240eebf2abd34d6a95916eae478d8f04d08e07900d6416e8719a22",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Saint-Gaudens_high_relief_double_eagle.jpg/220px-Saint-Gaudens_high_relief_double_eagle.jpg",
			"previous": [],
				"after": "On November 18, the impatient Roosevelt directed that the second set of dies be used to strike coins, directly ordering the Mint to \"begin the new issue, even if it takes you all day to strike one piece!\"[3] Over 12,000 of these \"High Relief\" pieces were struck and were released into circulation in 1907 and 1908.[38] Barber wrote of the High Relief pieces to Landis, \"Mr. Hart has put the mill into operation and I send you two pieces showing the result; these are not selected as all the coins now made are the same as these two, which gives me alarm as they are so well made that I fear the President may demand the continuance of this particular coin.\"[39] Barber completed work on his version of the design, with a greatly lowered relief, and the new coin went into production on a large-scale basis. A total of 361,667 of the revised design were produced by the Mint in 1907; the \"Low Relief\" coins were released into circulation at the end of December 1907.[40] Barber's modifications were denounced both by the sculptor's family and by Hering.[35] Among other alterations, Barber changed the Roman numeral MCMVII for the date to the Arabic numeral \"1907\".[35] In spite of the modifications, according to R.S. Yeoman in his A Guide Book of United States Coins, many consider the Saint-Gaudens double eagles the most beautiful of U.S. coins.[41]",
			"color": "pale|0.27257 golden|0.27257 rod|0.27257 khaki|0.12956 black|0.074883 lemon|0.067661 chiffon|0.067661 burly|0.046963 wood|0.046963 navajo|0.045113 white|0.045113 light|0.044953 golden|0.044953 rod|0.044953 yellow|0.044953 moccasin|0.043863 wheat|0.031113 light|0.022738 yellow|0.022738 corn|0.020627 silk|0.020627 dark|0.019289 khaki|0.019289 beige|0.01671 papaya|0.013922 whip|0.013922 blanched|0.013199 almond|0.013199 tan|0.013059 peru|0.012186 old|0.010572 lace|0.010572 ivory|0.010261 antique|0.0091259 white|0.0091259 floral|0.0091179 white|0.0091179 saddle|0.0076714 brown|0.0076714 linen|0.0075108 bisque|0.0071731 sea|0.0066404 shell|0.0066404 honeydew|0.0056931  "
		}
	}
}
