{
	"add": {
		"doc": {
			"id": "9227d09790f55f454c2e054b319d0aec77b9d244f310aeaa5d9d1fe10a7f8c42",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Trafalgar1.jpg/280px-Trafalgar1.jpg",
				"previous": "The French Revolutionary Wars (1793–1801) and Napoleonic Wars (1803–1814 and 1815) saw the Royal Navy reach a peak of efficiency, dominating the navies of all Britain's adversaries, which spent most of the war blockaded in port. The Navy achieved an emphatic early victory at the Glorious First of June (1794), and gained a number of smaller victories while supporting abortive French Royalist efforts to regain control of France. In the course of one such operation, the majority of the French Mediterranean fleet was captured or destroyed during a short-lived occupation of Toulon in 1793.[43] The military successes of the French Revolutionary régime brought the Spanish and Dutch navies into the war on the French side, but the losses inflicted on the Dutch at the Battle of Camperdown in 1797 and the surrender of their surviving fleet to a landing force at Den Helder in 1799 effectively eliminated the Dutch navy from the war.[44] The Spithead and Nore mutinies in 1797 incapacitated the Channel and North Sea fleets, leaving Britain potentially exposed to invasion, but were rapidly resolved.[45] The British Mediterranean fleet under Nelson failed to intercept Napoleon Bonaparte's 1798 expedition to invade Egypt, but annihilated the French fleet at the Battle of the Nile, leaving Bonaparte's army isolated.[46] The emergence of a Baltic coalition opposed to Britain led to an attack on Denmark, which lost much of its fleet in the Battle of Copenhagen (1801) and came to terms with Britain.[47]",
				"after": "During these years, the Navy also conducted amphibious operations that captured most of the French Caribbean islands and the Dutch colonies at the Cape of Good Hope, Ceylon and in the Dutch East Indies; but, except for Ceylon and Trinidad, these gains were returned following the Peace of Amiens in 1802, which briefly halted the fighting.[48] War resumed in 1803 and Napoleon attempted to assemble a large enough fleet from the French and Spanish squadrons blockaded in various ports to cover an invasion of England. The Navy frustrated these efforts, and following the abandonment of the invasion plan, Nelson defeated the combined Franco-Spanish fleet in the Battle of Trafalgar (1805).[49] This victory marked the culmination of decades of developing British naval dominance, and left the Navy in a position of uncontested hegemony at sea which endured until the early years of the 20th century.",
			"color": "dark|0.18117 gray|0.18117 dark|0.18117 grey|0.18117 silver|0.16458 dark|0.1626 slate|0.1626 gray|0.1626 light|0.098073 gray|0.098073 light|0.098073 grey|0.098073 gray|0.090218 grey|0.090218 dim|0.08468 gray|0.08468 dim|0.08468 grey|0.08468 gainsboro|0.060427 black|0.02111 antique|0.019375 white|0.019375 linen|0.013948 old|0.010329 lace|0.010329 beige|0.0096731 floral|0.0071871 white|0.0071871 light|0.0071169 blue|0.0071169 sea|0.0070423 shell|0.0070423 white|0.0069924 smoke|0.0069924 powder|0.006574 blue|0.006574  "
		}
	}
}
