{
	"add": {
		"doc": {
			"id": "922ed9b21c5c301636ece48328bac4060e6c56e568504644090c825b9d69b6e1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Brougham_plan.jpg/300px-Brougham_plan.jpg",
				"previous": "Edward I died in 1307, and his successor, Edward II was distracted from war with Scotland by internal quarrels, enabling the Scottish to roam further south through England. In 1310 or 1311, Robert Clifford was given Skipton Castle; it was farther from the border than Brougham and at a time when Scottish raids were ravaging Westmorland, Clifford chose to spend more time and effort building at Skipton. Clifford was killed at the Battle of Bannockburn in 1314,[16] which ended the English counter-offensive into Scotland.[17] At the time of Robert's death his son, Roger de Clifford, 2nd Baron de Clifford, was only 14 and not old enough to inherit. Therefore, the Clifford estates experienced another period of control through guardians, suffering from Scottish raids to such an extent that in 1317 the king granted Roger £200 towards the maintenance of his castles. Bartholomew de Badlesmere, 1st Baron Badlesmere was responsible for the upkeep of Brougham Castle and some other Clifford properties including Appleby Castle. Between 1316 and 1318 he spent £363 on the garrisons at Brougham and Appleby, though was supported by the king who gave £1,270 towards their upkeep.[18] Funds to pay the garrison were not easily gathered from the Clifford estates, and they were accused of poaching and pillaging. In 1320, Roger Clifford was given his inheritance but probably spent more time at Skipton. He was executed as a traitor in 1322 after his capture at the Battle of Boroughbridge. Brougham Castle was amongst the Clifford lands confiscated and given to Andrew de Harcla for supporting the king against the uprising. However, by 1323 Harcla too had been executed for treason and the castle came into the possession of Edward II. In May 1323, a truce was signed between the Scots and English resulting in a reduction in garrison strength throughout northern England.[19]",
				"after": "When Edward III replaced Edward II on the throne, Robert Clifford, Roger's younger brother, was granted most of the lands that had been confiscated. By 1333, Robert had united under his control all the estates which had belonged to the Vieuxpont family. Hostilities between England and Scotland resumed in 1332 when Edward Balliol invaded to seize the Scottish throne for himself. He was expelled from Scotland in December 1333. On entering Westmorland, Balliol sought refuge with the Clifford family, staying at the castles of Appleby, Brougham, Brough, and Pendragon. Robert Clifford was not heavily involved in the renewed conflict, although he did take part in battles in 1332, 1337, and 1342. When the value of his property was assessed on his death in 1344 the estates of Brougham were suffering from the war, with indications that Brougham Castle was in a state of disrepair having endured the 1340s without funds for maintenance. Two minorities followed until Roger Clifford, 5th Baron Clifford, came of age in 1354.[20] Another truce between Scotland and England was signed in 1357, this time lasting until 1384. Although Roger Clifford spent much time at Appleby – which was Westmorland's county town – he was responsible for rebuilding the domestic buildings at Brougham Castle, including the hall. He was ordered by the king to maintain a force of 40 men-at-arms and 50 mounted archers near the west end of the Scottish border region, and some were likely stationed at Brougham. The need for extra accommodation a possible reason why Clifford began rebuilding. In August 1388, the Scottish launched an attack into England, with one force advancing east – and were eventually confronted at the Battle of Otterburn in Northumberland – and another raiding the west, reaching as far as Brough, 20 miles (32 km) to the south-east. During this time Brougham Castle was briefly captured by Scottish forces.[21]",
			"color": "black|0.21692 sea|0.069031 shell|0.069031 floral|0.068046 white|0.068046 linen|0.067441 old|0.062512 lace|0.062512 white|0.059246 smoke|0.059246 ivory|0.056982 snow|0.047198 antique|0.043818 white|0.043818 mint|0.03518 cream|0.03518 white|0.031814 beige|0.030326 papaya|0.024647 whip|0.024647 dim|0.022739 gray|0.022739 dim|0.022739 grey|0.022739 gray|0.022053 grey|0.022053 dark|0.020542 gray|0.020542 dark|0.020542 grey|0.020542 gainsboro|0.017649 corn|0.013292 silk|0.013292 ghost|0.013279 white|0.013279 lavender|0.012645 blush|0.012645 misty|0.011041 rose|0.011041 silver|0.010814 light|0.010717 gray|0.010717 light|0.010717 grey|0.010717 honeydew|0.0089319 blanched|0.0084719 almond|0.0084719 azure|0.0067915 alice|0.0063218 blue|0.0063218  "
		}
	}
}
