{
	"add": {
		"doc": {
			"id": "923ec7e620432dbad33c2a08fcdf4eeb6a29b4f78d74a39aa69bdeafec3c94d8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/USS_Zumwalt_%28DDG-1000%29_at_night.jpg/220px-USS_Zumwalt_%28DDG-1000%29_at_night.jpg",
			"previous": [],
				"after": "The last US Navy Spruance-class destroyer in service, USS Cushing, was decommissioned on September 21, 2005. The Zumwalt class is planned to replace them; on November 1, 2001, the US Navy announced the issuance of a revised Request for Proposal (RFP) for the Future Surface Combatant Program. Formerly known as DD 21, the program was renamed DD(X) (and later renamed to DDG-1000) to more accurately reflect the program purpose, which is to produce a family of advanced technology surface combatants, not a single ship class. DD(X), also called Zumwalt class, is much larger than traditional destroyers, nearly three thousand tons heavier than a Ticonderoga-class cruiser (15,610 long tons,[32] larger than most heavy cruisers from the World War II era). It will potentially employ advanced weaponry and an all-electric Integrated Power System; however, the construction program was subsequently reduced to just two vessels, and there is currently only funding for three in total. With the retirement of the Spruance class, the US Navy began commissioning an advanced variant of the Arleigh Burke-class with expanded ASW capabilities, the Arleigh Burke Flight IIA, beginning with USS Oscar Austin. As of 2012[update], 34 of these vessels are in service, with more under construction.",
			"color": "black|0.30336 dim|0.16275 gray|0.16275 dim|0.16275 grey|0.16275 gray|0.098891 grey|0.098891 dark|0.066256 gray|0.066256 dark|0.066256 grey|0.066256 silver|0.061735 light|0.061056 gray|0.061056 light|0.061056 grey|0.061056 gainsboro|0.057037 white|0.022853 smoke|0.022853 slate|0.014982 gray|0.014982 lavender|0.014957 blush|0.014957 sea|0.014362 shell|0.014362 snow|0.014123 ghost|0.013917 white|0.013917 alice|0.013494 blue|0.013494 white|0.011228 light|0.011053 slate|0.011053 gray|0.011053 linen|0.010044 mint|0.0091169 cream|0.0091169 azure|0.0089275 floral|0.0069304 white|0.0069304 lavender|0.004429  "
		}
	}
}
