{
	"add": {
		"doc": {
			"id": "924a8a7bdd5ea9ff5f0fd3d63b9b3e8bbf2010a78420d618dac3bda4ea6934f7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/MOBA_Somerville_Theater_gallery.jpg/220px-MOBA_Somerville_Theater_gallery.jpg",
				"previous": "MOBA accepts unsolicited works if they meet its standards. Frequently, curators consider works by artists who display an intensity or emotion in the art that they are unable to reconcile with their level of skill. The museum dedicated a show to \"relentless creativity\" in an exhibition titled \"I Just Can't Stop\" that was covered by local news and CNN.[36] Other artists are clearly technically proficient, but attempted an experiment that did not end well.[37] Michael Frank has compared some of the works at MOBA with outsider art or art brut; some MOBA artists' works are also included in other galleries' outsider collections.[38] Dean Nimmer, a professor at the Massachusetts College of Art (also holding the title of MOBA's Executive Director of Good Taste), noted the parallels between the Museum of Bad Art's standards and those of other institutions: \"They take the model of a museum of fine arts and apply the same kind of criteria to acceptance for bad work ... [Their rules] are very similar to a gallery or museum that says 'Well, our area is really installation art or realist paintings or neo-post-modern abstractions.'\"[21]",
				"after": "MOBA does not collect art created by children, or art traditionally perceived as lesser in quality, such as black velvet paintings, paint-by-numbers, kitsch, or factory-produced art—including works specifically created for tourists. Curators are also not interested in crafts such as latch hook rug kits.[39] MOBA curators suggest that more appropriate venues for such works would be the \"Museum of Questionable Taste, The International Schlock Collection, or the National Treasury of Dubious Home Decoration\".[34]",
			"color": "dark|0.68711 slate|0.68711 gray|0.68711 black|0.22361 brown|0.017684 dim|0.012111 gray|0.012111 dim|0.012111 grey|0.012111 gray|0.0082713 grey|0.0082713 pale|0.0065181 golden|0.0065181 rod|0.0065181  "
		}
	}
}
