{
	"add": {
		"doc": {
			"id": "924cbb813c29cd4fc8813ac1d75f405e384637bfe6972a06db091d93d099c5ad",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Del_Giocondo-Gherardini-Firenze-map.jpg/220px-Del_Giocondo-Gherardini-Firenze-map.jpg",
				"previous": "On 5 March 1495, Lisa married Francesco di Bartolomeo di Zanobi del Giocondo, a modestly successful cloth and silk merchant, becoming his third wife at age 15. Lisa's dowry was 170 florins and the San Silvestro farm near her family's country home, a sign that the Gherardini family was not wealthy at the time and reason to think she and her husband loved each other.[12] The property lies between Castellina and San Donato in Poggio, near two farms later owned by Michelangelo.[10] Neither poor nor among the most well-to-do in Florence, the couple lived a middle-class life. Lisa's marriage may have increased her social status because her husband's family may have been richer than her own.[12] Francesco is thought to have benefited because Gherardini is an \"old name\".[13] They lived in shared accommodation until 5 March 1503, when Francesco was able to buy a house next door to his family's old home in the Via della Stufa. Leonardo is thought to have begun painting Lisa's portrait the same year.[14][15]",
				"after": "Lisa and Francesco had five children: Piero, Camilla, Andrea, Giocondo, and Marietta, four of them between 1496 and 1507.[16] Lisa lost a baby daughter in 1499.[11] Lisa also raised Bartolomeo, the son of Francesco and his second wife, Camilla di Mariotto Rucellai, who was about a year old when his mother died. Lisa's stepmother, Caterina di Mariotto Rucellai, and Francesco's first wife were sisters, members of the prominent Rucellai family.",
			"color": "medium|0.66084 slate|0.66084 blue|0.66084 orange|0.1452 red|0.1452 slate|0.063683 blue|0.063683 medium|0.053493 purple|0.053493 gray|0.018559 grey|0.018559 tomato|0.010917 royal|0.010189 blue|0.010189 firebrick|0.0076419 red|0.0076419  "
		}
	}
}
