{
	"add": {
		"doc": {
			"id": "924df73342289a9b5ba08dcbeec4f9c980510b3592d6e3476a108e68d7e9b0ab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Chew_Valley_Map.png/220px-Chew_Valley_Map.png",
			"previous": [],
				"after": "The western end of the area (around Nempnett Thrubwell) consists of the Harptree Beds which incorporate silicified clay, shale and Lias Limestone. Clifton Down Limestone, which includes Calcite and Dolomitic mudstones of the Carboniferous period, is found in the adjoining central band and Dolomitic Conglomerate of the Triassic period. There are two main soil types, both generally well-drained.[7] The mudstones around the lakes give rise to fertile silty clay soils that are a dull dusky red colour because of their high iron content. The clay content means that where unimproved they easily become waterlogged when wet, and hard with cracks and fissures during dry periods.[7] The main geological outcrops around the lake are Mudstone, largely consisting of red Siltstone resulting in the underlying characteristic of the gently rolling valley landscape. Bands of Sandstone of the Triassic period contribute to the undulating character of the area. There are also more recent alluvial deposits beside the course of the River Chew.[7] The transition between the gently sloping landscape of the Upper Chew and Yeo Valleys and the open landscape of the Mendip Hills plateau is a scarp slope of 75 to 235 metres (250–770 ft). The predominant formation is Dolomitic Conglomerate of the Triassic period. It formed as a result of desert erosion and weathering of the scarp slopes. It takes the form of rock fragments mainly derived from older Carboniferous Limestone cemented together by lime and sand which hardened to give the appearance of concrete.[7] The northern boundary is formed by the sides of the Dundry Plateau where the most significant geological formation is the Inferior Oolite of the Jurassic period found on the higher ground around Maes Knoll. This overlays the Lower Lias Clay found on the adjoining slopes. The clays make a poor foundation and landslips are characteristic on the slopes. This area was once connected to the Cotswolds. The intervening land has subsequently been eroded leaving this outlier with the characteristics of the Cotswold Plateau.[7] The unusual geological features have been recognised as Sites of Special Scientific Interest (SSSI) for their geological interest including Barns Batch Spinney,[8] Hartcliff Rocks Quarry[9] and Dundry Main Road South Quarry.[10]",
			"color": "burly|0.42669 wood|0.42669 dark|0.27304 khaki|0.27304 tan|0.14026 light|0.041226 sky|0.041226 blue|0.041226 gray|0.025374 grey|0.025374 dark|0.020255 gray|0.020255 dark|0.020255 grey|0.020255  "
		}
	}
}
