{
	"add": {
		"doc": {
			"id": "924f9ccd522d672471290a1d94861805f633f9850156d901f79a98b54978c04b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Diomedea_exulans_in_flight_-_SE_Tasmania.jpg/220px-Diomedea_exulans_in_flight_-_SE_Tasmania.jpg",
				"previous": "The wingspans of the largest great albatrosses (genus Diomedea) are the largest of any bird, exceeding 340 cm (11.2 ft), although the other species' wingspans are considerably smaller (1.75 m (5.7 ft)).[16] The wings are stiff and cambered, with thickened streamlined leading edges. Albatrosses travel huge distances with two techniques used by many long-winged seabirds, dynamic soaring and slope soaring. Dynamic soaring involves repeatedly rising into wind and descending downwind, thus gaining energy from the vertical wind gradient. The only effort expended is in the turns at the top and bottom of every such loop. This manoeuvre allows the bird to cover almost 1000 km a day without flapping its wings. Slope soaring uses the rising air on the windward side of large waves. Albatross have high glide ratios, around 22:1 to 23:1, meaning that for every metre they drop, they can travel forward 22 metres.[3] They are aided in soaring by a shoulder-lock, a sheet of tendon that locks the wing when fully extended, allowing the wing to be kept outstretched without any muscle expenditure, a morphological adaptation they share with the giant petrels.[17]",
				"after": "Albatrosses combine these soaring techniques with the use of predictable weather systems; albatrosses in the Southern Hemisphere flying north from their colonies will take a clockwise route, and those flying south will fly counterclockwise.[14] Albatrosses are so well adapted to this lifestyle that their heart rates while flying are close to their basal heart rate when resting. This efficiency is such that the most energetically demanding aspect of a foraging trip is not the distance covered, but the landings, take-offs and hunting they undertake having found a food source.[18] A common assumption is that albatrosses must be able to sleep in flight, although no direct evidence has ever been obtained.[19]",
			"color": "steel|0.27437 blue|0.27437 corn|0.11543 flower|0.11543 blue|0.11543 dark|0.078558 gray|0.078558 dark|0.078558 grey|0.078558 light|0.070413 slate|0.070413 gray|0.070413 slate|0.06165 gray|0.06165 gray|0.053689 grey|0.053689 dim|0.04525 gray|0.04525 dim|0.04525 grey|0.04525 light|0.043537 steel|0.043537 blue|0.043537 light|0.03641 sky|0.03641 blue|0.03641 silver|0.027978 light|0.024477 gray|0.024477 light|0.024477 grey|0.024477 gainsboro|0.022304  "
		}
	}
}
