{
	"add": {
		"doc": {
			"id": "9250646e10546e5168d9aead4c5dd95e1bbe27b0e6c7a409c866c57bf3407354",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Cheryl_Cole_Cannes_2014.jpg/125px-Cheryl_Cole_Cannes_2014.jpg",
			"previous": [],
				"after": "In recent times, the Geordie dialect has featured prominently in the British media, not only due to it being an alien dialect to much of the population but also due to its perceived friendly appeal.[citation needed] Television presenters such as Ant and Dec (who first found fame in the Newcastle-set children's drama Byker Grove) are now happy to use their natural accents on air.[84] Marcus Bentley, the commentator on the UK edition of Big Brother, is often perceived by southerners to have a Geordie dialect. However, he grew up in Stockton on Tees. Brendan Foster[85] and Sid Waddell[86] have both worked as television sports commentators. Cheryl Fernandez-Versini, a former member of Girls Aloud and judge on The X Factor, has a Geordie accent,[87] she says that she's \"proud to be Geordie!\" as does Joe McElderry the winner of the sixth series of The X Factor.[87] In May 2011, while named Cheryl Cole, she was let go from the American version of The X Factor because its \"producers feared the American audience would not understand her Geordie accent.\"[88] While hosting during a May 2011 taping of Britain's Got Talent, Dec Donnelly (one half of the popular Geordie duo Ant & Dec) made an apparent attempt to stand up for Cole by asking co-producer and judge Simon Cowell on the show, \"Can you understand my accent?\".[88]",
			"color": "peach|0.15873 puff|0.15873 tan|0.14456 black|0.096789 bisque|0.090006 antique|0.049826 white|0.049826 blanched|0.04393 almond|0.04393 rosy|0.03931 brown|0.03931 papaya|0.028974 whip|0.028974 burly|0.02789 wood|0.02789 silver|0.026149 wheat|0.024518 old|0.016921 lace|0.016921 light|0.016785 gray|0.016785 light|0.016785 grey|0.016785 linen|0.016756 floral|0.014465 white|0.014465 ivory|0.013665 dark|0.013656 gray|0.013656 dark|0.013656 grey|0.013656 sea|0.012808 shell|0.012808 corn|0.012755 silk|0.012755 beige|0.011945 sienna|0.011656 moccasin|0.010447 navajo|0.010224 white|0.010224  "
		}
	}
}
