{
	"add": {
		"doc": {
			"id": "92589f7150ba359ae52334a0bc3453d162feab5a3e6fcbde91ca5da0dfe8681d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Dow_Hall_of_Briarcliff_College_%282013%29.tiff/lossy-page1-220px-Dow_Hall_of_Briarcliff_College_%282013%29.tiff.jpg",
			"previous": [],
				"after": "The first institute for higher education in the village was the School of Practical Agriculture and Horticulture, which Walter Law helped establish on his Briarcliff Farms in 1900.[112] The school taught students ages 16 to 35 in crop and livestock care. In 1902, the school moved to a larger location near Poughkeepsie and closed a year later due to a lack of funding.[113] In addition, Briarcliff Manor has been the location for several colleges. Briarcliff Junior College was founded in 1903 at the Briarcliff Lodge, and moved near Briarcliff Congregational Church, on land Walter Law donated, in 1905. Among its trustees were Howard Deering Johnson, Norman Cousins, Carl Carmer, Thomas K. Finletter, William Zorach, Eduard C. Lindeman, and Lyman Bryson. Ordway Tead was chairman of the board of trustees, and his wife Clara was the college's first president. The school gradually improved its academic scope and standing, and was registered with the State Education Department and accredited by the Middle States Association of Colleges and Schools in 1944. In 1951, the Board of Regents authorized the college to grant Associate of Arts and Associate of Applied Science degrees. The following year, the Army Map Service selected the college as the only one in the country for professional training in cartography. In 1956, the junior college started issuing bachelor's degrees, and became known as Briarcliff College. In 1977 Pace University bought the Spanish Renaissance-style Briarcliff Public School building, incorporating it into its Pleasantville campus (as the Pace University Village Center) after leasing it for many years. During Pace's lease, the building housed the Briarcliff Manor-Scarborough Historical Society and the Village Youth Center. The Edgewood Park School operated at the Briarcliff Lodge from 1936 to 1954; King's College was located there from 1955 to 1994, also using the lodge building and other dormitories and academic buildings.[6](p172) Pace University purchased Briarcliff College in 1977 and operates the property as a satellite of the school's Pleasantville campus.[4](p45)",
			"color": "black|0.29006 dim|0.15547 gray|0.15547 dim|0.15547 grey|0.15547 gray|0.11084 grey|0.11084 tan|0.097685 dark|0.092737 gray|0.092737 dark|0.092737 grey|0.092737 silver|0.036632 slate|0.023219 gray|0.023219 antique|0.021622 white|0.021622 light|0.01708 gray|0.01708 light|0.01708 grey|0.01708 light|0.015954 slate|0.015954 gray|0.015954 peach|0.013703 puff|0.013703 gainsboro|0.010926 linen|0.010645  "
		}
	}
}
