{
	"add": {
		"doc": {
			"id": "925a67e7691933b599dfb0a3d61f988279808c6671d769829368a8ee310e738f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/USS_Texas-11.jpg/220px-USS_Texas-11.jpg",
			"previous": [],
				"after": "On the morning of 25 June Texas, in company with Arkansas, Nevada, four cruisers and eleven destroyers, closed in on the vital port of Cherbourg to suppress the fortifications and batteries surrounding the town while the US Army's VII Corps attacked the city from the rear. While en route to Cherbourg, the bombardment plan was changed and Task Group 129.2 (TG 129.2), built around Arkansas and Texas, was ordered to move 6 miles (9.7 km)[clarification needed] to the east of Cherbourg and engage the guns of Battery Hamburg, a large shore battery composed of four 240 mm (9.4 in) guns.[53][54][55] At 12:08, Arkansas was the first to fire at the German positions, while the German gunners waited for Arkansas and Texas to be well in range to return fire. At 12:33, Texas was straddled by three German shells; five minutes later Texas returned fire with a continuous stream of two-gun salvos. The battleship continued her firing runs in spite of shell geysers blossoming about her and difficulty spotting the targets because of smoke; however, the enemy gunners were just as stubborn and skilled. At 13:16, a German 240 mm (9.4 in) shell skidded across the top of her conning tower, sheared the top of the fire control periscope off (the periscope remains fell back into the conning tower and wounded the gunnery officer and three others), hit the main support column of the navigation bridge and exploded.[53][56][57] The explosion caused the deck of the pilot house above to be blown upwards approximately 4 ft (1.2 m), wrecked the interior of the pilot house, and wounded seven. Of the eleven total casualties from the German shell hit, only one man succumbed to his wounds—the helmsman on duty, Christen Christensen.[58] Texas‍ '​s commanding officer, Captain Baker, escaped unhurt and quickly had the bridge cleared. The warship herself continued to deliver her 14 in (360 mm) shells in two-gun salvos and, in spite of damage and casualties, scored a direct hit that penetrated one of the heavily reinforced gun emplacements to destroy the gun inside at 13:35.[54]",
			"color": " "
		}
	}
}
