{
	"add": {
		"doc": {
			"id": "926547f9387b36322c59a660d899c60b1c246735dd34508b1d4e6f832538f451",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Deinocheirus_hand_front_view.jpg/170px-Deinocheirus_hand_front_view.jpg",
				"previous": "More than 1,400 gastroliths (stomach stones, 8 to 87mm in size) were found among the ribs and gastralia of specimen MPC-D100/127. The ratio of gastrolith mass to total weight, 0.0022, supports the theory that these gastroliths helped the toothless animals in grinding their food. Features such as the presence of a beak and a U-shaped, downturned jaw, are indicators of facultative (optional) herbivory among coelurosaurian theropods. In spite of these features, fish vertebrae and scales were also found among the gastroliths, which suggests that it was an omnivore.[1] Ornithomimosaurs in general are thought to have fed on both plants and small animals.[9]",
				"after": "Various feeding behaviours were proposed before more complete remains of Deinocheirus were known, and it was early on envisioned as a predatory, allosaur-like animal with giant arms.[9] In their original description, Osmólska and Roniewicz found that the hands of Deinocheirus were unsuited for grasping, but could instead have been used to tear prey apart.[6] In 1970, the Russian paleontologist Anatoly Konstantinovich Rozhdestvensky compared the forelimbs of Deinocheirus to sloths, leading him to hypothesise that Deinocheirus was a specialised climbing dinosaur, that fed on plants and animals found in trees.[20] In 1988, Gregory S. Paul instead suggested that the claws were too blunt for predatory purposes, but would have been good defensive weapons.[5] While attempting to determine the ecological niches for Deinocheirus and Therizinosaurus in 2010, Phil Senter and James H. Robins suggested that Deinocheirus had the largest vertical feeding range due to its hip height, and specialised in eating high foliage.[2]",
			"color": "burly|0.32845 wood|0.32845 black|0.2762 tan|0.17323 peru|0.041836 pale|0.023864 golden|0.023864 rod|0.023864 sandy|0.017907 brown|0.017907 saddle|0.016578 brown|0.016578 navajo|0.013036 white|0.013036  "
		}
	}
}
