{
	"add": {
		"doc": {
			"id": "926c2d07f10bfbaec1f3035e92dedd5722f27829644860225875f3b3b4511396",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Jtstpaul.jpg/170px-Jtstpaul.jpg",
				"previous": "He continued to record with other artists. After \"Where Is the Love?\", he again collaborated with the Black Eyed Peas on the 2005 track \"My Style\" from their album Monkey Business.[36] When recording the 2005 single \"Signs\" with Snoop Dogg, Timberlake discovered a throat condition.[37] Nodules were subsequently removed from his throat in an operation that took place on May 5, 2005.[38] He was advised not to sing or speak loudly for at least a few months.[39] In 2005, he began his own record company, JayTee Records.[40]",
				"after": "Timberlake released his second studio album, FutureSex/LoveSounds, on September 12, 2006. The album, which Timberlake created from 2005 to 2006, debuted at number one on the Billboard 200 album chart, selling 684,000 copies its first week.[41] It is the biggest album for pre-orders on iTunes, and beat Coldplay's record for the biggest one-week sales of a digital album.[42] The album was produced by Timbaland and Danja (who produced a bulk of the album), will.i.am, Rick Rubin and Timberlake himself, and features guest vocals by Snoop Dogg, Three 6 Mafia, T.I. and will.i.am.[43] A studio representative described it as being \"all about sexiness\" and aiming for \"an adult feel\".[38]",
			"color": "royal|0.14421 blue|0.14421 light|0.11247 sky|0.11247 blue|0.11247 light|0.090036 cyan|0.090036 light|0.083659 blue|0.083659 corn|0.082211 flower|0.082211 blue|0.082211 midnight|0.066198 blue|0.066198 powder|0.05785 blue|0.05785 sky|0.056217 blue|0.056217 azure|0.049897 alice|0.030841 blue|0.030841 dodger|0.029096 blue|0.029096 light|0.028792 steel|0.028792 blue|0.028792 mint|0.025294 cream|0.025294 pale|0.020927 turquoise|0.020927 dark|0.017314 slate|0.017314 blue|0.017314 lavender|0.014663 honeydew|0.01234 white|0.011305 smoke|0.011305 ghost|0.01048 white|0.01048 steel|0.0091779 blue|0.0091779 white|0.0091739 snow|0.0067566  "
		}
	}
}
