{
	"add": {
		"doc": {
			"id": "927150359b9108266b914f4234f4004677600ac1e59aaadecb221e2dfc94093f",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e6/Buna_Werke.png/220px-Buna_Werke.png",
			"previous": [],
				"after": "After examining several sites for a new plant to manufacture buna, a type of synthetic rubber essential to the war effort, chemicals manufacturer IG Farben chose a site near the towns of Dwory and Monowice (Monowitz in German), about 7 kilometres (4.3 mi) east of Auschwitz I and 3 kilometres (1.9 mi) east of the town of Oświęcim.[43] Financial support in the form of tax exemptions was available to corporations prepared to develop industries in the frontier regions under the Eastern Fiscal Assistance Law, passed in December 1940. In addition to its proximity to the concentration camp, which could be used as a source of cheap labor, the site had good railway connections and access to raw materials.[44] In February 1941, Himmler ordered that the Jewish population of Oświęcim should be expelled to make way for skilled laborers that would be brought in to work at the plant. All Poles able to work were to remain in the town and were forced to work building the factory.[45] Himmler visited in person in March and decreed an immediate expansion of the parent camp to house 30,000 persons. Development of the camp at Birkenau began about six months later.[46] Construction of IG Auschwitz began in April, with an initial force of 1,000 workers from Auschwitz I assigned to work on the construction. This number increased to 7,000 in 1943 and 11,000 in 1944.[47] Over the course of its history, about 35,000 inmates in total worked at the plant; 25,000 died as a result of malnutrition, disease, and the physically impossible workload.[48] In addition to the concentration camp inmates, who comprised a third of the work force, IG Auschwitz employed slave laborers from all over Europe.[49]",
			"color": "dark|0.22169 gray|0.22169 dark|0.22169 grey|0.22169 gray|0.19899 grey|0.19899 silver|0.14654 dim|0.12663 gray|0.12663 dim|0.12663 grey|0.12663 light|0.090591 gray|0.090591 light|0.090591 grey|0.090591 gainsboro|0.071119 black|0.04456 tan|0.032154 burly|0.020894 wood|0.020894 beige|0.0061653 antique|0.0051456 white|0.0051456 papaya|0.0044223 whip|0.0044223 corn|0.0041508 silk|0.0041508  "
		}
	}
}
