{
	"add": {
		"doc": {
			"id": "927653946187901a861d2a416e5a928cba871455167eec32326e86d8b7b1572b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Killing_fur_seals%2C_St_Paul_Island.jpg/220px-Killing_fur_seals%2C_St_Paul_Island.jpg",
				"previous": "As of 2013, International Union for Conservation of Nature (IUCN) recognizes 35 pinniped species. Two species—the Japanese sea lion and the Caribbean monk seal—are recently extinct, and ten more are considered at risk, as they are ranked \"Critically Endangered\" (the Mediterranean and Hawaiian monk seals), \"Endangered\" (Galápagos fur seal, Australian sea lion, Caspian seal and Galápagos sea lion), and \"Vulnerable\" (northern fur seal, hooded seal and New Zealand sea lion). Three species—the walrus, the ribbon seal, and the spotted seal—have a \"Data Deficient\" ranking.[150] Species that live in polar habitats are vulnerable to the effects of recent and ongoing climate change, particularly declines in sea ice.[151] There has been some debate over the cause of the decline of Steller sea lions in Alaska since the 1970s.[152]",
				"after": "Seal hunting by humans has existed since the Stone Age. Originally, seals were hit with clubs during haul-out. Eventually, seal hunters used harpoons to spear the animals from boats out at sea, and hooks for killing pups on ice or land. They were also trapped in nets. The use of firearms in seal hunting during the modern era drastically increased the number of killings. Pinnipeds are typically hunted for their meat and blubber. The skins of fur seals and phocids are made into coats, and the tusks of walruses continue to be used for carvings or as ornaments.[153] There is a distinction between the subsistence hunting of seals by indigenous peoples of the Arctic and commercial hunting: subsistence hunters typically use seal products for themselves and depend on them for survival.[154] National and international authorities have given special treatment to aboriginal hunters since their methods of killing are seen as less destructive and wasteful. This distinction is being questioned as indigenous people are using more modern weaponry and mechanized transport to hunt with, and are selling seal products in the marketplace. Some anthropologists argue that the term \"subsistence\" should also apply to these cash-based exchanges as long as they take place within local production and consumption. More than 100,000 phocids (especially ringed seals) as well as around 10,000 walruses are harvested annually by native hunters.[153]",
			"color": "black|0.54563 tan|0.14966 wheat|0.060344 blanched|0.039421 almond|0.039421  "
		}
	}
}
