{
	"add": {
		"doc": {
			"id": "928ea5162bb7de097ee368d7cd60e7d404d63830d71cdd7e3284faed75afdc26",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Segeln_Gewichtsstabilitaet.svg/170px-Segeln_Gewichtsstabilitaet.svg.png",
				"previous": "If a ship suffers severe structural stress — classically during a shipwreck when running aground in a heavy sea — it is possible for the keel to break or be strained to the extent that it loses structural integrity. In this case the ship is commonly said to have \"broken its back\". Such a failure means that the entire structure of the ship and its machinery has been compromised and repairing such damage would require virtually re-building the ship from the ground up. A ship that has broken its back is almost certainly unsalvagable and subsequently written off by its insurers.",
				"after": "The keel surface on the bottom of the hull gives the ship greater directional control and stability. In non-sailing hulls, the keel helps the hull to move forward, rather than slipping to the side. In traditional boat building, this is provided by the structural keel, which projects from the bottom of the hull along most or all of its length. In modern construction the bar keel or flat-plate keel performs the same function. There are many types of fixed keels, including full keels, long keels, fin keels, winged keels, bulb keels, and bilge keels among other designs. Deep draft ships will typically have a flat bottom and employ only bilge keels, both to aid directional control and to damp rolling motions",
			"color": "dim|0.26909 gray|0.26909 dim|0.26909 grey|0.26909 gray|0.23327 grey|0.23327 black|0.14519 dark|0.13616 gray|0.13616 dark|0.13616 grey|0.13616 silver|0.054071 light|0.027871 gray|0.027871 light|0.027871 grey|0.027871 gainsboro|0.020816 white|0.012955 smoke|0.012955 white|0.012427 snow|0.012322 ghost|0.01143 white|0.01143 mint|0.011126 cream|0.011126 alice|0.010813 blue|0.010813 sea|0.010463 shell|0.010463 floral|0.0095974 white|0.0095974 lavender|0.0078935 blush|0.0078935 azure|0.0070199 linen|0.0049023  "
		}
	}
}
