{
	"add": {
		"doc": {
			"id": "929759a509d5fc1a8793c8803a2d5bce4089f06896946d382d5d0ec443bc82c5",
			"url": "https://upload.wikimedia.org/wikipedia/en/f/f5/Richard_Temple.jpg",
				"previous": "Gilbert sought authenticity, however, in the setting, costumes, movements and gestures of the actors. To that end, Gilbert engaged some of the Japanese at the Knightsbridge village to advise on the production and to coach the actors. \"The Directors and Native Inhabitants\" of the village were thanked in the programme that was distributed on the first night.[43] Sullivan inserted into his score, as \"Miya sama\", a version of a Japanese military march song, called \"Ton-yare Bushi\", composed in the Meiji Era.[22][44][45] Giacomo Puccini later incorporated the same song into Madama Butterfly as the introduction to Yamadori, ancor le pene. The characters' names in the play are not Japanese names, but rather (in many cases) English baby-talk or simply dismissive exclamations. For instance, a pretty young thing is named Pitti-Sing; the beautiful heroine is named Yum-Yum; the pompous officials are Pooh-Bah[n 5] and Pish-Tush;[n 6] the hero is called Nanki-Poo, baby-talk for \"handkerchief\".[46][47][48] The headsman's name, Ko-Ko, is similar to that of the scheming Ko-Ko-Ri-Ko in Ba-ta-clan by Jacques Offenbach.[49]",
				"after": "The Japanese were ambivalent toward The Mikado for many years. Some Japanese critics saw the depiction of the title character as a disrespectful representation of the revered Meiji Emperor; Japanese theatre was prohibited from depicting the emperor on stage.[50] Japanese Prince Komatsu Akihito, who saw an 1886 production in London, took no offence.[51] When Prince Fushimi Sadanaru made a state visit in 1907, the British government banned performances of The Mikado from London for six weeks,[n 7] fearing that the play might offend him – a manoeuvre that backfired when the prince complained that he had hoped to see The Mikado during his stay.[52][53] A Japanese journalist covering the prince's stay attended a proscribed performance and confessed himself \"deeply and pleasingly disappointed.\" Expecting \"real insults\" to his country, he had found only \"bright music and much fun.\"[54]",
			"color": "black|0.88234 dim|0.062282 gray|0.062282 dim|0.062282 grey|0.062282 gray|0.034426 grey|0.034426 dark|0.013006 gray|0.013006 dark|0.013006 grey|0.013006 silver|0.0042572  "
		}
	}
}
