{
	"add": {
		"doc": {
			"id": "92a39cbf697b0e357f2582fec059375f399012823d8007cf872374108c5e10cb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Who_wrote_Bread-Winners.jpg/220px-Who_wrote_Bread-Winners.jpg",
				"previous": "The furor fueled sales, with the Century later reporting that it gained 20,000 new subscribers because of the serial.[41] The August issue of the Century, in which the first four chapters were serialized, sold out. The September issue also sold out, but went to a second printing. The Century loudly proclaimed these facts in promotional advertisements, and that it was coining money as a result. As the second installment was read, and the character of Alice Belding became prominent, there was speculation in the press that a female hand had written the novel, with suspicion falling on Constance Fenimore Cooper (great-niece of James Fenimore Cooper), whose novels were set in eastern Ohio. On September 18, the Washington correspondent for the Evening Transcript noted the resemblance of Farnham's study to Hay's. Other candidates for the authorship were Howells (though he quickly denied it) and Hay's friend Clarence King, a writer and explorer.[42]",
				"after": "On October 23, 1883, an interview with Hay, who had just returned from a trip to Colorado, appeared in the pages of the Cleveland Leader. Hay stated that such a novel would be beyond his powers, and that inaccuracies in the depiction of the local scene suggested to him that it was not written by a Clevelander. He offered no candidates who might have written it. Nevertheless, in November, the Leader ran a column speculating that Hay was the author, based on phrases used both in The Bread-Winners and in Hay's earlier book, Castilian Days, and by the fact that one character in the novel was from Salem, Indiana, Hay's birthplace. Further textual analyses led a number of newspapers in early 1884 (when the novel appeared in book form) to state it had been written by Hay.[43]",
			"color": " "
		}
	}
}
