{
	"add": {
		"doc": {
			"id": "92a57f0d4cf94496cd88a3a52b3109c498fc593e2525908efee87f7ee78949e8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Trafalgar_Square%2C_Paralympics_big_screen.JPG/220px-Trafalgar_Square%2C_Paralympics_big_screen.JPG",
				"previous": "References:[71]",
				"after": "Broadcast rights to the 2012 Summer Paralympics were sold to local broadcasters by LOCOG, with production of the world feeds sub-contracted to Olympic Broadcasting Services (OBS). The Games saw a significant growth in media coverage for the Paralympics; LOCOG reached deals with over 36 broadcasters to televise the Games in over 100 countries. LOCOG chief Sebastian Coe stated that \"beyond how the commercial value of this package has raised the bar financially for the Paralympic movement, the fantastic broadcast coverage we have agreed will help us take advantage of this opportunity to inspire disabled people of all ages to take up sport and be a catalyst for continued change in public attitudes towards disability.\" LOCOG reached deals with broadcasters such as China Central Television, the Korean Broadcasting System, NHK, Rede Globo and SporTV in Brazil, the TV Pool (a consortium of free-to-air broadcasters in Thailand consisting of Channel 3, Channel 5, BBTV Channel 7, and Modernine TV), and the Australian Broadcasting Corporation to air coverage.[3][72][73][74] The games were to be broadcast on television in the United Kingdom by Channel 4, replacing long-time Paralympic broadcaster BBC in a £9 million deal; the BBC still held radio rights, with coverage on BBC Radio 5 Live and 5 Live Sports Extra.[75][76][77] The IPC webcasted approximately 780 hours of its coverage through its YouTube channel, with four streams of coverage in English and one in Spanish.[78]",
			"color": "black|0.20431 dim|0.095423 gray|0.095423 dim|0.095423 grey|0.095423 dark|0.067301 gray|0.067301 dark|0.067301 grey|0.067301 gray|0.06538 grey|0.06538 slate|0.05657 gray|0.05657 silver|0.042867 light|0.03704 slate|0.03704 gray|0.03704 antique|0.030923 white|0.030923 light|0.027234 gray|0.027234 light|0.027234 grey|0.027234 dark|0.025945 olive|0.025945 green|0.025945 linen|0.023118 dark|0.022314 slate|0.022314 gray|0.022314 old|0.021702 lace|0.021702 gainsboro|0.01838 floral|0.018006 white|0.018006 papaya|0.017604 whip|0.017604 sea|0.017497 shell|0.017497 beige|0.017388 light|0.01588 steel|0.01588 blue|0.01588 ivory|0.015818 tan|0.015341 corn|0.013727 silk|0.013727 blanched|0.01229 almond|0.01229 white|0.010046 smoke|0.010046 snow|0.0083501 bisque|0.0075585 mint|0.0072128 cream|0.0072128 steel|0.0067591 blue|0.0067591  "
		}
	}
}
