{
	"add": {
		"doc": {
			"id": "92b34f48676bcb0fe319ebf88f10be40c3b66bcb89a76d2b4b09f9b700cb41f7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Brudeferden.jpg/200px-Brudeferden.jpg",
			"previous": [],
				"after": "In 1749, Erik Pontoppidan released a comprehensive dictionary of Norwegian words that were incomprehensible to Danish people, Glossarium Norvagicum Eller Forsøg paa en Samling Af saadanne rare Norske Ord Som gemeenlig ikke forstaaes af Danske Folk, Tilligemed en Fortegnelse paa Norske Mænds og Qvinders Navne.[4] Nevertheless, it is generally acknowledged that the first systematic study of the Norwegian language was made by Ivar Aasen in the mid 19th century. After the dissolution of Denmark-Norway and the establishment of the union between Sweden and Norway in 1814, Norwegians considered that neither Danish, by now a foreign language, nor by any means Swedish, were suitable written norms for Norwegian affairs. The linguist Knud Knudsen proposed a gradual Norwegianisation of Danish. Ivar Aasen, however, favoured a more radical approach, based on the principle that people living in the Norwegian countryside, who made up the vast majority of the populace, should be regarded as more Norwegian than upper-middle class city-dwellers, who for centuries had been substantially influenced by the Danish language and culture.[5] This idea was not unique to Aasen, and can be seen in the wider context of Norwegian romantic nationalism. In the 1840s Aasen traveled across rural Norway and studied its dialects. In 1848 and 1850 he published the first Norwegian grammar and dictionary, respectively, which described a standard that Aasen called Landsmål. New versions detailing the written standard were published in 1864 and 1873.",
			"color": "light|0.2421 steel|0.2421 blue|0.2421 black|0.13203 lavender|0.075548 gainsboro|0.063248 light|0.06033 gray|0.06033 light|0.06033 grey|0.06033 alice|0.037561 blue|0.037561 white|0.036557 smoke|0.036557 silver|0.036098 ghost|0.034234 white|0.034234 light|0.029246 slate|0.029246 gray|0.029246 snow|0.024738 white|0.02201 dark|0.021963 olive|0.021963 green|0.021963 azure|0.02091 slate|0.020391 gray|0.020391 mint|0.020226 cream|0.020226 lavender|0.019292 blush|0.019292 sea|0.018091 shell|0.018091 floral|0.016362 white|0.016362 dark|0.014832 gray|0.014832 dark|0.014832 grey|0.014832 linen|0.010606 gray|0.0102 grey|0.0102 ivory|0.0081451 dim|0.0055837 gray|0.0055837 dim|0.0055837 grey|0.0055837 old|0.0051241 lace|0.0051241  "
		}
	}
}
