{
	"add": {
		"doc": {
			"id": "92b5a2b5479b43a9a073c4a8d588640e39fbf223774668c1a7cff0e8ae47a3f0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Slow_loris.jpg/220px-Slow_loris.jpg",
				"previous": "Little is known about the social structure of slow lorises, but they generally spend most of the night foraging alone.[86][87] Individuals sleep during the day, usually alone but occasionally with other slow lorises.[86] Home ranges of adults may significantly overlap, and those of males are generally larger than those of females.[87][88] In the absence of direct studies of the genus, primatologist Simon Bearder speculated that slow loris social behavior is similar to that of the potto, another slow-moving nocturnal primate.[89] Such a social system is distinguished by a lack of matriarchy and by factors that allow the slow loris to remain inconspicuous and minimize energy expenditure. Vocal exchanges and alarm calls are limited; scent marking with urine is the dominant form of communication.[70][89] Adult males are highly territorial and are aggressive towards other males.[70][90] Vocalizations include an affiliative (friendly) call krik, and a louder call resembling a crow's caw.[91] When disturbed, slow lorises can also produce a low buzzing hiss or growl. To make contact with other individuals, they emit a single high-pitched rising tone, and females use a high whistle when in estrus.[70][90]",
				"after": "Slow lorises are slow and deliberate climbers, and often hold on to branches with three of their four limbs.[92] To move between trees, they carefully grip the terminal branches of the neighboring tree and pull themselves across the small gap.[7] They will also grip branches with only their hind feet, lift themselves upright, and quickly launch forward with their hands to catch prey.[92] Due to their slow movement, all lorises, including the slow lorises, have a specially adapted mechanism for defense against predation. Their slow, deliberate movement hardly disturbs the vegetation and is almost completely silent. Once disturbed, they immediately stop moving and remain motionless.[93] In Indonesia, slow lorises are called malu malu or \"shy one\" because they freeze and cover their face when spotted.[94] If cornered, they may adopt a defensive posture by curling up and lunging at the predator.[93] The Acehnese name, buah angin (\"wind monkey\"), refers to their ability to \"fleetingly but silently escape\".[95] Little is known about the predation of slow lorises. Documented predators include snakes, the changeable hawk-eagle (Nisaetus cirrhatus),[96] and Sumatran orangutans (Pongo abelii).[97] Other potential predators include cats, sun bears (Ursus malayanus), binturongs (Arctictis binturong), and civets.[98]",
			"color": "silver|0.24219 dark|0.14705 gray|0.14705 dark|0.14705 grey|0.14705 light|0.12491 gray|0.12491 light|0.12491 grey|0.12491 gray|0.10952 grey|0.10952 dim|0.08404 gray|0.08404 dim|0.08404 grey|0.08404 black|0.08026 gainsboro|0.068249 misty|0.033654 rose|0.033654 linen|0.019493 rosy|0.013935 brown|0.013935 sea|0.011884 shell|0.011884 white|0.0099704 smoke|0.0099704 lavender|0.0096338 blush|0.0096338 antique|0.0071544 white|0.0071544 old|0.0071448 lace|0.0071448 floral|0.007135 white|0.007135 snow|0.0068582  "
		}
	}
}
