{
	"add": {
		"doc": {
			"id": "92bb2c52009e02b4605c984e67260217c547ce70ededcd2a679eefa7951a81f3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Wood_Bodhisattva_2.jpg/170px-Wood_Bodhisattva_2.jpg",
				"previous": "Although weakened and pushed south along the Huai River, the Southern Song found new ways to bolster its strong economy and defend its own state against the Jin dynasty. They had able military officers such as Yue Fei and Han Shizhong. The government sponsored massive shipbuilding and harbor improvement projects, and the construction of beacons and seaport warehouses in order to support maritime trade abroad and the major international seaports, such as Quanzhou, Guangzhou, and Xiamen, that were sustaining China's commerce.[26][27][28] To protect and support the multitudes of ships sailing for maritime interests into the waters of the East China Sea and Yellow Sea (to Korea and Japan), Southeast Asia, the Indian Ocean, and the Red Sea, it was a necessity to establish an official standing navy.[29] The Song dynasty therefore established China's first permanent navy in 1132,[28] with a headquarters at Dinghai.[30] With a permanent navy, the Song were prepared to face the naval forces of the Jin on the Yangtze River in 1161, in the Battle of Tangdao and the Battle of Caishi. During these battles the Song navy employed swift paddle wheel driven naval vessels armed with trebuchet catapults aboard the decks that launched gunpowder bombs.[30] Although the Jin forces commanded by Emperor Hailing boasted 70,000 men on 600 warships, and the Song forces only 3,000 men on 120 warships,[31] the Song dynasty forces were victorious in both battles due to the destructive power of the bombs and the rapid assaults by paddle wheel ships.[32] The strength of the navy was heavily emphasized after that. A century after the navy was founded it had grown in size to 52,000 fighting marines.[30] The Song government confiscated portions of land owned by the landed gentry in order to raise revenue for these projects, an act which caused dissension and loss of loyalty amongst leading members of Song society but did not stop the Song's defensive preparations.[33][34][35] Financial matters were made worse by the fact that many wealthy, land-owning families—some which had officials working for the government—used their social connections with those in office in order to obtain tax-exempt status.[36]",
				"after": "Although the Song dynasty was able to hold back the Jin, a new considerable foe came to power over the steppe, deserts, and plains north of the Jin dynasty. The Mongols, led by Genghis Khan (r. 1206–1227), initially invaded the Jin dynasty in 1205 and 1209, engaging in large raids across its borders, and in 1211 an enormous Mongol army was assembled to invade the Jin.[37] The Jin dynasty was forced to submit and pay tribute to the Mongols as vassals; when the Jin suddenly moved their capital city from Beijing to Kaifeng, the Mongols saw this as a revolt.[38] Under the leadership of Ögedei Khan (r.1229–1241), both the Jin dynasty and Western Xia dynasty were conquered by Mongol forces.[38][39] The Mongols also invaded Korea, the Abbasid Caliphate of the Middle East, and Kievan Rus'. The Mongols were at one time allied with the Song, but this alliance was broken when the Song recaptured the former imperial capitals of Kaifeng, Luoyang, and Chang'an at the collapse of the Jin dynasty. The Mongol leader Möngke Khan led a campaign against the Song in 1259 but died on August 11 during the Battle of Diaoyu Fortress in Chongqing.[40] Möngke's death and the ensuing succession crisis prompted Hulagu Khan to pull the bulk of the Mongol forces out of the Middle East where they were poised to fight the Egyptian Mamluks (who defeated the remaining Mongols at Ain Jalut). Although Hulagu was allied with Kublai Khan, his forces were unable to help in the assault against the Song, due to Hulagu's war with the Golden Horde.[41]",
			"color": "black|0.39302 gray|0.14318 grey|0.14318 dark|0.14271 gray|0.14271 dark|0.14271 grey|0.14271 dim|0.10048 gray|0.10048 dim|0.10048 grey|0.10048 silver|0.082025 light|0.032264 gray|0.032264 light|0.032264 grey|0.032264 gainsboro|0.017902 tan|0.017223 antique|0.011508 white|0.011508 linen|0.0073516  "
		}
	}
}
