{
	"add": {
		"doc": {
			"id": "92bd53d10ade5914b4fdabcbdfc252d780c41c1539c404edd0e6a9150390058e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Icelandair_Douglas_DC-8_Luxembourg_-_7_August_1983.jpg/220px-Icelandair_Douglas_DC-8_Luxembourg_-_7_August_1983.jpg",
				"previous": "During the 1970s energy crisis, the economic situation for both Flugfélag and Loftleiðir worsened. The government of Iceland initiated a new attempt to merge the two airlines, which could be realized in 1973 following lengthy and difficult negotiations.[28] The staff of Loftleiðir complained that Flugfélag, although smaller, had gained the upper hand in the united company.[29] A holding company called Flugleiðir was created, which combined the two companies and began to streamline staff and operations.[30] At the time of the merger, two thirds of the passenger traffic of the airline were international transatlantic crossings, and Flugfélag's fleet of DC-3s and 727s was enlarged by DC-8s of Loftleiðir. In 1979, Flugfélag bought all of Loftleiðir's assets in Flugleiðir, and the airline became known by today's Icelandair.",
				"after": "The aircraft fleet of Icelandair remained mainly unchanged until the Boeing 757-200 became the new backbone for transatlantic flights during the 1990s. The domestic Fokker F-27s were replaced by F-50s and Boeing 737s deployed on European routes. The European hub at Luxemburg-Findel Airport had been taken over from Loftleiðir. Passenger count topped one million in 1995[citation needed] as the company's business grew on a reputation as a \"backpacker airline\", similar to Loftleiðir, which had been referred to as \"Hippie Airline\" since the late 1960s. In the same year, it was begun to dismantle the Luxemburg hub in favor of today's decentralized European network, linking the largest cities non-stop to Reykjavík.[31]",
			"color": "slate|0.28635 gray|0.28635 light|0.2764 slate|0.2764 gray|0.2764 gray|0.078178 grey|0.078178 dim|0.059229 gray|0.059229 dim|0.059229 grey|0.059229 dark|0.052071 gray|0.052071 dark|0.052071 grey|0.052071 black|0.034974 light|0.026321 steel|0.026321 blue|0.026321 silver|0.020808 light|0.019267 gray|0.019267 light|0.019267 grey|0.019267 gainsboro|0.016813 lavender|0.014424 alice|0.013661 blue|0.013661 white|0.013215 smoke|0.013215 ghost|0.01271 white|0.01271 snow|0.01115 white|0.010845 azure|0.010671 mint|0.010231 cream|0.010231 sea|0.0091228 shell|0.0091228 floral|0.0083516 white|0.0083516 lavender|0.0076897 blush|0.0076897  "
		}
	}
}
