{
	"add": {
		"doc": {
			"id": "92c8a21871f740d944b4b2848a9b3037fe14ea6ac7502fe49867b686df98c067",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/The_Daughters_of_Edward_Darley_Boit%2C_John_Singer_Sargent%2C_1882_%28unfree_frame_crop%29.jpg/220px-The_Daughters_of_Edward_Darley_Boit%2C_John_Singer_Sargent%2C_1882_%28unfree_frame_crop%29.jpg",
				"previous": "Francisco Goya etched a print of Las Meninas in 1778,[73] and later used Velázquez's painting as the model for his Charles IV of Spain and His Family. As in Las Meninas, the royal family in Goya's work is apparently visiting the artist's studio. In both paintings the artist is shown working on a canvas, of which only the rear is visible. Goya, however, replaces the atmospheric and warm perspective of Las Meninas with what Pierre Gassier calls a sense of \"imminent suffocation\". Goya's royal family is presented on a \"stage facing the public, while in the shadow of the wings the painter, with a grim smile, points and says: 'Look at them and judge for yourself!' \"[69]",
				"after": "The 19th-century British art collector William John Bankes travelled to Spain during the Peninsular War (1808–1814) and acquired a copy of Las Meninas painted by Mazo,[74] which he believed to be an original preparatory oil sketch by Velázquez—although Velázquez did not usually paint studies. Bankes described his purchase as \"the glory of my collection\", noting that he had been \"a long while in treaty for it and was obliged to pay a high price\".[75] The copy was admired throughout the 19th century in Britain.",
			"color": "black|0.44911 dim|0.27261 gray|0.27261 dim|0.27261 grey|0.27261 gray|0.10423 grey|0.10423 dark|0.047418 gray|0.047418 dark|0.047418 grey|0.047418 silver|0.022131 slate|0.015042 gray|0.015042 sienna|0.013694 light|0.012116 gray|0.012116 light|0.012116 grey|0.012116 dark|0.010798 slate|0.010798 gray|0.010798 gainsboro|0.0083868 light|0.0082351 slate|0.0082351 gray|0.0082351 rosy|0.0056207 brown|0.0056207  "
		}
	}
}
