{
	"add": {
		"doc": {
			"id": "92cd6367ee52eeaaffac8d10b0addcb560d19d978ab47e33b1da944dfcbc3f8b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/PIA_Corporate_Headoffice.jpg/220px-PIA_Corporate_Headoffice.jpg",
				"previous": "Pakistan International Airlines Corporation (PIAC) is majority owned by the Government of Pakistan (87%) while the remainder (13%) by private shareholders. The airline is under the administration of Ministry of Defence the chairman of which is Muhammad Mian Nawaz Sharif . The airline is managed by managing director as well as the Board of Directors. The Board consists of nine independent non-executive members and has four sub-committees: an Audit Committee, Brand and Advertising Committee, Finance Committee, and Human Resource Committee each having its own charter and chairman. The MD leads the executive management of staff who run the airline. The airline's main headquarters are located at Karachi Airport while smaller sub head offices are located in several cities within Pakistan.",
				"after": "In the late 1990s, the Government of Pakistan considered selling the airline to the private sector due to the persistent losses suffered by the airline. The government announced its privatization plans but they were never implemented. Several steps towards outsourcing of non-core business have been initiated. Catering units (starting with Karachi Flight Kitchen), ground handling (starting with ramp services) and engineering, are to be gradually carved out of the airline and operated as independent companies. During 1997, Pakistan called in a team from International Finance (IFC), the consulting arm of the World Bank, to advise on restructuring and privatization of Pakistan International Airlines (PIA). However, no agreement was reached.[26] The government has had many plans for the privatization of the State owned airline. However, no reasonable agreement or solution has been found to this day. On 18 February 2009 the carrier was dropped from the privatization list.[27]",
			"color": "silver|0.37608 dark|0.19534 gray|0.19534 dark|0.19534 grey|0.19534 light|0.14763 gray|0.14763 light|0.14763 grey|0.14763 dim|0.069391 gray|0.069391 dim|0.069391 grey|0.069391 gray|0.06279 grey|0.06279 black|0.050902 gainsboro|0.036498 dark|0.035252 olive|0.035252 green|0.035252 linen|0.0058367  "
		}
	}
}
