{
	"add": {
		"doc": {
			"id": "92e7de36881aa2b8f2d7bb05f1d142a3dc7b6200582105aa62e95ba56767bb3b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Gran_V%C3%ADa_%28Madrid%29_44.jpg/220px-Gran_V%C3%ADa_%28Madrid%29_44.jpg",
				"previous": "The reign of the Bourbons during the eighteenth century marked a new era in the city. Philip V tried to complete King Philip II's vision of urbanization of Madrid. Philip V built a palace in line with French taste, and other buildings such as St. Michael's Basilica and the Church of Santa Bárbara. King Charles III beautified the city and endeavoured to convert Madrid into one of the great European capitals. He pushed forward the construction of the Prado Museum (originally intended as a Natural Science Museum), the Puerta de Alcalá, the Royal Observatory, the Basilica of San Francisco el Grande, the Casa de Correos in Puerta del Sol, the Real Casa de la Aduana and the General Hospital (now houses the Reina Sofia Museum and Royal Conservatory of Music). The Paseo del Prado, surrounded by gardens and decorated with neoclassical statues, is an example of urban planning. The Duke of Berwick ordered the construction of the Liria Palace.",
				"after": "During the early 19th century, the Peninsular War, the loss of colonies in the Americas, and continuing coups limited the city's architectural development (Royal Theatre, the National Library of Spain, the Palace of the Senate and the Congress). The Segovia Viaduct linked the Royal Alcázar to the southern part of town.",
			"color": "dim|0.18209 gray|0.18209 dim|0.18209 grey|0.18209 dark|0.12458 gray|0.12458 dark|0.12458 grey|0.12458 gray|0.11677 grey|0.11677 silver|0.080299 slate|0.070735 gray|0.070735 light|0.059149 gray|0.059149 light|0.059149 grey|0.059149 light|0.057927 slate|0.057927 gray|0.057927 gainsboro|0.045165 lavender|0.040626 black|0.030699 alice|0.025656 blue|0.025656 white|0.0162 smoke|0.0162 ghost|0.014633 white|0.014633 azure|0.01351 dark|0.012219 slate|0.012219 gray|0.012219 light|0.01108 steel|0.01108 blue|0.01108 mint|0.010176 cream|0.010176 light|0.0099693 cyan|0.0099693 white|0.0092335 snow|0.0089569 floral|0.0068629 white|0.0068629 sea|0.0066207 shell|0.0066207 linen|0.0058603 firebrick|0.0044575 lavender|0.0035875 blush|0.0035875 antique|0.0034423 white|0.0034423  "
		}
	}
}
