{
	"add": {
		"doc": {
			"id": "933d820c7704c4b3d430bc9e508f7e01956825906faae5baefb4e1b7f63d8d93",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/20090814_Pritzker_Pavilion_on_Beethoven%27s_9th_Day_%282%29.JPG/220px-20090814_Pritzker_Pavilion_on_Beethoven%27s_9th_Day_%282%29.JPG",
				"previous": "Controversies during construction involved escalating costs and delays; both the pavilion and park opened four years later than originally planned and cost millions of dollars more than expected.[28][43]",
				"after": "Once the pavilion was built, the initial plan was that the lawn seating would be free for all events. An early brochure for the Grant Park Music Festival said \"You never need a ticket to attend a concert! The lawn and the general seating section are always admission free.\"[56] However, when parking revenue fell short of estimates during the first year, the city charged $10 for lawn seating at the August 31, 2005, concert by Tori Amos.[56] Amos, a classically trained musician who chose only piano and organ accompaniment for her concert, earned positive reviews as the inaugural rock and roll performer in a venue that regularly hosts classical music.[57][58] The city justified the charge by contending that since the Pavilion is an open air venue, there were many places in Millennium Park, such as the Cloud Gate, Crown Fountain and Lurie Gardens, where one could have enjoyed the sounds or the atmosphere of the park without having to pay.[56][59][60]",
			"color": "dark|0.22457 gray|0.22457 dark|0.22457 grey|0.22457 dim|0.16885 gray|0.16885 dim|0.16885 grey|0.16885 gray|0.16852 grey|0.16852 silver|0.14174 black|0.059054 light|0.053782 gray|0.053782 light|0.053782 grey|0.053782 dark|0.027648 slate|0.027648 gray|0.027648 gainsboro|0.023997 slate|0.019978 gray|0.019978 light|0.015815 slate|0.015815 gray|0.015815 dark|0.012462 olive|0.012462 green|0.012462 light|0.010389 steel|0.010389 blue|0.010389 rosy|0.010345 brown|0.010345 lavender|0.0082902 white|0.0051547 smoke|0.0051547  "
		}
	}
}
