{
	"add": {
		"doc": {
			"id": "934c1693668ddd869a993b6614d28951fc55311a339f17859becaeac3a6518d5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Matchem.jpg/220px-Matchem.jpg",
				"previous": "All modern Thoroughbreds trace back to three stallions imported into England from the Middle East in the late 17th and early 18th centuries: the Byerley Turk (1680s), the Darley Arabian (1704), and the Godolphin Arabian (1729).[17][18] Other stallions of oriental breeding were less influential, but still made noteworthy contributions to the breed. These included the Alcock's Arabian,[19] D'Arcy's White Turk, Leedes Arabian, and Curwen's Bay Barb.[20][21][notes 1] Another was the Brownlow Turk, who, among other attributes, is thought to be largely responsible for the gray coat color in Thoroughbreds.[19] In all, about 160 stallions of Oriental breeding have been traced in the historical record as contributing to the creation of the Thoroughbred. The addition of horses of Eastern bloodlines, whether Arabian, Barb, or Turk, to the native English mares[22] ultimately led to the creation of the General Stud Book (GSB) in 1791 and the practice of official registration of horses.[12] According to Peter Willett, about 50% of the foundation stallions appear to have been of Arabian bloodlines, with the remainder being evenly divided between Turkoman and Barb breeding.[22][notes 2]",
				"after": "Each of the three major foundation sires was, coincidentally, the ancestor of a grandson or great-great-grandson who was the only male descendant to perpetuate each respective horse's male line: Matchem was the only descendant of his grandsire, the Godolphin Arabian, to maintain a male line to the present;[24] the Byerley Turk's male line was preserved by Herod (or King Herod), a great-great-grandson;[25] and the male line of the Darley Arabian owes its existence to great-great-grandson Eclipse, who was the dominant racehorse of his day and never defeated.[20][26] One genetic study indicates that 95% of all male Thoroughbreds trace their direct male line (via the Y chromosome) to the Darley Arabian.[27] However, in modern Thoroughbred pedigrees, most horses have more crosses to the Godolphin Arabian (13.8%) than to the Darley Arabian (6.5%) when all lines of descent (maternal and paternal) are considered. Further, as a percentage of contributions to current Thoroughbred bloodlines, Curwen's Bay Barb (4.2%) appears more often than the Byerley Turk (3.3%). The majority of modern Thoroughbreds alive today trace to a total of only 27 or 28 stallions from the 18th and 19th centuries.[27][28]",
			"color": "tan|0.26063 antique|0.097281 white|0.097281 burly|0.087291 wood|0.087291 rosy|0.05925 brown|0.05925 blanched|0.053597 almond|0.053597 papaya|0.053057 whip|0.053057  "
		}
	}
}
