{
	"add": {
		"doc": {
			"id": "936f1787522b2045366c5394251aa6fe390447c372d4859db8454fa64fea7b6d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Raymond-Baker-Mint-US.jpg/170px-Raymond-Baker-Mint-US.jpg",
				"previous": "The redesign of the obverse has led to an enduring myth that the breast was covered up out of prudishness, or in response to public outcry. Breen stated that \"through their Society for the Suppression of Vice, the guardians of prudery at once began exerting political pressure on the Treasury Department to revoke authorization for these 'immoral' coins\".[44] Ron Guth and Jeff Garrett, in their book on US coins by type, aver that the covering up of Liberty was \"a change never authorized by MacNeil\".[45] Numismatic historian David Lange concedes that there is no evidence of outcry from the public, but suggests that the decision to change the coin was \"more likely prompted by objections from the Treasury Department\".[46] Numismatist Ray Young, in his 1979 article in Coins magazine about the quarter, suggested that the redesign \"came from the symbolism. If Liberty was going to stand up to her foes, she should do so fully-protected—not 'naked to her enemies.' Thus the war probably had much more to do with the change than any alleged 'public indignation.' \"[47]",
				"after": "Von Engelken had wanted to be president of the Federal Land Bank for the Third District. He was appointed to that post on February 8, 1917, but remained as Mint Director until February 20; his successor, Raymond T. Baker was nominated on February 10. Work on the new quarter was briefly interrupted by the death of Chief Engraver Barber at the age of 77 on February 18. One of von Engelken's final acts in office was to recommend the appointment of Barber's successor, Morgan, who was subsequently nominated by Wilson and confirmed by the Senate.[48]",
			"color": "dark|0.38026 gray|0.38026 dark|0.38026 grey|0.38026 dim|0.16284 gray|0.16284 dim|0.16284 grey|0.16284 gray|0.16059 grey|0.16059 silver|0.15845 black|0.12208 light|0.011518 gray|0.011518 light|0.011518 grey|0.011518  "
		}
	}
}
