{
	"add": {
		"doc": {
			"id": "9397b581c31e7193a9bdc62a07a697171d70df2ab7bde4dc6dda4491fb2e49f6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Anhinga_crop.jpg/170px-Anhinga_crop.jpg",
				"previous": "In 2000, Congress approved a federal effort to restore the Everglades, named the Comprehensive Everglades Restoration Plan (CERP), with the objectives of \"restoration, preservation and protection of the south Florida ecosystem while providing for other water-related needs of the region\",[81] and claiming to be the largest environmental restoration in history. It was a controversial plan; detractors worried that it \"relies on uncertain technologies, overlooks water quality, subsidizes damaging growth and delays its environmental benefits\".[82] Supporters of the plan included the National Audubon Society, who were accused by Friends of the Everglades and the Biodiversity Legal Foundation of prioritizing agricultural and business interests.[82]",
				"after": "CERP projects are designed to capture 1.7 billion US gallons (6,400,000 m3) of fresh water every day, store it in underground reservoirs and release the water to areas within 16 counties in South Florida. Approximately 35,600 acres (144 km2) of man-made wetlands are to be constructed to confine contaminated water before it is released to the Everglades, and 240 miles (390 km) of canals that divert water away from the Everglades are to be destroyed.[83] During the first five years of implementation, CERP was responsible for the purchase of 207,000 acres (840 km2) of land at a cost of $1 billion. The plan aims to spend $10.5 billion over 30 years, combining 50 different projects and giving them 5-year timelines.[84] The State of Florida has invested more than $2 billion into restoring the Everglades, but the funds have not been matched by the U.S. government.[85] As of June 2008, the U.S. government has spent only $400 million of the $7.8 billion legislated.[86] Initiatives that could aid Everglades restoration include the U.S. Sugar Land Corp transaction, the C-111 spreader canal and the Tamiami Trail bridging. These projects are supported by groups such as the Everglades Foundation, whose mission is to aid in the efforts of saving America's Everglades for future generations.[87] In spite of this, Everglades National Park was removed in 2007 from the List of World Heritage in Danger.[88] However, it was listed again on the List of World Heritage in Danger in 2010.[89] The National Research Council reported in September 2008 that no CERP projects had been completed, and the lack of progress on water deliveries to Everglades National Park \"is one of the most discouraging stories in Everglades restoration\".[90]",
			"color": "gray|0.23735 grey|0.23735 slate|0.23659 gray|0.23659 light|0.18141 slate|0.18141 gray|0.18141 dim|0.14553 gray|0.14553 dim|0.14553 grey|0.14553 black|0.12204 dark|0.050118 gray|0.050118 dark|0.050118 grey|0.050118 silver|0.0082965 light|0.0041467 gray|0.0041467 light|0.0041467 grey|0.0041467  "
		}
	}
}
