{
	"add": {
		"doc": {
			"id": "93a7c0348b672d4ef0ead3e34af051f8c20c508a24159ee22c0c8aa7b8959c84",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/USAF_ADCOM_Grumman_F-14_Tomcat_proposed_interceptor_-_1972.jpg/220px-USAF_ADCOM_Grumman_F-14_Tomcat_proposed_interceptor_-_1972.jpg",
				"previous": "The first F-14B was to be an improved version of the F-14A with more powerful \"Advanced Technology Engine\" F401 turbofans. The F-14C was a projected variant of this initial F-14B with advanced multi-mission avionics.[75] Grumman also offered an interceptor version of the F-14B in response to the U.S. Air Force's Improved Manned Interceptor Program to replace the Convair F-106 Delta Dart as an Aerospace Defense Command interceptor in the 1970s. The F-14B program was terminated in April 1974.[76]",
				"after": "Grumman proposed a few improved Super Tomcat versions. The first was the Quickstrike, which was an F-14D with navigational and targeting pods, additional attach points for weapons, and added ground attack capabilities to its radar. The Quickstrike was to fill the role of the A-6 Intruder after it was retired. This was not considered enough of an improvement by Congress, so the company shifted to the Super Tomcat 21 proposed design. The Super Tomcat 21 was a proposed lower cost alternative to the Navy Advanced Tactical Fighter (NATF). The Grumman design would have the same shape and body as the Tomcat, and an upgraded AN/APG-71 radar. New GE F110-129 engines were to provide a supercruise speed of Mach 1.3 and featured thrust vectoring nozzles. The version would have increased fuel capacity and modified control surfaces for improved takeoffs and lower landing approach speed. The Attack Super Tomcat 21 version was the last Super Tomcat proposed design. It added even more fuel capacity, more improvements to control surfaces, and possibly an active electronically scanned array (AESA) radar from the canceled A-12 attack aircraft.[77]",
			"color": "gray|0.24053 grey|0.24053 black|0.21266 tan|0.16729 dim|0.12712 gray|0.12712 dim|0.12712 grey|0.12712 dark|0.12599 gray|0.12599 dark|0.12599 grey|0.12599 silver|0.02522 light|0.010183 gray|0.010183 light|0.010183 grey|0.010183 burly|0.0083983 wood|0.0083983  "
		}
	}
}
