{
	"add": {
		"doc": {
			"id": "93b2480dc7a4802d2e96d8535e7ee0066b3dbdd339a858bdb35ce5f5985b2da2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Cleveland_City_Hall.jpg/220px-Cleveland_City_Hall.jpg",
			"previous": [],
				"after": "Cleveland's position as a center of manufacturing established it as a hotbed of union activity early in its history. While other parts of Ohio, particularly Cincinnati and the southern portion of the state, have historically supported the Republican Party, Cleveland commonly breeds the strongest support in the state for the Democrats.[138] At the local level, elections are nonpartisan. However, Democrats still dominate every level of government. Cleveland is split between two congressional districts. Most of the western part of the city is in the 9th District, represented by Marcy Kaptur. Most of the eastern part of the city, as well as most of downtown, is in the 11th District, represented by Marcia Fudge. Both are Democrats. During the 2004 Presidential election, although George W. Bush carried Ohio by 2.1%, John Kerry carried Cuyahoga County 66.6%–32.9%,[139] his largest margin in any Ohio county. The city of Cleveland supported Kerry over Bush by the even larger margin of 83.3%–15.8%.[140] The city of Cleveland operates on the mayor-council (strong mayor) form of government.[141] The mayor is the chief executive of the city, and the office is held in 2010 by Frank G. Jackson. Previous mayors of Cleveland include progressive Democrat Tom L. Johnson, World War I era War Secretary and founder of Baker Hostetler law firm Newton D. Baker, United States Supreme Court Justice Harold Hitz Burton, Republican Senator George V. Voinovich, two-term Ohio Governor and Senator, former United States Representative Dennis Kucinich of Ohio's 10th congressional district, Frank J. Lausche, and Carl B. Stokes, the first African American mayor of a major American city.[142] The state of Ohio lost two Congressional seats as a result of the 2010 Census, which affects Cleveland's districts in the northeast part of the state.[143]",
			"color": "dim|0.3391 gray|0.3391 dim|0.3391 grey|0.3391 gray|0.30517 grey|0.30517 dark|0.2185 gray|0.2185 dark|0.2185 grey|0.2185 black|0.060063 silver|0.036435 slate|0.015333 gray|0.015333 light|0.010368 slate|0.010368 gray|0.010368 dark|0.0089324 slate|0.0089324 gray|0.0089324  "
		}
	}
}
