{
	"add": {
		"doc": {
			"id": "93d171acdbc78a12225318ff5b09315297b3582bd0504f2b8ce46c7a8718fc1e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Robert_M._La_Follette%2C_Sr_as_Senator2.jpg/220px-Robert_M._La_Follette%2C_Sr_as_Senator2.jpg",
				"previous": "Beginning in the 1890s, farmers in Wisconsin shifted from wheat to dairy production in order to make more sustainable and profitable use of their land. Many immigrants carried cheese-making traditions that, combined with the state's suitable geography and dairy research led by Stephen Babcock at the University of Wisconsin, helped the state build a reputation as \"America's Dairyland.\"[36] Meanwhile, conservationists including Aldo Leopold helped reestablish the state's forests during the early 20th century,[37] paving the way for a more renewable lumber and paper milling industry as well as promoting recreational tourism in the northern woodlands. Manufacturing also boomed in Wisconsin during the early 20th century, driven by an immense immigrant workforce arriving from Europe. Industries in cities like Milwaukee ranged from brewing and food processing to heavy machine production and toolmaking, leading Wisconsin to rank 8th among U.S. states in total product value by 1910.[38]",
				"after": "The early 20th century was also notable for the emergence of progressive politics championed by Robert M. La Follette. Between 1901 and 1914, Progressive Republicans in Wisconsin created the nation's first comprehensive statewide primary election system,[39] the first effective workplace injury compensation law,[40] and the first state income tax,[41] making taxation proportional to actual earnings. The progressive Wisconsin Idea also promoted the statewide expansion of the University of Wisconsin through the UW-Extension system at this time.[42] Later, UW economics professors John R. Commons and Harold Groves helped Wisconsin create the first unemployment compensation program in the United States in 1932.[43]",
			"color": " "
		}
	}
}
