{
	"add": {
		"doc": {
			"id": "93e5bc2c951ef98a465fe29a71240076f699e274369069cdac5a32d25f0d1926",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/EdwardTeller1958.jpg/120px-EdwardTeller1958.jpg",
				"previous": "Portal:Technology/Featured biography/17",
				"after": "Edward Teller was a Hungarian-born American nuclear physicist of Jewish descent. He was known colloquially as \"the father of the hydrogen bomb\". Teller was an immigrant to the United States during the 1930s, and was an early member of the Manhattan Project to develop the first atomic bombs. During this time he made a serious push for the first time to develop fusion-based weapons as well, but they were deferred until after the war. After his controversial testimony in the security clearance hearing of his former Los Alamos colleague J. Robert Oppenheimer, Teller became ostracized by much of the scientific community. He continued to find support from the U.S. government and military research establishment. He was a co-founder of Lawrence Livermore National Laboratory, and was both director and associate director for many years. In his later years he became especially known for his advocacy of controversial technological solutions to both military and civilian problems, including a plan to excavate an artificial harbor in Alaska using thermonuclear explosives. Over the course of his long life, Teller was known both for his scientific ability and his difficult interpersonal relations, and is considered one of the key influences of the character Dr. Strangelove in the 1964 movie of the same name.",
			"color": "dark|0.2619 gray|0.2619 dark|0.2619 grey|0.2619 gray|0.23204 grey|0.23204 dim|0.21653 gray|0.21653 dim|0.21653 grey|0.21653 silver|0.10973 black|0.068371 light|0.046693 gray|0.046693 light|0.046693 grey|0.046693 gainsboro|0.029105 white|0.0063865 smoke|0.0063865 sea|0.003571 shell|0.003571 alice|0.0034797 blue|0.0034797 linen|0.0034623 ghost|0.0034426 white|0.0034426 snow|0.0033952  "
		}
	}
}
