{
	"add": {
		"doc": {
			"id": "93e8b9cd134c7d0cdbda9c63aadd7fa51a402b96f54a1085671ea3e978e8813a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Champollion_table.jpg/330px-Champollion_table.jpg",
				"previous": "Silvestre de Sacy eventually gave up work on the stone, but he was to make another contribution. In 1811, prompted by discussions with a Chinese student about Chinese script, Silvestre de Sacy considered a suggestion made by Georg Zoëga in 1797 that the foreign names in Egyptian hieroglyphic inscriptions might be written phonetically; he also recalled that as long ago as 1761, Jean-Jacques Barthélemy had suggested that the characters enclosed in cartouches in hieroglyphic inscriptions were proper names. Thus, when Thomas Young, foreign secretary of the Royal Society of London, wrote to him about the stone in 1814, Silvestre de Sacy suggested in reply that in attempting to read the hieroglyphic text, Young might look for cartouches that ought to contain Greek names and try to identify phonetic characters in them.[62]",
				"after": "Young did so, with two results that together paved the way for the final decipherment. He discovered in the hieroglyphic text the phonetic characters \"p t o l m e s\" (in today's transliteration \"p t w l m y s\"), that were used to write the Greek name \"Ptolemaios\". He also noticed that these characters resembled the equivalent ones in the Demotic script, and went on to note as many as 80 similarities between the hieroglyphic and demotic texts on the stone, an important discovery because the two scripts were previously thought to be entirely different from one another. This led him to deduce correctly that the demotic script was only partly phonetic, also consisting of ideographic characters imitated from hieroglyphs.[I] Young's new insights were prominent in the long article \"Egypt\" that he contributed to the Encyclopædia Britannica in 1819.[J] He could, however, get no further.[63]",
			"color": " "
		}
	}
}
