{
	"add": {
		"doc": {
			"id": "93f3e36ccf9c052709182bdb387bba4b5c89b9e4a5b5b3bc2479360cff4d1509",
			"url": "https://upload.wikimedia.org/wikipedia/commons/3/35/Sarcoramphus_papa_in_flight1.jpg",
				"previous": "Harper noticed that Bartram's notes were considerably altered and expanded in the printed edition, and the detail of the white tail appeared in print for the first time in this revised account. Harper believed that Bartram could have tried to fill in details of the bird from memory and got the tail coloration wrong.[22] Harper and several other researchers have attempted to prove the former existence of a king vulture relative in Florida at this late date, suggesting that the population was in the process of extinction and finally disappeared during a cold spell.[22][24] Additionally, William McAtee, noting the tendency of birds to form Floridian subspecies, suggested that the white tail could be a sign that the painted vulture was a subspecies of the king vulture.[25]",
				"after": "Excluding the two species of condors, the king vulture is the largest of the New World vultures. Its overall length ranges from 67–81 centimeters (27–32 in) and its wingspan is 1.2–2 meters (4–6.6 ft). Its weight ranges from 2.7–4.5 kilograms (6–10 lb).[9][26] An imposing bird, the adult king vulture has predominantly white plumage, which has a slight rose-yellow tinge to it.[27] In stark contrast, the wing coverts, flight feathers and tail are dark grey to black, as is the prominent thick neck ruff.[3] The head and neck are devoid of feathers, the skin shades of red and purple on the head, vivid orange on the neck and yellow on the throat.[28] On the head, the skin is wrinkled and folded, and there is a highly noticeable irregular golden crest attached on the cere above its orange and black bill;[3] this caruncle does not fully form until the bird’s fourth year.[29]",
			"color": "black|0.74052 light|0.052757 steel|0.052757 blue|0.052757 dark|0.032143 gray|0.032143 dark|0.032143 grey|0.032143 silver|0.02598 light|0.024121 slate|0.024121 gray|0.024121 sky|0.02088 blue|0.02088 light|0.019764 sky|0.019764 blue|0.019764 slate|0.018223 gray|0.018223 dim|0.014026 gray|0.014026 dim|0.014026 grey|0.014026 gray|0.010254 grey|0.010254 light|0.0099409 gray|0.0099409 light|0.0099409 grey|0.0099409 light|0.0065349 blue|0.0065349  "
		}
	}
}
