{
	"add": {
		"doc": {
			"id": "941e8bd219848d369cd71cca7df9255bea72132a0005f35d593a8e56068e6be5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Porson_13_Jan_1803.jpg/330px-Porson_13_Jan_1803.jpg",
			"previous": [],
				"after": "The Greek text on the Rosetta Stone provided the starting point. Ancient Greek was widely known to scholars, but the details of its use in the Hellenistic period as a government language in Ptolemaic Egypt were not familiar: large-scale discoveries of Greek papyri were a long way in the future. Thus the earliest translations of the Greek text of the stone show the translators still struggling with the historical context and with administrative and religious jargon. Stephen Weston verbally presented an English translation of the Greek text at a Society of Antiquaries meeting in April 1802.[35][58] Meanwhile, two of the lithographic copies made in Egypt had reached the Institut de France in Paris, in 1801. There, the librarian and antiquarian Gabriel de La Porte du Theil set to work on a translation of the Greek. Almost immediately dispatched elsewhere on Napoleon's orders, he left his unfinished work in the hands of a colleague, Hubert-Pascal Ameilhon, who in 1803 produced the first published translations of the Greek text, in both Latin and French to ensure that they would circulate widely.[F] At Cambridge, Richard Porson worked on the missing lower right corner of the Greek text. He produced a skillful suggested reconstruction, which was soon being circulated by the Society of Antiquaries alongside its prints of the inscription. At Göttingen at almost the same moment, the Classical historian Christian Gottlob Heyne, working from one of these prints, made a new Latin translation of the Greek text that was more reliable than Ameilhon's. First published in 1803,[G] it was reprinted by the Society of Antiquaries, alongside Weston's previously unpublished English translation, Colonel Turner's narrative, and other documents, in a special issue of its journal Archaeologia in 1811.[H][59][60]",
			"color": " "
		}
	}
}
