{
	"add": {
		"doc": {
			"id": "94255819a941cda6deb682f563e35547dac8edd5fb44a5b4e0081619556cf5e2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Samuel_Parris.jpeg/220px-Samuel_Parris.jpeg",
				"previous": "At some point in February 1692, likely after the afflictions began but before specific names were mentioned, a neighbor of Rev. Parris, Mary Sibly (or Sibley; aunt of the afflicted Mary Walcott), instructed John Indian, one of the minister's slaves, to make a witch cake, using traditional English white magic to discover the identity of the witch who was afflicting the girls. The cake, made from rye meal and urine from the afflicted girls, was fed to a dog. According to English folk understanding of how witches accomplished affliction, when the dog ate the cake, the witch herself would be hurt because invisible particles she had sent to afflict the girls remained in the girls' urine, and her cries of pain when the dog ate the cake would identify her as the witch. This superstition was based on the Cartesian \"Doctrine of Effluvia\", which posited that witches afflicted by the use of \"venomous and malignant particles, that were ejected from the eye\", according to the October 8, 1692 letter of Thomas Brattle, a contemporary critic of the trials.[60]",
				"after": "According to the Records of the Salem-Village Church, Parris spoke with Sibly (or Sibley) privately on March 25, 1692 about her \"grand error\" and accepted her \"sorrowful confession.\" During his Sunday sermon on March 27 he addressed his congregation on the subject of the \"calamities\" that had begun in his own household, but stated \"it never brake forth to any considerable light, until diabolical means were used, by the making of a cake by my Indian man, who had his direction from this our sister, Mary Sibly\", going on to admonish all against the use of any kind of magic, even white magic, because it was essentially, \"going to the Devil for help against the Devil.\" Mary Sibly (or Sibley) publicly acknowledged the error of her actions before the congregation, who voted by a show of hands that they were satisfied with her admission of error.[61] Other instances appear in the records of the episode that demonstrated a continued belief by members of the community in this effluvia as legitimate evidence, including accounts in two statements against Elizabeth Howe that people had suggested cutting off and burning an ear of two different animals Howe was thought to have afflicted, to prove she was the one who had bewitched them to death.[62]",
			"color": "dim|0.13924 gray|0.13924 dim|0.13924 grey|0.13924 burly|0.13637 wood|0.13637 tan|0.10847 rosy|0.045543 brown|0.045543 gray|0.037757 grey|0.037757 sienna|0.033229 navajo|0.032903 white|0.032903 peach|0.032333 puff|0.032333 peru|0.029418 wheat|0.021524 sandy|0.019547 brown|0.019547 moccasin|0.017746  "
		}
	}
}
