{
	"add": {
		"doc": {
			"id": "9438d0d6e36679507b2580a7465be07058ca6ab8a8e12d9fb30f4ab9766c5e2b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/UCB-University-Library.jpg/220px-UCB-University-Library.jpg",
				"previous": "Berkeley is a research university with a \"very high\" level of research activity.[50] There are 1,582 full-time and 500 part-time faculty members dispersed among more than 130 academic departments and more than 80 interdisciplinary research units.[citation needed] Berkeley's current faculty includes 227 American Academy of Arts and Sciences Fellows, 3 Fields Medal winners, 83 Fulbright Scholars, 139 Guggenheim Fellows, 87 members of the National Academy of Engineering, 132 members of the National Academy of Sciences, 8 Nobel Prize winners, 3 Pulitzer Prize winners, 84 Sloan Fellows, 7 Wolf Prize winners and 1 Pritzker Prize winner.[62] 72 Nobel laureates have been affiliated with the university as faculty, alumni or researchers, the most of any public university in the United States and sixth most of any university in the world.",
				"after": "Berkeley's 32 libraries tie together to make the fourth largest academic library in the United States surpassed only by Harvard University Library, Yale University Library and University of Illinois at Urbana-Champaign Library.[63] However, considering the relative sizes and ages of these University libraries, Berkeley's collections have been growing about as fast as those at Harvard and Yale combined: specifically, 1.8 times faster than Harvard, and 1.9 times faster than Yale. In 2003, the Association of Research Libraries ranked it as the top public and third overall university library in North America based on various statistical measures of quality.[64] As of 2006, Berkeley's library system contains over 11 million volumes and maintains over 70,000 serial titles.[65] The libraries together cover over 12 acres (4.9 ha) of land and form one of the largest library complexes in the world.[66] Doe Library serves as the library system's reference, periodical, and administrative center, while most of the main collections are housed in the subterranean Gardner Main Stacks and Moffitt Undergraduate Library. The Bancroft Library, with holdings of over 400,000 printed volumes, maintains a collection that documents the history of the western part of North America, with an emphasis on California, Mexico and Central America.",
			"color": "olive|0.19178 drab|0.19178 dim|0.17376 gray|0.17376 dim|0.17376 grey|0.17376 gray|0.14987 grey|0.14987 dark|0.10313 gray|0.10313 dark|0.10313 grey|0.10313 silver|0.069576 dark|0.047394 olive|0.047394 green|0.047394 light|0.045116 gray|0.045116 light|0.045116 grey|0.045116 black|0.044869 slate|0.038014 gray|0.038014 gainsboro|0.025799 light|0.025035 slate|0.025035 gray|0.025035 dark|0.01584 slate|0.01584 gray|0.01584 linen|0.0074838 antique|0.0063915 white|0.0063915 white|0.006276 smoke|0.006276  "
		}
	}
}
