{
	"add": {
		"doc": {
			"id": "94a2e7c16f46861fa748fb7c03722a5f7e1953c6db5c6ed46fed0eeb1cc8d955",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Cathay_Pacific%2C_Boeing_747-400%2C_SIN.jpg/220px-Cathay_Pacific%2C_Boeing_747-400%2C_SIN.jpg",
				"previous": "In June 2008, Cathay Pacific entered into a plea bargain with the United States Department of Justice in respect of antitrust investigations over air cargo price fixing agreements. It was fined US$60 million. The airline has subsequently set up an internal Competition Compliance Office, reporting to chief operating officer John Slosar, to ensure that the Group complies with all relevant competition and antitrust laws in the jurisdiction in which it operates. The breaches for which Cathay Pacific Cargo were being investigated in the U.S. were not illegal under Hong Kong competition law.[43][44]",
				"after": "In March 2009, the airline reported a record full-year loss of HK$8.56 billion for 2008, which was also the carrier's first since the 1997 Asian Financial Crisis. The record loss included fuel-hedging losses of HK$7.6 billion and a HK$468 million charge for a price-fixing fine in the U.S. It had to scrap its final dividend. The hedging losses were a result of locking in fuel prices at higher than prevailing market price. As of the end of 2008, Cathay Pacific has hedged about half of its fuel needs until the end of 2011. The airline at the time estimated that it would face no further cash costs from the hedges if the average market price stood at US$75, enabling it recoup provisions it made in 2008.[45]",
			"color": "dark|0.36146 gray|0.36146 dark|0.36146 grey|0.36146 gray|0.22793 grey|0.22793 dim|0.12384 gray|0.12384 dim|0.12384 grey|0.12384 silver|0.093638 black|0.046801 slate|0.024917 gray|0.024917 light|0.023211 slate|0.023211 gray|0.023211 dark|0.018611 olive|0.018611 green|0.018611 light|0.017933 gray|0.017933 light|0.017933 grey|0.017933 gainsboro|0.012948 white|0.0052676 smoke|0.0052676 light|0.0038693 steel|0.0038693 blue|0.0038693 alice|0.003842 blue|0.003842 ghost|0.0037796 white|0.0037796 snow|0.0036272 sea|0.0035392 shell|0.0035392  "
		}
	}
}
