{
	"add": {
		"doc": {
			"id": "94adef76359b977a31f26c14a861ed58755bd961850e4df3b74f68478ddcc3e0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Flickr_-_nicogenin_-_66%C3%A8me_Festival_de_Venise_%28Mostra%29_-_Jared_Leto_%2814%29.jpg/170px-Flickr_-_nicogenin_-_66%C3%A8me_Festival_de_Venise_%28Mostra%29_-_Jared_Leto_%2814%29.jpg",
				"previous": "In August 2008, during the recording process of their third studio album, Thirty Seconds to Mars attempted to sign with a new label, prompting EMI (the parent label of Virgin), to file a $30 million breach of contract lawsuit.[65] After nearly a year of legal battles, the band announced on April 28, 2009, that the suit had been settled following a defence based on the De Havilland Law.[66] Thirty Seconds to Mars then signed a new contract with EMI and released their third album This Is War in December 2009 to critical acclaim.[67][68] This Is War reached the top ten of several national album charts and earned numerous music awards.[69]",
				"after": "Leto's next film was the 2009 science fiction drama Mr. Nobody, directed by Jaco Van Dormael. He portrayed the title role of Nemo Nobody, the last mortal on Earth after the human race has achieved quasi-immortality. His role required him to play various versions of his character, from 34 to 118 years old, spending six hours daily for the full make-up and adopting the voice of an old-aged man.[70] Mr. Nobody premiered at the 2009 Venice Film Festival. Critical response praised the film's artistry and Leto's performance.[71] Boyd van Hoeij from Variety felt that \"his acting talent really comes into full view in his scenes as the last dying man on Earth. Despite too much old-age makeup, Leto nevertheless infuses the character with some real raw emotional power;\"[72] while Bruce Kirkland of Toronto Sun claimed that Leto gave \"a marvelously full-blooded, brain-spinning, tour-de-force performance.\"[73]",
			"color": "rosy|0.3115 brown|0.3115 black|0.30511 light|0.065355 gray|0.065355 light|0.065355 grey|0.065355 silver|0.058554 gainsboro|0.055166 lavender|0.04638 dim|0.040678 gray|0.040678 dim|0.040678 grey|0.040678 dark|0.034725 gray|0.034725 dark|0.034725 grey|0.034725 alice|0.019488 blue|0.019488 ghost|0.014133 white|0.014133 white|0.010068 smoke|0.010068 gray|0.0097178 grey|0.0097178  "
		}
	}
}
