{
	"add": {
		"doc": {
			"id": "94b2638de791888e935c6bab9e45f7240f81b37ce4d315b01884cbeb022acbed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Banksia_spinulosa_Spike_Immature.jpg/220px-Banksia_spinulosa_Spike_Immature.jpg",
				"previous": "Banksia spinulosa var. cunninghamii is found in 3 disjunct regions; the Dandenong Ranges east of Melbourne, East Gippsland between Lakes Entrance and Eden, and in the Great Dividing Range in a band from Jervis Bay to Glen Davis in Central New South Wales, while there have been collections northwards in the Dividing Range up into southeast Queensland.[33] It can be an understorey plant under dense as well as open forest cover.[34]",
				"after": "Like other banksias, Banksia spinulosa plays host to a wide variety of pollinators and is a vital source of nectar in autumn, when other flowers are scarce. Banksias have been the subject of many studies about their pollination; B. spinulosa is no exception. A 1998 study in Bungawalbin National Park in Northern New South Wales found that B. spinulosa var. collina inflorescences are foraged by a variety of small mammals, including marsupials such as Antechinus flavipes (Yellow-footed Antechinus), which carry pollen loads comparable to those of nectar-eating birds, making them effective pollinators.[35] The same study noted that, unlike other banksias studied, B. spinulosa var. collina was visited predominantly by native bees rather than the introduced Apis mellifera (European Honeybee).[35]",
			"color": "dark|0.35334 olive|0.35334 green|0.35334 black|0.074588 dim|0.047398 gray|0.047398 dim|0.047398 grey|0.047398 tan|0.03405 dark|0.032784 golden|0.032784 rod|0.032784 golden|0.032784 rod|0.032784 burly|0.029118 wood|0.029118 dark|0.026019 khaki|0.026019 olive|0.023591 drab|0.023591 dark|0.020468 sea|0.020468 green|0.020468 pale|0.017615 golden|0.017615 rod|0.017615 wheat|0.017598 silver|0.016681 dark|0.016132 slate|0.016132 gray|0.016132 khaki|0.014484 light|0.013662 gray|0.013662 light|0.013662 grey|0.013662 dark|0.012547 gray|0.012547 dark|0.012547 grey|0.012547 navajo|0.011968 white|0.011968  "
		}
	}
}
