{
	"add": {
		"doc": {
			"id": "94b77f80ca6425b13cc0cc21f44b76120f9f4a8276a0b4bfb1a1b6ce02c71476",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Poole_Quay_-_geograph.co.uk_636450.jpg/220px-Poole_Quay_-_geograph.co.uk_636450.jpg",
				"previous": "Poole established successful commerce with the North American colonies in the 16th century, including the important fisheries of Newfoundland.[14] The trade with Newfoundland grew steadily to meet the demand for fish from the Catholic countries of Europe. Poole's share of this trade varied but the most prosperous period started in the early 18th century and lasted until the early 19th century. The trade was a three-cornered route; ships sailed to Newfoundland with salt and provisions, then carried dried and salted fish to Europe before returning to Poole with wine, olive oil, and salt.[18] By the early 18th century Poole had more ships trading with North America than any other English port and vast wealth was brought to Poole's merchants.[19] This prosperity supported much of the development which now characterises the Old Town where many of the medieval buildings were replaced with Georgian mansions and terraced housing.[18][20] The end of the Napoleonic Wars and the conclusion of the War of 1812 ended Britain's monopoly over the Newfoundland fisheries and other nations took over services provided by Poole's merchants at a lower cost. Poole's Newfoundland trade rapidly declined and within a decade most merchants had ceased trading.[21][22]",
				"after": "The town grew rapidly during the industrial revolution as urbanisation took place and the town became an area of mercantile prosperity and overcrowded poverty. At the turn of the 19th century, nine out of ten workers were engaged in harbour activities, but as the century progressed ships became too large for the shallow harbour and the port lost business to the deep water ports at Liverpool, Southampton and Plymouth.[19] Poole's first railway station opened in Hamworthy in 1847 and later extended to the centre of Poole in 1872, effectively ending the port's busy coastal shipping trade.[22] The beaches and landscape of southern Dorset and south-west Hampshire began to attract tourists during the 19th century and the villages to the east of Poole began to grow and merge until the seaside resort of Bournemouth emerged. Although Poole did not become a resort like many of its neighbours, it continued to prosper as the rapid expansion of Bournemouth created a large demand for goods manufactured in Poole.[23]",
			"color": "black|0.34173 dim|0.16948 gray|0.16948 dim|0.16948 grey|0.16948 gray|0.096589 grey|0.096589 dark|0.062198 slate|0.062198 gray|0.062198 dark|0.053604 gray|0.053604 dark|0.053604 grey|0.053604 rosy|0.033155 brown|0.033155 silver|0.02742 antique|0.019001 white|0.019001 light|0.016626 gray|0.016626 light|0.016626 grey|0.016626 linen|0.015952  "
		}
	}
}
