{
	"add": {
		"doc": {
			"id": "94d91186e363fa0c5df557a91e0edccc6a4e8c9142ccd755fdca74ad306bdd0d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/PrideandPrejudiceCH3detail.jpg/220px-PrideandPrejudiceCH3detail.jpg",
				"previous": "Studies have sought to find the precise function of Mups in pheromone communication. Mup proteins have been shown to promote puberty and accelerate the estrus cycle in female mice, inducing the Vandenbergh and Whitten effects.[38][45] However, in both cases the Mups had to be presented to the female dissolved in male urine, indicating that the protein requires some urinary context to function. In 2007 Mups normally found in male mouse urine were made in transgenic bacteria, and therefore created devoid of the chemicals they normally bind. These Mups were shown to be sufficient to promote aggressive behaviour in males, even in the absence of urine.[19] In addition, Mups made in bacteria were found to activate olfactory sensory neurons in the vomeronasal organ (VNO), a subsystem of the nose known to detect pheromones via specific sensory receptors, of mice and rats.[19][46] Together, this demonstrated that Mup proteins can act as pheromones themselves, independent of their ligands.[47]",
				"after": "Consistent with a role in male-male aggression, adult male mice secrete significantly more Mups into their urine than females, juveniles or castrated male mice. The precise mechanism driving this difference between the sexes is complex, but at least three hormones—testosterone, growth hormone and thyroxine—are known to positively influence the production of Mups in mice.[48] Wild house mouse urine contains variable combinations of four to seven distinct Mup proteins per mouse.[49] Some inbred laboratory mouse strains, such as BALB/c and C57BL/6, also have different proteins expressed in their urine.[20] However, unlike wild mice, different individuals from the same strain express the same protein pattern, an artifact of many generations of inbreeding.[50][51] One unusual Mup is less variable than the others: it is consistently produced by a high proportion of wild male mice and is almost never found in female urine. When this Mup was made in bacteria and used in behavioural testing, it was found to attract female mice. Other Mups were tested but they did not have the same attractive qualities, suggesting the male-specific Mup acts as a sex pheromone.[52] Scientists named this Mup darcin as a humorous reference to Fitzwilliam Darcy, the romantic hero from Pride and Prejudice.[53][54] Taken together, the complex patterns of Mups produced has the potential to provide a range information about the donor animal, such as gender, fertility, social dominance, age, genetic diversity or kinship.[19][55][56] Wild mice (unlike laboratory mice that are genetically identical and which therefore also have identical patterns of Mups in the urine) have individual patterns of Mup expression in their urine that act as a \"barcode\" to uniquely identify the owner of a scent mark.[55]",
			"color": " "
		}
	}
}
