{
	"add": {
		"doc": {
			"id": "94e22146362d469358ead952baac965c5dbd1fc3111f652ac38ba6602c99b623",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Kane_Kwei_Carpentry_Workshop.jpg/300px-Kane_Kwei_Carpentry_Workshop.jpg",
				"previous": "There is an enormous diversity of funeral art from traditional societies across the world, much of it in perishable materials, and some is mentioned elsewhere in the article. In traditional African societies, masks often have a specific association with death, and some types may be worn mainly or exclusively for funeral ceremonies.[90] The funeral ceremonies of the Indigenous Australians typically feature body painting; the Yolngu and Tiwi people create carved pukumani burial poles from ironwood trunks,[91] while elaborately carved burial trees have been used in south-eastern Australia.[92] The Toraja people of central Sulawesi are famous for their burial practices, which include the setting-up of effigies of the dead on cliffs. The 19th- and 20th-century royal Kasubi Tombs in Uganda, destroyed by fire in 2010, were a circular compound of thatched buildings similar to those inhabited by the earlier Kabakas when alive, but with special characteristics.[93]",
				"after": "In several cultures, goods for use in the afterlife are still interred or cremated, for example Hell bank notes in East Asian communities.[94] In Ghana, mostly among the Ga people, elaborate figurative coffins in the shape of cars, boats or animals are made of wood. These were introduced in the 1950s by Seth Kane Kwei.[95]",
			"color": "black|0.40063 tan|0.095001 burly|0.058669 wood|0.058669 dark|0.036075 gray|0.036075 dark|0.036075 grey|0.036075 gray|0.026951 grey|0.026951 silver|0.026337 light|0.019861 gray|0.019861 light|0.019861 grey|0.019861 dim|0.019266 gray|0.019266 dim|0.019266 grey|0.019266 antique|0.017884 white|0.017884 dark|0.015815 olive|0.015815 green|0.015815 gainsboro|0.014703 linen|0.010698 papaya|0.010665 whip|0.010665 blanched|0.010658 almond|0.010658 bisque|0.010413 wheat|0.0097101 beige|0.0095341 golden|0.0092218 rod|0.0092218 old|0.0091146 lace|0.0091146  "
		}
	}
}
