{
	"add": {
		"doc": {
			"id": "94e2da9fb276e2893ef9a9a7a07e9095f35ba1532e8bbd649fe2fd72f1d7444c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Ratanakiri_districts.jpg/220px-Ratanakiri_districts.jpg",
				"previous": "Village government in Ratanakiri has both traditional and administrative components. Traditional forms of government, namely village elders and other indigenous institutions, are dominant.[57] Members of each village designate one or more community elders to manage village affairs, mediate conflicts, and ensure that villagers follow customary laws, particularly about land and resource use.[58] Elders do not play an autocratic role, and are instead primarily respected advisors and consensus builders.[59] Village elders are generally male, but women also play a role in the management of the community and its resources.[60] A village may also have a village chief, i.e., a local government person who is appointed by a higher governmental official.[57] The village chief serves as a liaison between the village and outside government officials, but lacks traditional authority.[57] The role of the village chief in village governance may be poorly defined; in one Kreung village, residents told a researcher that they were \"very unclear exactly what the work of the village chief entailed.\"[57]",
				"after": "The province is subdivided into nine districts, as follows:[61]",
			"color": "alice|0.32268 blue|0.32268 lavender|0.19448 light|0.075295 cyan|0.075295 azure|0.050773 gray|0.0502 grey|0.0502 dark|0.048121 gray|0.048121 dark|0.048121 grey|0.048121 ghost|0.042856 white|0.042856 black|0.026497 white|0.025256 smoke|0.025256 silver|0.023332 gainsboro|0.020927 light|0.019294 gray|0.019294 light|0.019294 grey|0.019294 mint|0.01786 cream|0.01786 light|0.016938 slate|0.016938 gray|0.016938 white|0.014495 slate|0.013499 gray|0.013499 dim|0.012392 gray|0.012392 dim|0.012392 grey|0.012392 snow|0.011345 light|0.0040867 blue|0.0040867 floral|0.0025738 white|0.0025738  "
		}
	}
}
