{
	"add": {
		"doc": {
			"id": "94e6e3423eb1a30ca3b81f0d508e090b8a365873383321c1de794a1b251dd62e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Paraceratherium_restorations_1923.jpg/220px-Paraceratherium_restorations_1923.jpg",
				"previous": "The limbs were large and robust to support the animal's large weight, and were in some ways similar to and convergent with those of elephants and sauropod dinosaurs with their likewise graviportal (heavy and slow moving) builds. Unlike such animals, which tend to lengthen the upper limb bones while shortening, fusing and compressing the lower limb, hand, and foot bones, Paraceratherium had short upper limb bones and long hand and foot bones—except for the disc-shaped phalanges—similar to the running rhinoceroses from which they descended. Some foot bones were almost 50 centimetres (20 in) long. The thigh bones typically measured 1.5 m (5 ft), a size only exceeded by those of some elephants and dinosaurs. The thigh bones were pillar-like and much thicker and more robust than those of other rhinoceroses, and the three trochanters on the sides were much reduced, as this robustness diminished their importance. The limbs were held in a column-like posture instead of bent, as in smaller animals, which reduced the need for large limb muscles.[4] The front limbs had three toes.[33]",
				"after": "Due to the fragmentary nature of known Paraceratherium fossils, the animal has been reconstructed in several different ways since its discovery.[34] In 1923, W. D. Matthew supervised an artist to draw a reconstruction of the skeleton based on the even less complete P. transouralicum specimens known by then, using the proportions of a modern rhinoceros as a guide.[35] The result was too squat and compact, and Osborn had a more slender version drawn later the same year. Some later life restorations have made the animal too slender, with little regard to the underlying skeleton.[4] Gromova published a more complete skeletal reconstruction in 1959, based on the P. transouralicum skeleton from the Aral Formation, but this also lacked several neck vertebrae.[36]",
			"color": " "
		}
	}
}
