{
	"add": {
		"doc": {
			"id": "94e92a5ab3adcf0dc7731869b050a31f2ffd30d77d61a8fcd5fcbb1bff240940",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/California_Chrome_and_Victor_Espinoza_at_2014_Preakness_Stakes.jpg/220px-California_Chrome_and_Victor_Espinoza_at_2014_Preakness_Stakes.jpg",
				"previous": "Sherman started training race horses in 1979.[1] Prior to 2014, Sherman had 10 graded stakes winners,[9] four of whom, trained in conjunction with his son Alan, were Grade 1 stakes winners.[6] These included Lykatill Hill, who won back-to-back Governor's Handicaps at the California State Fair in 1996 and 1997,[4] 2011 Clement L. Hirsch Stakes winner Ultra Blend, Haimish Hy, winner of the 2010 Hollywood Derby, 2007 Citation Handicap winner Lang Field, and Siren Lure, winner of the 2006 Triple Bend Invitational Handicap.[9] For many years, he trained 50 horses at a time, but downsized to about 17 in the 2010s.[5] As of 2014[update], his stable is located at Los Alamitos Race Course in Orange County, California.[4] Sherman's horses have started more than 12,000 races, with more than 2,100 wins and $38 million of prize money.[1] He has stated that no horse can be trained precisely the same way as another, and credits his background as a jockey in helping him train: \"I've been around and I've rode so many horses, and I think because of that it's helped me tremendously.\"[6]",
				"after": "California Chrome owners Perry Martin and Steve Coburn chose Sherman to train their horse because \"he's old school. He's a regular guy ... He can spend quality time with every horse.\"[4] In December 2013, California Chrome won the King Glorious Stakes, the final stakes race at Hollywood Park Racetrack, the same track Sherman had his first win as a jockey.[5] Sherman subsequently led the horse to a four-race winning streak heading into the 2014 Kentucky Derby, including a decisive win in the Grade I Santa Anita Derby. That record made California Chrome the pre-race favorite in the 2014 Kentucky Derby, but there were still many doubters due to the horse's modest pedigree and Sherman's inexperience at the sport's highest stage.[6] For Sherman, it was his first horse as trainer in the Derby.[4]",
			"color": "black|0.38517 dim|0.084773 gray|0.084773 dim|0.084773 grey|0.084773 gray|0.066121 grey|0.066121 sienna|0.0377 golden|0.035423 rod|0.035423 dark|0.033296 salmon|0.033296 tan|0.028138 gold|0.02699 dark|0.02635 golden|0.02635 rod|0.02635 saddle|0.023659 brown|0.023659 dark|0.011306 gray|0.011306 dark|0.011306 grey|0.011306 olive|0.0099002 silver|0.0089152 burly|0.0082276 wood|0.0082276 light|0.0081686 salmon|0.0081686  "
		}
	}
}
