{
	"add": {
		"doc": {
			"id": "94f7cff15a23b517abfcf7f8cf9dfb469b0051e4bc555873c4d4416d55e2a9b0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Scout_mem_jamb_1979_1980_perry_lakes_gnangarra.jpg/220px-Scout_mem_jamb_1979_1980_perry_lakes_gnangarra.jpg",
				"previous": "Camping is most often arranged at the unit level, such as one Scout troop, but there are periodic camps (known in the US as \"camporees\") and \"jamborees\". Camps occur a few times a year and may involve several groups from a local area or region camping together for a weekend. The events usually have a theme, such as pioneering. World Scout Moots are gatherings, originally for Rover Scouts, but mainly focused on Scout Leaders. Jamborees are large national or international events held every four years, during which thousands of Scouts camp together for one or two weeks. Activities at these events will include games, scoutcraft competitions, badge, pin or patch trading, aquatics, woodcarving, archery and activities related to the theme of the event.[60]",
				"after": "In some countries a highlight of the year for Scouts is spending at least a week in the summer engaging in an outdoor activity. This can be a camping, hiking, sailing, or other trip with the unit, or a summer camp with broader participation (at the council, state, or provincial level). Scouts attending a summer camp work on merit badges, advancement, and perfecting scoutcraft skills. Summer camps can operate specialty programs for older Scouts, such as sailing, backpacking, canoeing and whitewater, caving, and fishing.[61][62]",
			"color": "black|0.38097 dim|0.11044 gray|0.11044 dim|0.11044 grey|0.11044 dark|0.079756 gray|0.079756 dark|0.079756 grey|0.079756 gray|0.076611 grey|0.076611 silver|0.061801 light|0.045743 gray|0.045743 light|0.045743 grey|0.045743 gainsboro|0.034683 linen|0.02132 misty|0.020109 rose|0.020109 sea|0.019395 shell|0.019395 white|0.017144 smoke|0.017144 lavender|0.015581 blush|0.015581 floral|0.015146 white|0.015146 snow|0.015079 antique|0.013004 white|0.013004 old|0.011518 lace|0.011518 white|0.011078 ghost|0.0096786 white|0.0096786 mint|0.0074665 cream|0.0074665 alice|0.0061831 blue|0.0061831  "
		}
	}
}
