{
	"add": {
		"doc": {
			"id": "94f8991f3f6f07cdae4cbca85c4a170c5d8765a0e21cd69cc57a07fac8375f0d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Bobcat-Texas-9110.jpg/220px-Bobcat-Texas-9110.jpg",
				"previous": "The bobcat prey base overlaps with that of other midsized predators of a similar ecological niche. Research in Maine has shown little evidence of competitive relationships between the bobcat and coyote or red fox; separation distances and territory overlap appeared random among simultaneously monitored animals.[43] However, other studies have found bobcat populations may decrease in areas with high coyote populations, with the more social inclination of the canid giving them a possible competitive advantage.[44] With the Canadian lynx, however, the interspecific relationship affects distribution patterns; competitive exclusion by the bobcat is likely to have prevented any further southward expansion of the range of its felid relative.[6]",
			"after": [
				"Bobcats typically live to six or eight years of age, with a few reaching beyond ten. The longest they have been known to live is 16 years in the wild and 32 years in captivity.[34]",
				"They generally begin breeding by their second summer, though females may start as early as their first year. Sperm production begins each year by September or October, and the male will be fertile into the summer. A dominant male will travel with a female and mate with her several times, generally from winter until early spring; this varies by location, but most mating takes place during February and March. The pair may undertake a number of different behaviors, including bumping, chasing, and ambushing. Other males may be in attendance, but remain uninvolved. Once the male recognizes the female is receptive, he grasps her in the typical felid neck grip and mates with her. The female may later go on to mate with other males,[28] and males will generally mate with several females.[45] During courtship, the otherwise silent bobcat may let out loud screams, hisses, or other sounds.[46] Research in Texas has suggested establishing a home range is necessary for breeding; studied animals with no set range had no identified offspring.[30] The female has an estrous cycle of 44 days, with the estrus lasting five to ten days. Bobcats remain reproductively active throughout their lives.[14][45]"
			],
			"color": "dim|0.39516 gray|0.39516 dim|0.39516 grey|0.39516 gray|0.26764 grey|0.26764 black|0.14351 dark|0.072093 gray|0.072093 dark|0.072093 grey|0.072093 dark|0.070003 olive|0.070003 green|0.070003  "
		}
	}
}
