{
	"add": {
		"doc": {
			"id": "94f8bc19f4b71bb976e8c972e5a0145a0e49bb8c5df00f716505908fd2cfaee5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Scottish_parliament_elevation.JPG/220px-Scottish_parliament_elevation.JPG",
			"previous": [],
				"after": "References to Scottish culture are also reflected in the building and particularly on some of the building's elevations. There are a series of \"trigger panels\", constructed out of timber or granite. Not to everyone's taste,[34] these have been said to represent anvils, hairdryers, guns, question marks or even the hammer and sickle. Shortly after the official opening of the building, Enric Miralles' widow, Benedetta Tagliabue, revealed that the design is simply that of a window curtain pulled back.[35] Her late husband however, enjoying the use of ambiguous forms with multiple meanings, had previously said he would love the profile to evoke an icon of Scottish culture, the painting of Reverend Walker skating on ice.[28] The architectural critic Charles Jencks finds this a particularly apt metaphor for balanced movement and democratic debate and also notes the irony that Miralles too was skating on ice with his designs for the building.[13] Elsewhere, in the public area beneath the debating chamber, the curved concrete vaults carry various stylised Saltires. Here the architect intends another metaphor; by setting the debating chamber directly above the public area, he seeks to remind MSPs whilst sitting in the chamber that their power derives from the people below them.[7]",
			"color": "dark|0.23229 gray|0.23229 dark|0.23229 grey|0.23229 black|0.1705 dim|0.12644 gray|0.12644 dim|0.12644 grey|0.12644 silver|0.11252 gray|0.085923 grey|0.085923 light|0.042054 steel|0.042054 blue|0.042054 dark|0.039531 slate|0.039531 gray|0.039531 light|0.036018 gray|0.036018 light|0.036018 grey|0.036018 light|0.031438 slate|0.031438 gray|0.031438 gainsboro|0.027347 slate|0.024646 gray|0.024646 light|0.013942 blue|0.013942 white|0.0083016 smoke|0.0083016 alice|0.0061604 blue|0.0061604 ghost|0.0057109 white|0.0057109 snow|0.0046588 lavender|0.004656  "
		}
	}
}
