{
	"add": {
		"doc": {
			"id": "95022e0ff4065c7957770fdc5573e07593578275fd0300b364882f349592cb32",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/AU-1_Corsairs_VMA-323_over_Korea.jpg/220px-AU-1_Corsairs_VMA-323_over_Korea.jpg",
				"previous": "Command of A Company was temporarily handed over to the second-in-command, Captain Bob Murdoch. Present at Pakchon in November 1950, O'Dowd understood first-hand the dangers of withdrawing while in contact. The challenge was to protect the forward platoons as they withdrew from being followed up by the Chinese occupying the old B Company positions and from D Company's position after they broke contact. The Australians would also have to clear the withdrawal route of any blocking forces, while at the same time the evacuation of a large number of wounded and Chinese prisoners would hamper their movement.[86] As such the timing of the withdrawal would be critical to its success. Consequently, the lead company would not move until mid-afternoon so that the rearguard would be able to use the protection of darkness to break contact, while at the same time offering good observation and fields of fire during the daylight to support the initial moves.[74][86] Orders were delivered at 14:30. B Company would lead the withdrawal down the ridge line, carrying any wounded that still required evacuation, as well as clearing the route and securing the ford near the Middlesex position. C Company would wait for the artillery to neutralise the Chinese on the old B Company position, before moving to establish a blocking position behind D Company. A Company would then withdraw to a blocking position behind C Company, in order to allow Gravener and Saunders to establish a clean break. Finally, D Company would withdraw through both C and A Company and set up a blocking position to delay any follow up and allow those companies to withdraw.[87]",
				"after": "After 15:00 an airstrike was called in to dislodge the surviving Chinese in front of D Company. However, the attack by two US Marine Corps F4U Corsairs was mistakenly directed at the Australians themselves after their positions were wrongly marked by the spotter plane. Two men were killed and several badly burnt by napalm before the attack was broken off after the company second-in-command—Captain Michael Ryan—ran out under Chinese fire waving a marker panel.[65] The company medical orderly—Private Ronald Dunque—was subsequently awarded the Military Medal for his efforts assisting the wounded despite his own injuries.[52][88] The Chinese quickly attempted to exploit the chaos, moving against D Company's long exposed eastern flank. 11 Platoon on the main ridge forward of the summit was subjected to a frontal assault; however, unaffected by the napalm they broke up the Chinese attack and inflicted heavy casualties on them. Regardless, further Chinese attempts to infiltrate the Australian positions continued into the afternoon.[89][note 5]",
			"color": " "
		}
	}
}
