{
	"add": {
		"doc": {
			"id": "95046f1d228688dcae216dd1b45e3fac842fdad053eea98bd7d4939e26242c31",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Haikouichthys4.png/200px-Haikouichthys4.png",
				"previous": "This contributed to a rapid increase in knowledge about the history of life on Earth and to progress in the definition of the geologic time scale, largely based on fossil evidence. In 1822 Henri Marie Ducrotay de Blanville, editor of Journal de Phisique, coined the word \"palaeontology\" to refer to the study of ancient living organisms through fossils.[100] As knowledge of life's history continued to improve, it became increasingly obvious that there had been some kind of successive order to the development of life. This encouraged early evolutionary theories on the transmutation of species.[101] After Charles Darwin published Origin of Species in 1859, much of the focus of paleontology shifted to understanding evolutionary paths, including human evolution, and evolutionary theory.[101]",
				"after": "The last half of the 19th century saw a tremendous expansion in paleontological activity, especially in North America.[103] The trend continued in the 20th century with additional regions of the Earth being opened to systematic fossil collection. Fossils found in China near the end of the 20th century have been particularly important as they have provided new information about the earliest evolution of animals, early fish, dinosaurs and the evolution of birds.[104] The last few decades of the 20th century saw a renewed interest in mass extinctions and their role in the evolution of life on Earth.[105] There was also a renewed interest in the Cambrian explosion that apparently saw the development of the body plans of most animal phyla. The discovery of fossils of the Ediacaran biota and developments in paleobiology extended knowledge about the history of life back far before the Cambrian.[60]",
			"color": "medium|0.89095 sea|0.89095 green|0.89095 medium|0.05402 aqua|0.05402 marine|0.05402 sea|0.049099 green|0.049099 dark|0.0044947 gray|0.0044947 dark|0.0044947 grey|0.0044947  "
		}
	}
}
