{
	"add": {
		"doc": {
			"id": "9505d54ae8b39af294549fce0bdb7304e5724b0f4ebfc1ef897e9faac866034d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Radiocarbon_bomb_spike.svg/300px-Radiocarbon_bomb_spike.svg.png",
				"previous": "In the early years of using the technique, it was understood that it depended on the atmospheric 14 C/12 C ratio having remained the same over the preceding few thousand years. To verify the accuracy of the method, several artefacts that were datable by other techniques were tested; the results of the testing were in reasonable agreement with the true ages of the objects. Over time, however, discrepancies began to appear between the known chronology for the oldest Egyptian dynasties and the radiocarbon dates of Egyptian artefacts. Neither the pre-existing Egyptian chronology nor the new radiocarbon dating method could be assumed to be accurate, but a third possibility was that the 14 C/12 C ratio had changed over time. The question was resolved by the study of tree rings:[24][25][26] comparison of overlapping series of tree rings allowed the construction of a continuous sequence of tree-ring data that spanned 8,000 years.[24] (Since that time the tree-ring data series has been extended to 13,900 years.)[27] In the 1960s, Hans Suess was able to use the tree-ring sequence to show that the dates derived from radiocarbon were consistent with the dates assigned by Egyptologists. This was possible because although annual plants, such as corn, have a 14 C/12 C ratio that reflects the atmospheric ratio at the time they were growing, trees only add material to their outermost tree ring in any given year, while the inner tree rings don't get their 14 C replenished and instead start losing 14 C through decay. Hence each ring preserves a record of the atmospheric 14 C/12 C ratio of the year it grew in. Carbon-dating the wood from the tree rings themselves provides the check needed on the atmospheric 14 C/12 C ratio: with a sample of known date, and a measurement of the value of N (the number of atoms of 14 C remaining in the sample), the carbon-dating equation allows the calculation of N0 – the number of atoms of 14 C in the sample at the time the tree ring was formed – and hence the 14 C/12 C ratio in the atmosphere at that time.[24][26] Armed with the results of carbon-dating the tree rings, it became possible to construct calibration curves designed to correct the errors caused by the variation over time in the 14 C/12 C ratio.[28] These curves are described in more detail below.",
				"after": "Coal and oil began to be burned in large quantities during the 19th century. Both are sufficiently old that they contain little detectable 14 C and, as a result, the CO 2 released substantially diluted the atmospheric 14 C/12 C ratio. Dating an object from the early 20th century hence gives an apparent date older than the true date. For the same reason, 14 C concentrations in the neighbourhood of large cities are lower than the atmospheric average. This fossil fuel effect (also known as the Suess effect, after Hans Suess, who first reported it in 1955) would only amount to a reduction of 0.2% in 14 C activity if the additional carbon from fossil fuels were distributed throughout the carbon exchange reservoir, but because of the long delay in mixing with the deep ocean, the actual effect is a 3% reduction.[24][31]",
			"color": "white|0.093646 smoke|0.093646 snow|0.090201 ghost|0.089823 white|0.089823 white|0.089542 alice|0.089398 blue|0.089398 sea|0.089216 shell|0.089216 mint|0.08807 cream|0.08807 floral|0.085185 white|0.085185 azure|0.084844 lavender|0.083815 blush|0.083815 light|0.025663 gray|0.025663 light|0.025663 grey|0.025663 gainsboro|0.023246 silver|0.020029 dark|0.008804 gray|0.008804 dark|0.008804 grey|0.008804 ivory|0.0067903 linen|0.0057305 medium|0.0041319 slate|0.0041319 blue|0.0041319 thistle|0.002539  "
		}
	}
}
