{
	"add": {
		"doc": {
			"id": "950a53910b76e76b4d86073173c25e5a3c57ba7d51c1056ca18d35241bc2372a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Let_vrtulnikem11_-_hrad_Srebrenik_%2813.-18._stol.%29_jeste_lepe.jpg/220px-Let_vrtulnikem11_-_hrad_Srebrenik_%2813.-18._stol.%29_jeste_lepe.jpg",
				"previous": "The positioning of castles was influenced by the available terrain. Whereas hill castles such as Marksburg were common in Germany, where 66 per cent of all known medieval were highland area while 34 per cent were on low-lying land,[153] they formed a minority of sites in England.[152] Because of the range of functions they had to fulfil, castles were built in a variety of locations. Multiple factors were considered when choosing a site, balancing between the need for a defendable position with other considerations such as proximity to resources. For instance many castles are located near Roman roads, which remained important transport routes in the Middle Ages, or could lead to the alteration or creation of new road systems in the area. Where available it was common to exploit pre-existing defences such as building with a Roman fort or the ramparts of an Iron Age hillfort. A prominent site that overlooked the surrounding area and offered some natural defences may also have been chosen because its visibility made it a symbol of power.[154] Urban castles were particularly important in controlling centres of population and production, especially with an invading force, for instance in the aftermath of the Norman Conquest of England in the 11th century the majority of royal castles were built in or near towns.[155]",
				"after": "As castles were not simply military buildings but centres of administration and symbols of power, they had a significant impact on the surrounding landscape. Placed by a frequently-used road or river, the toll castle ensured that a lord would get his due toll money from merchants. Rural castles were often associated with mills and field systems due to their role in managing the lord's estate,[156] which gave them greater influence over resources.[157] Others were adjacent to or in royal forests or deer parks and were important in their upkeep. Fish ponds were a luxury of the lordly elite, and many were found next to castles. Not only were they practical in that they ensured a water supply and fresh fish, but they were a status symbol as they were expensive to build and maintain.[158]",
			"color": "dim|0.18817 gray|0.18817 dim|0.18817 grey|0.18817 slate|0.18318 gray|0.18318 light|0.14802 slate|0.14802 gray|0.14802 dark|0.14321 gray|0.14321 dark|0.14321 grey|0.14321 gray|0.14153 grey|0.14153 silver|0.058652 light|0.023525 gray|0.023525 light|0.023525 grey|0.023525 gainsboro|0.013212 dark|0.012523 slate|0.012523 gray|0.012523 light|0.011598 steel|0.011598 blue|0.011598 thistle|0.0059022 lavender|0.0057485 tan|0.0053479  "
		}
	}
}
