{
	"add": {
		"doc": {
			"id": "9510720f1873ddfd4e8ee347bb4d9c1b90e21c5f715fe004d27aa14a2b3148c6",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/6/6a/Ozone_cracks_in_tube1.jpg/200px-Ozone_cracks_in_tube1.jpg",
				"previous": "In a finished product, such a change is to be prevented or delayed. Failure of safety-critical polymer components can cause serious accidents, such as fire in the case of cracked and degraded polymer fuel lines. Chlorine-induced cracking of acetal resin plumbing joints and polybutylene pipes has caused many serious floods in domestic properties, especially in the USA in the 1990s. Traces of chlorine in the water supply attacked vulnerable polymers in the plastic plumbing, a problem which occurs faster if any of the parts have been poorly extruded or injection molded. Attack of the acetal joint occurred because of faulty molding, leading to cracking along the threads of the fitting which is a serious stress concentration.",
				"after": "Polymer oxidation has caused accidents involving medical devices. One of the oldest known failure modes is ozone cracking caused by chain scission when ozone gas attacks susceptible elastomers, such as natural rubber and nitrile rubber. They possess double bonds in their repeat units which are cleaved during ozonolysis. Cracks in fuel lines can penetrate the bore of the tube and cause fuel leakage. If cracking occurs in the engine compartment, electric sparks can ignite the gasoline and can cause a serious fire.",
			"color": "gray|0.26442 grey|0.26442 dark|0.2317 gray|0.2317 dark|0.2317 grey|0.2317 silver|0.10333 dim|0.084749 gray|0.084749 dim|0.084749 grey|0.084749 light|0.054563 gray|0.054563 light|0.054563 grey|0.054563 gainsboro|0.041355 white|0.027554 smoke|0.027554 alice|0.022449 blue|0.022449 ghost|0.022291 white|0.022291 sea|0.022046 shell|0.022046 snow|0.021852 lavender|0.021242 blush|0.021242 white|0.020632 mint|0.019276 cream|0.019276 floral|0.017634 white|0.017634 azure|0.016628 linen|0.0070679  "
		}
	}
}
