{
	"add": {
		"doc": {
			"id": "951313a541676f52d872bdcce354b0b63f38ec77a2b5bd168ec3da542d587c84",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/The_Battle_Cry_of_Peace.jpg/350px-The_Battle_Cry_of_Peace.jpg",
				"previous": "By 1915, Americans were paying much more attention to the war. The sinking of the Lusitania had a strong effect on public opinion because of the deaths of American civilians. That year, a strong \"Preparedness\" movement emerged.[63] Proponents argued that the United States needed to immediately build up strong naval and land forces for defensive purposes; an unspoken assumption was that America would fight sooner or later. General Leonard Wood (still on active duty after serving a term as Chief of Staff of the Army), former president Theodore Roosevelt, and former secretaries of war Elihu Root and Henry Stimson were the driving forces behind Preparedness, along with many of the nation's most prominent bankers, industrialists, lawyers and scions of prominent families. Indeed there emerged an \"Atlanticist\" foreign policy establishment, a group of influential Americans drawn primarily from upper-class lawyers, bankers, academics, and politicians of the Northeast, committed to a strand of Anglophile internationalism. Representative was Paul D. Cravath, one of New York's foremost corporation lawyers. For Cravath, in his mid-fifties when the war began, the conflict served as an epiphany, sparking an interest in international affairs that dominated his remaining career. Fiercely Anglophile, he strongly supported American intervention in the war and hoped that close Anglo-American cooperation would be the guiding principle of postwar international organization.[64]",
				"after": "The Preparedness movement had a \"realistic\" philosophy of world affairs—they believed that economic strength and military muscle were more decisive than idealistic crusades focused on causes like democracy and national self-determination. Emphasizing over and over the weak state of national defenses, they showed that America's 100,000-man Army even augmented by the 112,000 National Guardsmen, was outnumbered 20 to one by Germany's army, which was drawn from a smaller population. Reform to them meant UMT or \"universal military training\". They proposed a national service program under which the 600,000 men who turned 18 every year would be required to spend six months in military training, and afterwards be assigned to reserve units. The small regular army would primarily be a training agency.",
			"color": "wheat|0.24403 moccasin|0.21035 navajo|0.20984 white|0.20984 tan|0.11302 black|0.078054 pale|0.053287 golden|0.053287 rod|0.053287 bisque|0.034879 peach|0.023644 puff|0.023644 burly|0.016514 wood|0.016514 blanched|0.0064876 almond|0.0064876 lemon|0.0055375 chiffon|0.0055375  "
		}
	}
}
