{
	"add": {
		"doc": {
			"id": "95147874fcd4a3f99017c7193a3847510bc7ff145856285e798dc47098eab299",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/United_Arab_Airlines_Ilyushin_Il-62_Hanuise.jpg/220px-United_Arab_Airlines_Ilyushin_Il-62_Hanuise.jpg",
				"previous": "A sideline to the Il-62 story concerns alleged industrial espionage. As the Il-62 was developed at about the same time as the VC10, to which it bears a marked external resemblance, British Cold War commentators implied that the VC10 design may have been copied by dubbing the Il-62 the \"VC10-ski.\" (Thiel, 2001). No evidence of this was ever presented and, as noted above, later model VC10s adopted some of the Il-62 wing design features (Il-62-type landing-gear was also used by several leading aircraft manufacturers). There are significant differences between the Il-62 and the VC10, as the Russian type is larger, lifts a greater load, covers a longer range, and is suited only to developed airports vis-a-vis the British type's adaptability to \"up-country\" bases. Unlike the VC10, the Il-62 uses conservative technology, such as mechanical control surface linkages, and is an entirely civil machine, whereas the VC10 was designed to double as an airlifter as well as a military freighter. The Il-62 found more buyers and was built in larger numbers than the VC10 (292 vs 54), and was still in civilian service (as at 2013) whereas the VC10 has long been retired from that role (in 1966 BOAC described the aircraft as uneconomic and asked for government subsidies to continue its operation. At the end of its civilian career some VC10s were used by Britain's Royal Air Force in support roles). China and Czechoslovakia were two countries that considered buying the VC10 (for CAAC and Czechoslovak Airlines, respectively), before opting for the Il-62 (see VC10: Sales and airline service).",
				"after": "After the introduction of the Il-62M, Aeroflot (the largest operator of the plane) gradually upgraded and later replaced its fleet of NK-8 powered Il-62s with the newer Soloviev D-30 KU-powered Il-62M. Coupled with engine nacelle and other modifications, greatly reduced the chance of contiguous powerplant damage. By mid 1973, the airline was operating some 60 Il-62s, and by 1989 this had increased to 165 (Il-62 and Il-62M) (Thiel, 2001). The Il-62M had a dispatch rate with Aeroflot of 97% with some examples logging as many as 17 flight hrs/day, and it was described as the most reliable type in the fleet at that time (Gordon et al., 2004). It set several international records in its class, mostly exemplifying a range capability far in excess of the conservative Aeroflot calculations applied in Soviet times. Some of these records were set by an all-woman crew of five captained by Iraida (\"Inna\") Vertiprahova. With 10 tonnes of freight, the Il-62M had a maximum range of 10,300 km compared to 9,412 km for the VC10 carrying the same weight. With a 23 tonne payload, the Il-62M range was 8000 km, compared to 6,920 km for a Boeing 707 with maximum payload. Because of its capacity, the plane has historically been used for emergency evacuation flights, one of the most notable being the landing of an Aeroflot-registered Il-62 at Santiago Airport, Chile on the night of 10 Sep 1973 (the day before the military coup by Augusto Pinochet) in order to evacuate 147 Cuban embassy personnel. More recently (April 2015) two EMERCOM IL-62Ms (including RA-86495 of the Russian Federation Air Force) were used to evacuate many hundreds of foreign nationals and Yemenis from Sanaa during the Saudi-led military operation against Yemen.",
			"color": "gray|0.23527 grey|0.23527 dim|0.22344 gray|0.22344 dim|0.22344 grey|0.22344 black|0.080175 dark|0.077877 gray|0.077877 dark|0.077877 grey|0.077877 light|0.057957 gray|0.057957 light|0.057957 grey|0.057957 silver|0.053661 gainsboro|0.049649 white|0.020702 smoke|0.020702 linen|0.016703 sea|0.015618 shell|0.015618 mint|0.014456 cream|0.014456 floral|0.014239 white|0.014239 snow|0.013686 dark|0.013244 slate|0.013244 gray|0.013244 white|0.011918 slate|0.010928 gray|0.010928 azure|0.010842 light|0.010598 slate|0.010598 gray|0.010598 ghost|0.010222 white|0.010222 alice|0.010222 blue|0.010222 old|0.0087776 lace|0.0087776 ivory|0.0079593 antique|0.0046106 white|0.0046106 light|0.004218 steel|0.004218 blue|0.004218 honeydew|0.0041417 lavender|0.0039342 blush|0.0039342  "
		}
	}
}
