{
	"add": {
		"doc": {
			"id": "9523cf1eaea3266e44691dbaa2ee25f7b4cd8798abd38ae4cbcc01b21158d4fa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/TAAG_Angola_Airlines_L-1011-500_CS-TEC_FAO_1995.png/220px-TAAG_Angola_Airlines_L-1011-500_CS-TEC_FAO_1995.png",
				"previous": "By March 1980 (1980-03), the carrier had a fleet of three Boeing 707-320Cs, three Boeing 737-200Cs, six Fokker F27s —four -600s and two -200s—, three L-100s —two -20s and one -30— and four Yakovlev Yak-40s to serve a number of domestic destinations, plus Brazzaville, São Tome, Lagos, Maputo, Lisbon, Moscow, Paris and Rome.[24] The company was reorganised again during the year. On 8 June, a Yak-40 registration D2-TYC crashed near Matala killing all 19 occupants on board. On 16 May 1981, the crew of four on board a Lockheed L-100-20 Hercules, registration D2-EAS, lost their lives in an accident at Mongua. During the early 1980s the fleet also included a small number of Antonov An-26s that started being phased out. One of these examples (D2-TAB) was involved in an accident at Monte Bibala on 29 November 1982; 15 people lost their lives. Another fatal accident took place almost a year later, on 8 November 1983, when the crash of a Boeing 737-200 (D2-TBN) at Lubango resulted in 130 fatalities. Serious financial difficulties were uncovered during 1984. In the mid-1980s, an L-100 Hercules was withdrawn from service and two Ilyushin Il-62Ms were acquired for operations to Cuba.[15] The carrier phased in the first of these two aircraft in 1988.[25] On 21 July 1988, a Boeing 707 freighter owned by the airline crashed 20 kilometres (12 mi) away from Murtala Muhammed International Airport; six crewmembers lost their lives in the accident.[26]",
				"after": "At March 1990 (1990-03), TAAG Angola Airlines had TAAG-Air Charter and TAAG Aviacao Ligeira as associated companies; the number of employees was 5,770. At this time, the fleet consisted of six Boeing 707-320s (one -320B and five -320Cs), four Boeing 737-200s, one Boeing 737-200C, one Lockheed L100-200, six Fokker F.27s (one -100, one -400M, one -500 and three -600s) and two Yakovlev Yak-40s. The carrier‍‍ '​‍s network comprised 18 domestic points in Angola served from Luanda plus international flights to Berlin-Schonefeld, Brazaville, Havana, Kinshasa, Lisbon, Lusaka, Maputo, Moscow, Paris, Rio de Janeiro, Rome, Sal and Sao Tome.[27] TAAG bought a Boeing 747-300 Combi from Singapore Airlines in 1997.[28]",
			"color": "steel|0.078735 blue|0.078735 light|0.069813 blue|0.069813 dim|0.064836 gray|0.064836 dim|0.064836 grey|0.064836 gainsboro|0.064764 light|0.062602 gray|0.062602 light|0.062602 grey|0.062602 silver|0.047225 white|0.039432 smoke|0.039432 dark|0.03867 slate|0.03867 gray|0.03867 red|0.037276 sky|0.036726 blue|0.036726 alice|0.033782 blue|0.033782 ghost|0.030717 white|0.030717 crimson|0.030599 snow|0.02968 linen|0.027233 sea|0.02576 shell|0.02576 white|0.02461 lavender|0.021955 blush|0.021955 dark|0.020815 gray|0.020815 dark|0.020815 grey|0.020815 gray|0.020784 grey|0.020784 mint|0.020129 cream|0.020129 light|0.019188 steel|0.019188 blue|0.019188 cadet|0.017097 blue|0.017097 powder|0.014578 blue|0.014578 black|0.012548 floral|0.011653 white|0.011653 azure|0.010481 dark|0.01042 orange|0.01042  "
		}
	}
}
