{
	"add": {
		"doc": {
			"id": "952aef5760f10a938a2c8d237e582a466db1c373b2935006e9aa55756d341bed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/General_Aircraft_Hamilcar_2.jpg/220px-General_Aircraft_Hamilcar_2.jpg",
				"previous": "The T9 had a crew of three and weighed 6.7 metric tons (7.4 short tons). It was armed with a 37-millimetre (1.5 in) main gun and a coaxial .30-06 Browning M1919A4 machine-gun, as well as two further machine-guns on the right-hand side of the bow. The main gun and coaxial machine-gun were mounted in a powered turret, which also had a gun stabilizer installed to allow the gun to be fired when the tank was moving.[2] The T9 was powered by a 162 horse-power six-cylinder, air-cooled Lycoming engine, and the thickness of the armour varied; the front, rear and sides of the hull had a thickness of 12.5 millimetres (0.49 in) while the sloped portions of the hull had a thickness of 9.5 millimetres (0.37 in).[2] The tank's engine was able to give it a maximum speed of 40 mph (64 km/h).[3] The T9 was not primarily designed to be transported by glider, a significant change from the original request, but instead was to be carried under the belly of a Douglas C-54 Skymaster transport aircraft, using four lifting brackets welded onto each side of the hull of the tank. The turret was designed to be removable so that it could be detached and transported inside the C-54 and reattached once on the battlefield. The loading took six men about twenty-five minutes, the unloading ten minutes. On top of this the aircraft required a proper airfield on which to land.[13] However, the T9 was of the correct shape, weight and size to be carried inside a Hamilcar glider, suggesting that these dimensions had been chosen deliberately so that the tank could be transported inside a glider if required.[14]",
				"after": "A number of changes were made to the prototype during testing. The main change was the addition of supporting steel beams to improve and strengthen the suspension of the tank, which increased the weight to 7.05 metric tons (7.77 short tons), the maximum weight that could be carried by a Hamilcar glider.[1] Two new prototypes were ordered by the Ordnance Department in January 1942 and were delivered by Marmon-Herrington in November 1942. They were both designated T9E1. The new tanks incorporated a number of requested changes. The turret was altered in shape; it was lightened by the removal of the power traverse mechanism and the gyro stabilizer for the main armament.[3] The front of the hull was altered from a stepped appearance to a more sloped profile, which would provide for a better ballistic shape; the two .30-06 machine-guns were removed from the bow of the tank and the suspension was altered to try and reduce the weight of the design.[1] However, contrary to normal practice, the Ordnance Department had placed an order for the original T9 design in April 1942, before the T9E1 models were delivered in November 1942; 500 were ordered in April and this order rapidly increased to a total of 1900, with deliveries to begin in November. However, production difficulties and design changes caused this date to be delayed several times, and it was not until April 1943 that production on the T9 actually began.[1]",
			"color": " "
		}
	}
}
