{
	"add": {
		"doc": {
			"id": "952ed0b4f775835741fa25ec46325fc7ca9e05261953096f7b1988635ad2fcfa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/RNZAFTransantarcticDHCBeaver.jpg/220px-RNZAFTransantarcticDHCBeaver.jpg",
				"previous": "At one point in its production, plans to license and build the type in New Zealand were proposed. The remaining tooling was purchased by Viking Air of Victoria, Canada, which manufactures replacement parts for most of the early de Havilland line. On 24 February 2006, Viking purchased the type certificates from Bombardier Aerospace for all the original de Havilland designs.[3] The ownership of the certificates gives Viking the exclusive right to manufacture new Beavers. Viking now sells a remanufactured and rebuilt DHC-2T Turbo Beaver upgraded with a Pratt & Whitney Canada PT6A-34 680 hp (507 kW) turboprop engine. With a maximum gross takeoff weight increased to 6,000 lb (2,700 kg) it can carry 2,450 lb (1,110 kg) of freight.[4] However, Viking Turbo Beavers are only rebuilt from existing air frames, and are not new-builds, unlike Viking's own DHC-6 Series 400 Twin Otter, which is manufactured from a completely new airframe.",
				"after": "Despite the fact that production ceased in 1967, hundreds of Beavers are still flying—many of them heavily modified to adapt to changes in technology and needs. Kenmore Air of Kenmore, Washington provides Beaver and Otter airframes with zero-hour fatigue-life ratings, and owns dozens of supplemental type certificates (STCs) for aircraft modifications. These modifications are so well known and desirable in the aviation community, rebuilt Beavers are often called \"Kenmore Beavers\" or listed as having \"Kenmore mods\" installed.[5]",
			"color": "dim|0.12542 gray|0.12542 dim|0.12542 grey|0.12542 gray|0.081701 grey|0.081701 corn|0.081644 flower|0.081644 blue|0.081644 tan|0.081558 sienna|0.07504 black|0.061444 slate|0.052695 gray|0.052695 burly|0.049738 wood|0.049738 light|0.038408 slate|0.038408 gray|0.038408 saddle|0.032043 brown|0.032043 dodger|0.028763 blue|0.028763 wheat|0.020166 dark|0.018386 gray|0.018386 dark|0.018386 grey|0.018386 sandy|0.016898 brown|0.016898 navajo|0.016469 white|0.016469 peach|0.012718 puff|0.012718 moccasin|0.012647 coral|0.010658 peru|0.01043 bisque|0.01042  "
		}
	}
}
