{
	"add": {
		"doc": {
			"id": "95355700a27f061afaf666699e044bb2a1e0e7eba9ea85e87278d46bc5d4a48c",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/4/44/Bedtimestory-birth_of_doves.jpg/230px-Bedtimestory-birth_of_doves.jpg",
			"previous": [],
				"after": "The video starts off with a blue monitor screen with an eye showing the inscription \"Welcome\".[41] The video progresses inside a blue space ship-style room with Madonna lying prostrate in what seems to be a scientific experiment. The imagery cast in this section of the video have drawn comparisons to hermeticism.[41] The video progresses into a sequence of dreams, containing varied surrealistic, mystic, new age, Sufi and Egyptian imagery and symbolism. Such include a scene in which Madonna lies on a rotating sunflower, and images of a woman with long hair, an alchemist-type man holding a cube with Madonna's face on each side as well as rotating Sufi dancers. Some scenes were inspired by the 1969 Armenian film The Color of Pomegranates.[42] The dream sequence progresses with surreal and unusual clips, including Madonna in a pool with half-shown skulls. A scene in which Madonna, dressed in a light dressing gown, gives birth to doves, can also be seen; the image has been compared to the work of René Magritte and Frida Kahlo's 1932 painting My Birth.[40] Suddenly, she floats down a corridor in a white gown, until she appears in a black-and-white projection in a cinema-like room. As the music gets more dramatic, the dream grows intense, with images of skulls and scars appearing, and the singer can be seen wading through space. A scene in which Madonna's eyes are replaced with her mouth and her mouth with an eye precedes the ending, influenced by the work of Frida Kahlo, in which she wakes up and looks out.",
			"color": "black|0.53079 wheat|0.03545 peach|0.034256 puff|0.034256 navajo|0.032662 white|0.032662 moccasin|0.03208 bisque|0.026259 tan|0.023777 misty|0.022996 rose|0.022996 pale|0.021485 golden|0.021485 rod|0.021485 sandy|0.017855 brown|0.017855 blanched|0.016849 almond|0.016849 lemon|0.015285 chiffon|0.015285 antique|0.014174 white|0.014174 saddle|0.012153 brown|0.012153 silver|0.011883 papaya|0.010821 whip|0.010821 dark|0.010659 gray|0.010659 dark|0.010659 grey|0.010659 rosy|0.0099684 brown|0.0099684 burly|0.0090023 wood|0.0090023 dim|0.0085258 gray|0.0085258 dim|0.0085258 grey|0.0085258 peru|0.0080814 light|0.0077554 gray|0.0077554 light|0.0077554 grey|0.0077554 gray|0.0074387 grey|0.0074387 linen|0.0061653 dark|0.0055072 salmon|0.0055072 corn|0.0054853 silk|0.0054853 light|0.0053151 golden|0.0053151 rod|0.0053151 yellow|0.0053151 old|0.0050798 lace|0.0050798 gainsboro|0.0048687 sienna|0.0043996  "
		}
	}
}
