{
	"add": {
		"doc": {
			"id": "953e4ab494a976ee64f825f3cce12636e55f4b042662f1f7d88f8abfdd99c347",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/White_Park.jpg/220px-White_Park.jpg",
				"previous": "The preservation of various pure breeds and strains, including some that are rare today, was once undertaken in North America in large part by large agriculture-focused colleges and universities. However, many of these institutions have changed their focus to commercial or crossbred strains, with many herds being sent to slaughter. The Livestock Conservancy and Rare Breeds Canada intervened in some of these cases, leading to the survival and preservation of some gene stocks. The United States Department of Agriculture (USDA) participates in livestock preservation mainly through technology-based approaches such as gene mapping and germplasm (genetic material) storage. However, although the storage of genetic material is a useful technique in the preservation of rare breeds, it cannot preserve the entire range of genetic diversity within even an individual breed, and stored material cannot react and adapt to environmental or biological changes as live animal populations can. The US federal government rarely supports rare breed live animal population conservation, and while agricultural subsidies were once seen more than they are in present times, they were never focused on individual breeds. The Livestock Conservancy has been instrumental in preserving live populations of many rare livestock breeds in the US.[22]",
				"after": "In the 1980s, the Conservancy began a gene bank designed to preserve the genetic material of rare breeds. After collecting genetic material from over a dozen rare breeds, the bank was transferred to the USDA National Animal Germplasm Program (NAGP). It maintains a close relationship with the NAGP, including assisting in the collection of genetic material from additional rare breeds.[23] The conservation list published by the Conservancy is also used by the SVF Foundation, an organization that uses cryopreservation to preserve germplasm from rare breeds.[24] In the early 1990s, the organization mounted displays of historic rare breed livestock illustrations at the National Agricultural Library and the Carnegie Museum of Natural History, designed to raise public awareness of the declining populations of rare livestock breeds.[25][26]",
			"color": "olive|0.4157 drab|0.4157 light|0.071902 gray|0.071902 light|0.071902 grey|0.071902 dark|0.069336 gray|0.069336 dark|0.069336 grey|0.069336 gainsboro|0.067138 silver|0.058126 gray|0.05388 grey|0.05388 dark|0.049474 olive|0.049474 green|0.049474 white|0.025583 smoke|0.025583 linen|0.021887 dim|0.020655 gray|0.020655 dim|0.020655 grey|0.020655 sea|0.017067 shell|0.017067 snow|0.014434 light|0.014403 slate|0.014403 gray|0.014403 ghost|0.013301 white|0.013301 lavender|0.013185 blush|0.013185 alice|0.013017 blue|0.013017 slate|0.012742 gray|0.012742 white|0.0097306 floral|0.0088359 white|0.0088359 mint|0.0064476 cream|0.0064476  "
		}
	}
}
