{
	"add": {
		"doc": {
			"id": "955396f619c5a3e756a15809303ce5aa4ab99bc9f3cbf19a05e005138345fede",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/NigeriaPrenatalHIV.jpg/350px-NigeriaPrenatalHIV.jpg",
				"previous": "Health care delivery in Nigeria is a concurrent responsibility of the three tiers of government in the country, and the private sector.[168] Nigeria has been reorganizing its health system since the Bamako Initiative of 1987, which formally promoted community-based methods of increasing accessibility of drugs and health care services to the population, in part by implementing user fees.[169] The new strategy dramatically increased accessibility through community-based healthcare reform, resulting in more efficient and equitable provision of services. A comprehensive approach strategy was extended to all areas of health care, with subsequent improvement in the health care indicators and improvement in health care efficiency and cost.[170]",
				"after": "HIV/AIDS rate in Nigeria is much lower compared to the other African nations such as Kenya or South Africa whose prevalence (percentage) rates are in the double digits. As of 2012, the HIV prevalence rate among adults ages 15–49 was just 3.1 percent.[171][172] As of 2014, Life expectancy in Nigeria is 52.62 years on average according to CIA,[173] and just over half the population have access to potable water and appropriate sanitation; As of 2010, the Infant mortality is 8.4 deaths per 1000 live births.[174]",
			"color": "light|0.5874 steel|0.5874 blue|0.5874 dark|0.081256 salmon|0.081256 firebrick|0.035129 dark|0.033433 gray|0.033433 dark|0.033433 grey|0.033433 tan|0.022096 burly|0.021618 wood|0.021618 silver|0.021096 light|0.01989 slate|0.01989 gray|0.01989 light|0.016808 blue|0.016808 slate|0.013807 gray|0.013807 sienna|0.011258 powder|0.009907 blue|0.009907 light|0.0089737 gray|0.0089737 light|0.0089737 grey|0.0089737 dark|0.0086223 olive|0.0086223 green|0.0086223 rosy|0.0056974 brown|0.0056974 dim|0.0056872 gray|0.0056872 dim|0.0056872 grey|0.0056872 gray|0.0054486 grey|0.0054486 lavender|0.0053435 gainsboro|0.0053154 brown|0.0051693 cadet|0.0051134 blue|0.0051134 maroon|0.0050525 dark|0.0050119 red|0.0050119  "
		}
	}
}
