{
	"add": {
		"doc": {
			"id": "9555b62271c882c18891adcef6f25585c9590c2c700bf47a5c2f1d11808c5590",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Vc10.tail.arp.jpg/220px-Vc10.tail.arp.jpg",
				"previous": "Though BOAC had ordered modified Comet 4s, it viewed the type as an intermediate rather than a long term type. In 1956, BOAC ordered 15 Boeing 707s. These were oversized and underpowered for BOAC's medium-range Empire (MRE) African and Asian routes, which involved destinations with \"hot and high\" airports that reduced aircraft performance, notably between Karachi and Singapore, and could not lift a full load from high-altitude airports like Kano or Nairobi. Several companies proposed a suitable replacement. De Havilland offered the DH.118, a development of the Comet 5 project while Handley Page proposed the HP.97, based on their V bomber, the Victor. After carefully considering the routes, Vickers offered the VC10.[7] Crucially, Vickers was the only firm willing to launch its design as a private venture, instead of relying on government financing.[8]",
				"after": "The VC10 was a new design but used some production ideas and techniques, as well as the Conway engines, developed for the V.1000 and VC7. It had a generous wing equipped with wide chord Fowler flaps and full span leading edge slats for good take-off and climb performance, its rear engines gave an efficient clean wing and reduced cabin noise.[9] The engines were also further from the runway surface than an underwing design, an important factor in operations from rough runways such as those common in Africa; wide, low-pressure tyres were also adopted with this same concern in mind.[10] The VC10 was capable of landing and taking off at slower speeds than the rival 707 and its engines could produce considerably more thrust, providing good 'hot and high' performance, and was considered to be a safer aircraft.[11]",
			"color": "gray|0.43025 grey|0.43025 dim|0.31965 gray|0.31965 dim|0.31965 grey|0.31965 dark|0.092092 gray|0.092092 dark|0.092092 grey|0.092092 black|0.042565 silver|0.025602 slate|0.013959 gray|0.013959 light|0.010802 gray|0.010802 light|0.010802 grey|0.010802 light|0.0082039 slate|0.0082039 gray|0.0082039 gainsboro|0.0070987 white|0.0038115 smoke|0.0038115  "
		}
	}
}
