{
	"add": {
		"doc": {
			"id": "95605ceaffe2e488f476b46d0c87fa019467bcd44f96199dce48c04a28472990",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Warwick_Castle%2C_the_east_front_by_Canaletto%2C_1752.JPG/300px-Warwick_Castle%2C_the_east_front_by_Canaletto%2C_1752.JPG",
				"previous": "The siege was lifted on 23 August 1642 when the garrison was relieved by the forces of Robert Devereux, 3rd Earl of Essex, and the Royalists were forced to retreat to Worcester.[1] After the Battle of Edgehill in 1642 – the first pitched battle of the English Civil War – prisoners were held in Caesar's and Guy's Towers.[1] During the Second English Civil War prisoners were again held at the castle, including those from the Battle of Worcester in 1651. A garrison was maintained in the castle complete with artillery and supplies from 1643 to 1660, at its strongest it numbered 302 soldiers. In 1660 the English Council of State ordered the castle governor to disband the garrison and hand over the castle to Robert Greville, 4th Baron Brooke.[1] The state apartments were found to be outmoded and in poor repair. Under Roger and William Hurlbutt, master carpenters of Warwick, extensive modernization of the interiors was undertaken, 1669–78. To ensure that they would be in the latest taste, William was sent down to Dorset to make careful notes of the interiors recently finished at Kingston Lacy for Sir Ralph Bankes to designs by Sir Roger Pratt.[30] On 4 November 1695 the castle was in sufficient state to host a visit by King William III.[1]",
				"after": "Francis Greville, 8th Baron Brooke, undertook a renewed programme of improvements to Warwick Castle and its grounds. The 8th Baron Brooke was also bestowed with the title Earl of Warwick in 1759, the fourth creation of the title. With the recreation of the title, the castle was back in the ownership of the earls of Warwick. Daniel Garrett's work at Warwick is documented in 1748; Howard Colvin attributed to him the Gothick interior of the Chapel.[32] Lancelot \"Capability\" Brown had been on hand since 1749.[33] Brown, who was still head gardener at Stowe at the time and had yet to make his reputation as the main exponent of the English landscape garden, was called in by Lord Brooke to give Warwick Castle a more \"natural\" connection to its river. Brown simplified the long narrow stretch by sweeping it into a lawn that dropped right to the riverbank, stopped at each end by bold clumps of native trees. A serpentine drive gave an impression of greater distance between the front gates and the castle entrance.[34]",
			"color": "burly|0.39664 wood|0.39664 tan|0.39613 black|0.065367  "
		}
	}
}
