{
	"add": {
		"doc": {
			"id": "9561149fe9c6b7cc0f58c87c07e801afcf418d74041d3b99efe18b6c79f55a4a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Palazzo_Beneventano_del_Bosco-pjt.jpg/200px-Palazzo_Beneventano_del_Bosco-pjt.jpg",
			"previous": [],
				"after": "As with all architectural styles, people eventually tired of Baroque. In some parts of Europe, it metamorphosed into the rococo, but not in Sicily. No longer ruled by Austria, Sicily, from 1735 officially the Kingdom of Sicily, was ruled by the King of Naples, Ferdinand IV. Hence Palermo was in constant association with the principal capital Naples, where there was architecturally a growing reversion to the more classical styles of architecture. Coupled with this, many of the more cultured Sicilian nobility developed a fashionable obsession with all things French, from philosophy to arts, fashion, and architecture. Many of them visited Paris in pursuit of these interests and returned with the latest architectural engravings and theoretical treatises. The French architect Léon Dufourny was in Sicily between 1787 and 1794 to study and analyse the ancient Greek temples on the island.[48] Thus Sicilians rediscovered their ancient past, which with its classical idioms was now the height of fashion. The change in tastes did not come about overnight. Baroque remained popular on the island, but now Sicilian balconies, extravagant as ever, would be placed next to severe classical columns. Dufourny began designing in Palermo, and his \"Entrance Temple\" (1789) to the Botanical Gardens was the first building in Sicily in a style based on the Greek Doric order. It is pure neoclassical architecture, as established in England since 1760, and it was a sign of things to come.",
			"color": "dark|0.39028 gray|0.39028 dark|0.39028 grey|0.39028 dim|0.1966 gray|0.1966 dim|0.1966 grey|0.1966 gray|0.16386 grey|0.16386 silver|0.093208 black|0.062858 light|0.040318 gray|0.040318 light|0.040318 grey|0.040318 gainsboro|0.02881  "
		}
	}
}
