{
	"add": {
		"doc": {
			"id": "956ae9bb56cb8f05ee06f92ce5d714288155cb2f9b158d09a96a94fd3390e8a3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/d/d1/LeftPeriphery_Rizzi_1997_eng.png",
				"previous": "Historically, generative proposals made focus a feature bound to a single word within a sentence. Chomsky and Halle[18] formulated a Nuclear Stress Rule that proposed there to be a relation between the main stress of a sentence and a single constituent. Since this constituent is prominent sententially in a way that can contrast with lexical stress, this was originally referred to as \"nuclear\" stress. The purpose of this rule was to capture the intuition that within each sentence, there is one word in particular that is accented more prominently due to its importance - this is said to form the nucleus of that sentence.",
				"after": "Focus was later suggested to be a structural position at the beginning of the sentence (or on the left periphery) in Romance languages such as Italian, as the lexical head of a Focus Phrase (or FP, following the X-bar theory of phrase structure). Jackendoff,[19] Selkirk,[14][15] Rooth,[20][21] Krifka,[22] Schwarzschild[16] argue that focus consists of a feature that is assigned to a node in the syntactic representation of a sentence. Because focus is now widely seen as corresponding between heavy stress, or nuclear pitch accent, this feature is often associated with the phonologically prominent element(s) of a sentence.",
			"color": "white|0.098733 snow|0.09678 mint|0.096211 cream|0.096211 white|0.095958 smoke|0.095958 ghost|0.095783 white|0.095783 azure|0.095281 alice|0.095212 blue|0.095212 floral|0.095013 white|0.095013 sea|0.094786 shell|0.094786 lavender|0.092547 blush|0.092547 dim|0.0090515 gray|0.0090515 dim|0.0090515 grey|0.0090515 dark|0.0072912 gray|0.0072912 dark|0.0072912 grey|0.0072912 gray|0.0071966 grey|0.0071966 silver|0.0054735 black|0.0042977 light|0.0038825 gray|0.0038825 light|0.0038825 grey|0.0038825 gainsboro|0.0034149  "
		}
	}
}
