{
	"add": {
		"doc": {
			"id": "956d95e45c8faf651c57f75794518ef9faf08b8039c0895ff7d50d9b68fd930a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Saint-Gaudens_Censored.jpg/170px-Saint-Gaudens_Censored.jpg",
				"previous": "The double eagle, or twenty-dollar gold piece, was first issued in 1850; its congressional authorization was a response to the increasing amount of gold available as the result of the California Gold Rush.[1] The resulting Liberty Head double eagle, designed by Mint Engraver James Longacre, was struck for the remainder of the 19th century, though the design was modified several times. The double eagle, due to its very high face value, equivalent to several hundred dollars today, did not widely circulate, but was the coin most often used for large international transactions, in which settlement was to be in gold. In the West, where gold or silver coins were preferred to paper money—use of which was illegal in California in the aftermath of the Gold Rush—the coins saw some circulation.[2]",
				"after": "Sculptor Augustus Saint-Gaudens's first association with the Mint was in 1891, when he served on a committee judging entries for the new silver coinage.[3] The Mint had offered only a small prize to the winner, and all invited artists (including St. Gaudens himself) refused to submit entries. The competition was open to the public, and the judging committee (which consisted of Saint-Gaudens, Mint Engraver Charles E. Barber, and commercial engraver Henry Mitchell) found no entry suitable.[4] This came as no surprise to Saint-Gaudens, who told Mint Director Edward O. Leech that there were only four men in the world capable of such work, of whom three were in France and Saint-Gaudens was the fourth. Barber, who had been Chief Engraver since 1879, felt that Saint-Gaudens overstated the case, and there was only one man capable of such coinage work—Barber himself.[5] Leech responded to the failed competition by directing Barber to prepare new designs for the dime, quarter dollar, and half dollar, resulting in the Barber coinage,[4] an issue which attracted considerable public dissatisfaction.[6]",
			"color": "dim|0.42221 gray|0.42221 dim|0.42221 grey|0.42221 gray|0.38714 grey|0.38714  "
		}
	}
}
