{
	"add": {
		"doc": {
			"id": "956f3370e5dbb45bf0ce86b97cafbbbcf0e3df6e4b33b5bbf717b9d1b60e5715",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Darwin_divergence.jpg/350px-Darwin_divergence.jpg",
				"previous": "Historians have remarked that here Darwin anticipated the modern concept of an ecological niche.[104] He did not suggest that every favourable variation must be selected, nor that the favoured animals were better or higher, but merely more adapted to their surroundings.",
				"after": "Darwin proposes sexual selection, driven by competition between males for mates, to explain sexually dimorphic features such as lion manes, deer antlers, peacock tails, bird songs, and the bright plumage of some male birds.[105] He analysed sexual selection more fully in The Descent of Man, and Selection in Relation to Sex (1871). Natural selection was expected to work very slowly in forming new species, but given the effectiveness of artificial selection, he could \"see no limit to the amount of change, to the beauty and infinite complexity of the coadaptations between all organic beings, one with another and with their physical conditions of life, which may be effected in the long course of time by nature's power of selection\". Using a tree diagram and calculations, he indicates the \"divergence of character\" from original species into new species and genera. He describes branches falling off as extinction occurred, while new branches formed in \"the great Tree of life ... with its ever branching and beautiful ramifications\".[106]",
			"color": "gainsboro|0.13417 light|0.11966 gray|0.11966 light|0.11966 grey|0.11966 white|0.098837 smoke|0.098837 linen|0.069919 sea|0.067113 shell|0.067113 alice|0.065287 blue|0.065287 ghost|0.064376 white|0.064376 snow|0.06365 lavender|0.063064 blush|0.063064 silver|0.054009 white|0.050598 mint|0.038531 cream|0.038531 dark|0.038377 gray|0.038377 dark|0.038377 grey|0.038377 floral|0.023579 white|0.023579 gray|0.020525 grey|0.020525 azure|0.013149 dim|0.010221 gray|0.010221 dim|0.010221 grey|0.010221  "
		}
	}
}
