{
	"add": {
		"doc": {
			"id": "956f442d8f3c6989922970eec0e8f5e3c32956f4ae666065d746f49ecaf6d4bd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/BoyceGrave6.jpg/150px-BoyceGrave6.jpg",
				"previous": "Benjamin Boyce died in 1928 of a heart embolism. His father did not arrive home until after his son's death. Boyce was so saddened over his son's death that his own health suffered. One of Boyce's last efforts was to publish his son's letters from his South Seas expeditions: Dear Dad Letters from New Guinea.[46] Boyce died from bronchial pneumonia on June 11, 1929, in Chicago and was buried in his adopted hometown of Ottawa, Illinois, on June 13, 1929, in the Ottawa Avenue Cemetery, with West delivering the eulogy.[75] Boy Scouts maintained an honor guard with an American flag in a heavy rainstorm in two-hour shifts at his Ottawa home and 32 Boy Scouts were chosen as honorary pallbearers. BSA officials sent his widow a telegram that said the entire American nation owed him a debt of gratitude.[76] A statue that commemorates his contribution to the Boy Scouts of America was placed near his grave on June 21, 1941, which West dedicated.[4][77]",
				"after": "Boyce was recognized with the Silver Buffalo Award in 1926, the first year it was awarded, for his efforts in starting the BSA. He was the third recipient, after Baden-Powell and the Unknown Scout.[78] During the BSA's 50th anniversary in 1960, 15,000 Scouts and several of Boyce's descendants gathered in Ottawa for a Boyce Memorial weekend. Illinois governor William Stratton delivered the key address and Bridge Street was renamed Boyce Memorial Drive. In 1985, about 2,500 Scouts attended a 75th anniversary pilgrimage in Ottawa, attended by his last surviving child, Virginia, and the Union League of Chicago named Boyce its first Hall of Fame member. Boyce had been a member from 1891 until he died.[79] On December 6, 1997, a Scouting museum opened in Ottawa.[80] The W. D. Boyce Council of the BSA is named in his honor.[81] A Pennsylvania State Historical Marker located on Boyce Campus of Community College of Allegheny County in Monroeville, Pennsylvania, recognizes his achievements to Scouting.[82] Not far from the marker is a county park, Boyce Park, that was named for him. A medallion of Boyce is near the White House as part of the The Extra Mile – Points of Light Volunteer Pathway.[83] In 2005, the BSA introduced the William D. Boyce New Unit Organization Award, presented to the organizer of any new Scouting unit.[84]",
			"color": "gray|0.29922 grey|0.29922 dark|0.19219 gray|0.19219 dark|0.19219 grey|0.19219 dim|0.17489 gray|0.17489 dim|0.17489 grey|0.17489 light|0.13202 slate|0.13202 gray|0.13202 slate|0.12668 gray|0.12668 silver|0.055509 light|0.01101 gray|0.01101 light|0.01101 grey|0.01101 black|0.0047652 gainsboro|0.0034631  "
		}
	}
}
