{
	"add": {
		"doc": {
			"id": "957029ef9f683dab601c3cb0bc98edd26a05804315a91e75c627691cf31f06fb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Louisville_Clock.jpg/250px-Louisville_Clock.jpg",
				"previous": "In addition to the race itself, a number of traditions play a large role in the Derby atmosphere. The mint julep, an iced drink consisting of bourbon, mint, and a sugar syrup, is the traditional beverage of the race. The historic drink can be served in an ice-frosted silver julep cup, but most Churchill Downs patrons sip theirs from souvenir glasses (first offered in 1939 and available in revised form each year since) printed with all previous Derby winners. Also, burgoo, a thick stew of beef, chicken, pork, and vegetables, is a popular Kentucky dish served at the Derby.",
				"after": "The infield, a spectator area inside the track, offers general admission prices but little chance of seeing much of the race. Instead, revelers show up in the infield to party with abandon. By contrast, \"Millionaire's Row\" refers to the expensive box seats that attract the rich, the famous and the well-connected. Women appear in fine outfits lavishly accessorized with large, elaborate hats. As the horses are paraded before the grandstands, the University of Louisville Marching Band plays Stephen Foster's \"My Old Kentucky Home,\" a tradition which began in 1921.[15] The event attracts spectators from a large area, flying in hundreds of private aircraft to Louisville International Airport.[16]",
			"color": "black|0.55855 dim|0.043227 gray|0.043227 dim|0.043227 grey|0.043227 light|0.034094 steel|0.034094 blue|0.034094 dark|0.033376 gray|0.033376 dark|0.033376 grey|0.033376 gray|0.02917 grey|0.02917 silver|0.024397 tan|0.019156 antique|0.014236 white|0.014236 wheat|0.014103 papaya|0.013328 whip|0.013328 beige|0.013274 corn|0.012845 silk|0.012845 dark|0.012483 slate|0.012483 gray|0.012483 blanched|0.012256 almond|0.012256 light|0.010926 slate|0.010926 gray|0.010926 light|0.010492 yellow|0.010492 old|0.0098352 lace|0.0098352 light|0.0095512 gray|0.0095512 light|0.0095512 grey|0.0095512 slate|0.0091053 gray|0.0091053 light|0.008948 golden|0.008948 rod|0.008948 yellow|0.008948 pale|0.0082883 golden|0.0082883 rod|0.0082883 bisque|0.0081074 ivory|0.0071012  "
		}
	}
}
