{
	"add": {
		"doc": {
			"id": "9578d214e18f258bfa1074180db381b60595a7d42531cb86c5588fc60e400a7a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/ILA_Berlin_2012_PD_193-2.JPG/220px-ILA_Berlin_2012_PD_193-2.JPG",
			"previous": [
				"Access to the cockpit is normally via either a telescopic integral ladder or an external version. The integral ladder is stowed in the port side of the fuselage, below the cockpit.[94]",
				"The DVI system is speaker-dependent; i.e., requires each pilot to create a template. It is not used for any safety-critical or weapon-critical tasks, such as weapon release or lowering of the undercarriage, but is used for a wide range of other cockpit functions.[91][92] Voice commands are confirmed by visual or aural feedback. The system is seen as a major design feature in the reduction of pilot workload. All functions are also achievable by means of a conventional button-press or soft-key selections. The functions include display management, communications, and management of various systems.[93] EADS Defence and Security in Spain has worked on a new non-template DVI module to allow for continuous speech recognition, speaker voice recognition with common databases (e.g. British English, American English, etc.) and other improvements.[93]"
			],
				"after": "The Eurofighter operates automatic Emission Controls (EMCON) to reduce the Electro-Magnetic emissions of the current CAPTOR mechanically scanned Radar.[95] The Captor-M was the first NATO-Radar with three rather than two working channels, one intended for classification of jammer and for jamming suppression.[96]",
			"color": "white|0.088199 smoke|0.088199 sea|0.087151 shell|0.087151 snow|0.086502 floral|0.086207 white|0.086207 white|0.085967 mint|0.08587 cream|0.08587 ghost|0.084868 white|0.084868 alice|0.083746 blue|0.083746 azure|0.083142 lavender|0.076656 blush|0.076656 dark|0.020122 gray|0.020122 dark|0.020122 grey|0.020122 silver|0.017082 light|0.012609 gray|0.012609 light|0.012609 grey|0.012609 linen|0.011361 gainsboro|0.010161 black|0.008765 ivory|0.0082831 antique|0.0048739 white|0.0048739 old|0.0046764 lace|0.0046764 blanched|0.0036695 almond|0.0036695 papaya|0.0035208 whip|0.0035208 firebrick|0.0034569 beige|0.0032455 bisque|0.0032426 maroon|0.0030698  "
		}
	}
}
