{
	"add": {
		"doc": {
			"id": "957bcdcca56bf9a1149e3fc452976ded2c0702f29d2bfd5f803ab046d42084b8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Konstytucja_PRL_draft_with_Stalin_remarks.jpg/220px-Konstytucja_PRL_draft_with_Stalin_remarks.jpg",
				"previous": "The official results of the election showed the Democratic Bloc with 80.1 percent of the vote. The Democratic Bloc was awarded 394 seats to only 28 for the PSL. Mikołajczyk immediately resigned to protest this implausible result, and fled to the United Kingdom in April rather than face arrest. Later, historians confirmed that the official results were only obtained through massive fraud. Government officials didn't even count the real votes in many areas, and simply filled in the relevant documents in accordance with instructions from the Communists. In other areas, the ballot boxes were either destroyed or replaced with boxes containing prefilled ballots.",
				"after": "The 1947 election marked the beginning of undisguised Communist rule in Poland, though it was not officially transformed into the Polish People's Republic until the adoption of the 1952 Constitution. However, Gomułka never supported Stalin's control over the Polish Communists, and was soon replaced as party leader by the more pliable Bierut. In 1948, the Communists consolidated their power, merging with Cyrankiewicz' faction of the PPS to form the Polish United Workers' Party (known in Poland as 'the Party'), which would monopolise political power in Poland until 1989. In 1949, Soviet Marshal Konstantin Rokossovsky became Polish Minister of National Defence, with the additional title Marshal of Poland, and in 1952 he became Deputy Chairman of the Council of Ministers (deputy premier).",
			"color": "light|0.16058 golden|0.16058 rod|0.16058 yellow|0.16058 lemon|0.14323 chiffon|0.14323 light|0.12786 yellow|0.12786 corn|0.11673 silk|0.11673 beige|0.11561 papaya|0.087626 whip|0.087626 blanched|0.059167 almond|0.059167 antique|0.04784 white|0.04784 old|0.036492 lace|0.036492 ivory|0.035775 pale|0.015363 golden|0.015363 rod|0.015363 honeydew|0.014699 floral|0.011049 white|0.011049 wheat|0.01098 linen|0.0069206  "
		}
	}
}
