{
	"add": {
		"doc": {
			"id": "95c526c5b988c9abb4769df63dadeffbdcc0543166c7e2bac7ab80cd195f5d99",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Concorde_first_visit_Heathrow_Fitzgerald.jpg/220px-Concorde_first_visit_Heathrow_Fitzgerald.jpg",
				"previous": "Construction of two prototypes began in February 1965: 001, built by Aerospatiale at Toulouse, and 002, by BAC at Filton, Bristol. Concorde 001 made its first test flight from Toulouse on 2 March 1969, piloted by André Turcat,[35] and first went supersonic on 1 October.[36] The first UK-built Concorde flew from Filton to RAF Fairford on 9 April 1969, piloted by Brian Trubshaw.[37][38] Both prototypes were presented to the public for the first time on 7–8 June 1969 at the Paris Air Show. As the flight programme progressed, 001 embarked on a sales and demonstration tour on 4 September 1971, which was also the first transatlantic crossing of Concorde.[39][40] Concorde 002 followed suit on 2 June 1972 with a tour of the Middle and Far East.[41] Concorde 002 made the first visit to the United States in 1973, landing at the new Dallas/Fort Worth Regional Airport to mark that airport’s opening.[42]",
				"after": "While Concorde had initially held a great deal of customer interest, the project was hit by a large number of order cancellations. The Paris Le Bourget air show crash of the competing Soviet Tupolev Tu-144 had shocked potential buyers, and public concern over the environmental issues presented by a supersonic aircraft – the sonic boom, takeoff-noise and pollution – had produced a shift in public opinion of SSTs. By 1976 four nations remained as prospective buyers: Britain, France, China, and Iran.[43] Only Air France and British Airways (the successor to BOAC) took up their orders, with the two governments taking a cut of any profits made.[44]",
			"color": "gray|0.39237 grey|0.39237 dark|0.13607 gray|0.13607 dark|0.13607 grey|0.13607 dim|0.13057 gray|0.13057 dim|0.13057 grey|0.13057 silver|0.075134 light|0.048132 gray|0.048132 light|0.048132 grey|0.048132 black|0.044782 gainsboro|0.034501 linen|0.014865 white|0.012554 smoke|0.012554 sea|0.012116 shell|0.012116 floral|0.010249 white|0.010249 snow|0.0089064 old|0.0088966 lace|0.0088966 mint|0.0082342 cream|0.0082342 white|0.0074882 ivory|0.0065917 antique|0.0062806 white|0.0062806  "
		}
	}
}
