{
	"add": {
		"doc": {
			"id": "95f22138f78a90ee419bd66b915e823d75e2329d317d7a16094fab804f4457e5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/NASA_Apollo_17_Lunar_Roving_Vehicle.jpg/220px-NASA_Apollo_17_Lunar_Roving_Vehicle.jpg",
				"previous": "The first person to stand on the Moon was Neil Armstrong, who was followed by Buzz Aldrin, while Michael Collins orbited above. Five subsequent Apollo missions also landed astronauts on the Moon, the last in December 1972. Throughout these six Apollo spaceflights, twelve men walked on the Moon. These missions returned a wealth of scientific data and 381.7 kilograms (842 lb) of lunar samples. Topics covered by experiments performed included soil mechanics, meteoroids, seismology, heat flow, lunar ranging, magnetic fields, and solar wind.[41] The Moon landing marked the end of the space race and as a gesture, Armstrong mentioned mankind[42] when he stepped down on the Moon.",
				"after": "Apollo set major milestones in human spaceflight. It stands alone in sending manned missions beyond low Earth orbit, and landing humans on another celestial body.[43] Apollo 8 was the first manned spacecraft to orbit another celestial body, while Apollo 17 marked the last moonwalk and the last manned mission beyond low Earth orbit to date. The program spurred advances in many areas of technology peripheral to rocketry and manned spaceflight, including avionics, telecommunications, and computers. Apollo sparked interest in many fields of engineering and left many physical facilities and machines developed for the program as landmarks. Many objects and artifacts from the program are on display at various locations throughout the world, notably at the Smithsonian's Air and Space Museums.",
			"color": "black|0.2656 gray|0.21484 grey|0.21484 dim|0.16729 gray|0.16729 dim|0.16729 grey|0.16729 dark|0.10684 gray|0.10684 dark|0.10684 grey|0.10684 silver|0.057692 light|0.036629 gray|0.036629 light|0.036629 grey|0.036629 gainsboro|0.028845 white|0.012202 smoke|0.012202 sea|0.0098906 shell|0.0098906 linen|0.0091337 snow|0.0090731 floral|0.0078492 white|0.0078492 ghost|0.0078204 white|0.0078204 white|0.0078146 mint|0.0073736 cream|0.0073736 alice|0.006965 blue|0.006965 rosy|0.0060474 brown|0.0060474 lavender|0.0056448 blush|0.0056448 azure|0.0051952 dark|0.004717 salmon|0.004717 peach|0.0038683 puff|0.0038683  "
		}
	}
}
