{
	"add": {
		"doc": {
			"id": "95f3e4be5d297611eb1b1504e384f14feb3ab143de1aaf94a5c976eb7734a6a0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Philomachus_pugnax_naumann.jpg/220px-Philomachus_pugnax_naumann.jpg",
			"previous": [],
				"after": "The ruff is a migratory species, breeding in wetlands in colder regions of northern Eurasia, and spends the northern winter in the tropics, mainly in Africa. Some Siberian breeders undertake an annual round trip of up to 30,000 km (18,500 mi) to the West African wintering grounds.[19] There is a limited overlap of the summer and winter ranges in western Europe.[3] The ruff breeds in extensive lowland freshwater marshes and damp grasslands.[3] It avoids barren tundra and areas badly affected by severe weather, preferring hummocky marshes and deltas with shallow water. The wetter areas provide a source of food, the mounds and slopes may be used for leks, and dry areas with sedge or low scrub offer nesting sites.[20] A Hungarian study showed that moderately intensive grazing of grassland, with more than one cow per hectare (2.5 acres), was found to attract more nesting pairs.[21] When not breeding, the birds use a wider range of shallow wetlands, such as irrigated fields, lake margins, and mining subsidence and other floodlands. Dry grassland, tidal mudflats and the seashore are less frequently used.[20] The density can reach 129 individuals per square kilometre (334 per square mile), but is usually much lower.[22]",
			"color": "dark|0.15243 khaki|0.15243 tan|0.12109 dark|0.079047 olive|0.079047 green|0.079047 black|0.067101 pale|0.060285 golden|0.060285 rod|0.060285 burly|0.036651 wood|0.036651 wheat|0.0363 light|0.036202 golden|0.036202 rod|0.036202 yellow|0.036202 lemon|0.033928 chiffon|0.033928 olive|0.028521 drab|0.028521 dark|0.025434 sea|0.025434 green|0.025434 dark|0.02292 slate|0.02292 gray|0.02292 beige|0.020149 light|0.018137 yellow|0.018137 corn|0.016396 silk|0.016396 dark|0.013775 gray|0.013775 dark|0.013775 grey|0.013775 golden|0.013575 rod|0.013575  "
		}
	}
}
