{
	"add": {
		"doc": {
			"id": "95f7378942394707b54f6fbe4984c94d490adaf9ad6eadfb0031783bfe42577d",
			"url": "https://upload.wikimedia.org/wikipedia/en/5/52/TaxiDriver1.jpg",
				"previous": "Film noir has been parodied many times, in many manners. In 1945, Danny Kaye starred in what appears to be the first intentional film noir parody, Wonder Man.[139] That same year, Deanna Durbin was the singing lead in the comedic noir Lady on a Train, which makes fun of Woolrich-brand wistful miserablism. Bob Hope inaugurated the private-eye noir parody with My Favorite Brunette (1947), playing a baby photographer who is mistaken for an ironfisted detective.[139] In 1947 as well, The Bowery Boys appeared in Hard Boiled Mahoney, which had a similar mistaken-identity plot; they spoofed the genre once more in Private Eyes (1953). Two RKO productions starring Robert Mitchum take film noir over the border into self-parody: The Big Steal (1949), directed by Don Siegel, and His Kind of Woman (1951).[b] The \"Girl Hunt\" ballet in Vincente Minnelli's The Band Wagon (1953) is a ten-minute distillation of—and play on—noir in dance.[140] The Cheap Detective (1978), starring Peter Falk, is a broad spoof of several films, including the Bogart classics The Maltese Falcon and Casablanca. Carl Reiner's black-and-white Dead Men Don't Wear Plaid (1982) appropriates clips of classic noirs for a farcical pastiche, while his Fatal Instinct (1993) sends up noirs both classic (Double Indemnity) and neo (Basic Instinct). Robert Zemeckis's Who Framed Roger Rabbit (1988) develops a noir plot set in 1940s L.A. around a host of cartoon characters.",
				"after": "Noir parodies come in darker tones as well. Murder by Contract (1958), directed by Irving Lerner, is a deadpan joke on noir, with a denouement as bleak as any of the films it kids. An ultra-low-budget Columbia Pictures production, it may qualify as the first intentional example of what is now called a neo-noir film; it was likely a source of inspiration for both Melville's Le Samouraï and Scorsese's Taxi Driver.[141] Belying its parodic strain, The Long Goodbye‍ '​s final act is seriously grave. Taxi Driver caustically deconstructs the \"dark\" crime film, taking it to an absurd extreme and then offering a conclusion that manages to mock every possible anticipated ending—triumphant, tragic, artfully ambivalent—while being each, all at once.[142] Flirting with splatter status even more brazenly, the Coens' Blood Simple is both an exacting pastiche and a gross exaggeration of classic noir.[143] Adapted by director Robinson Devor from a novel by Charles Willeford, The Woman Chaser (1999) sends up not just the noir mode but the entire Hollywood filmmaking process, with seemingly each shot staged as the visual equivalent of an acerbic Marlowe wisecrack.[144]",
			"color": "black|0.43929 dark|0.22579 salmon|0.22579 sienna|0.095629 light|0.040899 salmon|0.040899 burly|0.036953 wood|0.036953 sandy|0.036542 brown|0.036542 rosy|0.029049 brown|0.029049 dim|0.021423 gray|0.021423 dim|0.021423 grey|0.021423 peru|0.015251 tan|0.014664  "
		}
	}
}
