{
	"add": {
		"doc": {
			"id": "96115a79611835932390da0314716aa5cb6ca484d9b0844f21a4b42ef88ee870",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Panthera_leo_%26_Crocuta_crocuta.jpg/250px-Panthera_leo_%26_Crocuta_crocuta.jpg",
			"previous": [],
				"after": "Lions and spotted hyenas occupy the same ecological niche, meaning they compete for prey and carrion in the areas where they coexist. A review of data across several studies indicates a dietary overlap of 58.6%.[92] Lions typically ignore spotted hyenas unless the lions are on a kill or are being harassed by the hyenas, while the latter tend to visibly react to the presence of lions whether there is food or not. Lions seize the kills of spotted hyenas: in the Ngorongoro crater, it is common for lions to subsist largely on kills stolen from hyenas, causing the hyenas to increase their kill rate.[93] On the other hand, in Northern Botswana's Chobe National Park, the situation is reversed: hyenas frequently challenge lions and steal their kills: they obtain food from 63% of all lion kills.[94] When confronted on a kill by lions, spotted hyenas may either leave or wait patiently at a distance of 30–100 m (98–328 ft) until the lions have finished,[95] but they are also bold enough to feed alongside lions, and even force the lions off a kill. The two species may attack one another even when there is no food involved for no apparent reason.[96][97] Lion predation can account for up to 71% of hyena deaths in Etosha. Spotted hyenas have adapted by frequently mobbing lions that enter their territories.[98] Experiments on captive spotted hyenas revealed that specimens with no prior experience with lions act indifferently to the sight of them, but will react fearfully to the scent.[93] The size of male lions allows them occasionally to confront hyenas in otherwise evenly matched brawls and so to tip the balance in favour of the lions.",
			"color": "dim|0.25204 gray|0.25204 dim|0.25204 grey|0.25204 sandy|0.21107 brown|0.21107 peru|0.17859 gray|0.083784 grey|0.083784 burly|0.072254 wood|0.072254 black|0.065105 tan|0.06299 sienna|0.0292  "
		}
	}
}
