{
	"add": {
		"doc": {
			"id": "963946752fa768202d6c7331f51d3de0fc8a39ce58d98bb2138dc5f57be0197d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Dwightwood_Spring%2C_on_Mackinac_Island%27s_eastern_shore.jpg/220px-Dwightwood_Spring%2C_on_Mackinac_Island%27s_eastern_shore.jpg",
				"previous": "In an early written history of Mackinac Island (1887) by Andrew Blackbird, an official interpreter for the U.S. government and an Ottawa chief's son, he describes that a small independent tribe called \"Mi-shi-ne-macki naw-go\" once occupied Mackinac Island. They became confederated with the Ottawa from Ottawa Island (now Manitoulin Island) situated north of Lake Huron. One winter the Mi-shi-ne-macki naw-go on Mackinac Island were almost entirely annihilated by the Seneca people from New York, who were part of the Iroquois Confederacy. Only two of the local natives escaped by hiding in one of the natural caves at the island. To commemorate the losses of this allied tribe, the Ottawa and Chippewa named what is now Mackinac Island, as \"Mi-shi-ne-macki-nong.\" [37] In 1895 Fort Mackinac's John R. Bailey, M. D. published his history, entitled Mackinac formerly Michilimackinac, describing some of the first recorded presence on Mackinac of French traders. They arrived in 1654 with a large party of Huron and Ottawa heading to Three Rivers; another visitor was an adventurer making a canoe voyage in 1665.[1]",
				"after": "Mackinac Island was formed as the glaciers of the last ice age began to melt around 13,000 BC. The bedrock strata that underlie the island are much older, dating to Late Silurian and Early Devonian time, about 400 to 420 million years ago. Subsurface deposits of halite (rock salt) dissolved, allowing the collapse of overlying limestones; these once-broken but now solidified rocks comprise the Mackinac Breccia.",
			"color": "dim|0.16216 gray|0.16216 dim|0.16216 grey|0.16216 dark|0.10341 gray|0.10341 dark|0.10341 grey|0.10341 gray|0.092949 grey|0.092949 silver|0.069716 light|0.052174 steel|0.052174 blue|0.052174 black|0.049551 tan|0.04191 lavender|0.0408 light|0.037234 gray|0.037234 light|0.037234 grey|0.037234 alice|0.031863 blue|0.031863 gainsboro|0.029029 slate|0.028322 gray|0.028322 light|0.027023 slate|0.027023 gray|0.027023 ghost|0.026709 white|0.026709 white|0.026508 smoke|0.026508 snow|0.022198 azure|0.022166 white|0.021687 mint|0.02087 cream|0.02087 sea|0.017067 shell|0.017067 floral|0.016463 white|0.016463 light|0.015512 blue|0.015512 lavender|0.014211 blush|0.014211 light|0.0054743 cyan|0.0054743  "
		}
	}
}
