{
	"add": {
		"doc": {
			"id": "96444de617cd75c36f1deac99b7302c98b6ed941fb324cae7b59d8c8fb3c75c5",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a9/Interior_of_House_with_Chimaeras.jpg/170px-Interior_of_House_with_Chimaeras.jpg",
				"previous": "Gorodetsky bought the first lot of land on February 1, 1901, with construction work commencing on March 18 of that year. Construction of the exterior walls was finished by August 21, and the roof installed and all masonry work was completed on September 13.[8][9] Due to the economic hardships within the Russian Empire, the completion of the building was delayed. In May 1903, only one apartment on the lowest level and Gorodetsky's own apartment were occupied.[8] The total cost of the land and construction amounted to 133,000 rubles.[nb 3] In total, 1,550 m2 (16,700 sq ft) of land were used for construction of the building and cost a total of 15,640 rubles.[7] The projected annual profit from the rentals was 7,200 rubles. A cowshed was located on the premises due to Gorodetsky's insistence on fresh in-house milk,[4][9] though it was specifically placed in a way that the smell of the cows would not disturb the tenants. On a lot adjacent to the building, a miniature alpine garden (approx. 320 m2 or 3,400 sq ft) and a fountain were built.",
				"after": "Due to financial mismanagement which included his Safari hunting hobby,[4] in July 1912, Gorodetsky pledged the building as a collateral against a loan taken from Kiev Mutual Credit Association.[3] When Gorodetsky defaulted on the loan, the building was auctioned off in 1913,[3] and became the property of the engineer Daniel Balakhovsky,[4] the son of a Kiev trader,[7] who was also the Chairman of the Board of Directors of Blahodatinskoe sugar factory,[7] and a French сonsular agent in Kiev.[10] In 1916, the house belonged to the Blahodatinskoe sugar factory.[3] In 1918, the building's ownership changed again, to Samuel Nemets.[3] In 1921, after the Bolsheviks gained control of Kiev, several of the departments of the Kiev Military District took offices in the House with Chimaeras.",
			"color": "rosy|0.21757 brown|0.21757 sienna|0.18323 light|0.0966 steel|0.0966 blue|0.0966 thistle|0.067217 lavender|0.034821 alice|0.033555 blue|0.033555 light|0.029727 blue|0.029727 dark|0.027811 gray|0.027811 dark|0.027811 grey|0.027811 ghost|0.025409 white|0.025409 white|0.024483 smoke|0.024483 silver|0.024175 azure|0.02396  "
		}
	}
}
