{
	"add": {
		"doc": {
			"id": "965547840eba3a71966b156b2865e89c3feb61e74cd62732d8b4c8d9711fa2e4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/BoyceBuildingFront.jpg/220px-BoyceBuildingFront.jpg",
				"previous": "At a time when women had trouble finding work and workers were often oppressed, Boyce felt their rights were important: his businesses employed many women and he supported labor unions. His newspapers often carried stories about the \"nobility of labor\". His businesses were able to pay out wages and benefits during the Panic of 1893, a time when many businesses were laying off workers and cutting wages.[33] During the Pullman Strike of the Pullman Palace Car Company in 1894, which spread to 20 companies in over half the states, Boyce called Eugene V. Debs, the socialist labor leader of the American Railway Union, a \"great labor leader\" and George Pullman, inventor of the sleeping car, the man \"who caused all the trouble\".[34] In 1901 when the Boyce Paper Manufacturing Company in Marseilles, Illinois, burned down, he paid the workers immediately and then hired them as construction workers to rebuild the paper mill so they would not lose income.[35][36] Yet, he was also protective of his money. In late 1894, when two of his workers were injured by a fallen smokestack and won $2,000 each in a court judgment, Boyce appealed the case all the way to the Supreme Court of Illinois, and lost.[37] He was also persistent in getting what he wanted; in 1902 he sued the Marseilles Land and Power Company for not supplying enough water power to his mills and won a $65,300 judgment. In 1903 the Marseilles Land and Power Company fell into receivership and Boyce bought the company.[35]",
				"after": "Boyce hired his son, Ben, when he was 20 years old, giving him high-level positions in his water and power businesses in and around Marseilles and Ottawa.[38] However, their relationship was often strained by Boyce's high expectations and Ben's carelessness with his funds in activities such as betting on horse races.[39]",
			"color": "dim|0.40632 gray|0.40632 dim|0.40632 grey|0.40632 black|0.14534 gray|0.10904 grey|0.10904 dark|0.091684 slate|0.091684 gray|0.091684 light|0.071822 slate|0.071822 gray|0.071822 slate|0.051796 gray|0.051796 dark|0.041888 gray|0.041888 dark|0.041888 grey|0.041888 dark|0.034311 olive|0.034311 green|0.034311  "
		}
	}
}
