{
	"add": {
		"doc": {
			"id": "9656514cb75481bd77e00d9548b3a0156c8d8ee4b31f0f4832d976de3ce2c26b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/M51a.jpg/220px-M51a.jpg",
				"previous": "An increasing number of astronomers began to come to Cherry Springs, most in the 14-day dark sky period around the new moon, between the last quarter and first quarter phases. The park is open year-round and between 60 and 85 nights each year have ideal conditions,[52] when the apparent magnitudes of the faintest stars visible can range from 7.1 to 7.5.[51] The park's Astronomy Field has been upgraded to accommodate these astronomers. In 2005 a rotating 15-foot (4.6 m) slotted observatory dome, two 12-foot (3.7 m) clamshell domes, and a 10-by-12-foot (3.0 by 3.7 m) sky shed were added, as well as a small amphitheater for programs. The four structures protect telescopes from the wind and thermal currents. The next year concrete pads 4 and 6 feet (1.2 and 1.8 m) in diameter were placed at random in the field, and electrical pedestals, each with six outlets, were added to power telescopes and computers.[34][36] In 2009, Wi-Fi internet access was added to the Astronomy Field.[61]",
				"after": "While a typical clear night might have 50 to 100 observers,[10][60] each year the park hosts two major star parties which both attract several hundred astronomers for several nights.[3] The Black Forest Star Party, sponsored by the Central Pennsylvania Observers of State College, has been held each fall since 1999.[62] The Cherry Springs Star Party, sponsored by the Astronomical Society of Harrisburg, has been held each June since 2005.[3][63] There are also free public programs at the amphitheater on the former airport site, some of which are part of the National Public Observatory's Stars-n-Parks program.[2] Meteor showers will also attract a crowd and the Aurora Borealis can be seen from the park.[10][36] A stargazing business, \"Crystal Spheres\", has been established and presents Music and Stars programs, with an hour-long concert followed by an hour of stargazing.[52][53][64] Such \"nature tourism\" has a positive economic impact for the area.[65]",
			"color": "dim|0.38462 gray|0.38462 dim|0.38462 grey|0.38462 gray|0.19973 grey|0.19973 dark|0.10661 gray|0.10661 dark|0.10661 grey|0.10661 silver|0.087944 light|0.048396 gray|0.048396 light|0.048396 grey|0.048396 gainsboro|0.03091  "
		}
	}
}
