{
	"add": {
		"doc": {
			"id": "9698a685b1b95ce6ddaf491a851e4cdce89b43eda175d53ce795f41328e08345",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/BEA_de_Havilland_DH-106_Comet_4B_Berlin.jpg/220px-BEA_de_Havilland_DH-106_Comet_4B_Berlin.jpg",
				"previous": "Within two years of Pan Am's introduction of jet equipment on the bulk of its internal German services from/to West Berlin, its market share rose from 58% to 68% while BEA's declined from 38% at the beginning of this period to 27% at its end. The lower seat density in BEA's re-configured Viscounts combined with higher flight frequencies, superior catering and increased promotion proved insufficient to counter the appeal of Pan Am's new jets, despite these being laid out in a comparatively tight, 34 in (86 cm) pitch seating configuration. On the other hand, BEA's reduced capacity in the domestic air travel market between West Berlin and West Germany enabled it to attain higher load factors than its competitors.[136][154][155]",
				"after": "From August 1968, BEA supplemented its Tempelhof-based Viscount fleet with de Havilland Comet 4B series jetliners.[136][143] Although these aircraft could operate from Tempelhof's short runways without payload restrictions, they were not suited to the airline's ultra short-haul operation from Berlin (average stage length: 230 mi (370 km)) given the high fuel consumption of the Comet, especially when operating at the mandatory 10,000 ft (3,000 m) altitude inside the Allied air corridors.[132][133][153][156] This measure was therefore only a stopgap until most of BEA's Berlin fleet was equipped with 97-seat, single-class BAC One-Eleven 500s.[nb 23][136] BEA's re-equipment of its Berlin fleet with brand-new One-Eleven 500 jets was central to the airline's competitive strategy to regain ground lost to Pan Am's 727s. The new One-Eleven 500, which BEA called the Super One-Eleven, operated its first scheduled service from Berlin on 1 September 1968.[11][136][143][156][157] It began replacing the airline's Berlin-based Viscounts from 17 November 1968.[91]",
			"color": "light|0.11922 steel|0.11922 blue|0.11922 black|0.1154 lavender|0.07343 light|0.060028 gray|0.060028 light|0.060028 grey|0.060028 gainsboro|0.055981 silver|0.05233 dark|0.044398 gray|0.044398 dark|0.044398 grey|0.044398 white|0.032727 smoke|0.032727 alice|0.031238 blue|0.031238 thistle|0.03079 ghost|0.029782 white|0.029782 light|0.028678 sky|0.028678 blue|0.028678 snow|0.025424 white|0.023705 gray|0.022443 grey|0.022443 mint|0.022249 cream|0.022249 sea|0.020762 shell|0.020762 azure|0.02023 lavender|0.019391 blush|0.019391 floral|0.019359 white|0.019359 dim|0.019132 gray|0.019132 dim|0.019132 grey|0.019132 light|0.019092 slate|0.019092 gray|0.019092  "
		}
	}
}
