{
	"add": {
		"doc": {
			"id": "969a8dd1ae596721d8af209e045309789efe5b9b8fe43feb5bcbd47088d11d7c",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f4/Berrill_Building_Entrance_The_Open_University.jpg/220px-Berrill_Building_Entrance_The_Open_University.jpg",
				"previous": "The UK base of Robert Bosch is in Denham. Martin-Baker is in Higher Denham, and InterContinental Hotels Group is in Denham Green (formerly in Windsor). Pioneer UK is in Stoke Poges and Cummins have a design plant in Iver, with Pinewood Studios in Iver Heath. Servier Laboratories UK is in Wexham. The Barracuda Group (owner of Varsity), Lexmark UK, Volvo Cars UK, and Trend Micro UK are in Marlow. GE Healthcare has its world HQ in Little Chalfont. Uniq plc is in Gerrards Cross. NT CADCAM in Haddenham is the UK distributor of the industry-standard SolidWorks CAD software package. Acco UK (stationery) are on the A418 in Aylesbury, opposite Aylesbury College; Askeys have made ice cream cones since 1965 next to the A4157 and Grand Union Canal.",
				"after": "Milton Keynes is home to many national companies such as Santander UK operations (née Abbey). The Home Retail Group (Argos and Homebase), Filtrona and BP Oil UK (retail) are in Central Milton Keynes. Rightmove is in Winterhill, Campbell Park. Nearby, on the other side of A5, Leica Geosystems is in Loughton. Further north, Luminar Leisure in Rooksley, Bradwell at the A5/A509 junction near the National Badminton Centre. To the west, the European HQ of WD-40 is in Kiln Farm, Bradwell Abbey. To the north, NEFF UK is in Wolverton and Greenleys. To the east, near the M1 and the A422 in Great Linford, Chrysler UK (Jeep and Dodge), Scania UK (part of VW), Rohan (clothing), Makita UK (power tools), Bong Ljungdahl UK who make envelopes, and Mercedes-Benz UK (including Smart Cars) are in Tongwell. VAG UK (VW and Audi) is nearby on the other side of the A422 in Blakelands. In the south of Milton Keynes, The Open University is in Walton Hall, in Walton. Domino's Pizza UK and Fisher & Paykel UK (fridges) are in Kingston, Milton Keynes Village, and Duravit UK (bathroom plumbing) are to the south. Red Bull Racing is off the A4146 in Tilbrook, Bow Brickhill. Chemetall, a chemical company, is in Denbigh West, Bletchley. Welcome Break is in Newport Pagnell, where Aston Martin had a factory until 2007.",
			"color": "black|0.17871 gray|0.13871 grey|0.13871 dim|0.13775 gray|0.13775 dim|0.13775 grey|0.13775 dark|0.10889 gray|0.10889 dark|0.10889 grey|0.10889 dark|0.076596 olive|0.076596 green|0.076596 silver|0.063184 slate|0.061217 gray|0.061217 light|0.053986 gray|0.053986 light|0.053986 grey|0.053986 light|0.046771 slate|0.046771 gray|0.046771 gainsboro|0.046064 dark|0.021475 slate|0.021475 gray|0.021475 linen|0.0090192 white|0.0073967 smoke|0.0073967  "
		}
	}
}
