{
	"add": {
		"doc": {
			"id": "96a052c82ee252fef9e26b434d33e4a38eb48e7dfa644f45d4f2b05a80def241",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Armillaria_gallica_27834.jpg/260px-Armillaria_gallica_27834.jpg",
			"previous": [],
				"after": "Researchers reported finding Armillaria gallica in the Upper Peninsula of Michigan in the early 1990s, during an unrelated research project to study the possible biological effects of extremely low frequency radio stations, which were being investigated as a means to communicate with submerged submarines. In one particular forest stand, Armillaria-infected oak trees had been harvested, and their stumps were left to rot in the field. Later, when red pines were planted in the same location, the seedlings were killed by the fungus, identified as A. gallica (then known as A. bulbosa). Using molecular genetics, they determined that the underground mycelia of one individual fungal colony covered 15 ha (37 acres), weighing over 9,500 kilograms (21,000 lb), with an estimated age of 1,500 years.[38][39] The analysis used restriction fragment length polymorphism (RFLP) and random amplification of polymorphic DNA (RAPD) to examine isolates collected from fruit bodies and rhizomorphs (underground aggregations of fungal cells that resemble plant roots) along 1-kilometer (0.6 mi) transects in the forest. The 15-hectare area yielded isolates that had identical mating type alleles and mitochondrial DNA restriction fragment patterns; this degree of genetic similarity indicated that the samples were all derived from a single genetic individual, or clone, that had reached its size through vegetative growth. In their conclusion the authors noted: \"This is the first report estimating the minimum size, mass, and age of an unambiguously defined fungal individual. Although the number of observations for plants and animals is much greater, members of the fungal kingdom should now be recognized as among the oldest and largest organisms on earth.\"[40] After the Nature paper was published, major media outlets from around the world visited the site where the specimens were found; as a result of this publicity, the individual acquired the common name \"humongous fungus\".[39] There was afterward some scholarly debate as to whether the fungus qualified to be considered in the same category as other large organisms such as the blue whale or the giant redwood.[41]",
			"color": "olive|0.29308 drab|0.29308 black|0.26538 yellow|0.23546 green|0.23546 dark|0.056551 olive|0.056551 green|0.056551 sienna|0.029454 saddle|0.02633 brown|0.02633 olive|0.019535 dark|0.016741 green|0.016741  "
		}
	}
}
