{
	"add": {
		"doc": {
			"id": "96ad34e32857021005070a30ca9ef3cd00935e45f4723dadd4aa2e8e79ba631b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Eisenhower_design.png/220px-Eisenhower_design.png",
			"previous": [],
				"after": "Two prototype dollars were struck at the Philadelphia Mint on January 25, 1971; they were subsequently destroyed.[31] Striking such large pieces of tough copper-nickel proved destructive to the Mint's dies, and Gasparro repeatedly used the Janvier reducing lathe to lower the relief to be used on the circulation strikes and the uncirculated silver clad coins. The chief engraver altered the resulting master die directly to restore at least some of the detail which was lost as the relief was lowered. The proof coins struck at San Francisco, nevertheless, remained in high relief.[32] This meant that in 1971 and for much of 1972 (until better-quality steel was used in the dies), the uncirculated strikes had a lower relief, less detailed surface, compared with the proof coins. Proof coins are struck slowly, and generally multiple times, to bring out the full detail.[33] Striking of Eisenhower dollars for circulation began at Denver on February 3, apparently without any ceremony; minting at Philadelphia also began early in the year, although Bowers, in his comprehensive encyclopedia of silver and clad dollar coins, does not record a specific date.[34] The first Eisenhower dollars in 40% silver, with an uncirculated finish, were struck at the San Francisco Assay Office (today the San Francisco Mint) on March 31, 1971; Brooks ceremoniously operated the presses. The first coin struck was for presentation to Mamie Eisenhower; the second to David Eisenhower (grandson of Dwight and Mamie Eisenhower) and the third to David Eisenhower's father-in-law, President Nixon.[35]",
			"color": "dark|0.11594 gray|0.11594 dark|0.11594 grey|0.11594 light|0.10869 gray|0.10869 light|0.10869 grey|0.10869 gainsboro|0.10551 silver|0.0874 white|0.069069 smoke|0.069069 gray|0.06196 grey|0.06196 lavender|0.058665 blush|0.058665 alice|0.058358 blue|0.058358 ghost|0.057848 white|0.057848 linen|0.057383 sea|0.057338 shell|0.057338 snow|0.056914 white|0.053198 dim|0.02458 gray|0.02458 dim|0.02458 grey|0.02458 mint|0.016622 cream|0.016622 floral|0.0063594 white|0.0063594 azure|0.0037359  "
		}
	}
}
