{
	"add": {
		"doc": {
			"id": "96b9ae463b80f853dac4f503b7f012d32e49011f8a259f87936eaf77e2fba73b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Huxley_-_Mans_Place_in_Nature.jpg/300px-Huxley_-_Mans_Place_in_Nature.jpg",
				"previous": "Scientific readers were already aware of arguments that species changed through processes that were subject to laws of nature, but the transmutational ideas of Lamarck and the vague \"law of development\" of Vestiges had not found scientific favour. Darwin presented natural selection as a scientifically testable mechanism while accepting that other mechanisms such as inheritance of acquired characters were possible. His strategy established that evolution through natural laws was worthy of scientific study, and by 1875, most scientists accepted that evolution occurred but few thought natural selection was significant. Darwin's scientific method was also disputed, with his proponents favouring the empiricism of John Stuart Mill's A System of Logic, while opponents held to the idealist school of William Whewell's Philosophy of the Inductive Sciences, in which investigation could begin with the intuitive truth that species were fixed objects created by design.[168] Early support for Darwin's ideas came from the findings of field naturalists studying biogeography and ecology, including Joseph Dalton Hooker in 1860, and Asa Gray in 1862. Henry Walter Bates presented research in 1861 that explained insect mimicry using natural selection. Alfred Russel Wallace discussed evidence from his Malay archipelago research, including an 1864 paper with an evolutionary explanation for the Wallace line.[169]",
				"after": "Evolution had less obvious applications to anatomy and morphology, and at first had little impact on the research of the anatomist Thomas Henry Huxley.[171] Despite this, Huxley strongly supported Darwin on evolution; though he called for experiments to show whether natural selection could form new species, and questioned if Darwin's gradualism was sufficient without sudden leaps to cause speciation. Huxley wanted science to be secular, without religious interference, and his article in the April 1860 Westminster Review promoted scientific naturalism over natural theology,[172][173] praising Darwin for \"extending the domination of Science over regions of thought into which she has, as yet, hardly penetrated\" and coining the term \"Darwinism\" as part of his efforts to secularise and professionalise science.[174] Huxley gained influence, and initiated the X Club, which used the journal Nature to promote evolution and naturalism, shaping much of late Victorian science. Later, the German morphologist Ernst Haeckel would convince Huxley that comparative anatomy and palaeontology could be used to reconstruct evolutionary genealogies.[171][175]",
			"color": " "
		}
	}
}
