{
	"add": {
		"doc": {
			"id": "96c77985df4641749bc8142c9761bdeba74c7c641242158f68ceb8077ddcd35d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Elizabethan_Fireplace%2C_Little_Moreton_Hall.jpg/170px-Elizabethan_Fireplace%2C_Little_Moreton_Hall.jpg",
				"previous": "Little Moreton Hall first appears in the historical record in 1271, but the present building dates from the early 16th century.[6][c] The north range is the earliest part of the house. Built between 1504 and 1508 for William Moreton (died 1526), it comprises the Great Hall and the northern part of the east wing.[14] A service wing to the west, built at the same time but subsequently replaced, gave the early house an H-shaped floor plan.[13] The east range was extended to the south in about 1508 to provide additional living quarters, as well as housing the Chapel and the Withdrawing Room.[14] In 1546 William Moreton's son, also called William (c. 1510–63), replaced the original west wing with a new range housing service rooms on the ground floor as well as a porch, gallery, and three interconnected rooms on the first floor, one of which had access to a garderobe.[8] In 1559 William had a new floor inserted at gallery level in the Great Hall,[d] and added the two large bay windows looking onto the courtyard, built so close to each other that their roofs abut one another.[15][16] The south wing was added in about 1560–62 by William Moreton II's son John (1541–98).[17] It includes the Gatehouse and a third storey containing a 68-foot (21 m) Long Gallery,[18] which appears to have been an afterthought added on after construction work had begun.[19] A small kitchen and Brew-house block was added to the south wing in about 1610, the last major extension to the house.[20]",
				"after": "The fortunes of the Moreton family declined during the English Civil War. As supporters of the Royalist cause, they found themselves isolated in a community of Parliamentarians.[21] Little Moreton Hall was requisitioned by the Parliamentarians in 1643 and used to billet Parliamentary soldiers. The family successfully petitioned for its restitution,[22] and survived the Civil War with their ownership of Little Moreton Hall intact, but financially they were crippled.[21] They tried to sell the entire estate, but could only dispose of several parcels of land. William Moreton died in 1654 leaving debts of £3,000–£4,000 (equivalent to about £12–16 million as of 2010[23][e]), which forced his heirs to remortgage what remained of the estate.[24] The family's fortunes never fully recovered, and by the late 1670s they no longer lived in Little Moreton Hall, renting it out instead to a series of tenant farmers. The Dale family took over the tenancy in 1841, and were still in residence more than 100 years later.[1] By 1847 most of the house was unoccupied, and the deconsecrated Chapel was being used as a coal cellar and storeroom.[25] Little Moreton Hall was in a ruinous condition; its windows were boarded up and its roof was rotten.[26]",
			"color": "dim|0.18163 gray|0.18163 dim|0.18163 grey|0.18163 slate|0.16631 gray|0.16631 light|0.15211 slate|0.15211 gray|0.15211 gray|0.090424 grey|0.090424 dark|0.090394 gray|0.090394 dark|0.090394 grey|0.090394 light|0.070655 steel|0.070655 blue|0.070655 black|0.056826 tan|0.051106 silver|0.021528 steel|0.014181 blue|0.014181 gainsboro|0.012312 light|0.011901 gray|0.011901 light|0.011901 grey|0.011901 burly|0.0089871 wood|0.0089871 light|0.0076427 blue|0.0076427 linen|0.0067715 white|0.0065873 smoke|0.0065873  "
		}
	}
}
