{
	"add": {
		"doc": {
			"id": "96d20f82422bfef3548ea592b988b4d430c4ec4e3c9f027af6f8bca8e61fc5f2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Herbert_Sutcliffe.jpg/170px-Herbert_Sutcliffe.jpg",
				"previous": "In the 1924 season, Yorkshire completed a hat-trick of championships[27] under Geoffrey Wilson and Sutcliffe enjoyed probably his best season to date, scoring 2,142 runs at 48.68 with 6 centuries including a highest score of 255 not out against Essex.[16] He made his Test debut on Saturday, 14 June 1924, playing for England against South Africa at Edgbaston and opening the innings with Jack Hobbs. In this First Test, which England won by an innings, they recorded their first century partnership for England by putting on 136 before Sutcliffe was out for 64.[28] In the Second Test at Lord's, Hobbs and Sutcliffe scored 268 before Sutcliffe was out for 122, his maiden Test century; Hobbs went on to make 211 and England again won by an innings.[29] In the whole series, Sutcliffe scored 303 runs at 75.75.[30]",
				"after": "As early as July, Sutcliffe was one of ten players named to tour Australia in the winter of 1924–25 under the leadership of Arthur Gilligan. At first, Hobbs declined the tour but then changed his mind when it was decided his wife would accompany him. The importance of this to Sutcliffe was that his partnership with Hobbs could continue at the very highest level of cricket where the presence of Hobbs was ultimately the key factor in Sutcliffe's major success on the tour, which established him as a world-class player.[31] Sutcliffe said he had some initial difficulty in adjusting to Australian conditions, specifically the strong light which affected his timing. He also reckoned that the pitches were a good four yards faster than in England. His remedy was to play straight and by hitting the ball back down the pitch. He said later that he sacrificed many of his best shots, but \"it paid off in the end\".[32] This is shown by his overall performance as, although England lost the series 4–1, Sutcliffe scored 734 runs in the five Tests at an average of 81.55 with 4 centuries, 2 half-centuries and a highest score of 176. In the whole tour, he scored 1,250 runs at 69.44 with 5 centuries and a highest score of 188.[33]",
			"color": " "
		}
	}
}
