{
	"add": {
		"doc": {
			"id": "96d7bc282a5dc47902968ca8f44837aaaff82d90417432f88aea9bf53889cbb6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/1997_Red_River_Flood_Grand_Forks.jpg/200px-1997_Red_River_Flood_Grand_Forks.jpg",
				"previous": "Prior to settlement by Europeans or Americans, the area where the city now sits – at the forks of the Red River and Red Lake River – had been an important meeting and trading point for Native Americans. Early French explorers, fur trappers, and traders called the area Les Grandes Fourches meaning \"The Grand Forks\". By the 1740s, Les Grandes Fourches was an important trading post for French fur trappers.[8] A U.S. post office was established on the site on June 15, 1870, and the name was changed to \"Grand Forks\".[8] Alexander Griggs, a steamboat captain, is regarded as \"The Father of Grand Forks\".[15] Griggs' steamboat froze in the Red River on a voyage in late 1870, forcing the captain and his crew to spend the winter camping at Grand Forks. Griggs platted the community in 1875 and Grand Forks was officially incorporated on February 22, 1881.[8] The city quickly grew after the arrival of the Great Northern Railway in 1880 and the Northern Pacific Railway in 1887.[16] In 1883, the University of North Dakota was established, six years before North Dakota was formally recognized as an independent state born from the Dakota Territory.[11] The first half of the 20th century saw steady growth and the development of new neighborhoods farther south and west of Downtown Grand Forks. The 1920s saw the construction of the state-owned North Dakota Mill and Elevator on the north side of the city.[17] In 1954, Grand Forks was chosen as the site for an Air Force base.[18] Grand Forks Air Force Base brought thousands of new jobs and residents to the community. The military base and the University of North Dakota would become integral pieces of the city's economy. The second half of the 20th century saw Grand Forks spreading further away from the older part of town.[8] Interstate 29 was built on the western side of the city and two enclosed shopping malls – South Forks Plaza and Columbia Mall – were built on the south side.[19]",
				"after": "The city was struck by a severe flood in 1997, causing extensive damage. With Fargo upstream from the bulk of the waters and Winnipeg with its flood control structures, Grand Forks became the hardest hit city in the Red River Valley. During the height of the flooding, a major fire also destroyed eleven buildings in the downtown area. Many neighborhoods had to be demolished to make way for a new levee system, which was ultimately completed ten years later. The land bordering the Red River was turned into a massive park known as the Greater Grand Forks Greenway. Since the flood, Grand Forks has seen both public and private developments throughout town. Two new, large sports venues opened in 2001, including the Alerus Center[12] and the Ralph Engelstad Arena.[13] In 2007, the Winnipeg-based Canad Inns hotel chain opened a 13-story hotel and waterpark adjacent to the Alerus Center.[20] By 2007 Grand Forks had a larger population than it did before the 1997 flood, and area employment and taxable sales had also surpassed pre-flood levels.[21]",
			"color": "black|0.38891 tan|0.1375 dim|0.034264 gray|0.034264 dim|0.034264 grey|0.034264 dark|0.028375 gray|0.028375 dark|0.028375 grey|0.028375 gray|0.026753 grey|0.026753 antique|0.025195 white|0.025195 silver|0.024728  "
		}
	}
}
