{
	"add": {
		"doc": {
			"id": "96d9ca56e0cc5270a636183c0e3a9c9b4b8f4e564a8e2b0abe8d41d063ce4d24",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Phascolarctos_cinereus_peau_de_koala.jpg/220px-Phascolarctos_cinereus_peau_de_koala.jpg",
				"previous": "In 2008, the International Union for Conservation of Nature listed the koala under Least Concern for the following reasons: \"Its wide distribution, presumed large population, and because it is unlikely to be declining at nearly the rate required to qualify for listing in a threatened category.\"[1] Australian policy makers declined a 2009 proposal to include the koala in the Environment Protection and Biodiversity Conservation Act 1999.[19] In 2012, the Australian Government listed koala populations in Queensland and New South Wales as Vulnerable, because of a 40% population decline in the former and a 33% decline in the latter. Populations in Victoria and South Australia appear to be abundant; however, the Australian Koala Foundation argues that the exclusion of Victorian populations from protective measures is based on a misconception that the total koala population is 200,000, whereas they believe it is probably less than 100,000.[143]",
				"after": "Koalas were hunted for food by Aboriginals. A common technique used to capture the animals was to attach a loop of ropey bark to the end of a long, thin pole, so as to form a noose. This would be used to snare an animal high in a tree, beyond the reach of a climbing hunter; an animal brought down this way would then be killed with a stone hand axe or hunting stick (waddy).[144] According to the customs of some tribes, it was considered taboo to skin the animal, while other tribes thought the animal's head had a special status, and saved them for burial.[145]",
			"color": "dark|0.1576 gray|0.1576 dark|0.1576 grey|0.1576 rosy|0.15201 brown|0.15201 gray|0.14004 grey|0.14004 silver|0.11901 antique|0.084355 white|0.084355 light|0.06233 gray|0.06233 light|0.06233 grey|0.06233 dim|0.056875 gray|0.056875 dim|0.056875 grey|0.056875 gainsboro|0.032643 papaya|0.029271 whip|0.029271 linen|0.024943 beige|0.023614 old|0.020068 lace|0.020068 blanched|0.018968 almond|0.018968  "
		}
	}
}
