{
	"add": {
		"doc": {
			"id": "96f81d7373acfe5010c8652f152a2b75dce91605ba06742fa32fe24187aab5d6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Virgin_atlantic_b747-400_g-vgal_manchester_arp.jpg/220px-Virgin_atlantic_b747-400_g-vgal_manchester_arp.jpg",
			"previous": [],
				"after": "The RSPCA is on the A24 in Southwater, south of Horsham. Campina UK is in Horsham. Cats Protection is at the National Cat Centre on the A275 in Danehill in the Ashdown Forest. Roche Diagnostics' UK headquarters and CAE Inc. UK are in the Victoria Business Park in the west of Burgess Hill. Rolls-Royce Motor Cars make vehicles at Westhampnett off the A27. Vie at Home is at Tangmere. Southern Water is on the A2032 in Durrington, Worthing. Virgin Atlantic is off the A23 on the Manor Royal Ind Estate in the north of Crawley, as is Edwards (former BOC Edwards), an international engineering company that makes vacuum pumps, with another plant on the A259 in Kingston by Sea, Shoreham. Also on Manor Royal are the headquarters of Spirent, G4S, Doosan Babcock Energy, Air Miles (now called Avios since November 2011), Pilz UK and TUI Travel PLC with TUI Airline Management (the fifth largest European air carrier). Colas Ltd (road engineering) is in Worth, east of Crawley. The Caravan Club is in East Grinstead. The Body Shop is at the A259/B2187 roundabout in Toddington, Littlehampton. Palmer and Harvey is in Hove. American Express UK is in Brighton. Jones Bootmaker head office is based in Eastbourne. Smith & Ouzman, a security printing company off the A22/A2290 roundabout prints exam papers, ballot papers and examination certificates; it printed the UK's driving licences until 2001. To the north, Metro Drinks are in Arlington. Servomex, a gas analysis company, is based Crowborough. Ricardo plc, the engineering consultancy, is on the A27 next to Shoreham Airport and River Adur. Merrydown cider was formerly made in Horam until 2004, when it was bought by SHS Group of Belfast.",
			"color": "light|0.51753 slate|0.51753 gray|0.51753 slate|0.16919 gray|0.16919 black|0.037081 light|0.027326 gray|0.027326 light|0.027326 grey|0.027326 gainsboro|0.026597 dark|0.023927 gray|0.023927 dark|0.023927 grey|0.023927 silver|0.01993 light|0.015691 steel|0.015691 blue|0.015691 white|0.014197 smoke|0.014197 dim|0.013115 gray|0.013115 dim|0.013115 grey|0.013115 firebrick|0.012581 brown|0.012363 linen|0.010954 sea|0.0095484 shell|0.0095484 snow|0.0086788 alice|0.0080689 blue|0.0080689 gray|0.0078331 grey|0.0078331 ghost|0.0076202 white|0.0076202 floral|0.0069848 white|0.0069848 mint|0.0062446 cream|0.0062446 white|0.0059257 lavender|0.0053328 blush|0.0053328 lavender|0.0044651  "
		}
	}
}
