{
	"add": {
		"doc": {
			"id": "9731a6c6d0e7ded42b47a2eae0d12edd615a8d9f2017347bd2199d125e2bae32",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Londoncnut.jpg/240px-Londoncnut.jpg",
				"previous": "The reign of King Æthelred the Unready witnessed the resumption of Viking raids on England, putting the country and its leadership under strains as severe as they were long sustained. Raids began on a relatively small scale in the 980s, but became far more serious in the 990s, and brought the people to their knees in 1009-12, when a large part of the country was devastated by the army of Thorkell the Tall. It remained for Swein Forkbeard, king of Denmark, to conquer the kingdom of England in 1013–14, and (after Æthelred's restoration) for his son Cnut to achieve the same in 1015–16. The tale of these years incorporated in the Anglo-Saxon Chronicle must be read in its own right,[93] and set beside other material which reflects in one way or another on the conduct of government and warfare during Æthelred's reign.[94] It is this evidence which the basis for Simon Keynes's view that the king lacked the strength, judgement and resolve to give adequate leadership to his people in a time of grave national crisis; who soon found out that he could rely on little but the treachery of his military commanders; and who throughout his reign tasted nothing but the ignominy of defeat. The raids exposed tensions and weaknesses which went deep into the fabric of the late Anglo-Saxon state; and it is apparent that events proceeded against a background more complex than the chronicler probably knew. It seems, for example, that the death of Bishop Æthelwold in 984 had precipitated further reaction against certain ecclesiastical interests; that by 993 the king had come to regret the error of his ways, leading to a period when the internal affairs of the kingdom appear to have prospered.[95]",
				"after": "The increasingly difficult times brought on by the Viking attacks are reflected in both Ælfric's and Wulfstan's works, but most notably in Wulfstan's fierce rhetoric in the Sermo Lupi ad Anglos, dated to 1014.[96] Malcolm Godden suggests that ordinary people saw the return of the Vikings, as the imminent \"expectation of the apocalypse\", and this was given voice in Ælfric and Wulfstan writings,[97] which is similar to that of Gildas and Bede. Raids were signs of God punishing his people, Ælfric refers to people adopting the customs of the Danish and exhorts people not to abandon the native customs on behalf of the Danish ones, and then requests a 'brother Edward', to try to put an end to a 'shameful habit' of drinking and eating in the outhouse, which some of the countrywomen practiced at beer parties.[98]",
			"color": "gray|0.3009 grey|0.3009 dim|0.25324 gray|0.25324 dim|0.25324 grey|0.25324 dark|0.18708 gray|0.18708 dark|0.18708 grey|0.18708 silver|0.079116 light|0.041418 gray|0.041418 light|0.041418 grey|0.041418 gainsboro|0.026542 linen|0.0142 antique|0.013271 white|0.013271 old|0.011016 lace|0.011016 sea|0.0092041 shell|0.0092041 floral|0.0087533 white|0.0087533 ivory|0.0073211 beige|0.0070938 white|0.0066043 smoke|0.0066043 black|0.0065895 mint|0.0051608 cream|0.0051608 snow|0.0044384 honeydew|0.0043476  "
		}
	}
}
