{
	"add": {
		"doc": {
			"id": "973aa7b8665638a2e7dcd0275f854d6ba1af8ef53f51528e42509e1522eaa0fe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Mackinac_Island_forest%2C_July_2014.jpg/220px-Mackinac_Island_forest%2C_July_2014.jpg",
				"previous": "As the Great Lakes assumed their present levels, the waterfall was inundated and Mackinac Island took on its current size.[5] The steep cliffs were one of the primary reasons for the British army's choice of the island for a fortification; their decision differed from that of the French army, which had built Fort Michilimackinac about 1715 near present-day Mackinaw City. The limestone formations are still part of the island's appeal. However, tourists are attracted by the natural beauty rather than the strategic value. One of the most popular geologic formations is Arch Rock, a natural limestone arch, 146 feet (45 m) above the ground.[6] Other popular geologic formations include Devil's Kitchen, Skull Cave, and Sugar Loaf.[7]",
				"after": "Mackinac Island contains a wide variety of terrain, including fields, marshes, bogs, coastline, boreal forest, and limestone formations. The environment is legally preserved on the island by the State Historic Park designation. About half of the shoreline and adjacent waters off Mackinac Island, including the harbor (Haldimand Bay) and the southern and western shore from Mission Point to Pointe aux Pins, is protected as part of the Straits of Mackinac Shipwreck Preserve, a state marine park.[40] As it is separated from the mainland by 3 miles (4.8 km) of water, few large mammals inhabit the island, except those that traverse the ice during the winter months. Rabbits, fox, raccoons, otters, mink, gray and red squirrels, and chipmunks are all common as is the occasional beaver and coyote.[41] Bats are the most abundant migratory mammals as crossing the water is no obstacle for them. There are many limestone caves serving as homes for the bats and many insects on the island for the bat to prey on. The island is frequented by migratory birds on their trips between their summer and winter habitats. Eagles and hawks are abundant in April and May, while smaller birds such as yellow warblers, American redstart, and indigo bunting are more common in early summer. Near the shoreline, gulls, herons, geese, and loons are common. Owls, including snowy owls and great grey owls, come to the island from the Arctic to hunt in the warmer climate. Other birds, such as chickadees, cardinals, blue jays, and woodpeckers, live on the island year-round. Toads have also been found.[42]",
			"color": "dim|0.3395 gray|0.3395 dim|0.3395 grey|0.3395 gray|0.32938 grey|0.32938 dark|0.12426 gray|0.12426 dark|0.12426 grey|0.12426 dark|0.082255 olive|0.082255 green|0.082255 silver|0.026989 black|0.017798 dark|0.013934 sea|0.013934 green|0.013934 rosy|0.01329 brown|0.01329  "
		}
	}
}
