{
	"add": {
		"doc": {
			"id": "973a4162f4fd22c140276ab5b4da1bd26dda8d3ddfd6ca455015e17cdae600fe",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Pieter_Bruegel_the_Elder_-_Hunters_in_the_Snow_%28Winter%29_-_Google_Art_Project.jpg/350px-Pieter_Bruegel_the_Elder_-_Hunters_in_the_Snow_%28Winter%29_-_Google_Art_Project.jpg",
				"previous": "By the 16th century the iconographic innovations and painterly techniques developed by van Eyck had become standard throughout northern Europe. Albrecht Dürer emulated van Eyck's precision.[39] Painters enjoyed a new level of respect and status; patrons no longer simply commissioned works but courted the artists, sponsoring their travel and exposing them to new and wide-ranging influences. Hieronymus Bosch, active in the late 15th and early 16th centuries, remains one of the most important and popular of the Netherlandish painters.[40] He was anomalous in that he largely forewent realistic depictions of nature, human existence and perspective, while his work is almost entirely free of Italian influences. His better-known works are instead characterised by fantastical elements that tend towards the hallucinatory, drawing to some extent from the vision of hell in van Eyck's Crucifixion and Last Judgement diptych. Bosch followed his own muse, tending instead towards moralism and pessimism. His paintings, especially the triptychs, are among the most significant and accomplished of the late Netherlandish period[40][41]",
				"after": "The Reformation brought changes in outlook and artistic expression as secular and landscape imagery overtook biblical scenes. Sacred imagery was shown in a didactic and moralistic manner, with religious figures becoming marginalized and relegated to the background.[42] Pieter Bruegel the Elder, one of the few who followed Bosch's style, is an important bridge between the Early Netherlandish artists and their successors. His work retains many 15th-century conventions, but his perspective and subjects are distinctly modern. Sweeping landscapes came to the fore in paintings that were provisionally religious or mythological, and his genre scenes were complex, with overtones of religious skepticism and even hints of nationalism.[42][43]",
			"color": "black|0.24592 antique|0.11007 white|0.11007 blanched|0.076872 almond|0.076872 papaya|0.07468 whip|0.07468 bisque|0.06184 beige|0.053949 tan|0.047151 corn|0.044208 silk|0.044208 wheat|0.040319 old|0.034038 lace|0.034038 linen|0.0258 dim|0.021632 gray|0.021632 dim|0.021632 grey|0.021632 light|0.020429 yellow|0.020429 silver|0.014742 gray|0.014421 grey|0.014421 light|0.013701 golden|0.013701 rod|0.013701 yellow|0.013701 ivory|0.011902 dark|0.01173 gray|0.01173 dark|0.01173 grey|0.01173 light|0.011411 gray|0.011411 light|0.011411 grey|0.011411 floral|0.0098647 white|0.0098647 lemon|0.0069058 chiffon|0.0069058 saddle|0.0068496 brown|0.0068496 gainsboro|0.0066679  "
		}
	}
}
