{
	"add": {
		"doc": {
			"id": "975b62731497b2819fbdd2f3e5c71501413ff8149b03cbacd373de2a8995d191",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Norton_Priory_Undercroft.jpg/220px-Norton_Priory_Undercroft.jpg",
				"previous": "The excavations have revealed information about the original priory buildings and grounds, and how they were subsequently modified.[62] A series of ditches was found that would have provided a supply of fresh water and also a means for drainage of a relatively wet site.[63] Evidence of the earliest temporary timber buildings in which the canons were originally housed was found in the form of 12th-century post pits. Norton Priory is one of few monastic sites to have produced evidence of temporary quarters.[64] The remains of at least seven temporary buildings have been discovered. It is considered that the largest of these, because it had more substantial foundations than the others, was probably the timber-framed church; another was most likely the gatehouse, and the other buildings provided accommodation for the canons and the senior secular craftsmen.[65]",
				"after": "The earliest masonry building was the church, which was constructed on shallow foundations of sandstone rubble and pebbles on boulder clay. The walls were built in local red sandstone with ashlar faces and a rubble and mortar core.[66] The ground plan of the original church was cruciform, and consisted of a nave without aisles, a choir at the crossing with a tower above it, a square-ended chancel, and north and south transepts, each with an eastern chapel. The total length of the church was 148 feet (45.1 m) and the total length across the transepts was 74 feet (22.6 m), giving a ratio of 2:1. The walls of the church were 5 feet (1.5 m) wide at the base, and the crossing tower was supported on four piers.[67][68]",
			"color": "black|0.12068 dark|0.11574 gray|0.11574 dark|0.11574 grey|0.11574 dim|0.097257 gray|0.097257 dim|0.097257 grey|0.097257 gray|0.083958 grey|0.083958 rosy|0.064001 brown|0.064001 silver|0.061949 light|0.057831 steel|0.057831 blue|0.057831 light|0.042118 slate|0.042118 gray|0.042118 slate|0.039809 gray|0.039809 light|0.037263 blue|0.037263 light|0.034221 gray|0.034221 light|0.034221 grey|0.034221 misty|0.029437 rose|0.029437 gainsboro|0.027172 lavender|0.011502 antique|0.010861 white|0.010861 tan|0.010586 alice|0.01043 blue|0.01043 powder|0.010203 blue|0.010203 linen|0.0097951 white|0.0095887 smoke|0.0095887 sea|0.0075 shell|0.0075 ghost|0.0069812 white|0.0069812 peach|0.0069497 puff|0.0069497 lavender|0.0068004 blush|0.0068004 light|0.0066107 cyan|0.0066107 azure|0.006216 snow|0.0061727  "
		}
	}
}
