{
	"add": {
		"doc": {
			"id": "976adacddf25d6acde9506408cfee792cbb27b5881e94e230289ead1923983fc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Mitsubishi_Zero-Yasukuni.jpg/220px-Mitsubishi_Zero-Yasukuni.jpg",
				"previous": "World War II featured fighter combat on a larger scale than any other conflict to date. German Field Marshal Erwin Rommel noted the effect of airpower: \"Anyone who has to fight, even with the most modern weapons, against an enemy in complete command of the air, fights like a savage against modern European troops, under the same handicaps and with the same chances of success.\" Throughout the war, fighters performed their conventional role in establishing air superiority through combat with other fighters and through bomber interception, and many fighters were also pressed into service in additional roles such as tactical air support and reconnaissance.",
				"after": "The approach of different belligerents to fighter design varied widely, with the Japanese and Italians favoring lightly armed and armored but highly maneuverable designs such as the Japanese Nakajima Ki-27, Nakajima Ki-43 and Mitsubishi A6M Zero and Italy's Fiat G.50 and Macchi MC.200. In contrast, designers in Great Britain, Germany, the Soviet Union, and the United States believed that due to the increasing speed of fighter aircraft, the twisting and maneuvering typical of World War I dogfights would create g-forces unbearable to pilots. These nations' fighters instead were optimized for speed and firepower to allow pilots to quickly engage, dispatch and disengage with opposing aircraft. While light, highly maneuverable aircraft did have some advantages in fighter-versus-fighter combat, those could usually be overcome by sound tactical doctrine, and the design approach of the Italians and Japanese made their planes ill-suited as interceptors or attack aircraft.",
			"color": "dim|0.2798 gray|0.2798 dim|0.2798 grey|0.2798 gray|0.27572 grey|0.27572 dark|0.2187 gray|0.2187 dark|0.2187 grey|0.2187 black|0.10655 dark|0.063931 slate|0.063931 gray|0.063931 silver|0.015508 pale|0.0098357 golden|0.0098357 rod|0.0098357  "
		}
	}
}
