{
	"add": {
		"doc": {
			"id": "97775e5b7b5c9f452ff38b471a9eba7feaf07e3f39a4a4328c97821655e2ab8e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/The_trial_of_the_anarchists_in_Chicago.jpg/220px-The_trial_of_the_anarchists_in_Chicago.jpg",
			"previous": [],
				"after": "The trial, Illinois vs. August Spies et al., began on June 21, 1886, and went on until August 11,. The trial was conducted in an atmosphere of extreme prejudice by both public and media toward the defendants.[57] It was presided over by Judge Joseph Gary. Judge Gary displayed open hostility to the defendants, consistently ruled for the prosecution, and failed to maintain decorum. A motion to try the defendants separately was denied.[58] The defense counsel included Sigmund Zeisler, William Perkins Black, William Foster, and Moses Salomon. Selection of the jury was extraordinarily difficult, lasting three weeks, and nearly one thousand people called. All union members and anyone who expressed sympathy toward socialism were dismissed. In the end a jury of 12 was seated, most of whom confessed prejudice towards the defendants. Despite their professions of prejudice Judge Gary seated those who declared that despite their prejudices they would acquit if the evidence supported it, refusing to dismiss for prejudice. Eventually the peremptory challenges of the defense were exhausted. Frustrated by the hundreds of jurors who were being dismissed, a bailiff was appointed who selected jurors rather than calling them at random. The bailiff proved prejudiced himself and selected jurors who seemed likely to convict based on their social position and attitudes toward the defendants.[58] The prosecution, led by Julius Grinnell, argued that since the defendants had not actively discouraged the person who had thrown the bomb, they were therefore equally responsible as conspirators.[59] The jury heard the testimony of 118 people, including 54 members of the Chicago Police Department and the defendants Fielden, Schwab, Spies and Parsons. Albert Parsons' brother claimed there was evidence linking the Pinkertons to the bomb. This reflected a widespread belief among the strikers.[50]",
			"color": "dim|0.50246 gray|0.50246 dim|0.50246 grey|0.50246 gray|0.20057 grey|0.20057 dark|0.068635 gray|0.068635 dark|0.068635 grey|0.068635  "
		}
	}
}
