{
	"add": {
		"doc": {
			"id": "97799f5d9841a382ba70d5e17d3abb09ba949e92577e72baa0969d4916858c1b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Reduction_Gear.jpg/220px-Reduction_Gear.jpg",
				"previous": "Design innovations included keeping the power turbine and propeller shaft sections independent, connecting them with a fluid coupling analogous to an automotive torque converter.[6] The igniter starts only the gas generator, making the engine easy to start, particularly in cold weather.[6] The engine consists of two sections that can be easily separated for maintenance.[6] In the gas-generator section air enters through an inlet screen into the low-pressure axial compressor. This has three stages on small and medium versions of the engine and four stages on large versions. The air then flows into a single-stage centrifugal compressor, through the annular reverse-flow combustion chamber, and finally through a single-stage compressor turbine that powers the compressors at about 45,000 rpm. The hot gas from the gas generator section then flows into a separate power section of the engine, containing a single-stage power turbine driving the power take-off system at about 30,000 rpm. For turboprop use, this powers a two-stage planetary output reduction gearbox, which turns the propeller at a speed of 1,900 to 2,200 rpm. The exhaust gas then escapes through two side mounted ducts in the power turbine housing. The engine is arranged such that the power turbines are mounted inside the combustion chamber, reducing overall length.",
				"after": "In most aircraft installations the PT6 is mounted backwards in the nacelle, so that the intake side of the engine is facing the rear of the aircraft. This places the power section at the front of the nacelle, where it can drive the propeller directly without the need for a long shaft. Intake air is usually fed to the engine via an underside mounted duct, and the two exhaust outlets are directed rearward. This arrangement also aids maintenance by allowing the entire power section to be removed along with the propeller, exposing the gas-generator section. It also allows rough-field operations with foreign objects slung outside and around the turbine intake by internal separators in the inlet.[7]",
			"color": "burly|0.089744 wood|0.089744 rosy|0.083916 brown|0.083916 wheat|0.06849 navajo|0.064569 white|0.064569 dark|0.059441 salmon|0.059441 khaki|0.045455 dark|0.041958 khaki|0.041958 pale|0.041259 golden|0.041259 rod|0.041259 peach|0.04016 puff|0.04016 moccasin|0.038187 light|0.036547 gray|0.036547 light|0.036547 grey|0.036547 tan|0.034382 thistle|0.027972 silver|0.026807 gainsboro|0.026057 medium|0.024476 purple|0.024476 light|0.020979 steel|0.020979 blue|0.020979 lavender|0.019522 bisque|0.016878 misty|0.014819 rose|0.014819 olive|0.013986 dark|0.013986 gray|0.013986 dark|0.013986 grey|0.013986 lemon|0.012149 chiffon|0.012149 light|0.0114 golden|0.0114 rod|0.0114 yellow|0.0114 light|0.01049 salmon|0.01049 antique|0.010367 white|0.010367 blanched|0.0099595 almond|0.0099595 papaya|0.0094933 whip|0.0094933 light|0.0083028 yellow|0.0083028 linen|0.0081918 corn|0.0078449 silk|0.0078449 light|0.006993 cyan|0.006993 medium|0.006993 slate|0.006993 blue|0.006993  "
		}
	}
}
