{
	"add": {
		"doc": {
			"id": "979bb47b293915f1812230609bfaa16d769ee98cbbaa1648b9a978fbdf2dc766",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Samochod_%28GAZ%29_Lublin-51.jpg/190px-Samochod_%28GAZ%29_Lublin-51.jpg",
				"previous": "In 1951, Adjutant-Chief Vandenberghe from the 6th Colonial Infantry Regiment (6e RIC) created the \"Commando Vanden\" (aka \"Black Tigers\", aka \"North Vietnam Commando #24\") based in Nam Định. Recruits were volunteers from the Thổ people, Nùng people and Miao people. This commando unit wore Viet Minh black uniforms to confuse the enemy and used techniques of the experienced Bo doi (Bộ đội, regular army) and Du Kich (guerrilla unit). Viet Minh prisoners were recruited in POW camps. The commando was awarded the Croix de guerre des TOE with palm in July 1951; however, Vandenberghe was betrayed by a Viet Minh recruit, commander Nguien Tinh Khoi (308th Division's 56th Regiment), who assassinated him (and his Vietnamese fiancee) with external help on the night of January 5, 1952.[69][70][71] Coolies and POWs known as PIM (Prisonniers Internés Militaires, which is basically the same as POW) were civilians used by the army as logistical support personnel. During the battle of Dien Bien Phu, coolies were in charge of burying the corpses—during the first days only, after they were abandoned, hence giving off a terrible smell, according to veterans—and they had the dangerous job of gathering supply packets delivered in drop zones while the Viet Minh artillery was firing hard to destroy the crates. The Viet Minh also used thousands of coolies to carry the Chu-Luc (regional units) supplies and ammunition during assaults. The PIM were civilian males old enough to join Bảo Đại's army. They were captured in enemy-controlled villages, and those who refused to join the State of Vietnam's army were considered prisoners or used as coolies to support a given regiment.[72]",
				"after": "One point that the French had a major problem with was the concept of sanctuary. As long as the revolutionaries who are fighting a guerilla war have a sanctuary, in which they can hide out, recoup after losses, and store supplies, it is almost impossible for any foreign enemy to ever destroy them.[citation needed] In the early 1950s, southern China was used as a sanctuary by Viet Minh guerrillas. Several hit and run ambushes were successfully operated against French Union convoys along the neighboring Route Coloniale 4 (RC 4), which was a major supply way in Tonkin (northern Vietnam). One of the most famous attacks of this kind was the battle of Cao Bằng. China supplied the Viet Minh guerrillas with food (thousands of tons of rice), money, medics, arms, ammunition, artillery (24 guns were used at Dien Bien Phu) and other military equipment including a large part of material captured from Chiang Kai-shek's National Revolutionary Army during the Chinese Civil War. Evidences of the Chinese secret aid were found in caves during Operation Hirondelle in July 1953.[73][74] 2,000 Chinese and Soviet Union military advisors trained the Viet Minh guerrilla force to turn it into a full range army.[48] On top of this China sent two artillery battalions at the siege of Dien Bien Phu on May 6, 1954. One operated 12 x 6 Katyusha rockets[75] China and the Soviet Union were the first nations to recognize North Vietnam.",
			"color": "black|0.38291 dark|0.20233 slate|0.20233 gray|0.20233 dim|0.098896 gray|0.098896 dim|0.098896 grey|0.098896 cadet|0.056071 blue|0.056071 gray|0.044364 grey|0.044364 slate|0.029661 gray|0.029661 light|0.027381 slate|0.027381 gray|0.027381 steel|0.025032 blue|0.025032 teal|0.024543 dark|0.02227 olive|0.02227 green|0.02227 dark|0.022184 gray|0.022184 dark|0.022184 grey|0.022184 light|0.0092145 sky|0.0092145 blue|0.0092145 silver|0.0090563  "
		}
	}
}
