{
	"add": {
		"doc": {
			"id": "97add48da14169cd0d18767b2d5fc5d8f25217fded9304f2853c97ea85b60a70",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Albert_Victor_late_1880s.jpg/170px-Albert_Victor_late_1880s.jpg",
				"previous": "In 1970, British surgeon Thomas E. A. Stowell published an article entitled \"Jack the Ripper – A Solution?\" in the November issue of The Criminologist. In the article, Stowell proposed that the Ripper was an aristocrat who had contracted syphilis during a visit to the West Indies, that it had driven him insane, and that in this state of mind he had perpetrated the five canonical Jack the Ripper murders.[7] Although Stowell did not directly name his suspect in the article, he described in detail the suspect's family and his physical appearance and nicknames, all of which pointed to Queen Victoria's grandson, Prince Albert Victor, Duke of Clarence and Avondale.[8][9] Stowell wrote that following a double murder on 30 September 1888, his suspect was restrained by his own family in an institution in the south of England, but later escaped to commit a final murder on 9 November before ultimately dying of syphilis. To back up his theory, Stowell drew comparisons between the evisceration of the women and the disembowelment of deer shot by the aristocracy on their estates.[7] Stowell said his information came from the private notes of Sir William Gull, a reputable physician who had treated members of the royal family.[7] Stowell knew Gull's son-in-law, Theodore Dyke Acland, and was an executor of Acland's estate.[10]",
			"after": [],
			"color": "dark|0.22942 gray|0.22942 dark|0.22942 grey|0.22942 silver|0.19431 light|0.12888 gray|0.12888 light|0.12888 grey|0.12888 gainsboro|0.10331 gray|0.076321 grey|0.076321 white|0.036443 smoke|0.036443 lavender|0.027363 blush|0.027363 alice|0.027202 blue|0.027202 ghost|0.026704 white|0.026704 snow|0.023055 dim|0.021327 gray|0.021327 dim|0.021327 grey|0.021327 sea|0.020947 shell|0.020947 white|0.020844 azure|0.017557 mint|0.016193 cream|0.016193 lavender|0.013479 floral|0.010628 white|0.010628 linen|0.0051311  "
		}
	}
}
