{
	"add": {
		"doc": {
			"id": "97aeba2d8dfc02900aeb9b8700725f89821bb291cc3a355c437da8c5c7dab2b3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Teton_Range_from_the_west_1872.jpg/170px-Teton_Range_from_the_west_1872.jpg",
				"previous": "Formed in the mid-1820s, the Rocky Mountain Fur Company partnership included Jedediah Smith, William Sublette and David Edward Jackson or \"Davey Jackson\". Jackson oversaw the trapping operations in the Teton region between 1826 and 1830. Sublette named the valley east of the Teton Range \"Jackson's Hole\" (later simply Jackson Hole) for Davey Jackson.[13][17] As the demand for beaver fur declined and the various regions of the American West became depleted of beaver due to over trapping, American fur trading companies folded; however, individual mountain men continued to trap beaver in the region until about 1840.[13] From the mid-1840s until 1860, Jackson Hole and the Teton Range were generally devoid of all but the small populations of Native American tribes that had already been there. Most overland human migration routes such as the Oregon and Mormon Trails crossed over South Pass, well to the south of the Teton Range, and Caucasian influence in the Teton region was minimal until the U.S. Government commenced organized explorations.[13]",
				"after": "The first U.S. Government sponsored expedition to enter Jackson Hole was the 1859–60 Raynolds Expedition. Led by U.S. Army Captain William F. Raynolds and guided by mountain man Jim Bridger, it included naturalist F. V. Hayden, who later led other expeditions to the region.[18] The expedition had been charged with exploring the Yellowstone region, but encountered difficulties crossing mountain passes due to snow. Bridger ended up guiding the expedition south over Union Pass then following the Gros Ventre River drainage to the Snake River and leaving the region over Teton Pass.[19] Organized exploration of the region was halted during the American Civil War but resumed when F. V. Hayden led the well-funded Hayden Geological Survey of 1871. In 1872, Hayden oversaw explorations in Yellowstone, while a branch of his expedition known as the Snake River Division was led by James Stevenson and explored the Teton region. Along with Stevenson was photographer William Henry Jackson who took the first photographs of the Teton Range.[9] The Hayden Geological Survey named many of the mountains and lakes in the region.[20] The explorations by early mountain men and subsequent expeditions failed to identify any sources of economically viable mineral wealth. Nevertheless, small groups of prospectors set up claims and mining operations on several of the creeks and rivers. By 1900 all organized efforts to retrieve minerals had been abandoned.[21] Though the Teton Range was never permanently inhabited, pioneers began settling the Jackson Hole valley to the east of the range in 1884.[22] These earliest homesteaders were mostly single men who endured long winters, short growing seasons and rocky soils that were hard to cultivate. The region was mostly suited for the cultivation of hay and cattle ranching. By 1890, Jackson Hole had an estimated permanent population of 60.[23] Menor's Ferry was built in 1892 near present day Moose, Wyoming to provide access for wagons to the west side of the Snake River.[24] Ranching increased significantly from 1900 to 1920, but a series of agricultural related economic downturns in the early 1920s left many ranchers destitute.[25] Beginning in the 1920s, the automobile provided faster and easier access to areas of natural beauty and old military roads into Jackson Hole over Teton and Togwotee Passes were improved to accommodate the increased vehicle traffic. In response to the increased tourism, dude ranches were established, some new and some from existing cattle ranches, so urbanized travelers could experience the life of a cattleman.[26]",
			"color": " "
		}
	}
}
