{
	"add": {
		"doc": {
			"id": "97c3f32dd09f44bd271dae0fdbbe0686486717f609f386c8523e5bc631554c82",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Churchill_Downs_1901.jpg/300px-Churchill_Downs_1901.jpg",
				"previous": "Thoroughbred owners began sending their successful Derby horses to compete a few weeks later in the Preakness Stakes at the Pimlico Race Course, in Baltimore, Maryland, followed by the Belmont Stakes in Elmont, New York. The three races offered the largest purse and in 1919 Sir Barton became the first horse to win all three races. However, the term Triple Crown didn't come into use for another eleven years. In 1930, when Gallant Fox became the second horse to win all three races, sportswriter Charles Hatton brought the phrase into American usage. Fueled by the media, public interest in the possibility of a \"superhorse\" that could win the Triple Crown began in the weeks leading up to the derby. Two years after the term was coined, the race, which had been run in mid-May since inception, was changed to the first Saturday in May to allow for a specific schedule for the Triple Crown races. Since 1931, the order of Triple Crown races has been the Kentucky Derby first, followed by the Preakness Stakes and then the Belmont Stakes. Prior to 1931, eleven times the Preakness was run before the Derby. On May 12, 1917 and again on May 13, 1922, the Preakness and the Derby were run on the same day. On eleven occasions the Belmont Stakes was run before the Preakness Stakes.",
				"after": "On May 16, 1925, the first live radio broadcast of the Kentucky Derby was originated by WHAS and was also carried by WGN in Chicago.[10] On May 7, 1949, the first television coverage of the Kentucky Derby took place, produced by WAVE TV, the NBC affiliate in Louisville. This coverage was aired live in the Louisville market and sent to NBC as a kinescope newsreel recording for national broadcast. This broadcast was the first time Zoomar lenses were used on a broadcast TV sports show. On May 3, 1952, the first national television coverage of the Kentucky Derby took place, aired from then-CBS affiliate WHAS-TV.[11] In 1954, the purse exceeded $100,000 for the first time. In 1968 Dancer's Image became the first (and to this day the only) horse to win the race and then be disqualified after traces of phenylbutazone, an analgesic and anti-inflammatory drug, were found in the horse's urinalysis; Forward Pass won after a protracted legal battle by the owners of Dancer's Image (which they lost). Forward Pass thus became the Eighth winner for Calumet Farm. Unexpectedly, the regulations at Kentucky thoroughbred race tracks were changed some years later, allowing horses to run on phenylbutazone. In 1970 Diane Crump became the first female jockey to ride in the Derby, finishing 15th aboard Fathom.",
			"color": " "
		}
	}
}
