{
	"add": {
		"doc": {
			"id": "97c83173c00b00427ed5c20444cc7d7871d7593cd63dbe9da98ca3aab799b974",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Spanish_American_difficulty.jpg/170px-Spanish_American_difficulty.jpg",
				"previous": "The Mint prepared pattern coins with a much smaller eagle in 1858, which struck well, but which officials disliked.[29] Snowden directed Longacre to prepare various patterns that he could select from for a new piece to replace the Flying Eagle cent as of January 1, 1859. The Mint produced between 60 and 100 sets of twelve patterns showing various designs; these were circulated to officials and also were quietly sold by the Mint over the next several years. Longacre's design showing Liberty wearing an Indian-style headress was adopted, with a wreath with lower relief for the reverse of the Indian Head cent, solving the metal flow issues.[32] On November 4, 1858, Snowden wrote to the Treasury Department, stating that the Flying Eagle cent had proved \"not very acceptable to the general population\" as they felt the bird was not true to life, and that the Native American design would \"giv[e] it the character of America\".[33]",
				"after": "By September 1857, the volume of Spanish silver coming to the Mint had been so large that Snowden gave up the idea of being able to pay for it just with cents, authorizing payment with gold and silver coins. On March 3, 1859, the redemption of the foreign pieces was extended for an additional two years. As commerce was choked with the new cents, Congress repealed this provision in July 1860, though Snowden continued the practice for more than a year without authorization from Congress. Bankers Magazine for October 1861 reported the end of the exchange, and quoted the Philadelphia Press: \"the large issue of the new nickel cents has rendered them almost as much of a nuisance as the old Spanish currency\".[34] According to Breen, \"the foreign silver coins had been legal tender, receivable for all kinds of payments including postage stamps and some taxes; the nickel cents were not. They quickly filled shopkeepers' cashboxes to the exclusion of almost everything else; they began to be legally refused in trade.\"[35] The glut was ended by the hoarding of all federal coinage in the wake of the economic upset caused by the Civil War.[36][37]",
			"color": " "
		}
	}
}
