{
	"add": {
		"doc": {
			"id": "97dff0d3825935abdc32e180e75b6e876292087b0046952013e6c8c79ca3e73a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Tiffany_and_Company_Iris_Corsage_Ornament_Walters_57939_Detail_croped.jpg/220px-Tiffany_and_Company_Iris_Corsage_Ornament_Walters_57939_Detail_croped.jpg",
				"previous": "Several Yogo sapphires are kept at the Smithsonian Institution. The earliest donations were noted in the museum's annual report on June 30, 1899, when the institution reported that Dr. L. T. Chamberlain gave them two cut Yogos and 21 other sapphires for their Dr. Isaac Lea gem and mineral collection.[90] The record-setting 10.2-carat (2.04 g) cut Yogo is also held by the Smithsonian.[11][27][28] In 2006, gemologist Robert Kane of Fine Gems International in Helena, which has the world's largest selection of Montana sapphires, donated 333 Montana sapphires, weighing a total of 27.07 carats (5.414 g), to the Smithsonian's Gem and Mineral Collection, along with 98.48 grams of 18K yellow gold for the creation of a piece of jewelry.[91][92] A representative of the Smithsonian asked Paula Crevoshay, a jewelry designer from Albuquerque, New Mexico, to create a piece of finished jewelry from these gems.[93][92] Crevoshay felt that a butterfly motif would best represent America's natural beauty, honor her mother's love of butterflies, and display the wide range of colors found in Montana sapphires. Crevoshay named the brooch \"Conchita\" in honor of her mother; it is also referred to as the \"Sapphire Butterfly Brooch\", \"Conchita Sapphire Butterfly\", and the \"Montana Butterfly Brooch\". Two of the sapphires used are cabochon cut and the rest are brilliant cut.[93] The majority are from the Rock Creek deposit. The largest one, however, is a blue Yogo used for the butterfly's head. Other sapphires used included yellow, purple, pink, and orange gems. Crevoshay completed the brooch in 2007; she and Kane presented the finished brooch to Smithsonian curator Jeffrey Post on May 7, 2007, in Washington, DC.[93][94]",
				"after": "In the earliest years of Yogo sapphire mining, before Yogos achieved their own reputation, Oriental sapphires were sold in Montana with claims they were Yogos, while in Europe, Yogos were sold as Oriental sapphires.[95] However, Yogos became notable in their own right. Paulding Farnham (1859–1927) used Yogos in several jewelry pieces he designed for the 1900 Exposition Universelle in Paris,[96] where Yogo sapphires received a silver medal among all gems for color and clarity.[97] An entry of uncut loose Yogo sapphires also won a bronze medal at the 1904 Louisiana Purchase Exposition in St. Louis, Missouri.[98] Farnham was the creator of the most elaborate piece of jewelry ever made with Yogos, the life-size Tiffany Iris Brooch, a brooch ornament, which contains 120 Yogo sapphires set in platinum,[99] and sold on March 17, 1900, for $6,906.84.[100] In 1923, First Lady Florence Harding was given an \"all Montana\" ring made from a Yogo sapphire and Montana gold. In 1952, Gadsden gave cut Yogos to President Harry Truman, his wife Bess, and their daughter Margaret.[28] Many Yogos were also sold in Europe, as some Yogo mining was conducted by British interests.[27] Yogos may have been in the personal collections of some members of the British royal family in the 1910s,[27] but promotional claims that Yogos are in any of the crown jewels of England cannot be conclusively proven or disproven.[27][42][101] Claims that the gem in the engagement ring of Lady Diana Spencer and Kate Middleton is a Yogo are dubious; the gem is thought to be of Sri Lankan origin.[102] Its size also indicates it is unlikely to be a Yogo; the sapphire is large, most often reported as being 9 carats (1.8 g) in size, though it has also been described as 12 carats (2.4 g) and even 18 carats (3.6 g), however, the latter number is the karat purity of the gold setting.[103] The story that the gem is a Yogo can be traced to a 1984 Los Angeles Times article that described the ring as a 9-carat (1.8 g) sapphire, and quoted Intergem president Dennis Brown's claim that the gem may have come from a British-owned Yogo mine.[104]",
			"color": "black|0.26974 dim|0.08208 gray|0.08208 dim|0.08208 grey|0.08208 gray|0.057996 grey|0.057996 dark|0.042208 gray|0.042208 dark|0.042208 grey|0.042208 midnight|0.037659 blue|0.037659 royal|0.030944 blue|0.030944 silver|0.02749 dark|0.023062 slate|0.023062 blue|0.023062 slate|0.022308 gray|0.022308 khaki|0.022041 light|0.019648 gray|0.019648 light|0.019648 grey|0.019648 corn|0.01737 flower|0.01737 blue|0.01737 pale|0.016686 golden|0.016686 rod|0.016686 light|0.01664 slate|0.01664 gray|0.01664 gainsboro|0.013894 dark|0.013283 slate|0.013283 gray|0.013283 light|0.012675 steel|0.012675 blue|0.012675 lemon|0.011526 chiffon|0.011526 dark|0.011093 khaki|0.011093 tan|0.010169 light|0.0096822 golden|0.0096822 rod|0.0096822 yellow|0.0096822 lavender|0.009245 beige|0.0078888 antique|0.0078203 white|0.0078203 floral|0.0077497 white|0.0077497 golden|0.0075172 rod|0.0075172 sea|0.0074637 shell|0.0074637 light|0.0072282 yellow|0.0072282 thistle|0.0072009  "
		}
	}
}
