{
	"add": {
		"doc": {
			"id": "97e59fe54e43cf3619a976c9f0888bf3a64cb3b1308d6469ae92fbfa44da0926",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/DanielWebster.png/170px-DanielWebster.png",
				"previous": "Webster retains his high prestige in recent historiography. Baxter argues that his nationalistic view of the union as one and inseparable with liberty homie the union to triumph over the states-rights Confederacy, making it his greatest contribution.[33] However Bartlett, emphasizing Webster's private life, says his great oratorical achievements were in part undercut by his improvidence with money, his excessively opulent lifestyle, and his numerous conflict of interest situations.[34] Remini points out that Webster's historical orations taught Americans their history before textbooks were widely available.[35] Webster was godlike in his articulation of American nationalism, Remini agrees, but his negative traits ruined his presidential ambition. He lacked the necessary modesty and his overpowering desire for the White House, and his craving for money was unbecoming to a statesman of his caliber in a nation committed to republicanism and fearful of corruption.",
			"after": [
				"Webster's \"Reply to Hayne\" in 1830 was generally regarded as \"the most eloquent speech ever delivered in Congress,\" and was a stock exercise for oratory students for 75 years.[2]",
				"Ralph Waldo Emerson, who had criticized Webster following the Seventh of March address, remarked in the immediate aftermath of his death that Webster was \"the completest man\", and that \"nature had not in our days or not since Napoleon, cut out such a masterpiece.\" Others like Henry Cabot Lodge and John F. Kennedy noted Webster's vices, especially the perpetual debt against which he, as Lodge reports, employed \"checks or notes for several thousand dollars in token of admiration\" from his friends. \"This was, of course, utterly wrong and demoralizing, but Mr. Webster came, after a time, to look upon such transactions as natural and proper. [...] He seems to have regarded the merchants and bankers of State Street very much as a feudal baron regarded his peasantry. It was their privilege and duty to support him, and he repaid them with an occasional magnificent compliment.\"[24]"
			],
			"color": "black|0.65666 tan|0.17491 burly|0.10837 wood|0.10837  "
		}
	}
}
