{
	"add": {
		"doc": {
			"id": "97ebb34cbe1faeb8855c7a55e18639f28591cf30a8d281c61bb1805d2464df0f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Massine%2C_Leonide_%281895-1979%29_-_1914_-_Ritratto_da_Leon_Bakst.jpg/170px-Massine%2C_Leonide_%281895-1979%29_-_1914_-_Ritratto_da_Leon_Bakst.jpg",
			"previous": [],
				"after": "The premiere was followed by five further performances of The Rite at the Théâtre des Champs-Élysées, the last on 13 June. Although these occasions were relatively peaceful, something of the mood of the first night remained; the composer Puccini, who attended the second performance on 2 June,[70][71] described the choreography as ridiculous and the music cacophonous—\"the work of a madman. The public hissed, laughed – and applauded\".[72] Stravinsky, confined to his bed by typhoid fever,[73] did not join the company when it went to London for four performances at the Theatre Royal, Drury Lane.[74] Reviewing the London production, The Times critic was impressed how different elements of the work came together to form a coherent whole, but was less enthusiastic about the music itself, opining that Stravinsky had entirely sacrificed melody and harmony for rhythm: \"If M. Stravinsky had wished to be really primitive, he would have been wise to ... score his ballet for nothing but drums\".[75] The ballet historian Cyril Beaumont commented on the \"slow, uncouth movements\" of the dancers, finding these \"in complete opposition to the traditions of classical ballet\".[61]",
			"color": "dark|0.18091 gray|0.18091 dark|0.18091 grey|0.18091 silver|0.16874 light|0.14828 gray|0.14828 light|0.14828 grey|0.14828 gray|0.1361 grey|0.1361 dim|0.12032 gray|0.12032 dim|0.12032 grey|0.12032 gainsboro|0.11603 black|0.040032 dark|0.033336 slate|0.033336 gray|0.033336 white|0.013332 smoke|0.013332 linen|0.012016 sea|0.0058804 shell|0.0058804 mint|0.0046444 cream|0.0046444 floral|0.0045815 white|0.0045815 old|0.0037249 lace|0.0037249 snow|0.0033516  "
		}
	}
}
