{
	"add": {
		"doc": {
			"id": "980cab3b6bb434a26986a685b57874719c1bf3594f6958dcd26b1e38a63ec853",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Archaeopteryx-modern_bird_tails.png/220px-Archaeopteryx-modern_bird_tails.png",
				"previous": "The body plumage of Archaeopteryx is less well documented and has only been properly researched in the well-preserved Berlin specimen. Thus, as more than one species seems to be involved, the research into the Berlin specimen's feathers does not necessarily hold true for the rest of the species of Archaeopteryx. In the Berlin specimen, there are \"trousers\" of well-developed feathers on the legs; some of these feathers seem to have a basic contour feather structure, but are somewhat decomposed (they lack barbicels as in ratites).[24] However, in part they are firm and thus capable of supporting flight.[25]",
				"after": "A patch of pennaceous feathers is found running along its back, which was quite similar to the contour feathers of the body plumage of modern birds in being symmetrical and firm, although not so stiff as the flight-related feathers. Apart from that, the feather traces in the Berlin specimen are limited to a sort of \"proto-down\" not dissimilar to that found in the dinosaur Sinosauropteryx, being decomposed and fluffy, and possibly even appeared more like fur than like feathers in life (although not in their microscopic structure). These occur on the remainder of the body, as far as such structures are both preserved and not obliterated by preparation, and the lower neck.[24]",
			"color": "dark|0.22741 gray|0.22741 dark|0.22741 grey|0.22741 gray|0.18142 grey|0.18142 silver|0.15769 dim|0.14511 gray|0.14511 dim|0.14511 grey|0.14511 light|0.10486 gray|0.10486 light|0.10486 grey|0.10486 gainsboro|0.08048 black|0.037098 white|0.015824 smoke|0.015824 linen|0.007554 lavender|0.0069857 blush|0.0069857 alice|0.0068247 blue|0.0068247 ghost|0.0065247 white|0.0065247 sea|0.0061684 shell|0.0061684 snow|0.0058922 white|0.0043697 mint|0.0029489 cream|0.0029489  "
		}
	}
}
