{
	"add": {
		"doc": {
			"id": "983d0dbded4b91b2bb00bc8691c499cb4852a73afe91ffde8e2c086c3c850a49",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Delta_767-400ER_Economy_Cabin.jpg/220px-Delta_767-400ER_Economy_Cabin.jpg",
				"previous": "Delta Comfort+ seats are installed on all Delta aircraft, as well as all two-cabin Delta Connection aircraft and feature 34–36 inches (860–910 mm) of pitch; on all Delta One configured aircraft, 35–36 inches (890–910 mm) of pitch and 50 percent more recline over standard Main Cabin seats.[84] The seats were known as \"Economy Comfort\" until March 1, 2015.[79] Additional amenities include priority boarding, complimentary spirits and the option of purchasing a premium meal prior to departure on international flights, and HBO programming. On transcontinental flights between JFK-LAX/SFO/SEA, Delta Comfort+ passengers also get 1 free premium snack and a free cold meal. Customers can upgrade from standard Main Cabin seats to Delta Comfort+ seats either for a fee or using either SkyMiles or for free if either a full fare Main Cabin ticket is purchased or with elite status. Delta Comfort+ more closely aligns Delta's offerings with its Transatlantic joint venture partners as KLM also offers a Delta Comfort+ section of its Main Cabin that features similar seat pitch and recline.",
				"after": "Main Cabin (also known as \"Economy Class\") is available on all aircraft with seats ranging from 17 to 18 inches (43 to 46 cm) wide and 30 to 33 inches (76 to 84 cm) of pitch. The main cabin on Boeing 737, 747-400, 777, and selected Boeing 757-200, 767-300, and McDonnell Douglas MD-90 aircraft have an articulating seat bottom where the seat bottom moves forward in addition to the seat back tilting backwards when reclining.[citation needed][85]",
			"color": "black|0.2623 dim|0.093779 gray|0.093779 dim|0.093779 grey|0.093779 dark|0.061042 gray|0.061042 dark|0.061042 grey|0.061042 gray|0.058355 grey|0.058355 sea|0.04096 shell|0.04096 white|0.040596 smoke|0.040596 floral|0.039669 white|0.039669 mint|0.036752 cream|0.036752 snow|0.036677 silver|0.035713 white|0.034898 azure|0.027754 ghost|0.027419 white|0.027419 light|0.026619 gray|0.026619 light|0.026619 grey|0.026619 linen|0.025454 ivory|0.02379 alice|0.022632 blue|0.022632 gainsboro|0.022177 slate|0.017725 gray|0.017725 old|0.016194 lace|0.016194 lavender|0.013576 blush|0.013576 light|0.0095706 slate|0.0095706 gray|0.0095706 antique|0.0070623 white|0.0070623  "
		}
	}
}
