{
	"add": {
		"doc": {
			"id": "983fe69e4f97574db25595cd51c1b3758a78207557b1bd9a4ae8f8d463200662",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Staley05.jpg/220px-Staley05.jpg",
				"previous": "Glam metal fell out of favor due not only to the success of grunge,[187] but also because of the growing popularity of the more aggressive sound typified by Metallica and the post-thrash groove metal of Pantera and White Zombie.[188] A few new, unambiguously metal bands had commercial success during the first half of the decade—Pantera's Far Beyond Driven topped the Billboard chart in 1994—but, \"In the dull eyes of the mainstream, metal was dead\".[189] Some bands tried to adapt to the new musical landscape. Metallica revamped its image: the band members cut their hair and, in 1996, headlined the alternative musical festival Lollapalooza founded by Jane's Addiction singer Perry Farrell. While this prompted a backlash among some long-time fans,[190] Metallica remained one of the most successful bands in the world into the new century.[191]",
				"after": "Like Jane's Addiction, many of the most popular early 1990s groups with roots in heavy metal fall under the umbrella term \"alternative metal\".[192] Bands in Seattle's grunge scene such as Soundgarden, credited as making a \"place for heavy metal in alternative rock\",[193] and Alice in Chains were at the center of the alternative metal movement. The label was applied to a wide spectrum of other acts that fused metal with different styles: Faith No More combined their alternative rock sound with punk, funk, metal, and hip hop; Primus joined elements of funk, punk, thrash metal, and experimental music; Tool mixed metal and progressive rock; bands such as Fear Factory, Ministry and Nine Inch Nails began incorporating metal into their industrial sound, and vice versa, respectively; and Marilyn Manson went down a similar route, while also employing shock effects of the sort popularized by Alice Cooper. Alternative metal artists, though they did not represent a cohesive scene, were united by their willingness to experiment with the metal genre and their rejection of glam metal aesthetics (with the stagecraft of Marilyn Manson and White Zombie—also identified with alt-metal—significant, if partial, exceptions).[192] Alternative metal's mix of styles and sounds represented \"the colorful results of metal opening up to face the outside world.\"[194]",
			"color": "indian|0.93782 red|0.93782  "
		}
	}
}
