{
	"add": {
		"doc": {
			"id": "98487d153960e99127788ac8f49f46c828e453dceb77626f69f199305e8e6364",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Park_Dedication_in_1929_in_Grand_Teton_NP-NPS.jpg/220px-Park_Dedication_in_1929_in_Grand_Teton_NP-NPS.jpg",
			"previous": [],
				"after": "To the north of Jackson Hole, Yellowstone National Park had been established in 1872, and by the close of the 19th century, conservationists wanted to expand the boundaries of that park to include at least the Teton Range.[27][28] By 1907, in an effort to regulate water flow for irrigation purposes, the U.S. Bureau of Reclamation had constructed a log crib dam at the Snake River outlet of Jackson Lake. This dam failed in 1910 and a new concrete Jackson Lake Dam replaced it by 1911. The dam was further enlarged in 1916, raising lake waters 39 ft (12 m) as part of the Minidoka Project, designed to provide irrigation for agriculture in the state of Idaho.[29][30] Further dam construction plans for other lakes in the Teton Range alarmed Yellowstone National Park superintendent Horace Albright, who sought to block such efforts.[31] Jackson Hole residents were opposed to an expansion of Yellowstone, but were more in favor of the establishment of a separate National Park which would include the Teton Range and six lakes at the base of the mountains. After congressional approval, President Calvin Coolidge signed the executive order establishing the 96,000-acre (39,000 ha) Grand Teton National Park on February 26, 1929.[32]",
			"color": "black|0.28836 light|0.091997 gray|0.091997 light|0.091997 grey|0.091997 gainsboro|0.078867 silver|0.075402 dark|0.064157 gray|0.064157 dark|0.064157 grey|0.064157 gray|0.050696 grey|0.050696 dim|0.048418 gray|0.048418 dim|0.048418 grey|0.048418 linen|0.047591 old|0.033104 lace|0.033104 sea|0.032088 shell|0.032088 antique|0.031494 white|0.031494 floral|0.027887 white|0.027887 white|0.024348 smoke|0.024348 ivory|0.021465 snow|0.018292 mint|0.014676 cream|0.014676 white|0.01228 beige|0.0098192 honeydew|0.0084831 misty|0.0082683 rose|0.0082683  "
		}
	}
}
