{
	"add": {
		"doc": {
			"id": "984c64846b53c7c71cebed58890170196df39d79c6cb97d49847c169889aa0c9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Jerusalem%2C_Israel.JPG/220px-Jerusalem%2C_Israel.JPG",
				"previous": "The Jerusalem City Council is a body of 31 elected members headed by the mayor, who serves a five-year term and appoints eight deputies. The former mayor of Jerusalem, Uri Lupolianski, was elected in 2003.[238] In the November 2008 city elections, Nir Barkat came out as the winner and is now the mayor. Apart from the mayor and his deputies, City Council members receive no salaries and work on a voluntary basis. The longest-serving Jerusalem mayor was Teddy Kollek, who spent 28 years—-six consecutive terms-—in office. Most of the meetings of the Jerusalem City Council are private, but each month, it holds a session that is open to the public.[238] Within the city council, religious political parties form an especially powerful faction, accounting for the majority of its seats.[239] The headquarters of the Jerusalem Municipality and the mayor's office are at Safra Square (Kikar Safra) on Jaffa Road. The municipal complex, comprising two modern buildings and ten renovated historic buildings surrounding a large plaza, opened in 1993 moved from the Jerusalem Historical City Hall Building.[240] The city falls under the Jerusalem District, with Jerusalem as the district's capital. 37% of the population is Palestinian, but only 10% of tax revenues are allocated for them. In East Jerusalem, 52% of the land is excluded from development, 35% designated for Jewish settlements, and 13% for Palestinian use, almost all of which is already built on.[191]",
				"after": "Jerusalem is situated on the southern spur of a plateau in the Judaean Mountains, which include the Mount of Olives (East) and Mount Scopus (North East). The elevation of the Old City is approximately 760 m (2,490 ft).[241] The whole of Jerusalem is surrounded by valleys and dry riverbeds (wadis). The Kidron, Hinnom, and Tyropoeon Valleys intersect in an area just south of the Old City of Jerusalem.[242] The Kidron Valley runs to the east of the Old City and separates the Mount of Olives from the city proper. Along the southern side of old Jerusalem is the Valley of Hinnom, a steep ravine associated in biblical eschatology with the concept of Gehenna or Hell.[243] The Tyropoeon Valley commenced in the northwest near the Damascus Gate, ran south-southeasterly through the center of the Old City down to the Pool of Siloam, and divided the lower part into two hills, the Temple Mount to the east, and the rest of the city to the west (the lower and the upper cities described by Josephus). Today, this valley is hidden by debris that has accumulated over the centuries.[242] In biblical times, Jerusalem was surrounded by forests of almond, olive and pine trees. Over centuries of warfare and neglect, these forests were destroyed. Farmers in the Jerusalem region thus built stone terraces along the slopes to hold back the soil, a feature still very much in evidence in the Jerusalem landscape.[citation needed]",
			"color": "dim|0.38678 gray|0.38678 dim|0.38678 grey|0.38678 gray|0.35358 grey|0.35358 dark|0.16935 gray|0.16935 dark|0.16935 grey|0.16935 silver|0.029273 slate|0.027418 gray|0.027418 light|0.012699 slate|0.012699 gray|0.012699 light|0.0064625 gray|0.0064625 light|0.0064625 grey|0.0064625 dark|0.0059687 slate|0.0059687 gray|0.0059687 black|0.0039423  "
		}
	}
}
