{
	"add": {
		"doc": {
			"id": "9850bd0990b1849239334e9d2c2c2b2f07ec494d21a1c127901fc7a0809edada",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Juvenile_black-tailed_prairie_dogs.jpg/250px-Juvenile_black-tailed_prairie_dogs.jpg",
				"previous": "Prairie dog copulation occurs in the burrows, and this reduces the risk of interruption by a competing male. They are also at less risk of predation. Behaviors that signal that a female is in estrus include underground consorting, self-licking of genitals, dust-bathing, and late entrances into the burrow at night.[9] The licking of genitals may protect against sexually transmitted diseases and genital infections,[9] while dust-bathing may protect against fleas and other parasites. Prairie dogs also have a mating call which consists of a set of 2 to 25 barks with a 3- to 15-second pause between each one.[9] Females may try to increase their reproduction success by mating with males outside their family groups. When copulation is over, the male is no longer interested in the female sexually, but will prevent other males from mating with her by inserting copulatory plugs.[9]",
				"after": "For black-tailed prairie dogs, the resident male of the family group fathers all the offspring.[10] Multiple paternity in litters seems to be more common in Utah and Gunnison’s prairie dogs.[8] Mother prairie dogs do most of the care for the young. In addition to nursing the young, the mother also defends the nursery chamber and collects grass for the nest. Males play their part by defending the territories and maintaining the burrows.[7] The young spend their first six weeks below the ground being nursed.[6] They are then weaned and begin to surface from the burrow. By five months, they are fully grown.[6] The subject of cooperative breeding in prairie dogs has been debated among biologists. Some argue prairie dogs will defend and feed young that are not theirs,[11] and it seems young will sleep in nursery chamber with other mothers; since most nursing occurs at night, this may be a case of communal nursing.[7] In the case of the latter, others suggest communal nursing occurs only when mothers mistake another female's young for their own. Infanticide is known to occur in prairie dogs. Males which take over a family group will kill the offspring of the previous male.[7] This causes the mother to go into estrus sooner.[7] However, most infanticide is done by close relatives.[7] Lactating females will kill the offspring of a related female both to decrease competition for the female’s offspring and for increased foraging area due to a decrease in territorial defense by the victimized mother. Supporters of the theory that prairie dogs are communal breeders state that another reason for this type of infanticide is so that the female can get a possible helper. With their own offspring gone, the victimized mother may help raise the young of other females.",
			"color": "tan|0.39555 burly|0.13222 wood|0.13222 wheat|0.10835 peach|0.087149 puff|0.087149 bisque|0.063099 black|0.05455 moccasin|0.050667 navajo|0.048016 white|0.048016 blanched|0.032179 almond|0.032179 papaya|0.012686 whip|0.012686 antique|0.0065083 white|0.0065083  "
		}
	}
}
