{
	"add": {
		"doc": {
			"id": "98a136ad831517876ea35e18129bc5278b5c26c230e13181b2637353f181630d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Baile_de_cortejo_Wayuu.jpg/220px-Baile_de_cortejo_Wayuu.jpg",
				"previous": "The 2005 census reported that the \"non-ethnic population\", consisting of whites and mestizos (those of mixed white European and Amerindian ancestry), constituted 86% of the national population. About 49% of Colombia's population is Mestizo or of mixed European and Amerindian ancestry. Approximately 37% is of European ancestry (predominantly Spanish, and a part of Italian, French, and German) and of Middle Eastern ancestry. 10.6% is of African ancestry. Indigenous Amerindians comprise 3.4% of the population. 0.01% of the population are Roma.[2]",
				"after": "Many of the Indigenous peoples experienced a reduction in population during the Spanish rule [199] and many others were absorbed into the mestizo population, but the remainder currently represents over eighty distinct cultures. Reserves (resguardos) established for indigenous peoples occupy 30,571,640 hectares (305,716.4 km2) (27% of the country's total) and are inhabited by more than 800,000 people.[200] Some of the largest indigenous groups are the Wayuu,[198] the Paez, the Pastos, the Emberá and the Zenú.[201] The departments of La Guajira, Cauca, Nariño, Córdoba and Sucre have the largest indigenous populations.[1]",
			"color": "red|0.1955 tan|0.14619 firebrick|0.077962 crimson|0.04923 dark|0.042006 red|0.042006 maroon|0.034632 brown|0.033742 bisque|0.029624 black|0.024943 rosy|0.020786 brown|0.020786 peach|0.020484 puff|0.020484 gray|0.020133 grey|0.020133 dim|0.019484 gray|0.019484 dim|0.019484 grey|0.019484 dark|0.017489 gray|0.017489 dark|0.017489 grey|0.017489 indian|0.017096 red|0.017096 wheat|0.013207 silver|0.012789 sienna|0.011421 pale|0.011159 violet|0.011159 red|0.011159 thistle|0.010692 light|0.010394 gray|0.010394 light|0.010394 grey|0.010394 antique|0.0099957 white|0.0099957  "
		}
	}
}
