{
	"add": {
		"doc": {
			"id": "98bb4639daa8ad310dc1416bf1d45b073a7c681188ce7df731115dd4c93559be",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Everglades_National_Park_cypress.jpg/275px-Everglades_National_Park_cypress.jpg",
				"previous": "Smith set sail to Key West and turned himself in to the authorities the next day. Despite evidence found by the prosecution—paid for by the Florida Audubon Society—that Bradley had not fired his weapon, Smith claimed self-defense. He maintained that the warden had fired first, but missed, hitting Smith's boat.[28] Those who knew Bradley, however, insisted that he had been an excellent shot, and would not have missed his target had he, in fact, shot first. Smith later was found not guilty of murder, when the jury decided there was insufficient evidence to convict; he served only five months in jail, unable to pay $5,000 for bail.[29] While he was incarcerated, Bradley's two brothers-in-law burned down Smith's Flamingo home.[30]",
				"after": "Bradley's death and Smith's acquittal made national headlines; detailed stories ran in the New York Times,[31][32] the New York Herald, the Philadelphia North American, and Forest and Stream.[30][33] The warden's wife and two young children were given a home in Key West, paid for by donations secured by the Florida Audubon Society. The Society, however, made no effort to replace Bradley, and his job as warden went unfilled.[34] Bradley's obituary, written by William Dutcher and published in August 1905's edition of Bird Lore, characterized him as \"fearless and brave.\"[1][35] Dutcher eulogized Bradley by saying, \"A faithful and devoted warden, who was a young and sturdy man, cut off in a moment, for what? That a few more plume birds might be secured to adorn heartless women's bonnets. Heretofore the price has been the life of the birds, now is added human blood. Every great movement must have its martyrs, and Guy M. Bradley is the first martyr in bird protection.\"[28][35]",
			"color": "dim|0.40049 gray|0.40049 dim|0.40049 grey|0.40049 slate|0.13335 gray|0.13335 black|0.12673 light|0.11381 slate|0.11381 gray|0.11381 gray|0.10973 grey|0.10973 dark|0.04232 gray|0.04232 dark|0.04232 grey|0.04232 light|0.013798 steel|0.013798 blue|0.013798 silver|0.010849  "
		}
	}
}
