{
	"add": {
		"doc": {
			"id": "98c20fe10bf777dc444b484a35765aad57184d9d3feb5756fd3d2c34b5f8a3e0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/G-ALWF_Vickers_Viscount_%289460217268%29.jpg/220px-G-ALWF_Vickers_Viscount_%289460217268%29.jpg",
			"previous": [],
				"after": "By the early-1950s, the bare metal finish on most BEA aircraft had evolved to incorporate a burgundy cheatline separated by two thin, white lines above the cabin windows on each side of the fuselage. This cheatline was in turn separated by upper case, burgundy British European Airways titles in the middle. The bottom, burgundy part of this cheatline extended below the flightdeck windows to converge on the nose, with the space in-between painted black (matte finish) to reduce glare for the pilots and shield sensitive navigational equipment housed in the nose from radiation. There was a contemporary BEA logo on each side of the forward fuselage featuring a stylised wing and BEA in capital letters on each side of the nose. In addition to the aircraft registration, there was also a coat of arms on each side of the rear fuselage and a small Union flag each side of the lower part of the tail. The letters BEA appeared in bold, upper case on the upper left and lower right wing while the aircraft registration appeared in bold, upper case on the upper right and lower left wing.[209] Later adaptations of this livery used on DC-3s/Pionairs featured an unbroken cheatline with large, upper case British European Airways titles on a white upper fuselage and a larger Union flag, as well as the aircraft registration each side of a white tail and the aircraft's name prominently displayed in a white field on the left side of the nose and a coat of arms on its right side.[210] When applied to BEA's Elizabethans, this lacked British European Airways titles due to the aircraft's high-wing configuration that left insufficient space on the upper fuselage.[211]",
			"color": "black|0.24164 dim|0.10828 gray|0.10828 dim|0.10828 grey|0.10828 dark|0.1066 gray|0.1066 dark|0.1066 grey|0.1066 gray|0.089712 grey|0.089712 silver|0.071946 light|0.05302 gray|0.05302 light|0.05302 grey|0.05302 gainsboro|0.041467 white|0.030986 smoke|0.030986 ghost|0.027428 white|0.027428 snow|0.027084 sea|0.026789 shell|0.026789 lavender|0.026107 blush|0.026107 white|0.02488 alice|0.024344 blue|0.024344 floral|0.02229 white|0.02229 mint|0.021367 cream|0.021367 azure|0.017606 linen|0.012317  "
		}
	}
}
