{
	"add": {
		"doc": {
			"id": "98c6f617330b7216ce34b1d4c78925fd1d23d75b1ab5845282951d1ab83ddf81",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Raffael_040.jpg/220px-Raffael_040.jpg",
				"previous": "The canvas is dramatically divided in two by a diagonal line separated by colour and tone. The lower two-thirds are dominated by heavy red and white pigments; browns and whites are prominent in the upper right-hand section. This division is delineated by a diagonal reaching from the upper edge of the curtain down to Ottavio's leggings in the right mid-ground. Other echoes of the colours and patterns include the red of Paul's robes against the velvet of his chair and the overhanging curtain.[3] This dramatic colour and luminosity can be in part attributed to this design, and to the manner in which Titian reverses the usual painterly technique in building tone: he began with a dark background, then layered the lighter hues before the darker passages. The effect has been described as a \"tour de force of symphonic colourism\", and a high point of his blending of red and ochre pigments. Titian uses a variety of brushstrokes. While the pope's robes are painted with very broad strokes, his cape (mozzetta), ageing face and visible hand were captured in minute detail with thin brushes, with his hairs rendered at the level of individual strands.[3]",
				"after": "Ottavio, shown as tall and muscular,[9] is about to kneel to kiss the Pope's feet, a contemporary manner of greeting a pope: a guest would make three short bows followed by the kissing of the papal feet. Titian indicates this step in the ceremony by showing Paul's shoe decorated with a cross, poking from underneath his gown.[3] Ottavio's head is bowed, but his stern facial expression conveys that he is acting as protocol dictates, rather than with genuine diffidence.[17]",
			"color": "black|0.56063 pale|0.067185 golden|0.067185 rod|0.067185 wheat|0.049488 tan|0.048502 moccasin|0.031939 burly|0.02205 wood|0.02205 navajo|0.021884 white|0.021884 lemon|0.021306 chiffon|0.021306 dark|0.021149 khaki|0.021149 light|0.016641 golden|0.016641 rod|0.016641 yellow|0.016641 blanched|0.014101 almond|0.014101 papaya|0.012395 whip|0.012395 corn|0.011908 silk|0.011908 bisque|0.011292 light|0.010467 yellow|0.010467 beige|0.0099881 antique|0.0096276 white|0.0096276 peru|0.0070705  "
		}
	}
}
