{
	"add": {
		"doc": {
			"id": "98cb4933b2215862eb3ad0e46ae3b0eda78e415c0a5768088df53fd70a9af571",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Capitol_Building_MG_1600_Sans_watermark.jpg/220px-Capitol_Building_MG_1600_Sans_watermark.jpg",
			"previous": [],
			"after": [
				"The state's capital is Sacramento.",
				"California is organized into three branches of government – the executive branch consisting of the Governor and the other independently elected constitutional officers; the legislative branch consisting of the Assembly and Senate; and the judicial branch consisting of the Supreme Court of California and lower courts. The state also allows ballot propositions: direct participation of the electorate by initiative, referendum, recall, and ratification. Before the passage of California Proposition 14 (2010), California allowed each political party to choose whether to have a closed primary or a primary where only party members and independents vote. After June 8, 2010 when Proposition 14 was approved, excepting only the U.S. President and county central committee offices,[167] all candidates in the primary elections are listed on the ballot with their preferred party affiliation, but they are not the official nominee of that party.[168] At the primary election, the two candidates with the top votes will advance to the general election regardless of party affiliation.[168] If at a special primary election, one candidate receives more than 50% of all the votes cast, they are elected to fill the vacancy and no special general election will be held.[168]"
			],
			"color": "black|0.20409 dark|0.17426 olive|0.17426 green|0.17426 dim|0.13555 gray|0.13555 dim|0.13555 grey|0.13555 gray|0.12869 grey|0.12869 dark|0.11359 gray|0.11359 dark|0.11359 grey|0.11359 silver|0.049135 slate|0.024623 gray|0.024623 olive|0.024031 light|0.022331 gray|0.022331 light|0.022331 grey|0.022331 light|0.022282 slate|0.022282 gray|0.022282 tan|0.019138  "
		}
	}
}
