{
	"add": {
		"doc": {
			"id": "98cf1a491222171992a877bd37de88ece49e1c00c65f8080d930adfa1134568e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Cyathus_poeppigii.jpg/220px-Cyathus_poeppigii.jpg",
				"previous": "Fruit bodies typically grow in clusters, and are found on dead or decaying wood, or on woody fragments in cow or horse dung.[10] Dung-loving (coprophilous) species include C. stercoreus, C. costatus, C. fimicola, and C. pygmaeus.[16] Some species have been collected on woody material like dead herbaceous stems, the empty shells or husks of nuts, or on fibrous material like coconut, jute, or hemp fiber woven into matting, sacks or cloth.[17] In nature, fruit bodies are usually found in moist, partly shaded sites, such as the edges of woods on trails, or around lighted openings in forests. They are less frequently found growing in dense vegetation and deep mosses, as these environments would interfere with the dispersal of peridioles by falling drops of water.[18] The appearance of fruit bodies is largely dependent upon features of the immediate growing environment; specifically, optimum conditions of temperature, moisture, and nutrient availability are more important factors for fruit rather than the broad geographical area in which the fungi are located, or the season.[18] Examples of the ability of Cyathus to thrive in somewhat inhospitable environments are provided by C. striatus and C. stercoreus, which can survive the drought and cold of winter in temperate North America,[19] and the species C. helenae, which has been found growing on dead alpine plants at an altitude of 7,000 feet (2,100 m).[20]",
				"after": "In general, species of Cyathus have a worldwide distribution, but are only rarely found in the arctic and subarctic.[3] One of the best known species, C. striatus has a circumpolar distribution and is commonly found throughout temperate locations, while the morphologically similar C. poeppigii is widely spread in tropical areas, rarely in the subtropics, and never in temperate regions.[21] The majority of species are native to warm climates. For example, although 20 different species have been reported from the United States and Canada, only 8 are commonly encountered; on the other hand, 25 species may be regularly found in the West Indies, and the Hawaiian Islands alone have 11 species.[22] Some species seem to be endemic to certain regions, such as C. novae-zeelandiae found in New Zealand, or C. crassimurus, found only in Hawaii; however, this apparent endemism may just be a result of a lack of collections, rather than a difference in the habitat that constitutes a barrier to spread.[22] Although widespread in the tropics and most of the temperate world, C. stercoreus is only rarely found in Europe; this has resulted in its appearance on a number of Red Lists. For example, it is considered endangered in Bulgaria,[23] Denmark,[24] and Montenegro,[25] and \"near threatened\" in Great Britain.[26] The discovery of a Cyathus species in Dominican amber (C. dominicanus) suggests that the basic form of the bird's nest fungi had already evolved by the Cretaceous era and that the group had diversified by the mid-Cenozoic.[27]",
			"color": "black|0.88106 dim|0.040246 gray|0.040246 dim|0.040246 grey|0.040246 rosy|0.033753 brown|0.033753 gray|0.017707 grey|0.017707 dark|0.0055954 gray|0.0055954 dark|0.0055954 grey|0.0055954 misty|0.0054517 rose|0.0054517  "
		}
	}
}
