{
	"add": {
		"doc": {
			"id": "98df728774686d23c65bfb4ca3dded34b790cd736018da04936f395494359f95",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/52/Hobbs_batting_in_1922.jpg/220px-Hobbs_batting_in_1922.jpg",
				"previous": "Many of his English contemporaries rated Hobbs superior to Donald Bradman, often regarded as the greatest batsman in the history of cricket, on difficult pitches.[282] In difficult batting conditions Hobbs batted with great success, and several of his most highly regarded innings came in such circumstances.[278] Murphy suggests: \"Before Bradman, he was the most consistent run-getter of all time, yet no one worried less about the sheer slog of carving out big scores.\"[283] Hobbs frequently was out deliberately soon after reaching a century—roughly a quarter of his centuries were scores less than 110—and was not particularly interested in most statistics.[284] An article in Wisden in 2000 stated: \"He was never as dominant as Bradman; he never wanted to be. But his contemporaries were in awe of his ability to play supremely and at whim, whatever the conditions.\"[285]",
				"after": "Hobbs' technique was based on strong forearms and good foot movement. R. C. Robertson-Glasgow suggested that \"his footwork was, as near as is humanly possible, perfect. In every stroke, he moved into line with the ball with so little effort that he could bat for hours without over-taxing energy of mind or body.\"[286] He played every type of shot—he did not have a \"signature\" shot like other batsmen, but selected his strokes effectively;[287] according to Alec Kennedy, who bowled to Hobbs, it seemed that he could predict what the bowler would do.[156] In contrast to many leading batsmen from his time, Hobbs preferred to play off the back foot as he believed it gave him more time to see the ball and adapt his shot.[288] Capable of playing all the strokes, he hit the ball precisely between fielders and sometimes delayed his shot to make the ball travel more slowly and allow more time to run;[283] he also ran well between the wickets.[283] He liked to score his first run quickly when he came into bat, and he often looked to score quickly at the start of an innings, before the bowlers had settled; on occasion, Hobbs targeted the main bowling threats from the opposition in an attempt to neutralise them.[289] Early in his career, mainly before the First World War, Hobbs was an aggressive, fast-scoring batsman who played many shots.[284] After the war, he was more circumspect and adapted his technique to account for both his increased age,[283] and the increased pressure and expectation from the public and teammates. He concentrated to a greater extent on batting for longer periods; many critics, including Hobbs himself, recognised the change and suggested that he was a better batsman before 1914. However, commentators also noted that he displayed greater certainty and control in this later period;[290][291] Cardus wrote that \"he scored his centuries effortlessly now; we hardly noted the making of them.\"[277] This was the period in which he became known as \"The Master\",[292] and he was more consistent than before the war. This was the time when the public regarded him with the most respect and affection;[283] 98 of his centuries and 26,411 of his runs (at an average of 58.62) in first-class cricket were scored after he reached the age of 40.[292]",
			"color": " "
		}
	}
}
