{
	"add": {
		"doc": {
			"id": "98e8bd90e975ceabdba50aa527d35471c16b26f8130d9d6a6ab4001f15cb4d36",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Election-state-04-08.png/250px-Election-state-04-08.png",
				"previous": "Obama, having a Caucasian mother and Kenyan father of the Luo ethnic group,[242] became the first African American as well as the first bi-racial president.[243] The Obama-Biden ticket was also the first winning ticket in American history on which neither candidate was a White Anglo-Saxon Protestant; Biden is Roman Catholic and is the first Roman Catholic to be elected Vice President.[244] Obama and Biden were the first President and Vice President elected from the Senate since 1960 (John F. Kennedy/Lyndon B. Johnson), Obama became the first Northern Democratic president since Kennedy, and the Obama-Biden ticket was the first winning Democratic ticket to feature two Northerners since 1940 (Franklin D. Roosevelt/Henry A. Wallace). Also, Obama became the first Democratic candidate to win a majority of the popular vote since Jimmy Carter in 1976, the first to win a majority of both votes and states since Lyndon Johnson in 1964, and the first Northern Democrat to win a majority of both votes and states since Franklin Roosevelt in 1944.",
				"after": "Prior to the election, commentators discussed whether Senator Obama would be able to redraw the electoral map by winning states that had been voting for Republican candidates in recent decades.[245] In many ways, he was successful. He won every region of the country by double digits except the South, which John McCain won by nine percent. Obama won Delaware, the District of Columbia, Maryland, North Carolina, Florida, and Virginia in the South (region as defined by the US Census Bureau). McCain won most of the Deep South, where white voters have supported Republican candidates by large margins in the last few decades.[246] Obama also defied political bellwethers, becoming the first person to win the presidency while losing Missouri since 1956 (as well as the first Democrat ever to do so) and while losing Kentucky and Tennessee since 1960. He was the first Democrat to win the presidency without winning West Virginia since 1916 and the first Democrat to win without Arkansas since that state joined the Union in 1836. Indiana and Virginia voted for the Democratic nominee for the first time since 1964. Although Obama did not win other normally Republican states such as Georgia and Montana (which were won by Bill Clinton in 1992), he nonetheless was competitive in both. He lost Montana by just under 3% and Georgia by slightly more than 5%. Also notably, Barack Obama won all of the 2004 swing states (states that either Kerry or Bush won by less than 5%) by a margin of 8.5 percent or more except for Ohio, which the Democrat carried by 4.5 percent.",
			"color": "indian|0.98648 red|0.98648 black|0.0060881 rosy|0.0029353 brown|0.0029353  "
		}
	}
}
