{
	"add": {
		"doc": {
			"id": "990e8322576cbe03bdb099f28267ae0cd39b0a7c4d4452514cb99feb171b8b0e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/ChurchOn_Blood.jpg/220px-ChurchOn_Blood.jpg",
			"previous": [],
				"after": "In 1979, the bodies of Tsar Nicholas II, Tsarina Alexandra, three of their daughters, and those of four non-family members killed with them, were discovered near Sverdlovsk (Yekaterinburg) by amateur archaeologist Alexander Avdonin. In January 1998, the remains excavated from underneath the dirt road near Yekaterinburg were officially identified as those of Nicholas II and his family (excluding one of his daughters and Alexei). The identifications, performed by separate Russian, British and American scientists using DNA analysis concur and were found to be conclusive.[89] Nicholas belonged to the paternal haplogroup R1b; based upon Y-STR DNA test results on his remains, which have also been validated with results from a living relative.[90] The Tsar belonged to the maternal haplogroup T based upon mitochondrial DNA mutations: 16126C, 16169Y, 16294T, 16296T, 73G, 263G, and 315.1C.[91] The DNA analysis also revealed that the rate and pattern of sequence substitutions in the mitochondrial DNA (mtDNA) control region (CR) is roughly twenty-fold higher than estimates derived from phylogenetic analyses.[92] These results have implications for forensic applications and studies of human evolution. The tests also determined that Nicholas II's mtDNA, as well as his brother's exhibited single base heteroplasmy. After the testing, the remains were finally interred at St. Peter and Paul Cathedral in Saint Petersburg on 17 July 1998, eighty years after the executions. The ceremony was attended by then Russian President Boris Yeltsin, who said, \"Today is a historic day for Russia. For many years, we kept quiet about this monstrous crime, but the truth has to be spoken.\"[93]",
			"color": "black|0.36336 dim|0.13902 gray|0.13902 dim|0.13902 grey|0.13902 dark|0.099032 slate|0.099032 gray|0.099032 steel|0.095696 blue|0.095696 gray|0.089772 grey|0.089772 dark|0.068978 gray|0.068978 dark|0.068978 grey|0.068978 light|0.050524 slate|0.050524 gray|0.050524 silver|0.017824 light|0.013956 blue|0.013956 slate|0.013136 gray|0.013136 light|0.0091375 gray|0.0091375 light|0.0091375 grey|0.0091375 light|0.0072232 steel|0.0072232 blue|0.0072232 gainsboro|0.0068726 powder|0.0062074 blue|0.0062074  "
		}
	}
}
