{
	"add": {
		"doc": {
			"id": "99135cc28506de8de4a3655f1306ce1d682805d61d3e260cba031691c53b3b91",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Quehanna_Reactor_and_Jet_Bunkers_1958_labels.png/300px-Quehanna_Reactor_and_Jet_Bunkers_1958_labels.png",
				"previous": "The state constructed $1.6 million of roads to the area; the Quehanna Highway was built on parts of an old CCC road, which followed an earlier logging railroad grade. Pennsylvania also canceled 212 camp site leases to help ensure security for the installation. Curtiss-Wright built three facilities on its land. The first was a nuclear research center with a nuclear reactor and six shielded radiation containment chambers for handling radioactive isotopes, referred to as hot cells, at the end of Reactor Road. The second was for jet engine trials and had two test cells with bunkers just north of Quehanna Highway, about 0.5 miles (0.8 km) apart. The northern test cell was at the center of the 16-sided polygon; even if a jet engine broke its moorings, it could not leave the polygonal area. Both of these were on the land which Curtiss-Wright had purchased, which was a regular octagon surrounded with a 24-mile (39 km) fence built by forest rangers, supervised from three guard houses on Quehanna Highway and Wykoff Run Road. The third installation was an industrial complex at the southeast edge of the polygon, in Karthaus Township, on the Quehanna Highway. At this site, a Curtiss-Wright division manufactured Curon foam for furniture and household products and used beryllium oxide to make high-temperature ceramics for application in the nuclear industry.[8][37][40][41][42]",
				"after": "In 1956 Curtiss-Wright began isotope work at the facility,[38] and The New York Times published two stories on the new nuclear research laboratory that year, followed by a November 1957 report that the one-megawatt nuclear reactor was completed.[43][44][45] In 1958, the corporation received a twenty-year license from the United States Atomic Energy Commission (AEC) to operate a four-megawatt pool-type nuclear research reactor, and received permission from the Pennsylvania Sanitary Water Board to dispose of some radioactive waste in Meeker Run, a tributary of Mosquito Creek.[8] The project was billed as \"the greatest thing that ever happened in North Central Pennsylvania\", and was expected to employ between 7,000 and 8,000 people.[40] Curtiss-Wright spent $30 million on the project, and developed a community for its scientific and technical staff at the village of Pine Glen, southeast of Karthaus in Centre County.[8]",
			"color": " "
		}
	}
}
