{
	"add": {
		"doc": {
			"id": "991ccd02b8a6a935b0f67f893d779c6f53d577baf4c471d5431ce8bf4a125f55",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/3/3f/16-pointed_uninterrupted_stellate_plan_of_Trimurti_Temple_in_Savadi_Gadag_district.svg/220px-16-pointed_uninterrupted_stellate_plan_of_Trimurti_Temple_in_Savadi_Gadag_district.svg.png",
				"previous": "A major development of this period was the appearance of stellate (star-shaped) shrines in a few temples built of the traditional sandstone, such as the Trimurti Temple at Savadi, the Paramesvara Temple at Konnur and the Gauramma Temple at Hire Singgangutti. In all three cases, the shrine is a 16-pointed uninterrupted star, a ground-plan not found anywhere else in India and which entirely differentiates these temples from the 32-pointed interrupted star plans of bhumija shrines in northern India.[43]",
				"after": "The stellate plan found popularity in the soapstone constructions such as the Doddabasappa Temple at Dambal as well. Contemporary stellate plans in northern India were all 32-pointed interrupted types. No temples of the 6-, 12-, or 24-pointed stellate plans are known to exist anywhere in India, with the exception of the unique temple at Dambal, which can be described either as a 24-pointed uninterrupted plan, or a 48-pointed plan with large square points of 90 degrees alternating with small short points of 75 degrees.[44] The upper tiers of the seven-tiered superstructure look like cogged wheels with 48 dents.[45] The Doddabasappa Temple and the Somesvara Temple at Lakshmeshwara are examples of extreme variants of a basic dravida articulation. These temples prove that the architects and craftsman were consciously creating new compositions of architectural components out of traditional methods.[46]",
			"color": "dim|0.29429 gray|0.29429 dim|0.29429 grey|0.29429 gray|0.28086 grey|0.28086 dark|0.2019 gray|0.2019 dark|0.2019 grey|0.2019 black|0.17243 silver|0.044747 light|0.0047117 gray|0.0047117 light|0.0047117 grey|0.0047117  "
		}
	}
}
