{
	"add": {
		"doc": {
			"id": "991db349947fba0e180b82e18897c35ef8cf4277c37092406b4db45029ecd280",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/ThomasFerebee.jpg/170px-ThomasFerebee.jpg",
				"previous": "The Hiroshima mission was followed by another atomic strike. Originally scheduled for 11 August, it was brought forward by two days to 9 August owing to bad weather. This time, a Fat Man nuclear weapon was carried by B-29 Bockscar, piloted by Major Charles W. Sweeney.[24] Enola Gay, flown by Captain George Marquardt's Crew B-10, was the weather reconnaissance aircraft for Kokura, the primary target.[25] Enola Gay reported clear skies over Kokura,[26] but by the time Bockscar arrived, the city was obscured by smoke from fires from the conventional bombing of Yawata by 224 B-29s the day before. After three unsuccessful passes, Bockscar diverted to its secondary target, Nagasaki,[27] where it dropped its bomb. In contrast to the Hiroshima mission, the Nagasaki mission has been described as tactically botched, although the mission did meet its objectives. The crew encountered a number of problems in execution, and had very little fuel by the time it landed at Yontan Airfield on Okinawa.[28][29]",
			"after": [
				"Enola Gay's crew on 6 August 1945, consisted of 12 men.[30] The crew was:",
				"Source: Campbell, 2005, p. 30. Asterisks denote regular crewmen of the Enola Gay."
			],
			"color": "dark|0.083547 gray|0.083547 dark|0.083547 grey|0.083547 gray|0.082554 grey|0.082554 linen|0.062122 dim|0.061274 gray|0.061274 dim|0.061274 grey|0.061274 silver|0.060543 black|0.058549 sea|0.057247 shell|0.057247 white|0.05544 smoke|0.05544 floral|0.054264 white|0.054264 light|0.052744 gray|0.052744 light|0.052744 grey|0.052744 snow|0.050442 old|0.049731 lace|0.049731 gainsboro|0.046895 white|0.042706 mint|0.040518 cream|0.040518 ivory|0.034712 lavender|0.024833 blush|0.024833 ghost|0.02398 white|0.02398 antique|0.02053 white|0.02053 misty|0.0085079 rose|0.0085079 azure|0.0074629 honeydew|0.0067526 alice|0.005634 blue|0.005634 beige|0.0053185  "
		}
	}
}
