{
	"add": {
		"doc": {
			"id": "9926d8ef52140b91ddc5584028b845d4818ae6143d0619af329694adeab98116",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Friedland_Van_Bree-1810.jpg/220px-Friedland_Van_Bree-1810.jpg",
				"previous": "Sometimes ships are launched using a series of inflated tubes underneath the hull, which deflate to cause a downward slope into the water. This procedure has the advantages of requiring less permanent infrastructure, risk, and cost. The airbags provide support to the hull of the ship and aids its launching motion into the water, thus it is arguably safer than other options like sideways launching.[4] These airbags are usually cylindrical in shape with hemispherical heads at both ends. The Xiao Qinghe shipyard launched a tank barge with marine airbags on January 20, 1981 and it is known as the first use of marine airbags.",
			"after": [
				"A Babylonian narrative dating from the 3rd millennium BC describes the completion of a ship:",
				"Egyptians, Greeks, and Romans called on their gods to protect seamen. The favor of the monarch of the seas — Poseidon in Greek mythology, the Roman Neptune — was evoked. Ship launching participants in ancient Greece wreathed their heads with olive branches, drank wine to honor the gods, and poured water on the new vessel as a symbol of blessing. Shrines were carried on board Greek and Roman ships, and this practice extended into the Middle Ages. The shrine was usually placed at the quarterdeck, an area which continues to have special, ceremonial, significance."
			],
			"color": "silver|0.16254 light|0.11871 gray|0.11871 light|0.11871 grey|0.11871 gainsboro|0.10171 dark|0.10153 gray|0.10153 dark|0.10153 grey|0.10153 light|0.095189 steel|0.095189 blue|0.095189 black|0.063471 misty|0.037211 rose|0.037211 tan|0.034308 lavender|0.033648 linen|0.027476 light|0.026146 blue|0.026146 burly|0.021535 wood|0.021535 sea|0.017859 shell|0.017859 lavender|0.017255 blush|0.017255 antique|0.013634 white|0.013634 white|0.013216 smoke|0.013216 old|0.010533 lace|0.010533 alice|0.0099924 blue|0.0099924 peach|0.0095499 puff|0.0095499 floral|0.0092186 white|0.0092186 snow|0.0089506 ghost|0.0085643 white|0.0085643 white|0.0060248 mint|0.0047087 cream|0.0047087  "
		}
	}
}
