{
	"add": {
		"doc": {
			"id": "99371111b6cb291715bbe819ddcdad84f3683e20c42376951f46748efc959206",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Chrysiridia_rhipheus_larva.jpg/220px-Chrysiridia_rhipheus_larva.jpg",
				"previous": "Unlike most moths, the sunset moth is day flying and the bright aposematic colours warn predators of its toxicity, a strategy seen in many diurnal moths. Another habit the moth has in common with many butterflies is the night resting posture—the wings are held vertically over the back. During their migrations they roost in a group for the night.[17] The moth flies over the crown of trees and in clearings. Sometimes because of high winds it is carried about 100 m (300 ft), it then falls, inert and wings closed, to the ground.[16]",
				"after": "Continuous generations of the moth are present all year. The highest populations are found from March to August (fall and winter), while the lowest are from October to December (spring).[16] The females lay their eggs late in the afternoon or at nightfall, and locate potential oviposition sites visually.[17] Like the eggs of other Uraniidae, the sunset moth's eggs are domed with projecting ribs.[25] A single egg weighs about 1 milligram (3.5×10−5 oz) and usually has 17 ribs, but sometimes 18 or less often 16. The eggs are usually laid on the lower surface of Omphalea leaves, but occasionally on the upper surface. Eggs are laid in groups of 60 to 110, usually about 80.[16]",
			"color": "black|0.21698 dark|0.18414 olive|0.18414 green|0.18414 dark|0.12838 khaki|0.12838 pale|0.056093 golden|0.056093 rod|0.056093 light|0.040005 golden|0.040005 rod|0.040005 yellow|0.040005 lemon|0.039234 chiffon|0.039234 beige|0.02927 light|0.027305 yellow|0.027305 corn|0.026305 silk|0.026305 wheat|0.021151 dim|0.019487 gray|0.019487 dim|0.019487 grey|0.019487 old|0.01803 lace|0.01803 papaya|0.017206 whip|0.017206 ivory|0.016748 antique|0.01588 white|0.01588 gray|0.013758 grey|0.013758 linen|0.013656 floral|0.013552 white|0.013552 blanched|0.012417 almond|0.012417 honeydew|0.01172  "
		}
	}
}
