{
	"add": {
		"doc": {
			"id": "9943e17e12d4ff60b88c61a3dd206849f02ec3e9059096f0e91826cdcea3cba8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Combustor_diagram_componentsPNG.png/440px-Combustor_diagram_componentsPNG.png",
				"previous": "Advancements in combustor technology focused on several distinct areas; emissions, operating range, and durability. Early jet engines produced large amounts of smoke, so early combustor advances, in the 1950s, were aimed at reducing the smoke produced by the engine. Once smoke was essentially eliminated, efforts turned in the 1970s to reducing other emissions, like unburned hydrocarbons and carbon monoxide (for more details, see the Emissions section below). The 1970s also saw improvement in combustor durability, as new manufacturing methods improved liner (see Components below) lifetime by nearly 100 times that of early liners. In the 1980s combustors began to improve their efficiency across the whole operating range; combustors tended to be highly efficient (99%+) at full power, but that efficiency dropped off at lower settings. Development over that decade improved efficiencies at lower levels. The 1990s and 2000s saw a renewed focus on reducing emissions, particularly nitrogen oxides. Combustor technology is still being actively researched and advanced, and much modern research focuses on improving the same aspects.[3]",
				"after": "The case is the outer shell of the combustor, and is a fairly simple structure. The casing generally requires little maintenance.[4] The case is protected from thermal loads by the air flowing in it, so thermal performance is of limited concern. However, the casing serves as a pressure vessel that must withstand the difference between the high pressures inside the combustor and the lower pressure outside. That mechanical (rather than thermal) load is a driving design factor in the case.[5]",
			"color": "black|0.48534 dim|0.22366 gray|0.22366 dim|0.22366 grey|0.22366 gray|0.12987 grey|0.12987 dark|0.029351 gray|0.029351 dark|0.029351 grey|0.029351 red|0.02917 chocolate|0.026067 light|0.010163 coral|0.010163 brown|0.0048875 silver|0.0047324 saddle|0.0046548 brown|0.0046548 white|0.0039701 smoke|0.0039701  "
		}
	}
}
