{
	"add": {
		"doc": {
			"id": "9956cb64374ae9be700e482b73952cf7f6c63fc8846ea134732209e69b4553c9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Breakfast_at_Tamahan_Ryokan%2C_Kyoto.jpg/220px-Breakfast_at_Tamahan_Ryokan%2C_Kyoto.jpg",
				"previous": "During the Edo period, the chōnin (\"townspeople\") overtook the samurai aristocracy as producers and consumers of literature. The popularity of the works of Saikaku, for example, reveals this change in readership and authorship, while Bashō revivified the poetic tradition of the Kokinshū with his haikai (haiku) and wrote the poetic travelogue Oku no Hosomichi.[208] The Meiji era saw the decline of traditional literary forms as Japanese literature integrated Western influences. Natsume Sōseki and Mori Ōgai were the first \"modern\" novelists of Japan, followed by Ryūnosuke Akutagawa, Jun'ichirō Tanizaki, Yukio Mishima and, more recently, Haruki Murakami. Japan has two Nobel Prize-winning authors—Yasunari Kawabata (1968) and Kenzaburō Ōe (1994).[205]",
				"after": "Japanese cuisine is based on combining staple foods, typically Japanese rice or noodles, with a soup and okazu — dishes made from fish, vegetable, tofu and the like – to add flavor to the staple food. In the early modern era ingredients such as red meats that had previously not been widely used in Japan were introduced. Japanese cuisine is known for its emphasis on seasonality of food,[209] quality of ingredients and presentation. Japanese cuisine offers a vast array of regional specialties that use traditional recipes and local ingredients. The Michelin Guide has awarded restaurants in Japan more Michelin stars than the rest of the world combined.[210]",
			"color": "black|0.50894 tan|0.06029 burly|0.049177 wood|0.049177 light|0.022554 gray|0.022554 light|0.022554 grey|0.022554 silver|0.020534 gainsboro|0.019169 wheat|0.01914 dark|0.018555 gray|0.018555 dark|0.018555 grey|0.018555 dim|0.018531 gray|0.018531 dim|0.018531 grey|0.018531 golden|0.016947 rod|0.016947 gray|0.014454 grey|0.014454 dark|0.01351 golden|0.01351 rod|0.01351 antique|0.012915 white|0.012915 navajo|0.012909 white|0.012909 saddle|0.01242 brown|0.01242 linen|0.0095003 peach|0.0094316 puff|0.0094316 moccasin|0.0088002 bisque|0.007843 dark|0.0075136 khaki|0.0075136 sea|0.0069769 shell|0.0069769 white|0.0069365 smoke|0.0069365 peru|0.0068026 pale|0.0060947 golden|0.0060947 rod|0.0060947 old|0.0060076 lace|0.0060076 floral|0.0057651 white|0.0057651 blanched|0.0055896 almond|0.0055896 misty|0.0055623 rose|0.0055623 papaya|0.0053142 whip|0.0053142  "
		}
	}
}
