{
	"add": {
		"doc": {
			"id": "995b23f010dfb74e261c7e3bda59ded117b31d55c6056e7ad1ce7efef4f8d548",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/U.S._Marines_with_Marine_Attack_Squadron_%28VMA%29_211_replace_the_wings_of_an_AV-8B_Harrier_II_aircraft_at_Camp_Bastion_in_Helmand_province%2C_Afghanistan%2C_Sept_120903-M-EF955-059.jpg/220px-thumbnail.jpg",
				"previous": "Perhaps the most thorough redesign was of the wing, the objective being to match the performance of the cancelled AV-16 while retaining the Pegasus engine of the AV-8A.[78] Engineers designed a new, one-piece supercritical wing, which improves cruise performance by delaying the rise in drag and increasing lift-to-drag ratio.[78] Made of composites, the wing is thicker and has a longer span than that of the AV-8A. Compared to the AV-8A's wing, it has a higher aspect ratio, reduced sweep (from 40° to 37°), and an area increased from 200 sq ft (18.6 m2) to 230 sq ft (21.4 m2). The wing has a high-lift configuration, employing flaps that deploy automatically when maneuvering, and drooped ailerons. Using the leading edge root extensions, the new wing allows for a 6,700 lb (3,035 kg) increase in payload compared with the first-generation Harriers after a 1,000 ft (300 m) takeoff roll.[79] Because the wing is almost exclusively composite, it is 330 lb (150 kg) lighter than the AV-8A's smaller wing.[78]",
				"after": "The Harrier II was the first combat aircraft to extensively employ carbon-fiber composite materials, exploiting their light weight and high strength;[80][81] they are used in the wings, rudder, flaps, nose, forward fuselage, and tail. Twenty-six percent of the aircraft's structure is made of composites, reducing its weight by 480 lb (217 kg) compared to a conventional metal structure.[76]",
			"color": "light|0.23021 gray|0.23021 light|0.23021 grey|0.23021 silver|0.19746 gainsboro|0.1379 dim|0.095542 gray|0.095542 dim|0.095542 grey|0.095542 misty|0.072164 rose|0.072164 dark|0.063687 gray|0.063687 dark|0.063687 grey|0.063687 gray|0.054704 grey|0.054704 black|0.0337 peru|0.012504 tan|0.011576 rosy|0.0097363 brown|0.0097363 golden|0.0090843 rod|0.0090843 saddle|0.0077079 brown|0.0077079 orange|0.0070559 dark|0.00694 golden|0.00694 rod|0.00694 linen|0.0069028  "
		}
	}
}
