{
	"add": {
		"doc": {
			"id": "995db759952bff2a6594087b605e1a50ebc0a460edcdc9d01acedf8327d905fa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Government_aircraft_of_Japan_at_Hunter_Army_Airfield.jpg/220px-Government_aircraft_of_Japan_at_Hunter_Army_Airfield.jpg",
				"previous": "The passenger version, named 747-8 Intercontinental or 747-8I, is designed to carry up to 467 passengers in a 3-class configuration and fly more than 8,000 nmi (15,000 km) at Mach 0.855. As a derivative of the already common 747-400, the 747-8 has the economic benefit of similar training and interchangeable parts.[173] The type's first test flight occurred on March 20, 2011.[174] At its introduction, the 747-8 surpassed the Airbus A340-600 as the world's longest airliner. The first −8I was delivered in May 2012 to Lufthansa.[175] The 747-8 has received 120 total orders, including 69 for the −8F and 51 for the −8I, As of May 2014[update].[3]",
			"after": [
				"Boeing has studied a number of 747 variants that have not gone beyond the concept stage.",
				"During the late 1960s and early 1970s, Boeing studied the development of a shorter 747 with three engines, to compete with the smaller L-1011 TriStar and DC-10. The 747 trijet would have had more payload, range, and passenger capacity than the L-1011 and DC-10. The center engine would have been fitted in the tail with an S-duct intake similar to the L-1011's. However, engineering studies showed that a total redesign of the 747 wing would be necessary. Maintaining the same 747 handling characteristics would be important to minimize pilot retraining. Boeing decided instead to pursue a shortened four-engine 747, resulting in the 747SP.[183]"
			],
			"color": "black|0.29479 dark|0.18968 gray|0.18968 dark|0.18968 grey|0.18968 dim|0.14814 gray|0.14814 dim|0.14814 grey|0.14814 gray|0.14658 grey|0.14658 light|0.053383 slate|0.053383 gray|0.053383 silver|0.052714 slate|0.048085 gray|0.048085 light|0.020558 gray|0.020558 light|0.020558 grey|0.020558 gainsboro|0.012449 dark|0.0082073 slate|0.0082073 gray|0.0082073 light|0.0074621 steel|0.0074621 blue|0.0074621  "
		}
	}
}
