{
	"add": {
		"doc": {
			"id": "9963ffa728d29cba8f0635dee17649ff0ad52b811e1938b2265d430890ed59e2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Kapoor_cropped.jpg/220px-Kapoor_cropped.jpg",
				"previous": "In 1999, Millennium Park officials and a group of art collectors, curators and architects reviewed the artistic works of 30 different artists and asked two for proposals. American artist Jeff Koons submitted a proposal to erect a permanent 150-foot (46 m) sculpture of a playground slide;[3][4] his glass and steel design featured an observation deck 90 feet (27 m) above the ground that was accessible via an elevator.[5] The committee chose the second design by internationally acclaimed artist Anish Kapoor. Measuring 33 by 66 by 42 feet (10 by 20 by 13 m) and weighing 110 short tons (100 t; 98 long tons), the proposal featured a seamless, stainless steel surface inspired by liquid mercury.[6] This mirror-like surface would reflect the Chicago skyline, but its elliptical shape would distort and twist the reflected image.[7] As visitors walk around the structure, its surface acts like a fun-house mirror as it distorts their reflections.[8]",
				"after": "In the underside of the sculpture is the omphalos, an indentation whose mirrored surface provides multiple reflections of any subject situated beneath it.[9] The apex of the omphalos is 27 feet (8.2 m) above the ground. The concave underside allows visitors to walk underneath to see the omphalos, and through its arch to the other side so that they view the entire structure.[10] During the grand opening week in July 2004, press reports described the omphalos as the \"spoon-like underbelly\".[11][12] The stainless steel sculpture was originally envisioned as the centerpiece of the Lurie Garden at the southeast corner of the park. However, Park officials believed the piece was too large for the Lurie Garden and decided to locate it at AT&T Plaza, despite Kapoor's objections.[13] Skyscrapers to the north along East Randolph Street, including The Heritage, the Smurfit-Stone Building, Two Prudential Plaza, One Prudential Plaza, and Aon Center are visible, reflected on both the east and west sides of the sculpture.",
			"color": "black|0.27479 gray|0.18396 grey|0.18396 dim|0.17632 gray|0.17632 dim|0.17632 grey|0.17632 dark|0.11173 gray|0.11173 dark|0.11173 grey|0.11173 silver|0.087217 dark|0.069408 slate|0.069408 gray|0.069408 rosy|0.044633 brown|0.044633 light|0.02648 gray|0.02648 light|0.02648 grey|0.02648 gainsboro|0.013693  "
		}
	}
}
