{
	"add": {
		"doc": {
			"id": "9973191a815b0d7458a99b637f8743ce492214bfc3e016409af8924013486c66",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Synchronized_Sheep_Judging.jpg/220px-Synchronized_Sheep_Judging.jpg",
				"previous": "Sheep and goats are closely related as both are in the subfamily Caprinae. However, they are separate species, so hybrids rarely occur, and are always infertile. A hybrid of a ewe and a buck (a male goat) is called a sheep-goat hybrid (only a single such animal has been confirmed), and is not to be confused with the sheep-goat chimera, though both are known as \"geep\". Visual differences between sheep and goats include the beard of goats and divided upper lip of sheep. Sheep tails also hang down, even when short or docked, while the short tails of goats are held upwards. Sheep breeds are also often naturally polled (either in both sexes or just in the female), while naturally polled goats are rare (though many are polled artificially). Males of the two species differ in that buck goats acquire a unique and strong odor during the rut, whereas rams do not.[12]",
				"after": "The domestic sheep is a multi-purpose animal, and the more than 200 breeds now in existence were created to serve these diverse purposes.[4][18] Some sources give a count of a thousand or more breeds,[19][20] but these numbers cannot be verified, according to some sources.[7][12] However, several hundred breeds of sheep have been identified by the FAO (Food and Agriculture Organization of the UN), with the estimated number varying somewhat from time to time: e.g. 863 breeds as of 1993,[21] 1314 breeds as of 1995[22] and 1229 breeds as of 2006.[23] (These numbers exclude extinct breeds, which are also tallied by the FAO.) For purposes of such tallies, the FAO definition of a breed is \"either a subspecific group of domestic livestock with definable and identifiable external characteristics that enable it to be separated by visual appraisal from other similarly defined groups within the same species or a group for which geographical and/or cultural separation from phenotypically similar groups has led to acceptance of its separate identity.\"[23] Almost all sheep are classified as being best suited to furnishing a certain product: wool, meat, milk, hides, or a combination in a dual-purpose breed. Other features used when classifying sheep include face color (generally white or black), tail length, presence or lack of horns, and the topography for which the breed has been developed. This last point is especially stressed in the UK, where breeds are described as either upland (hill or mountain) or lowland breeds.[16] A sheep may also be of a fat-tailed type, which is a dual-purpose sheep common in Africa and Asia with larger deposits of fat within and around its tail.",
			"color": "tan|0.58326 black|0.18048 dark|0.070087 gray|0.070087 dark|0.070087 grey|0.070087 gray|0.037836 grey|0.037836 silver|0.036278 dim|0.030552 gray|0.030552 dim|0.030552 grey|0.030552 burly|0.019075 wood|0.019075  "
		}
	}
}
