{
	"add": {
		"doc": {
			"id": "997cbb5c73d58fa193df4a74ec36e6c3028cf4da7b1adb3227c6a448fa11f685",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/UA93_livery_debris.jpg/170px-UA93_livery_debris.jpg",
				"previous": "Since it never reached a target, the exact place intended to be hit by Flight 93 has never been decisively confirmed.[102] Before the attacks, Khalid Sheikh Mohammed, Osama bin Laden, and Mohammed Atef developed a list of potential targets.[9] Bin Laden wanted to destroy the White House and the Pentagon. Sheikh Mohammed wanted to strike the World Trade Center and all three wanted to hit the Capitol. No one else was involved in the initial selection of targets.[9] Bin Laden told 9/11 planner Ramzi bin al-Shibh to advise Mohamed Atta that he preferred the White House over the Capitol as a target.[103] Atta cautioned bin al-Shibh that this would be difficult, but agreed to include the White House as a possible target and suggested they keep the Capitol as an alternative in case the White House proved too difficult. Eventually, Atta told bin al-Shibh that Jarrah planned to hit the Capitol.[103] Atta briefly mentioned the possibility of striking a nuclear facility, but balked after the other attack pilots voiced their opposition.[103] Based on an exchange between Atta and bin al-Shibh two days before the attacks, the White House would be the primary target for the fourth plane and the Capitol the secondary target.[30]",
				"after": "Immediately after the attacks, there was speculation that Camp David was the intended target.[104] According to testimony by captured al-Qaeda member Abu Zubaydah, U.S. officials believed the White House was the intended target.[105] A post-9/11 interview with Sheikh Mohammed and bin al-Shibh by Al Jazeera reporter Yosri Fouda revealed that Flight 93 was headed for the Capitol.[106] The 9/11 Commission Report cited the actions of the crew and passengers in preventing the destruction of either the White House or the Capitol.[24] According to further testimony by Sheikh Mohammed, bin Laden preferred the Capitol over the White House as a target and Sheikh Mohammed revealed that the interview to Fouda was a lie to make the 9/11 attacks seem larger than they were.[30] Salim Hamdan, bin Laden's driver, told interrogators that he knew the flight was headed for the Capitol.[107]",
			"color": "steel|0.10792 blue|0.10792 indian|0.046326 red|0.046326 dark|0.045908 gray|0.045908 dark|0.045908 grey|0.045908 gray|0.045224 grey|0.045224 dim|0.039282 gray|0.039282 dim|0.039282 grey|0.039282 light|0.037483 coral|0.037483 floral|0.030501 white|0.030501 sea|0.030016 shell|0.030016 white|0.028674 smoke|0.028674 snow|0.027118 rosy|0.02618 brown|0.02618 silver|0.026041 white|0.02541 mint|0.024937 cream|0.024937 light|0.021759 gray|0.021759 light|0.021759 grey|0.021759 linen|0.021469 ivory|0.020475 black|0.019774 light|0.019067 slate|0.019067 gray|0.019067 ghost|0.018913 white|0.018913 peach|0.018367 puff|0.018367 gainsboro|0.018294 old|0.017758 lace|0.017758 azure|0.017676 slate|0.017442 gray|0.017442 alice|0.016441 blue|0.016441 antique|0.015667 white|0.015667 lavender|0.014351 blush|0.014351 cadet|0.013647 blue|0.013647 beige|0.013562 corn|0.013498 silk|0.013498 papaya|0.013299 whip|0.013299 bisque|0.013157 misty|0.01253 rose|0.01253 light|0.012386 golden|0.012386 rod|0.012386 yellow|0.012386 lemon|0.012146 chiffon|0.012146 blanched|0.011625 almond|0.011625 light|0.011544 yellow|0.011544 pale|0.010222 golden|0.010222 rod|0.010222  "
		}
	}
}
