{
	"add": {
		"doc": {
			"id": "998caf43d21b19761479db695aff805bad7acceb91ecf64724332dc38a85f7ad",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/PENGUIN_LIFECYCLE_H.JPG/220px-PENGUIN_LIFECYCLE_H.JPG",
				"previous": "Emperor penguins are able to breed at around three years of age, and usually commence breeding around one to three years later.[18] The yearly reproductive cycle begins at the start of the Antarctic winter, in March and April, when all mature emperor penguins travel to colonial nesting areas, often walking 50 to 120 km (31 to 75 mi) inland from the edge of the pack ice.[63] The start of travel appears to be triggered by decreasing day lengths; emperor penguins in captivity have been induced successfully into breeding by using lighting systems mimicking seasonal Antarctic day lengths.[64]",
				"after": "The penguins start courtship in March or April, when the temperature can be as low as −40 °C (−40 °F). A lone male gives an ecstatic display, where it stands still and places its head on its chest before inhaling and giving a courtship call for 1–2 seconds; it then moves around the colony and repeats the call. A male and female then stand face to face, with one extending its head and neck up and the other mirroring it; they both hold this posture for several minutes. Once in pairs, couples waddle around the colony together, with the female usually following the male. Before copulation, one bird bows deeply to its mate, its bill pointed close to the ground, and its mate then does the same.[65]",
			"color": "gainsboro|0.13357 light|0.13191 gray|0.13191 light|0.13191 grey|0.13191 silver|0.066 alice|0.055807 blue|0.055807 dark|0.050609 gray|0.050609 dark|0.050609 grey|0.050609 white|0.049861 smoke|0.049861 lavender|0.047219 black|0.04669 light|0.04476 steel|0.04476 blue|0.04476 ghost|0.040844 white|0.040844 light|0.037258 blue|0.037258 azure|0.030892 snow|0.027614 mint|0.024725 cream|0.024725 white|0.024371 gray|0.023948 grey|0.023948 dim|0.02182 gray|0.02182 dim|0.02182 grey|0.02182 light|0.020215 slate|0.020215 gray|0.020215 lavender|0.019436 blush|0.019436 slate|0.015516 gray|0.015516 sea|0.014726 shell|0.014726 light|0.010921 cyan|0.010921 powder|0.010473 blue|0.010473 floral|0.0093538 white|0.0093538 linen|0.0063097 corn|0.0053661 flower|0.0053661 blue|0.0053661 honeydew|0.0032434  "
		}
	}
}
