{
	"add": {
		"doc": {
			"id": "99b58972497105137ff91e644029a3d7a7cfaf1105c7a5e1767eb2e21db2f9a0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Prado_-_Los_Desastres_de_la_Guerra_-_No._01_-_Tristes_presentimientos_de_lo_que_ha_de_acontecer.jpg/220px-Prado_-_Los_Desastres_de_la_Guerra_-_No._01_-_Tristes_presentimientos_de_lo_que_ha_de_acontecer.jpg",
				"previous": "Plates 1 to 47 consist mainly of realistic depictions of the horrors of the war fought against the French. Most portray the aftermath of battle; they include mutilated torsos and limbs mounted on trees, like \"fragments of marble sculpture\".[6] Both French and Spanish troops tortured and mutilated captives; evidence of such acts is minutely detailed across a number of Goya's plates.[20] Civilian death is also captured in detail. Spanish women were commonly victims of assault and rape. Civilians often followed armies to battle scenes. If their side won, women and children would search the battlefield for their husbands, fathers and sons. If they lost, they fled in fear of being raped or murdered.[22] In plate 9, No quieren (They do not want to), an elderly woman is shown wielding a knife in defence of a young woman who is being assaulted by a soldier.[20]",
				"after": "The group begins with Tristes premoniciones de lo que ha de acontecer (Gloomy premonitions of what must come to pass), in which a man kneels in the darkness with outstretched arms. The following plates describe combat with the French, who—according to art critic Vivien Raynor—are depicted \"rather like Cossacks, bayoneting civilians\", while Spanish civilians are shown \"poleaxing the French.\"[1] Plates 31 to 39 focus on atrocities and were produced on the same batch of plates as the famine group.[24] Others are based on drawings Goya had completed in his Sketchbook-journal, in studies where he examined the theme of the grotesque body in relation to the iconography of the tortured or martyred one. In his India ink wash drawing We cannot look at this (1814–24), he examined the idea of a humiliated inverted body with pathos and tragedy, as he did to comical effect in The Straw Mannequin (1791–92).[25]",
			"color": "black|0.44282 dim|0.22528 gray|0.22528 dim|0.22528 grey|0.22528  "
		}
	}
}
