{
	"add": {
		"doc": {
			"id": "99e9f8e3bac5bfd48b4497c7cf3743108dd9cbf07b463a9f5118aa7b3f4f6613",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/SilviaPinalStatue.JPG/220px-SilviaPinalStatue.JPG",
			"previous": [],
				"after": "Buñuel's style of directing was extremely economical; he shot films in a few weeks, rarely deviating from his script (the scene in Tristana where Catherine Deneuve exposes her breasts to Saturno – but not the audience – being a noted exception) and shooting in order as much as possible to minimize editing time.[251] He remained true throughout his working life to an operating philosophy that he articulated at the beginning of his career in 1928: \"The guiding idea, the silent procession of images that are concrete, decisive, measured in space and time—in a word, the film—was first projected inside the brain of the filmmaker\".[94]:p.135 In this, Buñuel has been compared with Alfred Hitchcock, another director famous for precision, efficiency and preplanning, for whom actually shooting the film was an anticlimax, since each man would know, in Buñuel's words, \"exactly how each scene will be shot and what the final montage will be\".[252] According to actress Jeanne Moreau: \"He was the only director I know who never threw away a shot. He had the film in his mind. When he said 'action' and 'cut,' you knew that what was in between the two would be printed.\"[221]",
			"color": "dark|0.20278 gray|0.20278 dark|0.20278 grey|0.20278 light|0.133 gray|0.133 light|0.133 grey|0.133 gainsboro|0.12044 silver|0.11273 gray|0.066064 grey|0.066064 white|0.062396 smoke|0.062396 linen|0.041531 alice|0.038951 blue|0.038951 ghost|0.036727 white|0.036727 lavender|0.036593 blush|0.036593 sea|0.034223 shell|0.034223 snow|0.033428 light|0.023617 slate|0.023617 gray|0.023617 white|0.018882 dim|0.01399 gray|0.01399 dim|0.01399 grey|0.01399 floral|0.0067178 white|0.0067178 mint|0.006613 cream|0.006613 slate|0.0057704 gray|0.0057704  "
		}
	}
}
