{
	"add": {
		"doc": {
			"id": "99f8428268769dd30bb3f63f6a49b141cd7f9154596774322c7f7d4e38fb2912",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Patriarchate_Constantinopolis.jpg/220px-Patriarchate_Constantinopolis.jpg",
				"previous": "Istanbul has been a cosmopolitan city throughout much of its history, but it has become more homogenized since the end of the Ottoman Empire. Still, most of Turkey's religious and ethnic minorities remain concentrated in Istanbul. The vast majority of people across Turkey, and in Istanbul, consider themselves Muslim, and more specifically members of the Sunni branch of Islam. Most Sunnis follow the Hanafi school of Islamic thought, although approximately 10 percent of Sunnis follow the Shafi'i school. The largest non-Sunni Muslim sect, accounting for 4.5 million Turks, is the Alevis; a third of all Alevis in the country live in Istanbul.[149] Mystic movements, like Sufism, were officially banned after the establishment of the Turkish Republic, but they still boast numerous followers.[150]",
				"after": "The Patriarch of Constantinople has been designated Ecumenical Patriarch since the 6th century, and has subsequently come to be widely regarded as the leader of the world's 300 million Orthodox Christians.[151] Since 1601, the Patriarchate has been based in Istanbul's Church of St. George.[152] Into the 19th century, the Christians of Istanbul tended to be either Greek Orthodox or members of the Armenian Apostolic Church.[153] Because of a number of events during the 20th century—including the 1923 population exchange between Greece and Turkey, a 1942 wealth tax, and the 1955 Istanbul riots—the Greek population, originally centered in Fener and Samatya, has decreased substantially. At the start of the 21st century, Istanbul's Greek population numbered just 3,000 (down from 130,000 in 1923' and 260,000 according to the Ottoman Census of 1910 of 850,000 total).[154][155] There are today between 50,000 and 70,000 Armenians in Istanbul, down from 164,000 in 1913. Christians made up half the population of the city in 1910.[156]",
			"color": "black|0.72954 burly|0.052904 wood|0.052904 tan|0.05111 dim|0.013148 gray|0.013148 dim|0.013148 grey|0.013148 brown|0.011726 saddle|0.0094419 brown|0.0094419 peru|0.0085662 sienna|0.0085281 pale|0.0072414 golden|0.0072414 rod|0.0072414 indian|0.007056 red|0.007056  "
		}
	}
}
