{
	"add": {
		"doc": {
			"id": "99fd677c472bde61b67e9e84f56b4ab4f25ea83bedbcb2e57c3a805ea77e1892",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/L%27Enfant_Plaza_-_IMG_1926.JPG/220px-L%27Enfant_Plaza_-_IMG_1926.JPG",
				"previous": "Pei finally saw his architecture come to life in 1949,[29] when he designed a two-story corporate building for Gulf Oil in Atlanta, Georgia. The building was demolished in February 2013 although the front facade will be retained as part of an apartment development. His use of marble for the exterior curtain wall brought praise from the journal Architectural Forum.[30] Pei's designs echoed the work of Mies van der Rohe in the beginning of his career as also shown in his own weekend-house in Katonah in 1952. Soon Pei was so inundated with projects that he asked Zeckendorf for assistants, which he chose from his associates at the GSD, including Henry N. Cobb and Ulrich Franzen. They set to work on a variety of proposals, including the Roosevelt Field Shopping Mall. The team also redesigned the Webb and Knapp office building, transforming Zeckendorf's office into a circular space with teak walls and a glass clerestory. They also installed a control panel into the desk that allowed their boss to control the lighting in his office. The project took one year and exceeded its budget, but Zeckendorf was delighted with the results.[31]",
				"after": "In 1952 Pei and his team began work on a series of projects in Denver, Colorado. The first of these was the Mile High Center, which compressed the core building into less than twenty-five percent of the total site; the rest is adorned with an exhibition hall and fountain-dotted plazas.[33] One block away, Pei's team also redesigned Denver's Courthouse Square, which combined office spaces, commercial venues, and hotels. These projects helped Pei conceptualize architecture as part of the larger urban geography. \"I learned the process of development,\" he said later, \"and about the city as a living organism.\"[34] These lessons, he said, became essential for later projects.[34] The hyperbolic paraboloid structure was removed when the Denver Pavilions facility was constructed. In 1982, he returned to design the 16th Street Mall, essentially converting a street into a pedestrian only shopping district.",
			"color": "dim|0.23479 gray|0.23479 dim|0.23479 grey|0.23479 rosy|0.14335 brown|0.14335 gray|0.10218 grey|0.10218 black|0.093494 white|0.034812 smoke|0.034812 ghost|0.034411 white|0.034411 snow|0.034258 sea|0.033916 shell|0.033916 white|0.033852 alice|0.033662 blue|0.033662 mint|0.033153 cream|0.033153 floral|0.033088 white|0.033088 azure|0.032988 lavender|0.028841 blush|0.028841 dark|0.021723 gray|0.021723 dark|0.021723 grey|0.021723 dark|0.013582 slate|0.013582 gray|0.013582 silver|0.012348  "
		}
	}
}
