{
	"add": {
		"doc": {
			"id": "9a0486184a67f52e7ab23c62c8e3f43ccc910067b117d72291ccf5adae7a59fc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Llanidan_old_church_arches_from_the_south.jpg/220px-Llanidan_old_church_arches_from_the_south.jpg",
				"previous": "The north wall has a window with two lights (sections of window separated by mullions) topped with trefoils (a pattern of three overlapping circles). The two arched east windows, one in each aisle, are decorated with tracery; the southern window reuses some tracery from the 15th century.[3] The demolished southern chapel had a two-light window similar to that at St Peter's, Newborough, which Jones considered to be of \"very rude workmanship\", and three-light square-headed windows in the east and west walls.[1] Jones also noted the loss of the original window at the end of the northern aisle, which was from the 14th century in his view, and some windows in the north wall \"of excellent workmanship\".[1] The southern aisle, he said, had had \"a small circular headed window, filled up from a pointed one\" at the eastern end; the east window \"was of a design more remarkable for its singularity than its beauty.\"[1]",
				"after": "Two of the six arches in the arcade are inside the church; the other four project beyond the east wall, which has been built around one of the octagonal piers that support the arches. The roof dates from the 15th century, although the visible beams are not original; the roof's exposed wooden trusses rest on sandstone corbels.[3] A 1937 survey by the Royal Commission on Ancient and Historical Monuments in Wales and Monmouthshire noted 20 memorials from the 17th and 18th centuries. It also recorded the presence of a sundial on a pedestal, dated 1768, and some stone shields that were not attached to the building, bearing dates of 1561 and 1563.[16] Most of the fittings now in St Nidan's are not original, and come from other churches in north-west Wales; the granite altar is modern.[3]",
			"color": "black|0.25813 dark|0.1702 olive|0.1702 green|0.1702 dark|0.060844 gray|0.060844 dark|0.060844 grey|0.060844 gray|0.049681 grey|0.049681 dim|0.044788 gray|0.044788 dim|0.044788 grey|0.044788 silver|0.043182 light|0.032078 gray|0.032078 light|0.032078 grey|0.032078 olive|0.030431 drab|0.030431 gainsboro|0.025551 pale|0.023424 golden|0.023424 rod|0.023424 light|0.0223 golden|0.0223 rod|0.0223 yellow|0.0223 lemon|0.021324 chiffon|0.021324 linen|0.017546 sea|0.016377 shell|0.016377 white|0.01581 smoke|0.01581 floral|0.015626 white|0.015626 snow|0.013486 beige|0.012808 old|0.012567 lace|0.012567 light|0.011763 yellow|0.011763 white|0.011268 mint|0.010922 cream|0.010922 corn|0.010302 silk|0.010302 ivory|0.0097391 ghost|0.0090226 white|0.0090226 lavender|0.0083323 blush|0.0083323 antique|0.0083058 white|0.0083058  "
		}
	}
}
