{
	"add": {
		"doc": {
			"id": "9a0a3243dca8948cd696df4e0e96caa0c612e4c7d1168ee171c7ab62797dd282",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/PAA_San_Francisco_-_Manila_-_Hong_Kong_Clipper_Schedule.jpg/220px-PAA_San_Francisco_-_Manila_-_Hong_Kong_Clipper_Schedule.jpg",
				"previous": "On July 5, 1937 survey flights across the North Atlantic began.[20] Pan Am Clipper III, a Sikorsky S-42, landed at Botwood in the Bay of Exploits in Newfoundland from Port Washington, via Shediac, New Brunswick. The next day Pan Am Clipper III left Botwood for Foynes in Ireland. The same day, a Short Empire C-Class flying boat, the Caledonia, left Foynes for Botwood, and landed July 6, 1937, reaching Montreal on July 8 and New York on July 9.",
				"after": "Trippe decided to start a service from San Francisco to Honolulu and on to Hong Kong and Auckland following steamship routes. After negotiating traffic rights in 1934 to land at Pearl Harbor, Midway Island, Wake Island, Guam, and Subic Bay (Manila),[22] Pan Am shipped $500,000 worth of aeronautical equipment westward in March 1935 using the North Haven, a 15,000 ton merchant ship it chartered for the purpose of provisioning each island that the clippers would stop at on their 4 to 5-day flight.[23] Pan Am ran its first survey flight to Honolulu in April 1935 with a Sikorsky S-42 flying boat.[24] The airline won the contract for a San Francisco – Canton mail route later that year and operated its first commercial flight carrying mail and express (no passengers) in a Martin M-130 from Alameda to Manila amid media fanfare on November 22, 1935. The five-leg, 8,000-mile (12,875 km) flight arrived in Manila on November 29 and returned to San Francisco on December 6, cutting the time between the two cities via the fastest scheduled steamship by over two weeks.[25] (Both the United States and Philippine Islands issued special stamps for the two flights.) The first passenger flight left Alameda on October 21, 1936.[26] The fare from San Francisco to Manila or Hong Kong in 1937 was $950 one way (about $15580 in 2014) and $1,710 round trip.[27]",
			"color": " "
		}
	}
}
