{
	"add": {
		"doc": {
			"id": "9a13e26ebed8c60e8cf5a63c9f14c6e2ecc2ba2e7dcb470b80990007cc25a84d",
			"url": "https://upload.wikimedia.org/wikipedia/en/5/59/2004-10-29_Bin_Laden_still.jpg",
				"previous": "Bin Laden, who orchestrated the attacks, initially denied but later admitted involvement.[1][13][14] Al Jazeera broadcast a statement by bin Laden on September 16, 2001, stating, \"I stress that I have not carried out this act, which appears to have been carried out by individuals with their own motivation.\"[15] In November 2001, U.S. forces recovered a videotape from a destroyed house in Jalalabad, Afghanistan. In the tape, bin Laden is seen talking to Khaled al-Harbi and admits foreknowledge of the attacks.[16] On December 27, 2001, a second bin Laden video was released. In the video, he said, \"It has become clear that the West in general and America in particular have an unspeakable hatred for Islam....It is the hatred of crusaders. Terrorism against America deserves to be praised because it was a response to injustice, aimed at forcing America to stop its support for Israel, which kills our people...We say that the end of the United States is imminent, whether Bin Laden or his followers are alive or dead, for the awakening of the Muslim umma (nation) has occurred\", but he stopped short of admitting responsibility for the attacks.[17] The transcript references several times to the United States specifically targeting Muslims.",
				"after": "Shortly before the U.S. presidential election in 2004, in a taped statement, bin Laden publicly acknowledged al-Qaeda's involvement in the attacks on the U.S. and admitted his direct link to the attacks. He said that the attacks were carried out because, \"we are free ... and want to regain freedom for our nation. As you undermine our security we undermine yours.\"[18] Bin Laden said he had personally directed his followers to attack the World Trade Center.[14][19] Another video obtained by Al Jazeera in September 2006 shows bin Laden with Ramzi bin al-Shibh, as well as two hijackers, Hamza al-Ghamdi and Wail al-Shehri, as they make preparations for the attacks.[20] The U.S. never formally indicted bin Laden for the 9/11 attacks but he was on the FBI's Most Wanted List for the bombings of the U.S. Embassies in Dar es Salaam, Tanzania, and Nairobi, Kenya.[21][22] After a nearly 10-year manhunt, bin Laden was killed by American special forces in a compound in Abbottabad, Pakistan on May 2, 2011.[23][24]",
			"color": "sandy|0.080157 brown|0.080157 ivory|0.050846 old|0.049794 lace|0.049794 floral|0.047491 white|0.047491 peru|0.04618 burly|0.042704 wood|0.042704 linen|0.041501 beige|0.0413 corn|0.039245 silk|0.039245 sea|0.037921 shell|0.037921 tan|0.037708 honeydew|0.037122 navajo|0.036751 white|0.036751 light|0.034356 yellow|0.034356 mint|0.033539 cream|0.033539 papaya|0.030069 whip|0.030069 antique|0.026537 white|0.026537 white|0.026406 snow|0.024683 peach|0.022343 puff|0.022343 light|0.022067 golden|0.022067 rod|0.022067 yellow|0.022067 white|0.020457 smoke|0.020457 blanched|0.019984 almond|0.019984 bisque|0.018265 lemon|0.017978 chiffon|0.017978 pale|0.017404 golden|0.017404 rod|0.017404 moccasin|0.015994 wheat|0.015316 saddle|0.01349 brown|0.01349 dark|0.0099316 salmon|0.0099316 azure|0.0091637 khaki|0.0082831 sienna|0.0072577 black|0.005187 ghost|0.0051624 white|0.0051624  "
		}
	}
}
