{
	"add": {
		"doc": {
			"id": "9a1f5d857b5e3a6ce3dde91216e6540b572fff54f988a92a76e4d6a7eb09f882",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/80_-_Machu_Picchu_-_Juin_2009_-_edit.2.jpg/220px-80_-_Machu_Picchu_-_Juin_2009_-_edit.2.jpg",
				"previous": "The earliest evidences of human presence in Peruvian territory have been dated to approximately 9,000 BC.[13] Andean societies were based on agriculture, using techniques such as irrigation and terracing; camelid husbandry and fishing were also important. Organization relied on reciprocity and redistribution because these societies had no notion of market or money.[14] The oldest known complex society in Peru, the Norte Chico civilization, flourished along the coast of the Pacific Ocean between 3,000 and 1,800 BC.[15] These early developments were followed by archaeological cultures that developed mostly around the coastal and Andean regions throughout Peru. The Cupisnique culture which flourished from around 1000 to 200 BC[16] along what is now Peru's Pacific Coast was an example of early pre-Incan culture. The Chavín culture that developed from 1500 to 300 BC was probably more of a religious than a political phenomenon, with their religious centre in Chavin de Huantar.[17] After the decline of the Chavin culture around the beginning of the Christian millennium, a series of localized and specialized cultures rose and fell, both on the coast and in the highlands, during the next thousand years. On the coast, these included the civilizations of the Paracas, Nazca, Wari, and the more outstanding Chimu and Mochica. The Mochica who reached their apogee in the first millennium AD were renowned for their irrigation system which fertilized their arid terrain, their sophisticated ceramic pottery, their lofty buildings, and clever metalwork. The Chimu were the great city builders of pre-Inca civilization; as loose confederation of cities scattered along the coast of northern Peru and southern Ecuador, the Chimu flourished from about 1150 to 1450. Their capital was at Chan Chan outside of modern-day Trujillo. In the highlands, both the Tiahuanaco culture, near Lake Titicaca in both Peru and Bolivia, and the Wari culture, near the present-day city of Ayacucho, developed large urban settlements and wide-ranging state systems between 500 and 1000 AD.[18]",
				"after": "In the 15th century, the Incas emerged as a powerful state which, in the span of a century, formed the largest empire in pre-Columbian America with their capital in Cusco.[19] The Incas of Cusco originally represented one of the small and relatively minor ethnic groups, the Quechuas. Gradually, as early as the thirteenth century, they began to expand and incorporate their neighbors. Inca expansion was slow until about the middle of the fifteenth century, when the pace of conquest began to accelerate, particularly under the rule of the great emperor Pachacuti. Under his rule and that of his son, Topa Inca Yupanqui, the Incas came to control upwards of a third of South America, with a population of 9 to 16 million inhabitants under their rule. Pachacuti also promulgated a comprehensive code of laws to govern his far-flung empire, while consolidating his absolute temporal and spiritual authority as the God of the Sun who ruled from a magnificently rebuilt Cusco.[20] From 1438 to 1533, the Incas used a variety of methods, from conquest to peaceful assimilation, to incorporate a large portion of western South America, centered on the Andean mountain ranges, from southern Colombia to Chile, between the Pacific Ocean in the west and the Amazon rainforest in the east. The official language of the empire was Quechua, although hundreds of local languages and dialects were spoken. The Inca referred to their empire as Tawantinsuyu which can be translated as \"The Four Regions\" or \"The Four United Provinces.\" Many local forms of worship persisted in the empire, most of them concerning local sacred Huacas, but the Inca leadership encouraged the worship of Inti, the sun god and imposed its sovereignty above other cults such as that of Pachamama.[21] The Incas considered their King, the Sapa Inca, to be the \"child of the sun.\"[22]",
			"color": "black|0.64481 burly|0.10161 wood|0.10161 tan|0.07587 dim|0.046858 gray|0.046858 dim|0.046858 grey|0.046858  "
		}
	}
}
