{
	"add": {
		"doc": {
			"id": "9a27d278c944fe8806c6eb64735f33b0a62866fb8a4730cb2c7e0fb1fe76279f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Ricketts_Glen_State_Park_Office.jpg/220px-Ricketts_Glen_State_Park_Office.jpg",
				"previous": "On October 12, 1969, the Glens Natural Area and its waterfalls was named a National Natural Landmark, and it became a Pennsylvania State Park Natural Area in 1993, which guarantees it \"will be protected and maintained in a natural state\".[3][14] In 1987 the park's ten cabins opened.[61] In 1997 the park was named one of the first 73 Important Bird Areas in the state by the Pennsylvania chapter of the National Audubon Society.[62] That same year heavy rains washed out two bridges on the Falls Trail; because of the difficulty of transporting materials on the trail, an Army National Guard helicopter dropped 36-foot (11 m) poles into the glens to rebuild the bridges in early 1997.[63] In the winter of 1997 ice climbing was allowed in the Ganoga Glen section of the park for the first time.[64] That same year training was undertaken by local fire companies to rescue people injured in the park when icy conditions make reaching and transporting them especially treacherous.[65] In 1998 a project to \"repair and improve the Falls Trail\" began, with three park employees carrying materials in on foot to stabilize the trail, fix steps, cut down on erosion, and repair some bridges. Originally planned to take four years; it ended up taking six years to complete and cost nearly $1 million.[32][66]",
				"after": "In September 1999 the remnants of Hurricane Floyd caused massive damage to the park, temporarily closing it and downing thousands of trees. The DCNR hired Carson Helicopters to salvage timber from the downed beech, cherry, maple, and oak trees for $994,000; a crew of 36 workers spent several months cutting the fallen trees into manageable logs, then helicopters flew the logs to the Hayfield area of the park. The salvage operation ran until the fall of 2001, and yielded 3,500,000 board feet (8,300 m3) of lumber. The operation had revenue of almost $7 million, and had the ecological advantage of not requiring heavy logging equipment or new roads in the park.[67][68][69][70]",
			"color": "dark|0.28906 gray|0.28906 dark|0.28906 grey|0.28906 gray|0.24612 grey|0.24612 dim|0.14997 gray|0.14997 dim|0.14997 grey|0.14997 silver|0.062396 slate|0.046794 gray|0.046794 black|0.031592 light|0.028409 slate|0.028409 gray|0.028409 dark|0.025233 olive|0.025233 green|0.025233 light|0.020788 gray|0.020788 light|0.020788 grey|0.020788 dark|0.017814 slate|0.017814 gray|0.017814 gainsboro|0.013911 white|0.0062845 smoke|0.0062845 floral|0.0056999 white|0.0056999 sea|0.0056403 shell|0.0056403 linen|0.0054877 mint|0.0053012 cream|0.0053012 snow|0.0049918  "
		}
	}
}
