{
	"add": {
		"doc": {
			"id": "9a43220c0efb64a161a33459b5b4e80e53a396cb47ea58bcc4de2ebeb4f3f4d5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/1_St_James_j.JPG/280px-1_St_James_j.JPG",
				"previous": "During the 1880s Sydney became a prosperous city, commerce and industry flourished, and the suburbs expanded. As more churches were built and fewer people lived in the heart of the city, the congregation of St James' Church shrank. The challenge that it faced was to minister effectively to city workers, rather than dwellers, to serve the poor of the city, and to attract those whose preference was for the style of worship and intellectual, topical preaching that distinguished St James' from many of the newly created parish churches.[40] The young Henry Latimer Jackson, from Cambridge, was appointed in 1885. He introduced weekday services and a magazine called The Kalendar, one of Australia's first parish papers.[41] He also lectured at Sydney University, addressed conferences, spoke at synod and acted as secretary to the newly established Sydney Church of England Boys' Grammar School.[42] However, his sermons were described as \"not so much opposed, as simply not understood\".[43] He resigned in 1895 after accepting a position in the Diocese of Ely.[44]",
				"after": "Although Sydney was prospering, St James' had an acute shortage of money and \"the government considered resuming the site for a city railway\".[43][45] The trustees at this time leased the parsonage and, in 1894, used the money for urgent restoration to the exterior of the building. The architect Varney Parkes replaced the old spire, using copper that was pre-weathered so that there was no radical change in its appearance.[46] He removed infilling from the north portico and designed a new portico and entrance to the tower to match that of the eastern vestry. The result was to make the north face of the building its most significant aspect.[45]",
			"color": "black|0.25563 slate|0.07768 gray|0.07768 light|0.076275 slate|0.076275 gray|0.076275 dim|0.075091 gray|0.075091 dim|0.075091 grey|0.075091 gray|0.045556 grey|0.045556 light|0.042637 blue|0.042637 light|0.040228 steel|0.040228 blue|0.040228 steel|0.03987 blue|0.03987 sky|0.032316 blue|0.032316 dark|0.027039 slate|0.027039 gray|0.027039 powder|0.025827 blue|0.025827 dark|0.025782 gray|0.025782 dark|0.025782 grey|0.025782 light|0.02577 cyan|0.02577 light|0.024735 sky|0.024735 blue|0.024735 pale|0.02267 turquoise|0.02267 azure|0.019635 alice|0.017924 blue|0.017924 mint|0.015162 cream|0.015162 white|0.012799 smoke|0.012799 white|0.01177 ghost|0.011289 white|0.011289 snow|0.010262  "
		}
	}
}
