{
	"add": {
		"doc": {
			"id": "9a8df2f68cebdda79b85a1da8b96be5d8c5f0a70afea55ce6b8eacd7e3a5713c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Albatroz_-_Panorama_1837.jpg/220px-Albatroz_-_Panorama_1837.jpg",
			"previous": [],
				"after": "Albatrosses have been described as \"the most legendary of all birds\".[36] An albatross is a central emblem in The Rime of the Ancient Mariner by Samuel Taylor Coleridge; a captive albatross is also a metaphor for the poète maudit in a poem of Charles Baudelaire. It is from the Coleridge poem that the usage of albatross as a metaphor is derived; someone with a burden or obstacle is said to have \"an albatross around their neck\", the punishment given in the poem to the mariner who killed the albatross. In part due to the poem, there is a widespread myth that (all) sailors believe it disastrous to shoot or harm an albatross; in truth, sailors regularly killed and ate them,[22] e.g., as reported by James Cook in 1772. On the other hand, it has been reported that sailors caught the birds, but supposedly let them free again;[39] the possible reason is that albatrosses were often regarded as the souls of lost sailors,[40] so that killing them was supposedly viewed as bringing bad luck.[39] The head of an albatross being caught with a hook is used as the emblem of the Cape Horners, i.e. sailors who have rounded Cape Horn on freighters under sail; captains of such ships even received themselves the title \"albatrosses\" in the Cape Horners' organisation.[39]",
			"color": "dark|0.24831 gray|0.24831 dark|0.24831 grey|0.24831 silver|0.18842 gray|0.16248 grey|0.16248 dim|0.15811 gray|0.15811 dim|0.15811 grey|0.15811 light|0.083665 gray|0.083665 light|0.083665 grey|0.083665 gainsboro|0.046731 black|0.030522 linen|0.013151 sea|0.008048 shell|0.008048 old|0.0079052 lace|0.0079052 white|0.0077715 smoke|0.0077715 floral|0.0067615 white|0.0067615 antique|0.0066565 white|0.0066565 snow|0.0045088 mint|0.0042596 cream|0.0042596 ivory|0.0041116 dark|0.0039697 slate|0.0039697 gray|0.0039697 slate|0.0032669 gray|0.0032669  "
		}
	}
}
