{
	"add": {
		"doc": {
			"id": "9aa6957ab6ab8dd5ee0b32946e37a45ffb97cf6fde99724312e030ee8b43a8e4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/PaulKane-HuntingFish-ROM.jpg/220px-PaulKane-HuntingFish-ROM.jpg",
				"previous": "The five principal Menominee clans are the Bear, the Eagle, the Wolf, the Crane, and the Moose. Each has traditional responsibilities within the tribe. With a patrilineal kinship system, traditional Menominee believe that children derive their social status from their fathers, and are born \"into\" their father's clan. Members of the same clan are considered relatives, so must choose marriage partners from outside their clan.[9] Ethnologist James Mooney wrote an article on the Menominee which appeared in Catholic Encyclopedia (1913), incorrectly reporting that their descent and inheritance proceeds through the female line, as a matrilineal kinship system, which is common among many other Native American peoples, including other Algonquian tribes.",
			"after": [
				"Menominee mythology is rich with ethical meaning. It has many elements in common with the sacred literature and cultures of other Native American peoples.",
				"Traditional Menominee believe that the Earth forms a partition between the upper and lower worlds. The upper world represents good and the lower world represents evil.[citation needed] These two worlds are divided into several layers, the furthest being the most powerful. The Sun is at the highest level in the upper world, followed by the Thunderbird and the Morning Star, the Golden Eagles (symbols of war) and other birds, led by the Bald Eagle.[citation needed] The first level below the earth in the lower world is occupied by the Horned Serpent. The succeeding lower levels are the home of the White Deer, who helped create the Medicine Dance; and then the next level is that of the Underwater Panther. The lowest level is ruled by the Great White Bear.[citation needed]"
			],
			"color": "black|0.16765 dim|0.15981 gray|0.15981 dim|0.15981 grey|0.15981 gray|0.15761 grey|0.15761 dark|0.13918 gray|0.13918 dark|0.13918 grey|0.13918 rosy|0.060174 brown|0.060174 light|0.053653 steel|0.053653 blue|0.053653 silver|0.048898 light|0.020856 slate|0.020856 gray|0.020856 thistle|0.020662 light|0.017325 gray|0.017325 light|0.017325 grey|0.017325 misty|0.015894 rose|0.015894 slate|0.013398 gray|0.013398 tan|0.013151  "
		}
	}
}
