{
	"add": {
		"doc": {
			"id": "9ae5c78137d10f0279d2e6be24d1ca53708736cca8f8f46c6d43ef2a0be8b541",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/56/Pacific_Place_Port_Moresby_November_2013.jpg/220px-Pacific_Place_Port_Moresby_November_2013.jpg",
			"previous": [],
				"after": "Papua New Guinea is richly endowed with natural resources, including mineral and renewable resources, such as forests, marine (including a large portion of the world's major tuna stocks), and in some parts agriculture. The rugged terrain — including high mountain ranges and valleys, swamps and islands — and high cost of developing infrastructure, combined with other factors (including serious law and order problems in some centres and the system of customary land title) makes it difficult for outside developers. Local developers are handicapped by years of deficient investment in education, health, ICT and access to finance. Agriculture, for subsistence and cash crops, provides a livelihood for 85% of the population and continues to provide some 30% of GDP. Mineral deposits, including gold, oil, and copper, account for 72% of export earnings. Oil palm production has grown steadily over recent years (largely from estates and with extensive outgrower output), with palm oil now the main agricultural export. In households participating, coffee remains the major export crop (produced largely in the Highlands provinces), followed by cocoa and coconut oil/copra from the coastal areas, each largely produced by smallholders and tea, produced on estates and rubber. The Iagifu/Hedinia Field was discovered in 1986 in the Papuan fold and thrust belt.[42]:471",
			"color": "light|0.29457 steel|0.29457 blue|0.29457 dim|0.17454 gray|0.17454 dim|0.17454 grey|0.17454 gray|0.077514 grey|0.077514 black|0.064384 slate|0.058174 gray|0.058174 light|0.055305 slate|0.055305 gray|0.055305 dark|0.05109 slate|0.05109 gray|0.05109 dark|0.04256 gray|0.04256 dark|0.04256 grey|0.04256 silver|0.033455 light|0.031372 gray|0.031372 light|0.031372 grey|0.031372 gainsboro|0.024447 light|0.02439 blue|0.02439 lavender|0.010702 white|0.006998 smoke|0.006998 alice|0.0068997 blue|0.0068997  "
		}
	}
}
