{
	"add": {
		"doc": {
			"id": "9b0fedde8f6b84488563012893357bd0f5c5a3410e92ecfcdee81afea485e1df",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Parrett_Ironworks.jpg/220px-Parrett_Ironworks.jpg",
				"previous": "At Langport, the Great Bow Bridge, which now carries the A378, is a three-arched bridge, constructed under the terms of the Parrett Navigation Act of 1836. Completed in 1841 at a cost of £3,749,[101] it replaced the previous medieval bridge, with its nine tiny arches, all too small to allow navigation. A bridge at this site was first mentioned in 1220.[118] The medieval bridge consisted of a total of 31 arches, of which nine crossed the river, and 19 of the original arches were located by ground-penetrating radar in 1987, buried beneath the road which runs from Great Bow Bridge to Little Bow Bridge.[14] The Warehouse in Langport was built in the late 18th century of English bond red brick, with Flemish bond extensions. It has clay plain tile roofs with hipped ends. It was built by the Parrett Navigation Company, a trading company owned by Vincent Stuckey and Walter Bagehot, on the banks of the River.[119] When the river became unnavigable, the building was no longer needed, and it was eventually abandoned. The Somerset Trust for Sustainable Development, which became the Ecos Trust, purchased the site, designated as a brown field site, in February 2003, and worked with Somerset Buildings Preservation Trust, English Heritage and local councils to redevelop it into a craft, heritage learning and small business centre, with the surrounding land being used for an eco-friendly housing development.[119] It is a grade II listed building.[120]",
				"after": "The newest bridge across the Parrett is Cocklemoor Bridge, a pedestrian footbridge close to the Great Bow Bridge. It was erected in 2006 and forms part of the River Parrett Trail.[121] The next bridge upstream is Bicknell's bridge, which was formerly known as Bickling bridge, which carries the road from Huish Episcopi to Muchelney. It replaced a footbridge in 1829 or 1830.[122] At Muchelney the Westover Bridge carries a minor road over the river, and another minor road crosses on the Thorney Bridge close to the Thorney (or silent) Mill and a lock. The mill, with an iron overshot wheel, which was built to grind corn in 1823.[123] Another bridge and mill occurs further upstream at Gawbridge west of Martock, where the mill has been the subject of a feasibility study by the South Somerset Hydropower Group.[124] Carey's Mill Bridge was built of Ham stone in the 18th century and named after Carey's Mill which originally occupied the site.[125] It is surrounded by a collection of buildings known as the Parrett Iron Works,[126] founded in 1855,[127] on the site of a former snuff mill,[128] which included a foundry, with a prominent chimney,[129] ropewalk,[130] workshops[131][132] and several smaller workshops and cottages.[133][134][135][136] The sluice which powered the waterwheel[137] and sluice keeper's cottage still exist.[138] Further south the river flows under the A303 near Norton-sub-Hamdon and the A356 near Chedington.",
			"color": "black|0.28943 tan|0.2585 dark|0.12998 gray|0.12998 dark|0.12998 grey|0.12998 burly|0.10614 wood|0.10614 dark|0.047012 olive|0.047012 green|0.047012 silver|0.042818 gray|0.024536 grey|0.024536 wheat|0.017005 light|0.013554 gray|0.013554 light|0.013554 grey|0.013554 peach|0.011787 puff|0.011787  "
		}
	}
}
