{
	"add": {
		"doc": {
			"id": "9b1357787ed4dc83b791eb27825b689db3a04ff954071d349fddde9743fd7b53",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/T._rex_versus_A._atrox_feet.JPG/220px-T._rex_versus_A._atrox_feet.JPG",
				"previous": "Jack Horner and Don Lessem argued in 1993 that Tyrannosaurus was slow and probably could not run (no airborne phase in mid-stride), because its ratio of femur (thigh bone) to tibia (shin bone) length was greater than 1, as in most large theropods and like a modern elephant.[69] However, Holtz (1998) noted that tyrannosaurids and some closely related groups had significantly longer distal hindlimb components (shin plus foot plus toes) relative to the femur length than most other theropods, and that tyrannosaurids and their close relatives had a tightly interlocked metatarsus that more effectively transmitted locomotory forces from the foot to the lower leg than in earlier theropods (\"metatarsus\" means the foot bones, which function as part of the leg in digitigrade animals). He therefore concluded that tyrannosaurids and their close relatives were the fastest large theropods.[97] Thomas Holtz Jr. would echo these sentiments in his 2013 lecture, stating that the giant allosaurs had shorter feet for the same body size than Tyrannosaurus, whereas Tyrannosaurus had longer, skinnier and more interlocked feet for the same body size; attributes of faster moving animals.[55]",
				"after": "A study by Eric Snively and Anthony P Russel published on 2003 would also find that the tyrannosaurid arctometatarsals, and the and its elastic ligaments worked together in what he called a 'tensile keystone model' to strengthen the feet of Tyrannosaurus, increase the animals stability and add greater resistance to dissociation over that of other theropod families; while still allowing resiliency that is otherwise reduced in ratites, horses, giraffids and other animals with metapodia to a single element. The study would also point out that elastic ligaments in larger vertebrates could store and return relatively more elastic strain energy, which could have improved locomotor efficiency and decrease the strain energy transferred to the bones. The study would suggest that this mechanism could have worked efficiently in tyrannosaurids as well. Hence, the study involved identifying the type of ligaments attached to the metatarsals, then how they functioned together and comparing it to those of other theropods and modern day analogs. The scientists would find that arctometatarsals may have enabled tyrannosaurid feet to absorb forces such as linear deceleration, lateral acceleration and torsion more effectively than those of other theropods. It is also stated in their study that this may imply, though not demonstrate, that tyrannosaurids such as Tyrannosaurus had greater agility than other large theropods without an arctometatarsus.[98]",
			"color": "dim|0.091573 gray|0.091573 dim|0.091573 grey|0.091573 slate|0.071211 gray|0.071211 white|0.061316 smoke|0.061316 snow|0.060302 ghost|0.060098 white|0.060098 white|0.059976 sea|0.059695 shell|0.059695 mint|0.05887 cream|0.05887 floral|0.058452 white|0.058452 alice|0.057999 blue|0.057999 azure|0.057618 dark|0.049369 gray|0.049369 dark|0.049369 grey|0.049369 gray|0.048601 grey|0.048601 black|0.047532 lavender|0.04463 blush|0.04463 light|0.044444 slate|0.044444 gray|0.044444 silver|0.022289 ivory|0.013908 light|0.012324 gray|0.012324 light|0.012324 grey|0.012324 gainsboro|0.010049 linen|0.0065346  "
		}
	}
}
