{
	"add": {
		"doc": {
			"id": "9b2bc3fd53bf56aa7fc419d44cc642840e7f508d340b2553f6ac9b466bb3a715",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/EmancipationProclamationPage1.jpg/220px-EmancipationProclamationPage1.jpg",
				"previous": "The Civil Rights Act of 1866 made blacks full U.S. citizens (and this repealed the Dred Scott decision). In 1868, the 14th amendment granted full U.S. citizenship to African-Americans. The 15th amendment, ratified in 1870, extended the right to vote to black males. The Freedmen's Bureau was an important institution established to create social and economic order in southern states.[2]",
				"after": "After the Union victory over the Confederacy, a brief period of southern black progress, called Reconstruction, followed. During the Reconstruction the entire face of the south changed because the remaining states were readmitted into the Union.[66] From 1865 to 1877, under protection of Union troops, some strides were made toward equal rights for African-Americans. Southern black men began to vote and were elected to the United States Congress and to local offices such as sheriff. The safety provided by the troops did not last long, and white southerners frequently terrorized black voters. Coalitions of white and black Republicans passed bills to establish the first public school systems in most states of the South, although sufficient funding was hard to find. Blacks established their own churches, towns and businesses. Tens of thousands migrated to Mississippi for the chance to clear and own their own land, as 90% of the bottomlands were undeveloped. By the end of the 19th century, two-thirds of the farmers who owned land in the Mississippi Delta bottomlands were black.[67]",
			"color": "light|0.39904 gray|0.39904 light|0.39904 grey|0.39904 gainsboro|0.30098 silver|0.122 antique|0.08151 white|0.08151 linen|0.064289 old|0.018319 lace|0.018319 sea|0.006298 shell|0.006298 dark|0.0029015 gray|0.0029015 dark|0.0029015 grey|0.0029015  "
		}
	}
}
