{
	"add": {
		"doc": {
			"id": "9b2eb24f3bcd74daa65d770650d12e47e2a19c479857f1e5b8a3de1b6e945cb3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Owlets.jpg/220px-Owlets.jpg",
				"previous": "Before commencing laying, the female spends much time near the nest and is entirely provisioned by the male. Meanwhile the male roosts nearby and may cache any prey that is surplus to their requirements. When the female has reached peak weight, the male provides a ritual presentation of food and copulation occurs at the nest. The female lays eggs on alternate days and the clutch size averages about five eggs (range two to nine). The eggs are chalky white, somewhat elliptical and about the size of bantam's eggs, and incubation begins as soon as the first egg is laid. While she is sitting on the nest, the male is constantly bringing more provisions and they may pile up beside the female. The incubation period is about thirty days, hatching takes place over a prolonged period and the youngest chick may be several weeks younger than its oldest sibling. In years with plentiful supplies of food, there may be a hatching success rate of about 75%. The male continues to copulate with the female when he brings food which makes the newly hatched chicks vulnerable to injury.[39]",
				"after": "The chicks are at first covered with greyish-white down and develop rapidly. Within a week they can hold their heads up and shuffle around in the nest. The female tears up the food brought by the male and distributes it to the chicks. Initially these make a \"chittering\" sound but this soon changes into a food-demanding \"snore\". By two weeks old they are already half their adult weight and look naked as the amount of down is insufficient to cover their growing bodies. By three weeks old, quills are starting to push through the skin and the chicks stand, making snoring noises with wings raised and tail stumps waggling, begging for food items which are now given whole. The male is the main provider of food until all the chicks are at least four weeks old at which time the female begins to leave the nest and starts to roost elsewhere. By the sixth week the chicks are as big as the adults but have slimmed down somewhat by the ninth week when they are fully fledged and start leaving the nest briefly themselves. They are still dependent on the parent birds until about thirteen weeks and receive training from the female in finding, and eventually catching, prey.[39]",
			"color": "dark|0.12383 gray|0.12383 dark|0.12383 grey|0.12383 gray|0.1102 grey|0.1102 dim|0.10956 gray|0.10956 dim|0.10956 grey|0.10956 silver|0.061613 linen|0.05007 sea|0.044374 shell|0.044374 antique|0.044306 white|0.044306 floral|0.040944 white|0.040944 old|0.03987 lace|0.03987 light|0.034975 gray|0.034975 light|0.034975 grey|0.034975 ivory|0.032796 snow|0.029242 white|0.028765 smoke|0.028765 misty|0.025857 rose|0.025857 white|0.024146 papaya|0.023993 whip|0.023993 mint|0.022851 cream|0.022851 gainsboro|0.021718 rosy|0.015863 brown|0.015863 blanched|0.015222 almond|0.015222 beige|0.015148 ghost|0.013138 white|0.013138 corn|0.012411 silk|0.012411 azure|0.01049 tan|0.0095846 bisque|0.0085942  "
		}
	}
}
