{
	"add": {
		"doc": {
			"id": "9b53688d6de0b90c93ecf29a05dfbd2945985d57ed702950916e5224c7525bc4",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/California_Chrome_head.jpg/220px-California_Chrome_head.jpg",
				"previous": "California Chrome was foaled on February 18, 2011,[2] near Coalinga, California, at Harris Farms, the horse breeding division of the Harris Ranch.[4] He is a chestnut with four white stockings[a] and a blaze.[5]",
				"after": "As a foal, the Martins gave him the nickname \"Junior\"[6] because of his resemblance to his sire, Lucky Pulpit.[7][8] Lucky Pulpit had won three races, placed in several graded stakes races, and hit the board in 13 of his 22 starts.[9] However, a viral respiratory infection damaged his breathing and limited him to racing over short distances.[10] California Chrome's dam is Love the Chase, and he was her first foal.[11] She was purchased for $30,000 as a two-year-old by an agent for a horse ownership group called the Blinkers On Racing Stable.[12] As a two- and three-year-old filly, she was nervous and often panicked in the saddling paddock, in effect losing races before she ever got to the starting gate.[6] She ran six times and won on her fourth try in a February 2009 maiden claiming race at Golden Gate Fields. After her win, Steve Coburn and Perry Martin became her owners,[13] ran her two more times, then retired her later that year.[12][13] They hoped she would become a good broodmare,[11] as she had a promising pedigree. When she retired, it was discovered that she had raced with a breathing problem—an entrapped epiglottis that restricted her air intake,[6] but which could be corrected with surgery.[14] As of 2014[update], she has given birth to three foals. The other two, both fillies, are full sisters to California Chrome.[15] After California Chrome became a Kentucky Derby contender, Martin and Coburn turned down an offer of $2.1 million for Love the Chase.[12]",
			"color": "burly|0.34341 wood|0.34341 tan|0.26469 navajo|0.057533 white|0.057533 wheat|0.050447 peach|0.047308 puff|0.047308 moccasin|0.023719 bisque|0.020941 olive|0.018545 drab|0.018545 black|0.014454 antique|0.014276 white|0.014276 blanched|0.013743 almond|0.013743 dark|0.012682 olive|0.012682 green|0.012682 papaya|0.011233 whip|0.011233 dark|0.0099543 gray|0.0099543 dark|0.0099543 grey|0.0099543  "
		}
	}
}
