{
	"add": {
		"doc": {
			"id": "9b6d1af43f4921f2065c64ea8fd1e00ccf7ed67389e7709fcfe362bd36a5428d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Michelin_Poster_1898.jpg/220px-Michelin_Poster_1898.jpg",
				"previous": "Edward FitzGerald's Rubaiyat of Omar Khayyam, though formally derived from the Persian ruba'i, nevertheless shows a strong Horatian influence, since, as one modern scholar has observed,\"...the quatrains inevitably recall the stanzas of the 'Odes', as does the narrating first person of the world-weary, ageing Epicurean Omar himself, mixing sympotic exhortation and 'carpe diem' with splendid moralising and 'memento mori' nihilism.\"[nb 32] Matthew Arnold advised a friend in verse not to worry about politics, an echo of Odes 2.11, yet later became a critic of Horace's inadequacies relative to Greek poets, as role models of Victorian virtues, observing: \"If human life were complete without faith, without enthusiasm, without energy, Horace...would be the perfect interpreter of human life.\"[121] Christina Rossetti composed a sonnet depicting a woman willing her own death steadily, drawing on Horace's depiction of 'Glycera' in Odes 1.19.5–6 and Cleopatra in Odes 1.37.[nb 33] A. E. Housman considered Odes 4.7, in Archilochian couplets, the most beautiful poem of antiquity[122] and yet he generally shared Horace's penchant for quatrains, being readily adapted to his own elegiac and melancholy strain.[123] The most famous poem of Ernest Dowson took its title and its heroine's name from a line of Odes 4.1, Non sum qualis eram bonae sub regno Cynarae, as well as its motif of nostalgia for a former flame. Kipling wrote a famous parody of the Odes, satirising their stylistic idiosyncrasies and especially the extraordinary syntax, but he also used Horace's Roman patriotism as a focus for British imperialism, as in the story Regulus in the school collection Stalky & Co., which he based on Odes 3.5.[124] Wilfred Owen's famous poem, quoted above, incorporated Horatian text to question patriotism while ignoring the rules of Latin scansion. However there were few other echoes of Horace in the war period, possibly because war is not actually a major theme of Horace's work.[125]",
				"after": "Ode 1.37,",
			"color": "burly|0.12697 wood|0.12697 light|0.11675 gray|0.11675 light|0.11675 grey|0.11675 tan|0.10226 gainsboro|0.094557 antique|0.07861 white|0.07861 silver|0.048824 linen|0.037681 dark|0.035302 gray|0.035302 dark|0.035302 grey|0.035302 misty|0.031326 rose|0.031326 gray|0.023807 grey|0.023807 dim|0.023292 gray|0.023292 dim|0.023292 grey|0.023292 rosy|0.017802 brown|0.017802 wheat|0.017715 peach|0.016654 puff|0.016654 old|0.015293 lace|0.015293 black|0.015136 sea|0.013883 shell|0.013883 bisque|0.012228 beige|0.011926 white|0.011462 smoke|0.011462 papaya|0.011125 whip|0.011125 brown|0.010718 floral|0.0095993 white|0.0095993 navajo|0.0086952 white|0.0086952 blanched|0.0084272 almond|0.0084272 lavender|0.0069699 blush|0.0069699 indian|0.0066162 red|0.0066162 sandy|0.0065686 brown|0.0065686 snow|0.0064774 dark|0.0062354 salmon|0.0062354 mint|0.0053524 cream|0.0053524 ivory|0.0053373 honeydew|0.00525 peru|0.0047599 white|0.0044612 sienna|0.0043315  "
		}
	}
}
