{
	"add": {
		"doc": {
			"id": "9b7b0b73e29e5fd3dc8abd713cd7f8e34893dd95c4f92443c2435ec47325cdb1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/C-2A_NP-2000_USS_Carl_Vinson_2009.jpg/220px-C-2A_NP-2000_USS_Carl_Vinson_2009.jpg",
				"previous": "The 36 C-2A(R)s are undergoing a critical Service Life Extension Program (SLEP). The lifespan of the C-2A(R) was 10,000 hours, or 15,000 carrier landings; current plans require the C-2A to perform its mission supporting battle group operational readiness through 2015. The landing limit is quickly approaching for most of the airframes, and the SLEP will increase the Greyhound's projected life to 15,000 hours or 36,000 landings. Once the program is complete, it will allow the current 36 aircraft to operate until 2027. The SLEP includes structural improvements to the center wing, navigational upgrades including the addition of GPS and the dual CAINS II Navigation System, the addition of crash survivable flight incident recorders, and a Ground Proximity Warning System. The first upgraded C-2A(R) left NAVAIR Depot North Island on 12 September 2005, after sitting on the ground for three and a half years while the SLEP was developed and installed. A second airframe is currently nearing completion and it is anticipated that the remaining 34 aircraft will all undergo the SLEP upgrade within the next five years as operations and schedule permit. The eight-bladed NP2000 propeller is another part of this upgrade and is expected to be installed by 2010.[2]",
				"after": "In November 2008, the company also obtained a $37M contract for the maintenance, logistics and aviation administration services over five years for the C-2A fleet assigned to VX-20 test and evaluation squadron at Patuxent River. Northrop Grumman is currently working on an upgraded C-2 version, and has offered to modernize the fleet with components common to the E-2D Hawkeye.[3]",
			"color": "gray|0.3658 grey|0.3658 dark|0.23094 gray|0.23094 dark|0.23094 grey|0.23094 light|0.12568 slate|0.12568 gray|0.12568 dim|0.11439 gray|0.11439 dim|0.11439 grey|0.11439 slate|0.051043 gray|0.051043 silver|0.023023 light|0.013643 gray|0.013643 light|0.013643 grey|0.013643 gainsboro|0.011232 white|0.0061799 smoke|0.0061799 linen|0.0054168 sea|0.0050831 shell|0.0050831 snow|0.0044414 floral|0.0040364 white|0.0040364 ghost|0.0038445 white|0.0038445 lavender|0.0037632 blush|0.0037632 white|0.003524 black|0.003519 mint|0.0029172 cream|0.0029172  "
		}
	}
}
