{
	"add": {
		"doc": {
			"id": "9b8dda68c3aa8d838874e7f10ed5578e8d77a781a50f0408b0a86995a88f7f3d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Australian_Catle_Dog_Silverbarn%27s_Paavo.jpg/220px-Australian_Catle_Dog_Silverbarn%27s_Paavo.jpg",
				"previous": "In addition to the primary colouration, an Australian Cattle Dog displays some patches of solid or near-solid colour. In both red and blue dogs, the most common are masks over one or both eyes, a white tip to the tail, a solid spot at the base of the tail, and sometimes solid spots on the body, though these are not desirable in dogs bred for conformation shows. Blue dogs can have tan midway up the legs and extending up the front to breast and throat, with tan on jaws, and tan eyebrows.[1] Both colour forms can have a white \"star\" on the forehead called the \"Bentley Mark\", after a legendary dog owned by Tom Bentley.[3] Common miscolours in the Australian Cattle Dog are black hairs in a red-coated dog, including the extreme of a black saddle on a red dog, and extensive tan on the face and body on a blue dog, called \"creeping tan\".[4] The Cattle Dog has a double coat—the short, straight outer guard hairs are protective in nature, keeping the elements from the dog's skin while the undercoat is short, fine and dense.[3]",
				"after": "The mask consists of a black patch over one or both eyes (for the blue coat colour) or a red patch over one or both eyes (for the red coat colour). Depending on whether one or both eyes have a patch, these are called, respectively, \"single\" (or \"half\") mask and \"double\" (or \"full\") mask. Dogs without a mask are called plain-faced. Any of these are acceptable according to the breed standard. In conformation shows, even markings are preferred over uneven markings.[1]",
			"color": "tan|0.13246 dark|0.12293 gray|0.12293 dark|0.12293 grey|0.12293 black|0.09735 silver|0.092412 saddle|0.082959 brown|0.082959 burly|0.078049 wood|0.078049 sienna|0.06948 rosy|0.053005 brown|0.053005 light|0.044761 gray|0.044761 light|0.044761 grey|0.044761 gray|0.034208 grey|0.034208 peru|0.032754 gainsboro|0.025518 dim|0.025493 gray|0.025493 dim|0.025493 grey|0.025493 peach|0.020816 puff|0.020816 misty|0.015078 rose|0.015078  "
		}
	}
}
