{
	"add": {
		"doc": {
			"id": "9b9019e70f0aeb4e25cd084274ca94bdbec0eb024479ddf25f9083279fee25ab",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Bundesarchiv_Bild_146-1968-101-20A%2C_Joseph_Goebbels.jpg/170px-Bundesarchiv_Bild_146-1968-101-20A%2C_Joseph_Goebbels.jpg",
				"previous": "On 2 August 1934, President von Hindenburg died. The previous day, the cabinet had enacted the \"Law Concerning the Highest State Office of the Reich\", which stated that upon Hindenburg's death, the office of president would be abolished and its powers merged with those of the chancellor.[32] Hitler thus became head of state as well as head of government. He was formally named as Führer und Reichskanzler (leader and chancellor). Germany was now a totalitarian state with Hitler at its head.[33] As head of state, Hitler became Supreme Commander of the armed forces. The new law altered the traditional loyalty oath of servicemen so that they affirmed loyalty to Hitler personally rather than the office of supreme commander or the state.[34] On 19 August, the merger of the presidency with the chancellorship was approved by 90 per cent of the electorate in a plebiscite.[35]",
				"after": "Most Germans were relieved that the conflicts and street fighting of the Weimar era had ended. They were deluged with propaganda orchestrated by Joseph Goebbels, who promised peace and plenty for all in a united, Marxist-free country without the constraints of the Versailles Treaty.[36] The first Nazi concentration camp, initially for political prisoners, was opened at Dachau in 1933.[37] Hundreds of camps of varying size and function were created by the end of the war.[38] Upon seizing power, the Nazis took repressive measures against their political opposition and rapidly began the comprehensive marginalisation of persons they considered socially undesirable. Under the guise of combating the Communist threat, the National Socialists secured immense power. Above all, their campaign against Jews living in Germany gained momentum.",
			"color": " "
		}
	}
}
