{
	"add": {
		"doc": {
			"id": "9b93eea600c5b26dfacdb10552c2d5534ee97af18a4388cdaad433c6d3897703",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Srilankantrichyparking.jpg/220px-Srilankantrichyparking.jpg",
				"previous": "On 11 June 2012, Sri Lankan Airlines was announced as Oneworld's latest member-elect, on the sidelines of the IATA World Air Transport Summit in Beijing. Cathay Pacific served Sri Lankan Airlines as its sponsor through its alliance implementation programme. Its membership implementation took approximately 18 months. On 1 May 2014, Sri Lankan Airlines became a full-member of the alliance, making it the first airline in the Indian subcontinent to join any airline alliance.",
				"after": "The airline received its first Airbus aircraft in 1992, the Airbus A320-200 (reg:4R-ABA) began flying to the airline's regional routes in Maldives, Pakistan and southern India. The Airbus A340-300 aircraft were ordered during the time of President Premadasa, the first A340 was delivered in 1994. The airline was the first in Asia to use the A340, the aircraft are used in high density flights to Middle East, Southeast Asia and Europe. The Airbus A330-200 aircraft were delivered during the rule of President Chandrika, the aircraft are used in flights to Europe and Southeast Asia. The Airbus A340 are the airlines flagship aircraft type until they are replaced by the ordered Airbus A350.",
			"color": "tan|0.20194 black|0.17604 burly|0.16416 wood|0.16416 wheat|0.079773 navajo|0.051713 white|0.051713 moccasin|0.042833 dark|0.025309 gray|0.025309 dark|0.025309 grey|0.025309 dim|0.023486 gray|0.023486 dim|0.023486 grey|0.023486 gray|0.019746 grey|0.019746 silver|0.019231 light|0.015549 gray|0.015549 light|0.015549 grey|0.015549 pale|0.013097 golden|0.013097 rod|0.013097 gainsboro|0.011921 dark|0.010979 red|0.010979 bisque|0.0097191 white|0.0093108 smoke|0.0093108 mint|0.0082945 cream|0.0082945 floral|0.0079359 white|0.0079359 sea|0.0078259 shell|0.0078259 maroon|0.0076321 snow|0.0074259 peach|0.007402 puff|0.007402 white|0.0072163 azure|0.0069529 ivory|0.0059422 ghost|0.0056475 white|0.0056475 dark|0.0054792 khaki|0.0054792 linen|0.0053568 alice|0.0052955 blue|0.0052955  "
		}
	}
}
