{
	"add": {
		"doc": {
			"id": "9ba5d86a1d697e0edb7206f46cedd5a7d12380bbbfad10f256185bb0ad921e56",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Mantell%27s_Iguanodon_restoration.jpg/220px-Mantell%27s_Iguanodon_restoration.jpg",
				"previous": "In recognition of the resemblance of the teeth to those of the iguana, Mantell named his new genus Iguanodon or \"iguana-tooth\", from iguana and the Greek word ὀδών (odon, odontos or \"tooth\").[4] Based on isometric scaling, he estimated that the creature might have been up to 18 metres (60 ft) long, more than the 12 metres (40 ft) length of Megalosaurus.[12] His initial idea for a name was Iguana-saurus (\"Iguana lizard\"), but his friend William Daniel Conybeare suggested that that name was more applicable to the iguana itself, so a better name would be Iguanoides (\"Iguana-like\") or Iguanodon.[44][45] He neglected to add a specific name to form a proper binomial, so one was supplied in 1829 by Friedrich Holl: I. anglicum, which was later amended to I. anglicus.[46]",
				"after": "A more complete specimen of similar animal was discovered in a quarry in Maidstone, Kent, in 1834 (lower Lower Greensand Formation), which Mantell soon acquired. He was led to identify it as an Iguanodon based on its distinctive teeth. The Maidstone slab was utilized in the first skeletal reconstructions and artistic renderings of Iguanodon, but due to its incompleteness, Mantell made some mistakes, the most famous of which was the placement of what he thought was a horn on the nose.[47] The discovery of much better specimens in later years revealed that the horn was actually a modified thumb. Still encased in rock, the Maidstone skeleton is currently displayed at the Natural History Museum in London. The borough of Maidstone commemorated this find by adding an Iguanodon as a supporter to their coat of arms in 1949.[48] This specimen has become linked with the name I. mantelli, a species named in 1832 by Christian Erich Hermann von Meyer in place of I. anglicus, but it actually comes from a different formation than the original I. mantelli/I. anglicus material.[45] The Maidstone specimen, also known as Gideon Mantell's \"Mantel-piece\", and formally labelled NHMUK 3741[49][50] was subsequently excluded from Iguanodon. It is classified as cf. Mantellisaurus by McDonald (2012);[51] as cf. Mantellisaurus atherfieldensis by Norman (2012);[49] and made the holotype of a separate species Mantellodon carpenteri by Paul (2012).[50]",
			"color": " "
		}
	}
}
