{
	"add": {
		"doc": {
			"id": "9ba6087865744a3c4caf3c497bba4d833b90fbe8dcac2661d371d063a3ff9396",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Light_House_Hill%2C_Mangalore.JPG/220px-Light_House_Hill%2C_Mangalore.JPG",
				"previous": "According to the Scottish physician Francis Buchanan who visited Mangalore in 1801, Mangalore was a rich and prosperous port with flourishing trading activity.[42] Rice was the grand article of export, and was exported to Muscat, Bombay, Goa and Malabar. Supari or Betel-nut was exported to Bombay, Surat and Kutch. Pepper and Sandalwood were exported to Bombay. Turmeric was exported to Muscat, Kutch, Surat and Bombay, along with Cassia Cinnamon, Sugar, Iron, Saltpeter, Ginger, Choir and Timber.[42]",
				"after": "The British colonial government did not support industrialization in the region, and local capital remained invested mostly in land and money lending, which led to the later development of banking in the region. With the arrival of European missionaries in the early 19th century, the region saw the development of educational institutions and a modern industrial base, modeled on European industries. The opening of the Lutheran Swiss Basel Mission in 1834 was central to the industrialization process. Printing press, cloth-weaving mills and tile factories manufacturing the famed Mangalore tiles were set up by the missionaries.[26] When Canara (part of the Madras Presidency until this time) was bifurcated into North Canara and South Canara in 1859, Mangalore was transferred into South Canara and became its headquarters.[44]:5 South Canara remained under Madras Presidency, while North Canara was detached from Madras Presidency and transferred to Bombay Presidency in 1862.[44]:6 The enactment of the Madras Town Improvement Act (1865) mandated the establishment of the Municipal council on 23 May 1866, which was responsible for urban planning and providing civic amenities.[15]:178 The Italian Jesuits, who arrived in Mangalore in 1878, played an important role in education, economy, health, and social welfare of the city.[45] The linking of Mangalore in 1907 to the Southern Railway, and the subsequent proliferation of motor vehicles in India, further increased trade and communication between the city and the rest of the country.[46] By the early 20th century, Mangalore had become a major supplier of educated manpower to Bombay, Bangalore, and the Middle East.[26]",
			"color": "black|0.32922 light|0.28502 steel|0.28502 blue|0.28502 lavender|0.13787 light|0.055593 gray|0.055593 light|0.055593 grey|0.055593 dim|0.048715 gray|0.048715 dim|0.048715 grey|0.048715 gainsboro|0.034944 gray|0.03296 grey|0.03296 dark|0.032315 gray|0.032315 dark|0.032315 grey|0.032315 silver|0.014208 slate|0.0099875 gray|0.0099875 light|0.0079892 slate|0.0079892 gray|0.0079892  "
		}
	}
}
