{
	"add": {
		"doc": {
			"id": "9bb0557e46cce36aeac066aad5c325f2ca0f8c8a80e18ac8accfb3cdf2b4c490",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Bruce_Castle_extension_entrance.JPG/170px-Bruce_Castle_extension_entrance.JPG",
				"previous": "During the period of the School's operation, the character of the area had changed beyond recognition. Historically, Tottenham had consisted of four villages on Ermine Street (later the A10 road), surrounded by marshland and farmland.[25] The construction of the Northern and Eastern Railway in 1840, with stations at Tottenham Hale and Marsh Lane (later Northumberland Park), made commuting from Tottenham to central London feasible for the first time (albeit by a circuitous eight-mile route via Stratford, more than double the distance of the direct road route), as well as providing direct connections to the Port of London.[26] In 1872 the Great Eastern Railway opened a direct line from Enfield to Liverpool Street station,[27] including a station at Bruce Grove, close to Bruce Castle;[28] the railway provided subsidised workmen's fares to allow poor commuters to live in Tottenham and commute to work in central London.[29] As a major rail hub, Tottenham grew into a significant residential and industrial area; by the end of the 19th century, the only remaining undeveloped areas were the grounds of Bruce Castle itself, and the waterlogged floodplains of the River Lea at Tottenham Marshes and of the River Moselle at Broadwater Farm.[25]",
				"after": "In 1877 Birkbeck Hill retired from the post of headmaster, ending his family's association with the school. The school closed in 1891, and Tottenham Council purchased the house and grounds. The grounds of the house were opened to the public as Bruce Castle Park in June 1892,[30] the first public park in Tottenham.[31] The house opened to the public as Bruce Castle Museum in 1906.[32][33]",
			"color": "gray|0.40139 grey|0.40139 dim|0.27781 gray|0.27781 dim|0.27781 grey|0.27781 dark|0.18339 gray|0.18339 dark|0.18339 grey|0.18339 black|0.042962 light|0.033079 slate|0.033079 gray|0.033079 silver|0.029287 slate|0.025252 gray|0.025252 light|0.0049874 gray|0.0049874 light|0.0049874 grey|0.0049874  "
		}
	}
}
