{
	"add": {
		"doc": {
			"id": "9bb11d1d061d73a4cf5131d1f3790cec38bcb34dc01abbae011208ce71c680f3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/1_franc_semeuse.png/170px-1_franc_semeuse.png",
				"previous": "On January 18, 1909, Brenner submitted models to the Mint with a Lincoln profile on the obverse, and a reverse design very similar to that on the then-current French silver coins, showing a tree branch. He also proposed designs for a Lincoln half dollar, with the late president to appear on one side, and a standing Liberty design—almost identical to the obverse of the same French coins. Leach replied on February 2 that no change to the half dollar could be made without congressional approval. By February 9, Leach had discovered the origin of the branch design—although numismatic historian Don Taxay notes that it is odd Leach had not discovered the source of the standing Liberty design, given that they were on opposite sides of the same French coins.[13] Leach did not confront the sculptor with the artistic borrowing, but instead simply ruled out the submitted designs as unsuitable for the reverse of the cent.[13] He urged the sculptor to prepare a simple design, bearing the denomination, the country's name, and the motto \"E pluribus unum\".[14] Brenner worked quickly, and on February 17, delivered models for both obverse and reverse similar to the eventual coin, though with a somewhat larger bust of Lincoln, and the motto \"In God We Trust\" omitted.[15] As a design element on the reverse, Brenner used two ears of durum wheat.[16] The designs were shown to President Roosevelt, who approved them although Roosevelt required \"UNITED\", which Brenner had spelled \"VNITED\", to be spelled in the conventional way.[17] After Leach examined the models, he objected to the fact that Brenner had put his full surname on the obverse. Brenner wrote in return, \"I shall take it out and put it in small letters on the reverse.\"[15]",
				"after": "On March 4, 1909, the day on which Roosevelt left office, replaced by William Howard Taft, Brenner met with Mint Engraver Charles E. Barber in Philadelphia. Barber had written to Leach, suggesting that Brenner's designs would have to be modified to be suitable for coinage.[18] On March 15, Brenner wrote to Leach stating that Barber seemed in no hurry to have the new coins produced.[19] Brenner also complained that the Mint was losing detail as it reduced the large models to coin-sized hubs. Barber had been stung by criticism that he had lost detail in this way with the new gold coins, and he raised no objection to having the reductions done by an outside silversmith.[20] After several hubs were prepared by the Medallic Art Company of New York, Barber sank a master die and sent it to Brenner for retouching.[21]",
			"color": "silver|0.1543 light|0.12149 gray|0.12149 light|0.12149 grey|0.12149 dark|0.11361 gray|0.11361 dark|0.11361 grey|0.11361 gainsboro|0.093756 cadet|0.049316 blue|0.049316 dark|0.038669 slate|0.038669 gray|0.038669 linen|0.037926 white|0.03745 smoke|0.03745 sea|0.032535 shell|0.032535 floral|0.032365 white|0.032365 mint|0.03158 cream|0.03158 gray|0.025869 grey|0.025869 old|0.025675 lace|0.025675 snow|0.023061 ivory|0.023001 light|0.021107 slate|0.021107 gray|0.021107 slate|0.019645 gray|0.019645 white|0.01906 honeydew|0.018802 azure|0.016925 beige|0.01343 dim|0.011187 gray|0.011187 dim|0.011187 grey|0.011187 alice|0.01062 blue|0.01062 antique|0.0101 white|0.0101 ghost|0.009829 white|0.009829  "
		}
	}
}
