{
	"add": {
		"doc": {
			"id": "9bf114b29040bbfa1e6cee36e9e268ee019b9db13162497f58acc84eab7f780f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/HarrodsDay.jpg/220px-HarrodsDay.jpg",
				"previous": "A subsidiary of Adobe Systems, Scene7 provides document hosting and interactive publishing services,[1] typically charging clients $30,000 to $50,000 a year to convert catalog print files to interactive web pages. The company does most of its business in North America. Its primary competitors for dynamic imaging services and technology are RichFX and LiquidPixels.[2][3] Scene7 products rely on several Adobe products, including Adobe Photoshop, Adobe InDesign, Adobe Flash, Adobe Illustrator, and Adobe Flex; this relationship existed before Adobe purchased the company.[4] Scene7 does not maintain any servers to host its services; instead, it uses a \"pay as you grow\" program that only requires it to pay for the resources that it uses.[5]",
				"after": "Scene7's clients include the companies Sears, Lands' End, Harrods, Macy's, Office Depot, Levi Strauss & Co., La-Z-Boy, and QVC.[4] In 2001, Scene7 agreed to develop home design and landscaping software for Individual Software for $50 million.[6] High-end casual clothing retailer Anthropologie has used Scene7's services to create and deploy online catalogs for its e-commerce website since November 9, 2004. The retailer implemented Scene7's Dynamic Imaging service to let customers zoom in on products, similar to how merchandise is inspected in retail stores.[7] The Harrods department store signed an agreement with Scene7 on June 24, 2005 to use Scene7's imaging and catalog system on the store's website. This required Harrods to convert all its printed material to a digital format for Internet use.[8]",
			"color": "dim|0.49253 gray|0.49253 dim|0.49253 grey|0.49253 black|0.22051 gray|0.18147 grey|0.18147 dark|0.043518 gray|0.043518 dark|0.043518 grey|0.043518 dark|0.024946 slate|0.024946 gray|0.024946 silver|0.010198 slate|0.0091913 gray|0.0091913  "
		}
	}
}
