{
	"add": {
		"doc": {
			"id": "9c02df8220b09d7337a9676000528302e03bc72762f5439af1b8813459cdac5a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Vickers_Wellington_Mark_X%2C_HE239_%27NA-Y%27%2C_of_No._428_Squadron_RCAF_%28April_1943%29.png/220px-Vickers_Wellington_Mark_X%2C_HE239_%27NA-Y%27%2C_of_No._428_Squadron_RCAF_%28April_1943%29.png",
			"previous": [],
				"after": "Modern airframe history began in the United States when a 1903 wood biplane made by Orville and Wilbur Wright showed the potential of fixed-wing designs. Many early developments were spurred by military needs during World War I. Well known aircraft from that era include the Dutch designer Anthony Fokker's combat aircraft for the German Empire's Luftstreitkräfte, and U.S. Curtiss flying boats and the German/Austrian Taube monoplanes. These used hybrid wood and metal structures. During the war, German engineer Hugo Junkers pioneered practical all-metal airframes as early as late 1915 with the Junkers J 1 and developed further with lighter weight duralumin in the airframe of the Junkers D.I of 1918, whose techniques were adopted almost unchanged after the war by both American engineer William Bushnell Stout and Soviet aerospace engineer Andrei Tupolev. Commercial airframe development during the 1920s and 1930s focused on monoplane designs using radial piston engines. Many, such as the Ryan model flown across the Atlantic by Charles Lindbergh in 1927, were produced as single copies or in small quantity. William Stout's designs for the all-metal Ford 4-AT and 5-AT trimotors,[2] Andrei Tupolev's designs in Joseph Stalin's Soviet Union for a series of all-metal aircraft of steadily increasing size, culminating in the enormous, eight-engined Maksim Gorky (the largest aircraft of its era), and with Donald Douglas' firm's development of the iconic Douglas DC-3 twin-engined airliner,[3] were among the most successful designs to emerge from the era through the use of all-metal airframes. The original Junkers corrugated duralumin-covered airframe philosophy culminated in the 1932-origin Junkers Ju 52 trimotor airliner, used throughout World War II by the Nazi German Luftwaffe for transport and paratroop needs.",
			"color": " "
		}
	}
}
