{
	"add": {
		"doc": {
			"id": "9c15eb47a605343e48c6d2fe881abbae6febd37dd02e8d32367663b118c2e2a1",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e0/USAD_medals.JPG/220px-USAD_medals.JPG",
			"previous": [],
				"after": "Each of the ten events is worth 1,000 points, for a possible 10,000-point individual total. Only the top two scores from the Honors, Scholastic and Varsity divisions are counted for the team score. Until 2013, 60,000 was the maximum possible team score. In 2013, Super Quiz became a 10,000 point event that only counts for the team score, making the maximum possible team score 70,000.[26] With the exception of math and Super Quiz, the objective tests each have 50 questions worth 20 points a piece. The math test is weighted more heavily, with 35 questions worth approximately 28.6 points per question. Until 2013, the Super Quiz written test contained 40 questions, each worth 15 points. Depending on the state director, the relay component of Super Quiz contained either 5 or 10 questions, each worth 80 or 40 points respectively. Starting in 2013, the Super Quiz contained only the relay component with 5 or 10 questions, each worth approximately 333.3 or 166.7 questions respectively.[26][54] The written test was sometimes omitted at the state level even before 2013 if a state director wished to weigh the Super Quiz Relay more heavily.[102] Perfect scores of 1,000 in events are recorded regularly, and there have been cases of dozens of medal winners for a single event because of perfect and near-perfect scores.[103] Gold, silver and bronze medals are awarded in each event and for each division (Honors, Scholastic, and Varsity). All tying participants are awarded medals.[104]",
			"color": "dark|0.41744 gray|0.41744 dark|0.41744 grey|0.41744 gray|0.32223 grey|0.32223 dim|0.11392 gray|0.11392 dim|0.11392 grey|0.11392 black|0.051892 silver|0.041264 light|0.0099596 gray|0.0099596 light|0.0099596 grey|0.0099596 tan|0.0069635 gainsboro|0.0065946  "
		}
	}
}
