{
	"add": {
		"doc": {
			"id": "9c17447bd1d06a34d4c8a11c32601660df1074279afa5689a5fa94a74d21ec3a",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d6/Ff6_magitek.jpg/170px-Ff6_magitek.jpg",
				"previous": "The first five games were directed by Sakaguchi, who also provided the original concepts.[63][89] He drew inspiration for game elements from anime films by Hayao Miyazaki; series staples like the airships and chocobos are inspired by elements in Castle in the Sky and Nausicaa of the Valley of the Wind, respectively.[90] Sakaguchi served as a producer for subsequent games until he left Square in 2001.[63][89] Yoshinori Kitase took over directing the games until Final Fantasy VIII,[91][92][93] and has been followed by a new director for each new title. Hiroyuki Ito designed several gameplay systems, including Final Fantasy V‍ '​s \"Job System\", Final Fantasy VIII‍ '​s \"Junction System\" and the Active Time Battle concept, which was used from Final Fantasy IV until Final Fantasy IX.[63][91] In designing the Active Time Battle system, Ito drew inspiration from Formula One racing; he thought it would be interesting if character types had different speeds after watching race cars pass each other.[94] Ito also co-directed Final Fantasy VI with Kitase.[63][91] Kenji Terada was the scenario writer for the first three games; Kitase took over as scenario writer for Final Fantasy V through Final Fantasy VII. Kazushige Nojima became the series' primary scenario writer from Final Fantasy VII until his resignation in October 2003; he has since formed his own company, Stellavista. Nojima partially or completely wrote the stories for Final Fantasy VII, Final Fantasy VIII, Final Fantasy X, and Final Fantasy X-2. He also worked as the scenario writer for the spin-off series, Kingdom Hearts.[95] Daisuke Watanabe co-wrote the scenarios for Final Fantasy X and XII, and was the main writer for the XIII games.[96][97][98]",
				"after": "Artistic design, including character and monster creations, was handled by Japanese artist Yoshitaka Amano from Final Fantasy through Final Fantasy VI. Amano also handled title logo designs for all of the main series and the image illustrations from Final Fantasy VII onward.[89] Tetsuya Nomura was chosen to replace Amano because Nomura's designs were more adaptable to 3D graphics. He worked with the series from Final Fantasy VII through Final Fantasy X;[63][89] for Final Fantasy IX, however, character designs were handled by Shukō Murase, Toshiyuki Itahana, and Shin Nagasawa.[99] Nomura is also the character designer of the Kingdom Hearts series, Compilation of Final Fantasy VII, and Fabula Nova Crystallis: Final Fantasy.[100] Other designers include Nobuyoshi Mihara and Akihiko Yoshida. Mihara was the character designer for Final Fantasy XI, and Yoshida served as character designer for Final Fantasy Tactics, the Square-produced Vagrant Story, and Final Fantasy XII.[36][101]",
			"color": "black|0.80696 dim|0.067932 gray|0.067932 dim|0.067932 grey|0.067932 gray|0.042124 grey|0.042124 dark|0.023232 gray|0.023232 dark|0.023232 grey|0.023232 silver|0.011352 light|0.0052491 gray|0.0052491 light|0.0052491 grey|0.0052491  "
		}
	}
}
