{
	"add": {
		"doc": {
			"id": "9c18e5cb90f5469125c2db4df34a520a325c442a8cc8d6f0b57a8edb003dd62e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Operationepsom.jpg/100px-Operationepsom.jpg",
			"previous": [],
				"after": "Operation Epsom was a World War II British offensive that took place between 26–30 June 1944, during the Battle of Normandy. The offensive was intended to outflank and seize the German occupied city of Caen, which was a major Allied objective in the early stages of the invasion of northwest Europe. Preceded by attacks intended to secure the lines of advance, Operation Epsom was launched early on the 26 June, with units of the 15th (Scottish) Infantry Division advancing behind a creeping artillery barrage. Additional bomber support had been expected, but poor weather led to this being cancelled; air cover would be sporadic for much of the operation. Supported by the tanks of the 31st Tank Brigade, the 15th Scottish made steady progress, and by the end of the first day had largely overrun the German outpost line, although there remained some difficulties in securing the flanks of the advance. In heavy fighting over the following two days, a foothold was secured across the River Odon, and efforts were made to expand this by capturing strategic points around the salient and moving up the 43rd (Wessex) Infantry Division. However, in response to powerful German counterattacks, by 30 June some of the British positions across the river were withdrawn, bringing the operation to a close. Military historians have widely differed in their interpretations of the intention and conduct of Operation Epsom, but there is general agreement concerning its effect on the balance of forces in Normandy. Although the Germans had managed to contain the offensive, to do so they had been obliged to commit all their available strength, including two panzer divisions newly arrived in Normandy and earmarked for a planned offensive against British and American positions around Bayeux. Casualties were heavy on both sides, but unlike General Bernard Montgomery, Field Marshal Erwin Rommel was unable to withdraw units into reserve after the battle, as they were needed to hold the front line. The British retained the initiative, and were able to launch further operations over the following weeks, eventually capturing Caen towards the end of July...(more)",
			"color": " "
		}
	}
}
