{
	"add": {
		"doc": {
			"id": "9c1950e146035a242c87be78784d5b5b741189d89e9af31ab2141ea7a7bb9ea9",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Surtsey_eruption_1963.jpg/120px-Surtsey_eruption_1963.jpg",
				"previous": "Portal:Geography/Featured article/14",
				"after": "Surtsey (Icelandic, meaning \"Surtr's island\") is a volcanic island off the southern coast of Iceland. At 63°18′11″N 20°36′17″W﻿ / ﻿63.303°N 20.6047°W﻿ / 63.303; -20.6047Coordinates: 63°18′11″N 20°36′17″W﻿ / ﻿63.303°N 20.6047°W﻿ / 63.303; -20.6047 Surtsey is the southernmost point of Iceland. It was formed in a volcanic eruption which began 130 metres (426 ft) below sea level, and reached the surface on 15 November 1963. The eruption lasted until 5 June 1967, when the island reached its maximum size of 2.7 km2 (1.0 sq mi). Since then, wind and wave erosion have caused the island to steadily diminish in size: as of 2002, its surface area was 1.4 km2 (0.54 sq mi). The new island was named after Surtr, a fire jötunn or giant from Norse mythology. It was intensively studied by volcanologists during its eruption, and afterwards by botanists and biologists as life forms gradually colonised the originally barren island. The undersea vents that produced Surtsey are part of the Vestmannaeyjar (Westmann Isles) submarine volcanic system, part of the fissure of the sea floor called the Mid-Atlantic Ridge. Vestmannaeyjar also produced the famous eruption of Eldfell on the island of Heimaey in 1973. The eruption that created Surtsey also created a few other small islands along this volcanic chain, such as Jólnir and other, unnamed peaks. Most of these eroded away fairly quickly.",
			"color": "dark|0.30413 slate|0.30413 gray|0.30413 misty|0.14243 rose|0.14243 gainsboro|0.078015 light|0.068881 gray|0.068881 light|0.068881 grey|0.068881 linen|0.058575 black|0.052803 cadet|0.041355 blue|0.041355 lavender|0.036542 blush|0.036542 silver|0.03561 antique|0.034771 white|0.034771 sea|0.033813 shell|0.033813 old|0.018737 lace|0.018737 dark|0.016698 gray|0.016698 dark|0.016698 grey|0.016698 light|0.012272 slate|0.012272 gray|0.012272 slate|0.012083 gray|0.012083 white|0.0094468 smoke|0.0094468 floral|0.0081508 white|0.0081508  "
		}
	}
}
