{
	"add": {
		"doc": {
			"id": "9c1d9ddbe2fde34c238cf1357f52ac03717f14c0f43a76bb5fea77e93503c57d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/NewarkC.jpg/220px-NewarkC.jpg",
				"previous": "In 2005 service to Asia was expanded as Continental introduced daily nonstop service between Newark and New Delhi, India. The success of this Newark-New Delhi route presaged establishment of a second gateway in India with the announcement of daily nonstop service to Mumbai. With the establishment of Mumbai service, Continental offers the most nonstop flights by any carrier from the United States to India.[32] By May 2006, the carrier's passenger traffic surpassed that of Northwest Airlines, and Continental became the fourth-largest U.S. carrier, the first change in the top-five passenger enplanement rankings since 2001.[33] The Wall Street Journal reported on December 12, 2007 that Continental was in merger discussions with United Airlines. Of issue would be Continental's golden share held by Northwest Airlines, dating from a stakeholding relationship during the late 1990s, and the divestiture of Continental's Guamanian hub. A deal was not \"certain or imminent\", with the talks being of a preliminary nature.[34][35] In April 2008, at the height of oil prices, Northwest announced a merger with Delta Air Lines. This allowed Continental to buy back the golden share from Northwest Airlines, which it did.[36] Continental then renewed merger talks with United Airlines, but Continental ended the merger talks that same month.[37]",
				"after": "In May 2008, Continental Airlines sold its remaining 4.38 million share investment in Panamanian flag carrier Copa for $35.75 a share, netting proceeds of $149.8 million. Continental had been a principal shareholder in Copa.[39] In June 2008, due to national and international economic conditions, Continental cut 3,000 jobs and the CEO and president had reduced salaries for the remainder of the year. The airline also reduced capacity and eliminated 67 mainline aircraft from its fleet by the end of 2009, retiring all of Continental's 737-300s and all but 35 of its 737-500s.[40] Continental also announced that it planned to withdraw from the SkyTeam Alliance and would join the Star Alliance in order to cooperate more extensively with United Airlines and other Star Alliance airlines. The new Continental-United relationship has been characterized as a \"virtual merger\" in some circles.[41] Continental had maintained its SkyTeam affiliation to be business-as-usual until the day of withdrawal.[42] Continental had been in discussions with United Airlines earlier in 2008 which might have resulted in a merger of the two carriers, but Continental withdrew from these discussions stating that it intended to continue to operate as presently constituted.[43]",
			"color": "dim|0.33853 gray|0.33853 dim|0.33853 grey|0.33853 gray|0.18126 grey|0.18126 black|0.15398 dark|0.10358 gray|0.10358 dark|0.10358 grey|0.10358 silver|0.072881 light|0.042133 gray|0.042133 light|0.042133 grey|0.042133 gainsboro|0.029134 dark|0.016311 slate|0.016311 gray|0.016311 slate|0.01159 gray|0.01159 light|0.011462 slate|0.011462 gray|0.011462 white|0.0045233 smoke|0.0045233  "
		}
	}
}
