{
	"add": {
		"doc": {
			"id": "9c2aaab5d8be322014c69cb2785a76038663bbb38856740fe5e8d82eb845fb94",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Barcelona_bombing_%281938%29.jpg/220px-Barcelona_bombing_%281938%29.jpg",
				"previous": "Many such acts were committed by reactionary groups during the first weeks of the war.[230] This included the execution of schoolteachers,[231] because the efforts of the Second Spanish Republic to promote laicism and displace the Church from schools by closing religious educational institutions were considered by the Nationalists as an attack on the Roman Catholic Church. Extensive killings of civilians were carried out in the cities captured by the Nationalists,[232] along with the execution of unwanted individuals. These included non-combatants such as trade-unionists, Popular Front politicians, suspected Freemasons, Basque, Catalan, Andalusian, and Galician Nationalists, Republican intellectuals, relatives of known Republicans, and those suspected of voting for the Popular Front.[230][233][234][235][236]",
				"after": "Nationalist forces massacred civilians in Seville, where some 8,000 people were shot; 10,000 were killed in Cordoba; 6,000–12,000 were killed in Badajoz.[237] In Granada, where working-class neighborhoods were hit with artillery and right-wing squads were given free rein to kill government sympathizers,[238] at least 2,000 people were murdered.[231] In February 1937, over 7,000 were killed after the capture of Málaga.[239] When Bilbao was conquered, thousands of people were sent to prison. There were fewer executions than usual, however, because of the effect Guernica left on Nationalists' reputations internationally.[240] The numbers killed as the columns of the Army of Africa devastated and pillaged their way between Seville and Madrid are particularly difficult to calculate.[241]",
			"color": "black|0.33665 dim|0.27383 gray|0.27383 dim|0.27383 grey|0.27383 gray|0.1819 grey|0.1819 dark|0.096842 gray|0.096842 dark|0.096842 grey|0.096842 silver|0.036776 light|0.018712 gray|0.018712 light|0.018712 grey|0.018712 gainsboro|0.013218 linen|0.0052972 white|0.0052118 smoke|0.0052118 sea|0.0046025 shell|0.0046025  "
		}
	}
}
