{
	"add": {
		"doc": {
			"id": "9c459eb492140f7e4c90e16e92665548c8b68680c70b3c4b7b47b769963498e0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Puerto_Rican_parrot.jpg/220px-Puerto_Rican_parrot.jpg",
				"previous": "In shallow water flora and fauna is concentrated around coral reefs where there is little variation in water temperature, purity and salinity. Leeward side of lagoons provide areas of growth for sea grasses. Turtle grass (Thalassia testudinum) is common in the Caribbean as is manatee grass (Syringodium filiforme) which can grow together as well as in fields of single species at depths up to 20 metres. Another type shoal grass (Halodule wrightii) grows on sand and mud surfaces at depths of up to 5 metres. In brackish water of harbours and estuaries at depths less than 2.5 metres widgeongrass (Ruppia maritima) grows. Representatives of three species belonging to the genus Halophila, (Halophila baillonii, Halophila engelmani and Halophila decipiens) are found at depths of up to 30 metres except for Halophila engelmani which does not grow below 5 metres and is confined to the Bahamas, Florida, the Greater Antilles and the western part of the Caribbean. Halophila baillonii has been found only in the Lesser Antilles.[16]",
				"after": "Marine biota in the region have representatives of both the Indian and Pacific oceans which were caught in the Caribbean before the emergence of the Isthmus of Panama four million years ago.[17] In the Caribbean Sea there are around 450 species of fish, including sharks (bull shark, tiger shark, silky shark and Caribbean reef shark), flying fish, giant oceanic manta ray, angel fish, spotfin butterflyfish, parrotfish, Atlantic Goliath grouper, tarpon and moray eels. Throughout the Caribbean there is industrial catching of lobster and sardines (off the coast of Yucatan).",
			"color": "dark|0.15393 sea|0.15393 green|0.15393 dim|0.11661 gray|0.11661 dim|0.11661 grey|0.11661 dark|0.08918 olive|0.08918 green|0.08918 black|0.062912 gray|0.05966 grey|0.05966 olive|0.05594 drab|0.05594 dark|0.04677 gray|0.04677 dark|0.04677 grey|0.04677 dark|0.040428 slate|0.040428 gray|0.040428 slate|0.038383 gray|0.038383 light|0.032672 slate|0.032672 gray|0.032672 olive|0.02416 silver|0.01834 rosy|0.01762 brown|0.01762 light|0.017295 green|0.017295 dark|0.015836 golden|0.015836 rod|0.015836 cadet|0.012972 blue|0.012972 peru|0.012323 light|0.011795 gray|0.011795 light|0.011795 grey|0.011795  "
		}
	}
}
