{
	"add": {
		"doc": {
			"id": "9c50824cbacc51c34ae31d654aa17a343e13a3037e70a192333f261998651df0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Slaget_vid_%C3%96land_Claus_M%C3%B8inichen_1686.jpg/133px-Slaget_vid_%C3%96land_Claus_M%C3%B8inichen_1686.jpg",
			"previous": [],
				"after": "The Battle of Öland (1676) was fought between an allied Danish-Dutch fleet and the Swedish navy in the Baltic Sea, east of Öland, during the Scanian War (1675–79). Sweden needed reinforcements for its northern German possessions; Denmark sought to ferry an army to attack Scania in southern Sweden. Just as the battle began, the Swedish flagship Kronan sank, taking with it the commander of the Swedish navy, Lorentz Creutz. The next in command, Claes Uggla, drowned while escaping his burning ship, Svärdet. The allied force under Dutch admiral Cornelis Tromp pressed its advantage, and the rest of the Swedish fleet fled in disorder. The battle resulted in Danish naval supremacy, then and throughout the war. The Danish King Christian V was able to ship troops over to the Swedish side of the Sound, and Scania became the main battleground of the war, culminating with the bloody battles of Lund, Halmstad and Landskrona. Danish and Dutch naval forces were left free to raze Öland and the Swedish east coast all the way up to Stockholm. The Swedish failure at Öland prompted King Charles XI to order a commission to investigate the fiasco, but in the end no one was found guilty. (Full article...)",
			"color": "black|0.24474 dark|0.20371 slate|0.20371 gray|0.20371 cadet|0.12232 blue|0.12232 dim|0.045694 gray|0.045694 dim|0.045694 grey|0.045694 dark|0.038742 gray|0.038742 dark|0.038742 grey|0.038742 gray|0.033692 grey|0.033692 silver|0.029923 tan|0.028537 light|0.027714 slate|0.027714 gray|0.027714 slate|0.021741 gray|0.021741 burly|0.017476 wood|0.017476 light|0.015027 gray|0.015027 light|0.015027 grey|0.015027 sienna|0.014668 light|0.010709 steel|0.010709 blue|0.010709 gainsboro|0.010208 wheat|0.0087334 light|0.0085428 blue|0.0085428 teal|0.0075411  "
		}
	}
}
