{
	"add": {
		"doc": {
			"id": "9c609fb7f1b98edde13f89edde3a43983f8d68b2814b0cfe8f87211a67e04090",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/2004-tsunami.jpg/220px-2004-tsunami.jpg",
				"previous": "As waves approach land and move into shallow water, they change their behavior. If approaching at an angle, waves may bend or wrap rocks and headlands. When the wave reaches a point where its deepest oscillating molecules contact the seabed, friction begins to slow the wave down. This pulls the crests closer together and increases the waves' height. When the ratio of a wave's height to its wavelength exceeds 1:7, it \"breaks\", toppling over in a mass of foaming water.[42] This rushes in a sheet up the beach before retreating into the sea under the influence of gravity.[40]",
				"after": "A tsunami is an unusual form of wave caused by a sudden and powerful event such as an underwater earthquake or landslide, a meteorite impact, a volcanic eruption, or a collapse of land into the sea. These events can temporarily lift or lower the surface of the sea in the affected area, usually by a few feet. The potential energy of the displaced seawater is turned into kinetic energy, creating a shallow wave radiating outwards at a velocity proportional to the square root of the depth of the water. Tsunamis, therefore, travel much faster in the open ocean than on a continental shelf.[48] Despite traveling at speeds of over 600 mph (970 km/h),[49] tsunamis in deep seas have wavelengths from 80 to 300 miles (130 to 480 km) and an amplitude of less than three feet.[50] Standard surface waves in the same region may only have wavelengths of a few hundred feet and speeds up to 65 mph (105 km/h) but, when compared to their possible amplitudes of up to 45 ft (14 m), tsunamis at this stage are often able to pass unnoticed.[50] Tsunami warning systems rely on the fact that seismic waves caused by earthquakes travel around the world at around 14,400 kilometers (8,900 mi) per hour, allowing threatened regions to be alerted to the possibility of a tsunami.[51] Measurements from a network of sea-level measuring stations make it possible to confirm or cancel a tsunami warning.[52] A trigger event on the continental shelf may cause a local tsunami on the land side and a distant tsunami that travels out across the ocean. The energy of the wave is dissipated only gradually but is spread out over the wave front. As the wave radiates away from the source, the front gets longer and the average energy reduces, so distant shores will generally be hit by weaker waves. However, as the speed of the wave is controlled by the water depth, it does not travel at the same speed in all directions and this affects the direction of the wave front. This effect, known as refraction, can focus the strength of an advancing tsunami on some areas while weakening it in others, according to the undersea topography along its path.[53][54]",
			"color": "black|0.44185 dim|0.19552 gray|0.19552 dim|0.19552 grey|0.19552 gray|0.12136 grey|0.12136 dark|0.075036 gray|0.075036 dark|0.075036 grey|0.075036 silver|0.043015 light|0.034622 steel|0.034622 blue|0.034622 light|0.022318 gray|0.022318 light|0.022318 grey|0.022318 gainsboro|0.01201 light|0.0069503 slate|0.0069503 gray|0.0069503  "
		}
	}
}
