{
	"add": {
		"doc": {
			"id": "9c6c7bfc81c86dc07add2e0f822fd5afce1fc320f5545c1493720ce38b5d0d24",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/1917_Silent_Parade_men_H.tiff/lossless-page1-300px-1917_Silent_Parade_men_H.tiff.png",
				"previous": "As the United States prepared to enter World War I in 1917, Du Bois' colleague in the NAACP, Joel Spingarn, established a camp to train African Americans to serve as officers in the United States military.[117] The camp was controversial, because some whites felt that blacks were not qualified to be officers, and some blacks felt that African Americans should not participate in what they considered a white man's war.[118] Du Bois supported Spingarn's training camp, but was disappointed when the Army forcibly retired one of its few black officers, Charles Young, on a pretense of ill health.[119] The Army agreed to create 1,000 officer positions for blacks, but insisted that 250 come from enlisted men, conditioned to taking orders from whites, rather than from independent-minded blacks that came from the camp.[120] Over 700,000 blacks enlisted on the first day of the draft, but were subject to discriminatory conditions which prompted vocal protests from Du Bois.[121]",
				"after": "After the East St. Louis Riot occurred in the summer of 1917, Du Bois traveled to St. Louis to report on the riots. Between 40 and 250 African Americans were massacred by whites, primarily due to resentment caused by St. Louis industry hiring blacks to replace striking white workers.[122] Du Bois' reporting resulted in an article \"The Massacre of East St. Louis\", published in the September issue of The Crisis, which contained photographs and interviews detailing the violence.[123] Historian David Levering Lewis concluded that Du Bois distorted some of the facts in order to increase the propaganda value of the article.[124] To publicly demonstrate the black community's outrage over the St Louis riot, Du Bois organized the Silent Parade, a march of around 9,000 African Americans down New York's Fifth avenue, the first parade of its kind in New York, and the second instance of blacks publicly demonstrating for civil rights.[125]",
			"color": " "
		}
	}
}
