{
	"add": {
		"doc": {
			"id": "9c70c62e340f029a62e9c6a7826eaa365d64532e9af553016571f61059e66c9b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Columbus_Taking_Possession.jpg/220px-Columbus_Taking_Possession.jpg",
			"previous": [
				"",
				"The demersal zone supports many animals that feed on benthic organisms or seek protection from predators. The seabed provides a range of habitats on or under the surface of the substrate which are used by creatures adapted to these conditions. The tidal zone with its periodic exposure to dehydrating air is home to barnacles, molluscs, and crustaceans. The neritic zone has many organisms that need light to flourish. Here, sponges, echinoderms, polychaete worms, sea anemones, and other invertebrates live among algal-encrusted rocks. Corals often contain photosynthetic symbionts and live in shallow waters where light penetrates. The extensive calcareous skeletons they extrude build up into coral reefs which are an important feature of the seabed. These provide a diverse habitat for reef dwelling organisms. There is less sea life on the floor of deeper seas but marine life also flourishes around seamounts that rise from the depths, where fish and other animals congregate to spawn and feed. Close to the seabed live demersal fish that largely feed on pelagic organisms or benthic invertebrates.[120] Exploration of the deep sea by submersibles revealed a new world of creatures living on the seabed that scientists had not previously expected. Some like the detritivores rely on organic material falling to the ocean floor. Others cluster round deep-sea hydrothermal vents where mineral-rich flows of water emerge, supporting communities whose primary producers are sulphide-oxidizing chemoautotrophic bacteria and whose consumers include specialized bivalves, sea anemones, barnacles, crabs, worms, and fish.[6](p212) A dead whale sinking to the bottom of the ocean provides food for an assembly of organisms which similarly rely largely on the actions of sulphur-reducing bacteria. Such places support unique biomes where many new microbes and other lifeforms have been discovered.[121]"
			],
			"after": {
				"_ArrayType_": "double",
				"_ArraySize_": [0,0],
				"_ArrayData_": null
			},
			"color": "black|0.35036 tan|0.14079 burly|0.11755 wood|0.11755 dark|0.077282 olive|0.077282 green|0.077282 dim|0.045838 gray|0.045838 dim|0.045838 grey|0.045838 dark|0.043568 khaki|0.043568  "
		}
	}
}
