{
	"add": {
		"doc": {
			"id": "9c7d5d8b3bb6711927071ff1aa8c4ee9a5cc419302a5c24388fe3f2cd62f7760",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/ThomasSullyObverse.jpg/200px-ThomasSullyObverse.jpg",
				"previous": "Later, in 1835, Mint officials began preparations for a series of silver dollars which, unlike the 1804 dollar, were intended to enter circulation in order to determine whether the denomination would be well received by the public. In June 1835, Moore resigned his post as director, and was replaced by Robert M. Patterson.[5] Shortly thereafter, Director Patterson approached two well-known Philadelphia artists, Titian Peale and Thomas Sully, to create a design that would be used to overhaul most of the American coins then in production.[6] Mint Chief Engraver Kneass prepared a sketch based on Patterson's conception, but soon suffered a stroke, leaving him partially incapacitated.[7] Following Kneass' stroke, government officials approved Patterson's urgent request that Philadelphia medallist Christian Gobrecht be hired immediately to fulfill the duties of engraver; Director Moore requested the same prior to his resignation, but no action was taken immediately.[5]",
				"after": "In a letter dated August 1, 1835, Patterson proposed that Sully create a Seated Liberty figure for the obverse, suggesting that the \"figure be in a sitting posture—sitting, for example, on a rock.\"[8] Patterson also suggested that the seated figure should hold in her right hand a pileus atop a pole to be \"emblematic of Liberty\".[8] Numismatic historian Don Taxay notes the similarity between Patterson's Seated Liberty concept and designs already in use on British copper coinage: \"Liberty thus emerged as a refurbished Britannia, her trident replaced by a staff and pileus.\"[7] In the same letter, Patterson also informed Sully of his vision for the reverse, which Peale would execute: \"I propose an Eagle flying, and rising in flight, amidst a constellation, irregularly dispersed, of 24 stars [representing the number of states then forming the Union], and carrying in its claws a scroll with the words E PLURIBUS UNUM\".[6] Patterson preferred a soaring eagle because he believed that the heraldic eagle commonly used on American coins, which he dismissed as a \"mere creature of imagination\",[6] was unappealing as a design. According to a common story, the flying eagle seen on the Gobrecht dollar was modeled after Peter, the Mint's pet eagle, who was taxidermied after his death by becoming caught in a coining press and remains on display at the Mint to this day.[9]",
			"color": "dark|0.55268 gray|0.55268 dark|0.55268 grey|0.55268 silver|0.11864 gray|0.097543 grey|0.097543 dim|0.093501 gray|0.093501 dim|0.093501 grey|0.093501 light|0.066594 slate|0.066594 gray|0.066594 slate|0.054813 gray|0.054813 light|0.0063191 gray|0.0063191 light|0.0063191 grey|0.0063191 light|0.0039505 steel|0.0039505 blue|0.0039505  "
		}
	}
}
