{
	"add": {
		"doc": {
			"id": "9c81cbcce83f2627474f76b2cdda51b4f7b0b1eb0255bf23895e7382f8a5ef28",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/RichardHakluyt-BristolCathedral-stainedglasswindow.jpg/120px-RichardHakluyt-BristolCathedral-stainedglasswindow.jpg",
				"previous": "Portal:Geography/Featured biography/17",
				"after": "Richard Hakluyt was an English writer. He is known for promoting the settlement of North America by the English through his works, notably Divers Voyages Touching the Discoverie of America and The Principal Navigations, Voiages, Traffiques and Discoueries of the English Nation. Hakluyt was educated at Westminster School and Christ Church, Oxford. Between 1583 and 1588 he was chaplain and secretary to Sir Edward Stafford, English ambassador at the French court. An ordained priest, Hakluyt held important positions at Bristol Cathedral and Westminster Abbey and was personal chaplain to Sir Robert Cecil, 1st Earl of Salisbury, principal Secretary of State to Elizabeth I and James I. He was the chief promoter of a petition to James I for letters patent to colonize Virginia, which were granted to the London Company and Plymouth Company (referred to collectively as the Virginia Company) in 1606. His last publication was a translation of Hernando de Soto's discoveries in Florida, entitled Virginia Richly Valued, by the Description of the Maine Land of Florida, Her Next Neighbour. This work was intended to encourage the young colony of Virginia. The Hakluyt Society, founded in 1846, publishes scholarly editions of primary records of voyages and travels to this day.",
			"color": "black|0.17594 light|0.067592 cyan|0.067592 powder|0.06535 blue|0.06535 azure|0.0569 dark|0.052896 gray|0.052896 dark|0.052896 grey|0.052896 silver|0.043137 dim|0.042869 gray|0.042869 dim|0.042869 grey|0.042869 mint|0.042739 cream|0.042739 gray|0.040676 grey|0.040676 alice|0.038947 blue|0.038947 light|0.036305 blue|0.036305 light|0.034836 gray|0.034836 light|0.034836 grey|0.034836 gainsboro|0.031515 dark|0.03049 slate|0.03049 gray|0.03049 white|0.027143 smoke|0.027143 honeydew|0.026809 dark|0.025069 slate|0.025069 blue|0.025069 white|0.021923 ghost|0.020352 white|0.020352 snow|0.016511 pale|0.014111 turquoise|0.014111 cadet|0.011067 blue|0.011067 floral|0.01044 white|0.01044 slate|0.009368 gray|0.009368 light|0.0086905 slate|0.0086905 gray|0.0086905  "
		}
	}
}
