{
	"add": {
		"doc": {
			"id": "9cbd62a09aaf71a3a0bb61aa3498fbba7bd6549aa7a94eae961583e4947f0304",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Ortsschild_Emlichheim_-_Emmelkamp_cropped.jpg/220px-Ortsschild_Emlichheim_-_Emmelkamp_cropped.jpg",
			"previous": [],
			"after": [
				"Dialects of Low German are widely spoken in the northeastern area of the Netherlands (Dutch Low Saxon) and are written there with an orthography based on Standard Dutch orthography.",
				"Variants of Low German were widely (and are still to a far lesser extent) spoken in most parts of Northern Germany, for instance in the states of Lower Saxony, North Rhine-Westphalia, Hamburg, Bremen, Schleswig-Holstein, Mecklenburg-Vorpommern, Saxony-Anhalt and Brandenburg. Small portions of northern Hesse and northern Thuringia are traditionally Low Saxon-speaking too. Historically, Low German was also spoken in formerly German parts of Poland as well as in East Prussia and the Baltic States of Estonia and Latvia. The language was also formerly spoken in the outer areas of what is now the city-state of Berlin, but in the course of urbanisation and national centralisation in that city, the language has vanished. (The Berlin dialect itself is a northern outpost of High German and typologically a Missingsch variety,[citation needed] although rarely recognized as the latter.[citation needed]) Under the name Low Saxon, there are speakers in the Dutch north-eastern provinces of Groningen, Drenthe, Stellingwerven (part of Friesland), Overijssel and Gelderland, in several dialect groups per province."
			],
			"color": "dark|0.43028 slate|0.43028 gray|0.43028 steel|0.12821 blue|0.12821 dark|0.085722 golden|0.085722 rod|0.085722 dim|0.063913 gray|0.063913 dim|0.063913 grey|0.063913 golden|0.062158 rod|0.062158 slate|0.055084 gray|0.055084 light|0.03322 slate|0.03322 gray|0.03322 gray|0.029757 grey|0.029757 black|0.024678 dark|0.017936 gray|0.017936 dark|0.017936 grey|0.017936  "
		}
	}
}
