{
	"add": {
		"doc": {
			"id": "9cbecb6811adda9e2e0baa8b12d1f35b7b6f093aa2615ccd091d530e0b2b0773",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Bronze_Statuette_of_a_Veiled_and_Masked_Dancer_1.jpg/100px-Bronze_Statuette_of_a_Veiled_and_Masked_Dancer_1.jpg",
				"previous": "Participatory dance, on the other hand, whether it be a folk dance, a social dance, a group dance such as a line, circle, chain or square dance, or a partner dance such as is common in western Western ballroom dancing, is undertaken primarily for a common purpose, such as social interaction or exercise, of participants rather than onlookers. Such dance seldom has any narrative. A group dance and a corps de ballet, a social partner dance and a pas de deux, differ profoundly. Even a solo dance may be undertaken solely for the satisfaction of the dancer. Participatory dancers often all employ the same movements and steps but, for example, in the rave culture of electronic dance music, vast crowds may engage in free dance, uncoordinated with those around them. On the other hand, some cultures lay down strict rules as to the particular dances in which, for example, men, women and children may or must participate.",
			"after": [
				"Archeological evidence for early dance includes 9,000 year old paintings in India at the Rock Shelters of Bhimbetka, and Egyptian tomb paintings depicting dancing figures, dated c. 3300 BC.",
				"Before the invention of written languages, dance was a more important method of passing stories down from generation to generation.[3] The use of dance in ecstatic trance states and healing rituals, as today in many cultures from the Brazilian rainforest to the Kalahari Desert, is thought to have been another early factor.[4]"
			],
			"color": "pale|0.12108 turquoise|0.12108 burly|0.088655 wood|0.088655 tan|0.075968 powder|0.075325 blue|0.075325 light|0.070451 cyan|0.070451 navajo|0.051232 white|0.051232 light|0.036864 blue|0.036864 moccasin|0.033137 wheat|0.031728 pale|0.030487 golden|0.030487 rod|0.030487 azure|0.028373 mint|0.026255 cream|0.026255 floral|0.026243 white|0.026243 sea|0.023681 shell|0.023681 white|0.022962 white|0.022472 smoke|0.022472 snow|0.0223 alice|0.019854 blue|0.019854 ghost|0.018887 white|0.018887 lemon|0.017869 chiffon|0.017869 ivory|0.013728 lavender|0.013517 blush|0.013517 light|0.013293 golden|0.013293 rod|0.013293 yellow|0.013293  "
		}
	}
}
