{
	"add": {
		"doc": {
			"id": "9cc732526682e6e1f350513cab51a3b94b4d168c48571a94db60c5db0842ee89",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Abbey-of-senanque-provence-gordes.jpg/220px-Abbey-of-senanque-provence-gordes.jpg",
				"previous": "Monastic reform inspired change in the secular church. The ideals that it was based upon were brought to the papacy by Pope Leo IX (pope 1049–1054), and provided the ideology of the clerical independence that led to the Investiture Controversy in the late 11th century. This involved Pope Gregory VII (pope 1073–85) and Emperor Henry IV, who initially clashed over episcopal appointments, a dispute that turned into a battle over the ideas of investiture, clerical marriage, and simony. The emperor saw the protection of the Church as one of his responsibilities as well as wanting to preserve the right to appoint his own choices as bishops within his lands, but the papacy insisted on the Church's independence from secular lords. These issues remained unresolved after the compromise of 1122 known as the Concordat of Worms. The dispute represents a significant stage in the creation of a papal monarchy separate from and equal to lay authorities. It also had the permanent consequence of empowering German princes at the expense of the German emperors.[247]",
				"after": "The High Middle Ages was a period of great religious movements. Besides the Crusades and monastic reforms, people sought to participate in new forms of religious life. New monastic orders were founded, including the Carthusians and the Cistercians. The latter especially expanded rapidly in their early years under the guidance of Bernard of Clairvaux (d. 1153). These new orders were formed in response to the feeling of the laity that Benedictine monasticism no longer met the needs of the laymen, who along with those wishing to enter the religious life wanted a return to the simpler hermetical monasticism of early Christianity, or to live an Apostolic life.[206] Religious pilgrimages were also encouraged. Old pilgrimage sites such as Rome, Jerusalem, and Compostela received increasing numbers of visitors, and new sites such as Monte Gargano and Bari rose to prominence.[249]",
			"color": "dim|0.25377 gray|0.25377 dim|0.25377 grey|0.25377 gray|0.20809 grey|0.20809 dark|0.10353 gray|0.10353 dark|0.10353 grey|0.10353 dark|0.094773 olive|0.094773 green|0.094773 black|0.044167 rosy|0.035741 brown|0.035741 silver|0.033076 dark|0.023398 slate|0.023398 gray|0.023398 light|0.022152 gray|0.022152 light|0.022152 grey|0.022152 gainsboro|0.020001 misty|0.016164 rose|0.016164 linen|0.015721 dark|0.014758 khaki|0.014758 sea|0.013154 shell|0.013154 white|0.011322 smoke|0.011322 lavender|0.010333 blush|0.010333 antique|0.0096394 white|0.0096394  "
		}
	}
}
