{
	"add": {
		"doc": {
			"id": "9ccc936989180e6d5100ca8d4d49467ed3ed66a90bd150f27f59130e5dad8ead",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/William_Davenport.JPG/220px-William_Davenport.JPG",
				"previous": "The Davenports held the manor for around 500 years, and it is likely that after their accession they built the current house. The first William Davenport was lord of the manor from 1478 to 1528,[8] and one of the first recorded trustees of Macclesfield Grammar School.[9] It is possible that he was heavily involved in the final battle of the Wars of the Roses at Bosworth and thereby instrumental in gaining the crown for Henry VII,[10] who rewarded him with a pension of 20 marks per year payable for his lifetime.[11] According to Dean, it was during this first William's tenure that Bramall may have been vandalised by a man named Randle Hassall, who destroyed all or part of nine houses and stole the timber. This gives credence to the theory that Bramall was rebuilt, replacing or partially replacing an older building.[9]",
				"after": "The third William Davenport, who succeeded his father of the same name in 1541, took part in what later became known as The Rough Wooing, a series of attacks against Scotland ordered by Henry VIII. He was knighted in Scotland for his efforts at the burning of Edinburgh in May 1544.[12] The fifth William Davenport inherited Bramall in 1585 from his father of the same name, and lived there with his wife Dorothy for over 50 years. The first marriage in Bramall's chapel was recorded in 1599,[13] between William (aged 15), eldest son of the fifth William and Dorothy, and Frances Wilbraham (aged 11).[14] On 22 April 1603 the fifth William Davenport was knighted by James I at Newark (where the king was staying on his journey from Edinburgh to London) and later became the High Sheriff of Cheshire and a commissioner of the Hundred of Macclesfield.[13] During the tenure of the fifth William, many alterations were made to the building, including the addition of a room above the Great Hall (which would later become the Withdrawing Room), and a long gallery.[15] The internal decorations were also updated with additions such as wall paintings and portraits.[16]",
			"color": "silver|0.25643 dark|0.21583 gray|0.21583 dark|0.21583 grey|0.21583 light|0.213 gray|0.213 light|0.213 grey|0.213 gainsboro|0.15849 gray|0.042693 grey|0.042693 linen|0.024539 white|0.022938 smoke|0.022938 sea|0.013462 shell|0.013462 floral|0.0096106 white|0.0096106 old|0.0091023 lace|0.0091023 mint|0.0085012 cream|0.0085012 snow|0.0081212 white|0.0045977 dim|0.0038998 gray|0.0038998 dim|0.0038998 grey|0.0038998 ivory|0.0037972  "
		}
	}
}
