{
	"add": {
		"doc": {
			"id": "9ce4757fe3f218184c9a84dd311fbb98c40620411d764afa2ced14e935ae8a92",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Bryan_in_1900.jpg/220px-Bryan_in_1900.jpg",
				"previous": "Beginning in 1859, large quantities of silver were found in Nevada Territory and elsewhere in the American West.[44] In 1869, Director of the Mint Henry Linderman began advocating the end of the acceptance of silver bullion deposits to be struck into dollars. Although silver dollars were not coined in large numbers, Linderman saw that mining in the West would increase after the completion of the transcontinental railroad,[c] which it did, as US silver production increased from 10 million troy ounces in 1867 to more than 22 million five years later. Linderman foresaw that these activities would increase the supply of silver, causing its price to drop below the $1.2929 per ounce at which the precious metal in the standard silver dollar is worth $1.00. He anticipated that silver suppliers would turn to the Mint to dispose of their product by striking it into dollars. The monetization of that cheap silver, Linderman feared, would inflate the currency and drive gold from commerce because of Gresham's law. Although silver advocates later called the resulting law the \"Crime of '73\" and claimed that it had been passed in a deceitful manner, the bill was discussed during five different sessions of Congress, read in full by both the House of Representatives and the Senate and printed in full on multiple occasions. Once it passed both houses of Congress, it was signed into law by President Ulysses S. Grant on February 12, 1873.[45][46]",
				"after": "The Coinage Act of 1873 ended production of the standard silver dollar and authorized creation of the Trade dollar, thus concluding the Seated Liberty dollar series.[47] The Trade dollar was slightly heavier than the standard dollar and was intended for use in payments in silver to merchants in China. Although not meant for use in the United States, a last-minute rider gave it legal tender status there up to $5. When silver prices plummeted in the mid-1870s, millions appeared in circulation, at first in the West and then throughout the United States, causing problems in commerce when banks insisted on the $5 legal tender limit. Other abuses followed, such as purchase by companies for bullion value (by then about $0.80) for use in pay packets. Workers had little option but to accept them as dollars. In response to complaints, Congress ended any status as legal tender in 1876, halted production of the Trade dollar (except for collectors) in 1878, and agreed to redeem any which had not been chopmarked in 1887.[48]",
			"color": "tan|0.13167 wheat|0.11986 bisque|0.098682 blanched|0.082213 almond|0.082213 antique|0.069556 white|0.069556 papaya|0.053281 whip|0.053281 peach|0.044653 puff|0.044653 beige|0.043828 silver|0.037666 burly|0.036423 wood|0.036423 light|0.029699 gray|0.029699 light|0.029699 grey|0.029699 corn|0.025726 silk|0.025726 dark|0.02404 gray|0.02404 dark|0.02404 grey|0.02404 moccasin|0.020882 gainsboro|0.01699 old|0.013822 lace|0.013822 dark|0.013656 slate|0.013656 gray|0.013656 navajo|0.012607 white|0.012607 light|0.012591 golden|0.012591 rod|0.012591 yellow|0.012591 light|0.011064 yellow|0.011064 gray|0.0096179 grey|0.0096179 linen|0.0090112 lemon|0.0087791 chiffon|0.0087791 dim|0.0087719 gray|0.0087719 dim|0.0087719 grey|0.0087719 cadet|0.0070095 blue|0.0070095  "
		}
	}
}
