{
	"add": {
		"doc": {
			"id": "9cecd9eebf125b1e98ca5cd126d4334c8559bcdc320309236520d9fc4d4170ec",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/AlbaniansOutsideAlbania.png/220px-AlbaniansOutsideAlbania.png",
				"previous": "By the 1870s, the Sublime Porte's reforms aimed at checking the Ottoman Empire's disintegration had clearly failed. The image of the \"Turkish yoke\" had become fixed in the nationalist mythologies and psyches of the empire's Balkan peoples, and their march toward independence quickened. The Albanians, because of the higher degree of Islamic influence, their internal social divisions, and the fear that they would lose their Albanian-populated lands to the emerging Balkan states—Serbia, Montenegro, Bulgaria, and Greece—were the last of the Balkan peoples to desire division from the Ottoman Empire.[68] The Albanian national awakening as a coherent political movement began after the Treaty of San Stefano, according to which Albanian-inhabited areas were to be ceded to other states of the Balkans, and focused on preventing that partition.[69][70] The Treaty of San Stefano was the impetus for the nation-building movement, which was based more on fear of partition than national identity.[70] Even after Albania became independent in 1912, Albanian national identity was fragmented and possible non-existent in much of the new country.[70] The state of disunity and fragmentation would remain until the communist period following World War II, when the communist nation-building project would achieve greater success in nation-building and reach more people than any previous regime, thus creating Albanian national communist identity.[70]",
				"after": "Approximately 7 million Albanians are to be found within the Balkan peninsula with about half this number residing in Albania and the other divided between Kosovo, Montenegro, Serbia, the Republic of Macedonia, Greece and to a much smaller extent Bosnia, Bulgaria, Croatia, Romania, and Slovenia.",
			"color": "black|0.67455 maroon|0.12118 dark|0.1124 red|0.1124 dim|0.047609 gray|0.047609 dim|0.047609 grey|0.047609 gray|0.019345 grey|0.019345 indian|0.010686 red|0.010686 light|0.0054818 coral|0.0054818 salmon|0.0034957  "
		}
	}
}
