{
	"add": {
		"doc": {
			"id": "9cee6511bf428d5dc7961681f86c41e87aa2311b69a2255b7fbd26c40b031feb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Presse_olive_Volubilis.jpg/220px-Presse_olive_Volubilis.jpg",
			"previous": [],
				"after": "During Roman times, Volubilis was a major producer of olive oil. The remains of buildings dedicated to olive pressing are still readily visible, as are the remains of the original presses and olive mills. One such building has been reconstructed with a full-size replica of a Roman olive press.[39] Olive oil was central to the life of the city, as it was not just a foodstuff but was also used for lamps, bathing and medicines, while the pressed olives were fed to animals or dried out and used as fuel for the bathhouses. For this reason, even some of the grandest mansions had their own olive presses.[40] Fifty-eight oil-pressing complexes have so far been discovered in Volubilis. They housed a standard set of elements: a mill, used to crush the olives, a decantation basin to catch the oil from pressed olives, and a press that comprised a counterweight, a prelum or cross-bar and the wooden supports within which the prelum was fixed. The olives were first crushed into a paste, then put into woven baskets that were subjected to pressing. The olive oil ran out into the decantation basin, to which water was periodically added to make the lighter oil float to the surface. This was then scooped out of the basin and poured into amphorae.[38] There is also substantial evidence of the city being a lively commercial centre. No fewer than 121 shops have been identified so far, many of them bakeries,[41] and judging from the number of bronzes found at the site it may also have been a centre for the production or distribution of bronze artworks.[42]",
			"color": "gray|0.4145 grey|0.4145 dim|0.24955 gray|0.24955 dim|0.24955 grey|0.24955 dark|0.12459 gray|0.12459 dark|0.12459 grey|0.12459 slate|0.075769 gray|0.075769 silver|0.044957 light|0.030549 slate|0.030549 gray|0.030549 light|0.016577 gray|0.016577 light|0.016577 grey|0.016577 gainsboro|0.0092986 light|0.0076302 steel|0.0076302 blue|0.0076302 lavender|0.0062587  "
		}
	}
}
