{
	"add": {
		"doc": {
			"id": "9cf2a762476e83a6087166132c62374b7448bff0da1081b17835f0973a232446",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Clock_Tower_from_Su_Song%27s_Book.JPG/133px-Clock_Tower_from_Su_Song%27s_Book.JPG",
				"previous": "In ancient China, the 3rd century text of the Lie Zi describes an account of humanoid automata, involving a much earlier encounter between Chinese emperor King Mu of Zhou and a mechanical engineer known as Yan Shi, an 'artificer'. Yan Shi proudly presented the king with a life-size, human-shaped figure of his mechanical 'handiwork' made of leather, wood, and artificial organs.[10] There are also accounts of flying automata in the Han Fei Zi and other texts, which attributes the 5th century BC Mohist philosopher Mozi and his contemporary Lu Ban with the invention of artificial wooden birds (ma yuan) that could successfully fly.[13] In 1066, the Chinese inventor Su Song built a water clock in the form of a tower which featured mechanical figurines which chimed the hours.",
				"after": "The beginning of automata is associated with the invention of early Su Song's astronomical clock tower featured mechanical figurines that chimed the hours.[20][21][22] His mechanism had a programmable drum machine with pegs (cams) that bumped into little levers that operated percussion instruments. The drummer could be made to play different rhythms and different drum patterns by moving the pegs to different locations.[22]",
			"color": "antique|0.12205 white|0.12205 linen|0.092252 old|0.08379 lace|0.08379 sea|0.075459 shell|0.075459 papaya|0.072764 whip|0.072764 floral|0.070406 white|0.070406 ivory|0.056766 beige|0.054652 corn|0.050759 silk|0.050759 misty|0.046759 rose|0.046759 blanched|0.04042 almond|0.04042 silver|0.03721 light|0.029049 gray|0.029049 light|0.029049 grey|0.029049 dark|0.026645 gray|0.026645 dark|0.026645 grey|0.026645 snow|0.020486 gray|0.017521 grey|0.017521 gainsboro|0.016854 white|0.01312 smoke|0.01312 bisque|0.012451 light|0.01198 yellow|0.01198 honeydew|0.009229 dim|0.0088748 gray|0.0088748 dim|0.0088748 grey|0.0088748 mint|0.0075678 cream|0.0075678 white|0.0068675 lavender|0.0051596 blush|0.0051596 peach|0.0047608 puff|0.0047608 tan|0.0044478  "
		}
	}
}
