{
	"add": {
		"doc": {
			"id": "9cfa47ea538f3a202c5088e906fe564281d84d7510bdfe7e56e35ab27e10ca82",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/William_gull.jpg/170px-William_gull.jpg",
			"previous": [],
				"after": "Stowell's article attracted intense attention,[9][11] and placed Albert Victor among the most notable Ripper suspects, but his innocence was soon proven. Gull died before Albert Victor, and so could not have known about Albert Victor's death.[12] All three doctors who were attending Albert Victor at his death in 1892 concurred that he had died of pneumonia, and given the timescale of syphilitic disease progression, it is highly improbable that Albert Victor had syphilis. The first symptoms of mental illness that arise from syphilitic infection tend to occur about 15 years from first exposure. While the timescale of disease progression is never absolute, for Albert Victor to have suffered from syphilitic insanity in 1888, he would probably have to have been infected at the age of nine in about 1873, six years before he visited the West Indies.[13] Stowell claimed that his suspect had been incarcerated in a mental institution, when Albert Victor was serving in the British army, making regular public appearances, and visiting friends at country houses.[14] Newspaper reports, Queen Victoria's diary, family letters, and official documents prove that Albert Victor was attending functions in public, or meeting foreign royalty, or hundreds of miles from London at the time of each of the five canonical murders.[15][16]",
			"color": "antique|0.1077 white|0.1077 linen|0.09212 old|0.087762 lace|0.087762 beige|0.080629 sea|0.079666 shell|0.079666 floral|0.078841 white|0.078841 ivory|0.075947 corn|0.060353 silk|0.060353 papaya|0.058911 whip|0.058911 honeydew|0.046904 black|0.031092 light|0.025194 gray|0.025194 light|0.025194 grey|0.025194 mint|0.024612 cream|0.024612 dark|0.022332 gray|0.022332 dark|0.022332 grey|0.022332 silver|0.022167 white|0.020869 smoke|0.020869 gainsboro|0.01878 blanched|0.015855 almond|0.015855 gray|0.013634 grey|0.013634  "
		}
	}
}
