{
	"add": {
		"doc": {
			"id": "9d04c2b45c53189476606c05cd5db688210b34177212ba9d6a1551215ff62ff6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Women_and_Children_in_the_Tube_%281940%29_%28Art.IWM_ART_LD_759%29.jpg/220px-Women_and_Children_in_the_Tube_%281940%29_%28Art.IWM_ART_LD_759%29.jpg",
				"previous": "Moore and Nash were on the organising committee of the International Surrealist Exhibition, which took place in London in 1936. In 1937, Roland Penrose purchased an abstract 'Mother and Child' in stone from Moore that he displayed in the front garden of his house in Hampstead. The work proved controversial with other residents and the local press ran a campaign against the piece over the next two years. At this time Moore gradually transitioned from direct carving to casting in bronze, modelling preliminary maquettes in clay or plaster rather than making preparatory drawings.",
				"after": "At the outbreak of the Second World War the Chelsea School of Art was evacuated to Northampton and Moore resigned his teaching post. During the war, Moore produced powerful drawings of Londoners sleeping in the London Underground while sheltering from the Blitz.[16] Kenneth Clark, the chairman of the War Artists' Advisory Committee,WAAC, had previously tried to recruit Moore as a full-time salaried war artist and now agreed to purchase some of the shelter drawings and issued contracts for further examples. The shelter drawings WAAC acquired were completed between the autumn of 1940 and the spring of 1941 and are regarded as among the finest products of the WAAC scheme.[17] In August 1941 WAAC commissioned Moore to draw miners working underground at the Wheldale Colliery in Yorkshire, where his father had worked at the start of the century. Whereas Moore drew the people in the shelters as passively waiting the all-clear he shows the miners aggressively working the coal-faces.[18] These drawings helped to boost Moore's international reputation, particularly in America where examples were included in the WAAC Britain at War exhibition which toured North America throughout the war.[17]",
			"color": "gray|0.55686 grey|0.55686 dim|0.32815 gray|0.32815 dim|0.32815 grey|0.32815 dark|0.10119 gray|0.10119 dark|0.10119 grey|0.10119 silver|0.011864  "
		}
	}
}
