{
	"add": {
		"doc": {
			"id": "9d0a5321ed8ebec21c89aa12f59d6cea0f820d4fce7dcc3b911a0a182596801b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Bgy_Hall.jpg/200px-Bgy_Hall.jpg",
				"previous": "The historical old bridge connecting northern and southern areas of the town was destroyed by the Japanese thus separating Polo in two parts. The northern part was at once liberated by joint Filipino and American troops while the southern part, which includes the municipal center poblacion was still under the Japanese banner. The Japanese abandoned the town on 11 February 1945 when the combined troops were able to cross the river and took the town.",
				"after": "Until 1960, what was then called Polo was a town in the Second District of Bulacan. On 21 July 1960, President Diosdado Macapagal signed Executive Order No. 401 which divided Polo into two: Polo and Valenzuela. Polo comprised the northern barangays of Wawang Pulo, Poblacion, Palasan, Arkong Bato, Pariancillo Villa, Balangkas, Mabolo, Coloong, Malanday, Bisig, Tagalag, Rincon, Pasolo, Punturin, Bignay and Dalandanan. Valenzuela, on the other hand, comprised the southern barangays of Karuhatan, Marulas, Malinta, Ugong, Mapulang Lupa, Canumay, Maysan, Parada, Paso de Blas, Bagbaguin and Torres Bugallón (now Gen. T. de Leon).",
			"color": "dim|0.22433 gray|0.22433 dim|0.22433 grey|0.22433 gray|0.12819 grey|0.12819 dark|0.083544 gray|0.083544 dark|0.083544 grey|0.083544 silver|0.079549 black|0.068752 slate|0.058644 gray|0.058644 light|0.048917 slate|0.048917 gray|0.048917 light|0.0359 gray|0.0359 light|0.0359 grey|0.0359 gainsboro|0.026251 dark|0.025412 slate|0.025412 gray|0.025412 white|0.01583 smoke|0.01583 sea|0.014855 shell|0.014855 linen|0.01422 floral|0.012438 white|0.012438 snow|0.011542 lavender|0.011307 blush|0.011307 light|0.010893 steel|0.010893 blue|0.010893 rosy|0.0093949 brown|0.0093949 old|0.0088603 lace|0.0088603 white|0.0086499 misty|0.0085475 rose|0.0085475 mint|0.0080583 cream|0.0080583 ghost|0.0080193 white|0.0080193 thistle|0.0069945  "
		}
	}
}
