{
	"add": {
		"doc": {
			"id": "9d0ce4b5dab1beabc05f11c991a2ecc2f59350174abbd5036aebd89a99cb298b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Glendale-arena.jpg/220px-Glendale-arena.jpg",
				"previous": "The Arizona Cardinals are the oldest continuously run professional football franchise in the nation. They moved to Phoenix from St. Louis, Missouri in 1988 and currently play in the Western Division of the National Football League's National Football Conference. The Cardinals were founded in 1898 in Chicago, as the Morgan Athletic Club, and became known as the Cardinals shortly after, due to the color of their jerseys. Around the turn of the last century, they were known as the Racine Cardinals, and in 1920, they became a charter member of the American Professional Football League, which would eventually become the National Football League. Upon their move to Phoenix, the Cardinals originally played their home games at Sun Devil Stadium on the campus of Arizona State University in nearby Tempe. In 2006 they moved to the newly constructed University of Phoenix Stadium in suburban Glendale.[192] Since moving to Phoenix, the Cardinals have made one championship appearance, Super Bowl XLIII on February 1, 2009, where they lost 27-23 to the Pittsburgh Steelers.[193]",
				"after": "The Arizona Coyotes of the National Hockey League moved to the area in 1996,[194] formerly known as the Winnipeg Jets. They originally played their home games at America West Arena in downtown Phoenix before moving in December 2003 to the Jobing.com Arena (now named the Gila River Arena), adjacent to University of Phoenix Stadium in Glendale.[195]",
			"color": "black|0.1548 dim|0.14567 gray|0.14567 dim|0.14567 grey|0.14567 tan|0.082627 gray|0.075086 grey|0.075086 antique|0.074775 white|0.074775 silver|0.05119 dark|0.043403 gray|0.043403 dark|0.043403 grey|0.043403 misty|0.036199 rose|0.036199 papaya|0.031772 whip|0.031772 bisque|0.028609 blanched|0.027763 almond|0.027763 light|0.026954 gray|0.026954 light|0.026954 grey|0.026954 linen|0.02359 slate|0.01991 gray|0.01991 light|0.01809 slate|0.01809 gray|0.01809 peach|0.017586 puff|0.017586 steel|0.016965 blue|0.016965 old|0.015035 lace|0.015035 rosy|0.014599 brown|0.014599 light|0.011973 steel|0.011973 blue|0.011973  "
		}
	}
}
