{
	"add": {
		"doc": {
			"id": "9d256ce67eb95327d9dcade672252dc3cd43bfe1dff1ef19c137cf5b7533c767",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Rudolf_Rocker.jpg/200px-Rudolf_Rocker.jpg",
				"previous": "The Biennio Rosso (English: \"Red Biennium\") was a two-year period, between 1919 and 1920, of intense social conflict in Italy, following the first world war.[19] The Biennio Rosso took place in a context of economic crisis at the end of the war, with high unemployment and political instability. It was characterized by mass strikes, worker manifestations as well as self-management experiments through land and factories occupations.[19] In Turin and Milan, workers councils were formed and many factory occupations took place under the leadership of anarcho-syndicalists. The agitations also extended to the agricultural areas of the Padan plain and were accompanied by peasant strikes, rural unrests and guerilla conflicts between left-wing and right-wing militias. According to libcom.org, the anarcho-syndicalist trade union Unione Sindacale Italiana \"grew to 800,000 members and the influence of the Italian Anarchist Union (20,000 members plus Umanita Nova, its daily paper) grew accordingly ... Anarchists were the first to suggest occupying workplaces.[20]",
				"after": "Many of the largest members of the IWA were broken, driven underground or wiped out in the 1920s–30s as fascists came to power in states across Europe and workers switched away from anarchism towards the seeming success of the Bolshevik model of socialism. In Argentina, the FORA had already begun a process of decline by the time it joined the IWA, having split in 1915 into pro and anti-Bolshevik factions. From 1922, the anarchist movement there lost most of its membership, exacerbated by further splits, most notably around the Severino Di Giovanni affair. It was crushed by General Uriburu's military coup in 1930.[21] Germany's FAUD struggled throughout the late 1920s and early 30s as the brownshirts took control of the streets. Its last national congress in Erfurt in March 1932 saw the union attempt to form an underground bureau to combat Hitler's fascists, a measure which was never put into practice as mass arrests decimated the conspirators' ranks.[22] The editor of the FAUD organ Der Syndikalist, Gerhard Wartenberg was killed in Sachsenhausen concentration camp. Karl Windhoff, delegate to the IWA Madrid congress of 1931 was driven out of his mind and also died in a Nazi death camp. There were also mass trials of FAUD members held in Wuppertal and Rhenanie, many of these never survived the death camps.[13] Italian IWA union the Unione Sindacale Italiana, which had claimed a membership of up to 600,000 people in 1922, was warning even at that time of murders and repression from Benito Mussolini's fascists.[23] It had been driven underground by 1924 and although it was still able to lead significant strikes by miners, metalworkers and marble workers, Mussolini's ascent to power in 1925 sealed its fate. By 1927 its leading activists had been arrested or exiled.[24]",
			"color": "tan|0.26318 wheat|0.1739 black|0.10285 bisque|0.093443 peach|0.077291 puff|0.077291 blanched|0.063002 almond|0.063002 moccasin|0.062187 papaya|0.038626 whip|0.038626 navajo|0.027222 white|0.027222 antique|0.022768 white|0.022768 corn|0.019157 silk|0.019157 lemon|0.01465 chiffon|0.01465 light|0.013365 golden|0.013365 rod|0.013365 yellow|0.013365  "
		}
	}
}
