{
	"add": {
		"doc": {
			"id": "9d288803a288f64dc379e1c7f5b747a10bd76e5cb14190780d771ae90f8b400b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Starved_girl.jpg/200px-Starved_girl.jpg",
				"previous": "In 1977, British cultural theorist Paul Willis published a study titled \"Learning to Labour\", in which he investigated the connection between social class and education. In his study, he found that a group of working class schoolchildren had developed an antipathy towards the acquisition of knowledge as being outside their class, and therefore undesirable, perpetuating their presence in the working class.[37]",
			"after": [
				"A person's social class has a significant impact on their physical health, their ability to receive adequate medical care and nutrition, and their life expectancy.[38][39][40]",
				"Lower-class people experience a wide array of health problems as a result of their economic status. They are unable to use health care as often, and when they do it is of lower quality, even though they generally tend to experience a much higher rate of health issues. Lower-class families have higher rates of infant mortality, cancer, cardiovascular disease, and disabling physical injuries. Additionally, poor people tend to work in much more hazardous conditions, yet generally have much less (if any) health insurance provided for them, as compared to middle and upper class workers.[41]"
			],
			"color": "black|0.28992 tan|0.091284 antique|0.075272 white|0.075272 linen|0.056564 old|0.043495 lace|0.043495 sea|0.041406 shell|0.041406 floral|0.036281 white|0.036281 rosy|0.035353 brown|0.035353 white|0.033124 smoke|0.033124 gainsboro|0.032997 snow|0.02867 misty|0.022712 rose|0.022712 white|0.021213 mint|0.019966 cream|0.019966 papaya|0.017868 whip|0.017868 light|0.017668 gray|0.017668 light|0.017668 grey|0.017668 dim|0.016428 gray|0.016428 dim|0.016428 grey|0.016428 lavender|0.013688 blush|0.013688 ghost|0.013529 white|0.013529 bisque|0.012814 ivory|0.012002 blanched|0.011547 almond|0.011547 peach|0.010259 puff|0.010259  "
		}
	}
}
