{
	"add": {
		"doc": {
			"id": "9d4fe4e97fa612b353365f74b826d9b493e3259da6ec0b55d9cf5967a60de0cf",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Coastal_redwood.jpg/220px-Coastal_redwood.jpg",
				"previous": "Previous to Jedediah Smith in 1828, no other explorer of European descent is known to have thoroughly investigated the inland region away from the immediate coast. The discovery of gold along the Trinity River in 1850 led to a minor secondary rush in California. This brought miners into the area and many stayed on at the coast after failing to strike it rich. This quickly led to conflicts wherein native peoples were placed under great strain, if not forcibly removed or massacred.[11] By 1895, only one third of the Yurok in one group of villages remained; by 1919, virtually all members of the Chilula tribe had either died or been assimilated into other tribes.[12] The miners logged redwoods for building; when this minor gold rush ended, some of them turned again to logging, cutting down the giant redwood trees. Initially, over 2,000,000 acres (8,100 km2) of the California and southwestern coast of Oregon were old-growth redwood forest, but by 1910, extensive logging led conservationists and concerned citizens to begin seeking ways to preserve the remaining trees, which they saw being logged at an alarming rate.[13] In 1911, U.S. Representative John E. Raker, of California, became the first politician to introduce legislation for the creation of a redwood national park. However, no further action was taken by Congress at this time.",
				"after": "Preservation of the redwood stands in California is considered one of the most substantial conservation contributions of the Boone and Crockett Club. The Save-the-Redwoods League was founded in 1918 by Boone and Crockett Club members Madison Grant, John C. Merriam, Henry Fairfield Osborn, and future member, Frederick Russell Burnham. The initial purchases of land were made by Club member Stephen Mather and Mr. William Kent. In 1921, Boone and Crockett Club member Dr. John C. Phillips donated $32,000 to purchase land and create the Raynal Bolling Memorial Grove in the Humboldt Redwoods State Park.[14] This was timely as U.S. Route 101, which would soon provide nearly unfettered access to the trees, was under construction. Using matching funds provided initially by the County of Humboldt and later by the State of California, the Save-the-Redwoods League managed to protect areas of concentrated or multiple redwood groves and a few entire forests in the 1920s. As California created a state park system, beginning in 1927, three of the preserved redwood areas became Prairie Creek Redwoods, Del Norte Coast Redwoods, and Jedediah Smith Redwoods State Parks. A fourth became Humboldt Redwoods State Park, by far the largest of the individual Redwood State Parks, but not in the Redwood National and State Park system. Because of the high demand for lumber during World War II and the construction boom that followed in the 1950s, the creation of a national park was delayed. Efforts by the Save-the-Redwoods League, the Sierra Club, and the National Geographic Society to create a national park began in the early 1960s.[15] After intense lobbying of Congress, the bill creating Redwood National Park was signed by President Lyndon Johnson on October 2, 1968. The Save-the-Redwoods League and other entities purchased over 100,000 acres (400 km2), which were added to existing state parks. In 1978, 48,000 acres (190 km2) were added to Redwood National Park in a major expansion.[15] However, only a fifth of that land was old-growth forest, the rest having been logged. This expansion protected the watershed along Redwood Creek from being adversely affected by logging operations outside the park. The federal and state parks were administratively combined in 1994.[16]",
			"color": "black|0.66622 dark|0.043238 slate|0.043238 gray|0.043238 dim|0.036705 gray|0.036705 dim|0.036705 grey|0.036705 gray|0.020721 grey|0.020721 wheat|0.016024 tan|0.016007 slate|0.015872 gray|0.015872 dark|0.015356 gray|0.015356 dark|0.015356 grey|0.015356 light|0.013851 slate|0.013851 gray|0.013851 beige|0.013394 silver|0.011158 corn|0.010276 silk|0.010276 antique|0.0094501 white|0.0094501 papaya|0.009047 whip|0.009047 light|0.0084193 yellow|0.0084193 blanched|0.0078816 almond|0.0078816 light|0.0077873 golden|0.0077873 rod|0.0077873 yellow|0.0077873 light|0.0071053 blue|0.0071053 light|0.0059645 gray|0.0059645 light|0.0059645 grey|0.0059645 old|0.0057424 lace|0.0057424 lemon|0.0056004 chiffon|0.0056004 gainsboro|0.0052671 ivory|0.0052469  "
		}
	}
}
