{
	"add": {
		"doc": {
			"id": "9d4f78a759b15e39e288b331a676702fc4f377071c17c4e2eaa942c0f007bb49",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Strepera_fuliginosa_2.jpg/220px-Strepera_fuliginosa_2.jpg",
			"previous": [],
				"after": "No systematic studies have been done on the diet of the black currawong,[22] but it is known to be omnivorous, feeding on a wide variety of foodstuffs including insects and small vertebrates, carrion, and berries.[21] Birds forage on the ground most often, but also in tree canopies. They use their bills to probe the ground or turn over clods of earth or small rocks looking for food.[22] Birds have been seen using walking tracks to forage along.[23] A group of ten birds were observed trying to break open ice on a frozen lake. They have been recorded foraging along the beach for fly larvae in beached kelp. Most commonly, black currawongs forage in pairs, but they may congregate in larger groups—flocks of 100 birds have descended on orchards to eat apples or rotten fruit. The species has been observed in a mixed-species flocks with forest ravens (Corvus tasmanicus), and silver gulls (Chroicocephalus novaehollandiae), white-faced herons (Egretta novaehollandiae), white-fronted chats (Epthianura albifrons), and European starlings (Sturnus vulgaris) on the beach at Sundown Point.[22] They have been observed securing dead larger prey to ease subsequent dismemberment; a parent currawong had wedged a dead chicken's wings under a log to facilitate pulling off portions such as legs and entrails to feed to its young,[19] and another time hooked a dead rabbit on a spur of a log to rip it into pieces.[30]",
			"color": "burly|0.23316 wood|0.23316 tan|0.21553 black|0.20285 dim|0.054368 gray|0.054368 dim|0.054368 grey|0.054368 dark|0.02962 gray|0.02962 dark|0.02962 grey|0.02962 silver|0.026118 wheat|0.02113 gray|0.019082 grey|0.019082 light|0.014794 gray|0.014794 light|0.014794 grey|0.014794 peach|0.012694 puff|0.012694 navajo|0.010266 white|0.010266 gainsboro|0.0095567 antique|0.0093174 white|0.0093174 bisque|0.0092409 slate|0.0086653 gray|0.0086653  "
		}
	}
}
