{
	"add": {
		"doc": {
			"id": "9d51b008cb39411a9d347fe9d01e994ae75552dc0818f6937f7934bc1f878490",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Meat_Stall_in_Antanavario.JPG/220px-Meat_Stall_in_Antanavario.JPG",
				"previous": "Zebu, a form of humped cattle, were introduced to the island around 1000 CE by settlers from east Africa, who also brought sorghum, goats, possibly Bambara groundnut, and other food sources. Because these cattle represented a form of wealth in east African and consequently Malagasy culture, they were eaten only rarely, typically after their ritual sacrifice at events of spiritual import such as funerals.[2] Fresh zebu milk and curds instead constituted a major part of the pastoralists' diet.[13] Zebu were kept in large herds in the south and west, but as individual herd members escaped and reproduced, a sizable population of wild zebu established itself in the highlands. Merina oral history tells that highland people were unaware that zebu were edible prior to the reign of King Ralambo (ruled 1575–1612), who is credited with the discovery, although archaeological evidence suggests that zebu were occasionally hunted and consumed in the highlands prior to Ralambo's time. It is more likely that these wild herds were first domesticated and kept in pens during this period, which corresponds with the emergence of complex, structured polities in the highlands.[2]",
				"after": "Foods were commonly prepared by boiling in water (at first using green bamboo as a vessel, and later clay or iron pots),[14] roasting over a fire or grilling over hot stones or coals.[6] Fermentation was also used to create curds from milk, develop the flavor of certain dried or fresh tubers or produce alcoholic beverages from honey, sugar cane juice or other local plants.[5] The techniques of sun curing (drying), smoking and salting were used to preserve various foods for transport, trade or future consumption. Many foods prepared in these ways, such as a smoked dried beef called kitoza ([kiˈtuzə̥]) and salted dried fish, are still eaten in a similar form in modern-day Madagascar.[15]",
			"color": "black|0.16967 silver|0.055674 indian|0.051468 red|0.051468 brown|0.048495 light|0.04847 gray|0.04847 light|0.04847 grey|0.04847 gainsboro|0.046034 rosy|0.04257 brown|0.04257 dark|0.040516 gray|0.040516 dark|0.040516 grey|0.040516 dark|0.037356 salmon|0.037356 coral|0.032142 sienna|0.027945 misty|0.024895 rose|0.024895 linen|0.024069 white|0.023342 smoke|0.023342 lavender|0.023339 blush|0.023339 light|0.021981 salmon|0.021981 sea|0.02187 shell|0.02187 light|0.019362 coral|0.019362 gray|0.019187 grey|0.019187 dim|0.019002 gray|0.019002 dim|0.019002 grey|0.019002 snow|0.018769 light|0.018214 pink|0.018214 ghost|0.015755 white|0.015755 floral|0.014872 white|0.014872 thistle|0.013892 white|0.013045 salmon|0.013041 firebrick|0.010997 maroon|0.010574  "
		}
	}
}
