{
	"add": {
		"doc": {
			"id": "9d58249737f3a2e382c8f900eae4e5b328d31e11ffe17721d9850c3375716385",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Beirut_Museum.jpg/220px-Beirut_Museum.jpg",
				"previous": "Beirut has also been called the \"party capital of the Arab world\".[130] Rue Monnot has an international reputation among clubbers,[131] and Rue Gouraud in districts such as Gemmayze and Mar Mikhael have emerged as new hotspots for bar patrons and clubbers, as well as 'The Alleyway' in Hamra Street.",
				"after": "The National Museum of Beirut is the principal museum of archaeology in Lebanon. It has about 1,300 exhibits ranging in date from prehistoric times to the medieval Mamluk period.[132] The Archaeological Museum of the American University of Beirut is the third oldest museum in the Middle East, exhibiting a wide range of artifacts from Lebanon and neighboring countries.[133] Sursock Museum was built by the Sursock family at the end of the 19th century as a private villa and then donated to the Lebanese state. It now houses Beirut's most influential and popular art museum. The permanent collection shows a set of Japanese engravings and numerous works of Islamic art, and temporary exhibitions are shown throughout the year. The Robert Mouawad Private Museum near Beirut's Grand Serail exhibits Henri Pharaon's private collection of archaeology and antiques.[134] Planet Discovery is a children’s science museum with interactive experiments, exhibitions, performances, workshops and awareness competitions.[135] The Saint Joseph University opened the Museum of Lebanese Prehistory in 2000, the first prehistory museum in the Arabic Middle East, displaying bones, stone tools and neolithic pottery collected by Jesuits.[136]",
			"color": "black|0.52816 golden|0.19983 rod|0.19983 khaki|0.099101 dark|0.089782 golden|0.089782 rod|0.089782 peru|0.015057 pale|0.013809 golden|0.013809 rod|0.013809 dark|0.012543 olive|0.012543 green|0.012543  "
		}
	}
}
