{
	"add": {
		"doc": {
			"id": "9d65979c750af0fb0be45ae2caf944556aea7f1d099b055ae76ae8bd4614874e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Mohave_No._2_at_Yuma_1876.jpg/220px-Mohave_No._2_at_Yuma_1876.jpg",
				"previous": "Gold strikes from the mid-19th to early 20th centuries played a major role in attracting settlers to the upper Colorado River basin. In 1859, a group of adventurers from Georgia discovered gold along the Blue River in Colorado and established the mining boomtown of Breckenridge.[162] During 1875, even bigger strikes were made along the Uncompahgre and San Miguel rivers, also in Colorado, and these led to the creation of Ouray and Telluride, respectively.[163][164] Because most gold deposits along the upper Colorado River and its tributaries occur in lode deposits, extensive mining systems and heavy machinery were required to extract them. Mining remains a substantial contributor to the economy of the upper basin and has led to acid mine drainage problems in some regional streams and rivers.[165][166]",
				"after": "Starting in the latter half of the 19th century, the lower Colorado below Black Canyon became an important waterway for steamboat commerce. In 1852, the Uncle Sam was launched to provide supplies to the U.S. Army outpost at Fort Yuma. Although this vessel accidentally foundered and sank early in its career, commercial traffic quickly proliferated because river transport was much cheaper than hauling freight over land.[167] Navigation on the Colorado River was dangerous because of the shallow channel and flow variations, so the first sternwheeler on the river, the Colorado of 1855, was designed to carry 60 short tons (54 t) while drawing less than 2 feet (0.6 m) of water.[168] The tidal bore of the lower Colorado also presented a major hazard; in 1922, a 15-foot (4.6 m)-high wave swamped a ship bound for Yuma, killing between 86 and 130 people.[169][170] Steamboats quickly became the principal source of communication and trade along the river until competition from railroads began in the 1870s, and finally the construction of dams along the lower river, none of which had locks to allow the passage of ships.[171]",
			"color": " "
		}
	}
}
