{
	"add": {
		"doc": {
			"id": "9d6c1da4b31b15fb6fea74199c1f06b310829907d5babc20d53dfef67d6e05af",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Cat_and_guinea_pigs.jpg/220px-Cat_and_guinea_pigs.jpg",
				"previous": "Domesticated guinea pigs thrive in groups of two or more; groups of sows, or groups of one or more sows and a neutered boar are common combinations. Guinea pigs learn to recognize and bond with other individual guinea pigs, and testing of boars shows their neuroendocrine stress response is significantly lowered in the presence of a bonded female when compared to the presence of unfamiliar females.[43] Groups of boars may also get along, provided their cage has enough space, they are introduced at an early age, and no females are present.[44] Domestic guinea pigs have developed a different biological rhythm from their wild counterparts, and have longer periods of activity followed by short periods of sleep in between.[42] Activity is scattered randomly over the day; aside from avoidance of intense light, no regular circadian patterns are apparent.[42]",
				"after": "Domestic guinea pigs generally live in cages, although some owners of large numbers of guinea pigs dedicate entire rooms to their pets. Cages with solid or wire mesh floors are used, although wire mesh floors can cause injury and may be associated with an infection commonly known as bumblefoot (ulcerative pododermatitis).[45] \"Cubes and Coroplast\" (or C&C) style cages are now a common choice.[46] Cages are often lined with wood shavings or a similar material. Bedding made from red cedar (Eastern or Western) and pine, both softwoods, were commonly used in the past, but these materials are now believed to contain harmful phenols (aromatic hydrocarbons) and oils.[47] Safer beddings made from hardwoods (such as aspen), paper products, and corn cob materials are other alternatives.[47] Guinea pigs tend to be messy within their cages; they often jump into their food bowls or kick bedding and feces into them, and their urine sometimes crystallizes on cage surfaces, making it difficult to remove.[48] After its cage has been cleaned, a guinea pig typically urinates and drags its lower body across the floor of the cage to mark its territory.[49] Male guinea pigs may also mark their territory in this way when they are taken out of their cages.",
			"color": "burly|0.32729 wood|0.32729 tan|0.23439 wheat|0.04339 navajo|0.033363 white|0.033363 peach|0.024769 puff|0.024769 antique|0.020542 white|0.020542 linen|0.018414 bisque|0.017276 moccasin|0.017191 light|0.016829 gray|0.016829 light|0.016829 grey|0.016829 floral|0.016169 white|0.016169 old|0.015704 lace|0.015704 sea|0.015667 shell|0.015667 gainsboro|0.015308 white|0.013169 smoke|0.013169 ivory|0.012681 peru|0.012239 silver|0.011873 mint|0.011842 cream|0.011842 dark|0.011409 gray|0.011409 dark|0.011409 grey|0.011409 beige|0.011401 blanched|0.010714 almond|0.010714 papaya|0.010125 whip|0.010125 snow|0.010013 white|0.0091757 gray|0.0088093 grey|0.0088093 honeydew|0.0075013 corn|0.0064584 silk|0.0064584  "
		}
	}
}
