{
	"add": {
		"doc": {
			"id": "9d78e6573fae88aae14dd6b45042ddad975711d1266278608cce7cdddf034fc5",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Carrie_Chapman_Catt.jpg/130px-Carrie_Chapman_Catt.jpg",
				"previous": "Briarcliff Manor was historically known for its wealthy estate-owning families, including the Rockefellers, Astors, and Macys. Many of the extended Rockefeller family lived in and around the neighboring area of Pocantico Hills, and William Rockefeller (brother of John D. Rockefeller) lived for some time at Edgehill, his house in Scarborough.[6](p83)[146] U.S. Naval Commodore Matthew C. Perry resided for years in Scarborough and was one of the founders of Saint Mary's Episcopal Church, and donated a bell he captured in Tabasco, Mexico to the church in 1847.[5](p68)[147] Captain Alexander Slidell Mackenzie also lived in Scarborough.[5](p69) Businessman William Henry Aspinwall lived in Scarborough, and was sent to England during the American Civil War to prevent the construction of Confederate ironclad warships. He was involved in the Panama Canal; Panama's second-largest city (now known as Colón) was named Aspinwall after him by emigrants from the U.S., and Aspinwall Road in Scarborough was later named after him. John Lorimer Worden, a U.S. Navy rear admiral who commanded the USS Monitor against the CSS Virginia during the Battle of Hampton Roads, was born at Rosemont in Scarborough.[6](p28)[36][148][149] Carrie Chapman Catt, a pioneer in the campaign for women's suffrage (president of the National American Woman Suffrage Association and founder of the League of Women Voters and the International Alliance of Women),[150] lived at Juniper Ledge during the 1920s.[59] Carle Cotter Conway, a resident of Linden Circle, was president of the Continental Can Company for 33 years.[6](p98)[151] Banker and businessman James Speyer lived at Waldheim, an estate in Scarborough, with his family.[37] William J. Burns was the penultimate director of the Bureau of Investigation; his successor, J. Edgar Hoover, transformed the agency into the Federal Bureau of Investigation. Burns established a private-investigation service, the William J. Burns International Detective Agency, and his family moved to Shadowbrook, a house on Scarborough Road, in 1917.[6](p117) Frank DuMond lived in the village and was the art director of Briarcliff College.[152][153] Christian Archibald Herter, a physician and pathologist, lived with his wife at the Edgehill estate; he worked at a separate laboratory building on the property.[154] William Woodward Baldwin, a lawyer and the ninth Third Assistant Secretary of State, rented The Elms (a house in the village) from 1897 to 1926. Further on, Baldwin bought property in the village and built a bungalow, and later bought a concrete house on Pleasantville Road near the Briarcliff train station.[144]",
				"after": "Marian Cruger Coffin, a landscape architect, was born in Scarborough.[155] Composer and conductor Aaron Copland, famous for Rodeo and Fanfare for the Common Man, began spending weekdays at Mary Churchill's house in Briarcliff Manor in early 1929, and had a post office box in Briarcliff Manor.[156] He spent almost a month living there before moving to nearby Bedford; his ultimate residence is in nearby Cortlandt Manor.[157][158] Brooke Astor, a philanthropist, socialite, and member of the Astor family, lived in Briarcliff Manor for much of her life.[159] Children's author C.B. Colby was on the village board, was the village's Fire Commissioner, and researched the BMSHS 1977 history. He lived on Pine Road until his death in 1977.[6](pp192, 195, 219)[55][160] Anna Roosevelt Halsted lived with Curtis Bean Dall on Sleepy Hollow Road; their children attended the Scarborough School.[6](p109) Blanchette Ferry Rockefeller, twice-president of the Museum of Modern Art, lived in the village until her death.[161] Eugene T. Booth, a nuclear physicist and Manhattan Project developer, lived in the village.[162] John Cheever lived in Scarborough, and spent most of his writing career in Westchester towns such as Briarcliff Manor and Ossining.[163] He served in the Briarcliff Manor Fire Department.[55] Coby Whitmore, a painter and magazine illustrator, lived in the village from 1945 to 1965. Pulitzer Prize-winning writer and journalist John Hersey attended public school and lived in Briarcliff Manor; he was the village's first Eagle Scout and a lifeguard at the village pool, and his mother Grace Baird Hersey was a village librarian.[6](pp137, 217)[164][165] Folk singer and songwriter Tom Glazer lived on Long Hill Road for almost 30 years.[6](p223) Mathematician Bryant Tuckerman, who helped develop the Data Encryption Standard, was a long-time village resident.[166]",
			"color": " "
		}
	}
}
