{
	"add": {
		"doc": {
			"id": "9d959adef19311175eb9a001040c2655e74d8f34ba6b6d0a68fa3cbcc754cfc2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Panneaux_koala_kangourou.jpg",
				"previous": "Since 1870, koalas have been introduced to several coastal and offshore islands, including Kangaroo Island and French Island. Their numbers have significantly increased,[153] and since the islands are not large enough to sustain such high koala numbers, overbrowsing has become a problem.[154] In the 1920s, Lewis initiated a program of large-scale relocation and rehabilitation programs to transfer koalas whose habitat had become fragmented or reduced to new regions, with the intent of eventually returning them to their former range. For example, in 1930–31, 165 koalas were translocated to Quail Island. After a period of population growth, and subsequent overbrowsing of gum trees on the island, about 1300 animals were released into mainland areas in 1944. The practice of translocating koalas became commonplace; Victorian State manager Peter Menkorst estimated that from 1923 to 2006, about 25,000 animals were translocated to more than 250 release sites across Victoria.[155] Since the 1990s, government agencies have tried to control their numbers by culling, but public and international outcry has forced the use of translocation and sterilisation instead.[156]",
				"after": "One of the biggest anthropogenic threats to the koala is habitat destruction and fragmentation. In coastal areas, the main cause of this is urbanisation, while in rural areas habitat is cleared for agriculture. Native forest trees are also taken down to be made into wood products.[157] In 2000, Australia ranked fifth in the world by deforestation rates, having cleared 564,800 hectares (1,396,000 acres).[158] The distribution of the koala has shrunk by more than 50% since European arrival, largely due to fragmentation of habitat in Queensland.[48] The koala's \"vulnerable\" status in Queensland and New South Wales means that developers in these states must consider the impacts on this species when making building applications.[143] In addition, koalas live in many protected areas.[1]",
			"color": "golden|0.67679 rod|0.67679 black|0.13259 dim|0.069468 gray|0.069468 dim|0.069468 grey|0.069468 dark|0.035648 golden|0.035648 rod|0.035648 gray|0.007194 grey|0.007194 dark|0.0066313 gray|0.0066313 dark|0.0066313 grey|0.0066313 silver|0.0050572 white|0.0047024 smoke|0.0047024 snow|0.0043931 sea|0.0043865 shell|0.0043865  "
		}
	}
}
