{
	"add": {
		"doc": {
			"id": "9d982978f6290bd79104c9aefb5ed103c2cfc84a83b4b7200a11b3d51bff9c8e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Miamihighpoint.jpg/220px-Miamihighpoint.jpg",
			"previous": [],
				"after": "The surface bedrock under the Miami area is called Miami oolite or Miami limestone. This bedrock is covered by a thin layer of soil, and is no more than 50 feet (15 m) thick. Miami limestone formed as the result of the drastic changes in sea level associated with recent glaciations or ice ages. Beginning some 130,000 years ago the Sangamonian Stage raised sea levels to approximately 25 feet (7.6 m) above the current level. All of southern Florida was covered by a shallow sea. Several parallel lines of reef formed along the edge of the submerged Florida plateau, stretching from the present Miami area to what is now the Dry Tortugas. The area behind this reef line was in effect a large lagoon, and the Miami limestone formed throughout the area from the deposition of oolites and the shells of bryozoans. Starting about 100,000 years ago the Wisconsin glaciation began lowering sea levels, exposing the floor of the lagoon. By 15,000 years ago, the sea level had dropped to 300 to 350 feet (110 m) below the contemporary level. The sea level rose quickly after that, stabilizing at the current level about 4000 years ago, leaving the mainland of South Florida just above sea level.",
			"color": "silver|0.15833 light|0.1567 gray|0.1567 light|0.1567 grey|0.1567 gainsboro|0.13631 dark|0.10126 gray|0.10126 dark|0.10126 grey|0.10126 dim|0.069013 gray|0.069013 dim|0.069013 grey|0.069013 gray|0.048276 grey|0.048276 slate|0.037683 gray|0.037683 white|0.034297 smoke|0.034297 light|0.03395 slate|0.03395 gray|0.03395 black|0.033637 linen|0.025937 dark|0.020329 slate|0.020329 gray|0.020329 sea|0.018871 shell|0.018871 snow|0.015831 alice|0.014294 blue|0.014294 ghost|0.014005 white|0.014005 lavender|0.011162 blush|0.011162 floral|0.011155 white|0.011155 white|0.010069 dark|0.0091502 olive|0.0091502 green|0.0091502 mint|0.0089032 cream|0.0089032 light|0.0073832 steel|0.0073832 blue|0.0073832 azure|0.0047009 old|0.0039147 lace|0.0039147  "
		}
	}
}
