{
	"add": {
		"doc": {
			"id": "9d99a5132656bbeb65380b29847eaba34a48c2c31b34ea78ed40b2434db86d91",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/A_toll_bar_in_Roumania%2C_1877.jpg/220px-A_toll_bar_in_Roumania%2C_1877.jpg",
				"previous": "Many modern European roads were originally constructed as toll roads in order to recoup the costs of construction, maintenance and as a source of tax money that is paid primarily by someone other than the local residents. In 14th-century England, some of the most heavily used roads were repaired with money raised from tolls by pavage grants. Widespread toll roads sometimes restricted traffic so much, by their high tolls, that they interfered with trade and cheap transportation needed to alleviate local famines or shortages.[3]",
				"after": "Turnpike trusts were established in England and Wales from about 1706 in response to the need for better roads than the few and poorly-maintained tracks then available. Turnpike trusts were set up by individual Acts of Parliament, with powers to collect road tolls to repay loans for building, improving, and maintaining the principal roads in Britain. At their peak, in the 1830s, over 1,000 trusts[4] administered around 30,000 miles (48,000 km) of turnpike road in England and Wales, taking tolls at almost 8,000 toll-gates.[5] The trusts were ultimately responsible for the maintenance and improvement of most of the main roads in England and Wales, which were used to distribute agricultural and industrial goods economically. The tolls were a source of revenue for road building and maintenance, paid for by road users and not from general taxation. The turnpike trusts were gradually abolished from the 1870s. Most trusts improved existing roads, but some new roads, usually only short stretches, were also built. Thomas Telford's Holyhead road followed Watling Street from London but was exceptional in creating a largely new route beyond Shrewsbury, and especially beyond Llangollen. Built in the early 19th century, with many toll booths along its length, most of it is now the A5. In the modern day, one major toll road is the M6 Toll, relieving traffic congestion on the M6 in Birmingham.",
			"color": " "
		}
	}
}
