{
	"add": {
		"doc": {
			"id": "9da72ec2f2c7860c4e6eea06a44d42a55c21b51fbc0395ea9a3a68f8166a949d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Chess.svg/75px-Chess.svg.png",
			"previous": [],
				"after": "A strategy game is a game in which the player's decision-making influences the outcome significantly. They are usually board games, computer or video games, card games, or another type of game. Several games include strategy extensively, while others to a lesser degree, complicating demarcation. It is sometimes more accurate to say that some games have strategic elements, rather than being a strategy game; however, this depends on the game. The deciding factor separating strategy game from other genres is that there is either no or relatively less chance involved. Usually, the only physical element is the interaction with the game pieces, although there are exceptions. Players have similar starting positions or sitiuations, but use strategy to gain advantages over others. Strategy, as well as tactics, is dissimilar to luck in that chance-based games rely more heavily on probability. The word \"strategy\" is used by the military, and refers to high-level planning. Strategy games often deal with small-scale situations. Tactical games, a type of strategy game, deal with military planning, though also on a smaller scale than the military.",
			"color": "light|0.19453 gray|0.19453 light|0.19453 grey|0.19453 gainsboro|0.16718 linen|0.069199 white|0.059034 smoke|0.059034 sea|0.040139 shell|0.040139 golden|0.038581 rod|0.038581 snow|0.034634 dark|0.03401 golden|0.03401 rod|0.03401 tan|0.033805 ghost|0.032738 white|0.032738 alice|0.030697 blue|0.030697 lavender|0.030409 blush|0.030409 white|0.027917 silver|0.024266 floral|0.023895 white|0.023895 mint|0.023383 cream|0.023383 dark|0.020205 gray|0.020205 dark|0.020205 grey|0.020205 antique|0.017447 white|0.017447 azure|0.011872 burly|0.010587 wood|0.010587 forest|0.010293 green|0.010293 old|0.0099275 lace|0.0099275 black|0.007314 rosy|0.0062626 brown|0.0062626 gray|0.0045255 grey|0.0045255 green|0.0043274 olive|0.0041827  "
		}
	}
}
