{
	"add": {
		"doc": {
			"id": "9dc97ba89dd9439af5db50a1ce4b3b968bbc5e45a6261e47e2750e81f0e6b36c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/2013._%D0%94%D0%BE%D0%BD%D0%B5%D1%86%D0%BA_336.jpg/220px-2013._%D0%94%D0%BE%D0%BD%D0%B5%D1%86%D0%BA_336.jpg",
				"previous": "Educational psychology is the study of how humans learn in educational settings, the effectiveness of educational interventions, the psychology of teaching, and the social psychology of schools as organizations. Although the terms \"educational psychology\" and \"school psychology\" are often used interchangeably, researchers and theorists are likely to be identified as educational psychologists, whereas practitioners in schools or school-related settings are identified as school psychologists. Educational psychology is concerned with the processes of educational attainment in the general population and in sub-populations such as gifted children and those with specific disabilities.",
				"after": "Educational psychology can in part be understood through its relationship with other disciplines. It is informed primarily by psychology, bearing a relationship to that discipline analogous to the relationship between medicine and biology. Educational psychology in turn informs a wide range of specialties within educational studies, including instructional design, educational technology, curriculum development, organizational learning, special education and classroom management. Educational psychology both draws from and contributes to cognitive science and the learning sciences. In universities, departments of educational psychology are usually housed within faculties of education, possibly accounting for the lack of representation of educational psychology content in introductory psychology textbooks (Lucas, Blazek, & Raley, 2006).",
			"color": "black|0.14195 dark|0.075749 gray|0.075749 dark|0.075749 grey|0.075749 dim|0.071848 gray|0.071848 dim|0.071848 grey|0.071848 gray|0.069449 grey|0.069449 rosy|0.064972 brown|0.064972 silver|0.059956 tan|0.058074 light|0.045235 gray|0.045235 light|0.045235 grey|0.045235 gainsboro|0.035732 lavender|0.035706 ghost|0.017187 white|0.017187 lavender|0.016794 blush|0.016794 indian|0.016763 red|0.016763 white|0.016444 smoke|0.016444 alice|0.016196 blue|0.016196 burly|0.015093 wood|0.015093 slate|0.013814 gray|0.013814 light|0.013741 slate|0.013741 gray|0.013741 thistle|0.013095 snow|0.012876 light|0.011264 steel|0.011264 blue|0.011264 white|0.010781 light|0.010718 coral|0.010718 sea|0.01025 shell|0.01025  "
		}
	}
}
