{
	"add": {
		"doc": {
			"id": "9dcc4e452be833b331fa3b7666aae8dd2096c66c54d7e3056a741b09e91d4a3a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Prado_-_Los_Desastres_de_la_Guerra_-_No._44_-_Yo_lo_vi.jpg/220px-Prado_-_Los_Desastres_de_la_Guerra_-_No._44_-_Yo_lo_vi.jpg",
				"previous": "Many of Goya's preparatory drawings, mostly in red chalk, have survived and are numbered differently from the published prints.[43] He produced two albums of proofs—among many individual proof impressions—of which only one is complete.[a 6] The full album consists of 85 works, including three small Prisioneros (\"Prisoners\") made in 1811 which are not part of the series. Goya gave the copy of the full album, now in the British Museum, to his friend Juan Agustín Ceán Bermúdez. It contains a title-page inscription in Goya's hand, is signed at the page edges, and has numbers and titles to the prints written by Goya. These were copied on the plates when the published edition was prepared in 1863. By then, 80 had passed from Goya's son, Javier—who had stored them in Madrid after his father left Spain—to the Real Academia de Bellas Artes de San Fernando (Royal Academy of Fine Arts of San Fernando), of which Goya had been director. Numbers 81 and 82 rejoined the others in the Academy in 1870, and were not published until 1957.[44]",
				"after": "As the series progressed, Goya evidently began to experience shortages of good quality paper and copper plates, and was forced to take what art historian Juliet Wilson-Bareau calls the \"drastic step\" of destroying two depicting landscapes, from which very few impressions had been printed. These were cut in half to produce four of The Disasters of War‍ '​s prints.[46] Partly because of the material shortages, the sizes and shapes of the plates vary somewhat, ranging from as small as 142 × 168 mm (5.6 × 6.6 in) to as large as 163 × 260 mm (6.4 × 10.2 in).[a 7]",
			"color": "dark|0.33742 gray|0.33742 dark|0.33742 grey|0.33742 silver|0.33129  "
		}
	}
}
