{
	"add": {
		"doc": {
			"id": "9dd329291a566b2824f8be06706cdd75955ec8125ade8288d0567e68c70d40df",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Common_clownfish.jpg/250px-Common_clownfish.jpg",
				"previous": "A merging draft, BioCode, was published in 1997 in an attempt to standardize nomenclature in these three areas, but has yet to be formally adopted.[65] The BioCode draft has received little attention since 1997; its originally planned implementation date of January 1, 2000, has passed unnoticed. A revised BioCode that, instead of replacing the existing codes, would provide a unified context for them, was proposed in 2011.[66][67][68] However, the International Botanical Congress of 2011 declined to consider the BioCode proposal. The ICVCN remains outside the BioCode, which does not include viral classification.",
				"after": "Ecology studies the distribution and abundance of living organisms, and the interactions between organisms and their environment.[69] The habitat of an organism can be described as the local abiotic factors such as climate and ecology, in addition to the other organisms and biotic factors that share its environment.[70] One reason that biological systems can be difficult to study is that so many different interactions with other organisms and the environment are possible, even on small scales. A microscopic bacterium in a local sugar gradient is responding to its environment as much as a lion searching for food in the African savanna. For any species, behaviors can be co-operative, competitive, parasitic, or symbiotic. Matters become more complex when two or more species interact in an ecosystem.",
			"color": "dark|0.15415 slate|0.15415 gray|0.15415 orange|0.11483 gold|0.077077 teal|0.046296 cadet|0.044482 blue|0.044482 dark|0.039821 cyan|0.039821 steel|0.039414 blue|0.039414 light|0.035629 sea|0.035629 green|0.035629 yellow|0.028091 medium|0.026704 aqua|0.026704 marine|0.026704 medium|0.023106 turquoise|0.023106 black|0.022147 dim|0.016444 gray|0.016444 dim|0.016444 grey|0.016444 dark|0.016204 olive|0.016204 green|0.016204 golden|0.015453 rod|0.015453 sea|0.015297 green|0.015297 dark|0.014619 turquoise|0.014619 turquoise|0.013399 deep|0.013076 sky|0.013076 blue|0.013076 white|0.01205 smoke|0.01205 mint|0.011599 cream|0.011599 white|0.01138 snow|0.011043 alice|0.010075 blue|0.010075 floral|0.010059 white|0.010059 ghost|0.0098807 white|0.0098807 sea|0.0095806 shell|0.0095806 azure|0.0094594 slate|0.0091967 gray|0.0091967  "
		}
	}
}
