{
	"add": {
		"doc": {
			"id": "9dd574289922ff4a057fc007dee3c72f0990bd41032064c3f83c9089c2831126",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/B-rex_teeth.jpg/220px-B-rex_teeth.jpg",
				"previous": "When examining Sue, paleontologist Pete Larson found a broken and healed fibula and tail vertebrae, scarred facial bones and a tooth from another Tyrannosaurus embedded in a neck vertebra. If correct, these might be strong evidence for aggressive behavior between tyrannosaurs but whether it would have been competition for food and mates or active cannibalism is unclear.[136] However, further recent investigation of these purported wounds has shown that most are infections rather than injuries (or simply damage to the fossil after death) and the few injuries are too general to be indicative of intraspecific conflict.[124] Some researchers argue that if Tyrannosaurus were a scavenger, another dinosaur had to be the top predator in the Amerasian Upper Cretaceous. Top prey were the larger marginocephalians and ornithopods. The other tyrannosaurids share so many characteristics that only small dromaeosaurs and troodontids remain as feasible top predators. In this light, scavenger hypothesis adherents have suggested that the size and power of tyrannosaurs allowed them to steal kills from smaller predators,[132] although they may have had a hard time finding enough meat to scavenge, being outnumbered by smaller theropods.[137] Most paleontologists accept that Tyrannosaurus was both an active predator and a scavenger like most large carnivores.",
				"after": "Tyrannosaurus may have had infectious saliva used to kill its prey. This theory was first proposed by William Abler.[138] Abler examined the teeth of tyrannosaurids between each tooth serration; the serrations may have held pieces of carcass with bacteria, giving Tyrannosaurus a deadly, infectious bite much like the Komodo dragon was thought to have. However, Jack Horner regards Tyrannosaurus tooth serrations as more like cubes in shape than the serrations on a Komodo monitor's teeth, which are rounded.[139] All forms of saliva contain possibly hazardous bacteria, so the prospect of it being used as a method of predation is disputable.",
			"color": "dark|0.14846 gray|0.14846 dark|0.14846 grey|0.14846 gray|0.13022 grey|0.13022 silver|0.099957 dim|0.098109 gray|0.098109 dim|0.098109 grey|0.098109 light|0.069456 gray|0.069456 light|0.069456 grey|0.069456 gainsboro|0.050742 tan|0.048178 black|0.030665 white|0.024569 smoke|0.024569 sea|0.023428 shell|0.023428 linen|0.022393 snow|0.020141 floral|0.019644 white|0.019644 white|0.017122 mint|0.015767 cream|0.015767 antique|0.015685 white|0.015685 rosy|0.015259 brown|0.015259 ghost|0.015142 white|0.015142 lavender|0.014477 blush|0.014477 alice|0.013148 blue|0.013148 misty|0.013077 rose|0.013077 old|0.011725 lace|0.011725 azure|0.010925 ivory|0.0081967  "
		}
	}
}
