{
	"add": {
		"doc": {
			"id": "9dd7f82a2bb5b9e02830f19e8f87a2f7a5cbdf92c2f70ed74473a1f269f95eed",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Sendero_Luminoso_Peru.png/180px-Sendero_Luminoso_Peru.png",
				"previous": "Internal struggles after the war were followed by a period of stability under the Civilista Party, which lasted until the onset of the authoritarian regime of Augusto B. Leguía. The Great Depression caused the downfall of Leguía, renewed political turmoil, and the emergence of the American Popular Revolutionary Alliance (APRA).[34] The rivalry between this organization and a coalition of the elite and the military defined Peruvian politics for the following three decades. A final peace treaty in 1929, signed between Peru and Chile called the Treaty of Lima, returned Tacna to Peru. Between 1932 and 1933, Peru was engulfed in a year-long war with Colombia over a territorial dispute involving the Amazonas department and its capital Leticia. Later, in 1941, Peru became involved in the Ecuadorian-Peruvian War, after which the Rio Protocol sought to formalize the boundary between those two countries. In a military coup on 29 October 1948, Gen. Manuel A. Odria became president. Odría's presidency was known as the Ochenio. Momentarily pleasing the oligarchy and all others on the right, but followed a populist course that won him great favor with the poor and lower classes. A thriving economy allowed him to indulge in expensive but crowd-pleasing social policies. At the same time, however, civil rights were severely restricted and corruption was rampant throughout his régime. Odría was succeeded by Manuel Prado Ugarteche. However, widespread allegations of fraud prompted the Peruvian military to depose Prado and install a military junta, led by Ricardo Pérez Godoy. Godoy ran a short transitional government and held new elections in 1963, which were won by Fernando Belaúnde Terry who assumed presidency until 1968. Belaúnde was recognized for his commitment to the democratic process. In 1968, the Armed Forces, led by General Juan Velasco Alvarado, staged a coup against Belaúnde. Alvarado's regime undertook radical reforms aimed at fostering development, but failed to gain widespread support. In 1975, General Francisco Morales Bermúdez forcefully replaced Velasco, paralyzed reforms, and oversaw the reestablishment of democracy.",
				"after": "Peru engaged in a brief successful conflict with Ecuador in the Paquisha War as a result of territorial dispute between the two countries. After the country experienced chronic inflation, the Peruvian currency, the sol, was replaced by the Inti in mid-1985, which itself was replaced by the nuevo sol in July 1991, at which time the new sol had a cumulative value of one billion old soles. The per capita annual income of Peruvians fell to $720 (below the level of 1960) and Peru's GDP dropped 20% at which national reserves were a negative $900 million. The economic turbulence of the time acerbated social tensions in Peru and partly contributed to the rise of violent rebel rural insurgent movements, like Sendero Luminoso (Shining Path) and MRTA, which caused great havoc throughout the country. Concerned about the economy, the increasing terrorist threat from Sendero Luminoso and MRTA, and allegations of official corruption, Alberto Fujimori assumed presidency in 1990. Fujimori implemented drastic measures that caused inflation to drop from 7,650% in 1990 to 139% in 1991. Faced with opposition to his reform efforts, Fujimori dissolved Congress in the auto-golpe (\"self-coup\") of 5 April 1992. He then revised the constitution; called new congressional elections; and implemented substantial economic reform, including privatization of numerous state-owned companies, creation of an investment-friendly climate, and sound management of the economy. Fujimori's administration was dogged by insurgent groups, most notably Sendero Luminoso, which carried out terrorist campaigns across the country throughout the 1980s and 1990s. Fujimori cracked down on the insurgents and was successful in largely quelling them by the late 1990s, but the fight was marred by atrocities committed by both the Peruvian security forces and the insurgents: the Barrios Altos massacre and La Cantuta massacre by Government paramilitary groups, and the bombings of Tarata and Frecuencia Latina by Sendero Luminoso. Those incidents subsequently came to be seen as symbols of the human rights violations committed during the last years of violence.",
			"color": "chocolate|0.29654 dark|0.21104 khaki|0.21104 sienna|0.088745 khaki|0.082792 dark|0.061508 gray|0.061508 dark|0.061508 grey|0.061508 saddle|0.056277 brown|0.056277 silver|0.046898  "
		}
	}
}
