{
	"add": {
		"doc": {
			"id": "9de93c6c737c633a31934843a699eda1118279f6a712fefd63b378e0d785980b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/MaryShelleyEaston.jpg/170px-MaryShelleyEaston.jpg",
				"previous": "In 1814, Shelley spent a considerable amount of time at the Godwins' and he and Imlay may have fallen in love. Later, Claire Clairmont claimed that they had been.[50] Imlay was sent to Wales in May of that year; Todd speculates that Godwin was trying to separate her from Shelley while Seymour hints that Mrs Godwin was trying to improve her despondent mood.[51] Meanwhile, the Godwin household became even more uncomfortable as Godwin sank further into debt and as relations between Mary and her stepmother became increasingly hostile.[52] Mary Godwin consoled herself with Shelley and the two started a passionate love affair. When Shelley declared to Godwin that the two were in love, Godwin exploded in anger. However, he needed the money that Shelley, as an aristocrat, could and was willing to provide. Frustrated with the entire situation, Mary Godwin, Shelley, and Claire Clairmont ran off to Europe together on 28 June 1814.[53] Godwin hurriedly summoned Imlay home from Wales to help him handle the situation. Her stepmother wrote that Imlay's \"emotion was deep when she heard of the sad fate of the two girls; she cannot get over it\".[54] In the middle of this disaster, one of Godwin's protégés killed himself, and young William Godwin ran away from home and was missing for two days. When news of the girls' escapade became public, Godwin was pilloried in the press. Life in the Godwin household became increasingly strained.[55]",
				"after": "When Mary Godwin, Claire Clairmont, and Shelley returned from the Continent in September 1814, they took a house together in London, enraging Godwin still further. Imlay felt pulled between the two households: she felt loyal both to her sisters and to her father. Both despised her decision not to choose a side in the family drama. As Seymour explains, Imlay was in a difficult position: the Godwin household felt Shelley was a dangerous influence and the Shelley household ridiculed her fear of violating social conventions. Also, her aunts were considering her for a teaching position at this time, but were reluctant because of Godwin's shocking Memoirs of the Author of A Vindication of the Rights of Woman (1798). Seymour writes, the \"few timid visits Fanny made to see Mary and [Claire] in London were acts of great courage; she got little thanks for them\".[56] Although instructed by Godwin not to speak to Shelley and her sisters, Imlay warned them of creditors who knew of Shelley's return (he also was in debt).[57] Her attempts to persuade Clairmont to return to the Godwins' convinced Shelley that she was of Godwin's party and he began to distrust her.[58] Imlay was also still responsible for soliciting money from Shelley in order to repay her father's debts; despite Shelley's essential elopement with two of his daughters, Godwin agreed to accept £1,200 from Shelley.[59] When Mary Godwin gave birth to a daughter in February 1815, she immediately sent for Imlay, particularly as both she and the infant were ill. Godwin chastised Imlay for disobeying his orders not to see her half-sister and her misery increased. After the death of the child, Imlay paid more frequent visits to the couple.[60]",
			"color": " "
		}
	}
}
