{
	"add": {
		"doc": {
			"id": "9df1b34a0caaa87cedd19f9f0717b5e32072079275803013ba1476a1d2ccc53a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/South_end_forever_North_end_forever.jpg/170px-South_end_forever_North_end_forever.jpg",
			"previous": [],
				"after": "Gunpowder Treason Day was exported by settlers to colonies around the world, including Australia, New Zealand and Canada.[66] Although initially the commemoration was paid scant attention, the arrest of two boys caught lighting bonfires on 5 November 1662 in Boston suggests, in historian James Sharpe's view, that \"an underground tradition of commemorating the Fifth existed\".[67] In parts of North America it was known as Pope Day, celebrated mainly in colonial New England, but also as far south as Charleston. In Boston, founded in 1630 by Puritan settlers led by John Winthrop, an early celebration was held in 1685, the same year that James II assumed the throne. Fifty years later, again in Boston, a local minister wrote \"a Great number of people went over to Dorchester neck where at night they made a Great Bonfire and plaid off many fireworks\", although the day ended in tragedy when \"4 young men coming home in a Canoe were all Drowned.\" Ten years later the raucous celebrations were the cause of considerable annoyance to the upper classes and a special Riot Act was passed, to prevent \"riotous tumultuous and disorderly assemblies of more than three persons, all or any of them armed with Sticks, Clubs or any kind of weapons, or disguised with vizards, or painted or discolored faces, on in any manner disguised, having any kind of imagery or pageantry, in any street, lane, or place in Boston.\" With inadequate resources, however, Boston's authorities were powerless to enforce the Act. In the 1740s gang violence became common, with groups of Boston residents battling for the honour of burning the pope's effigy. But by the mid-1760s these riots had subsided, and as colonial America moved towards revolution, the class rivalries featured during Pope Day gave way to anti-British sentiment.[68] In author Alfred Young's view, Pope Day provided the \"scaffolding, symbolism, and leadership\" for resistance to the Stamp Act in 1764-1765, forgoing previous gang rivalries in favour of unified resistance to Britain.[69]",
			"color": " "
		}
	}
}
