{
	"add": {
		"doc": {
			"id": "9df2c0643628b806b5f1aabbab7726688425f6c843633c4623f3a932eeb13d26",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Wall_of_Heroes_2.JPG/220px-Wall_of_Heroes_2.JPG",
				"previous": "In 1898 a friend of Watts suggested to Henry Gamble, Vicar of St Botolph's Aldersgate, that should the church manage to purchase the land owned by the CPF it would make a suitable site for Watts's memorial. Watts was approached, and agreed to the suggestion.[38][n 10] On 13 October 1898 the appeal was relaunched, with the proposal that if the remaining £3,000 were raised, Watts would design and build a covered way, which in due course would be lined with memorial tablets to commemorate the bravery of ordinary people.[47] Watts planned to build a covered way around three sides of a quadrangle, with the roof supported on stone or timber columns.[46]",
				"after": "The MPGA were not consulted about the proposal, and the following week Lord Meath wrote to The Times and the City Press to complain about the scheme. He argued that the MPGA had devoted large amounts of time and money to prevent the park from being built on, and that while Watts's proposal was \"worthy of all encouragement and support\", Postman's Park, at less than one acre (0.4 ha) and surrounded by tall buildings, was an inappropriate site.[38] The three-sided design was abandoned, in favour of a 50-foot (15 m) long and 9-foot (2.7 m) tall wooden loggia with a tiled roof, designed by Ernest George. The supporting wall contained space for 120 memorial tablets.[46] St Botolph's Aldersgate secured the necessary funds to complete the purchase of the CPF land, and Watts agreed to pay the £700 (about £69,000 as of 2015) construction costs himself.[36][48]",
			"color": "black|0.25538 silver|0.15372 light|0.13646 gray|0.13646 light|0.13646 grey|0.13646 gainsboro|0.10288 dark|0.090181 gray|0.090181 dark|0.090181 grey|0.090181 dim|0.047082 gray|0.047082 dim|0.047082 grey|0.047082 lavender|0.032518 light|0.028939 slate|0.028939 gray|0.028939 light|0.028574 steel|0.028574 blue|0.028574 gray|0.025954 grey|0.025954 slate|0.024287 gray|0.024287 white|0.014249 smoke|0.014249 alice|0.010472 blue|0.010472 dark|0.0094157 sea|0.0094157 green|0.0094157 ghost|0.0076544 white|0.0076544 lavender|0.0046363 blush|0.0046363  "
		}
	}
}
