{
	"add": {
		"doc": {
			"id": "9dff1983d4d5708cc41f7a6857d37d210afabdb679c2ce49006f8e7cc601720e",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Baluchitherium_osborni.jpg/170px-Baluchitherium_osborni.jpg",
				"previous": "Early discoveries of indricotheres were made through various colonial links to Asia.[2] The first known indricothere fossils were collected from Balochistan (in modern-day Pakistan) in 1846 by a soldier named Vickary, but these fragments were unidentifiable at the time.[5] The first fossils now recognised as Paraceratherium were discovered by the British geologist Guy Ellcock Pilgrim in Balochistan in 1907–1908. His material consisted of an upper jaw, lower teeth, and the back of a jaw. The fossils were collected in the Chitarwata Formation of Dera Bugti, where Pilgrim had previously been exploring. In 1908, he used the fossils as basis for a new species of the extinct rhinoceros genus Aceratherium; A. bugtiense. Aceratherium was by then a wastebasket taxon; it included several unrelated species of hornless rhinoceros, many of which have since been moved to other genera.[1][6] Fossil incisors that Pilgrim had previously assigned to the unrelated genus Bugtitherium were later shown to belong to the new species.[7]",
				"after": "In 1910, more partial fossils were discovered in Dera Bugti during an expedition by the British palaeontologist Clive Forster-Cooper. Based on these remains, Foster-Cooper moved A. bugtiense to the new genus Paraceratherium, meaning \"near the hornless beast\", in reference to Aceratherium.[1][8] His rationale for this reclassification was the species' distinctly down-turned lower tusks.[7] In 1913, Forster-Cooper named a new genus and species, Thaumastotherium (\"wonderful beast\") osborni, based on larger fossils from the same excavations, but he renamed the genus Baluchitherium later that year because the former name was preoccupied, as it had already been used for a hemipteran insect.[9][10] The fossils of Baluchitherium were so fragmentary that Foster-Cooper was only able to identify it as a kind of odd-toed ungulate, but he mentioned the possibility of confusion with Paraceratherium.[11] The American palaeontologist Henry Fairfield Osborn, which B. osborni was named after, suggested it may had been a titanothere.[2]",
			"color": "light|0.1471 gray|0.1471 light|0.1471 grey|0.1471 silver|0.14687 dark|0.14443 gray|0.14443 dark|0.14443 grey|0.14443 gainsboro|0.12315 gray|0.069769 grey|0.069769 linen|0.053631 dim|0.042998 gray|0.042998 dim|0.042998 grey|0.042998 sea|0.036759 shell|0.036759 white|0.036376 smoke|0.036376 antique|0.034905 white|0.034905 misty|0.028713 rose|0.028713 old|0.028478 lace|0.028478 floral|0.024884 white|0.024884 lavender|0.023765 blush|0.023765 snow|0.019603 white|0.0062867 ghost|0.0061401 white|0.0061401 slate|0.0049106 gray|0.0049106 mint|0.0040819 cream|0.0040819 ivory|0.0033987 light|0.0030688 slate|0.0030688 gray|0.0030688  "
		}
	}
}
