{
	"add": {
		"doc": {
			"id": "9e02676719303e94c0dd109475000c7078fc7c6470a50d39e78130c52c4d93a7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Indricotherium_transouralicum_hind_foot.jpg/170px-Indricotherium_transouralicum_hind_foot.jpg",
				"previous": "No complete set of vertebrae and ribs of Paraceratherium have yet been found and the tail is completely unknown. The atlas and axis vertebrae of the neck are wider than in most modern rhinoceroses, with space for strong ligaments and muscles that would be needed to hold up the large head. The rest of the vertebrae were also very wide, and had large zygapophyses with much room for muscles, tendons, ligaments, and nerves, to support the head, neck, and spine. The neural spines were long and formed a long \"hump\" along the back, where neck muscles and nuchal ligaments for holding up the skull were attached. The ribs were similar to those of modern rhinoceroses, but the ribcage would have looked smaller in proportion to the long legs and large bodies, because modern rhinoceroses are comparatively short-limbed. The last vertebra of the lower back was fused to the sacrum, a feature found in advanced rhinoceroses.[4] Like sauropod dinosaurs, Paraceratherium had pleurocoel-like openings (hollow parts of the bone) in their pre-sacral vertebrae, which may have helped to lighten the skeleton.[32]",
				"after": "The limbs were large and robust to support the animal's large weight, and were in some ways similar to and convergent with those of elephants and sauropod dinosaurs with their likewise graviportal (heavy and slow moving) builds. Unlike such animals, which tend to lengthen the upper limb bones while shortening, fusing and compressing the lower limb, hand, and foot bones, Paraceratherium had short upper limb bones and long hand and foot bones—except for the disc-shaped phalanges—similar to the running rhinoceroses from which they descended. Some foot bones were almost 50 centimetres (20 in) long. The thigh bones typically measured 1.5 m (5 ft), a size only exceeded by those of some elephants and dinosaurs. The thigh bones were pillar-like and much thicker and more robust than those of other rhinoceroses, and the three trochanters on the sides were much reduced, as this robustness diminished their importance. The limbs were held in a column-like posture instead of bent, as in smaller animals, which reduced the need for large limb muscles.[4] The front limbs had three toes.[33]",
			"color": "tan|0.33665 burly|0.1539 wood|0.1539 wheat|0.084201 antique|0.044093 white|0.044093 beige|0.038564 linen|0.026432 old|0.025963 lace|0.025963 bisque|0.02366 gainsboro|0.02245 moccasin|0.022289 light|0.022148 gray|0.022148 light|0.022148 grey|0.022148 black|0.021796 blanched|0.021753 almond|0.021753 papaya|0.018738 whip|0.018738 navajo|0.015773 white|0.015773 corn|0.015483 silk|0.015483 floral|0.014198 white|0.014198 ivory|0.013354 honeydew|0.013204 sea|0.010983 shell|0.010983  "
		}
	}
}
