{
	"add": {
		"doc": {
			"id": "9e09c658f383c98681910626c0ad2a939eca4b98ef2c39af9536b04c3ce759dc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Tampa_Stadium1.jpg/220px-Tampa_Stadium1.jpg",
				"previous": "In Super Bowl XXXVII, the Buccaneers delivered one of the most dominant defensive performances in Super Bowl history. Playing against the #1 offense in the league led by league MVP Rich Gannon, the defense actually outscored the Raiders offense, allowing 2 offensive touchdowns while returning 3 interceptions for touchdowns. The defense set two records in the 48–21 blowout, one for most interceptions in a Super Bowl (5), and one for most interceptions returned for touchdowns in a Super Bowl (3). In 19 total games in 2002, the Buccaneers recorded 40 interceptions, 53 sacks, and 9 defensive touchdowns.",
			"after": [
				"Since 1998 the Buccaneers have played their home games at Raymond James Stadium in Tampa. Prior to that they played in Tampa Stadium since their establishment.",
				"In 1975, the Buccaneers built a small practice complex with offices near Tampa International Airport called One Buccaneer Place. As other NFL teams upgraded their facilities, Bucs players and coaches stepped up their complaints about the aircraft noise, cramped offices, small locker rooms and run-down condition of One Buc Place. Even then-head coach Jon Gruden has sarcastically referred to the facility as \"The Woodshed.\" For much of the team's existence, the Bucs held training camp on the University of Tampa campus, then at the expansive and better-equipped Disney's Wide World of Sports Complex near Orlando (2002—2008)."
			],
			"color": "light|0.15162 gray|0.15162 light|0.15162 grey|0.15162 gainsboro|0.14281 white|0.081994 smoke|0.081994 tan|0.070287 black|0.069207 linen|0.055701 silver|0.05441 lavender|0.04737 blush|0.04737 alice|0.042912 blue|0.042912 ghost|0.042104 white|0.042104 dim|0.031428 gray|0.031428 dim|0.031428 grey|0.031428 dark|0.030783 gray|0.030783 dark|0.030783 grey|0.030783 gray|0.026128 grey|0.026128 sea|0.024478 shell|0.024478 lavender|0.02311 snow|0.019328 wheat|0.01728 antique|0.014893 white|0.014893 bisque|0.01135 blanched|0.0067629 almond|0.0067629 old|0.0064036 lace|0.0064036  "
		}
	}
}
