{
	"add": {
		"doc": {
			"id": "9e103cb3c01970ab9c24c303c0d12d1a357ac02bc4c36c3b86ba18d28fc1f40f",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/TACA_Airbus_A319_Ramirez.jpg/220px-TACA_Airbus_A319_Ramirez.jpg",
				"previous": "Avianca and TACA completed their merger on May 21, 2013 (although TACA still operates) as had been announced. On May 20, 2013, just before midnight (12:00 AM), TACA Airlines began to remove all its signs bearing the TACA logo from airports across the US, Canada, Mexico, Central America, South America, and the Caribbean. However, most of the former TACA Airlines Airbus and Embraer jets as well as the TACA Regional jets still have the TACA logo painted on it. These aircraft are expected to be painted with the Avianca logo at a later date. The last flight with the TACA callsign took place on May 20, 2013. The flight was TACA flight 566 from Monseñor Óscar Arnulfo Romero International Airport in San Salvador to John F. Kennedy International Airport in New York, NY. It departed San Salvador at 7:50 pm MST and landed in New York at 2:35 am EST. The flight landed two hours and thirty-five minutes after the official re-branding of the airlines; thus, the flight departed with the TACA callsign and landed with the Avianca callsign. The final official TACA flight to have the TACA callsign was TACA flight 520 from San Salvador to Los Angeles International Airport in Los Angeles, CA. This flight departed at 7:20 pm MST and landed at 11:50 pm PDT. The first flight departing operated by Avianca El Salvador took place on May 21, 2013. The flight was Avianca El Salvador flight 561 from San Francisco International Airport in San Francisco, CA to San Salvador. The flight departed at 1:25 am PDT and landed at 7:55 am MST. This was followed by Avianca El Salvador flight 521 from Los Angeles to San Salvador. This flight departed at 1:30 am PDT and landed at 7:30 am MST.",
				"after": "On October 10, 2012, it was reported in a press conference that the trade name TACA Airlines was going to disappear from the public eye and the promotion and marketing strategies were going to be owned by Avianca, according to representatives of the group that controls the brand. The Avianca-Taca's CEO, Fabio Villegas, explained that the use of the single brand for the group would occur in the first half of 2013.[8] Eventually the TACA trade name wouldn't disappear from the public eye TACA will continue to operate but it will operate under the Avianca El Salvador brand and it will remain a full member of Star Alliance.",
			"color": "dim|0.12925 gray|0.12925 dim|0.12925 grey|0.12925 black|0.10752 gray|0.081149 grey|0.081149 dark|0.076357 gray|0.076357 dark|0.076357 grey|0.076357 silver|0.056058 light|0.0497 gray|0.0497 light|0.0497 grey|0.0497 white|0.046408 smoke|0.046408 gainsboro|0.044959 sea|0.043435 shell|0.043435 snow|0.041067 floral|0.039573 white|0.039573 white|0.036915 ghost|0.035511 white|0.035511 mint|0.033916 cream|0.033916 linen|0.032448 alice|0.028164 blue|0.028164 lavender|0.028007 blush|0.028007 azure|0.023949 old|0.012906 lace|0.012906 slate|0.009744 gray|0.009744  "
		}
	}
}
