{
	"add": {
		"doc": {
			"id": "9e3557465c8ca7097a325a2d960b1a4f33ff1bbcadf811a60ac5fd242990c138",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Wakkanai_Russian_sign.jpg/220px-Wakkanai_Russian_sign.jpg",
				"previous": "Bilingual interaction can even take place without the speakers switching. In certain areas, it is not uncommon for speakers each to use a different language within the same conversation. This phenomenon is found, amongst other places, in Scandinavia. Most speakers of Swedish, Norwegian and Danish can communicate with each other speaking their respective languages, while few can speak both (people used to these situations often adjust their language, avoiding words that are not found in the other language or that can be misunderstood). Using different languages is usually called non-convergent discourse, a term introduced by the Dutch linguist Reitze Jonkman. To a certain extent, this situation also exists between Dutch and Afrikaans, although everyday contact is fairly rare because of the distance between the two respective communities. The phenomenon is also found in Argentina, where Spanish and Italian are both widely spoken, even leading to cases where a child with a Spanish and an Italian parent grows up fully bilingual, with both parents speaking only their own language yet knowing the other. Another example is the former state of Czechoslovakia, where two closely related and mutually intelligible languages (Czech and Slovak) were in common use. Most Czechs and Slovaks understand both languages, although they would use only one of them (their respective mother tongue) when speaking. For example, in Czechoslovakia it was common to hear two people talking on television each speaking a different language without any difficulty understanding each other. This bilinguality still exists nowadays, although it has started to deteriorate after Czechoslovakia split up.[citation needed]",
			"after": [],
			"color": "dark|0.10419 gray|0.10419 dark|0.10419 grey|0.10419 light|0.090986 slate|0.090986 gray|0.090986 light|0.075076 gray|0.075076 light|0.075076 grey|0.075076 dim|0.074955 gray|0.074955 dim|0.074955 grey|0.074955 gray|0.071016 grey|0.071016 silver|0.067254 slate|0.066563 gray|0.066563 gainsboro|0.064807 midnight|0.054752 blue|0.054752 light|0.052902 steel|0.052902 blue|0.052902 antique|0.039012 white|0.039012 linen|0.036007 black|0.028075 old|0.020886 lace|0.020886 sea|0.017621 shell|0.017621 floral|0.012668 white|0.012668 white|0.011457 smoke|0.011457 misty|0.010463 rose|0.010463 ivory|0.0082425 snow|0.007941 beige|0.0069111 dark|0.0062479 slate|0.0062479 gray|0.0062479  "
		}
	}
}
