{
	"add": {
		"doc": {
			"id": "9e3aa2cd294c83b8c8d54530f02d2d39d80d7aa659f36695102958f8a86c58b2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Kosta_Pekyanets1916.JPG/200px-Kosta_Pekyanets1916.JPG",
			"previous": [],
				"after": "In September 1916, the Serbian high command sent Kosta Pećanac in the Toplica District to organize a guerrilla uprising.[4] There, Pećanac contacted several groups and joined forces with local leader Kosta Vojinović and they both established headquarters on Mount Kopaonik. In January – February 1917 the Bulgarians began conscripting local Serbs for military service and a rumor was spread that the Allies has reached Skopje, so the Serbs should rise in revolt. The decision for this rebellion was taken and on February 21, near the Toplica (river) the rebellion broke out. The leaders gathered several hundreds of rebels who conquered Prokuplje and Kuršumlija. Pećanac also attempted to attract Albanians on his side, but without success. On March 12, the Bulgarian counterattack started under the command of Alexander Protogerov involving comitadjis' forces of the Internal Macedonian Revolutionary Organisation led by Tane Nikolov.[5] Bulgarian and Austro-Hungarian authorities worked together. In the battles, one of the leaders of the IMRO Todor Aleksandrov, serving as an officer in the Bulgarian army, commanded the most violent actions committed by Macedono-Bulgarian para-militaries. After several days of fighting, the Bulgarians entered Prokuplje on March 14 and Austro-Hungarians the Kuršumlija. As of March 25, the order there was fully restored.[6] In the battles, several thousand people were killed, including civilians. In April 1917, Pećanac with his guerrillas, attacked a railway station.[7] On May 15, Pecanac entered the old Bulgarian border and invaded Bosilegrad, which was burned. Then his cheta withdrew to Kosovo, controlled then by the Austro-Hungarians. The Allies opened a new front at Salonika in June but the Serbian Army was unable to break through the Bulgarian lines. After reemerging again for a short time, in September – October 1917 Pećanac again disappeared. In October 1917 the Austro-Hungarian command created entirely Albanian paramilitary detachments to capture the rest of the Serbian rebels into the mountains and in December 1917, Vojnović was killed.",
			"color": " "
		}
	}
}
