{
	"add": {
		"doc": {
			"id": "9e6407452b63bf64f7ced6c17f37013260ac7877e5a95d230ed6354f19ac4ca5",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/24/Stone3.jpg/220px-Stone3.jpg",
			"previous": [],
				"after": "\"Keep It Together\" received mixed reviews from critics. Mark C. Taylor, author of Nots: Religion and Postmodernism, felt that \"Keep It Together\" was a \"striking instance of her repeated invocation of family values\". He believed that Madonna's fascination for family was reflected in the song.[10] Carol Benz, one of the authors of The Madonna Connection, believed that the song was successful in asserting the necessity of family ties.[11] J. Randy Taraborrelli, author of Madonna: An Intimate Biography described the track as \"an uptempo romp about the trials and tribulations, and the joys of having a family.\"[12] Martha Bayles, author of Hole In Our Soul, felt that \"Keep It Together\" failed to become an anthem for emotional commitment, because of the funk nature of the song.[13] Madonna, Unauthorized‍ '​s writer Christopher Anderson proclaimed the track as a worthy number-one single, and complimented the song's theme of allegiance to one's family, despite the turmoil and dissensions that occur.[14] Lucy O'Brien, author of Madonna: Like an Icon, described it as an \"upbeat meditation on sibling power\" and believed that the purpose behind the song was to present a homey image of brothers and sisters happy and together, and Madonna's need to restore bonds and relationships that had become fraught or distant in her life then.[15] Hadley Freeman from The Guardian described \"Keep It Together\" as \"amazing, purely for being Madonna's take on Sister Sledge's 'We Are Family', a concept no one foresaw, and the fact that she later disowned various members of her family gives it, shall we say, an interesting tinge of irony.\"[16]",
			"color": "black|0.45892 maroon|0.0632 dark|0.045102 red|0.045102 red|0.040489 firebrick|0.038073 tomato|0.027467 brown|0.017216 coral|0.011836 sienna|0.01167 sandy|0.0093691 brown|0.0093691 crimson|0.0087998 tan|0.0087974 dark|0.0085389 olive|0.0085389 green|0.0085389 burly|0.0076953 wood|0.0076953  "
		}
	}
}
