{
	"add": {
		"doc": {
			"id": "9e69fc2022da876b25e8c59030a1f0f10a757c62268106157f1a3fbcce0f3112",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Sailing_On_the_Charles.jpg/800px-Sailing_On_the_Charles.jpg",
			"previous": [
				"The city's water supply, from the Quabbin and Wachusett Reservoirs to the west,[76] is one of the very few in the country so pure as to satisfy federal quality standards without filtration.[77]",
				"Boston is surrounded by the \"Greater Boston\" region and is contiguously bordered by the cities and towns of Winthrop, Revere, Chelsea, Everett, Somerville, Cambridge, Newton, Brookline, Needham, Dedham, Canton, Milton, and Quincy. The Charles River separates Boston from Watertown and the majority of Cambridge, and the mass of Boston from its own Charlestown neighborhood. To the east lie Boston Harbor and the Boston Harbor Islands National Recreation Area (which includes part of the city's territory, specifically Calf Island, Gallops Island, Great Brewster Island, Green Island, Little Brewster Island, Little Calf Island, Long Island, Lovells Island, Middle Brewster Island, Nixes Mate, Outer Brewster Island, Rainsford Island, Shag Rocks, Spectacle Island, The Graves, and Thompson Island). The Neponset River forms the boundary between Boston's southern neighborhoods and the city of Quincy and the town of Milton. The Mystic River separates Charlestown from Chelsea and Everett, and Chelsea Creek and Boston Harbor separate East Boston from Boston proper.[75]"
			],
				"after": " ",
			"color": "light|0.14769 blue|0.14769 light|0.11811 sky|0.11811 blue|0.11811 slate|0.1116 gray|0.1116 sky|0.09324 blue|0.09324 light|0.087855 slate|0.087855 gray|0.087855 powder|0.079767 blue|0.079767 gainsboro|0.043369 light|0.039397 gray|0.039397 light|0.039397 grey|0.039397 light|0.027043 steel|0.027043 blue|0.027043 dim|0.023526 gray|0.023526 dim|0.023526 grey|0.023526 tan|0.023097 gray|0.016806 grey|0.016806 black|0.015612 burly|0.014858 wood|0.014858 dark|0.014782 slate|0.014782 gray|0.014782 dark|0.01431 gray|0.01431 dark|0.01431 grey|0.01431 silver|0.0098389 wheat|0.0095128 steel|0.0088629 blue|0.0088629 alice|0.0078714 blue|0.0078714  "
		}
	}
}
