{
	"add": {
		"doc": {
			"id": "9e7ca130c7173684992b2de9f68d9497209055a5c6150f909e49df3fc54d2c52",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/OldChem.jpg/170px-OldChem.jpg",
			"previous": [],
				"after": "In the 2015 U.S. News & World Report ranking of undergraduate programs at doctoral granting institutions, Duke was tied for 8th.[103] In the past twenty years, U.S. News & World Report has placed Duke as high as 3rd and as low as 10th.[104] In 2014, Duke was tied for 25th in the world by the QS World University Rankings[105] and 18th in the world by the Times Higher Education World University Rankings.[106] Duke was ranked the 14th-best university in the world by Newsweek[107] and 31st best globally by Shanghai Jiao Tong University's Academic Ranking of World Universities (ARWU) in 2014, focusing on quality of scientific research and the number of Nobel Prizes.[108] The university also ranks 22nd in the world on the alternative Academic Ranking of World Universities which excludes Nobel Prize and Fields Medal indicators.[109] The Wall Street Journal ranked Duke sixth (fifth among universities) in its \"feeder\" rankings in 2006, analyzing the percentage of undergraduates that enroll in what it considers the top five medical, law, and business schools.[110] The 2010 report by the Center for Measuring University Performance puts Duke at 6th in the nation.[28] The 2011 Global Employability Ranking as published by The New York Times surveyed hundreds of chief executives and chairmen from around the world and asked them to select the best universities from which they recruited. Duke placed 13th in the world and 9th in the country.[111][112] In 2013, Duke enrolled 139 National Merit Scholars, the 6th university in rank by number.[113] Duke ranks 5th among national universities to have produced Rhodes, Marshall, Truman, Goldwater, and Udall Scholars.[16] As of 2012, Duke graduates have received 25 Churchill Scholarships to the University of Cambridge. Only graduates of Princeton and Harvard have received more Churchill awards.[114] According to the 2011 Princeton Review‍‍ '​‍s survey on \"Top Dream Colleges\" among parents, Duke ranked as the 6th dream university.[115] Kiplinger‍ '​s 50 Best Values in Private Universities 2013–14 ranks Duke at 5th best overall after taking financial aid into consideration.[116] According to a study by Forbes, Duke ranks 11th among universities that have produced billionaires and 1st among universities in the South.[117][118] A survey by the Journal of Blacks in Higher Education in 2002 ranked Duke as the #1 university in the country in regard to the integration of African American students and faculty.[119] According to a poll of recruiters conducted by The Wall Street Journal, Duke ranks 2nd in terms of producing the best graduates who have received either a marketing or liberal arts degree. In a corporate study carried out by The New York Times, Duke's graduates were shown to be among the most valued in the world,[120] and Forbes magazine ranked Duke 7th in the world on its list of 'power factories' in 2012.[121]",
			"color": "dim|0.2953 gray|0.2953 dim|0.2953 grey|0.2953 black|0.22482 gray|0.20646 grey|0.20646 dark|0.064407 gray|0.064407 dark|0.064407 grey|0.064407 dark|0.034282 slate|0.034282 gray|0.034282 silver|0.025202 slate|0.021732 gray|0.021732 dark|0.019131 olive|0.019131 green|0.019131 light|0.012798 gray|0.012798 light|0.012798 grey|0.012798 light|0.010866 slate|0.010866 gray|0.010866 antique|0.0075609 white|0.0075609 gainsboro|0.0075118 linen|0.0064691  "
		}
	}
}
