{
	"add": {
		"doc": {
			"id": "9e7eb113c8b40ec334627c38b47a56878d82256cfc0ca9ef7e03b85c80904cf1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Tarbosaurus_Steveoc86.jpg/220px-Tarbosaurus_Steveoc86.jpg",
				"previous": "The largest known Tarbosaurus skull is more than 1.3 m (4.3 ft) long, larger than all other tyrannosaurids except Tyrannosaurus.[4] The skull was tall, like that of Tyrannosaurus, but not as wide, especially towards the rear. The unexpanded rear of the skull meant that Tarbosaurus eyes did not face directly forwards, suggesting that it lacked the binocular vision of Tyrannosaurus. Large fenestrae (openings) in the skull reduced its weight. Between 58 and 64 teeth lined its jaws, slightly more than in Tyrannosaurus but fewer than in smaller tyrannosaurids like Gorgosaurus and Alioramus. Most of its teeth were oval in cross section, although the teeth of the premaxilla at the tip of the upper jaw had a D-shaped cross section. This heterodonty is characteristic of the family. The longest teeth were in the maxilla (upper jaw bone), with crowns up to 85 millimeters (3.3 in) long. In the lower jaw, a ridge on the outer surface of the angular bone articulated with the rear of the dentary bone, creating a locking mechanism unique to Tarbosaurus and Alioramus. Other tyrannosaurids lacked this ridge and had more flexibility in the lower jaw.[5]",
				"after": "Tyrannosaurids varied little in body form, and Tarbosaurus was no exception. The head was supported by an S-shaped neck, while the rest of the vertebral column, including the long tail, was held horizontally. Tarbosaurus had tiny forelimbs, proportionably to body size the smallest of all members of the family. The hands had two clawed digits each, with an additional unclawed third metacarpal found in some specimens, similar to closely related genera. Holtz has suggested that Tarbosaurus also has a theropod reduction of fingers IV-I \"developed further\" than in other tyrannosaurids,[6] as the second metacarpal in the Tarbosaurus specimens he studied is less than twice the length of the first metacarpal (other tyrannosaurids have a second metacarpal about twice the length of the first metacarpal). Also, the third metacarpal in Tarbosaurus is proportionally shorter than in other tyrannosaurids; in other tyrannosaurids (like Albertosaurus and Daspletosaurus), the third metacarpal is often longer than the first metacarpal, while in the Tarbosaurus specimens studied by Holtz, the third metacarpal is shorter than the first.[4]",
			"color": "dark|0.28146 gray|0.28146 dark|0.28146 grey|0.28146 silver|0.24329 dim|0.13978 gray|0.13978 dim|0.13978 grey|0.13978 gray|0.13749 grey|0.13749 light|0.067373 gray|0.067373 light|0.067373 grey|0.067373 gainsboro|0.042163 white|0.012824 smoke|0.012824 lavender|0.0087161 blush|0.0087161 alice|0.0086056 blue|0.0086056 ghost|0.0085108 white|0.0085108 sea|0.0083322 shell|0.0083322 snow|0.0082164 white|0.0073699 mint|0.0065317 cream|0.0065317 floral|0.0055132 white|0.0055132 azure|0.0050227 linen|0.0045746 black|0.0042235  "
		}
	}
}
