{
	"add": {
		"doc": {
			"id": "9e855f4a1e27b87ee4a9715834cfacc375c56c319d8e8df3c766cf63877bbc8a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Priestley_Lab_V.jpg/440px-Priestley_Lab_V.jpg",
				"previous": "Under the PHMC, the museum was open ten months a year, closing between early January and early March. In 2007 and 2008 the number of visitors held steady after recent declines.[93] According to the PHMC, in fiscal 2007–08 \"total visitation ... was 1,705 with a paid visitation of 1,100 generating $4,125 in program revenue and 2,406 recreational and non-ticketed visitors\".[94] The fiscal 2006–07 operations budget for the house and its two full-time staff was $142,901, with $6,900 (five percent) coming from FJPH and the rest from the state of Pennsylvania.[94]",
				"after": "On March 4, 2009 the PHMC released a report examining its 22 museums and historic sites and recommended discontinuing operations at six, including the Joseph Priestley House. The proposed closure of the Priestley House was based on \"low visitation and limited potential for growth\".[94][95][96] Despite public meetings, protest letters, and a general \"public outcry\" against closure,[97][98] on August 14, 2009 the state closed the Priestley House and three other PHMC museums indefinitely due to a lack of funding as part of an ongoing budget crisis.[99] The sole remaining state employee at Priestley House was furloughed. That month the Friends of the Joseph Priestley House submitted a plan to the PHMC to operate the house on weekends from May to October with staffing provided by volunteers. The plan depended both on acquiring insurance for the volunteers, the house, and its contents, and on the state passing a budget.[100]",
			"color": "dim|0.30577 gray|0.30577 dim|0.30577 grey|0.30577 gray|0.27988 grey|0.27988 black|0.10779 dark|0.086165 gray|0.086165 dark|0.086165 grey|0.086165 silver|0.039502 light|0.02403 gray|0.02403 light|0.02403 grey|0.02403 gainsboro|0.018017 slate|0.013501 gray|0.013501 white|0.01224 smoke|0.01224 alice|0.010494 blue|0.010494 mint|0.010127 cream|0.010127 snow|0.0099906 azure|0.0099514 ghost|0.0099043 white|0.0099043 white|0.0095843 sea|0.0093444 shell|0.0093444 light|0.0092653 slate|0.0092653 gray|0.0092653 floral|0.0083647 white|0.0083647 lavender|0.0071434 blush|0.0071434  "
		}
	}
}
