{
	"add": {
		"doc": {
			"id": "9e8a9f0a1ff0a266925c3cfa91c877195331a76ec87f35a5feeea4abe2c0553b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Messagebox_info.svg/75px-Messagebox_info.svg.png",
				"previous": "Amongst the varied topics of study that fall within library science: how information resources are organized to serve the needs of select user groups; how people interact with classification systems and technology; how information is acquired, evaluated and applied by people in and outside of libraries as well as cross-culturally; how people are trained and educated for careers in libraries; the ethics that guide library service and organization; the legal status of libraries and information resources, and the applied science of information technology used in documentation and records management. Library science is constantly evolving, incorporating new topics like database management, information architecture and knowledge management.",
				"after": "Information science (also referred to as information studies) is an interdisciplinary science primarily concerned with the collection, classification, manipulation, storage, retrieval and dissemination of information. Information science studies the application and usage of knowledge in organizations, and the interaction between people, organizations and information systems. It is often, though not exclusively, studied as a branch of computer science or informatics and is closely related to the cognitive and social sciences.",
			"color": "midnight|0.35367 blue|0.35367 dark|0.1084 slate|0.1084 blue|0.1084 navy|0.10036 corn|0.067415 flower|0.067415 blue|0.067415 dark|0.046187 blue|0.046187 white|0.030429 snow|0.030285 ghost|0.029967 white|0.029967 white|0.029509 smoke|0.029509 mint|0.029294 cream|0.029294 floral|0.029253 white|0.029253 azure|0.029187 alice|0.028986 blue|0.028986 sea|0.028942 shell|0.028942 lavender|0.023571 blush|0.023571 light|0.01209 steel|0.01209 blue|0.01209 lavender|0.010012 ivory|0.007787  "
		}
	}
}
