{
	"add": {
		"doc": {
			"id": "9e99f97d8b86f061c929823d2d4b85fefd806f307f0f22dfe7260a7cbd697b93",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/FA-18_Hornet_breaking_sound_barrier_%287_July_1999%29.jpg/220px-FA-18_Hornet_breaking_sound_barrier_%287_July_1999%29.jpg",
				"previous": "Canted vertical stabilizers are another distinguishing design element, one among several other such elements that enable the Hornet's excellent high angle of attack ability include oversized horizontal stabilators, oversized trailing edge flaps that operate as flaperons, large full-length leading edge slats, and flight control computer programming that multiplies the movement of each control surface at low speeds and moves the vertical rudders inboard instead of simply left and right. The Hornet's normally high angle of attack performance envelope was put to rigorous testing and enhanced in the NASA F-18 High Alpha Research Vehicle (HARV). NASA used the F-18 HARV to demonstrate flight handling characteristics at high angle-of-attack (alpha) of 65–70 degrees using thrust vectoring vanes.[16] F/A-18 stabilators were also used as canards on NASA's F-15S/MTD.",
				"after": "The Hornet was among the first aircraft to heavily use multi-function displays, which at the switch of a button allow a pilot to perform either fighter or attack roles or both. This \"force multiplier\" ability gives the operational commander more flexibility to employ tactical aircraft in a fast-changing battle scenario. It was the first Navy aircraft to incorporate a digital multiplexing avionics bus, enabling easy upgrades.[8]",
			"color": "light|0.26791 steel|0.26791 blue|0.26791 light|0.13028 slate|0.13028 gray|0.13028 slate|0.10565 gray|0.10565 dark|0.039759 gray|0.039759 dark|0.039759 grey|0.039759 light|0.038969 sky|0.038969 blue|0.038969 gray|0.030059 grey|0.030059 light|0.029734 gray|0.029734 light|0.029734 grey|0.029734 white|0.027095 smoke|0.027095 gainsboro|0.026974 ghost|0.025068 white|0.025068 dim|0.024795 gray|0.024795 dim|0.024795 grey|0.024795 alice|0.023741 blue|0.023741 snow|0.023663 silver|0.02315 white|0.021833 sea|0.020747 shell|0.020747 mint|0.01958 cream|0.01958 azure|0.019437 black|0.019253 floral|0.018811 white|0.018811 lavender|0.018405 blush|0.018405 lavender|0.017846 ivory|0.0065666  "
		}
	}
}
