{
	"add": {
		"doc": {
			"id": "9ea424267d23d4c0e43883902264151f13a4f115a59329a06fb72c37e07920fb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Gulf_Air_Boeing_747-200_Gilliand.jpg/220px-Gulf_Air_Boeing_747-200_Gilliand.jpg",
				"previous": "In 1973 the governments of the Emirate (now Kingdom) of Bahrain, the State of Qatar, the Emirate of Abu Dhabi and the Sultanate of Oman agreed to purchase the BOAC Associated Companies holding in Gulf Aviation. The Foundation Treaty was signed on 1 January 1974 and gave each government a 25% shareholding in Gulf Aviation, which became a holding company. The operating company was now branded as Gulf Air and became the flag carrier for the four states.",
				"after": "With leased Lockheed L-1011 Tristar and Boeing 737 aircraft joining the fleet, by 1976 Gulf Air had expanded its route network to include Amman, Amsterdam, Athens, Baghdad, Bombay, Bangkok, Beirut, Cairo, Colombo, Delhi, Dhaka, Hong Kong, Jeddah, Karachi, Khartoum, Larnaca, Manila, Paris, Ras al-Khaimah and Sana'a. The fleet comprised four Vickers VC10, three BAC One-Elevens, two Lockheed L-1011 Tristar 200s and five Boeing 737–200s. In 1978, the airline doubled the Tristar fleet to replace the VC10s. Meanwhile, the airline increased the Boeing 737 fleet to nine and phased out the One-Elevens.",
			"color": "steel|0.20741 blue|0.20741 dim|0.15749 gray|0.15749 dim|0.15749 grey|0.15749 slate|0.091561 gray|0.091561 light|0.08487 slate|0.08487 gray|0.08487 gray|0.036114 grey|0.036114 dark|0.031672 gray|0.031672 dark|0.031672 grey|0.031672 black|0.028725 silver|0.025707 sea|0.025691 shell|0.025691 light|0.025498 gray|0.025498 light|0.025498 grey|0.025498 white|0.025245 smoke|0.025245 floral|0.024095 white|0.024095 snow|0.023021 gainsboro|0.022095 mint|0.021508 cream|0.021508 white|0.021156 linen|0.020735 ivory|0.015009 ghost|0.014679 white|0.014679 old|0.014251 lace|0.014251 azure|0.014104 alice|0.011341 blue|0.011341 lavender|0.010197 blush|0.010197 antique|0.0073749 white|0.0073749 honeydew|0.0051466  "
		}
	}
}
