{
	"add": {
		"doc": {
			"id": "9eb407548f89806276639381c8582e44827a8d50c98cc995a9f6073e4829953a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Periodic_Table_of_the_Elements_svg.svg/400px-Periodic_Table_of_the_Elements_svg.svg.png",
				"previous": "All versions of the periodic table include only chemical elements, not mixtures, compounds, or subatomic particles.[n 2] Each chemical element has a unique atomic number representing the number of protons in its nucleus. Most elements have differing numbers of neutrons among different atoms, with these variants being referred to as isotopes. For example, carbon has three naturally occurring isotopes: all of its atoms have six protons and most have six neutrons as well, but about one per cent have seven neutrons, and a very small fraction have eight neutrons. Isotopes are never separated in the periodic table; they are always grouped together under a single element. Elements with no stable isotopes have the atomic masses of their most stable isotopes, where such masses are shown, listed in parentheses.[2]",
				"after": "In the standard periodic table, the elements are listed in order of increasing atomic number (the number of protons in the nucleus of an atom). A new row (period) is started when a new electron shell has its first electron. Columns (groups) are determined by the electron configuration of the atom; elements with the same number of electrons in a particular subshell fall into the same columns (e.g. oxygen and selenium are in the same column because they both have four electrons in the outermost p-subshell). Elements with similar chemical properties generally fall into the same group in the periodic table, although in the f-block, and to some respect in the d-block, the elements in the same period tend to have similar properties, as well. Thus, it is relatively easy to predict the chemical properties of an element if one knows the properties of the elements around it.[3]",
			"color": "white|0.070355 smoke|0.070355 ghost|0.068121 white|0.068121 sea|0.068044 shell|0.068044 snow|0.068026 alice|0.067673 blue|0.067673 white|0.067092 mint|0.065086 cream|0.065086 floral|0.064642 white|0.064642 azure|0.06367 lavender|0.062518 blush|0.062518 dark|0.056552 gray|0.056552 dark|0.056552 grey|0.056552 light|0.053339 blue|0.053339 silver|0.040417 powder|0.039966 blue|0.039966 light|0.033805 gray|0.033805 light|0.033805 grey|0.033805 gainsboro|0.028732 gray|0.018805 grey|0.018805 dim|0.0092079 gray|0.0092079 dim|0.0092079 grey|0.0092079 light|0.0083563 steel|0.0083563 blue|0.0083563 rosy|0.006843 brown|0.006843 burly|0.0063511 wood|0.0063511 light|0.0061926 slate|0.0061926 gray|0.0061926 ivory|0.0056556  "
		}
	}
}
