{
	"add": {
		"doc": {
			"id": "9ed5a8b523afd552821fe7cebeb936c419d152288244d6b6bf5905f0c6c41f34",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Banco_Central_de_Bolivia.png/220px-Banco_Central_de_Bolivia.png",
			"previous": [],
				"after": "The economy of La Paz has improved greatly in recent years, mainly as a result of improved political stability. Due to the long period of high inflation and economic struggle faced by Bolivians in the 1980s and early 1990s, a large informal economy developed. Evidence of this is provided by the markets found all around the city. While there are stable markets, almost every street in the downtown area and surrounding neighborhoods has at least one vendor on it. La Paz remains the principal center of manufacturing enterprises that produce finished-product goods for the country, with about two-thirds of Bolivia's manufacturing located nearby. Historically, industry in Bolivia has been dominated by mineral processing and the preparation of agricultural products. However, in the urban centre of La Paz, small plants carry out a large portion of the industry. Food, tobacco products, clothing, various consumer goods, building materials, and agricultural tools are produced. \"The tin quotations from London are watched in La Paz with close interest as an index of the country's prosperity; a third of the national revenue and more than half of the total customs in 1925 were derived from tin; in short, that humble but indispensable metal is the hub around which Bolivia's economic life revolves. The tin deposits of Bolivia, second largest in the world, ... invite development.\"",
			"color": "dim|0.28447 gray|0.28447 dim|0.28447 grey|0.28447 gray|0.21903 grey|0.21903 dark|0.17038 gray|0.17038 dark|0.17038 grey|0.17038 silver|0.07036 slate|0.055099 gray|0.055099 black|0.054922 light|0.05485 slate|0.05485 gray|0.05485 light|0.032955 gray|0.032955 light|0.032955 grey|0.032955 gainsboro|0.022435 dark|0.014298 slate|0.014298 gray|0.014298  "
		}
	}
}
