{
	"add": {
		"doc": {
			"id": "9ed534ca516ffcfaeda6ffa90e1caa41096033c641b718e34513ac795a6d3b37",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Lord_Howe_Island_Currawong.jpg/220px-Lord_Howe_Island_Currawong.jpg",
			"previous": [],
				"after": "The pied currawong is common in both wet and dry sclerophyll forests, rural and semi-urban environments throughout eastern Australia, from Cape York Peninsula to western Victoria and Lord Howe Island, where it occurs as an endemic subspecies. In general, the pied currawong is sedentary, although some populations from higher altitudes move to areas of lower elevation in winter.[24] However, evidence for the extent of migration is conflicting, and the species' movements have been little studied to date.[27] It has adapted well to European presence, and has become more common in many areas of eastern Australia, with surveys in Nanango, Queensland, Barham, New South Wales, Geelong, Victoria, as well as the Northern Tablelands and South West Slopes regions in New South Wales, all showing an increase in population. This increase has been most marked, however, in Sydney and Canberra since the 1940s and 1960s respectively. In both cities, the species had previously been a winter resident only, but now remains year-round and breeds there.[13] They are a dominant species and common inhabitant of Sydney gardens.[28] More recently still, a survey of the population of pied currawongs in southeastern Queensland between 1980 and 2000 had found the species had become more numerous there, including suburban Brisbane.[29] One 1992 survey reported the total number of pied currawongs in Australia had doubled from 3 million birds in the 1960s to 6 million in the early 1990s.[13]",
			"color": "dim|0.25898 gray|0.25898 dim|0.25898 grey|0.25898 gray|0.13149 grey|0.13149 dark|0.11893 olive|0.11893 green|0.11893 olive|0.10887 drab|0.10887 dark|0.081262 gray|0.081262 dark|0.081262 grey|0.081262 black|0.073633 thistle|0.034403 slate|0.030035 gray|0.030035 silver|0.029223 light|0.028912 slate|0.028912 gray|0.028912 dark|0.019014 sea|0.019014 green|0.019014 lavender|0.01176 light|0.01164 gray|0.01164 light|0.01164 grey|0.01164 light|0.011087 steel|0.011087 blue|0.011087  "
		}
	}
}
