{
	"add": {
		"doc": {
			"id": "9ed7401eca63a6437529b4c350d9068480bb3740800ee109757c4f7af46c0bf0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Zh%C3%A8ng.svg/25px-Zh%C3%A8ng.svg.png",
				"previous": "One man who has encountered this problem is Taiwanese politician Yu Shyi-kun, due to the rarity of the last character in his name. Newspapers have dealt with this problem in varying ways, including using software to combine two existing, similar characters, including a picture of the personality, or, especially as is the case with Yu Shyi-kun, simply substituting a homophone for the rare character in the hope that the reader would be able to make the correct inference. Taiwanese political posters, movie posters etc. will often add the bopomofo phonetic symbols next to such a character. Japanese newspapers may render such names and words in katakana instead of kanji, and it is accepted practice for people to write names for which they are unsure of the correct kanji in katakana instead.",
				"after": "One of the most complex characters found in modern Chinese dictionaries[g] is 齉 (U+9F49) (nàng,  listen (help·info), pictured below, middle image), meaning \"snuffle\" (that is, a pronunciation marred by a blocked nose), with \"just\" thirty-six strokes. However, this is not in common use. The most complex character that can be input using the Microsoft New Phonetic IME 2002a for traditional Chinese is 龘 (dá, \"the appearance of a dragon flying\"). It is composed of the dragon radical represented three times, for a total of 16 × 3 = 48 strokes. Among the most complex characters in modern dictionaries and also in frequent modern use are 籲 (yù, \"to implore\"), with 32 strokes; 鬱 (yù, \"luxuriant, lush; gloomy\"), with 29 strokes, as in 憂鬱 (yōuyù, \"depressed\"); 豔 (yàn, \"colorful\"), with 28 strokes; and 釁 (xìn, \"quarrel\"), with 25 strokes, as in 挑釁 (tiǎoxìn, \"to pick a fight\"). Also in occasional modern use is 鱻 (xiān \"fresh\"; variant of 鮮 xiān) with 33 strokes.",
			"color": "dim|0.28387 gray|0.28387 dim|0.28387 grey|0.28387 gray|0.25437 grey|0.25437 dark|0.1696 gray|0.1696 dark|0.1696 grey|0.1696 silver|0.081913 light|0.048085 gray|0.048085 light|0.048085 grey|0.048085 gainsboro|0.036864 black|0.026568 white|0.014623 smoke|0.014623 ghost|0.01009 white|0.01009 alice|0.0099892 blue|0.0099892 snow|0.0099777 sea|0.009515 shell|0.009515 white|0.008993 lavender|0.0085248 blush|0.0085248 mint|0.0078696 cream|0.0078696 floral|0.0063396 white|0.0063396 azure|0.0059296 linen|0.0054511  "
		}
	}
}
