{
	"add": {
		"doc": {
			"id": "9eee29c4985bc47585b5886811421963034686cad02907a03a1195bc45f16ad0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Aerial_Lake_Union_July_4_2011.JPG/220px-Aerial_Lake_Union_July_4_2011.JPG",
				"previous": "The city itself is hilly, though not uniformly so.[55] Like Rome, the city is said to lie on seven hills;[56] the lists vary, but typically include Capitol Hill, First Hill, West Seattle, Beacon Hill, Queen Anne, Magnolia, and the former Denny Hill. The Wallingford, Mount Baker, and Crown Hill neighborhoods are technically located on hills as well. Many of the hilliest areas are near the city center, with Capitol Hill, First Hill, and Beacon Hill collectively constituting something of a ridge along an isthmus between Elliott Bay and Lake Washington.[57] The break in the ridge between First Hill and Beacon Hill is man-made, the result of two of the many regrading projects that reshaped the topography of the city center.[58] The topography of the city center was also changed by the construction of a seawall and the artificial Harbor Island (completed 1909) at the mouth of the city's industrial Duwamish Waterway, the terminus of the Green River. The highest point within city limits is at High Point in West Seattle, which is roughly located near 35th Ave SW and SW Myrtle St. Other notable hills include Crown Hill, View Ridge/Wedgwood/Bryant, Maple Leaf, Phinney Ridge, Mt. Baker Ridge and Highlands/Carkeek/Bitterlake.",
				"after": "North of the city center, Lake Washington Ship Canal connects Puget Sound to Lake Washington. It incorporates four natural bodies of water: Lake Union, Salmon Bay, Portage Bay and Union Bay.",
			"color": "dim|0.19746 gray|0.19746 dim|0.19746 grey|0.19746 gray|0.1527 grey|0.1527 dark|0.14841 gray|0.14841 dark|0.14841 grey|0.14841 black|0.099348 slate|0.077357 gray|0.077357 light|0.071219 slate|0.071219 gray|0.071219 silver|0.065793 dark|0.05423 slate|0.05423 gray|0.05423 light|0.037043 gray|0.037043 light|0.037043 grey|0.037043 gainsboro|0.026131 light|0.016242 steel|0.016242 blue|0.016242 white|0.0061581 smoke|0.0061581  "
		}
	}
}
