{
	"add": {
		"doc": {
			"id": "9ef949898a8970d7ada8ba0e2fb441ea3d44a29197ff4faf258f44828b345a15",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Daniel_Boone_protects_his_family.jpg/220px-Daniel_Boone_protects_his_family.jpg",
				"previous": "Existing simultaneously with the image of Boone as a refugee from society was, paradoxically, the popular portrayal of him as civilization's trailblazer. Boone was celebrated as an agent of Manifest Destiny, a pathfinder who tamed the wilderness, paving the way for the extension of American civilization. In 1852, critic Henry Tuckerman dubbed Boone \"the Columbus of the woods\", comparing Boone's passage through the Cumberland Gap to Christopher Columbus's voyage to the New World. In popular mythology, Boone became the first to explore and settle Kentucky, opening the way for countless others to follow. In fact, other Americans had explored and settled Kentucky before Boone, as debunkers in the 20th century often pointed out, but Boone came to symbolize them all, making him what historian Michael Lofaro called \"the founding father of westward expansion\".[43]",
				"after": "In the 19th century, when Native Americans were being displaced from their lands and confined on reservations, Boone's image was often reshaped into the stereotype of the belligerent, Indian-hating frontiersman which was then popular. In John A. McClung's Sketches of Western Adventure (1832), for example, Boone was portrayed as longing for the \"thrilling excitement of savage warfare.\" Boone was transformed in the popular imagination into someone who regarded Indians with contempt and had killed scores of the \"savages\". The real Boone disliked bloodshed, however. According to historian John Bakeless, there is no record that Boone ever scalped Indians, unlike other frontiersmen of the era. Boone once told his son Nathan that he was certain of having killed only one Indian, during the battle at Blue Licks, although he believed others might have died from his bullets in other battles. Even though Boone had lost two sons in wars with Indians, he respected Indians and was respected by them. In Missouri, Boone often went hunting with the very Shawnees who had captured and adopted him decades earlier. Some 19th-century writers regarded Boone's sympathy for Indians as a character flaw and therefore altered his words to conform to contemporary attitudes.[44]",
			"color": "tan|0.29365 burly|0.17535 wood|0.17535 dark|0.10354 khaki|0.10354 dark|0.076842 olive|0.076842 green|0.076842 gray|0.049067 grey|0.049067 wheat|0.047891 dark|0.032129 sea|0.032129 green|0.032129 dim|0.030286 gray|0.030286 dim|0.030286 grey|0.030286 dark|0.017304 gray|0.017304 dark|0.017304 grey|0.017304 peach|0.016749 puff|0.016749 navajo|0.015867 white|0.015867 rosy|0.01554 brown|0.01554  "
		}
	}
}
