{
	"add": {
		"doc": {
			"id": "9f0e19da662ecb20951a3e05423ebc38182b09d75eb221f97ac1e267959d2da8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Ratusz_warszawski_01.jpg/220px-Ratusz_warszawski_01.jpg",
				"previous": "The municipal government existed in Warsaw until World War II and was restored in 1990 (during the communist times, the National City Council – Miejska Rada Narodowa – governed in Warsaw). Since 1990, the system of city administration has been changed several times – also as the result of the reform which restored powiats, cancelled in 1975. Finally, according the Warsaw Act, the city is divided into 18 districts and forms one city powiat with a unified municipal government.[88]",
				"after": "The basic unit of territorial division in Poland is a commune (gmina).[89] A city is also a commune – but with the city charter.[89] Both cities and communes are governed by a mayor – but in the communes the mayor is vogt (wójt in Polish), however in the cities – burmistrz. Some bigger cities obtain the entitlements, i.e. tasks and privileges, which are possessed by the units of the second level of the territorial division – counties or powiats. An example of such entitlement is a car registration: a gmina cannot register cars, this is a powiat's task (i.e. a registration number depends on what powiat a car had been registered, not gmina). In this case we say about city county or powiat grodzki. Such cities are for example Lublin, Kraków, Gdańsk, Poznań. In Warsaw, its districts additionally have some of powiat's entitlements – like already mentioned car registration. For example, the district Wola has its own evidence and the district Ursynów – its own (and the cars from Wola have another type of registration number than these from Ursynów). But for instance the districts in Kraków do not have entitlements of powiat, so the registration numbers in Kraków are of the same type for all districts.",
			"color": "dim|0.39032 gray|0.39032 dim|0.39032 grey|0.39032 gray|0.23953 grey|0.23953 dark|0.11401 gray|0.11401 dark|0.11401 grey|0.11401 silver|0.062601 light|0.029313 gray|0.029313 light|0.029313 grey|0.029313 slate|0.018927 gray|0.018927 gainsboro|0.017228 light|0.015052 slate|0.015052 gray|0.015052 black|0.0095646 antique|0.0086109 white|0.0086109 beige|0.0075955 linen|0.0073533 old|0.0061579 lace|0.0061579 floral|0.0058858 white|0.0058858 white|0.0057226 smoke|0.0057226 sea|0.0055439 shell|0.0055439 ivory|0.004767 mint|0.0045346 cream|0.0045346 honeydew|0.0043346  "
		}
	}
}
