{
	"add": {
		"doc": {
			"id": "9f1471c378c9f3fa5612bdd7decb51a1a31d0e29419ba5564a79b500ae94b6d2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Ciseri%2C_Antonio_-_Das_Martyrium_der_sieben_Makkab%C3%A4er_-_1863.jpg/170px-Ciseri%2C_Antonio_-_Das_Martyrium_der_sieben_Makkab%C3%A4er_-_1863.jpg",
				"previous": "Following Alexander the Great's death in 323 BCE, Judea was contested between the Ptolemaic Kingdom in Egypt, and the Seleucid Empire based in Syria and Mesopotamia. Seleucid Emperor Antiochus III's victory over Egypt in the Battle of Panium brought Judea under Seleucid control. The Jewish population of Jerusalem had aided Antiochus during his siege of the Baris, the fortified base of Jerusalem's Egyptian garrison.[1] Their support was rewarded with a charter affirming Jewish religious autonomy, including barring foreigners and impure animals from the Temple's precincts, and an allocation of official funds for the maintenance of certain religious rituals in the Temple.[2] Despite being allowed religious freedom, many Jews were enticed by and adopted elements of the prestigious and influential Greek lifestyle. The imperial culture offered a route to political and material advancement, and this led to the formation of Hellenistic elites among the Jewish population. Hellenization produced tensions between observant Jews and their brethren who had assimilated Greek culture.[3]",
				"after": "Antiochus IV Epiphanes ascended the Seleucid throne in 175 BCE. Shortly afterward, the Emperor was petitioned by Jason for appointment to the position of High Priest of Israel—an office occupied by his brother Onias III. Jason, himself thoroughly Hellenized, furthermore promised to increase the tribute paid by the city and to establish within it the infrastructure of a Greek Polis, including a gymnasium and an ephebion.[4] Jason's petition was granted, yet after a three-year rule he was ousted by Antiochus and forced to flee to Ammon.[5][6] In the meantime, Antiochus IV had launched two invasions of Egypt, in 170 BCE and again in 169 BCE, and routed the Ptolemaic armies.[7][8][9] Antiochus' victories were short-lived. His intent to unify the Seleucid and Ptolemic kingdoms alarmed the rapidly expanding Roman state, which demanded that he withdraw his forces from Egypt.[9][10] With Antiochus engaged in Egypt, a false rumor spread in Jerusalem that he had been killed. In the ensuing uncertainty, Jason gathered a force of 1,000 followers and attempted to take Jerusalem by storm. Although the attack was repulsed, when word of the fighting reached Antiochus in Egypt, he suspected his Judean subjects of exploiting his setback as an opportunity to revolt. In 168 BCE, Antiochus IV Epiphanes marched on and sacked Jerusalem, looting the temple treasury and killing thousands of its residents.[11][12][13] Reversing his father's policy, Antiochus IV issued decrees outlawing traditional Jewish rites and persecuting observant Jews. Temple rituals were discontinued, Jewish observance of Sabbath prohibited, and circumcision outlawed.[14][15]",
			"color": "tan|0.26474 burly|0.22525 wood|0.22525 dark|0.073208 slate|0.073208 gray|0.073208 dim|0.063833 gray|0.063833 dim|0.063833 grey|0.063833 navajo|0.060432 white|0.060432 wheat|0.056522 moccasin|0.040444 black|0.033393 peach|0.017925 puff|0.017925 lemon|0.017421 chiffon|0.017421 bisque|0.017375 peru|0.015284 light|0.01457 golden|0.01457 rod|0.01457 yellow|0.01457 blanched|0.014442 almond|0.014442  "
		}
	}
}
