{
	"add": {
		"doc": {
			"id": "9f1864015297101cdab02d4aaa12bee586a201269988b928d1708068271030f3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Assay_medal_1921_reverse.jpg/170px-Assay_medal_1921_reverse.jpg",
				"previous": "Early assay medals featured on the obverse a bust of Liberty or figure of Columbia, and on the reverse a wreath surrounding the words \"annual assay\" and the year.[62] The 1870 obverse, by Longacre's successor William Barber, features Moneta surrounded by implements of the assay, such as scales and the pyx.[63] The distinctive designs for each year would sometimes be topical—the 1876 medal bears a design for the centennial of American Independence, and 1879's depicted the recently deceased Mint Director Henry Linderman. Beginning in 1880, they most often featured the president or Treasury Secretary. The medals in 1901 and from 1903 to 1909 were rectangular, a style popular at the time.[64] The 1920 reverse, by Engraver George T. Morgan, had a design which symbolized the ending of World War I; in 1921, an extra medal was struck in gold, given by the assay commissioners to outgoing President Woodrow Wilson as a mark of respect.[65]",
				"after": "The 1936 issuance was a mule of the Mint's medals for the president at the time, Franklin Roosevelt, and the first president, George Washington. Bearing the words, \"annual assay 1936\" on the edge, the medal was prepared in this manner by order of Mint Director Nellie Tayloe Ross[66] after Mint officials realized that they had forgotten to prepare a special design for an assay medal.[67] The 1950 medal illustrates a meeting of three 1792 officeholders (Secretary of the Treasury Hamilton, Secretary of State Thomas Jefferson and Chief Justice John Jay). Although they were officeholders designated by the Mint Act of 1792, no assay took place until 1797, by which time all three had left those offices.[68] There was no specially designed medal in 1954; instead, the assay commissioners, who met in Philadelphia on Lincoln's Birthday, February 12, 1954, chose to receive the Mint's standard presidential medal depicting Abraham Lincoln, with the commissioner's name on the edge.[69] The final medals, 1976 and 1977, were oval and of pewter. The 1977 medal, depicting Martha Washington, was not needed for presentation, as no public assay commissioners were appointed.[70] They were presented to various Mint and other Treasury officials, and when there was public objection, more were struck and were placed on sale for $20 at the mints and other Treasury outlets in 1978. Material was available for about 1,500 medals, and they were initially not available by mail.[71] They were still available in person, and by mail order, in 1980.[41]",
			"color": "dim|0.17796 gray|0.17796 dim|0.17796 grey|0.17796 tan|0.16602 burly|0.13278 wood|0.13278 gray|0.090537 grey|0.090537 black|0.076296 dark|0.059709 gray|0.059709 dark|0.059709 grey|0.059709 rosy|0.042455 brown|0.042455 silver|0.041955 light|0.030413 gray|0.030413 light|0.030413 grey|0.030413  "
		}
	}
}
