{
	"add": {
		"doc": {
			"id": "9f256c98a9298594be27051bf247622ff64ab173383354f9876360d0f81c6afa",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/DavidPearson2008.jpg/150px-DavidPearson2008.jpg",
			"previous": [],
				"after": "David Gene Pearson (born December 22, 1934) is a former American stock car racer from Spartanburg, South Carolina. Pearson began his NASCAR career in 1960 and ended his first season by winning the 1960 NASCAR Rookie of the Year award. He won three championships (1966, 1968, and 1969) in NASCAR's Grand National Series (now Sprint Cup Series). NASCAR described his 1974 season as an indication of his \"consistent greatness\"; that season he finished third in the season points having competed in only 19 of 30 races. At his finalist nomination for NASCAR Hall of Fame's inaugural 2010 class, NASCAR described Pearson as \"... the model of NASCAR efficiency during his career. With little exaggeration, when Pearson showed up at a race track, he won.\" Pearson ended his career in 1986, and currently holds the second position on NASCAR's all-time win list with 105 victories; as well as achieving 113 pole positions. Pearson was successful in different venues of racing; he won three times on road courses, 48 times on superspeedways, 54 time on short tracks, and had 23 dirt track wins. Pearson finished with at least one Top 10 finish in each of his 27 seasons. Pearson was nicknamed the \"Fox\" (and later the \"Silver Fox\") for his calculated approach to racing. ESPN described him as being a \"plain-spoken, humble man, and that added up to very little charisma.\" Pearson's career paralleled Richard Petty's, the winningest driver in NASCAR history. They accounted for 63 first/second place finishes. Petty said, \"Pearson could beat you on a short track, he could beat you on a superspeedway, he could beat you on a road course, he could beat you on a dirt track. It didn't hurt as bad to lose to Pearson as it did to some of the others, because I knew how good he was.\"",
			"color": "brown|0.43458 indian|0.14033 red|0.14033 salmon|0.066555 white|0.027511 smoke|0.027511 snow|0.025807 white|0.024937 mint|0.023315 cream|0.023315 ghost|0.023179 white|0.023179 sea|0.022865 shell|0.022865 floral|0.021599 white|0.021599 alice|0.021327 blue|0.021327 rosy|0.020737 brown|0.020737 azure|0.019833 dark|0.016096 salmon|0.016096 lavender|0.013764 blush|0.013764 gainsboro|0.01352 linen|0.012647 light|0.012641 gray|0.012641 light|0.012641 grey|0.012641 silver|0.0075496 ivory|0.0068107 light|0.0064545 coral|0.0064545  "
		}
	}
}
