{
	"add": {
		"doc": {
			"id": "9f4f87d59bc71624b6956c8ff56b18894a64adf6488ab2808aca81db80965cd8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Indo-European_branches_map.png/180px-Indo-European_branches_map.png",
			"previous": [],
				"after": "Chapter seven, Settlement, concerns sedentism – the transition from a nomadic lifestyle to a society which remains in one place permanently – which began to rise in the Near East at the end of the Last Glacial Maximum. It required new ways of thought and social organisation; Wade thinks that an evolutionary adaptation for less aggressiveness allowed this change, noting how the skeletons of the ancestral population were less gracile than those of today.[18] Sedentism facilitated the development of agriculture, including the cultivation and domestication of wild cereals and animals. The domestication of cattle in northern Europe and parts of Africa facilitated the spread of a genetic mutation that allowed lactose tolerance, and Wade believes this is evidence of culture and evolution interacting.[19] The following chapter, Sociality, focuses on the common dynamics of human societies, including warfare, religion, trade, and a division of roles between the sexes. Wade theorises that these institutions have an evolutionary basis, and looks at closely related primate societies – such as those of chimpanzees and bonobos – for evidence.[20] Wade goes on to suggest that cannibalism may have been more common in the human past by noting a common genetic adaptation that protects against Creutzfeldt–Jakob disease, which is associated with the consumption of brain.[21]",
			"color": "forest|0.39757 green|0.39757 green|0.31054 silver|0.053162 dark|0.045828 gray|0.045828 dark|0.045828 grey|0.045828 dark|0.03836 sea|0.03836 green|0.03836 indian|0.022156 red|0.022156 light|0.021578 gray|0.021578 light|0.021578 grey|0.021578 light|0.012307 coral|0.012307 gainsboro|0.011053 dark|0.0095611 blue|0.0095611 firebrick|0.0093883  "
		}
	}
}
