{
	"add": {
		"doc": {
			"id": "9f55adfd4f1ad35322ad38a4b76773061bfca78765e69921d8672ad754e8ffb7",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Acclamation_of_Princess_Isabel_1887.jpg/250px-Acclamation_of_Princess_Isabel_1887.jpg",
				"previous": "Upon gaining independence from Portugal in 1822, the Brazilian nation as a whole was almost entirely in favor of a monarchical form of government.[1] There were a variety of reasons for this political choice. There was fear among various social groups of the possibility that Brazil would fall into the same political, social, and economic chaos experienced by most of the former Spanish American colonies: territorial dismemberment, coups, dictatorships and the rise of caudillos. The perceived necessity was for a political structure that would permit the Brazilian people not merely to enjoy the advantages of liberty, but also that would guarantee the country's stability, in conformance with the liberalism of the time. Only a neutral entity, completely independent of parties, groups or opposing ideologies, could achieve this end. And there was \"always a powerful ideological element remaining from independence as the result of a great national union over particular interests.\"[2] The Brazilian monarchy was \"a form of government that assured a Brazil that would include the whole of the old Portuguese dominion, in a climate of order, peace, and freedom.\"[3]",
				"after": "There was also another reason for adoption of the monarchy, or more precisely, its maintenance. The Europeans, as much as the Africans and the native Americans, came from monarchical societies. To remain under this form of government was a way of maintaining the traditions and identity of the Brazilian people, a people descended from those three distinct ethnic groups. The choice of a member of the House of Braganza came not just from the historical moment, but also from the fact that Prince Pedro descended from the pure male line of the Portuguese kings. The House of Braganza originated with Afonso, 1st Duke of Braganza, an illegitimate son of John I of the House of Aviz who, in turn, was the son of Peter I of the House of Burgundy, which was founded 300 years earlier in 1143 by Afonso Henriques, first king of Portugal. Thus, the strong popular appeal of the monarchy, and a tradition of more than three hundred years (or seven hundred if Portuguese history is considered), enabled Prince Pedro to take on the role of a symbol of national unity.[4] The monarchical regime maintained on Brazilian soil \"was a force of continuity and tradition\".[5]",
			"color": "dim|0.074965 gray|0.074965 dim|0.074965 grey|0.074965 gray|0.068972 grey|0.068972 dark|0.064715 gray|0.064715 dark|0.064715 grey|0.064715 silver|0.059648 light|0.051044 gray|0.051044 light|0.051044 grey|0.051044 antique|0.048269 white|0.048269 floral|0.045634 white|0.045634 linen|0.043958 sea|0.043227 shell|0.043227 rosy|0.042912 brown|0.042912 white|0.037136 smoke|0.037136 old|0.036921 lace|0.036921 gainsboro|0.036898 snow|0.032634 mint|0.03241 cream|0.03241 ivory|0.031516 white|0.029171 beige|0.02192 azure|0.020571 honeydew|0.019124 ghost|0.018742 white|0.018742 papaya|0.018602 whip|0.018602 tan|0.017721 misty|0.016302 rose|0.016302 alice|0.015921 blue|0.015921 corn|0.014166 silk|0.014166  "
		}
	}
}
