{
	"add": {
		"doc": {
			"id": "9f66d10cc4d8d90c89bc1259a4234604f45161a6cdc8ac81cb65e9c64ed18e55",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Obama_and_Susilo_Bambang_Yudhoyono_in_arrival_ceremony_cropped.jpg/170px-Obama_and_Susilo_Bambang_Yudhoyono_in_arrival_ceremony_cropped.jpg",
				"previous": "Most civil disputes appear before a State Court (Pengadilan Negeri); appeals are heard before the High Court (Pengadilan Tinggi). The Supreme Court (Mahkamah Agung) is the country's highest court, and hears final cessation appeals and conducts case reviews. Other courts include the Commercial Court, which handles bankruptcy and insolvency; a State Administrative Court (Pengadilan Tata Negara) to hear administrative law cases against the government; a Constitutional Court (Mahkamah Konstitusi) to hear disputes concerning legality of law, general elections, dissolution of political parties, and the scope of authority of state institutions; and a Religious Court (Pengadilan Agama) to deal with codified Sharia Law cases.[71]",
				"after": "In contrast to Sukarno's anti-imperialistic antipathy to Western powers and tensions with Malaysia, Indonesia's foreign relations since the Suharto New Order have been based on economic and political co-operation with Western nations.[73] Indonesia maintains close relationships with its neighbours in Asia, and is a founding member of ASEAN and the East Asia Summit.[68] The nation restored relations with the People's Republic of China in 1990 following a freeze in place since anti-communist purges early in the Suharto era.[71] Indonesia has been a member of the United Nations since 1950,[74] and was a founder of the Non-Aligned Movement (NAM) and the Organisation of the Islamic Conference (OIC, now the Organisation of Islamic Cooperation).[68] Indonesia is signatory to the ASEAN Free Trade Area agreement, the Cairns Group, and the WTO, and has historically been a member of OPEC, although it withdrew in 2008 as it was no longer a net exporter of oil. Indonesia has received humanitarian and development aid since 1966, in particular from the United States, western Europe, Australia, and Japan.[68]",
			"color": "black|0.80326 maroon|0.05857 dark|0.029346 gray|0.029346 dark|0.029346 grey|0.029346 gray|0.01903 grey|0.01903 brown|0.013435 silver|0.0098816 dim|0.0098717 gray|0.0098717 dim|0.0098717 grey|0.0098717 dark|0.0083718 red|0.0083718 sienna|0.0080632 light|0.0052892 steel|0.0052892 blue|0.0052892  "
		}
	}
}
