{
	"add": {
		"doc": {
			"id": "9f68ec8ef4cfb3d05c274589be3cf5ab77bea7eeed78533a753b6f558889c4cd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/1942_Assay_Commission.jpg/220px-1942_Assay_Commission.jpg",
				"previous": "Among those appointed was coin collector and Congressman William A. Ashbrook, 14 times an assay commissioner between 1908 and 1934.[53] Ashbrook's presence on the 1934 Assay Commission has led to speculation that he might have used his position as an assay commissioner (he left Congress in 1921) to secure one or more 1933 Saint-Gaudens double eagles, almost all of which were melted due to the end of gold coinage for circulation. Assay commissioners were traditionally allowed to purchase coins from the pyx that were not assayed, and numismatic historian Roger Burdette speculates that Ashbrook, generally well-treated by the Treasury Department due to his onetime congressional position, might have exchanged other gold pieces for the 1933 coins.[55]",
				"after": "The three known specimens of the 1873-CC quarter, without arrows by the date, and the only known dime of that description, may have been salvaged from assay pieces, as the remainder of those coins had been ordered melted as underweight.[13] A similar mystery attends the 1894 Barber dime struck at San Francisco (1894-S) of which the published mintage is 24, although it is not certain whether this total includes the one sent to Philadelphia to await the 1895 Assay Commission. The fact that one of the 1895 assay commissioners was Robert Barnett, chief clerk of the San Francisco Mint, has led numismatic writers Nancy Oliver and Richard Kelly to speculate that he may have been made an assay commissioner in order to retrieve the dime. The 1895 Assay Commission report confirms that the dime was there, as it was counted by the Counting Committee. The dime is not mentioned as having been either weighed or assayed; Oliver and Kelly, in a May 2011 article in The Numismatist, suggest that Barnett used that privilege of assay commissioners to obtain the rarity. He is not known, however, to have written or spoken of the matter before his murder in 1904.[56]",
			"color": " "
		}
	}
}
