{
	"add": {
		"doc": {
			"id": "9f6c54aa0e39c6b7b621f0e6dc4c84cd4753eb932e835973fd6799b44b774c62",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e1/Nathan_Covington_Brooks.jpg/170px-Nathan_Covington_Brooks.jpg",
				"previous": "The creation of a male high school \"in which the higher branches of English and classical literature should be taught exclusively\" was authorized unanimously by the Baltimore City Council on March 7, 1839.[1] A townhouse of probably two stories with a sloped roof and dormer window structure on what was then known as Courtland Street (now east side of \"Preston Gardens\", built in the late 1910s with terraced and bermed flower beds with shrubs and monumental staircases along St. Paul Street and St. Paul Place, of five square blocks between East Centre Street in the north and East Lexington Street to the south, as Baltimore's first downtown \"urban renewal\" project, which unfortunately resulted in the razing of hundreds of beautiful, but run-down, then neglected Federal, Georgian, and Greek Revival architecture-styled townhomes and classical business structures that would be considered to be saved under the \"historic preservation\" standards today) was acquired to serve as the home of the new high school. The school opened its doors that Fall on October 20, 1839 with 46 students.[1] Enrollment was restricted to white, male students of Baltimore City who had completed grammar school and passed an entrance exam. Additional student applicants from the surrounding rural (and later suburban) Baltimore County and Anne Arundel County were considered upon payment of tuition to the Baltimore City Public Schools system[12] Those enrolled were offered two academic tracks, a classical literature track and an English literature track. The sole instructor for both tracks was the educator and poet, Nathan C. Brooks, who also served as principal.[1] To accommodate the two tracks, Brooks split the school day into two sections: one in the morning from 9 am to 12 am, and another in the afternoon from 2 pm to 5 pm. During the morning session, students studied either classics or English; however, the afternoon was devoted to English.[1]",
				"after": "In its first three years, the school was housed in many locations before returning to the original townhouse building on Courtland Street. In 1843, the City Council allocated $23,000 to acquire a building for the school at the northeastern corner of East Fayette and Holliday Streets, (across the street from the later Baltimore City Hall, constructed 1867-1875), and the site of the present War Memorial Plaza, constructed 1917-1925).[13] The renovated new school building was the former old \"Assembly Rooms\", a Greek Revival architecture civic landmark, built in 1797 by architects Robert Cary Long, Sr. and Col. Nicholas Rogers (ancestor owner of the estate which became Druid Hill Park) to accommodate social events for Baltimore's social elite at the Baltimore Dancing Assembly, which had begun in the 1780s.[14] and the site of the first private library company of Baltimore. The school was next door to the famous Holliday Street Theatre, where the poem \"The Defence of Fort McHenry\", now known as the \"Star Spangled Banner\" written by Frederick and Georgetown lawyer and amateur poet, Francis Scott Key, (1779-1843), was first performed on its stage in October and November 1814, following the Battle of Baltimore, with the British Royal Navy and Army attack on Baltimore during the War of 1812, (now known as \"Defenders' Day\") on September 12-13-14, 1814.[15] Although it was not designed to house an academic institution, the school would occupy this building for 30 years.[16]",
			"color": "dark|0.48572 gray|0.48572 dark|0.48572 grey|0.48572 dim|0.26201 gray|0.26201 dim|0.26201 grey|0.26201 gray|0.13604 grey|0.13604 silver|0.11612  "
		}
	}
}
