{
	"add": {
		"doc": {
			"id": "9f71a8701bcc13e022bb3c7fc84257ac0b36815dd95f7c7a50b5b641724fded0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/ACBP_MSM_from_Folding%40home.tiff/lossless-page1-400px-ACBP_MSM_from_Folding%40home.tiff.png",
				"previous": "Due to the complexity of proteins' conformation space — the set of possible shapes a protein can take — and limitations in computational power, all-atom molecular dynamics simulations have been severely limited in the timescales which they can study. While most proteins typically fold in the order of milliseconds,[14][16] before 2010 simulations could only reach nanosecond to microsecond timescales.[8] General-purpose supercomputers have been used to simulate protein folding, but such systems are intrinsically expensive and typically shared among many research groups. Additionally, because the computations in kinetic models are serial in nature, strong scaling of traditional molecular simulations to these architectures is exceptionally difficult.[17][18] Moreover, as protein folding is a stochastic process and can statistically vary over time, it is computationally challenging to use long simulations for comprehensive views of the folding process.[19][20]",
				"after": "Protein folding does not occur in a single step.[13] Instead, proteins spend the majority of their folding time — nearly 96% in some cases[21] — \"waiting\" in various intermediate conformational states, each a local thermodynamic free energy minimum in the protein's energy landscape. Through a process known as adaptive sampling, these conformations are used by Folding@home as starting points for a set of simulation trajectories. As the simulations discover more conformations, the trajectories are restarted from them, and a Markov state model (MSM) is gradually created from this cyclic process. MSMs are discrete-time master equation models which describe a biomolecule's conformational and energy landscape as a set of distinct structures and the short transitions between them. The adaptive sampling Markov state model approach significantly increases the efficiency of simulation as it avoids computation inside the local energy minimum itself, and is amenable to distributed computing (including on GPUGRID) as it allows for the statistical aggregation of short, independent simulation trajectories.[22] The amount of time it takes to construct a Markov state model is inversely proportional to the number of parallel simulations run, i.e. the number of processors available. In other words, it achieves linear parallelization, leading to an approximately four orders of magnitude reduction in overall serial calculation time. A completed MSM may contain tens of thousands of sample states from the protein's phase space (all the conformations a protein can take on) and the transitions between them. The model illustrates folding events and pathways (i.e. routes) and researchers can later use kinetic clustering to view a coarse-grained representation of the otherwise highly detailed model. They can use these MSMs to reveal how proteins misfold and to quantitatively compare simulations with experiments.[5][19][23]",
			"color": "white|0.08755 smoke|0.08755 sea|0.085692 shell|0.085692 snow|0.085404 alice|0.085315 blue|0.085315 ghost|0.085172 white|0.085172 mint|0.085147 cream|0.085147 white|0.084958 floral|0.084419 white|0.084419 azure|0.083752 lavender|0.0807 blush|0.0807 dark|0.019718 gray|0.019718 dark|0.019718 grey|0.019718 black|0.017955 gray|0.017756 grey|0.017756 dim|0.014681 gray|0.014681 dim|0.014681 grey|0.014681 silver|0.014389 light|0.012357 gray|0.012357 light|0.012357 grey|0.012357 gainsboro|0.011269 ivory|0.0057025 linen|0.0046132 honeydew|0.002815 lavender|0.0027276  "
		}
	}
}
