{
	"add": {
		"doc": {
			"id": "9f814ee55a3428bc73f86e63cee92205d191613bdfd32c6078d9da9636302095",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Orangestarsultra.jpg/310px-Orangestarsultra.jpg",
				"previous": "Baseball was one of the first sports to gain widespread popularity in Puerto Rico. The Puerto Rico Baseball League serves as the only active professional league, operating as a winter league. No Major League Baseball franchise or affiliate plays in Puerto Rico, however, San Juan hosted the Montreal Expos for several series in 2003 and 2004 before they moved to Washington, D.C. and became the Washington Nationals. The Puerto Rico national baseball team has participated in the World Cup of Baseball winning one gold (1951), four silver and four bronze medals, the Caribbean Series (winning fourteen times) and the World Baseball Classic. On March 2006, San Juan's Hiram Bithorn Stadium hosted the opening round as well as the second round of the newly formed World Baseball Classic. Famous Puerto Rican baseball players include Hall of Famers Roberto Clemente, Orlando Cepeda and Roberto Alomar, enshrined in 1973, 1999, and 2011 respectively.[265][266][267]",
				"after": "Boxing, basketball, and volleyball are considered popular sports as well. Wilfredo Gómez and McWilliams Arroyo have won their respective divisions at the World Amateur Boxing Championships. Other medalists include José Pedraza, who holds a silver medal, and three boxers who finished in third place, José Luis Vellón, Nelson Dieppa and McJoe Arroyo. In the professional circuit, Puerto Rico has the third-most boxing world champions and it is the global leader in champions per capita. These include Miguel Cotto, Félix Trinidad, Wilfred Benítez and Gómez among others. The Puerto Rico national basketball team joined the International Basketball Federation in 1957. Since then, it has won more than 30 medals in international competitions, including gold in three FIBA Americas Championships and the 1994 Goodwill Games. August 8, 2004, became a landmark date for the team when it became the first team to defeat the United States in an Olympic tournament since the integration of National Basketball Association players. Winning the inaugural game with scores of 92–73 as part of the 2004 Summer Olympics organized in Athens, Greece.[268] Baloncesto Superior Nacional acts as the top-level professional basketball league in Puerto Rico, and has experienced success since its beginning in 1930.",
			"color": "black|0.66987 light|0.030368 salmon|0.030368 dark|0.027015 salmon|0.027015 coral|0.026666 misty|0.023369 rose|0.023369 peach|0.01739 puff|0.01739 thistle|0.016047 lavender|0.013665 sienna|0.012582 dim|0.012077 gray|0.012077 dim|0.012077 grey|0.012077 maroon|0.011612 rosy|0.010811 brown|0.010811 firebrick|0.010556 dark|0.010243 red|0.010243 lavender|0.0099208 blush|0.0099208  "
		}
	}
}
