{
	"add": {
		"doc": {
			"id": "9f85717021edbbcdca79316751a7f7e96d1fe9fbe97420f4e6bff3e179480353",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Point-19_carat_diamond_cut_blue_Yogo_sapphireCROP.jpg/220px-Point-19_carat_diamond_cut_blue_Yogo_sapphireCROP.jpg",
				"previous": "Various companies attempted to lease the mine from Roncor, but in the meantime, two local couples, Lanny and Joy Perry and Chuck and Marie Ridgeway, discovered a new site at Yogo Gulch in January 1984 by following a trail to an unused section of the dike that had previously been deemed unsuitable. They began mining the site and named it the \"Vortex Mine\", forming a company named Vortex Mining. The mine shaft was 280 feet (85 m) deep and contained two Yogo ore-bearing veins.[84] The portion of the dike they had mined was an extension of the main dike.[85] The Vortex Mine, renamed Yogo Creek Mining,[18] was successful for years but eventually declined and closed in 2004.[85]",
				"after": "In 1992, Roncor found an 11-carat (2.2 g) rough.[85] AMAX Exploration, operating as the Yogo Sapphire Project, signed a 22-month lease with Roncor in March 1993 and had some success in the middle and eastern portions of the dike; it decided not to continue after the end of its lease due to the cost of underground mining, depletion of easily accessible Yogos, and the relatively small size of Yogos then easily accessible. During this time, additional dikes were found in the area using geophysical magnetometer surveys. Low-grade sapphire rough was found in the Eastern Flats Dike, a parallel dike some 500 feet northeast of the main dike.[86] Pacific Cascade Sapphires, a Canadian company, had a mining lease with Roncor in 2000 and 2001 but ran out of funds and their option expired. By this time, most of the easily accessible Yogos had been mined and miners had to dig deeper, further increasing costs.[18]",
			"color": "lavender|0.23055 light|0.21714 steel|0.21714 blue|0.21714 corn|0.094551 flower|0.094551 blue|0.094551 dark|0.088916 slate|0.088916 blue|0.088916 royal|0.082886 blue|0.082886 slate|0.041582 blue|0.041582 ghost|0.025573 white|0.025573 alice|0.024881 blue|0.024881 white|0.020447 smoke|0.020447 snow|0.017925 medium|0.017548 purple|0.017548 white|0.017255 lavender|0.017006 blush|0.017006 azure|0.014179 mint|0.013464 cream|0.013464  "
		}
	}
}
