{
	"add": {
		"doc": {
			"id": "9f8923cee570f517890cbe3e4d9defb37a4958f3b698cba853e1e2baeee4c917",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Emmeline_Pankhurst_in_prison.jpg/170px-Emmeline_Pankhurst_in_prison.jpg",
				"previous": "Before long, all three of her daughters became active with the WSPU. Christabel was arrested after spitting at a policeman during a meeting of the Liberal Party in October 1905;[59] Adela and Sylvia were arrested a year later during a protest outside Parliament.[60] Pankhurst was arrested for the first time in February 1908, when she tried to enter Parliament to deliver a protest resolution to Prime Minister H. H. Asquith. She was charged with obstruction and sentenced to six weeks in prison. She spoke out against the conditions of her confinement, including vermin, meagre food, and the \"civilised torture of solitary confinement and absolute silence\" to which she and others were ordered.[61] Pankhurst saw imprisonment as a means to publicise the urgency of women's suffrage; in June 1909 she struck a police officer twice in the face to ensure she would be arrested. Pankhurst was arrested seven times before women's suffrage was approved. During her trial on 21 October 1908 she told the court: \"We are here not because we are law-breakers; we are here in our efforts to become law-makers.\"[62][63][64]",
				"after": "The exclusive focus of the WSPU on votes for women was another hallmark of its militancy. While other organisations agreed to work with individual political parties, the WSPU insisted on separating itself from – and in many cases opposing – parties which did not make women's suffrage a priority. The group protested against all candidates belonging to the party of the ruling government, since it refused to pass women's suffrage legislation. This brought them into immediate conflict with Liberal Party organisers, particularly since many Liberal candidates supported women's suffrage. (One early target of WSPU opposition was future Prime Minister Winston Churchill; his opponent attributed Churchill's defeat in part to \"those ladies who are sometimes laughed at.\")[65]",
			"color": " "
		}
	}
}
