{
	"add": {
		"doc": {
			"id": "9f935d5d569744f0d6910d20638c6f2c8f336299c69437abd54a7c2b4688baeb",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/EgyptAir_Boeing_707-320C_SU-AVZ_ZRH_Jun_1978.png/220px-EgyptAir_Boeing_707-320C_SU-AVZ_ZRH_Jun_1978.png",
			"previous": [],
				"after": "EgyptAir inherited UAA‍‍ '​‍s staff, equipment, assets and liabilities. On 19 March 1972, a Douglas DC-9-32 carrying Yugoslav registration YU-AHR crashed into the Shamsam Mountains, 4 miles (6.4 km) southwest of Aden, killing all 30 occupants on board. On 16 June, an Ilyushin Il-62 (SU-ARN) was involved in a landing accident with no reported fatalities. In July, eight Tupolev Tu-154s were ordered for US$60 million, with three of them slated for delivery in July 1973 (1973-07), three in November 1973 (1973-11) and two in March 1974 (1974-03).[37] Prior to firming the transaction up EgyptAir had also considered the Boeing 727, but financing for these US-manufactured aircraft could not be arranged.[38] Under the terms of the contract, light maintenance was to be performed in Egypt, whereas airframe and engine overhauling was to be undertaken in the Soviet Union.[39] In July 1972 (1972-07), the acquisition of four Boeing 707-320Cs valued at US$40 million was announced. At this time, the airline had four Boeing 707s already in operation. The handover of the new aircraft had been arranged for March, May, June and September 1973 (1973-09).[37] On 5 December 1972, one of the four 707s already in the fleet (SU-AOW) crashed near Cairo while on a training flight. The crew of six perished in the accident. Reports indicating the airframe had been shot down were denied by the Egyptian government.[40] An Ilyushin Il-18, registration SU-AOY, was involved in a deadly accident near Nicosia on 29 January 1973 when it crashed into mountainous terrain, killing all 37 occupants on board.[41] Delivery of the four new Boeing 707s took place during the year, with two more 707-320Cs being ordered in September. In October the three Il-62s were returned to Aeroflot because of elevated operational costs and technical issues.[37] Also that month,[37] the first Tu-154 entered the fleet and was used for pilot training.[39] From Moscow, the handover of the Tu-154s was made through London-Heathrow, where these aircraft were fitted with British-made seats.[39]",
			"color": "steel|0.46388 blue|0.46388 dim|0.16409 gray|0.16409 dim|0.16409 grey|0.16409 dark|0.13116 slate|0.13116 gray|0.13116 light|0.038331 steel|0.038331 blue|0.038331 gray|0.029707 grey|0.029707 light|0.025439 slate|0.025439 gray|0.025439 black|0.023017 slate|0.019895 gray|0.019895 light|0.019047 blue|0.019047 alice|0.015226 blue|0.015226 dark|0.014857 gray|0.014857 dark|0.014857 grey|0.014857 light|0.012555 cyan|0.012555 azure|0.010934  "
		}
	}
}
