{
	"add": {
		"doc": {
			"id": "9f9723a0d500c1fee7453f535a5a6b0e0b19c1df940a96d0ae60198eed0f0f6c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/8La_Voz_de_la_Mujer.jpg/220px-8La_Voz_de_la_Mujer.jpg",
			"previous": [],
				"after": "In Argentina Virginia Bolten is responsible for the publication of a newspaper called La Voz de la Mujer (English: The Woman's Voice), which was published nine times in Rosario between 8 January 1896 and 1 January 1897, and was revived, briefly, in 1901. A similar paper with the same name was reportedly published later in Montevideo, which suggests that Bolten may also have founded and edited it after her deportation.[9] \"La Voz de la Mujer described itself as “dedicated to the advancement of Communist Anarchism.” Its central theme was that of the multiple nature of women’s oppression. An editorial asserted, “We believe that in present-day society nothing and nobody has a more wretched situation than unfortunate women.” Women, they said, were doubly oppressed - by bourgeois society and by men. Its feminism can be seen from its attack on marriage and upon male power over women. Its contributors, like anarchist feminists elsewhere, developed a concept of oppression that focused on gender oppression. Marriage was a bourgeois institution which restricted women’s freedom, including their sexual freedom. Marriages entered into without love, fidelity maintained through fear rather than desire, oppression of women by men they hated - all were seen as symptomatic of the coercion implied by the marriage contract. It was this alienation of the individual’s will that the anarchist feminists deplored and sought to remedy, initially through free love and then, and more thoroughly, through social revolution.\"[10]",
			"color": "sea|0.07715 shell|0.07715 white|0.076716 smoke|0.076716 floral|0.074828 white|0.074828 snow|0.073555 white|0.069884 mint|0.068928 cream|0.068928 ghost|0.052886 white|0.052886 dark|0.051272 gray|0.051272 dark|0.051272 grey|0.051272 azure|0.050546 linen|0.048462 silver|0.043863 alice|0.041266 blue|0.041266 ivory|0.039468 light|0.038052 gray|0.038052 light|0.038052 grey|0.038052 gainsboro|0.032897 lavender|0.032704 blush|0.032704 gray|0.030744 grey|0.030744 old|0.029964 lace|0.029964 dim|0.018893 gray|0.018893 dim|0.018893 grey|0.018893 honeydew|0.011235 antique|0.0098832 white|0.0098832 misty|0.0077812 rose|0.0077812 black|0.0053859 beige|0.0041528  "
		}
	}
}
