{
	"add": {
		"doc": {
			"id": "9f9a8456814d1863be9e90bb173b247edf7348440ba026a6a229561665b63d63",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Claire_Clairmont%2C_by_Amelia_Curran.jpg/220px-Claire_Clairmont%2C_by_Amelia_Curran.jpg",
				"previous": "Amidst all of this family turmoil, Imlay still found time to ponder larger social issues. The utopian socialist Robert Owen came to visit Godwin in the summer of 1816 and he and Imlay discussed the plight of the working poor in Britain. She agreed with many of Owen's proposals, but not all of them. She decided, in the end, that his utopian scheme was too \"romantic\", because it depended heavily on the goodwill of the rich to sacrifice their wealth.[65] That same summer, George Blood—the brother of Fanny Imlay's namesake—came to meet her for the first time and told her stories of her mother. After this meeting she wrote to Mary Godwin and Shelley: \"I have determined never to live to be a disgrace to such a mother... I have found that if I will endeavour to overcome my faults I shall find being's [sic] to love and esteem me\" [emphasis in original].[66]",
				"after": "Before Mary Godwin, Clairmont, and Shelley had left for the Continent, Imlay and Mary had had a major argument and no chance to come to a reconciliation. Imlay attempted in her letters to Mary to smooth over the relationship, but her sense of loneliness and isolation in London are palpable. She wrote to Mary of \"the dreadful state of mind I generally labour under & which I in vain endeavour to get rid of\".[67] Many scholars attribute Imlay's increasing unhappiness to Mrs Godwin's hostility towards her. Kegan, and others, contend that Imlay was subject to the same \"extreme depression to which her mother had been subject, and which marked other members of the Wollstonecraft family\".[37] Wandering amongst the mountains of Switzerland, frustrated with her relationship with Shelley, and engrossed by the writing of Frankenstein, her sister was unsympathetic.[68]",
			"color": "sienna|0.47591 peru|0.34899 saddle|0.11204 brown|0.11204 chocolate|0.063066  "
		}
	}
}
