{
	"add": {
		"doc": {
			"id": "9fa3e29e33e12609cb6883517cc4cda18707d6d43ade02fed609fcf580c1c5f6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/1919-1921_Luke_Field.jpg/250px-1919-1921_Luke_Field.jpg",
			"previous": [],
				"after": "The Navy decided that a Hawaiian base was a necessity, considering the Army field at Ford Island an ideal candidate.[52] Naval Air Station Pearl Harbor, consisting of nine officers and fifty-five men, was commissioned on December 19, 1919.[6] Although the Navy attempted to displace the Army from the island and designate it solely for naval use, U.S. Secretary of War Newton D. Baker divided the island equally between the military branches.[53][54] The Army received the west side of the island, and the Navy the southeastern side.[55] Lieutenant Commander Robert D. Kirk-Patrick was sent to establish a naval station on the island with four airplanes and fifty-five men.[55][56] Kirk-Patrick's men had two Curtiss HS2L flying boats and two N-9 planes salvaged from World War I, which they stored in two large canvas hangars across the harbor from the island.[6] After the naval hangars were commissioned on January 17, 1923, by Lieutenant Commander John Rodgers, the detachment moved onto Ford Island and received Naval Aircraft Factory TS, Felixstowe F5L, Curtiss H-16, Keystone PK-1 and Douglas DT type aircraft.[6][57] To accommodate ship berthing the Navy built a concrete-and-stone quay around the entire island,[6] and in 1926, they received Vought FU, Vought VE-7 and Vought VE-9 biplanes.[6]",
			"color": "dark|0.22888 gray|0.22888 dark|0.22888 grey|0.22888 silver|0.18172 gray|0.14457 grey|0.14457 light|0.13828 gray|0.13828 light|0.13828 grey|0.13828 gainsboro|0.10699 dim|0.086253 gray|0.086253 dim|0.086253 grey|0.086253 linen|0.021452 white|0.018888 smoke|0.018888 sea|0.013243 shell|0.013243 floral|0.0095919 white|0.0095919 snow|0.008984 old|0.0085182 lace|0.0085182 mint|0.0072459 cream|0.0072459 black|0.0061828 white|0.0060514 ivory|0.003884 azure|0.0034628 ghost|0.0030738 white|0.0030738  "
		}
	}
}
