{
	"add": {
		"doc": {
			"id": "9fba4660553d7705315600fb97a4cc38bcd8e67c5bd754e38140211b708b0447",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Atlantic_Puffin_Fratercula_arctica.jpg/220px-Atlantic_Puffin_Fratercula_arctica.jpg",
			"previous": [],
				"after": "The Atlantic puffin is sturdily built with a thick-set neck and short wings and tail. It is 28 to 30 centimetres (11 to 12 in) in length from the tip of its stout bill to its blunt-ended tail. Its wingspan is 47 to 63 centimetres (19 to 25 in) and on land it stands about 20 cm (8 in) high. The male is generally slightly larger than the female, but they are coloured alike. The forehead, crown and nape are glossy black, as are the back, wings and tail. A broad black collar extends around the neck and throat. On each side of the head is a large, lozenge-shaped area of very pale grey. These face patches taper to a point and nearly meet at the back of the neck. The shape of the head creates a crease extending from the eye to the hindmost point of each patch giving the appearance of a grey streak. The eye looks almost triangular in shape because of a small, peaked area of horny blue-grey skin above it and a rectangular patch below. The irises are brown or very dark blue and each has red orbital ring. The underparts of the bird, the breast, belly and undertail coverts, are white. By the end of the breeding season, the black plumage may have lost its shine or even taken on a slightly brownish tinge. The legs are short and set well back on the body giving the bird its upright stance on land. Both legs and large webbed feet are bright orange, contrasting with the sharp black claws.[15]",
			"color": "dim|0.29187 gray|0.29187 dim|0.29187 grey|0.29187 gray|0.14976 grey|0.14976 dark|0.11449 gray|0.11449 dark|0.11449 grey|0.11449 silver|0.078735 light|0.057082 gray|0.057082 light|0.057082 grey|0.057082 black|0.050034 gainsboro|0.045129 white|0.019633 smoke|0.019633 slate|0.014693 gray|0.014693 alice|0.013832 blue|0.013832 ghost|0.013644 white|0.013644 sea|0.013619 shell|0.013619 snow|0.013303 white|0.012311 lavender|0.012263 blush|0.012263 mint|0.011819 cream|0.011819 floral|0.011276 white|0.011276 azure|0.011064  "
		}
	}
}
