{
	"add": {
		"doc": {
			"id": "9fbbf27a6499914cd94b128d863be7b669f7c8ad14d881f6db29b42c4001b9d1",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Herne_Bay_clock_tower.jpg/250px-Herne_Bay_clock_tower.jpg",
				"previous": "One of the oldest buildings in Herne Bay is the late 18th-century inn, The Ship, which served as the focal point for the small shipping and farming community which first inhabited the town. During this time, passenger and cargo boats regularly ran between Herne Bay and London and boats carrying coal ran from Newcastle. From Herne was easy access by road to the city of Canterbury or to Dover, where further passage by boat could then be obtained across the English Channel to France.[3]",
				"after": "The 1801 census recorded Herne Bay, including Herne, as having a population of 1,232.[4] During the early 19th century, a smugglers' gang operated from the town.[5] The gang were regularly involved in a series of fights with the preventive services until finally being overpowered in the 1820s.[4] In the 1830s, a group of London investors, who recognised Herne Bay's potential as a seaside resort, built a wooden pier and a promenade on the town's seafront. This and the subsequent building of a railway station led to the rapid expansion of the town; between 1831 and 1841 the town's population grew from 1,876 to 3,041.[4] The London businessmen intended to rename the town St Augustine's, but the name was unpopular with residents and the \"Herne Bay\" remained.[6] In 1833, an Act of Parliament established Herne Bay and Herne as separate towns.[7] Local landowner Sir Henry Oxenden donated a piece of ground for the site of the town's first church,[8] Christ Church, which was opened in 1834.[3] In 1837, Mrs Ann Thwaytes, a wealthy lady from London, donated around £4,000 to build a 75 feet (23 m) clock tower on the town's seafront.[8] It is believed to be the first freestanding purpose built clock tower in the world.[3]",
			"color": "dim|0.18633 gray|0.18633 dim|0.18633 grey|0.18633 dark|0.17593 olive|0.17593 green|0.17593 slate|0.090366 gray|0.090366 gray|0.084512 grey|0.084512 tan|0.080765 dark|0.055935 gray|0.055935 dark|0.055935 grey|0.055935 light|0.042698 slate|0.042698 gray|0.042698 dark|0.032761 khaki|0.032761 silver|0.022233 wheat|0.021227 antique|0.020431 white|0.020431 bisque|0.020002 blanched|0.019761 almond|0.019761 papaya|0.017121 whip|0.017121  "
		}
	}
}
