{
	"add": {
		"doc": {
			"id": "9fe51a56586b73e636a06d827918686e65abd0e3a406c76ec245aed8d99264c3",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/5/52/JamesDukeStatueAndChapel1.jpg/220px-JamesDukeStatueAndChapel1.jpg",
				"previous": "In 1924 Washington Duke's son, James B. Duke, established The Duke Endowment with a $40 million trust fund. Income from the fund was to be distributed to hospitals, orphanages, the Methodist Church, and four colleges (including Trinity College). William Preston Few, the president of Trinity at the time, insisted that the institution be renamed Duke University to honor the family's generosity and to distinguish it from the myriad other colleges and universities carrying the \"Trinity\" name. At first, James B. Duke thought the name change would come off as self-serving, but eventually he accepted Few's proposal as a memorial to his father.[7] Money from the endowment allowed the University to grow quickly. Duke's original campus, East Campus, was rebuilt from 1925 to 1927 with Georgian-style buildings. By 1930, the majority of the Collegiate Gothic-style buildings on the campus one mile (1.6 km) west were completed, and construction on West Campus culminated with the completion of Duke Chapel in 1935.[19]",
				"after": "In 1878, Trinity (in Randolph County) awarded A.B. degrees to three sisters—Mary, Persis, and Theresa Giles—who had studied both with private tutors and in classes with men. With the relocation of the college in 1892, the Board of Trustees voted to again allow women to be formally admitted to classes as day students. At the time of Washington Duke's donation in 1896, which carried the requirement that women be placed \"on an equal footing with men\" at the college, four women were enrolled; three of the four were faculty members' children. In 1903 Washington Duke wrote to the Board of Trustees withdrawing the provision, noting that it had been the only limitation he had ever put on a donation to the college. A woman's residential dormitory was built in 1897 and named the Mary Duke Building, after Washington Duke's daughter. By 1904, fifty-four women were enrolled in the college. In 1930, the Woman's College was established as a coordinate to the men's undergraduate college, which had been established and named Trinity College in 1924.[20]",
			"color": "dim|0.14626 gray|0.14626 dim|0.14626 grey|0.14626 khaki|0.13266 light|0.11922 steel|0.11922 blue|0.11922 gray|0.095361 grey|0.095361 dark|0.084155 gray|0.084155 dark|0.084155 grey|0.084155 black|0.083047 light|0.058021 slate|0.058021 gray|0.058021 slate|0.044033 gray|0.044033 lavender|0.041319 pale|0.035617 golden|0.035617 rod|0.035617 silver|0.02981 burly|0.020162 wood|0.020162 light|0.015008 blue|0.015008 light|0.013977 gray|0.013977 light|0.013977 grey|0.013977 dark|0.011402 slate|0.011402 gray|0.011402 tan|0.010989 gainsboro|0.0098729 navajo|0.0096828 white|0.0096828  "
		}
	}
}
