{
	"add": {
		"doc": {
			"id": "9fe75028ae5ff416e64334a2d8a5698d7dab4aa79ca978a108ec1b7fcade7ffc",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Ashton_under_lyne_aerial_shot.jpg/300px-Ashton_under_lyne_aerial_shot.jpg",
				"previous": "A poor supply of fresh water and dwellings without adequate drainage led to a cholera outbreak in the town in 1832.[43] The Ashton Poor Law Union was established in 1837 and covered most of what is now Tameside. A new workhouse was built in 1850 which provided housing for 500 people. It later became part of Tameside General Hospital.[31] Construction on the Sheffield, Ashton-under-Lyne and Manchester Railway (SA&MR) began in 1837 to provide passenger transport between Manchester and Sheffield. Although a nine-arch viaduct in Ashton collapsed in April 1845, the line was fully opened on 22 December 1845. The SA&MR was amalgamated with the Sheffield and Lincolnshire Junction Railway, the Great Grimsby & Sheffield Railway, and the Grimsby Docks Company in 1847 to form the Manchester, Sheffield and Lincolnshire Railway (MS&LR).[44] In 1890, the MS&LR bought the Old Hall and demolished it to make way for the construction of new sidings.[21]",
				"after": "In the late 19th century, public buildings such as the market hall, the town hall, the public library, and public baths were built.[39] A donation from Hugh Mason funded the construction of the baths constructed in 1870–1871.[45] The Ashton-under-Lyne Improvement Act was passed in 1886 which gave the borough influence over housing and allowed the imposition of minimum standards such as drainage.[46] Coal mining not as important to the town as the textile industry, but in 1882 the Ashton Moss Colliery had the deepest mine shaft in the world at 870 metres (2,850 ft).[47] Ashton's textile industry remained constant between 1865 and the 1920s. Although some mills closed or merged, the number of spindles in use increased.[36][48] With the collapse of the overseas market in the 1920s, the town's cotton industry went into decline, and by the 1930s most of the firms and mills in the area had closed.[36]",
			"color": "dim|0.38051 gray|0.38051 dim|0.38051 grey|0.38051 black|0.19179 gray|0.18071 grey|0.18071 slate|0.09875 gray|0.09875 light|0.063893 slate|0.063893 gray|0.063893 dark|0.044649 gray|0.044649 dark|0.044649 grey|0.044649 dark|0.019911 slate|0.019911 gray|0.019911 silver|0.012564  "
		}
	}
}
