{
	"add": {
		"doc": {
			"id": "9ff0948a689919d29546705030e306e0a12b78ced3107a83717282760847ec41",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Phoenix_AZ_Downtown_from_airplane.jpg/220px-Phoenix_AZ_Downtown_from_airplane.jpg",
				"previous": "The Phoenix Metropolitan Statistical Area (MSA) (officially known as the Phoenix-Mesa-Glendale MSA), is one of 10 MSAs in Arizona, and was the 14th largest in the United States, with a total population of 4,192,887 as of the 2010 Census. Consisting of parts of both Pinal and Maricopa counties, the MSA accounts for 65.5% of the total population of the state of Arizona.[92][93] Phoenix only contributed 13% to the total growth rate of the MSA, down significantly from its 33% share during the prior decade.[95] Phoenix is also part of the Arizona Sun Corridor megaregion (MR), which is the 10th most populous of the 11 MRs, and the 8th largest by area. It had the 2nd largest growth by percentage of the MRs (behind only the Gulf Coast MR) between 2000 and 2010.[96]",
				"after": "The population is almost equally split between men and women, with men making up 50.2% of city's citizens. The population density is 2,797.8 people per square mile, and the median age of the city is 32.2 years, with only 10.9 of the population being over 62. 98.5% of Phoenix's population lives in households with an average household size of 2.77 people. There were 514,806 total households, with 64.2% of those households consisting of families: 42.3% married couples, 7% with an unmarried male as head of household, and 14.9% with an unmarried female as head of household. 33.6% of those households have children below the age of 18. Of the 35.8% of non-family households, 27.1% of them have a householder living alone, almost evenly split between men and women, with women having 13.7% and men occupying 13.5%. Phoenix has 590,149 housing units, with an occupancy rate of 87.2%. The largest segment of vacancies is in the rental market, where the vacancy rate is 14.9%, and 51% of all vacancies are in rentals. Vacant houses for sale only make up 17.7% of the vacancies, with the rest being split among vacation properties and other various reasons.[97]",
			"color": "dim|0.3222 gray|0.3222 dim|0.3222 grey|0.3222 gray|0.25969 grey|0.25969 dark|0.15187 gray|0.15187 dark|0.15187 grey|0.15187 silver|0.068345 black|0.067253 light|0.0359 gray|0.0359 light|0.0359 grey|0.0359 gainsboro|0.023712 slate|0.0074003 gray|0.0074003 linen|0.0068946 antique|0.0059547 white|0.0059547 light|0.0051727 slate|0.0051727 gray|0.0051727 white|0.0050261 smoke|0.0050261 sea|0.00459 shell|0.00459  "
		}
	}
}
