{
	"add": {
		"doc": {
			"id": "9ff2de4a5adf90e1f79ba13dd4950b720fab13f803217f221c779f0d28bffb35",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Lindow_Man_02.jpg/220px-Lindow_Man_02.jpg",
				"previous": "Lindow Man's official name is Lindow II, as there are other finds from the area: Lindow I (Lindow Woman)[18] refers to a human skull, Lindow III to a \"fragmented headless body\", and Lindow IV to the upper thigh of an adult male, possibly that of Lindow Man.[19] After the discovery of Lindow Man, there were no further archaeological excavations at Lindow Moss until 1987. A large piece of skin was found by workmen on the elevator on 6 February 1987. On this occasion, the police left the investigation to the archaeologists. Over 70 pieces were found, constituting Lindow III. Although the bone was not as well preserved as that of Lindow Man, the other tissues survived in better condition.[20] The final discovery was that of Lindow IV on 14 June 1988. Part of a left leg and buttocks were found on the elevator, from a site just 50 feet (15 m) west of where Lindow Man was found. Nearly three months later, on 12 September, a right thigh was discovered in the peat on the bucket of a digger. The proximity of the discovery sites, coupled with the fact that the remains were shown to come from an adult male, means that Lindow IV is probably part of Lindow Man.[21]",
				"after": "The discovery of Lindow Man marked the first well-preserved bog body discovered in Britain; its condition was comparable to that of Grauballe Man and Tollund Man from Denmark. Before Lindow Man, it was estimated that 41 bog bodies had been found in England and Wales and 15 in Scotland. Encouraged by the discovery of Lindow Man, a gazetteer was compiled and revealed a far higher number of bog bodies: over 85 in England and Wales and over 36 in Scotland. Prior to the discovery of the bodies in Lindow Moss, British bog bodies had been a relatively neglected subject compared to European examples. The interest caused by Lindow Man led to more in-depth research of accounts of discoveries in bogs since the 17th century; by 1995, the numbers had changed to 106 in England and Wales and 34 in Scotland. The remains covered a large time frame.[22]",
			"color": "sandy|0.40445 brown|0.40445 peru|0.37569 sienna|0.11664 saddle|0.070989 brown|0.070989 black|0.019172 chocolate|0.0082069  "
		}
	}
}
