{
	"add": {
		"doc": {
			"id": "9ffbdc8362b1536c9557a631abe9d4725a68673552623353f450c26cc0563eec",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Bienvenue_a_Rechmaya.jpg/280px-Bienvenue_a_Rechmaya.jpg",
			"previous": [],
				"after": "A former French colony, Lebanon designates Arabic as the sole official language, while a special law regulates cases when French can be publicly used. French is widely used as a second language by the Lebanese, and is taught in many schools as a secondary language along with Arabic and English. The language is also used on bank notes, on road signs, and on official buildings (alongside Arabic). Similarly, Syria was also a French colony until 1943, but the French language is largely extinct in the country and is only limited to some members of the elite and middle classes. A significant French-speaking community is also present in Israel, primarily among the community of Maghrebi Jews, and many secondary schools offer French as a foreign language. The United Arab Emirates has joined the Organisation internationale de la Francophonie as an observer, and Qatar has joined as a \"member-state\". However, in both countries French is not spoken by almost any of the general population or migrant workers, but spoken by a small minority of those who invest in Francophone countries or have other financial or family ties. Their entrance into the organisation was aided a good deal by their investments into the Organisation and France itself.[33]",
			"color": "medium|0.21026 blue|0.21026 pale|0.11165 golden|0.11165 rod|0.11165 dark|0.080801 khaki|0.080801 olive|0.078341 khaki|0.0748 olive|0.07121 drab|0.07121 dark|0.039095 blue|0.039095 wheat|0.023872 navy|0.021217 dark|0.019736 olive|0.019736 green|0.019736 lemon|0.017998 chiffon|0.017998 lavender|0.017634 light|0.01481 golden|0.01481 rod|0.01481 yellow|0.01481 light|0.012203 steel|0.012203 blue|0.012203 light|0.010933 gray|0.010933 light|0.010933 grey|0.010933 antique|0.010339 white|0.010339 silver|0.0088426 black|0.0086878 gainsboro|0.0085129 beige|0.0082776 alice|0.0080026 blue|0.0080026 moccasin|0.0074003 midnight|0.0072817 blue|0.0072817  "
		}
	}
}
