{
	"add": {
		"doc": {
			"id": "a000539fd27dabe4072a6ede158577d5197dce530d2ed08c8863421464edd1a0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Tulum-Seaside-2010.jpg/220px-Tulum-Seaside-2010.jpg",
				"previous": "The name \"Caribbean\" is derived from the Caribs, one of the dominant Native American groups in the region at the time of European contact during the late 15th century. After the discovery of America by accident Christopher Columbus in 1492, the Spanish term Antillas was assigned to the lands; stemming from this, \"Sea of the Antilles\" is a common alternative name for the Caribbean Sea in various European languages. During the first century of development, the Spanish dominance was undisputed.",
				"after": "The Caribbean Sea was an unknown body of water to the populations of Eurasia until 1492, when Christopher Columbus first sailed into Caribbean waters on a quest to find a sea route to Asia. At that time the Western Hemisphere in general was unknown to Europeans. Following the discovery of the islands by Columbus, the area was quickly colonised by several Western cultures (initially Spain, then later Portugal, England, the Dutch Republic, France and Denmark). Following the colonisation of the Caribbean islands, the Caribbean Sea became a busy area for European-based marine trading and transport, and this commerce eventually attracted piracy.",
			"color": "dark|0.15185 gray|0.15185 dark|0.15185 grey|0.15185 silver|0.13834 light|0.09461 sky|0.09461 blue|0.09461 light|0.092508 gray|0.092508 light|0.092508 grey|0.092508 cadet|0.082404 blue|0.082404 gray|0.071273 grey|0.071273 sky|0.066201 blue|0.066201 gainsboro|0.064914 dim|0.048558 gray|0.048558 dim|0.048558 grey|0.048558 black|0.030567 linen|0.011997 white|0.011506 smoke|0.011506 tan|0.01128 antique|0.0088828 white|0.0088828 sea|0.0076987 shell|0.0076987 misty|0.0058125 rose|0.0058125 snow|0.0057927 alice|0.0054501 blue|0.0054501 floral|0.0053725 white|0.0053725 old|0.0051346 lace|0.0051346 ghost|0.0051166 white|0.0051166 lavender|0.0050883 blush|0.0050883 light|0.0049164 steel|0.0049164 blue|0.0049164  "
		}
	}
}
