{
	"add": {
		"doc": {
			"id": "a005c645e86128ea8c6cd877ce51bb5603355992e1a3d7d0ae14fca507c7dc48",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Haymarket_Bus_Station.jpg/220px-Haymarket_Bus_Station.jpg",
			"previous": [],
				"after": "There are 3 main bus companies providing services in the city; Arriva North East, Go North East and Stagecoach North East. There are two major bus stations in the city: Haymarket bus station and Eldon Square bus station. Arriva mainly operates from Haymarket Bus Station providing the majority of services to the north of Newcastle, Northumberland and North Tyneside. Go-Ahead operates from Eldon Square Bus Station, providing the majority of services south of the river in Gateshead, South Tyneside, Sunderland, and County Durham. Stagecoach is the primary operator in the city proper, with cross-city services mainly between both the West and East ends via the city centre with some services extending out to the MetroCentre, Killingworth, Wallsend and Ponteland. Bus Services in Newcastle upon Tyne and the surrounding boroughs part of the Tyne and Wear area are coordinated by Nexus, the Tyne and Wear Passenger Transport Executive.[222] Other major departure points are Pilgrim Street for buses running South of the Tyne via Gateshead, and Blackett Street/Monument for services to the East or West of the city. Many bus services also pass Newcastle Central Station, a major interchange for Rail and Metro Services.[223] QuayLink is a bus service operated to the Quayside from Newcastle and Gateshead. Newcastle Coach Station, near the railway station, handles long distance bus services operated by National Express.",
			"color": "dim|0.36428 gray|0.36428 dim|0.36428 grey|0.36428 black|0.20009 gray|0.12315 grey|0.12315 dark|0.085408 slate|0.085408 gray|0.085408 dark|0.039594 gray|0.039594 dark|0.039594 grey|0.039594 slate|0.03811 gray|0.03811 sienna|0.025929 light|0.023934 slate|0.023934 gray|0.023934 silver|0.011418  "
		}
	}
}
