{
	"add": {
		"doc": {
			"id": "a00cd4aff42e0c6dcf2cbb3436795e5a53c3545cc6c15731fc0712871c413540",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/20090909_Boyce_Building.JPG/220px-20090909_Boyce_Building.JPG",
				"previous": "In Chicago, he founded the Mutual Newspaper Publishing Company in 1886 which provided advertisements and articles to over 200 newspapers.[11][20] In 1887, he established the weekly Saturday Blade, an illustrated newspaper aimed at rural audiences and sold by thousands of newsboys—an innovation at the time.[21][22] By 1892, the Saturday Blade had the largest circulation of any weekly newspaper in the United States.[23] Boyce's detailed reports of his foreign travels provided articles for the Saturday Blade and were reprinted in books by Rand McNally.[24] The success of the Saturday Blade spawned the W. D. Boyce Publishing Company, which Boyce used to buy or start several newspapers and magazines. In 1892 Boyce bought out the Chicago Ledger, a fiction weekly.[23] In January 1903 he founded the international Boyce's Weekly, which advocated worker's rights. Boyce's prominence as a supporter of labor attracted labor leaders such as John Mitchell and Henry Demarest Lloyd as writers and editors for Boyce's Weekly.[25] Eight months later, Boyce's Weekly was consolidated with the Saturday Blade.[26] Boyce also established the newspapers Farm Business in 1914 and Home Folks Magazine in 1922. Dwindling sales led to the 1925 merger of the Blade and Ledger into the monthly Chicago Blade & Ledger, which was published until 1937.[1] As Boyce's enterprises grew, he insisted on looking after the welfare of about 30,000 delivery boys, who were key to his financial success. Working with them may have helped him gain an understanding of America's youth. Boyce felt that delivering and selling newspapers taught a youth important responsibilities such as being polite, reading human nature, and handling money.[1][4][27] Boyce's focused determination was evident in the advice he gave to young men: \"There are many obstacles to overcome, but toil, grit and endurance will help you to overcome them all. Help yourself and others will help you.\" and \"whatever trade you have selected; never swerve from that purpose a single moment until it is accomplished\".[28]",
				"after": "In 1891, Boyce began working on his own 12-story office building at 30 North Dearborn, known as the Boyce Building, it was designed by Henry Ives Cobb. Even 20 years later, this building was recognized as the most expensive building (in terms of dollars per cubic foot) in Chicago. In 1907, Boyce consolidated his business operations into another office building, also known as the Boyce Building, at 500–510 North Dearborn. A new four-story office building—designed by the architectural firm of Daniel Burnham—was built on this location in 1912 and expanded during 1913–14 with an additional six stories.[29] This building was listed on the National Register of Historic Places on February 29, 1996.[4][30][31][32]",
			"color": "dim|0.24119 gray|0.24119 dim|0.24119 grey|0.24119 gray|0.19477 grey|0.19477 dark|0.14887 gray|0.14887 dark|0.14887 grey|0.14887 silver|0.067511 light|0.034733 gray|0.034733 light|0.034733 grey|0.034733 dark|0.031807 slate|0.031807 gray|0.031807 slate|0.029213 gray|0.029213 gainsboro|0.024925 light|0.024068 slate|0.024068 gray|0.024068 rosy|0.022404 brown|0.022404 white|0.015261 smoke|0.015261 sea|0.013704 shell|0.013704 snow|0.013015 lavender|0.012305 blush|0.012305 floral|0.012091 white|0.012091 black|0.011876 misty|0.011552 rose|0.011552 linen|0.010512 white|0.0091503 ghost|0.0084258 white|0.0084258 alice|0.0079557 blue|0.0079557 old|0.0073989 lace|0.0073989 mint|0.0068907 cream|0.0068907 antique|0.0064901 white|0.0064901 azure|0.0056335 ivory|0.0056241  "
		}
	}
}
