{
	"add": {
		"doc": {
			"id": "a0215f978c5181bd50dd047ef22f7f9d25c0cbe4ca4eece0eb1b6a49f1897cbd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/020408_STS110_Atlantis_launch.jpg/260px-020408_STS110_Atlantis_launch.jpg",
				"previous": "At T-minus 10 seconds, hydrogen igniters were activated under each engine bell to quell the stagnant gas inside the cones before ignition. Failure to burn these gases could trip the onboard sensors and create the possibility of an overpressure and explosion of the vehicle during the firing phase. The main engine turbopumps also began charging the combustion chambers with liquid hydrogen and liquid oxygen at this time. The computers reciprocated this action by allowing the redundant computer systems to begin the firing phase.",
				"after": "The three main engines (SSMEs) started at T-6.6 seconds. The main engines ignited sequentially via the Shuttle's general purpose computers (GPCs) at 120 millisecond intervals. All three SSMEs were required to reach 90% rated thrust within three seconds, otherwise the onboard computers would initiate an RSLS abort. If all three engines indicated nominal performance by T-3 seconds, they were commanded to gimbal to liftoff configuration and the command would be issued to arm the SRBs for ignition at T-0.[72] Between T-6.6 seconds and T-3 seconds, while the SSMEs were firing but the SRBs were still bolted to the pad, the offset thrust caused the entire launch stack (boosters, tank and Shuttle) to pitch down 650 mm (25.5 in) measured at the tip of the external tank. The three second delay after confirmation of SSME operation was to allow the stack to return to nearly vertical. At T-0 seconds, the 8 frangible nuts holding the SRBs to the pad were detonated, the SSMEs were commanded to 100% throttle, and the SRBs were ignited. By T+0.23 seconds, the SRBs built up enough thrust for liftoff to commence, and reached maximum chamber pressure by T+0.6 seconds.[73] The Johnson Space Center's Mission Control Center assumed control of the flight once the SRBs had cleared the launch tower.",
			"color": "gainsboro|0.11493 light|0.11244 gray|0.11244 light|0.11244 grey|0.11244 rosy|0.083633 brown|0.083633 white|0.051015 smoke|0.051015 lavender|0.045223 silver|0.043266 linen|0.038516 alice|0.035881 blue|0.035881 sea|0.035301 shell|0.035301 light|0.034614 blue|0.034614 snow|0.03313 ghost|0.0321 white|0.0321 mint|0.028558 cream|0.028558 white|0.027664 azure|0.025848 lavender|0.024138 blush|0.024138 floral|0.023063 white|0.023063 light|0.021656 steel|0.021656 blue|0.021656 antique|0.02056 white|0.02056 peach|0.018623 puff|0.018623 misty|0.016046 rose|0.016046 old|0.014709 lace|0.014709 dark|0.012974 salmon|0.012974 bisque|0.012142 tan|0.01144 dark|0.0091341 gray|0.0091341 dark|0.0091341 grey|0.0091341 burly|0.0086629 wood|0.0086629 blanched|0.0066432 almond|0.0066432 papaya|0.0064784 whip|0.0064784 thistle|0.0060463 sienna|0.005234 light|0.0052295 cyan|0.0052295 ivory|0.0048492 wheat|0.0040606 beige|0.0040572 peru|0.0037247 honeydew|0.0037219  "
		}
	}
}
