{
	"add": {
		"doc": {
			"id": "a0305bcfd4fd6540038717a08e4227a9c375419901ab6b5aec4aa3ea46c2870c",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/HumiliationValerianusHolbein.jpg/100px-HumiliationValerianusHolbein.jpg",
			"previous": [],
				"after": "The Roman–Persian Wars were a series of conflicts between states of the Greco-Roman world and two successive Iranian empires. Contact between Parthia and the Roman Republic began in 92 BC; wars began under the late Republic, and continued through the Roman, Sassanid and Byzantine empires. Although warfare between the Romans and the Iranians lasted for seven centuries, the frontier remained largely stable. Neither side had the logistical strength or manpower to maintain such lengthy campaigns so far from their borders, and thus neither could advance too far without risking stretching their frontiers too thin. Both sides did make conquests beyond the border, but the balance was almost always restored in time. The resources expended during the Roman–Persian Wars ultimately proved catastrophic for both empires. The prolonged and escalating warfare of the sixth and seventh centuries left them exhausted and vulnerable in the face of the sudden emergence and expansion of the Caliphate, whose forces invaded both empires only a few years after the end of the last Roman–Persian war. Arab Muslim armies swiftly conquered the entire Sassanid Empire, and deprived the Eastern Roman Empire of its territories in the Levant, the Caucasus, Egypt, and the rest of North Africa.",
			"color": "wheat|0.10932 tan|0.10524 antique|0.09788 white|0.09788 blanched|0.095522 almond|0.095522 beige|0.083074 papaya|0.078366 whip|0.078366 corn|0.054428 silk|0.054428 bisque|0.044821 old|0.042178 lace|0.042178 linen|0.031238 ivory|0.03097 light|0.02911 yellow|0.02911 light|0.027165 golden|0.027165 rod|0.027165 yellow|0.027165 floral|0.026145 white|0.026145 sea|0.020463 shell|0.020463 honeydew|0.018877 mint|0.017562 cream|0.017562 white|0.014811 smoke|0.014811 white|0.014156 snow|0.013809 lemon|0.011531 chiffon|0.011531 moccasin|0.0087802  "
		}
	}
}
