{
	"add": {
		"doc": {
			"id": "a0354ab2bf40b889ee67d048bc8b42a004bb29f1bc51e69b4eded02a81bd11cd",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Thomas_allom%2C_c1840%2C_The_Enterance_to_Divan.png/220px-Thomas_allom%2C_c1840%2C_The_Enterance_to_Divan.png",
				"previous": "The Ottoman Empire or, as a dynastic institution, the House of Osman was unprecedented and unequaled in the Islamic world for its size and duration.[109] In Europe, only the House of Habsburg had a similarly unbroken line of sovereigns (kings/emperors) from the same family who ruled for so long, and during the same period, between the late 13th and early 20th centuries. The Ottoman dynasty was Turkish in origin. On eleven occasions, the sultan was deposed (replaced by another sultan of the Ottoman dynasty, who were either the former sultan's brother, son or nephew) because he was perceived by his enemies as a threat to the state. There were only two attempts in Ottoman history to unseat the ruling Ottoman dynasty, both failures, which suggests a political system that for an extended period was able to manage its revolutions without unnecessary instability.[108] As such, the last Ottoman sultan Mehmed VI (r. 1918–1922) was a direct patrilineal (male-line) descendant of the first Ottoman sultan Osman I (r. 1299–1326), which was unparallelled in both Europe (e.g. the male line of the House of Habsburg became extinct in 1740) and in the Islamic world. The primary purpose of the Imperial Harem was to ensure the birth of male heirs to the Ottoman throne and secure the continuation of the direct patrilineal (male-line) descendance of the Ottoman sultans.",
				"after": "The highest position in Islam, caliphate, was claimed by the sultans starting since Murad I,[3] which was established as Ottoman Caliphate. The Ottoman sultan, pâdişâh or \"lord of kings\", served as the Empire's sole regent and was considered to be the embodiment of its government, though he did not always exercise complete control. The Imperial Harem was one of the most important powers of the Ottoman court. It was ruled by the Valide Sultan. On occasion, the Valide Sultan would become involved in state politics. For a time, the women of the Harem effectively controlled the state in what was termed the \"Sultanate of Women\". New sultans were always chosen from the sons of the previous sultan. The strong educational system of the palace school was geared towards eliminating the unfit potential heirs, and establishing support among the ruling elite for a successor. The palace schools, which would also educate the future administrators of the state, were not a single track. First, the Madrasa (Ottoman Turkish: Medrese) was designated for the Muslims, and educated scholars and state officials according to Islamic tradition. The financial burden of the Medrese was supported by vakifs, allowing children of poor families to move to higher social levels and income.[110] The second track was a free boarding school for the Christians, the Enderûn,[111] which recruited 3,000 students annually from Christian boys between eight and twenty years old from one in forty families among the communities settled in Rumelia or the Balkans, a process known as Devshirme (Devşirme).[112]",
			"color": " "
		}
	}
}
