{
	"add": {
		"doc": {
			"id": "a03c8ca2e9f2046804c1cd18e9163497c2ac4237761b156ad42f9bb307046c57",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Stefansson-Anderson-Dog-Sleds.jpeg/260px-Stefansson-Anderson-Dog-Sleds.jpeg",
				"previous": "The ship spent most of April and May 1913 undergoing repairs and refitting at the dockyard in Esquimalt. When Bartlett arrived in early June he immediately ordered further repair work.[8] In addition to Karluk, Stefansson had purchased sight unseen a small gasoline-driven schooner, Alaska, to act as a supply ship for the largely land-based Southern Party. He later added a second schooner, Mary Sachs, when the hold space in Alaska proved inadequate.[26] In the confusion surrounding the expedition's departure, McKinlay notes, no attempt was made to align men or equipment to their appropriate ships. Thus anthropologists Henri Beuchat and Diamond Jenness, both designated for the Southern Party, found themselves sailing with Karluk, while their equipment was on board Alaska. McKinlay himself, aboard Karluk as magnetic observer, discovered that most of his equipment was with Alaska. Stefansson insisted that all would be sorted out when the ships reached their Herschel Island rendezvous. \"Heaven help us all if we failed to reach Herschel Island\", McKinlay wrote.[27]",
				"after": "Karluk left Esquimalt on 17 June 1913, sailing north towards Alaska. The immediate destination was Nome, on the coast of the Bering Sea. There was trouble from the beginning with the steering gear and with the engines, both of which needed frequent attention. On 2 July Karluk reached the Bering Sea in mist, fog and rapidly falling temperatures; six days later she arrived at Nome where she joined Alaska and Mary Sachs.[28] While the ships were being loaded in Nome, some of the scientists pressed for a meeting with the leader to clarify plans, particularly with regard to the Northern Party whose schedule was vague. The meeting was unsatisfactory. Stefansson's attitude offended several of the men, some of whom threatened to leave the expedition. They had read press reports in which Stefansson had apparently said that he expected Karluk to be crushed, and that the lives of the staff were secondary to the scientific work. Stefansson would not explain these matters, nor give further details of his plans for the Northern Party. Despite the scientists' alarm and dissatisfaction, none resigned.[11][29]",
			"color": " "
		}
	}
}
