{
	"add": {
		"doc": {
			"id": "a0458fe8dda3eff92318e05843e3ec8582eb8fe0815d9fd2e4a244b084d72e4d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Diomedea_epomophora_portrait_-_SE_Tasmania.jpg/220px-Diomedea_epomophora_portrait_-_SE_Tasmania.jpg",
			"previous": [],
				"after": "The albatrosses are a group of large to very large birds; they are the largest of the procellariiformes. The bill is large, strong and sharp-edged, the upper mandible terminating in a large hook. This bill is composed of several horny plates, and along the sides are the two \"tubes\", long nostrils that give the order its former name. The tubes of all albatrosses are along the sides of the bill, unlike the rest of the Procellariiformes where the tubes run along the top of the bill. These tubes allow the albatrosses to measure the exact airspeed in flight; the nostrils are analogous to the pitot tubes in modern aircraft. The albatross needs accurate airspeed measurement in order to perform dynamic soaring. The main food-locating sense is eyesight, although, like other Procellariiformes, they use their olfactory ability while foraging to locate potential food sources.[13] The feet have no hind toe and the three anterior toes are completely webbed. The legs are strong for Procellariiformes, in fact, almost uniquely amongst the order in that they and the giant petrels are able to walk well on land.[14]",
			"color": "gainsboro|0.10124 linen|0.095955 white|0.089246 smoke|0.089246 light|0.082596 gray|0.082596 light|0.082596 grey|0.082596 sea|0.080955 shell|0.080955 floral|0.073098 white|0.073098 snow|0.070549 old|0.06731 lace|0.06731 mint|0.066243 cream|0.066243 white|0.059355 ghost|0.04065 white|0.04065 ivory|0.039236 silver|0.02629 misty|0.019853 rose|0.019853 azure|0.01539 lavender|0.0142 blush|0.0142 rosy|0.012625 brown|0.012625 dark|0.012259 gray|0.012259 dark|0.012259 grey|0.012259 alice|0.009761 blue|0.009761 antique|0.0073097 white|0.0073097 tan|0.0035617  "
		}
	}
}
