{
	"add": {
		"doc": {
			"id": "a04938c845387e2aa7774bb64ba6bc82c45355b291ea07b6e5e3565cdc2e976d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/South-west_tower%2C_Warkworth_Castle_-_geograph.org.uk_-_1805960.jpg/170px-South-west_tower%2C_Warkworth_Castle_-_geograph.org.uk_-_1805960.jpg",
				"previous": "The Lion Tower was the entrance to the north end of the great hall. Above the archway through the tower were displayed heraldic items, symbolic of the Percy earls' power. The lion at the bottom was the emblem of the earls. Though now much damaged, above the lion were the ancient arms of the family and the arms of the Lucy family, whose property the Percys had inherited in the 1380s. As the tower was entered from the bailey, on the right was a doorway leading to the incomplete collegiate church. To the left was the great hall, and beyond that, withdrawing chambers; to the right were the buttery, pantry, larder, and kitchen. Immediately north of the kitchen was a postern tower. Built around 1200, its upper floors were later reused for accommodation.[50] An entrance of lesser status than the main gatehouse, the gate's position next to the kitchen suggests it was a tradesmen's entrance, used for conveying supplies to the castle.[51]",
				"after": "The square Little Stair Tower was the entrance from the bailey to the withdrawing rooms south of the great hall.[52] At ground floor level there was a doorway in each of the tower's faces. Directly south of the east side of the tower was the castle's chapel. The northern door led to the great hall, and the western door to a cellar under the great chamber. There are only fragmentary remains of the spiral staircase. Above the passageway was a single room, of uncertain purpose: it may have been used as another chapel, a guest room,[53] or an antechamber where guests would wait before being admitted into the earl's presence.[52]",
			"color": "dark|0.4352 olive|0.4352 green|0.4352 tan|0.18696 dark|0.070897 gray|0.070897 dark|0.070897 grey|0.070897 silver|0.053984 black|0.049179 burly|0.033342 wood|0.033342 gray|0.030852 grey|0.030852 antique|0.020768 white|0.020768 peach|0.019135 puff|0.019135 bisque|0.016502 light|0.011914 gray|0.011914 light|0.011914 grey|0.011914 wheat|0.010848 dim|0.0092378 gray|0.0092378 dim|0.0092378 grey|0.0092378 blanched|0.0088327 almond|0.0088327  "
		}
	}
}
