{
	"add": {
		"doc": {
			"id": "a04f4188eb726c08507c7282e6170fd24674891669d918f9beb4221a2f03fa6d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/243_WSSM_Olympic_Arms_AR15.jpg/220px-243_WSSM_Olympic_Arms_AR15.jpg",
				"previous": "Gun usage in hunting is typically regulated by game category, area within the state, and time period. Regulations for big-game hunting often specify a minimum caliber or muzzle energy for firearms. The use of rifles is often banned for safety reasons in areas with high population densities or limited topographic relief. Regulations may also limit or ban the use of lead in ammunition because of environmental concerns. Specific seasons for bow hunting or muzzle-loading black-powder guns are often established to limit competition with hunters using more effective weapons.",
				"after": "Hunting in the United States is not associated with any particular class or culture; a 2006 poll showed seventy-eight percent of Americans supported legal hunting,[25] although relatively few Americans actually hunt. At the beginning of the 21st century, just six percent of Americans hunted. Southerners in states along the eastern seaboard hunted at a rate of five percent, slightly below the national average, and while hunting was more common in other parts of the South at nine percent, these rates did not surpass those of the Plains states, where twelve percent of Midwesterners hunted. Hunting in other areas of the country fell below the national average.[26] Overall, in the 1996–2006 period, the number of hunters over the age of sixteen declined by ten percent, a drop attributable to a number of factors including habitat loss and changes in recreation habits.[27]",
			"color": "gray|0.31384 grey|0.31384 dim|0.24212 gray|0.24212 dim|0.24212 grey|0.24212 dark|0.23319 gray|0.23319 dark|0.23319 grey|0.23319 silver|0.065355 light|0.023541 gray|0.023541 light|0.023541 grey|0.023541 dark|0.017027 slate|0.017027 gray|0.017027 slate|0.014826 gray|0.014826 light|0.014504 slate|0.014504 gray|0.014504 black|0.013593 gainsboro|0.013098 light|0.0069253 steel|0.0069253 blue|0.0069253  "
		}
	}
}
