{
	"add": {
		"doc": {
			"id": "a061d2b5fc5e8aea441e7704d037bbaa8a1b9e980243cff009b6fe52f08af761",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Poole.sunseeker.arp.jpg/220px-Poole.sunseeker.arp.jpg",
				"previous": "Poole's economy is more balanced than the rest of Dorset.[52] In the 1960s prosperity was fuelled by growth in the manufacturing sector, whereas the 1980s and 1990s saw expansion in the service sector as office based employers relocated to the area.[52] The importance of manufacturing has declined since the 1960s but still employed approximately 17% of the workforce in 2002 and remains more prominent than in the economy of Great Britain as a whole.[52] Sunseeker, the world's largest privately owned builder of motor yachts and the UK's largest manufacturer, is based in Poole and employs over 1,800 people in its Poole shipyards.[61] It was estimated in 2004 that Sunseeker generates £160 million for the local economy.[62] Other major employers in the local manufacturing industry include Sealed Air, Hamworthy Heating, Hamworthy Combustion, Lush, Mathmos, Penske Cars Ltd (who build racing cars for Penske Racing), Kerry Foods, Transmission Developments, Precision Disc Casting, Siemens, Southernprint and Ryvita. Poole has the largest number of industrial estates in South East Dorset, including the Nuffield Industrial estate, Mannings Heath, Arena Business Park, Poole Trade Park and the Branksome Business Centre.[63]",
				"after": "The service sector is the principal economy of Poole; a large number of employees work for the service economy of local residents or for the tourist economy. During the 1970s, Poole's less restrictive regional planning policies attracted businesses wishing to relocate from London.[52] These included employers in the banking and financial sector, such as Barclays Bank (who operate a regional headquarters in Poole), American Express Bank and the corporate trust division of Bank of New York Mellon. Other important service sector employers include Link House Publications, the national headquarters and Lifeboat College of the Royal National Lifeboat Institution (RNLI), the UK headquarters of Fitness First, Bournemouth University and Poole NHS Primary Care Trust. Poole is also the headquarters for clothing company Animal, cosmetics manufacturer, Lush, and Merlin Entertainments, the world's second-largest theme park operator after Disney.[64] The Dolphin Shopping Centre is Poole's main retail area, and the largest indoor shopping centre in Dorset.[65] It opened in 1969 as an Arndale Centre, and underwent three major refurbishments in 1980, 1989 and 2004. The centre provides 47,000 square metres (510,000 sq ft) of retail space with 110 stores and two multi-storey car parks with 1,400 parking spaces. A pedestrianised high street containing shops, bars, public houses and restaurants connects the Dolphin Centre with the historic Old Town area and Poole Quay.[65] Tourism is important to the Poole's economy and was worth an estimated £158 million in 2002.[52] Poole's Harbour, Quay, Poole Pottery and the beaches are some of the main attractions for visitors.[45] Visitor accommodation consists of hotels, guest houses and bed and breakfast rooms located around the town, particularly in Sandbanks and the town centre. Rockley Park, a large caravan site in Hamworthy, is owned and operated by Haven and British Holidays.[66]",
			"color": "gray|0.25867 grey|0.25867 dark|0.13501 gray|0.13501 dark|0.13501 grey|0.13501 dim|0.13329 gray|0.13329 dim|0.13329 grey|0.13329 black|0.11568 light|0.10865 slate|0.10865 gray|0.10865 slate|0.056194 gray|0.056194 silver|0.037387 dark|0.032615 slate|0.032615 gray|0.032615 light|0.02195 gray|0.02195 light|0.02195 grey|0.02195 gainsboro|0.016176 light|0.0075297 steel|0.0075297 blue|0.0075297 white|0.0058549 smoke|0.0058549 mint|0.0053162 cream|0.0053162 azure|0.0049689 alice|0.0045893 blue|0.0045893 light|0.0044157 blue|0.0044157 light|0.0040643 cyan|0.0040643  "
		}
	}
}
