{
	"add": {
		"doc": {
			"id": "a07ed46c0476e488e91a7fdfbba70d0972bdc08a3c3b8a7b362fd41361f6e6c3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Thescelosaurus_neglectus%2C_CMN.jpg/220px-Thescelosaurus_neglectus%2C_CMN.jpg",
				"previous": "Other remains of similar animals were found throughout the late 19th century and 20th century. Another well-preserved skeleton from the slightly older Horseshoe Canyon Formation, in Alberta, Canada, was named T. warreni by William Parks in 1926.[33] This skeleton had notable differences from T. neglectus, and so Charles M. Sternberg placed it in a new genus, Parksosaurus, in 1937.[34] Sternberg also named an additional species, T. edmontonensis, based on another articulated skeleton, this time including a partial skull (NMC 8537), and drew attention to the genus' heavy build and thick bones. Due to these differences from the regular light hypsilophodont build, he suggested that the genus warranted its own subfamily, Thescelosaurinae.[9] T. edmontonensis has, since Peter Galton's 1974 review, generally been considered a more robust individual (possibly the opposite sex of the type individual)[5] of T. neglectus.[3][25] However, Boyd and colleagues found that they could not assign it to either of their valid species of Thescelosaurus and regarded the specimen as of uncertain placement within the genus.[1] The other point of contention regarding T. edmontonensis is its ankle, which Galton claimed was damaged and misinterpreted, but which was regarded by William J. Morris (1976) as truly different from T. neglectus.[7]",
				"after": "In his paper, Morris described a specimen (SDSM 7210) consisting of a partial skull with heavy ridges on the lower jaw and cheek, four partial vertebrae, and two finger bones as an unidentified species of Thescelosaurus, from the late Maastrichtian-age Hell Creek Formation of Harding County, South Dakota, USA. He drew attention to its premaxillary teeth and deeply inset toothline which he interpreted as supporting the presence of muscular cheeks. Morris also pointed out the outwardly flaring premaxilla (which would have given it a wide beak) and large palpebrals.[7] This skull was recognized as an unnamed hypsilophodont for many years,[25] until Galton made it the type specimen of new genus and species Bugenasaura infernalis (\"large-cheeked lizard belonging to the lower regions\", infernalis being a reference to the Hell Creek Formation).[35] Morris also named a new possible species of Thescelosaurus for specimen LACM 33542: ?T. garbanii (with a question mark because he was uncertain that it belonged to the genus). LACM 33542 comprised a large partial hindlimb (\"a third larger than described specimens of T. neglectus and Parksosaurus or nearly twice as large as Hypsilophodon\") including a foot, tarsus, shin bones, and partial thigh bone, along with five cervical (neck) and eleven dorsal (back) vertebrae, from the Hell Creek Formation of Garfield County, Montana, USA. The specimen was discovered by amateur paleontologist Harley Garbani, hence the name. T. garbanii would have been about 4.5 meters (15 feet) long, greater than average specimens of T. neglectus. Aside from the size, Morris drew attention to the way the ankle was constructed, which he considered to be unique except in comparison with Thescelosaurus edmontonensis, which he regarded as a separate species. Because Morris believed that the ankles of T. garbanii compared favorably to those of T. edmontonensis, he tentatively assigned it to Thescelosaurus.[7] However, the scientific literature has favored Galton's view that T. edmontonensis was not different from T. neglectus (see above). In the same paper that he described Bugenasaura, Galton demonstrated that the features Morris had thought connected T. garbanii and T. edmontonensis were the result of damage to the latter's ankle, so T. garbanii could also be considered distinct from Thescelosaurus. To better accommodate this species, Galton suggested that it belonged to his new genus Bugenasaura as B. garbanii, although he also noted that it could be belong to the similarly sized pachycephalosaurid Stygimoloch, or be part of a third, unknown dinosaur.[35]",
			"color": "black|0.93521  "
		}
	}
}
