{
	"add": {
		"doc": {
			"id": "a081c19e25a1dc2b18f867c1ec1fce0f8cf30ed417e02f26fad5c4dbc7c9dfe2",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Everglades_National_Park_Florida_Panther.jpg/170px-Everglades_National_Park_Florida_Panther.jpg",
				"previous": "Hammocks are often the only dry land within the park. They rise several inches above the grass-covered river, and are dominated by diverse plant life consisting of subtropical and tropical trees, such as large southern live oaks (Quercus virginiana). Trees often form canopies under which animals thrive amongst scrub bushes of wild coffee (Psychotria), white indigoberry (Randia aculeata), poisonwood (Metopium toxiferum) and saw palmetto (Serenoa repens). The park features thousands of these tree islands amid sloughs—which often form the shape of a teardrop when seen from above (see park map) because of the slowly moving water around them—but they can also be found in pineland and mangroves. Trees in the Everglades, including wild tamarind (Lysiloma latisiliquum) and gumbo-limbo (Bursera simaruba), rarely grow higher than 50 feet (15 m) due to wind, cold weather, and lightning strikes.[27][28]",
				"after": "The plant growth around the hammock base is nearly impenetrable; however, beneath the canopy hammocks are an ideal habitat for animals. Reptiles (such as various species of snake and anole) and amphibians (such as the American green tree frog, Hyla cinerea), find their homes in the hardwood hammocks. Birds such as barred owls (Strix varia), woodpeckers, northern cardinals (Cardinalis cardinalis), and southern bald eagles (Haliaeetus leucocephalus) nest in hammock trees. Mammal species living in hardwood hammocks include opossums (Didelphis virginiana), raccoons (Procyon lotor), bobcats (Lynx rufus), Everglades mink (Neovison vison), marsh rabbits (Sylvilagus palustris), white-tailed deer (Odocoileus virginianus), and the rare, critically endangered Florida panther (Puma concolor coryi).[27]",
			"color": "dim|0.1115 gray|0.1115 dim|0.1115 grey|0.1115 dark|0.10291 gray|0.10291 dark|0.10291 grey|0.10291 dark|0.09129 sea|0.09129 green|0.09129 gray|0.082184 grey|0.082184 silver|0.065251 dark|0.058122 slate|0.058122 gray|0.058122 light|0.040247 gray|0.040247 light|0.040247 grey|0.040247 gainsboro|0.029596 light|0.028661 golden|0.028661 rod|0.028661 yellow|0.028661 slate|0.027446 gray|0.027446 white|0.021062 smoke|0.021062 lemon|0.018459 chiffon|0.018459 sea|0.017683 shell|0.017683 snow|0.017123 floral|0.017071 white|0.017071 pale|0.016677 golden|0.016677 rod|0.016677 light|0.015925 slate|0.015925 gray|0.015925 mint|0.015889 cream|0.015889 white|0.015741 ghost|0.014798 white|0.014798 light|0.014682 yellow|0.014682 alice|0.0139 blue|0.0139 azure|0.012367 light|0.011779 steel|0.011779 blue|0.011779 linen|0.011607 beige|0.011427 ivory|0.010661 corn|0.010153 silk|0.010153 lavender|0.0098344 blush|0.0098344 old|0.0091603 lace|0.0091603 tan|0.0085245 lavender|0.0075688 papaya|0.0068869 whip|0.0068869 wheat|0.0068236 dark|0.0068196 khaki|0.0068196 antique|0.0066716 white|0.0066716  "
		}
	}
}
