{
	"add": {
		"doc": {
			"id": "a08a5d350f97f4b318a681d2342980c7c2925c22ddb15d36551712b56c692ce0",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/ClintonLjubljana.JPG/220px-ClintonLjubljana.JPG",
				"previous": "Shortly after he took office, conservative newspaper owner Richard Mellon Scaife organized a fundraising campaign to smear Clinton's image in the media.[188] Leading the Arkansas Project, Scaife and other associates sought to find sources in Clinton's home state of Arkansas who would be willing to dish out negative allegations against the President.[188]",
				"after": "In 1994, Paula Jones brought a sexual harassment lawsuit against Clinton, claiming he made unwanted advances in 1991, which he denied. In April 1998, the case was initially dismissed by Republican Judge Susan Webber Wright as lacking legal merit.[189] But Jones appealed Webber Wright's ruling, and her suit gained traction following Clinton's admission to having an affair with Monica Lewinsky in August 1998.[190] In 1998 lawyers for Paula Jones released court documents contending a pattern of sexual harassment by then Governor Clinton. Main lawyer for the President, Robert S. Bennett, called the filing \"an organized campaign to smear the President of the United States\".[191] He later agreed to an out-of-court settlement and paid $850,000.[192] Bennett, however, stated that the President only made the settlement so he could end the lawsuit for good and move on with his life.[193] During the deposition for the Jones lawsuit, which was held at the White House,[194] Clinton denied having sexual relations with Monica Lewinsky – a denial that became the basis for an impeachment charge of perjury.[195]",
			"color": "black|0.28615 gray|0.18168 grey|0.18168 dim|0.16648 gray|0.16648 dim|0.16648 grey|0.16648 rosy|0.097273 brown|0.097273 dark|0.071305 gray|0.071305 dark|0.071305 grey|0.071305 slate|0.064603 gray|0.064603 light|0.052068 slate|0.052068 gray|0.052068 saddle|0.015359 brown|0.015359 peru|0.011191  "
		}
	}
}
