{
	"add": {
		"doc": {
			"id": "a08eaea2e78b91084d58c0579ae9655b623f43d99264b0305edd04291ed034b3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/ColumbiaRGorgePano.jpg/220px-ColumbiaRGorgePano.jpg",
				"previous": "The river and its drainage basin experienced some of the world's greatest known catastrophic floods toward the end of the last ice age. The periodic rupturing of ice dams at Glacial Lake Missoula resulted in the Missoula Floods, with discharges 10 times the combined flow of all the rivers of the world, dozens of times over thousands of years.[29] The exact number of floods is unknown, but geologists have documented at least 40; evidence suggests that they occurred between about 19,000 and 13,000 years ago.[30]",
				"after": "The floodwaters rushed across eastern Washington, creating the channeled scablands, which are a complex network of dry canyon-like channels, or coulees that are often braided and sharply gouged into the basalt rock underlying the region's deep topsoil. Numerous flat-topped buttes with rich soil stand high above the chaotic scablands.[28][31] Constrictions at several places caused the floodwaters to pool into large temporary lakes, such as Lake Lewis, in which sediments were deposited. Water depths have been estimated at 1,250 feet (380 m) at Wallula Gap, 830 feet (250 m) at Bonneville Dam, and 400 feet (120 m) over modern Portland, Oregon.[32] Sediments were also deposited when the floodwaters slowed in the broad flats of the Quincy, Othello, and Pasco Basins.[31] The floods' periodic inundation of the lower Columbia River Plateau deposited rich sediments; 21st-century farmers in the Willamette Valley \"plow fields of fertile Montana soil and clays from Washington's Palouse\".[33]",
			"color": "dim|0.26714 gray|0.26714 dim|0.26714 grey|0.26714 gray|0.17944 grey|0.17944 slate|0.13485 gray|0.13485 black|0.13145 light|0.095326 slate|0.095326 gray|0.095326 dark|0.057918 olive|0.057918 green|0.057918 light|0.049682 steel|0.049682 blue|0.049682 dark|0.022942 slate|0.022942 gray|0.022942 dark|0.018584 gray|0.018584 dark|0.018584 grey|0.018584  "
		}
	}
}
