{
	"add": {
		"doc": {
			"id": "a0914cbe5fc4618d97387380277245232e1c396c201d9bc63619c73057d0f4ff",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Wielangta_Unidentified_Fungus_5164.jpg/220px-Wielangta_Unidentified_Fungus_5164.jpg",
				"previous": "Armillaria luteobubalina has been recorded in southeastern Australia, from the southeastern corner of Queensland through eastern New South Wales and across Victoria into southeastern South Australia. It also occurs in Tasmania and southwestern Western Australia.[14] Those of the karri forests (consisting largely of the species E. diversicolor) of the southwest have paler and yellower caps than those in the jarrah forests (which contain predominantly Eucalyptus marginata) further north.[15] The fruit bodies arise on wood, especially on stumps or around the base of trees, and often in huge numbers. They usually appear between April and July, although most production occurs in the second half of May.[21] Abundant in woodlands, it can invade gardens and orchards, where it can attack many woody plants.[19][22] The honey fungus infected and killed many plants near tuart trees (Eucalyptus gomphocephala) which had been cut down near Kings Park in suburban Perth.[15] Armillaria luteobubalina is commonly found in eucalyptus forests in Australia,[1][21] and is thought to be the most pathogenic and most widespread Armillaria species in the major western Australian forest types.[23][24] The mushroom has also been reported from southern South America, in Argentina and Chile.[7] A 2003 study of the molecular phylogenetics and pattern of its distribution in South America and Australia indicate that A. luteobubalina is an ancient species, originating before the separation of the precursor supercontinent Gondwana. Genetic differences between isolates in the South American and Australian populations indicate a long period of geographical separation, and the authors suggest that they \"later might be regarded as independent taxa\".[11]",
				"after": "Trees that are infected by A. luteobubalina show characteristic symptoms both above and below ground. Above the ground, the base of the tree develops inverted V-shaped lesions, and the infected wood undergoes white rot, a fungal wood decay process where the cellulose and lignin of the sapwood are both broken down, leaving the wood stringy. The bark of the stem dies and becomes discoloured up to 3 m (10 ft) above the ground. Clusters of fruit bodies appear at the base of the tree in autumn. Crowns may show gradual deterioration, or tree death may occur suddenly. Below the ground, characteristic symptoms of infections include rotting the ends of tree roots, white-rotted sapwood, and the presence of fan-shaped areas of white mycelium below dead or infected bark.[16]",
			"color": "dark|0.31494 golden|0.31494 rod|0.31494 golden|0.22165 rod|0.22165 burly|0.21199 wood|0.21199 tan|0.081911 peru|0.04878 khaki|0.014634 saddle|0.013415 brown|0.013415  "
		}
	}
}
