{
	"add": {
		"doc": {
			"id": "a0a1e15babbebbd094e8bfbf47ed659d292706d1eb84659dfa894c87d5bb6717",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Upper_Pine_Bottom_State_Park.JPG/170px-Upper_Pine_Bottom_State_Park.JPG",
				"previous": "Upper Pine Bottom State Park traces its existence to the early 1920s, when the Pennsylvania Department of Forestry built 31 campsites on state forest land between 1921 and 1925. The park was originally established as \"Upper Pine Bottom Class B Public Camp\" and named for the stream that flows through it. Class B camps were on secondary highways and were \"used primarily by hikers, hunters, fishermen, vacationists, and picknickers who desire to go far into the woods and make their stay comfortable\".[12] Each Class B camp had a lean-to shelter for camping, potable water, picnic tables, a fireplace, garbage can, and a latrine. There was no charge to use any of the camps, but stays were limited to two consecutive nights.[28]",
				"after": "During the Great Depression, the Civilian Conservation Corps (CCC) set up nine camps in Tiadaghton State Forest. The camps included two near Upper Pine Bottom State Park: CCC Camp S-82-Pa (Waterville, also known as Haneyville) was on Upper Pine Bottom Run about 2.5 miles (4.0 km) west of the park and operated from May 1933 to 1941;[29] CCC Camp S-129-Pa (Little Pine) was at the site of nearby Little Pine State Park and operated from 1933 to 1937.[30][31] The CCC planted large numbers of trees in the state forest, did work in the park, and built a pavilion at the site in 1936.[32] Although the roof of a structure was still visible in the park in a 1959 aerial photo,[33][b] as of 2009 there are no pavilions or other buildings in the park.[2] The United States' entry into the Second World War led to the end of the CCC and all its camps were closed by the summer of 1942.[34]",
			"color": "dark|0.12974 gray|0.12974 dark|0.12974 grey|0.12974 light|0.10409 slate|0.10409 gray|0.10409 slate|0.10382 gray|0.10382 lavender|0.10346 dim|0.091459 gray|0.091459 dim|0.091459 grey|0.091459 light|0.086645 steel|0.086645 blue|0.086645 gray|0.078955 grey|0.078955 silver|0.056486 alice|0.033247 blue|0.033247 light|0.026859 gray|0.026859 light|0.026859 grey|0.026859 ghost|0.024212 white|0.024212 white|0.02011 smoke|0.02011 gainsboro|0.019114 azure|0.016983 snow|0.01601 white|0.015628 mint|0.013883 cream|0.013883 lavender|0.011912 blush|0.011912 sea|0.010052 shell|0.010052 floral|0.0088538 white|0.0088538  "
		}
	}
}
