{
	"add": {
		"doc": {
			"id": "a0aaf5bd9132cb14115e35dbea41cc7357fd40c0e6750dfa610e7f07ef709764",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Lophopsittacus_fossils.jpg/220px-Lophopsittacus_fossils.jpg",
				"previous": "Species that are morphologically similar to the broad-billed parrot, such as the hyacinth macaw and the palm cockatoo, may provide insight into its ecology. Anodorhynchus macaws, which are habitual ground dwellers, eat very hard palm nuts.[5] Carlos Yamashita has suggested that these macaws once depended on now-extinct South American megafauna to eat fruits and excrete the seeds, and that they later relied on domesticated cattle to do this. Similarly, in Australasia the palm cockatoo feeds on undigested seeds from cassowary droppings.[5] Yamashita suggested that the abundant Cylindraspis tortoises and dodos performed the same function on Mauritius, and that the broad-billed parrot, with its macaw-like beak, depended on them to obtain cleaned seeds.[26] Many types of palms and palm-like plants on Mauritius produce hard seeds that the broad-billed parrot may have eaten, including Latania loddigesii, Mimusops maxima, Sideroxylon grandiflorum, Diospyros egrettorium, and Pandanus utilis.[5]",
				"after": "On the basis of radiographs, D. T. Holyoak claimed that the mandible of the broad-billed parrot was weakly constructed and suggested that it would have fed on soft fruits rather than hard seeds.[27] As evidence, he pointed out that the internal trabeculae were widely spaced, that the upper bill was broad whereas the palatines were narrow, and the fact that no preserved upper rostrum had been discovered, which he attributed to its delicateness.[28] G. A. Smith, however, pointed out that the four genera Holyoak used as examples of \"strong jawed\" parrots based on radiographs, Cyanorhamphus, Melopsittacus, Neophema and Psephotus, actually have weak jaws in life, and that the morphologies cited by Holyoak do not indicate strength.[29] Hume has since pointed out that the mandible morphology of the broad-billed parrot is comparable to that of the largest living parrot, the hyacinth macaw, which cracks open palm nuts with ease. It is therefore probable that the broad-billed parrot fed in the same manner.[30]",
			"color": "gainsboro|0.078933 linen|0.071429 white|0.071363 smoke|0.071363 dark|0.070798 gray|0.070798 dark|0.070798 grey|0.070798 sea|0.067795 shell|0.067795 floral|0.065123 white|0.065123 snow|0.06381 old|0.062231 lace|0.062231 mint|0.061296 cream|0.061296 light|0.058268 gray|0.058268 light|0.058268 grey|0.058268 silver|0.057567 white|0.055756 gray|0.048175 grey|0.048175 dim|0.04678 gray|0.04678 dim|0.04678 grey|0.04678 ivory|0.034539 ghost|0.030487 white|0.030487 black|0.016002 lavender|0.01323 blush|0.01323 azure|0.0067887 antique|0.0047776 white|0.0047776 honeydew|0.0038243 alice|0.0037696 blue|0.0037696 slate|0.0035462 gray|0.0035462  "
		}
	}
}
