{
	"add": {
		"doc": {
			"id": "b74c36fa498dcb98463cba708126edb2c29f8f415e2f9a293f4866efe7d8ece8",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Red_Lory_%28Eos_bornea%29-6.jpg/170px-Red_Lory_%28Eos_bornea%29-6.jpg",
				"previous": "Plumage is regularly moulted; the standard plumage of a bird that has moulted after breeding is known as the \"non-breeding\" plumage, or—in the Humphrey-Parkes terminology—\"basic\" plumage; breeding plumages or variations of the basic plumage are known under the Humphrey-Parkes system as \"alternate\" plumages.[92] Moulting is annual in most species, although some may have two moults a year, and large birds of prey may moult only once every few years. Moulting patterns vary across species. In passerines, flight feathers are replaced one at a time with the innermost primary being the first. When the fifth of sixth primary is replaced, the outermost tertiaries begin to drop. After the innermost tertiaries are moulted, the secondaries starting from the innermost begin to drop and this proceeds to the outer feathers (centrifugal moult). The greater primary coverts are moulted in synchrony with the primary that they overlap.[93] A small number of species, such as ducks and geese, lose all of their flight feathers at once, temporarily becoming flightless.[94] As a general rule, the tail feathers are moulted and replaced starting with the innermost pair.[93] Centripetal moults of tail feathers are however seen in the Phasianidae.[95] The centrifugal moult is modified in the tail feathers of woodpeckers and treecreepers, in that it begins with the second innermost pair of feathers and finishes with the central pair of feathers so that the bird maintains a functional climbing tail.[93][96] The general pattern seen in passerines is that the primaries are replaced outward, secondaries inward, and the tail from center outward.[97] Before nesting, the females of most bird species gain a bare brood patch by losing feathers close to the belly. The skin there is well supplied with blood vessels and helps the bird in incubation.[98]",
				"after": "Feathers require maintenance and birds preen or groom them daily, spending an average of around 9% of their daily time on this.[99] The bill is used to brush away foreign particles and to apply waxy secretions from the uropygial gland; these secretions protect the feathers' flexibility and act as an antimicrobial agent, inhibiting the growth of feather-degrading bacteria.[100] This may be supplemented with the secretions of formic acid from ants, which birds receive through a behaviour known as anting, to remove feather parasites.[101]",
			"color": "black|0.18704 crimson|0.16874 firebrick|0.15864 brown|0.097482 maroon|0.086577 dark|0.047339 slate|0.047339 blue|0.047339 dark|0.042955 red|0.042955 chocolate|0.026089 dim|0.025317 gray|0.025317 dim|0.025317 grey|0.025317 slate|0.025037 blue|0.025037 midnight|0.014938 blue|0.014938  "
		}
	}
}
