{
	"add": {
		"doc": {
			"id": "b74cbe8141963fa3d6e266e362723284257aebcb333431bc10ce9bade5a83808",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Owen_geologic_timescale.png/220px-Owen_geologic_timescale.png",
				"previous": "Later in the 18th century, the French philosopher Georges-Louis Leclerc, Comte de Buffon, one of the leading naturalists of the time, suggested that what most people referred to as species were really just well-marked varieties, modified from an original form by environmental factors. For example, he believed that lions, tigers, leopards and house cats might all have a common ancestor. He further speculated that the 200 or so species of mammals then known might have descended from as few as 38 original animal forms. Buffon's evolutionary ideas were limited; he believed each of the original forms had arisen through spontaneous generation and that each was shaped by \"internal moulds\" that limited the amount of change. Buffon's works, Histoire naturelle (1749–1789) and Époques de la nature (1778), containing well-developed theories about a completely materialistic origin for the Earth and his ideas questioning the fixity of species, were extremely influential.[40][41] Another French philosopher, Denis Diderot, also wrote that living things might have first arisen through spontaneous generation, and that species were always changing through a constant process of experiment where new forms arose and survived or not based on trial and error; an idea that can be considered a partial anticipation of natural selection.[42] Between 1767 and 1792, James Burnett, Lord Monboddo, included in his writings not only the concept that man had descended from primates, but also that, in response to the environment, creatures had found methods of transforming their characteristics over long time intervals.[43] Charles Darwin's grandfather, Erasmus Darwin, published Zoonomia (1794–1796) which suggested that \"all warm-blooded animals have arisen from one living filament.\"[44] In his poem Temple of Nature (1803), he described the rise of life from minute organisms living in mud to all of its modern diversity.[45]",
			"after": [],
			"color": " "
		}
	}
}
