{
	"add": {
		"doc": {
			"id": "b75193cfd5d8ef98302437a09c8251ce4e8f51569d9ffc69dd38bed8edeb050d",
			"url": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Kepler_conjecture_2.jpg",
				"previous": "After hearing of Galileo's telescopic discoveries, Kepler also started a theoretical and experimental investigation of telescopic optics using a telescope borrowed from Duke Ernest of Cologne.[45] The resulting manuscript was completed in September 1610 and published as Dioptrice in 1611. In it, Kepler set out the theoretical basis of double-convex converging lenses and double-concave diverging lenses—and how they are combined to produce a Galilean telescope—as well as the concepts of real vs. virtual images, upright vs. inverted images, and the effects of focal length on magnification and reduction. He also described an improved telescope—now known as the astronomical or Keplerian telescope—in which two convex lenses can produce higher magnification than Galileo's combination of convex and concave lenses.[46]",
				"after": "Around 1611, Kepler circulated a manuscript of what would eventually be published (posthumously) as Somnium [The Dream]. Part of the purpose of Somnium was to describe what practicing astronomy would be like from the perspective of another planet, to show the feasibility of a non-geocentric system. The manuscript, which disappeared after changing hands several times, described a fantastic trip to the moon; it was part allegory, part autobiography, and part treatise on interplanetary travel (and is sometimes described as the first work of science fiction). Years later, a distorted version of the story may have instigated the witchcraft trial against his mother, as the mother of the narrator consults a demon to learn the means of space travel. Following her eventual acquittal, Kepler composed 223 footnotes to the story—several times longer than the actual text—which explained the allegorical aspects as well as the considerable scientific content (particularly regarding lunar geography) hidden within the text.[47]",
			"color": " "
		}
	}
}
