{
	"add": {
		"doc": {
			"id": "b751db71c6af406585d758366678b8ee3ff6f0696be67bcaae235933e14d67f3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Mount_sion_beam_pump_radcliffe.jpg/220px-Mount_sion_beam_pump_radcliffe.jpg",
				"previous": "The transformation of the area from an industry based upon water power, to one based upon steam power, may not have been without problems. A story in W. Nicholl's History and Traditions of Radcliffe (1900) tells of a \"great crowd\" of protesters from Bury who marched on Bealey's Works, demanding that work be halted. James Booth ordered the gates closed, gave the ringleaders £5, and promised to halt work the next day. The crowd then marched on other businesses within the town before heading along the canal to Bolton, at which point they were apparently turned back by news of approaching soldiers.[32]",
				"after": "There were many smaller textile concerns in the parish. Thomas Howarth owned a cottage in Stand Lane from where he sent yarn to be dyed and sized. He made his own warps which were weaved in the town. He would then travel to Preston and Kendal where drapers would purchase his products. His nephews founded A. & J. Hoyle's Mill in Irwell Street, which employed power weaving to produce their specialities in Ginghams and shirting. The mill closed in 1968. Messrs Stott & Pickstone's Top Shop on Stand Lane was the first company to employ powered looms and spinning around 1844. Many of their employees would eventually leave to start their own businesses, such as Spider Mill, built by Robert and William Fletcher, and John Pickstone. This mill closed around 1930.[34]",
			"color": "dim|0.33479 gray|0.33479 dim|0.33479 grey|0.33479 black|0.15813 gray|0.10551 grey|0.10551 slate|0.064476 gray|0.064476 dark|0.052525 gray|0.052525 dark|0.052525 grey|0.052525 light|0.049837 slate|0.049837 gray|0.049837 silver|0.032746 light|0.025735 gray|0.025735 light|0.025735 grey|0.025735 light|0.024132 steel|0.024132 blue|0.024132 gainsboro|0.020302 white|0.012596 smoke|0.012596 dark|0.010765 slate|0.010765 gray|0.010765 snow|0.010311 sea|0.010224 shell|0.010224 lavender|0.0093953 white|0.0092513 floral|0.0088247 white|0.0088247 ghost|0.0086603 white|0.0086603 mint|0.0085127 cream|0.0085127  "
		}
	}
}
