{
	"add": {
		"doc": {
			"id": "b763c4f176a414f05479cc56182c26373a0d6006ee2a3df93880f29b768d6cc3",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Bundesarchiv_B_145_Bild-F009536-0002%2C_Staatspr%C3%A4sident_von_Pakistan_in_M%C3%BCnchen.jpg/220px-Bundesarchiv_B_145_Bild-F009536-0002%2C_Staatspr%C3%A4sident_von_Pakistan_in_M%C3%BCnchen.jpg",
				"previous": "The initial standard model was the 707-120 with JT3C turbojet engines. Qantas ordered a shorter body version called the 707-138, which was a −120 that had six fuselage frames removed, three in front of the wings, and three aft. The frames in the 707 were each 20 inches (500 mm) apart, so this resulted in a net shortening of 10 ft (3 m) to 134 ft 6 in (41.0 m). Because the maximum takeoff weight remained the same 247,000 lb (112 t) as that of the −120, the 138 was able to fly the longer routes that Qantas needed.[14] Braniff International Airways ordered the higher-thrust version with Pratt & Whitney JT4A engines, the 707-220. The final major derivative was the 707-320, which featured an extended-span wing and JT4A engines, while the 707-420 was the same as the −320 but with Conway turbofan engines. British certification requirements relating to engine-out go-arounds also forced Boeing to increase the height of the tail fin on all 707 variants, as well as add a ventral fin, which was retrofitted on earlier −120 and −220 aircraft. These modifications also aided in the mitigation of dutch roll by providing more stability in yaw.",
				"after": "Though initially fitted with turbojet engines, the dominant engine for the Boeing 707 family was the Pratt & Whitney JT3D, a turbofan variant of the JT3C with lower fuel consumption and higher thrust. JT3D-engined 707s and 720s were denoted with a \"B\" suffix. While many 707-120Bs and 720Bs were conversions of existing JT3C-powered machines, 707-320Bs were available only as newly built aircraft, as they had a stronger structure to support a maximum take-off weight increased by 19,000 lb (8,600 kg), along with modifications to the wing. The 707-320B series enabled non-stop westbound flights from Europe to the US west coast and from the US to Japan.",
			"color": " "
		}
	}
}
