{
	"add": {
		"doc": {
			"id": "b76b5e76b691c4042a9df5feb79ffaf0cbbf7ac2814e5c76c2f7fb2059fb1789",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/%E5%BA%B7%E7%86%99%E5%9D%90%E5%83%8F.jpg/220px-%E5%BA%B7%E7%86%99%E5%9D%90%E5%83%8F.jpg",
				"previous": "Yinreng proved to be unworthy of the succession despite his father showing favoritism towards him. He was said to have beaten and killed his subordinates, and was alleged to have had sexual relations with one of his father's concubines, which was deemed incest and a capital offence. Yinreng also purchased young children from Jiangsu to satisfy his pedophiliac pleasure. In addition, Yinreng's supporters, led by Songgotu, gradually formed a \"Crown Prince Party\" (太子黨), that aimed to help Yinreng get the throne as soon as possible, even if it meant using unlawful methods.",
				"after": "Over the years, Kangxi kept constant watch over Yinreng and became aware of his son's many flaws, while their relationship gradually deteriorated. In 1707, Kangxi decided that he could no longer tolerate Yinreng's behavior, which he partially mentioned in the imperial edict as \"never obeying ancestors' virtues, never obliged to my order, only doing inhumanity and devilry, only showing maliciousness and lust\",[20] and decided to strip Yinreng of his position as crown prince. Kangxi placed his oldest surviving son, Yinzhi, in charge of overseeing Yinreng's house arrest. Yinzhi, an unfavored Shu son, knowing he had no chance of being selected, recommended the eighth prince, Yinsi, and requested his father to order Yinreng's execution. Kangxi was enraged and stripped Yinzhi of his titles. Kangxi commanded his subjects to cease debating the succession issue, but despite this and attempts to reduce rumours and speculation as to who the new crown prince might be, the imperial court's daily activities were disrupted. Yinzhi's actions caused Kangxi to suspect that Yinreng might have been framed, so he restored Yinreng as crown prince in 1709, with the support of the 4th and 13th princes, and on the excuse that Yinreng had previously acted under the influence of mental illness.",
			"color": "peru|0.12724 burly|0.11387 wood|0.11387 sandy|0.11221 brown|0.11221 tan|0.10786 sienna|0.061183 black|0.036483 saddle|0.032404 brown|0.032404 chocolate|0.026928 peach|0.02559 puff|0.02559 brown|0.025367 navajo|0.024355 white|0.024355 wheat|0.023521 dark|0.021452 slate|0.021452 blue|0.021452 firebrick|0.019652 dim|0.018336 gray|0.018336 dim|0.018336 grey|0.018336 rosy|0.015862 brown|0.015862 bisque|0.015551 moccasin|0.015327 gray|0.014937 grey|0.014937 dark|0.013445 salmon|0.013445 antique|0.013179 white|0.013179 blanched|0.011548 almond|0.011548 dark|0.010927 gray|0.010927 dark|0.010927 grey|0.010927 papaya|0.0091802 whip|0.0091802  "
		}
	}
}
