{
	"add": {
		"doc": {
			"id": "b77cf0da459079bf4a3c4c0ca9a18690fc533fb5df9a0e958deaa14b5448cc26",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/1945-P-Jefferson-War-Nickel-Reverse.JPG/220px-1945-P-Jefferson-War-Nickel-Reverse.JPG",
				"previous": "In 1939, the Mint recut the hub for the nickel, sharpening the steps on Monticello, which had been fuzzy in initial strikings. Since then, a test for whether a nickel is particularly well struck has been whether all six steps appear clearly, with \"full step\" nickels more collectable.[12]",
				"after": "With the entry of the United States into World War II, nickel became a critical war material, and the Mint sought to reduce its use of the metal. On March 27, 1942, Congress authorized a nickel made of 50% copper and 50% silver, but gave the Mint the authority to vary the proportions, or add other metals, in the public interest. The Mint's greatest concern was in finding an alloy which would use no nickel, but still satisfy counterfeit detectors in vending machines. An alloy of 56% copper, 35% silver and 9% manganese proved suitable, and this alloy began to be coined into nickels from October 1942. In the hopes of making them easy to sort out and withdraw after the war, the Mint struck all \"war nickels\" with a large mint mark appearing above Monticello. The mint mark P for Philadelphia was the first time that mint's mark had appeared on a US coin. The prewar composition and smaller mint mark (or no mint mark for Philadelphia) were resumed in 1946. In a 2000 article in The Numismatist, Mark A. Benvenuto suggested that the amount of nickel saved by the switch was not significant to the war effort, but that the war nickel served as a ubiquitous reminder of the sacrifices that needed to be made for victory.[13]",
			"color": "gray|0.35312 grey|0.35312 dark|0.24337 gray|0.24337 dark|0.24337 grey|0.24337 dim|0.242 gray|0.242 dim|0.242 grey|0.242 silver|0.098966 light|0.033436 gray|0.033436 light|0.033436 grey|0.033436 gainsboro|0.018413  "
		}
	}
}
