{
	"add": {
		"doc": {
			"id": "b79f33ee428728e666946546d6f4445061a2cb39a62c23028ca983b941548567",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Critical-ionization-velocity.jpg/220px-Critical-ionization-velocity.jpg",
				"previous": "On February 1, 2003, Columbia disintegrated during re-entry, killing its crew of seven, because of damage to the carbon-carbon leading edge of the wing caused during launch. Ground control engineers had made three separate requests for high-resolution images taken by the Department of Defense that would have provided an understanding of the extent of the damage, while NASA's chief thermal protection system (TPS) engineer requested that astronauts on board Columbia be allowed to leave the vehicle to inspect the damage. NASA managers intervened to stop the Department of Defense's assistance and refused the request for the spacewalk,[94] and thus the feasibility of scenarios for astronaut repair or rescue by Atlantis were not considered by NASA management at the time.[95]",
			"after": [
				"Until another US manned spacecraft is ready, crews will travel to and from the International Space Station (ISS) exclusively aboard the Russian Soyuz spacecraft.",
				"A planned successor to STS was the \"Shuttle II\", during the 1980s and 1990s, and later the Constellation program during the 2004–2010 period. CSTS was a proposal to continue to operate STS commercially, after NASA.[106] In September 2011, NASA announced the selection of the design for the new Space Launch System that is planned to launch the Orion spacecraft and other hardware to missions beyond low earth-orbit.[107][108][109]"
			],
			"color": "black|0.66962 light|0.082932 steel|0.082932 blue|0.082932 light|0.072838 blue|0.072838 light|0.032751 slate|0.032751 gray|0.032751 slate|0.031647 gray|0.031647 powder|0.025382 blue|0.025382 dim|0.023012 gray|0.023012 dim|0.023012 grey|0.023012 dark|0.016266 gray|0.016266 dark|0.016266 grey|0.016266 dark|0.015629 slate|0.015629 gray|0.015629 gray|0.0093323 grey|0.0093323 silver|0.0080521 light|0.0046097 gray|0.0046097 light|0.0046097 grey|0.0046097  "
		}
	}
}
