{
	"add": {
		"doc": {
			"id": "b7a2408cc1d308298be32b72191738737afe2d3546ea15142cd7bf29aaea3495",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Tyrannosaurus_muscle_mass.png/170px-Tyrannosaurus_muscle_mass.png",
				"previous": "A study in 2007 used computer models to estimate running speeds, based on data taken directly from fossils, and claimed that Tyrannosaurus rex had a top running speed of 8 metres per second (29 km/h; 18 mph). An average professional football (soccer) player would be slightly slower, while a human sprinter can reach 12 metres per second (43 km/h; 27 mph). These computer models predict a top speed of 17.8 metres per second (64 km/h; 40 mph) for a 3-kilogram (6.6 lb) Compsognathus[105][106] (probably a juvenile individual).[107]",
				"after": "However in 2010, Scott Persons, a graduate student from the University of Alberta proposed that Tyrannosaurus's speed may have been enhanced by strong tail muscles.[108] He found that theropods such as T rex had certain muscle arrangements that are different from modern day birds and mammals but with some similarities to modern reptiles.[109] He concluded that the caudofemoralis muscles which link the tail bones and the upper leg bones could have assisted Tyrannosaurus in leg retraction and enhanced its running ability, agility and balance. The caudofemoralis muscle would have been a key muscle in femoral retraction; pulling back the leg at the femur.[108] The study also found that theropod skeletons such as those of Tyrannosaurus' had adaptations (such as elevated transverse processes in the tail vertebrae) to enable the growth of larger tail muscles and that Tyrannosaurus's tail muscle mass may have been underestimated by over 25 percent and perhaps as much as 45 percent. The caudofemoralis muscle was found to comprise 58 percent of the muscle mass in the tail of Tyrannosaurus. Tyrannosaurus also had the largest absolute and relative caudofemoralis muscle mass out of the three extinct organisms in the study. This is because Tyrannosaurus also had additional adaptations to enable large tail muscles; the elongation of its tail's hemal arches. According to Persons, the increase in tail muscle mass would have moved the center of mass closer to the hind quarters and hips which would have lessened the strain on the leg muscles to support its weight; improving its overall balance and agility. This would also have made the animal less front heavy, thus reducing rotational inertia. Persons also notes that the tail is also rich in tendons and septa which could have been stores of elastic energy, and thereby improved locomotive efficiency. Persons adds that this means that non-avian theropods actually had broader tails than previously depicted, as broad or broader laterally than dorsoventrally near the base.[108][109]",
			"color": "dark|0.12014 gray|0.12014 dark|0.12014 grey|0.12014 dark|0.11889 salmon|0.11889 gray|0.11625 grey|0.11625 dim|0.099699 gray|0.099699 dim|0.099699 grey|0.099699 silver|0.058691 black|0.036117 antique|0.035509 white|0.035509 misty|0.028961 rose|0.028961 light|0.026285 gray|0.026285 light|0.026285 grey|0.026285 blanched|0.026041 almond|0.026041 papaya|0.024547 whip|0.024547 bisque|0.023984 old|0.020976 lace|0.020976 beige|0.020695 linen|0.020318 floral|0.01779 white|0.01779 corn|0.017718 silk|0.017718 gainsboro|0.017469 ivory|0.01585 sea|0.015715 shell|0.015715 tan|0.014296  "
		}
	}
}
