{
	"add": {
		"doc": {
			"id": "b7abc123f5c05e57067e140669e57df106f95ab0c063836a29490d9c00cd2cce",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Boeing_747_spiral_staircase.jpg/220px-Boeing_747_spiral_staircase.jpg",
				"previous": "On January 15, 1970, First Lady of the United States Pat Nixon christened Pan Am's first 747, at Dulles International Airport (later Washington Dulles International Airport) in the presence of Pan Am chairman Najeeb Halaby. Instead of champagne, red, white, and blue water was sprayed on the aircraft. The 747 entered service on January 22, 1970, on Pan Am's New York–London route;[60] the flight had been planned for the evening of January 21, but engine overheating made the original aircraft unusable. Finding a substitute delayed the flight by more than six hours to the following day.[2]",
				"after": "The 747 enjoyed a fairly smooth introduction into service, overcoming concerns that some airports would not be able to accommodate an aircraft that large.[61] Although technical problems occurred, they were relatively minor and quickly solved.[62] After the aircraft's introduction with Pan Am, other airlines that had bought the 747 to stay competitive began to put their own 747s into service.[63] Boeing estimated that half of the early 747 sales were to airlines desiring the aircraft's long range rather than its payload capacity.[64][65] While the 747 had the lowest potential operating cost per seat, this could only be achieved when the aircraft was fully loaded; costs per seat increased rapidly as occupancy declined. A moderately loaded 747, one with only 70 percent of its seats occupied, used more than 95 percent of the fuel needed by a fully occupied 747.[66]",
			"color": "light|0.1801 slate|0.1801 gray|0.1801 black|0.1611 slate|0.16021 gray|0.16021 dim|0.092063 gray|0.092063 dim|0.092063 grey|0.092063 gray|0.072276 grey|0.072276 dark|0.050128 gray|0.050128 dark|0.050128 grey|0.050128 dark|0.047002 slate|0.047002 gray|0.047002 light|0.033175 steel|0.033175 blue|0.033175 light|0.028938 gray|0.028938 light|0.028938 grey|0.028938 gainsboro|0.027739 silver|0.026579 white|0.011859 smoke|0.011859 steel|0.01173 blue|0.01173 alice|0.011442 blue|0.011442 azure|0.011247 mint|0.0099671 cream|0.0099671 light|0.0093836 cyan|0.0093836 ghost|0.0084041 white|0.0084041 white|0.0073619 snow|0.0072017  "
		}
	}
}
