{
	"add": {
		"doc": {
			"id": "b7ae38279b733c78789ec7f044320c08cb6956ca3282c48bf28fd8ff9863f21b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Suecia_1-054_%3B_Sodra_Bancohuset.jpg/220px-Suecia_1-054_%3B_Sodra_Bancohuset.jpg",
				"previous": "During the Thirty Years' War, Sweden conquered approximately half of the Holy Roman states. Gustav Adolphus planned to become the new Holy Roman Emperor, ruling over a united Scandinavia and the Holy Roman states, but he died at the Battle of Lützen in 1632. After the Battle of Nördlingen, Sweden's only significant military defeat of the war, pro-Swedish sentiment among the German states faded. These German provinces excluded themselves from Swedish power one by one, leaving Sweden with only a few northern German territories: Swedish Pomerania, Bremen-Verden and Wismar.",
				"after": "In the middle of the 17th century Sweden was the third-largest country in Europe by land area, only surpassed by Russia and Spain. Sweden reached its largest territorial extent under the rule of Charles X after the treaty of Roskilde in 1658.[35][36] The foundation of Sweden's success during this period is credited to Gustav I's major changes on the Swedish economy in the 16th century, and his introduction of Protestantism.[37] In the 17th century, Sweden was engaged in many wars, for example with the Polish–Lithuanian Commonwealth, with both sides competing for territories of today's Baltic states, with the disastrous Battle of Kircholm being one of the highlights.[38] One-third of the Finnish population died in the devastating famine that struck the country in 1696.[39] Famine also hit Sweden, killing roughly 10% of Sweden's population.[40]",
			"color": "dim|0.14807 gray|0.14807 dim|0.14807 grey|0.14807 black|0.11766 gray|0.10467 grey|0.10467 dark|0.070161 gray|0.070161 dark|0.070161 grey|0.070161 silver|0.059529 antique|0.055552 white|0.055552 light|0.046895 gray|0.046895 light|0.046895 grey|0.046895 linen|0.040906 gainsboro|0.03347 old|0.031095 lace|0.031095 sea|0.030011 shell|0.030011 misty|0.028181 rose|0.028181 floral|0.025935 white|0.025935 papaya|0.023296 whip|0.023296 ivory|0.017859 beige|0.017024 white|0.016996 smoke|0.016996 tan|0.016105 blanched|0.014701 almond|0.014701 snow|0.014043 bisque|0.012677 corn|0.011543 silk|0.011543 mint|0.010141 cream|0.010141 white|0.0095872 lavender|0.0083841 blush|0.0083841 peach|0.0078303 puff|0.0078303 ghost|0.0058272 white|0.0058272 honeydew|0.0057175  "
		}
	}
}
