{
	"add": {
		"doc": {
			"id": "b7b92f0ca26963b872d5c8eb2f32c53eb50fc0afdf5085f06d7352c3d59c9a48",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Southern_right_whale6.jpg/220px-Southern_right_whale6.jpg",
				"previous": "The right whales were first classified in the genus Balaena in 1758 by Carolus Linnaeus, who at the time considered all of the right whales (including the bowhead) as a single species. Through the 1800s and 1900s, in fact, the family Balaenidae has been the subject of great taxonometric debate. Authorities have repeatedly recategorized the three populations of right whale plus the bowhead whale, as one, two, three or four species, either in a single genus or in two separate genera. In the early whaling days, they were all thought to be a single species, Balaena mysticetus. Eventually, it was recognized that bowheads and right whales were in fact different, and John Edward Gray proposed the genus Eubalaena for the right whale in 1864. Later, morphological factors such as differences in the skull shape of northern and southern right whales indicated at least two species of right whale—one in the Northern Hemisphere, the other in the Southern Ocean.[16] As recently as 1998, Rice, in his comprehensive and otherwise authoritative classification, Marine mammals of the world: systematics and distribution, listed just two species: Balaena glacialis (the right whales) and Balaena mysticetus (the bowheads).[17]",
				"after": "In 2000, two studies of DNA samples from each of the whale populations concluded the northern and southern populations of right whale should be considered separate species. What some scientists found more surprising was the discovery that the North Pacific and North Atlantic populations are also distinct, and that the North Pacific species is more closely related to the southern right whale than to the North Atlantic right whale.[18][19] The authors of one of these studies concluded that these species have not interbred for between 3 million and 12 million years.[19]",
			"color": "steel|0.62455 blue|0.62455 black|0.12117 dark|0.040188 gray|0.040188 dark|0.040188 grey|0.040188 dim|0.039702 gray|0.039702 dim|0.039702 grey|0.039702 gray|0.030936 grey|0.030936 silver|0.024757 light|0.021647 slate|0.021647 gray|0.021647 slate|0.021183 gray|0.021183 light|0.017839 gray|0.017839 light|0.017839 grey|0.017839 gainsboro|0.013687 light|0.0086066 steel|0.0086066 blue|0.0086066  "
		}
	}
}
