{
	"add": {
		"doc": {
			"id": "b7c05843e371e012e18934a2b3e3fa76aec837615d06df528fd86cc5159579c6",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/D%C3%BCrer_rhino_full.png/120px-D%C3%BCrer_rhino_full.png",
				"previous": "Portal:Arts/Featured article/7",
				"after": "Dürer's Rhinoceros is the name commonly given to a woodcut carved by Albrecht Dürer in 1515. The image was based on a written description and brief sketch by an unknown artist of an Indian rhinoceros that had arrived in Lisbon earlier that year. Dürer never saw the actual rhinoceros, which was the first living example seen in Europe since Roman times. In late 1515, the King of Portugal, Manuel I, sent the animal as a gift for Pope Leo X, but it died in a shipwreck off the coast of Italy in early 1516. A live rhinoceros was not seen again in Europe until a second specimen arrived from India at the court of Phillip II in Spain in around 1579. Despite its anatomical inaccuracies, Dürer's woodcut became very popular in Europe and was copied many times in the following three centuries. It was regarded as a true representation of a rhinoceros into the late 18th century. Eventually, it was supplanted by more realistic drawings and paintings, particularly paintings and engravings of Clara the rhinoceros, who toured Europe in the 1740s and 1750s. It has been said of Dürer's woodcut that \"probably no animal picture has exerted such a profound influence on the arts\".",
			"color": "dark|0.20442 gray|0.20442 dark|0.20442 grey|0.20442 silver|0.16977 gray|0.13723 grey|0.13723 light|0.11899 gray|0.11899 light|0.11899 grey|0.11899 dim|0.088493 gray|0.088493 dim|0.088493 grey|0.088493 gainsboro|0.076481 linen|0.032053 antique|0.027602 white|0.027602 sea|0.02031 shell|0.02031 old|0.019353 lace|0.019353 floral|0.017475 white|0.017475 white|0.017162 smoke|0.017162 snow|0.012195 ivory|0.011383 mint|0.010924 cream|0.010924 white|0.0089586 beige|0.0059536 azure|0.0050589 ghost|0.0047999 white|0.0047999  "
		}
	}
}
