{
	"add": {
		"doc": {
			"id": "b7d8bf3abf804975d6dd2ba1abca02771f2eff0b41d94915bd51e91a29a11c94",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Daspletosaurus_new_species.jpg/220px-Daspletosaurus_new_species.jpg",
				"previous": "Along with the holotype, Russell designated a specimen collected by Barnum Brown in 1913 as the paratype of D. torosus. This specimen (AMNH 5438) consists of parts of the hindleg, the pelvis and some of its associated vertebrae. It was discovered in the upper part of the Oldman Formation in Alberta.[7] This upper section has since been renamed the Dinosaur Park Formation, which dates back to the middle Campanian, between 76.5 and 74.8 million years ago.[17] Daspletosaurus fossils are known specifically from the middle to upper section of the formation, between 75.6 and 75.0 million years ago.[18] In 1914, Brown collected a nearly complete skeleton and skull; forty years later his American Museum of Natural History sold this specimen to the Field Museum of Natural History in Chicago. It was mounted for display in Chicago and labeled as Albertosaurus libratus for many years, but after several skull features were later found to be modeled in plaster, including most of the teeth, the specimen (FMNH PR308) was reassigned to Daspletosaurus.[6] A total of eight specimens have been collected from the Dinosaur Park Formation over the years since, most of them within the boundaries of Dinosaur Provincial Park. Phil Currie believes that the Dinosaur Park specimens represent a new species of Daspletosaurus, distinguished by certain features of the skull. Pictures of this new species have been published, but it still awaits a name and full description in print.[7]",
				"after": "A new tyrannosaurid specimen (OMNH 10131), including skull fragments, ribs and parts of the hindlimb, was reported from New Mexico in 1990 and assigned to the now-defunct genus Aublysodon.[19] Many later authors have reassigned this specimen, along with a few others from New Mexico, to yet another unnamed species of Daspletosaurus.[7][8][20] However, research published in 2010 showed that this species, from the Hunter Wash Member of the Kirtland Formation, is actually a more primitive tyrannosauroid, and was classified in the genus Bistahieversor.[21] There is currently disagreement over the age of the Kirtland Formation, with some workers claiming a late Campanian age,[22] while others suggest a younger age in the early Maastrichtian stage.[23]",
			"color": "dim|0.24903 gray|0.24903 dim|0.24903 grey|0.24903 gray|0.17983 grey|0.17983 dark|0.10984 gray|0.10984 dark|0.10984 grey|0.10984 silver|0.077139 light|0.072975 gray|0.072975 light|0.072975 grey|0.072975 gainsboro|0.063292 linen|0.026508 white|0.025583 smoke|0.025583 slate|0.022488 gray|0.022488 sea|0.021934 shell|0.021934 light|0.017986 slate|0.017986 gray|0.017986 snow|0.017266 floral|0.016671 white|0.016671 white|0.012573 ghost|0.01257 white|0.01257 mint|0.011974 cream|0.011974 old|0.011467 lace|0.011467 lavender|0.011289 blush|0.011289 alice|0.010145 blue|0.010145 antique|0.0063717 white|0.0063717 azure|0.0056194 ivory|0.0049583  "
		}
	}
}
