{
	"add": {
		"doc": {
			"id": "b7db1b517af467dc3b78826927f6d0f07fb3200a7b8d54ae8bc0532616f24f97",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Portrait_Badge_of_Emmeline_Pankhurst_-_c1909_-_Museum_of_London.jpg/170px-Portrait_Badge_of_Emmeline_Pankhurst_-_c1909_-_Museum_of_London.jpg",
				"previous": "On 21 June 1908 500,000 activists rallied in Hyde Park to demand votes for women; Asquith and leading MPs responded with indifference. Angered by this intransigence and abusive police activity, some WSPU members increased the severity of their actions. Soon after the rally, twelve women gathered in Parliament Square and tried to deliver speeches for women's suffrage. Police officers seized several of the speakers and pushed them into a crowd of opponents who had gathered nearby. Frustrated, two WSPU members – Edith New and Mary Leigh – went to 10 Downing Street and hurled rocks at the windows of the Prime Minister's home. They insisted their act was independent of WSPU command, but Pankhurst expressed her approval of the action. When a magistrate sentenced New and Leigh to two months' imprisonment, Pankhurst reminded the court of how various male political agitators had broken windows to win legal and civil rights throughout Britain's history.[70]",
				"after": "In 1909 the hunger strike was added to the WSPU's repertoire of resistance. On 24 June Marion Wallace Dunlop was arrested for writing an excerpt from the Bill of Rights (1688 or 1689) on a wall in the House of Commons. Angered by the conditions of the jail, Dunlop went on a hunger strike. When it proved effective, fourteen women imprisoned for smashing windows began to fast. WSPU members soon became known around the country for holding prolonged hunger strikes to protest their incarceration. Prison authorities frequently force-fed the women, using tubes inserted through the nose or mouth. The painful techniques (which, in the case of mouth-feeding, required the use of steel gags to force the mouth open) brought condemnation from suffragists and medical professionals.[71]",
			"color": "tan|0.10459 gainsboro|0.067857 dark|0.061342 gray|0.061342 dark|0.061342 grey|0.061342 dim|0.06024 gray|0.06024 dim|0.06024 grey|0.06024 lavender|0.055888 white|0.055112 smoke|0.055112 lavender|0.053568 blush|0.053568 alice|0.05324 blue|0.05324 ghost|0.053221 white|0.053221 gray|0.051829 grey|0.051829 snow|0.050971 white|0.048599 sea|0.047134 shell|0.047134 azure|0.044478 light|0.034659 gray|0.034659 light|0.034659 grey|0.034659 silver|0.031611 wheat|0.015101 black|0.014101 bisque|0.011917 antique|0.011308 white|0.011308 blanched|0.0088236 almond|0.0088236 mint|0.0084703 cream|0.0084703 burly|0.0076386 wood|0.0076386 papaya|0.00675 whip|0.00675 dark|0.0061741 slate|0.0061741 gray|0.0061741  "
		}
	}
}
