{
	"add": {
		"doc": {
			"id": "b7e9903e71d5b119267715790325cd7461c549b1684db17ab846ef02a71bbeba",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Santaanna1.JPG/220px-Santaanna1.JPG",
				"previous": "After hearing that the Mexican army commander in Nacogdoches, José de las Piedras, had demanded that all residents in his area surrender their arms, Bowie cut short a visit to Natchez in July 1832 to return to Texas.[25] On August 2, 1832, he joined a group of other Texans and marched into Nacogdoches to \"present their demands\" to Piedras.[65] Before the group reached the building housing the town officials, they were attacked by a force of 100 Mexican cavalry. The Texans returned fire and the Battle of Nacogdoches began. After the cavalry retreated, they initiated a siege of the garrison.[65] After a second battle, in which Piedras lost 33 men, the Mexican army evacuated during the night. Bowie and 18 companions ambushed the fleeing army and, after Piedras fled, marched the soldiers back to Nacogdoches.[25] Bowie later served as a delegate to the Convention of 1833, which formally requested that Texas become its own state within the Mexican federation.[69]",
				"after": "Several months later, a cholera epidemic struck Texas. Fearing the disease would reach San Antonio, Bowie sent his pregnant wife and their daughter to the family estate in Monclova in the company of her parents and brother. The cholera epidemic instead struck Monclova, and between September 6 and September 14, Ursula, their children, her brother, and her parents all died of the disease. Bowie, on business in Natchez, heard of his family's deaths in November. From then on, he drank heavily and became \"careless in his dress.\"[69]",
			"color": "indian|0.19798 red|0.19798 rosy|0.15753 brown|0.15753 salmon|0.096683 dark|0.095796 salmon|0.095796 brown|0.091597 black|0.081604 light|0.032287 coral|0.032287 tomato|0.030335 misty|0.030249 rose|0.030249 sienna|0.02253 firebrick|0.018804 peach|0.016391 puff|0.016391  "
		}
	}
}
