{
	"add": {
		"doc": {
			"id": "b7edf64afe6ada6891e0eea1ae7c588ab29607a1b5dea211e3102e875f18dc13",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/England_diocese_map_pre-925.svg/220px-England_diocese_map_pre-925.svg.png",
				"previous": "According to the Anglo-Saxon Chronicles, Viking raiders struck England in 793 and raided Lindisfarne, the monastery that held Saint Cuthbert’s relics. The raiders killed the monks and captured the valuables. This raid marks the beginning of the \"Viking Age of Invasion\", made possible by the Viking longship. There was great but sporadic violence from the last decade of the 8th century on England’s northern and eastern shores: Viking raids continued on a small scale across coastal England. While the initial raiding groups were small, it is believed that a great amount of planning was involved. The Norwegians raided during the winter between 840 and 841, rather than the usual summer, having waited on an island off Ireland. In 850 Vikings overwintered for the first time in England, on the island of Thanet, Kent. In 854 a raiding party overwintered a second time, at the Isle of Sheppey in the Thames estuary. In 864 they reverted to Thanet for their winter encampment.[20]",
				"after": "The following year the Great Heathen Army led by the Brothers Ivar the Boneless, Halfdan and Ubba, and also by another Viking Guthrum, arrived in East Anglia. They proceeded to cross England into Northumbria and captured York, establishing the Viking community of Jorvik, where some settled as farmers and craftsmen. Most of the English kingdoms, being in turmoil, could not stand against the Vikings. In 867 Northumbria became the northern kingdom of the coalescing Danelaw, after its conquest by the brothers Halfdan Ragnarsson and Ivar the Boneless, who installed an Englishman, Ecgberht, as a puppet king. By 870 the \"Great Summer Army\" arrived in England, led by a Viking leader called Bagsecg and his Five Earls. Aided by the Great Heathen Army (which had already overrun much of England from its base in Jorvik), Bagsecg's forces, and Halfdan's forces (through an alliance), the combined Viking forces raided much of England until 871, when they planned an invasion of Wessex. On 8 January 871, Bagsecg was killed at the Battle of Ashdown along with his Earls. As a result, many of the Vikings returned to northern England, where Jorvic had become the centre of the Viking kingdom but Alfred of Wessex managed to keep them out of his country. Alfred and his successors continued to drive back the Viking frontier and take York. A new wave of Norwegian Vikings appeared in England in 947 when Erik Bloodaxe captured York.",
			"color": "light|0.3228 steel|0.3228 blue|0.3228 dark|0.21452 gray|0.21452 dark|0.21452 grey|0.21452 rosy|0.10122 brown|0.10122 thistle|0.097842 silver|0.084363 dim|0.038221 gray|0.038221 dim|0.038221 grey|0.038221 light|0.031512 slate|0.031512 gray|0.031512 gray|0.030822 grey|0.030822 lavender|0.023676 slate|0.017633 gray|0.017633 light|0.010896 gray|0.010896 light|0.010896 grey|0.010896 red|0.0082837  "
		}
	}
}
