{
	"add": {
		"doc": {
			"id": "b81055c7ec3ac05340ba4dd511277f007d2335918168e2b91f09dc7c2703a961",
			"url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/2f/Burj_Khalifa_building.jpg/170px-Burj_Khalifa_building.jpg",
			"previous": [],
				"after": "Dubai has a rich collection of buildings and structures of various architectural styles. Many modern interpretations of Islamic architecture can be found here, due to a boom in construction and architectural innovation in the Arab World in general, and in Dubai in particular, supported not only by top Arab or international architectural and engineering design firms such as Al Hashemi and Aedas, but also by top firms of New York and Chicago.[140] As a result of this boom, modern Islamic – and world – architecture has literally been taken to new levels in skyscraper building design and technology. Dubai now has more completed or topped-out skyscrapers higher than 2/3 km, 1/3 km, or 1/4 km than any other city. A culmination point was reached in 2010 with the completion of the Burj Khalifa (Khalifa Tower), now by far the world's tallest building at 829.8 m (2,722 ft). The Burj Khalifa's design is derived from the patterning systems embodied in Islamic architecture, with the triple-lobed footprint of the building based on an abstracted version of the desert flower hymenocallis which is native to the Dubai region.[141] The completion of the Khalifa Tower, following the construction boom that began in the 1980s, accelerated in the 1990s, and took on a rapid pace of construction unparalled in modern human history during the decade of the 2000s, leaves Dubai with the world's tallest skyline as of 4 January 2010.[142][143] At the Top, Burj Khalifa, the world’s highest observatory deck with an outdoor terrace is one of Dubai’s most popular tourist attractions, with over 1.87 million visitors in 2013.[144]",
			"color": "steel|0.52358 blue|0.52358 gray|0.11017 grey|0.11017 dim|0.10407 gray|0.10407 dim|0.10407 grey|0.10407 dark|0.079851 slate|0.079851 gray|0.079851 dark|0.064065 gray|0.064065 dark|0.064065 grey|0.064065 slate|0.030687 gray|0.030687 light|0.023723 slate|0.023723 gray|0.023723 silver|0.016577 tan|0.013138  "
		}
	}
}
