{
	"add": {
		"doc": {
			"id": "b820e6ce12c42044828879f4571b55fe93ef32976aa111282b872a1bb7eb8003",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/AC-47.jpg/220px-AC-47.jpg",
				"previous": "The AC-47 was a United States Air Force C-47, (the military version of the DC-3) that had been modified by mounting three 7.62 mm General Electric miniguns to fire through two rear window openings and the side cargo door, all on the left (pilot's) side of the aircraft, and the modified craft's primary function was close air support for ground troops. Other armament configurations could also be found on similar C-47-based aircraft around the world. The guns were actuated by a control on the pilot's yoke whereby he could control the guns either individually or together, although gunners were also among the crew to assist with gun failures and similar issues. It could orbit the target for hours, providing suppressing fire over an elliptical area approximately 52 yd (47.5 m) in diameter, placing a round every 2.4 yd (2.2 m) during a three-second burst. The aircraft also carried flares it could drop to illuminate the battleground.",
				"after": "The AC-47 had no previous design to gauge how successful it would be because it was the first of its kind. The USAF found itself in a precarious situation when requests for additional gunships began to come in because it simply lacked miniguns to fit additional aircraft after the first two conversions. The next four aircraft were equipped with 10 .30 caliber AN/M2 machine guns. However, these weapons, using World War II and Korean War ammunition stocks, were quickly discovered to jam easily, produce large amounts of gases from firing, and, even in 10-gun groups, only provide the density of fire of a single minigun. All four of these aircraft were retrofitted to the standard armament configuration when additional miniguns arrived.",
			"color": "light|0.50033 slate|0.50033 gray|0.50033 slate|0.21061 gray|0.21061 light|0.0823 steel|0.0823 blue|0.0823 black|0.062458 dark|0.045221 gray|0.045221 dark|0.045221 grey|0.045221 thistle|0.03142 dim|0.019107 gray|0.019107 dim|0.019107 grey|0.019107  "
		}
	}
}
