{
	"add": {
		"doc": {
			"id": "b837e0654a53f637b1b334c7cc987433fd96d862b5ca101b6a3936d7d7f4d06b",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Review_on_Chilean_battleship_Latorre_AG208-AA-158-NN-2-1339.jpg/220px-Review_on_Chilean_battleship_Latorre_AG208-AA-158-NN-2-1339.jpg",
				"previous": "5 September marked a turn in the rebels' fortunes, despite the arrival of the southern fleet a day earlier. All of their land gains were taken by government forces, leaving only the fleet in the mutineers' hands. By the next day, an air strike was mounted by government forces. The only damage done was to the submarine H4, which was unable to dive, but at least one bomb landed about 50 yards (46 m) from Almirante Latorre. Despite the scant damage, the attack broke the mutineers' spirits; they quickly offered to send a delegation to Santiago to discuss terms, but the government, bolstered by its land victories, refused. While the mutiny devolved into arguing and anarchy, individual ships began leaving the bay and setting sail for Valparaíso, and the rest soon followed. Almirante Latorre ended up in the Bay of Tongoy with Blanco Encalada. Seven crewmen on the dreadnought received death sentences, later commuted to life in prison.[42][43][44]",
				"after": "Still in the midst of the depression, Almirante Latorre was deactivated at Talcahuano in 1933 to lessen government expenditures,[45] and only a caretaker crew was assigned to tend to the mothballed ship into the mid-1930s.[46][G] In a 1937 refit in the Talcahuano dockyard, the aircraft catapult was taken off and anti-aircraft weaponry was added.[47] Almirante Latorre was never fully modernized, however, and by the Second World War her main battery was comparatively short-ranged and her armor protection, designed before the \"all or nothing\" principle was put into practice, was wholly inadequate.[48] Nevertheless, soon after Japan's attack on Pearl Harbor, the United States approached the Chilean naval attaché and the vice admiral heading Chile's naval commission to the United States with the aim of purchasing Almirante Latorre and a few destroyers to bolster the United States' navy. The offer was declined,[32][49] and Almirante Latorre was used for neutrality patrols during the Second World War.[18]",
			"color": "dim|0.56579 gray|0.56579 dim|0.56579 grey|0.56579 gray|0.29506 grey|0.29506 black|0.057398 dark|0.045177 gray|0.045177 dark|0.045177 grey|0.045177 silver|0.013601 light|0.008036 gray|0.008036 light|0.008036 grey|0.008036 slate|0.0069825 gray|0.0069825 gainsboro|0.005277  "
		}
	}
}
