{
	"add": {
		"doc": {
			"id": "b83760346ab5efbed66076945f479f1917dd08017290d4f16e29a0129d39454a",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Atmospheric_Water_Vapor_Mean.2005.030.jpg/220px-Atmospheric_Water_Vapor_Mean.2005.030.jpg",
			"previous": [],
				"after": "Air is mainly composed of nitrogen, oxygen, and argon, which together constitute the major gases of the atmosphere. Water vapor accounts for roughly 0.25% of the atmosphere by mass. The concentration of water vapor (a greenhouse gas) varies significantly from around 10 ppmv in the coldest portions of the atmosphere to as much as 5% by volume in hot, humid air masses, and concentrations of other atmospheric gases are typically provided for dry air without any water vapor.[4] The remaining gases are often referred to as trace gases,[5] among which are the greenhouse gases such as carbon dioxide, methane, nitrous oxide, and ozone. Filtered air includes trace amounts of many other chemical compounds. Many substances of natural origin may be present in locally and seasonally variable small amounts as aerosols in an unfiltered air sample, including dust of mineral and organic composition, pollen and spores, sea spray, and volcanic ash. Various industrial pollutants also may be present as gases or aerosols, such as chlorine (elemental or in compounds), fluorine compounds and elemental mercury vapor. Sulfur compounds such as hydrogen sulfide and sulfur dioxide (SO2) may be derived from natural sources or from industrial air pollution.",
			"color": "black|0.52941 dark|0.04107 magenta|0.04107 midnight|0.035642 blue|0.035642 purple|0.029589 medium|0.026582 blue|0.026582 lime|0.025793 green|0.025793 indigo|0.021762 medium|0.018733 sea|0.018733 green|0.018733 sea|0.017944 green|0.017944 dark|0.013903 orchid|0.013903 forest|0.013622 green|0.013622 steel|0.012434 blue|0.012434 royal|0.011708 blue|0.011708 dark|0.011622 green|0.011622 dark|0.011604 cyan|0.011604 dark|0.011509 slate|0.011509 gray|0.011509 navy|0.01111 dark|0.01077 blue|0.01077 teal|0.010026 olive|0.0086793 drab|0.0086793 yellow|0.0085705 green|0.0085705 dim|0.0083211 gray|0.0083211 dim|0.0083211 grey|0.0083211 green|0.007659 yellow|0.007659 light|0.0073461 sea|0.0073461 green|0.0073461  "
		}
	}
}
