{
	"add": {
		"doc": {
			"id": "b842256e403cac2aa6158ed09c5da85ed48f687e95afc18ef66752384f6cff08",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Bayeux_Tapestry_Horses_in_Battle_of_Hastings.jpg/350px-Bayeux_Tapestry_Horses_in_Battle_of_Hastings.jpg",
				"previous": "After defeating Harald Hardrada and Tostig, Harold left much of his army in the north, including Morcar and Edwin, and marched the rest south to deal with the threatened Norman invasion.[80] He probably learned of William's landing while he was travelling south. Harold stopped in London, and was there for about a week before marching to Hastings, so it is likely that he spent about a week on his march south, averaging about 27 miles (43 kilometres) per day,[81] for the distance of approximately 200 miles (320 kilometres).[82] Although Harold attempted to surprise the Normans, William's scouts reported the English arrival to the duke. The exact events preceding the battle are obscure, with contradictory accounts in the sources, but all agree that William led his army from his castle and advanced towards the enemy.[83] Harold had taken a defensive position at the top of Senlac Hill (present-day Battle, East Sussex), about 6 miles (9.7 kilometres) from William's castle at Hastings.[84]",
				"after": "The battle began at about 9 am on 14 October and lasted all day, but while a broad outline is known, the exact events are obscured by contradictory accounts in the sources.[85] Although the numbers on each side were about equal, William had both cavalry and infantry, including many archers, while Harold had only foot soldiers and few, if any, archers.[86] The English soldiers formed up as a shield wall along the ridge and were at first so effective that William's army was thrown back with heavy casualties. Some of William's Breton troops panicked and fled, and some of the English troops appear to have pursued the fleeing Bretons until they themselves were attacked and destroyed by Norman cavalry. During the Bretons' flight rumours swept through the Norman forces that the duke had been killed, but William succeeded in rallying his troops. Two further Norman retreats were feigned, to once again draw the English into pursuit and expose them to repeated attacks by the Norman cavalry.[87] The available sources are more confused about events in the afternoon, but it appears that the decisive event was Harold's death, about which differing stories are told. William of Jumièges claimed that Harold was killed by the duke. The Bayeux Tapestry has been claimed to show Harold's death by an arrow to the eye, but that may be a later reworking of the tapestry to conform to 12th-century stories in which Harold was slain by an arrow wound to the head.[88]",
			"color": "pale|0.078538 golden|0.078538 rod|0.078538 black|0.074568 dim|0.069881 gray|0.069881 dim|0.069881 grey|0.069881 gray|0.053291 grey|0.053291 dark|0.04402 gray|0.04402 dark|0.04402 grey|0.04402 tan|0.040496 dark|0.040261 khaki|0.040261 lemon|0.036594 chiffon|0.036594 light|0.032336 golden|0.032336 rod|0.032336 yellow|0.032336 khaki|0.031809 beige|0.029455 old|0.02939 lace|0.02939 ivory|0.029129 corn|0.028007 silk|0.028007 silver|0.027929 floral|0.027859 white|0.027859 light|0.027002 yellow|0.027002 linen|0.026321 antique|0.024274 white|0.024274 sea|0.022849 shell|0.022849 wheat|0.021259 light|0.020749 gray|0.020749 light|0.020749 grey|0.020749 papaya|0.020569 whip|0.020569 mint|0.017478 cream|0.017478 honeydew|0.016367 white|0.016011 smoke|0.016011 gainsboro|0.015917 snow|0.015461 white|0.015067 blanched|0.012462 almond|0.012462 burly|0.011989 wood|0.011989 moccasin|0.0085171  "
		}
	}
}
