{
	"add": {
		"doc": {
			"id": "b8531f039d0fd8f90cef4b719472109ca63909a8e6ed292fd08e712bb6b8ca46",
			"url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Corridor_on_Air_Force_One.jpg/220px-Corridor_on_Air_Force_One.jpg",
			"previous": [],
				"after": "The front of the aircraft is referred to as the \"White House\" of the aircraft.[5] The president's executive suite includes sleeping quarters with two couches that can be converted into beds, lavatory and shower, vanity, double sink, and a private office, or the president's \"Oval Office aboard Air Force One\". If necessary, the president can address the nation from the office. This capability was added after the September 11 attacks, during which the aircraft had to land at Barksdale Air Force Base in order for President George W. Bush to address the nation.[7] These offices, including the president's suite, are mostly located on the starboard (right) side, and a long corridor runs along the port (left) side. There is an area along the corridor for two Secret Service agents.[citation needed] The aircraft also contains a conference room, originally designed as a situation room but now used for meeting with staff while traveling. This room includes a 50-inch plasma screen television which can be used for teleconferencing. The aircraft has fully equipped office areas with telecommunication systems (including 87 telephones and 19 televisions).[5]",
			"color": "black|0.33707 light|0.093412 gray|0.093412 light|0.093412 grey|0.093412 light|0.041848 cyan|0.041848 powder|0.041031 blue|0.041031 azure|0.03828 silver|0.038097 honeydew|0.037551 mint|0.037037 cream|0.037037 dark|0.035155 gray|0.035155 dark|0.035155 grey|0.035155 gainsboro|0.031802 white|0.028189 smoke|0.028189 alice|0.026889 blue|0.026889 white|0.021686 floral|0.019852 white|0.019852 snow|0.017437 ghost|0.017338 white|0.017338 beige|0.015764 ivory|0.014609 sea|0.014352 shell|0.014352 dim|0.013098 gray|0.013098 dim|0.013098 grey|0.013098  "
		}
	}
}
